[
  {
    "start": 4.115,
    "end": 7.64,
    "text": " Hello, everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.26,
    "end": 12.806,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I have the pleasure to chat to Alexander Orobija.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.327,
    "end": 20.476,
    "text": "Professor Orobija is an assistant professor of computer science at Rochester Institute of Technology, where he directs the Neural Adaptive Computing Laboratory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.077,
    "end": 31.27,
    "text": "His work focuses on developing new learning procedures and computational architectures that embody various properties, biological neurocircuitry, and are guided by theories of mind and brain functionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.705,
    "end": 47.361,
    "text": " Last year, he published the paper Mortal Computation, a Foundation for Biomimetic Intelligence with Carl Friston, which grounded the mortal computation thesis in the active inference framework, in which they argued that active inference might prove useful in guiding the construction of computational systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.262,
    "end": 50.625,
    "text": "Alex, thank you so much for joining me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.645,
    "end": 61.476,
    "text": "It's been a little while since we've done one of these, so I'm going to be a little bit rusty, as exemplified by my pronunciation of the word laboratory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.401,
    "end": 62.962,
    "text": " Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.042,
    "end": 64.284,
    "text": "I normally just go for lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.784,
    "end": 65.525,
    "text": "How are you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.585,
    "end": 66.987,
    "text": "I'm doing great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 67.048,
    "end": 68.189,
    "text": "Thank you for having me on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.57,
    "end": 69.711,
    "text": "No, you're very welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.072,
    "end": 71.394,
    "text": "You can call it laboratory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.414,
    "end": 73.096,
    "text": "It sounds nice and formal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.116,
    "end": 73.657,
    "text": "I like it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.677,
    "end": 75.019,
    "text": "Yeah, laboratory, lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.24,
    "end": 76.481,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.541,
    "end": 83.05,
    "text": "Well, before we dive into that paper, I wanted to ask, you're kind of coming from a computational background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.572,
    "end": 91.682,
    "text": "I've never actually asked this question first up to a guest, but it struck me that I probably should, which is how did you come across Active Inference as a framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.202,
    "end": 94.725,
    "text": " Oh, that's a nice question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.406,
    "end": 111.088,
    "text": "Well, it was a few years ago, and the short compressed version of that is that I was working with some colleagues in the imaging science department here at RIT.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.271,
    "end": 114.598,
    "text": " They do eye tracking and cognitive science research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.119,
    "end": 120.791,
    "text": "I also have a cognitive science background or partial background in my grad school years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.833,
    "end": 127.845,
    "text": "And so as we were talking about building computational models for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 127.825,
    "end": 149.31,
    "text": " eye tracking problems we we ended up settling on this reinforcement learning dynamic control formulation of the particular problem we were solving and i had been long thinking about biological process models for reinforcement learning control and so i was already aware",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.05,
    "end": 152.713,
    "text": " for a very long time of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.733,
    "end": 160.803,
    "text": "Because I'm a predictive coding researcher, I like to also pitch that as something I have quite a body of work, been building a body of work on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.444,
    "end": 164.347,
    "text": "And so active inference is like an extension of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.387,
    "end": 173.458,
    "text": "It's basically, let me put action into this process and actively sample the environment to facilitate my self-evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.438,
    "end": 179.306,
    "text": " And so it just kind of made sense that we would maybe look at the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.366,
    "end": 183.832,
    "text": "Originally, we wanted to build predictive coding models of our reinforcement learning system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.373,
    "end": 185.875,
    "text": "And then we said, well, wait a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.816,
    "end": 188.899,
    "text": "Exploration is going to be a difficult component here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.32,
    "end": 190.762,
    "text": "And that's what active inference brings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.122,
    "end": 198.772,
    "text": "One of the big things it brings to the table, to use Carl's phrase, which is this epistemic forging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.812,
    "end": 202.197,
    "text": "The idea that we're doing intelligent exploration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.177,
    "end": 222.126,
    "text": " driven by our surprisal and so it just kind of made sense to investigate this framework in a in a further further way uh and then since then what was nice about that group is that uh my my colleagues uh weren't very familiar with uh predictive coding so i gave them a talk and then we wanted to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.106,
    "end": 223.689,
    "text": " understand active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 224.25,
    "end": 228.058,
    "text": "We had a little reading group that we established with the grad students and the other faculty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.24,
    "end": 236.755,
    "text": "We forced ourselves to dive a bit deeper into, for example, Carl's work, Chris Buckley's work as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.095,
    "end": 240.081,
    "text": "I was already familiar with Chris even before I actually got to meet him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.061,
    "end": 266.794,
    "text": " uh years later um and then one of uh one of my primary grad students uh george he was uh actually building some active inference models uh and then we effectively settled on a version of that in our eye tracking problem and actually that led to a really nice article about last year with george in frontiers of computational neuroscience where we actually published a little model that did very simple active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.774,
    "end": 271.686,
    "text": " in a gaze modeling task and a very simple tracking task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.726,
    "end": 272.628,
    "text": "So it was really nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.908,
    "end": 282.471,
    "text": "And yeah, and then I guess to wrap up that story without waxing too much about my past, because of that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 282.451,
    "end": 307.354,
    "text": " and my fascination with predictive coding circuitry and biological modeling, I sort of branched off in parallel to, well, George was working on that project, to say, why isn't active inference, even though Carl has presented it in several ways, in terms of predictive coding, why aren't we building things in this very, very raw, low-level model, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.374,
    "end": 310.737,
    "text": "Because the idea is a lot of active inference is back propagation of errors,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.717,
    "end": 340.487,
    "text": " deep neural networks great idea gets you to scale it up um but i have a long history of being at odds with back propagation and uh in the non-biological ways we do deep learning and so i had a series of papers over the last few years where uh i was saying uh let's do active inference uh completely wholesale in terms of predictive coding and so that that eventually accumulated in a robotic control paper i believe that got published beginning of last year too",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.467,
    "end": 344.453,
    "text": " And that was really nice because that's like completely done in terms of predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.375,
    "end": 347.177,
    "text": "So that's, I think I'll stop there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.197,
    "end": 363.302,
    "text": "That's sort of how I found my way into the deep active inference corollary of the free energy principle, which I've already danced over the years by saying that the models that I build are doing like an approximate version of their original free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 364.227,
    "end": 364.988,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.008,
    "end": 366.971,
    "text": "Yeah, you bought, there's a lot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.892,
    "end": 368.693,
    "text": "I think it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.713,
    "end": 370.715,
    "text": "Yeah, you know, in the in the best way possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.536,
    "end": 380.668,
    "text": "There's a lot there in so far as I guess, free, free energy principle and active inference is kind of hierarchical in and of itself as a theoretical framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.189,
    "end": 383.352,
    "text": "Because yes, we're minimizing our variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.372,
    "end": 389.88,
    "text": "But the way that we're doing that is kind of still up for grabs, whether it's predictive processing, in continuous state spaces, whether it's a kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.248,
    "end": 394.252,
    "text": " more message passing scheme, like a POMDP scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.852,
    "end": 399.977,
    "text": "And I think people don't realize that those debates or those theoretical frameworks are still getting fleshed out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.258,
    "end": 410.627,
    "text": "So it makes sense why it is totally viable to push in one direction, maybe against back propagation and pro predictive coding, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.108,
    "end": 413.51,
    "text": "You also brought up reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.57,
    "end": 419.395,
    "text": "I'd like to backtrack to that later on in the conversation, because I'm sure you'll know far more than I do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.695,
    "end": 426.308,
    "text": " There's kind of this live debate, again, still whether reinforcement learning is going to get us there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.15,
    "end": 430.477,
    "text": "And we can talk about the developments in that domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.319,
    "end": 438.413,
    "text": "But as I mentioned in my introduction, really what I want to speak about is this paper, Mortal Computation, a Foundation for Biomimetic Intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.405,
    "end": 440.887,
    "text": " which I got to say, I really, really loved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.208,
    "end": 443.711,
    "text": "A reason why I wanted to have you on is because I really, really enjoyed that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.731,
    "end": 457.15,
    "text": "I'm coming at this from a sort of cognitive science philosophy background, and I thought it was really impressive the way that you managed to integrate loads of different frameworks from sort of pure machine learning and physics to philosophy, phenomenology, and cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.731,
    "end": 460.014,
    "text": "So there's going to be loads for us to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.735,
    "end": 464.08,
    "text": "Before we sort of dive into the details, I'm sure plenty of people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.6,
    "end": 467.824,
    "text": " have heard the, out of the how many words are there in this title?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.904,
    "end": 468.285,
    "text": "Seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.745,
    "end": 470.367,
    "text": "They might be a bit confused about a couple of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.427,
    "end": 474.132,
    "text": "So two questions, feel free to take them in whatever order you wish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.653,
    "end": 477.476,
    "text": "The first is, what do you mean by mortal computation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.257,
    "end": 481.261,
    "text": "And what is biomimetic intelligence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.142,
    "end": 482.543,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.304,
    "end": 485.927,
    "text": "Yeah, that's a good way to start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.908,
    "end": 490.793,
    "text": "These terms might not be thrown around enough in enough fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.975,
    "end": 507.921,
    "text": " um so biomimetic intelligence you some might have heard of biomimicry right which is the idea we're copying uh that is that which is biotic or biological or natural and the idea is that we look to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.12,
    "end": 537.267,
    "text": " natural organisms maybe animals humans even very very simple life forms as you know you brought up in the paper um there's we use a lot of different examples to exemplify concepts and the idea of biomimetic intelligence as we say well for example an animal is intelligent is able to engage in certain behavior it is able to adapt to certain aspects of its environment it's able to forage it's able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.247,
    "end": 565.836,
    "text": " uh do a whole variety of cognitive tasks and um the idea of biomimetic intelligence is that in the sciences of the artificial with an art uh what do you call it a technological artifact uh something that isn't maybe naturally we would argue biotic it is in silico uh or uh you know non-biological material can we get this object to emulate or simulate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.816,
    "end": 572.122,
    "text": " various properties and aspects of that biotic organism's behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.462,
    "end": 575.285,
    "text": "So that is where the biomimicry comes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.325,
    "end": 594.743,
    "text": "We are sort of copying that which we have observed in nature, something that is natural, and trying to instill this in some mechanical computational fashion in a technological artifact that is not grounded in that natural biotic kind of setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 594.723,
    "end": 599.932,
    "text": " So that's broadly what you could say is biomimetic intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.092,
    "end": 607.164,
    "text": "And of course, you could also take that another step further and think of artificial intelligence in its own very word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.305,
    "end": 614.197,
    "text": "Artificial means we are really building something that is essentially divorced from what we would call natural or biological.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.257,
    "end": 617.322,
    "text": "This is in the in silico systems that we have today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.302,
    "end": 635.293,
    "text": " Today, biometric intelligence says, well, maybe we should move a little towards what we would call naturalistic artificial intelligence, something that draws its inspiration at the very least, if not maybe faithfully modeling, because there's also different degrees of how close you get to biology and nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.746,
    "end": 649.175,
    "text": " And can we construct artificial systems that are intelligent and adaptive that maybe, for example, emulate what a cat would do when it's in its natural environment and trying to, for example, hunt for mice or hunt for food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.936,
    "end": 654.987,
    "text": "And then just as a quick fun word to tag on that, because we also use that in the paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.967,
    "end": 667.323,
    "text": " Bionic engineering is actually the application of biomimetic intelligence or the idea of actually formulating this and solving a real-world task or problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.644,
    "end": 670.428,
    "text": "That can also start to bleed and it's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.028,
    "end": 678.018,
    "text": "Part of the other fun of writing this paper is learning a little bit of the history and the origins of words and who defines this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.338,
    "end": 684.366,
    "text": "Everyone has a different definition of these, but bionic intelligence would bleed into hybrid systems like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.346,
    "end": 696.769,
    "text": " oh, human augmented systems, maybe we're creating cyborgs or enhancing a natural organism in some way that they don't have with their own actual body or form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 697.171,
    "end": 704.861,
    "text": " So bionic engineering is a little bit broader, but I just like to tag that on because we also kind of abbreviate them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.162,
    "end": 713.253,
    "text": "Sometimes Carl and I will say biomimetics, but that's just biomimetic intelligence, at least the way we refer to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 713.633,
    "end": 715.796,
    "text": "And then bionics is bionic engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.057,
    "end": 719.281,
    "text": "So I think that'll stop there because we could keep going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.301,
    "end": 724.528,
    "text": "There's a lot of history behind biomimetic intelligence and bionic engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.508,
    "end": 729.962,
    "text": " Some mortal computation, which is at the heart and core of this paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.748,
    "end": 756.726,
    "text": " i mean obviously it takes the entire paper just sort of scope it out i i will first pay homage in respect to my uh my friend jeff jeff hinton he's actually the one that introduced that very phrase uh beginning of december of last year if i recall correctly um in one of his papers so again i work a lot in biological credit assignment how do we train neural systems in a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 756.706,
    "end": 758.508,
    "text": " biologically inspired fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.888,
    "end": 761.952,
    "text": "And so Jeff had a paper on the forward-forward algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.352,
    "end": 768.699,
    "text": "And so I was in correspondence with him about that not too long after that came out and worked on some things of my own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.16,
    "end": 785.658,
    "text": "But he introduced in that paper in about a paragraph or two, just talking about moral computation as just this kind of concept of hardware and the relationship to software and how those two, you know, we treat them in computer science specifically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.698,
    "end": 786.679,
    "text": "And I'm going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.659,
    "end": 808.903,
    "text": " Fold hopefully no one that might watch this might you know get angry at this, but I also fold computer science with cybernetics because you know there's all the computational components and There's a lot of entanglement if you look at their history, too so the idea is that we treat in many sense software as Immortal that means it can be run on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.883,
    "end": 816.154,
    "text": " On any platform, it doesn't really matter the hardware or substrate that it is instantiated on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 816.755,
    "end": 830.115,
    "text": "And again, we tie it in this paper to machine learning and deep learning, which is just effectively a program that is data-driven and tries to adapt based on input that we give to the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.095,
    "end": 832.117,
    "text": " And those are no different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.337,
    "end": 833.999,
    "text": "They're like any other computer program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 834.46,
    "end": 839.105,
    "text": "You could take, for example, ChatGPT or any of the big transformers of today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.145,
    "end": 850.577,
    "text": "And if your GPU server falls apart, you can just take that program that you've saved on disk elsewhere and run it on another one, and it will behave roughly the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.298,
    "end": 853.079,
    "text": "And so that's what makes it immortal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.56,
    "end": 855.462,
    "text": "You can copy this anywhere you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.442,
    "end": 873.197,
    "text": " Mortal Computation says, well, we should consider the fact, and again, this is just a little bit based on, and we fleshed this out a little bit more than I think Jeff at least wanted to at the time, which is that Mortal Computation bounds or entangles the software with the hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.538,
    "end": 877.121,
    "text": "We shouldn't be thinking of them as two separate and distinct entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.841,
    "end": 881.024,
    "text": "And so that's where the phrase sort of originates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.084,
    "end": 885.448,
    "text": "And one of the core motivations is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.428,
    "end": 887.53,
    "text": " we get a certain energy efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.051,
    "end": 899.685,
    "text": "Because one of the biggest criticisms of transformers and neural models today that characterize artificial intelligence is that they are greatly energy inefficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 900.346,
    "end": 901.807,
    "text": "They require a lot of compute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.568,
    "end": 909.917,
    "text": "And while the costs are going down, and I'm seeing some of those trends pop up, they leave a pretty big carbon footprint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.897,
    "end": 920.05,
    "text": " And so there's also a fun and another vein of research that got into this paper of my own is I've been studying green AI versus red AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.771,
    "end": 931.264,
    "text": "And, you know, just like we talk about green initiatives because we care about global climate change and our concerns of what's happening to our planet and our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.244,
    "end": 960.745,
    "text": " um that's green ai we would want to build intelligent systems that don't leave such a big carbon footprint uh red ai is what we currently have and there were some really nice studies emma strugle many many years ago put out one of the first uh measurements of these language large language models um and so mortal computation uh is one way to address this great inefficiency um beyond a lot of other things but that's kind of where at least jeff uh was coming at this from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 960.725,
    "end": 977.839,
    "text": " What's kind of funny, just as a quick side note, because I obviously track Jeff's work, and while he in December, you know, sort of went down the route of, you know, we should, you know, get rid of backprop, we should go to some biological form of learning, and here's my",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.819,
    "end": 979.382,
    "text": " really wonderful idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.422,
    "end": 982.448,
    "text": "And mortal computation is sort of one of those goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.17,
    "end": 993.972,
    "text": "Later, he sort of, I noticed, used that as an interesting counter argument to talk about the dangers of immortal computation, as he's talking today about, you know, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.952,
    "end": 1011.977,
    "text": " potential threats uh that immortal systems like chat gpt and transformers like them and other models not just these large language models posed to humanity and it's bringing up an interesting discussion and thoughts about you know ex existential crisis for humanity and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.957,
    "end": 1041.728,
    "text": " worthy things to be talking about but he sort of steered into the direction i noticed he uses moral computation sort of as like a well that's what you know we would say maybe the brain and you know biological organisms do uh but the models that we have today don't do that and actually that gives them sort of like superpowers and some dangerous abilities that we can't do with humans and that's worthy of discussion but we obviously don't go into that in this paper um so that's where it sort of originated and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.096,
    "end": 1050.674,
    "text": " just to sort of quickly cap it off, because I know you said you wanted to talk more about the paper, because the whole paper goes into what would it mean to be mortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.395,
    "end": 1061.556,
    "text": "I also really liked in one of the talks that my friend Carl gave or had with someone else that was interviewing him about this work too, and he said that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.536,
    "end": 1082.025,
    "text": " uh this paper's form of mortal computation is sort of like another take on the concept so again like what i explained was sort of what jeff meant by it um and then that was his launching point for a set of other arguments um this one says well wait a minute that entanglement can we characterize that and dig into that a lot deeper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.14,
    "end": 1110.173,
    "text": " and so the idea is that that gets us to the origins of life right of how we ourselves you and me darius are mortal computers in effect right right if we don't mind calling ourselves that and you know not trying to remove our humanity and so that's what sort of this survey paper ends up becoming is it says well okay if we wanted to really go down that rabbit hole if you will what does it mean to define a mortal computer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.153,
    "end": 1114.46,
    "text": " and do other domains of science have possible definitions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.5,
    "end": 1117.384,
    "text": "And that's what the other fun thing about this paper is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.845,
    "end": 1137.915,
    "text": "I know you didn't ask about its motivations, but what's nice about it is that it is an echo of a lot of already great ideas by people way smarter than myself over the last century, talking about essentially what you could call the mortal computation ranging from physics and biology to physiology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.895,
    "end": 1161.962,
    "text": " uh to even cognitive science has already some wonderful theoretical frameworks that we sort of just sharpened or highlighted or there's a little section in there where uh carl and i extend one of the cognitive theories maybe we'll talk about that later i like that you know the we have it called the 5e cognitive theory yes yeah yeah cool yeah that's fantastic um okay perfect so there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.162,
    "end": 1164.144,
    "text": " Yeah, again, lots I want to unpick there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.164,
    "end": 1178.38,
    "text": "So before we fold into inactive inference more technically and talk about how that is a framework in which we can ground mortal computation, I want to ask a question about the motivations about this energy efficiency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.842,
    "end": 1183.666,
    "text": "Because people might be listening and saying, well, immortal computation sounds kind of nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.007,
    "end": 1188.711,
    "text": "It's kind of there and I can take it and it's substrate independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.352,
    "end": 1190.093,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.596,
    "end": 1192.179,
    "text": " my commitments are fewer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.201,
    "end": 1193.541,
    "text": "Why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.561,
    "end": 1204.04,
    "text": "Why does it make more sense to turn to a different form of computation rather than just refining something which clearly works?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.06,
    "end": 1215.0,
    "text": "And maybe, in the long run, it seems to me at least more efficient in the sense that it's just more transferable across different domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.33,
    "end": 1225.569,
    "text": " Yeah, that in that we mentioned that a little bit in the beginning of our paper, why would we want to commit ourselves to mortal computation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.609,
    "end": 1227.773,
    "text": "It's rather brittle, as you pointed out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.014,
    "end": 1230.559,
    "text": "So, um, so again, there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.877,
    "end": 1253.374,
    "text": " many different reasons for why we would want a mortal computer but you said the energy efficiency so to let's just pick at that little bit of the argument so near the start of the paper we we talk about the thermodynamic motivations for mortal computers and there's some really nice ideas from physics and information theory i mean there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.354,
    "end": 1256.579,
    "text": " even probably more that we don't properly scope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.461,
    "end": 1262.91,
    "text": "And two of them that we can just briefly mention are the Landauer limit and Jarzynski inequality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.551,
    "end": 1273.607,
    "text": "In a nutshell, without getting technical about them, because I actually made a point to flesh out those equations just so readers would be like, if they're not familiar, they can look at them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.587,
    "end": 1287.367,
    "text": " But really, at the end of the day, those two concepts say there is a bound on the amount of work or the thermodynamic cost that a system can have to write and store information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.868,
    "end": 1294.477,
    "text": "So again, in a computer, the idea is that we're using bits to store things in memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1295.158,
    "end": 1298.683,
    "text": "And so basically what those two say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.663,
    "end": 1327.624,
    "text": " is that uh there's a point where we're not going to get any more thermodynamic efficiently about you know the cost of actually racing a bit i believe that's what the lander limit or sorry yeah the lander limit and there's this inequality partially touched on they also talk about random fluctuations and averaging things to get a system to an equilibrium state but at the end of the day it's all just about that there's going to be a lower bound that we can't breach any further and what does that actually imply",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.604,
    "end": 1328.446,
    "text": " for computer science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.486,
    "end": 1333.778,
    "text": "Actually, computer scientists have written about these physical limits and the thermodynamic costs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.52,
    "end": 1339.892,
    "text": "And it says that it might mean that we want to reach something called in-memory computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.21,
    "end": 1347.86,
    "text": " So in memory computing basically just says that we want to conduct the mathematical computational calculations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.88,
    "end": 1353.127,
    "text": "Let's say those that characterize neuronal simulations directly at the chip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.407,
    "end": 1353.647,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.667,
    "end": 1359.995,
    "text": "So the idea is that we have processing and we have it organized, let's say, in a crossbar and a neuromorphic chip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.596,
    "end": 1362.859,
    "text": "And we use that as like one of our little examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.839,
    "end": 1388.07,
    "text": " and we can actually essentially construct the neural model in that memory crossbar and so like the neurons are arranged in a particular way physically actually in this little chip and the synapses relate you know are related to for example memristors right and the idea is that we transmit information across these and that will be at the lower limit or the the bound on computation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1388.05,
    "end": 1390.787,
    "text": " Why is this different than what we do today?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.807,
    "end": 1394.128,
    "text": "Well, today, Transformers and the like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.581,
    "end": 1414.288,
    "text": " regardless of the value of GPUs and even what they call TPUs, Tensor Processing Units, and the speed that they have afforded us, and that's actually partially one of the core reasons of the catalyst of the deep learning revolution, is that we use von Neumann architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1414.569,
    "end": 1424.082,
    "text": "So the idea in that is that there's a greater cost associated just fundamentally by simulating these neural models on a von Neumann architecture,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.062,
    "end": 1428.251,
    "text": " And that's because you could look at, for example, the memory organization of a computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.692,
    "end": 1438.071,
    "text": "So beyond, you know, like, let's just call it slow long term memory systems, which you know, you can write and this will preserve your information when you turn off your computer and turn it on later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.338,
    "end": 1446.666,
    "text": " kind of want that versus volatile memory, which is something that is really fast, doesn't give you much of a cost to store things, but it's volatile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.686,
    "end": 1451.571,
    "text": "So obviously, if you turn things off that you can't guarantee that your information is stored on there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.911,
    "end": 1453.993,
    "text": "And then there's different types of intermediate memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.013,
    "end": 1468.007,
    "text": "And so the way of unemployment architecture sort of structured is it arranges this memory in a hierarchical fashion, and the CPU lives or the GPU, if you will, but let's just say the CPU specifically lives on top of this memory hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.987,
    "end": 1470.03,
    "text": " That's where your computer programming lives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.11,
    "end": 1479.184,
    "text": "That's where our neural network is being executed by the compiler, which talks to the assembler and talks to the bits at the very low level of the computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.764,
    "end": 1481.647,
    "text": "And so that's where your mathematical model is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.707,
    "end": 1482.989,
    "text": "But it needs data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.009,
    "end": 1484.051,
    "text": "It needs information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.131,
    "end": 1488.978,
    "text": "It needs the matrices or tensors that store the synaptic weights, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.038,
    "end": 1491.241,
    "text": "Let's just think of our traditional neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.602,
    "end": 1495.007,
    "text": "It's just a bunch of matrix multiplications and some nonlinearities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.987,
    "end": 1498.652,
    "text": " Well, you need to retrieve that weak matrix for the first layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.973,
    "end": 1501.136,
    "text": "Well, that lives at the very, very bottom of this hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.176,
    "end": 1503.48,
    "text": "So there needs to be some transfer process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.58,
    "end": 1506.905,
    "text": "And that's already exhibiting a great thermodynamic cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.925,
    "end": 1508.126,
    "text": "They've quantified that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.146,
    "end": 1513.575,
    "text": "I remember putting in the paper like certain measurements of joules at different layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.516,
    "end": 1522.007,
    "text": "So already fundamentally, we are not operating as close to the lower limit on thermodynamic costs as we could be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.987,
    "end": 1524.514,
    "text": " And so that's already right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.534,
    "end": 1533.137,
    "text": "That explains a great deal of the thermodynamic inefficiency of deep neural networks and intelligence systems that we have today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.177,
    "end": 1537.228,
    "text": "One of the motivations you can use the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.208,
    "end": 1545.181,
    "text": " the idea of in-memory compute is that it gets you to something like edge computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.221,
    "end": 1555.517,
    "text": "If you have something in robotics, which I'm very fascinated by robotic systems or even autonomous vehicles, you're not going to be able to transmit to servers very easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.657,
    "end": 1562.608,
    "text": "You're not going to be offloading your intelligence somewhere else because then you have the communication costs to pay off transmitting information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.588,
    "end": 1589.254,
    "text": " you're going to want your system to live in the device that you're using so in a robotic system you have limited power you have limited uh compute resources so you're gonna want to work with in-memory computing like for example a great uh in-memory system would be like a neuromorphic chip just in case the audience is like well what would be examples of that um and one that has fascinated me which is where the realm of spiking neural nets comes into play and i've done research in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.504,
    "end": 1595.794,
    "text": " as well, and that's what gets you to neuromorphic chips, which does rest on this principle of in-memory computing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.814,
    "end": 1603.926,
    "text": "So the actual spiking neuronal models are actually laid out in these neuromorphic chips and computation happens directly on there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.946,
    "end": 1607.091,
    "text": "So I think that's sort of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.071,
    "end": 1614.625,
    "text": " an energy kind of argument for why we would want this, this would be quite useful for edge computing cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.805,
    "end": 1617.791,
    "text": "And you'd say, well, okay, well, that's just a few examples, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.811,
    "end": 1622.8,
    "text": "We're doing a lot of intelligence without that, but most of robotics is going to be edge computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.82,
    "end": 1624.303,
    "text": "If we want an intelligent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.283,
    "end": 1631.762,
    "text": " humanoid or non-humanoid like robotic system, we're not going to be running them on big supercomputers or GPUs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.802,
    "end": 1640.284,
    "text": "And again, I'm not trying here to attack those that maybe are for like hive mind intelligence where we do communication across servers and we can pay that cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.264,
    "end": 1650.637,
    "text": " But if we want these organic like robotic systems, this is where I think mortal computation really is a path forward for those types of applications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.657,
    "end": 1654.342,
    "text": "And there's a lot of other applications that you could argue have edge computing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.382,
    "end": 1661.952,
    "text": "So I think I'll stop there because that just centers only on the thermodynamic argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.932,
    "end": 1679.063,
    "text": " um i'll just quickly before i forget it tag on uh the other part of is that when we get to that lower limit on thermodynamic costs uh there's a nice equivalence to the variational free energy minimization process because uh while again i",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.043,
    "end": 1700.258,
    "text": " i did tend to focus a little bit more on the thermodynamics the physics side of things uh you know i liked how carl and i sort of connected it to the information theoretic idea that uh to be base optimal right we want to actually get close to that limit and so there's it's sort of like there it's saying the same thing actually the nice thing about the variational free energy principle sorry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.238,
    "end": 1707.609,
    "text": " variational free energy minimization process is it is also actually optimizing that thermodynamic cost in organic systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.689,
    "end": 1709.852,
    "text": "We are operating at that lower limit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.872,
    "end": 1715.139,
    "text": "That's what it means to be Bayes optimal free energy perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.159,
    "end": 1716.481,
    "text": "And I'll stop there, but I like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.762,
    "end": 1721.809,
    "text": "I just want to make that connection because that kind of tags a little bit in that argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.849,
    "end": 1726.836,
    "text": "And then it starts to bleed into the other motivations you could say for moral computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.883,
    "end": 1729.847,
    "text": " Yeah, no, I let's actually stick on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.067,
    "end": 1731.69,
    "text": "Because I think that's a really interesting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.09,
    "end": 1737.818,
    "text": "I think people some, you know, it's actually possible to kind of do the free energy principle without taking into account thermodynamics, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.098,
    "end": 1745.228,
    "text": "You can just do the statistical mechanics and the information theory, just do Shannon information and just say, you know, we're reducing self information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.109,
    "end": 1750.015,
    "text": "So people might be curious, actually how this ties to thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.095,
    "end": 1752.057,
    "text": "I'm curious about ties to thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.078,
    "end": 1753.059,
    "text": "I'm not a physicist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.62,
    "end": 1753.92,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.385,
    "end": 1763.013,
    "text": " to minimize variational free energy is to be sort of operating at this lower bound in terms of thermodynamic energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.694,
    "end": 1764.775,
    "text": "What does that look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.996,
    "end": 1774.827,
    "text": "And I think you talk in your paper about kind of exchanging energy or the work needed to maintain yourself at this bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.43,
    "end": 1785.038,
    "text": "What does that look like in terms of the mapping between information, theoretic terms and thermodynamic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.423,
    "end": 1789.948,
    "text": " Well, first of all, I'm not a physicist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.149,
    "end": 1792.891,
    "text": "We should be clear here as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.931,
    "end": 1796.375,
    "text": "I am a computer scientist and cognitive scientist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.096,
    "end": 1803.924,
    "text": "So again, it goes back to like what I have my paper here just to remind myself if I need to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.984,
    "end": 1809.49,
    "text": "But like I said, it goes to the Jarzynski inequality and the Landauer limit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1810.33,
    "end": 1812.973,
    "text": " So I guess maybe I want to ask a little bit of a clarification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.993,
    "end": 1813.353,
    "text": "What do you mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.373,
    "end": 1814.214,
    "text": "What does it look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.234,
    "end": 1816.196,
    "text": "Just to help me out here to trigger that I'm not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.917,
    "end": 1830.911,
    "text": "So just in terms of that kind of isomorphism, that minimizing variational free energy just is operating at this thermodynamic lower bound, just in very, it can be very simple, because it's gonna have to be very simple for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.892,
    "end": 1833.654,
    "text": "Because they don't teach you this stuff in cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.854,
    "end": 1834.334,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.117,
    "end": 1837.958,
    "text": "What does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.36,
    "end": 1844.107,
    "text": " I mean, what does that mean in terms of our sort of thermodynamic exchanges with the environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.908,
    "end": 1853.297,
    "text": "Because, you know, I think a stumbling block for a lot of people when they hear about free energy is there are lots of ways of talking about energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.018,
    "end": 1866.713,
    "text": "So it's kind of being able to do the mapping between all the different aspects, whether we're talking about kind of Shannon information, or whether we're talking about thermodynamic energy, or we're talking about whatever, whatever, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.997,
    "end": 1870.462,
    "text": " whatever framework you want to come, you want to work with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.263,
    "end": 1883.081,
    "text": "So it just in very simple terms, what does the minimization of I mean, we can put it very generally, what does the minimization of variational free energy beyond beyond mortal computation beyond computers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.522,
    "end": 1890.793,
    "text": "Very simply, what does the minimization, minimization of variational free energy look like, in terms of operating at this thermodynamic lower bound?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.608,
    "end": 1898.119,
    "text": " Well, I guess it gets a little confusing because now I'm thinking about the actual implementation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.2,
    "end": 1906.099,
    "text": "So again, I could approach it from a predictive coding point of view because that's what I usually appeal to when I think of minimizing variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.661,
    "end": 1909.508,
    "text": "So I guess at the end of the day,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.07,
    "end": 1922.862,
    "text": " Kind of goes into the, I guess the problem with your question, I think it makes me think of the other arguments we get into metabolic efficiency and the idea of resources that the organism is acquiring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.623,
    "end": 1923.904,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.865,
    "end": 1926.286,
    "text": "I think I know where I want to go with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1926.326,
    "end": 1933.635,
    "text": "So it's actually kind of later in the paper where we touch back on the free energy principle and we get into this concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1933.655,
    "end": 1934.456,
    "text": "So what does this look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.476,
    "end": 1937.679,
    "text": "It looks like the concept of the, what do you call it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.699,
    "end": 1940.963,
    "text": "The non-equilibrium steady state, the NESP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.297,
    "end": 1947.706,
    "text": " So what does this mean more generally for even artificial and biological organisms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.146,
    "end": 1955.516,
    "text": "The idea is that we want to reach a point that we are far from thermodynamic equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.957,
    "end": 1960.242,
    "text": "And so, yeah, I got to charge my memory here a little bit of certain parts of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.262,
    "end": 1962.225,
    "text": "So apologize for the delay there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.205,
    "end": 1969.319,
    "text": " So the second law of thermodynamics is that, you know, that entropy must increase right in a closed system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.8,
    "end": 1976.493,
    "text": "And so we are tending towards higher entropy and we are reaching, you know, systems will reach equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.573,
    "end": 1979.438,
    "text": "And actually, that's not what living systems are doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.599,
    "end": 1982.965,
    "text": "Living systems live at what I just said earlier, non equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.62,
    "end": 1988.446,
    "text": " And you'd say, well, wait a minute, are we trying to adhere to the second law of thermodynamics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.867,
    "end": 1994.153,
    "text": "And this is part of what was interesting about this paper in understanding the history of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.614,
    "end": 2003.665,
    "text": "There is an interpretation of thermodynamics and biology, and they call it the first law of thermo, the first law of biological thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.725,
    "end": 2007.67,
    "text": "At least this is what I had found in my, you know, search.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.65,
    "end": 2033.657,
    "text": " uh through the info through the literature and the idea is that organisms do want to stand far away from equilibrium because equilibrium means death equilibrium means dissolution or disintegration into a heat bath into your environment your identity ceases to exist and that allows me to poke and touch another concept of why mortal computation is so important it's a process of identity constitution and preservation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.637,
    "end": 2039.849,
    "text": " And so where that connection comes into play is that organisms, they have a goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.969,
    "end": 2050.65,
    "text": "And according to the free energy principle, organisms have the idea that their dynamics wants to make them stand away from this equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.63,
    "end": 2055.082,
    "text": " And so they're going to need energy and resources to allow themselves to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.443,
    "end": 2056.967,
    "text": "And then there's another part to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.088,
    "end": 2065.551,
    "text": "And actually, I do want to remind myself so I don't steer the audience wrong because I liked how I pitched it or how I put it in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.919,
    "end": 2095.555,
    "text": " there are two principles before you got into the markov blanket discussion oh no uh okay i remember what yeah so again it does connect to the markup blanket but the idea is that these dynamics in the cis the internal states of the organism are conditionally independent of their environment the external states right and that's what the markup blanket formalism tries to formalize that more strongly and the that we have those density dynamics they are conditionally independent however you are still",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.535,
    "end": 2099.983,
    "text": " weekly coupled to the environment through the Markov blanket interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.664,
    "end": 2105.412,
    "text": "And so again, I apologize for introducing those words later in case you wanted me to flesh those out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.432,
    "end": 2117.273,
    "text": "But the idea is that because we are coupled to our environment, that also gets us to the connections of active inference and why we must act to move about our environment so as to prevent or to keep ourselves at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.253,
    "end": 2132.275,
    "text": " The non-equilibrium steady state and the free energy principle says that if you are a living organism or an entity, you will return to this NES and your actions and your goals and behavior lead you back to the NES.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.255,
    "end": 2150.061,
    "text": " the other concept is and this is the part two of the free energy principles the concept of continual self-evidencing right the idea is that you're trying to maximize the data for your own internal generative model which is connects to the other component of the paper where we brought in cybernetics and like the good regulator theorem which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.041,
    "end": 2151.564,
    "text": " We can talk about that later if you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.027,
    "end": 2154.571,
    "text": "So I think that's what it looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.591,
    "end": 2154.731,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.751,
    "end": 2162.428,
    "text": "And it manifests itself in this this continuous goal of trying to stay in non-equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.488,
    "end": 2169.062,
    "text": "You're avoiding equilibrium, which is dissolution into your environment, death, which also means the end of your identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.042,
    "end": 2173.709,
    "text": " And so that's what a mortal computer is constantly engaged in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.769,
    "end": 2176.453,
    "text": "And that's what the thermodynamics kind of gets you to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2176.513,
    "end": 2180.98,
    "text": "It walks you to that, which is another way that the free energy principle states that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.24,
    "end": 2181.36,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.38,
    "end": 2186.528,
    "text": "And so I look at it from the like the information theoretic quantity of like, oh, I'm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.508,
    "end": 2210.355,
    "text": " you know dealing with gnats or bits right but the idea is that at the end of the day you're trying to stay in your nest any essence yeah yeah and you're continuously self-evidencing uh and you're dealing with this weekly coupled a weak coupling to your environment and you're interacting through your markup blanket i'll leave that black box for now in case you want to poke at it no no that that's great i mean that that's much more my language",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.335,
    "end": 2215.983,
    "text": " By the way, that's what I think it looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.083,
    "end": 2227.438,
    "text": "That's where thermodynamics really gets you into the biological thermodynamics, the first law of biological, which is really what that is sort of restating, remanipulating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.518,
    "end": 2230.302,
    "text": "It's basically all talking about that non-equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.282,
    "end": 2255.445,
    "text": " that we want to live at which then you can and the nice thing about the biological first law of thermodynamics is it sort of deals with the fact that you're saying well we don't violate the second law of thermodynamics entropy will still go up it's just not in the organism system itself it's an open system that lives in a closed system which is the greater like in eco-niche uh organism pairing right and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.425,
    "end": 2278.733,
    "text": " entropy will go up according to the second law in the entire system but inside this system this explains why entropy can go down and that's what you know and that's what i liked about that because that was a great source of confusion i saw even in the literature um you know how are we dealing with the actual second law of thermodynamics well we're not fighting we are really adhering to the biological first law of thermodynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.017,
    "end": 2287.169,
    "text": " which that's what any SS and the free energy principle sort of at least one dimension or the dimensions that I'm more familiar with tackle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.451,
    "end": 2289.673,
    "text": "Yeah, so that great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.933,
    "end": 2295.001,
    "text": "So that latter point is kind of where I was heading with my rubbish physics vocabulary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.122,
    "end": 2299.768,
    "text": "But the nest when you try to set it stuff is all perfect for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.788,
    "end": 2305.897,
    "text": "So don't worry, you haven't opened Pandora's box because this is a language at least that I'm speaking these days and this institute is speaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.257,
    "end": 2308.18,
    "text": "But that's exactly the point I was making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.902,
    "end": 2313.506,
    "text": " Because it's kind of all about the scope of one's analysis, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.526,
    "end": 2315.729,
    "text": "Like equilibrium for whom?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.05,
    "end": 2324.077,
    "text": "Because I think people get confused that they think of free energy minimization as homeostasis, which they learned at school as equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.697,
    "end": 2326.539,
    "text": "But then they're saying that we're far from equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.78,
    "end": 2338.791,
    "text": "So it's non equilibrium with respect to the universe, or with respect to the way the universe wants to be, which is dissipative fundamentally, but it's equilibrium for ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.007,
    "end": 2343.214,
    "text": " in terms of our internal dynamics, given our steady state, you know, given our attractor set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.795,
    "end": 2347.521,
    "text": "And I should add a word that just compliments what you said, because you're correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.621,
    "end": 2350.285,
    "text": "Homeostasis is actually kind of confusing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.646,
    "end": 2358.058,
    "text": "And we introduced another word, and I thank Carl for pointing me in this direction, because he had us, you know, highlight this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.539,
    "end": 2360.061,
    "text": "Hormeohesis, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.081,
    "end": 2361.424,
    "text": "Yes, I saw that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.764,
    "end": 2364.188,
    "text": "Because it handles this, and we could talk about that if we want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.168,
    "end": 2364.849,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.309,
    "end": 2366.931,
    "text": "That's the word people should learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.232,
    "end": 2370.035,
    "text": "But I never learned that when I was much younger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.556,
    "end": 2374.16,
    "text": "I only learned that in the context of formulating this framework with Carl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.641,
    "end": 2384.212,
    "text": "So yeah, and then people, I guess there's a great deal of emphasis on allostasis as well within active infants, which we can touch on, we'll, we should probably unpick those three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.633,
    "end": 2385.854,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.994,
    "end": 2389.198,
    "text": "And don't forget autopoiesis as autopoiesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.278,
    "end": 2390.7,
    "text": "I've been reading a lot about autopoiesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.722,
    "end": 2393.263,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.463,
    "end": 2394.204,
    "text": " Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.385,
    "end": 2398.83,
    "text": "Yeah, I mean, should I keep perusing down this area?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.85,
    "end": 2412.927,
    "text": "I think it's interesting, because it's like, so we're minimizing entropy within our own bound within our own system, whatever that looks like, because those boundaries, it's hard to kind of cast a limit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.529,
    "end": 2420.837,
    "text": "But that, according to the second law from dynamic thermodynamics means that we have to be creating entropy elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.492,
    "end": 2424.035,
    "text": " just so that the system itself is abiding by the second law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.139,
    "end": 2430.482,
    "text": "How do we do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.943,
    "end": 2432.545,
    "text": "How does anything do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.605,
    "end": 2436.349,
    "text": "Where are we creating entropy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.369,
    "end": 2436.489,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.711,
    "end": 2442.977,
    "text": "Well, let me make sure that I zoom in on the right component that touches on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.054,
    "end": 2450.509,
    "text": " So I think the problem is there's all these slices to mortal computation, as you're familiar with the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.93,
    "end": 2455.701,
    "text": "And I think a piece of one of the other interpretations is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2456.069,
    "end": 2461.414,
    "text": " more approachable way to understand how we increase entropy, which is the idea of inactivism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.834,
    "end": 2472.164,
    "text": "So I'm borrowing from, so just for the audience that maybe hasn't read the paper, we sort of have a pathway that we talk about the mortal computation thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.505,
    "end": 2473.946,
    "text": "We talk about biophysics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2474.266,
    "end": 2476.569,
    "text": "We talk about the cybernetics interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.929,
    "end": 2480.572,
    "text": "We talk about the cognitive science framing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.652,
    "end": 2484.456,
    "text": "Even though they don't use these words, they're essentially saying these ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.436,
    "end": 2502.85,
    "text": " and then we lead into sort of a free energy definition and a markov blanket formulation with uh other things and then we lead to a definition so that's so when i say slices that third of that one portion of the paper on cognitive science is where we borrow uh from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2502.83,
    "end": 2523.403,
    "text": " uh well what's normally called 40 cognitive theory which you know and one of those e's is inactive the first one's embodiment which we can touch on that one as well but uh inactive is about your relationship to your environment and so uh and how that interacts with you there's like a bi-directional relationship",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.383,
    "end": 2534.514,
    "text": " We act on our environment, and that effectively means we are authors of the information that we will end up using and the resources that come into us, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2534.634,
    "end": 2537.737,
    "text": "In terms of our foraging, in terms of our survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2537.917,
    "end": 2541.421,
    "text": "Remember, not to forget, our goal is to stay in non-equilibrium, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.481,
    "end": 2543.523,
    "text": "Not in equilibrium, steady state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.543,
    "end": 2548.688,
    "text": "And so that's essentially how we're going to end up creating entropy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.708,
    "end": 2550.91,
    "text": "Because we are going to manipulate the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2551.295,
    "end": 2575.632,
    "text": " idea that where the active portion the active inference element comes into play nice and so we are uh what's the right word that we use in the in the paper that others have used as well uh we are engaged in niche construction right indeed yeah so because we manipulate the environment using the affordances that it brings us and we do things to allow ourselves to again",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.612,
    "end": 2599.223,
    "text": " you could tie this for those that maybe don't like any ss as the goal but say we want to survive survival and identity continuance right is essentially living in this non-equilibrium steady state uh we enact our environment we change it when then that information of course we're then gathering that and so the environment affects us right it's a bi-directional relationship",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2599.203,
    "end": 2602.969,
    "text": " The environment constrains us, puts problems on us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.069,
    "end": 2605.193,
    "text": "We have to deal with that, but we change the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.213,
    "end": 2606.835,
    "text": "So we are creating disorder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.336,
    "end": 2624.063,
    "text": "And that's a key element is that through the actions that you take, through any animal that they take, through any organism that they do to manipulate and change something about their environment so that way they can continue to get resources, matter and energy back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.043,
    "end": 2651.653,
    "text": " uh those are the two the fuels of the universe right uh we we essentially create that disorder right and so that's how the second law of thermodynamics gets satisfied because that's what biological or biotic entities and i'll just zoom in on them for now because you know again i want to be careful not to step on physicist toes or biophysicist toes as well because i'm not in those domains i've just read enough of that work to synthesize right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.633,
    "end": 2656.02,
    "text": " But that's how you're creating your entropy is that you are inactive, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.06,
    "end": 2658.965,
    "text": "And so this is the concept of inactive cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.365,
    "end": 2661.168,
    "text": "You said you're reading about autopoiesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.188,
    "end": 2663.091,
    "text": "There's also this thing called, what is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.772,
    "end": 2667.198,
    "text": "Autopoetic inactivism as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.658,
    "end": 2668.339,
    "text": "Yeah, Evan Thompson.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.88,
    "end": 2669.822,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.882,
    "end": 2676.793,
    "text": "Yeah, I'm rereading Mind and Life, which is Evan Thompson's kind of massive magnum opus from 2007, which is cracking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.813,
    "end": 2677.033,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.402,
    "end": 2680.846,
    "text": " Um, I like pointing people in directions of readings that they can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.267,
    "end": 2682.809,
    "text": "Um, so yeah, that's a great one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.109,
    "end": 2685.052,
    "text": "Thompson's someone everyone should read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.072,
    "end": 2685.372,
    "text": "I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.392,
    "end": 2685.873,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.973,
    "end": 2686.373,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.494,
    "end": 2687.475,
    "text": "So yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.555,
    "end": 2689.197,
    "text": "Beautiful stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.217,
    "end": 2699.831,
    "text": "Um, obviously Varela, Russian Thompson, 91, um, the embodied mind and all the stuff that Varela did with Matarano in 1980 or to priestess or wonderful work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.131,
    "end": 2700.571,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.591,
    "end": 2705.738,
    "text": "In mind in life, he talks about the fact that inactive, uh, entities are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.089,
    "end": 2706.93,
    "text": " uh, what does he say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.99,
    "end": 2715.323,
    "text": "He says operationally closed, um, but sense-making and by sense-making, I think what he means is this kind of yet thermo dynamically open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.305,
    "end": 2727.562,
    "text": "Um, so we're in the game of autopoiesis, but that, that doesn't deny that doesn't negate the possibility of obviously of, of interacting with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.602,
    "end": 2734.493,
    "text": "In fact, we have to integrate the environment into our model or into our, uh, action policies,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.76,
    "end": 2742.289,
    "text": " to use an active inference term, in order to get like do autoprocess, you're not going to last very long if you're an entirely closed off system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.05,
    "end": 2752.762,
    "text": "It's funny, because, again, it just makes me think about how scale, how scale is really a very important kind of currency in this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.802,
    "end": 2756.146,
    "text": "And it might just be philosophically interesting, but I'm sure it's interesting for physicists, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.007,
    "end": 2763.214,
    "text": "Because it makes me think that like, whatever we are, whatever the bounds of us as an identity is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.818,
    "end": 2785.152,
    "text": " kind of pockets of the universe where entropy is decreasing but then there's nothing kind of a priori stopping that process expanding to let's say societies or worlds right or galaxies or milky ways and and i guess the question is is uh where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.942,
    "end": 2790.207,
    "text": " where does the where does what was the what's the overarching closed system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.308,
    "end": 2804.382,
    "text": "Because, you know, I get I know you're this is this might not be your the question that you want to answer waxing with your thinking, you know, speculating seems to me that and again, this is not an argument from design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.462,
    "end": 2810.829,
    "text": "I think interestingly, there seems to be a sort of resurgence perhaps of an argument from design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.889,
    "end": 2814.092,
    "text": "I know Philip golfers just released his book why which is um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.798,
    "end": 2822.568,
    "text": " a kind of philosophical argument for, I wouldn't say it's designed per se, maybe it is from a probabilistic perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.63,
    "end": 2842.915,
    "text": "I think relying on, actually I won't say it because I haven't had Philip on, but the universe has its space at least for entropy reduction, but we still have the second law of thermodynamics operating in these closed systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.992,
    "end": 2848.839,
    "text": " I guess the question I would ask to a physicist is, what if it's just open systems all the way up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.883,
    "end": 2858.152,
    "text": "Well, yeah, I would love to have, it would be fun to pair up with a physicist here and ask literally that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.933,
    "end": 2871.271,
    "text": "All I will say in my non-physicist hat is that at least when I was constructing this framework with Carl, and it'd be fun to get Carl's thought on that as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2871.291,
    "end": 2872.733,
    "text": "Yeah, sure, welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.067,
    "end": 2873.968,
    "text": " Oh, wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.988,
    "end": 2874.889,
    "text": "You know, future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.909,
    "end": 2876.511,
    "text": "Yeah, yeah, future call.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.711,
    "end": 2877.272,
    "text": "In the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.372,
    "end": 2883.299,
    "text": "But I like to think that there is some outer closed system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.64,
    "end": 2892.09,
    "text": "And so I guess when I was writing this in a perhaps ignorant way, I was thinking of the entirety of the universe as the entire system, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.13,
    "end": 2897.416,
    "text": "That is the closed system because I thought you were going to ask a different question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.476,
    "end": 2900.24,
    "text": "And I have an answer for that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.76,
    "end": 2902.062,
    "text": "No, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.042,
    "end": 2925.4,
    "text": " about cosmic bodies and all the other entities in this universe right um uh but but just to to stick to your your your comment um I think the entire universe is the closed system and that's where the entropy is going up because you know you probably have heard about uh at least it's I believe it's still like more of a physics theory but the eventual heat death of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.38,
    "end": 2926.301,
    "text": " Everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.341,
    "end": 2929.184,
    "text": "Increasing heat, increasing energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.204,
    "end": 2933.249,
    "text": "Isaac Asimov has written wonderful stories about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.869,
    "end": 2939.776,
    "text": "And so I thought of the entirety of the universe and every other entity that is in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.757,
    "end": 2948.265,
    "text": "Some of them could be living in that non-equilibrium steady state, but everything eventually is tending towards the heat death of the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.245,
    "end": 2969.646,
    "text": " so the closed system there is an outer bound i just haven't picked it specifically and that's where a physicist would be much more qualified to draw that boundary the tiny question that i was wondering because it's set you were almost walked yourself there which was when you brought out other bodies and i'll even throw in electrons in here too because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.913,
    "end": 2973.579,
    "text": " I thought you were going to say, are cosmic bodies mortal computers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.879,
    "end": 2977.004,
    "text": "Are electrons mortal computers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.024,
    "end": 2978.567,
    "text": "And I do have an answer for that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.647,
    "end": 2992.629,
    "text": "Again, I'm not going to pretend that I have the physicist's answer, but I think Carl has actually eloquently addressed this, again, in other discussions related to this paper, because someone did ask him, well, is the moon cognitive, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.649,
    "end": 2993.17,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.15,
    "end": 2997.361,
    "text": " They would also, you could argue that they're following certain dynamics as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.782,
    "end": 2999.967,
    "text": "Why didn't we include other objects?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.007,
    "end": 3003.075,
    "text": "Because we have actually examples in the paper, very specific, like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3003.207,
    "end": 3008.412,
    "text": " these entities serve as wonderful examples of mortal computers, we can chat about them if you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.633,
    "end": 3015.959,
    "text": "But I like how Carl said, Why does the moon not necessarily think or at least we wouldn't call it cognitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.979,
    "end": 3019.843,
    "text": "And he talks about these dynamics, the flow, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.604,
    "end": 3022.846,
    "text": "You can decompose flow in physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.906,
    "end": 3025.929,
    "text": "And again, I'll put it in the lightest interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.069,
    "end": 3027.951,
    "text": "So that way, I don't miss maybe misspeak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.552,
    "end": 3029.873,
    "text": "But you can decompose",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3029.853,
    "end": 3033.7,
    "text": " dynamics according to Helmholtz CND composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.2,
    "end": 3038.448,
    "text": "So there is something called solenoidal flow or conservative flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.989,
    "end": 3044.358,
    "text": "And then there's this thing called dissipative flow or the random fluctuations, as Carl has mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.438,
    "end": 3046.782,
    "text": "And the idea is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3046.762,
    "end": 3071.74,
    "text": " uh random fluctuations uh that's the stochasticity of any system that you must deal with and when you get close to quantum which i am not a quantum person but i understand that the random fluctuations are so high the amplitude of them that they dominate the dynamics right and so that's why in quantum mechanics you specify things in terms of probability distributions um but then as you move all the way up in increase in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.99,
    "end": 3087.138,
    "text": " And Carl's also been very careful to avoid saying space, which is constant, but rather just the size of the objects that we're considering as we get up to macroscope, meso, macro, and cosmological scales, because you mentioned scales earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.178,
    "end": 3090.083,
    "text": "The idea is that the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.063,
    "end": 3116.644,
    "text": " flow becomes more dominated actually almost entirely if not completely solenoidal right which is this conservative flow it's time dependent flow dependent on the states because again i should mention too when we're talking about flow we're talking about the states of a system right and they change with time everything is dynamic and evolving um and so the dissipative random fluctuations get averaged out because as you get bigger and bigger in scale",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.624,
    "end": 3119.99,
    "text": " you average out fluctuations and the amplitude goes down, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.01,
    "end": 3137.058,
    "text": "So as you progressively get bigger, you progressively average out the noise to the point where when you get to the cosmic bodies, all that's going on is solenoidal flow, whereas a quantum or the very, very small scales, it's mostly dissipative random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.518,
    "end": 3143.408,
    "text": "So how does that connect back to mortal computation or cognition or sentience or anything of that form?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3143.607,
    "end": 3148.092,
    "text": " Well, Carl has used this phrase, the Goldilocks regime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3148.293,
    "end": 3160.728,
    "text": "So we didn't write about it in the paper, but I thought it was a nice, it's a good thing to think about that there is this regime of being big enough, but not too big and not too small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.208,
    "end": 3162.79,
    "text": "You know, that's the Goldilocks regime, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.271,
    "end": 3167.556,
    "text": "Such that you have a balance or you have a combination of dissipative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.536,
    "end": 3196.176,
    "text": " flow and solenoidal flow because the idea is that you need that dissipative flow in order to minimize your variational free energy the idea is that we need that dynamics we need something to be surprised to uh drive our continual self-evidencing but you need that solenoidal flow which by the solenoidal flow can be like rotational flow very like a carl used another example just because i remember seeing this and it's stuck in my mind about water and flowing towards a drain or a or a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.409,
    "end": 3219.548,
    "text": " open plug and as it rotates around it doesn't go down that would be the dissipative part it's going down the gradient just the circular rotational movement right so that's what you know these bodies at the cosmic scale they collapse to newtonian or lagrangian mechanics or classical mechanics right and the idea is that they're just following this conservative flow but there's no dissipative random fluctuations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.528,
    "end": 3222.893,
    "text": " Whereas electrons and quantum objects as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.934,
    "end": 3223.094,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.114,
    "end": 3228.322,
    "text": "They're just dealing with all this dissipative stream noise or stochasticity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.703,
    "end": 3239.781,
    "text": "So electrons don't think and the moon does not think because, again, you need sort of this balance between these two flows in order to essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.761,
    "end": 3243.547,
    "text": " promote this self-evidencing in a structured way too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.647,
    "end": 3251.721,
    "text": "Because again, if everything's just so completely random, it's obviously hard to form, what is it, steady patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.562,
    "end": 3255.407,
    "text": "Oh, and the other component to this is the cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.387,
    "end": 3257.61,
    "text": " And that's where I think the mortal part comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.69,
    "end": 3266.48,
    "text": "The solenoidal flow or the rotational or the predictable patterns or the conservative patterns, that's where you get things that repeat or a periodic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.061,
    "end": 3269.163,
    "text": "And so that's what gets you the life cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.423,
    "end": 3279.115,
    "text": "So there's a lot of wonderful examples like breathing is actually an example of that solenoidal flow or cycles and language or the fact that you and I die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.215,
    "end": 3279.495,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.575,
    "end": 3281.918,
    "text": "And there's the cycle of death and rebirth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3281.898,
    "end": 3309.998,
    "text": " um those cycles are more of that conservative flow uh and that's the part what makes creates this mortality right and that mortality the other take by the way i sort of skipping around a bit the other motivation for moral computation is that that cycle that life cycle adds a pressure to these entities right that would not normally be there because again if you're immortal and you don't have to worry about death you might act a different way right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.978,
    "end": 3314.825,
    "text": " So that that life cycle thing comes from that other aspect of the flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3315.245,
    "end": 3329.544,
    "text": "But again, when you get but you need that sort of stochasticity right to, you know, engender that continual self-evidencing that wouldn't be happening at like the cosmic scale, which is just essentially all those random fluctuations are averaged out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3329.625,
    "end": 3334.251,
    "text": "So I think you didn't ask that question, but you almost and I thought you were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.411,
    "end": 3335.232,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3335.252,
    "end": 3338.837,
    "text": "But I should answer that because I think that's something that's not really addressed in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3338.817,
    "end": 3343.183,
    "text": " and I was surprised to see a couple different places that that question comes up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.243,
    "end": 3350.454,
    "text": "So no, electrons don't think, and the moon does not think, at least in accordance to the way we were thinking about mortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.734,
    "end": 3355.281,
    "text": "There is possibly a Goldilocks regime, but what are the bounds of those regimes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.341,
    "end": 3356.663,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.284,
    "end": 3358.225,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.345,
    "end": 3361.71,
    "text": "In the first episode of this podcast, Carlo and I go quite deep into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.491,
    "end": 3364.654,
    "text": "Oh, so you've worked on that already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.674,
    "end": 3365.375,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.456,
    "end": 3368.52,
    "text": "Well, it goes pretty, you know, we start talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.378,
    "end": 3373.985,
    "text": " information geometry spaces and, and indeed, these flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.225,
    "end": 3379.073,
    "text": "Yeah, so just for everyone called as a big exposition of that in the first episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.093,
    "end": 3386.644,
    "text": "And, and yeah, it's beautiful, because it ties together as well, like this, what I've been speaking about with phenomenologists, especially people interested in Heidegger,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.962,
    "end": 3392.109,
    "text": " this kind of future orientated nature that we have, because we're always at risk of being dispersed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.129,
    "end": 3399.319,
    "text": "So we always have to be acting for our self organization, not only at time t, but also for t plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.66,
    "end": 3402.063,
    "text": "Yeah, which which feeds into this kind of notion of our stasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3402.624,
    "end": 3407.391,
    "text": "So we've done, we've done a huge cosmic overview without even talking about the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.631,
    "end": 3414.28,
    "text": "But I do want to ask one more question about immortal computation going all the way back to what adverse is mortal computation going all the way back to what we were talking about at the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.242,
    "end": 3415.602,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.835,
    "end": 3420.863,
    "text": " The way that Jeff, so Jeff, Jeffrey Hinton, super important guy in machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.124,
    "end": 3426.212,
    "text": "And I know him and Carl and Pete Diane, there's, you know, they were working together in the 90s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.232,
    "end": 3427.454,
    "text": "So this is a very long history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.474,
    "end": 3428.656,
    "text": "The Gatsby unit, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.116,
    "end": 3430.559,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.579,
    "end": 3431.5,
    "text": "At the Gatsby, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.941,
    "end": 3438.872,
    "text": "And, you know, this casting of immortal versus mortal as being a software hardware dichotomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.392,
    "end": 3444.243,
    "text": " So in mortal computation, the software is kind of bound to the hardware like us, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.323,
    "end": 3457.213,
    "text": "At least the way that we would, uh, you know, most materialists would think of cognition and the brain where software is, um, substrate independent in the sense that you can take something like chat GBT and play on my computer, put it on your computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.235,
    "end": 3458.295,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.9,
    "end": 3470.061,
    "text": " So that, in my mind, again, because I'm coming at this from a philosophical perspective, makes me think of functionalism as a kind of philosophical theory of mind, which, at least in its kind of very raw form, is substrate independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.703,
    "end": 3478.157,
    "text": "And an argument which comes from Ned Block, which is a kind of argument ad absurdio, is that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.475,
    "end": 3494.307,
    "text": " if you take that idea of substrate independence seriously, what you might end up with is what he called the Chinese brain, which is let's have a system where every neuron in the brain is replaced with a person from China because the number of neurons in the brain region",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.624,
    "end": 3496.506,
    "text": " map onto the number of people in China.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.846,
    "end": 3508.197,
    "text": "And if they do all the flagging, if they do all the synaptic integration, then we would have to be compelled, if it was completely isomorphic, to say that that brain was conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.858,
    "end": 3510.399,
    "text": "And he goes, well, this is just clearly wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.82,
    "end": 3514.263,
    "text": "And you do have functionists who will say, well, actually, that brain would be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.984,
    "end": 3517.586,
    "text": "Sorry, that Chinese nation would be conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.606,
    "end": 3521.29,
    "text": "I guess I say all of this to ask just purely on intuition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.624,
    "end": 3531.534,
    "text": " Does the notion of a kind of boundlessly immortal computer or software really, does that really make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.614,
    "end": 3541.625,
    "text": "Because it seems to me that yes, you can access ChatGBT and I can access ChatGBT, but that is contingent on the fact that you and I are working on at least relatively similar hardwares.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.026,
    "end": 3551.175,
    "text": "So I'm just wondering whether the notion of immortal software is itself a slight red herring or an overshoot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.18,
    "end": 3557.881,
    "text": " Possibly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.682,
    "end": 3582.516,
    "text": "I mean, I guess... I guess the way to think about what the argument for immortal computation really says, right, is that... Well, so... I gotta think this one through, because, yeah, I've not heard about, you know, the actual problems with immortal computation, per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.017,
    "end": 3583.778,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.618,
    "end": 3587.843,
    "text": " Are you referring to maybe perhaps the limitations of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.004,
    "end": 3609.073,
    "text": "Well, I'm just kind of bringing into question the very dichotomy that is supposedly at the heart of the problem, which is that you have hardware systems that are prey to dissipative forces, whether it's the metal in my laptop or silicon or whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.897,
    "end": 3613.81,
    "text": " And then you have the software, which, which arguably is substrate independent, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.85,
    "end": 3618.304,
    "text": "I mean, that's the very dichotomy that set up my point is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.55,
    "end": 3623.775,
    "text": " is that the in the substrate independence is a bit of a misnomer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.275,
    "end": 3630.982,
    "text": "It's not necessarily the case, because all the all the evidence we have for substrate independence are relying on very similar substrates, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.002,
    "end": 3633.165,
    "text": "Like, we all have very similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.205,
    "end": 3640.252,
    "text": "Yeah, you're saying that, because at the end of the day, we are effectively using the same type of substrate, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.273,
    "end": 3641.894,
    "text": "You and I were executing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.375,
    "end": 3645.338,
    "text": "So the fact that we aren't, we aren't really testing the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3645.318,
    "end": 3647.043,
    "text": " the independence component, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3647.063,
    "end": 3649.73,
    "text": "Running it on an entirely different substrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.77,
    "end": 3653.0,
    "text": "Write it on the population of China and see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3653.04,
    "end": 3657.492,
    "text": "Like you said, create the Chinese room style, the system, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3658.515,
    "end": 3660.34,
    "text": "Could we construct that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.32,
    "end": 3661.882,
    "text": " Possibly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.302,
    "end": 3664.745,
    "text": "I mean, it is possible that it is a misnomer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3666.047,
    "end": 3678.882,
    "text": "I guess maybe what people think about, and again, you could probably even find minor criticisms or minor issues with this, is like when you change the particulars of the hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3678.942,
    "end": 3685.89,
    "text": "So when we run, for example, ChatGPT or Transformer, we're using something like a GPU system, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.93,
    "end": 3687.272,
    "text": "Maybe multiple GPUs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.32,
    "end": 3693.428,
    "text": " Well, I could say, well, wouldn't changing the hardware mean I run it on a set of, let's say I have a lot of CPUs lying around, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3693.729,
    "end": 3694.81,
    "text": "That is different hardware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.83,
    "end": 3699.056,
    "text": "They have similar properties, like let's say physical properties are in Silico, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.877,
    "end": 3703.301,
    "text": "But they are different constructs to run, you know, the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.342,
    "end": 3711.893,
    "text": "And the idea is that, you know, ChatGPT would run just fine on a set of CPUs, to my knowledge, I haven't necessarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.873,
    "end": 3714.578,
    "text": " tested it, but you can run multi CPU systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.018,
    "end": 3716.301,
    "text": "Same thing with a TPU.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.321,
    "end": 3718.084,
    "text": "They might just have different speeds, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.104,
    "end": 3731.046,
    "text": "They give you maybe the speed of training, the convergence properties might change, but at the same time, they will, again, if we're not doing learning, I would imagine the program runs the same",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.026,
    "end": 3731.327,
    "text": " way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.607,
    "end": 3743.147,
    "text": "And I would even imagine that you can run let's say you had a really, really good like device that isn't a multi GPU system, you pre trained your model, and now you run it on there, it'll behave roughly the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.588,
    "end": 3748.597,
    "text": "However, I could see the argument that even then, there's going to be differences, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.617,
    "end": 3753.085,
    "text": "Because there's the properties of just the actual system that you're simulating on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.065,
    "end": 3755.708,
    "text": " You can even talk about, for example, seed generation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.748,
    "end": 3758.932,
    "text": "So, you know, when we write a program, we have a computer seed, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.952,
    "end": 3765.039,
    "text": "You control the noise or you control the level of determinism in your computer simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3765.66,
    "end": 3769.344,
    "text": "And you can use wall clock time, for example, to generate seeds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.384,
    "end": 3776.372,
    "text": "Well, if you change the system, well, you're not going to have access to the exact properties that instantiated that seed on my computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.352,
    "end": 3780.997,
    "text": " Already your computer's on a different stochastic trajectory if it, let's say, uses noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.858,
    "end": 3789.486,
    "text": "Transformers might not be the ultimate best example, but any system that's like a noisy neural model would already be behaving a little bit differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.747,
    "end": 3794.392,
    "text": "Maybe on average, they would behave the same if we averaged out those fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.653,
    "end": 3799.497,
    "text": "There is a little bit of difference across hardware platforms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3800.198,
    "end": 3801.88,
    "text": "It could possibly be a misnomer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.96,
    "end": 3803.862,
    "text": "Again, to use your example of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.842,
    "end": 3806.585,
    "text": " the Chinese room style neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.446,
    "end": 3809.829,
    "text": "And we simulate GPT, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.869,
    "end": 3813.754,
    "text": "But with these particular with humans serving those neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.597,
    "end": 3824.448,
    "text": "Yeah, I would I don't know if I can really comment on whether or not that could perhaps be a way to break the complete immortality of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.789,
    "end": 3832.077,
    "text": "I think what moral computation just to make sure that I don't get lost in the plot here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.057,
    "end": 3839.299,
    "text": " is that mortal computation really wants to emphasize that at the end of the day, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3840.477,
    "end": 3843.463,
    "text": " The way that we design our programs, they really are eternal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.483,
    "end": 3862.941,
    "text": "I mean, they might not necessarily run exactly the same, like you're pointing out, there could be some problems, but we are not designing our intelligence systems with any or very little, what do you call it, constraint or informative information about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3862.921,
    "end": 3864.443,
    "text": " the substrate it's going to run on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3864.463,
    "end": 3869.61,
    "text": "Like when I write my neural simulation, I run it on a server, maybe I run it on my desktop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3869.931,
    "end": 3875.238,
    "text": "I don't think about, oh, is this device actually going to affect the characteristics of my program?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.298,
    "end": 3882.128,
    "text": "Like that's sort of what Mortal Computation even touches on, which is like the particular quirks of an entity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3882.108,
    "end": 3910.292,
    "text": " are very substrate it's like almost like once you build one particular neuro robot you would also get what in cognitive science there's this term coming up cognitive diversity right so if i built a different neural robot let's say i it has very similar structure right you would say okay well these two mortal computers i i tried to design them exactly the same i run the same program well because they are two separate entities and the way they interact with their environment they are going to have their own",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3910.272,
    "end": 3918.662,
    "text": " eccentricities, their own quirks, their own particular knowledge, from self evidencing them particular selves, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.702,
    "end": 3936.803,
    "text": "So the idea that this neural robot, this neural robot, while they have very similar hardware style, they're still going to be two very different systems, whereas chat GPT, which was, let's say, or a transformer, let's not pick on chat GPT, but any of these big neural models that was, let's say, pre trained, and then, you know, consolidate and said, I'm going to clone you into these systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.053,
    "end": 3942.061,
    "text": " maybe their inference system, their inferences might lead them to uncover different data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.121,
    "end": 3950.154,
    "text": "But at the end of the day, the particularities and quirks of the software, they're kind of tied to the same origin point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.174,
    "end": 3964.056,
    "text": "So I think that amount of adaptivity and the essence of how we, again, find ourselves towards the NESS, the non-equilibrium steady state, is really dictated by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.036,
    "end": 3986.466,
    "text": " that particular knowledge and information that's encoded in your body and so that's where we can touch on and i know you're familiar with the embodiment thesis or embodied cognition i think that's the other part to mortal computation that's important is that the body offloads some of this cognition whereas again even in the the chinese room version of chat gpt or whatever uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.767,
    "end": 3994.987,
    "text": " we're not necessarily using bodily non-neural like components to sort of offload this cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.048,
    "end": 4000.842,
    "text": "So that blending and that combination is not there in those types of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4000.862,
    "end": 4003.729,
    "text": "So perhaps that's where I think maybe I just wanna remind that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.709,
    "end": 4018.276,
    "text": " The immortal computation really refers to that entanglement, that co-design of the software with the hardware, the substrate, and the intelligent algorithm that you design, if that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.676,
    "end": 4018.977,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.997,
    "end": 4019.277,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.538,
    "end": 4020.279,
    "text": "That makes perfect sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.299,
    "end": 4024.587,
    "text": "And yeah, it brings in embodiment very nicely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4025.63,
    "end": 4033.76,
    "text": " Yeah, so let's go into our triple stasis words, acis and where the limit stops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.221,
    "end": 4037.144,
    "text": "So I think people will be aware of what homeostasis is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.224,
    "end": 4049.399,
    "text": "It's this, you know, this description of the fact that biotic organisms have certain bounds that they have to retain, you know, remain within in order for their survival to be viable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.0,
    "end": 4051.702,
    "text": "So you know, we actually will learn this at school.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.223,
    "end": 4055.046,
    "text": "But you can think of glucose levels, or you can think of temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.667,
    "end": 4060.033,
    "text": " Something a bit more foreign to people is allostasis, which is actually quite simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.614,
    "end": 4074.313,
    "text": "It's just the idea that cognizers capable of greater temporal planning can take prospective action to minimize future homeostatic problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.853,
    "end": 4078.198,
    "text": "So if I look outside of my window and I see it's snowing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.837,
    "end": 4086.405,
    "text": " I can plan in advance and put on a coat before I go because I know if I go out there, I'm going to have these dis homeostatic outcomes because I'm going to freeze to death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.446,
    "end": 4093.792,
    "text": "But maybe my dog, although they love my dogs, they love the snow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.812,
    "end": 4094.573,
    "text": "They don't really mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.613,
    "end": 4095.394,
    "text": "But let's say they did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.414,
    "end": 4096.936,
    "text": "They might freeze to death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.076,
    "end": 4097.917,
    "text": "Actually, they probably wouldn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.338,
    "end": 4102.361,
    "text": "But it's fuzzy who has what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.082,
    "end": 4106.886,
    "text": "But then you introduced this third term, you and Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.963,
    "end": 4109.445,
    "text": " Homeoresis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.528,
    "end": 4111.989,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.229,
    "end": 4114.552,
    "text": "Homeoresis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.316,
    "end": 4117.737,
    "text": "Wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.077,
    "end": 4119.66,
    "text": "Homeoresis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.823,
    "end": 4124.326,
    "text": "Let's just start with what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.348,
    "end": 4125.448,
    "text": "Sure."
  },
  {
    "start": 4125.428,
    "end": 4143.184,
    "text": " So the really simple way to think about it, so that way those that are familiar with homeostasis, so you could state homeostasis as there's a set point or a particular, there's kind of flavors of it, a number, an average number or a range.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.4,
    "end": 4170.218,
    "text": " you want to keep like your temperature again so that we avoid leaving the non-equilibrium steady state and dying um so we want to keep things within a range and we want to keep things relatively constant right that's what homeostasis ultimately says um and then you built on it home allostasis is predictive homeostasis right it's trying to serve homeostasis to prevent that hormiohesis one way you could take it is it's time varying homeostasis so that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.434,
    "end": 4177.026,
    "text": " the first place you could move to, which is what if that set point was changing with time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.126,
    "end": 4178.188,
    "text": "It was dynamical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4178.929,
    "end": 4182.716,
    "text": "So in that sense, that almost gets you roughly to hormiohesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.257,
    "end": 4186.964,
    "text": "A better way to, so that's one way to build on the audience's knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.984,
    "end": 4191.312,
    "text": "Another way to state hormiohesis is that instead of it being like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.612,
    "end": 4200.711,
    "text": " or a process returns to a set point or constant value or within a range, you are returning to a trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.248,
    "end": 4207.777,
    "text": " So that's, it's where it's like, it's a random dynamical systems view of homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.137,
    "end": 4211.662,
    "text": "Whereas homeostasis is talking about constant return to a constant point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.982,
    "end": 4214.105,
    "text": "Here we are returning to a trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4214.325,
    "end": 4215.487,
    "text": "So this, that's very cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.667,
    "end": 4216.809,
    "text": "The time evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4217.069,
    "end": 4218.971,
    "text": "And I think that to me made more sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.532,
    "end": 4222.356,
    "text": "So I'd say that would be hormiohesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.516,
    "end": 4225.12,
    "text": "Oh, and then by the way, a fun variation to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.881,
    "end": 4229.385,
    "text": "And again, you won't find these too common around is hormiohetic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4229.906,
    "end": 4230.006,
    "text": "Okay."
  },
  {
    "start": 4229.986,
    "end": 4236.474,
    "text": " So if you want to say something is homeostatic, you would also say it's homeohetic or a homeo process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.494,
    "end": 4237.795,
    "text": "Try saying that a few times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.276,
    "end": 4238.596,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.157,
    "end": 4243.902,
    "text": "I think Carl just peruses the dictionary and just manages to- It's amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4244.363,
    "end": 4245.024,
    "text": "It is amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.224,
    "end": 4245.745,
    "text": "It is amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.726,
    "end": 4246.926,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.946,
    "end": 4253.013,
    "text": "That's really interesting because, so again, this is kind of converging with a lot of the reading that I've been doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.033,
    "end": 4256.297,
    "text": "I've been trawling back through Andy Clark's work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4256.665,
    "end": 4260.829,
    "text": " And he has a wonderful, wonderful paper called knitting your own Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.209,
    "end": 4263.131,
    "text": "Yeah, which is fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.171,
    "end": 4277.844,
    "text": "And he talks about how, and I think this is a reasonable critique that was leveraged at the free energy principle and active inference in its original inception, is that it kind of took the Markov blanket as a fixed statistical entity, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.685,
    "end": 4286.672,
    "text": "And therefore, the particle, the internal states and the external states, they didn't really allow for, you know, dynamical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.057,
    "end": 4292.664,
    "text": " the unfolding of what dynamical systems theory predicts, which are trajectories, as you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.445,
    "end": 4299.492,
    "text": "So Andy Clark says, well, let's take less of a substantial ontology and think more process ontologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.993,
    "end": 4310.365,
    "text": "So in the same way as a butterfly is not the same thing through the course of its lifespan, we can still identify the butterfly through a process ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.969,
    "end": 4328.367,
    "text": " Now, there's a really interesting part of your paper that I, you know, there's actually, I'm really glad that we touched on this because you say a morphogenetic system from a cybernetics point of view is one that maintains its continuity and integrity by altering essential aspects of its organization and or structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.968,
    "end": 4330.632,
    "text": "And I thought this was just like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.612,
    "end": 4335.497,
    "text": " really interesting, because no one I think would have expected the word altering there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.018,
    "end": 4341.003,
    "text": "They would have thought that continuity and integrity is going to be the maintenance of its organization and structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.444,
    "end": 4345.368,
    "text": "So I've written here, at what point does a morphogenetic system change its identity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4345.408,
    "end": 4349.473,
    "text": "And what is the distinction between identity and organization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4350.454,
    "end": 4358.863,
    "text": "Because we can have, as you say, on the arc of a lifespan, on the trajectory, we have different points at which we can say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4359.518,
    "end": 4363.425,
    "text": " Self-organization, according to this statistical dynamics is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.506,
    "end": 4370.058,
    "text": "But 10 years later, there's a whole different scope of self-organization, but it's still self-organizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.399,
    "end": 4371.561,
    "text": "That process is still going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.362,
    "end": 4375.448,
    "text": "But we don't want to call these two distinct entities, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.548,
    "end": 4380.598,
    "text": "The caterpillar and the butterfly or the baby and the adult, because there seems to be some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.933,
    "end": 4383.357,
    "text": " integrity or continuity to use your language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.519,
    "end": 4386.622,
    "text": "Is that just an illusion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.523,
    "end": 4387.864,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.104,
    "end": 4397.358,
    "text": "You know, I come from this from the works of people like Derek Parfit, who say that, well, there is no single substantial self, it's psychological continuity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.28,
    "end": 4405.171,
    "text": "But in a sense, you can almost bracket that psychological continuity off again, we're talking about lens of analysis and say, Okay, well, that's the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.651,
    "end": 4407.434,
    "text": "Yeah, that the self, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.454,
    "end": 4409.337,
    "text": "That's what that's what matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4410.211,
    "end": 4429.097,
    "text": " in the same way you can say okay we're no longer really concerned about the difference between the caterpillar and the butterfly what we're talking about is the fact that butterflies follow because of genetic reasons this path and we can identify the path now as what a butterfly caterpillar is so all of that to say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4430.427,
    "end": 4434.493,
    "text": " how do you resolve this tension between identity and organization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4434.513,
    "end": 4442.926,
    "text": "Because it seems to capture reality, we really do have to integrate this dynamism and this in this, these flows over time and these changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.409,
    "end": 4449.816,
    "text": "Wonderful example of the butterfly in the catapult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.836,
    "end": 4450.837,
    "text": "I think it's Andy's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.719,
    "end": 4453.962,
    "text": "Yeah, I've read that somewhere too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.062,
    "end": 4457.447,
    "text": "I know Carl refers to it in one of his works as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.728,
    "end": 4459.27,
    "text": "Probably Andy, I don't I don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4459.908,
    "end": 4481.899,
    "text": " um so there's a lot to unpack there but the one concept i'll just say to start before i forget it is that the butterfly and the caterpillar example you'd say well okay are they different right you know i consider that and this is where again since we did start earlier with hormeohesis which was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4482.098,
    "end": 4506.957,
    "text": " returning to a trajectory rather than returning to a constant value, you can sort of borrow that idea of time evolving systems and just saying that the fact that that butterfly is a projection or a continuation of that caterpillar's identity, the fact that evolution, that change is the caterpillar butterfly system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.197,
    "end": 4509.861,
    "text": "That is the one object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4509.841,
    "end": 4512.629,
    "text": " And so that's kind of like that evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4512.669,
    "end": 4519.548,
    "text": "And I do think I touch on it in here in some way or another about that, that changes you, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.789,
    "end": 4521.594,
    "text": "That evolution changes you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.614,
    "end": 4524.542,
    "text": "Because again, because we are hormeohedic,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4524.893,
    "end": 4544.094,
    "text": " your, your, the variables and the right critical ranges and things will change with time as well, you'd say, well, the way aren't you aren't what aren't all organisms defined by this very specific set point, the idea is that you have to remember, you are an open system, and you live in an environment that itself changes with time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4544.114,
    "end": 4547.458,
    "text": "So the idea is that because that is evolving as well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4547.438,
    "end": 4549.801,
    "text": " And also it's changing because of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.981,
    "end": 4552.965,
    "text": "You remember we talked earlier about niche construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4553.586,
    "end": 4555.628,
    "text": "We are acting and changing our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4555.648,
    "end": 4557.251,
    "text": "So we need to constantly be changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.252,
    "end": 4562.057,
    "text": "So that evolutionary process I think of is your identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.117,
    "end": 4570.948,
    "text": "And I could have swore it might have been Andy or Carl in reference to Andy or someone that was referring to his work about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.928,
    "end": 4579.402,
    "text": " you can look at metamorphosis as still that, that is part of your, it's also part of your identity preservation because it's like an adaptation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.422,
    "end": 4582.507,
    "text": "An activity to a time evolving universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.23,
    "end": 4586.353,
    "text": "You also asked earlier, so to make sure I connect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.373,
    "end": 4592.203,
    "text": "So that's the simple answer is that I still see the, the butterfly as the caterpillar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.283,
    "end": 4593.886,
    "text": "It's just not called a caterpillar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.906,
    "end": 4597.712,
    "text": "It's a, it's the identity is still there, but the structural form,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.692,
    "end": 4609.886,
    "text": " has been right in part of that trajectory that it's so the cat and again, though, we can also say caterpillars generally always end up metamorphic into a butterfly trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4610.267,
    "end": 4611.37,
    "text": "So that is distinct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.51,
    "end": 4613.355,
    "text": "That is that particular insect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4613.335,
    "end": 4614.336,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4614.777,
    "end": 4620.104,
    "text": "Same thing with a human has a different trajectory in the same way you could use your favorite animals like your dogs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4620.124,
    "end": 4622.948,
    "text": "You mentioned your dog earlier was a puppy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.469,
    "end": 4625.031,
    "text": "Puppy the same as the full grown dog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4625.051,
    "end": 4626.092,
    "text": "Well, there was a trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.112,
    "end": 4627.093,
    "text": "It was the growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4627.614,
    "end": 4633.242,
    "text": "Growth is part of the mortal computation framework, and we did make sure to put that in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.282,
    "end": 4640.912,
    "text": "And there's different ways to characterize growth, regeneration and decay in death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.892,
    "end": 4663.879,
    "text": " uh but you said earlier about identity and organization um so i want to be a little careful because there's also the world of i am familiar with philosophy of mind but i don't want to get too much in there and start angering philosophers we've already probably angered a little bit with our ignorance on physics so let's not try to step on too many toes but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.859,
    "end": 4669.774,
    "text": " So the way I thought about it in Mortal Computation is there's this idea of organization and structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4669.934,
    "end": 4674.485,
    "text": "You did bring up morphism, so this will help connect all those parts for the audience that heard these words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.328,
    "end": 4679.117,
    "text": "And I think of them as sort of two different complementary things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.097,
    "end": 4682.182,
    "text": " Then I'll tell you where identity comes into this picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4683.184,
    "end": 4693.0,
    "text": "Organization from a self-organizing dynamical systems cybernetics perspective is the parts and the relationships between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4693.521,
    "end": 4698.81,
    "text": "A human might say, you could say, well, we have two arms and two legs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4698.79,
    "end": 4723.178,
    "text": " we are organized according to this way our cells are arranged and you know have certain relationships to each other structure is the instantiation of the organization it is that specific you Darius are very different than me in your instantiation in this universe right you and I are both humans right we both have rough organization of parts but our physical embodiment our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4723.158,
    "end": 4732.819,
    "text": " actual instantiation into this moment in time is that organization expressed right in a biological form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.859,
    "end": 4735.886,
    "text": "But again, you could talk about as in silico entities as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4736.688,
    "end": 4739.935,
    "text": "And so the nice thing about thinking about organization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4739.915,
    "end": 4744.444,
    "text": " And this is where, again, like that idea of like organizational closure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.464,
    "end": 4746.448,
    "text": "We use that in our mission as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.488,
    "end": 4753.142,
    "text": "As long as you have sort of these arrangement of parts and these relationships between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4753.222,
    "end": 4753.382,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4753.402,
    "end": 4754.484,
    "text": "And it's very abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.564,
    "end": 4760.877,
    "text": "It's kind of like it doesn't want to tell you exactly what you need to create to create this, for example, animal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.857,
    "end": 4762.98,
    "text": " That's the identity, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.06,
    "end": 4764.702,
    "text": "It is these rough relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.722,
    "end": 4772.032,
    "text": "So that's where I want to, I don't particularly divorce the idea of the identity, that rough organization of parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.052,
    "end": 4777.059,
    "text": "And I say rough because, you know, again, we think of it as an evolving trajectory as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.74,
    "end": 4779.222,
    "text": "The structure itself is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.502,
    "end": 4785.21,
    "text": "And that's what's kind of nice is that changes on a faster time scale, if anything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.19,
    "end": 4788.974,
    "text": " So the fact that you and I started as babies and we are now adults, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.375,
    "end": 4793.219,
    "text": "That is because cells are growing, cells are being born, cells are dying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4793.279,
    "end": 4796.423,
    "text": "There's also pre-programmed cell or sorry, programmed cell death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4796.523,
    "end": 4800.267,
    "text": "Apoptosis, I believe was another word we threw in there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4800.968,
    "end": 4807.435,
    "text": "And so ultimately, our structure is constantly taking damage from the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4807.634,
    "end": 4810.718,
    "text": " And it's also saying, okay, well, I want to repair that damage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.758,
    "end": 4814.684,
    "text": "And that's where the morphogenetic, morphogenesis kind of concepts come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4815.104,
    "end": 4819.651,
    "text": "You and I, I think a better example, you can even think about neurons in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.452,
    "end": 4823.877,
    "text": "Neurons live for a certain time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.957,
    "end": 4825.86,
    "text": "Synapses live on a much less time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4825.88,
    "end": 4832.188,
    "text": "Many synapses die within so many minutes or seconds and cells die every day, but then they're grown and reborn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4832.228,
    "end": 4836.915,
    "text": "So you and I are no longer the same exact collection of cells that we were a few days ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.895,
    "end": 4842.17,
    "text": " We are different physical embodiment, yet you're still Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4842.19,
    "end": 4851.917,
    "text": "Your identity is still roughly there, even if maybe you have a few more cells and you're growing and adapting to your environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4851.897,
    "end": 4857.984,
    "text": " I think that's an important kind of concept is to think about the difference between organization and structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.024,
    "end": 4865.012,
    "text": "They're not actually the same thing, which again, if you're not familiar with distinction, you might assume, well, aren't I the same structure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4865.833,
    "end": 4866.593,
    "text": "No, you're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.654,
    "end": 4870.258,
    "text": "That's kind of like the actual component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.278,
    "end": 4875.103,
    "text": "The physical substrate itself is in a constant process of death and birth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.083,
    "end": 4879.511,
    "text": " and repair and damage and even the processes themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4879.591,
    "end": 4887.265,
    "text": "And at some point or another in the paper, we talk about that even the processes of repair are repairing themselves or decay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4887.285,
    "end": 4888.748,
    "text": "So there's this constant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4888.768,
    "end": 4894.297,
    "text": "So this is where, again, although all that blabbing that I just did goes back to, again, that trajectory, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.578,
    "end": 4899.066,
    "text": "You are a trajectory rather than a fixed set of things that need to maintain them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.046,
    "end": 4905.092,
    "text": " exactly as they were, because your dissolution into the environment is that trajectory no longer being there, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4905.252,
    "end": 4911.297,
    "text": "You're not able to actually maintain your hormiohesis, which is returning to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4911.317,
    "end": 4918.444,
    "text": "And I like, hormiohesis is such a great word because it really just reflects the idea of what we said earlier, the non-equilibrium steady state, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4918.464,
    "end": 4921.086,
    "text": "We always want to return to that, but that state, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4921.366,
    "end": 4928.353,
    "text": "Whatever that might be to ensure your continued organization, your continued identity is changing with time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4928.373,
    "end": 4928.513,
    "text": "Because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4928.493,
    "end": 4956.525,
    "text": " the condition the environment are changing you are in a naturally evolving system just by basis of you yourself acting on it so everything is constantly evolving so i guess there might be a tension i have i guess in perhaps i entered the the chat entered the discussion uh late enough that uh i don't see i don't see a problem with the metamorphosis i see that as that is the fact that you are your you are a trajectory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4956.505,
    "end": 4959.412,
    "text": " And so entity still continues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.693,
    "end": 4962.22,
    "text": "It's just your physical structure might be different, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.24,
    "end": 4963.563,
    "text": "And that explains growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.047,
    "end": 4967.914,
    "text": "There is one final tiny point I'll add to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.676,
    "end": 4972.506,
    "text": "And I got to be careful where I use the word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4972.486,
    "end": 4989.178,
    "text": " when we were talking about the cybernetics it's funny how biophysics and cybernetics they sort of have similar word different words for the same kind of concept uh i think that uh yeah that that's a tata almost tautological kind of way of you know viewing it but um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4989.58,
    "end": 5005.902,
    "text": " One thing that they have in cybernetics is called self-replication, which is what we used in the cybernetics backend of the mortal computer in this paper to explain that systems will produce more of those parts as they organize, and you can think of them as cells growing or dying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5005.882,
    "end": 5012.554,
    "text": " And if you add mutation to the self-replication, you get reproduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5012.574,
    "end": 5019.668,
    "text": "So that is where you get this concept of, okay, well, what if, for example, you have offspring one day?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5019.708,
    "end": 5026.32,
    "text": "You have a daughter or a son, and they are a continuance also of your identity in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5026.469,
    "end": 5030.74,
    "text": " Because they are still subject to all the conditions that you were subject to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5030.92,
    "end": 5033.667,
    "text": "They still need to find their non-equilibrium steady state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5034.048,
    "end": 5043.432,
    "text": "They need to preserve their organizational closure, their identity with an evolving structure or a morphological instantiation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5043.412,
    "end": 5046.418,
    "text": " In a way, your identity is carried on through them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5046.498,
    "end": 5060.526,
    "text": "And then Carl had this really nice it was, again, one of those interviews he had in the past that it's also a way of getting what's called optimal Bayesian forgetting, where as you get older,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.506,
    "end": 5084.843,
    "text": " you get more set in your ways you become wise but you're less able to change and so that's the the cycle part the evolutionary uh evolutions kind of answer to saying that okay you are not adapting as well as you could or as effectively because the optimal thing would be is you say okay let me start over let me this would be related to like your neural information but you know let me start over again well you kind of can't right you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5084.823,
    "end": 5095.847,
    "text": " You have continuously self-evidenced to a point that things are more easily predictable for your internal generative model, which is one way of looking at your identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5096.489,
    "end": 5098.894,
    "text": "And you are now kind of rigid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.914,
    "end": 5100.217,
    "text": "You're less likely to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.237,
    "end": 5102.883,
    "text": "You have certain heuristics that you've established, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.144,
    "end": 5104.266,
    "text": "So that's why you have offspring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.246,
    "end": 5128.347,
    "text": " then you have you know you're the next generation and they don't have the same constraints they're more flexible they're more plastic they're more able to change whereas you were less able to however your identity still continues it might not continue directly obviously you know if you have let's say a son not exactly they're not darius but they have elements of you in there right you know the things you've interacted with them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5128.327,
    "end": 5130.03,
    "text": " the knowledge that you imparted with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5130.05,
    "end": 5140.105,
    "text": "So you could even think of I'm going a little a little beyond the rails here of the paper, but we do touch on just like reproduction is just the mutated self-replication concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5140.205,
    "end": 5148.078,
    "text": "And, you know, once you have that, you know, that's how you preserve your identity and project it even further into the future in a somewhat more abstract way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5148.098,
    "end": 5154.047,
    "text": "I also think and at risk of blabbing any further, I'll stop here is that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.027,
    "end": 5158.253,
    "text": " it connects nicely to one of the other motivations towards the beginning of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5158.313,
    "end": 5173.234,
    "text": "We only briefly and I don't want that to be kind of like a sticking point, touch on the philosophy of life and death or existential, which is a lot broader, and it touches on a lot of other bigger concepts than I think, mortal computation, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5173.214,
    "end": 5181.77,
    "text": " We borrowed this idea, the fact that, and you said it earlier as well, the fact that, oh, because you brought up Heidegger and being entitled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.79,
    "end": 5189.344,
    "text": "The fact that we know that there is an end and that we project towards the end, we sort of act because of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.424,
    "end": 5192.37,
    "text": "And that's where I connected back to the reproduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5192.35,
    "end": 5207.541,
    "text": " we impart information we teach right we express ourselves through music or art um i think it's a nice kind of cultural connection uh from the idea of even mortal computation which is that that's how you pass on your knowledge you're encoding your information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5207.521,
    "end": 5210.605,
    "text": " in your offspring and giving them somewhat of a prior, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5210.926,
    "end": 5219.537,
    "text": "And then, of course, they'll obviously adapt and, you know, can do their self-evidencing and modify their posterior according to the data they acquire from the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5219.557,
    "end": 5224.203,
    "text": "But that's your way or your identity still carries on in perhaps a direct way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5224.243,
    "end": 5228.729,
    "text": "But that's a projection far beyond your own physical end in death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5229.17,
    "end": 5232.955,
    "text": "So I thought that was a nice thing we did is that we touched on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5232.935,
    "end": 5247.108,
    "text": " Because there's naturalist philosophy, which is, I think, a little bit closer to what motivates the idea of mortal computation, but that existentialism is kind of there under the hood, and you sort of realize, well, okay, that's why we act the way we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5247.168,
    "end": 5259.18,
    "text": "We know that this isn't going to continue forever, which stands in stark contrast to the artificial intelligence systems that we have today, which, in principle, they don't have a known end, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.46,
    "end": 5262.823,
    "text": "They theoretically keep running, being copied on to a different system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.803,
    "end": 5263.864,
    "text": " So I think I'll stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5264.185,
    "end": 5266.787,
    "text": "Yeah, or at least they wouldn't know, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.849,
    "end": 5282.425,
    "text": "I mean, yeah, I mean, a whole branch of therapy and philosophy, terror management theory, Ernst Becker, denial of death, points exactly to what you're saying, which is that we are motivated by finality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5282.905,
    "end": 5291.815,
    "text": "Whether that's as strong as Ernst Becker, that everything we do is governed by the specter of death, you know, we create works of art for a legacy, we have children and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.25,
    "end": 5300.038,
    "text": " I like the Heideggerian view, which is that there's this very sort of subtle future orientation in all of our actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5301.119,
    "end": 5303.702,
    "text": "It doesn't have to be as concrete as creating a masterpiece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.143,
    "end": 5316.855,
    "text": "But it's just the fact that, and this actually might point to the incapacity for presentness in some sense, is that we always have to be thinking, even if it's implicit, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5316.875,
    "end": 5319.878,
    "text": "Because self-organization is always for T plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5319.993,
    "end": 5321.515,
    "text": " because T's already been taken care of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5321.535,
    "end": 5321.995,
    "text": "You're there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5322.456,
    "end": 5323.918,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.198,
    "end": 5325.42,
    "text": "Yeah, it's all really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.56,
    "end": 5326.241,
    "text": "I love that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5326.261,
    "end": 5334.01,
    "text": "There's some really amazing work that's being done on existentialist philosophy and active inference on Heidegger and Husserl and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5334.03,
    "end": 5337.795,
    "text": "Yeah, there was a couple of things that came to mind that I think is worth contributing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5337.815,
    "end": 5343.081,
    "text": "I think one is a notion of philosophical vagueness that's often forgotten, which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.736,
    "end": 5370.722,
    "text": " some questions are just open right at what point system a becomes system b or what point it retains its anus yeah derek parfit who again i mentioned is really influential he just says it's an open question there is no answer right and you know it's it's uh theseus's ship or it's sorry it's paradox at what point does the grain of sand the accumulation of the grain of sand become the heap well depends on who you ask and that's fine i mean it might just be our proclivity to have um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.343,
    "end": 5372.805,
    "text": " binary results, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.825,
    "end": 5374.106,
    "text": "We just want a yes or a no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.687,
    "end": 5380.874,
    "text": "The other thing that came to my mind was that, yeah, you know, we're talking a lot here about change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5381.094,
    "end": 5387.701,
    "text": "I guess the one thing that remains is the mechanism to be able to say that you are a thing has to be the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.741,
    "end": 5400.135,
    "text": "Now, whether you call that self-evidencing or self-organization or the fact that you are matching operational closure with thermodynamic openness or sense-making, whether you're the caterpillar or the butterfly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5400.368,
    "end": 5401.911,
    "text": " you're still abiding by those laws.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5402.612,
    "end": 5407.341,
    "text": "And so I think that's where Carl's stressing that the free energy principle doesn't tell you what's going to be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5408.002,
    "end": 5410.907,
    "text": "It doesn't tell you what's going to be there now or in the past or in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5411.108,
    "end": 5420.084,
    "text": "It might come to that because I know they're doing things about scaling up Markov blankets and now we're having dynamic Markov blankets and wheat Markov blankets, but it's very raw form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5420.465,
    "end": 5423.17,
    "text": "It just tells you if something is here now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.622,
    "end": 5428.837,
    "text": " And if it's going to be there at T plus one, then we're going to say they're the same thing axiomatically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5429.559,
    "end": 5434.433,
    "text": "They must be minimizing free energy just on pure, quite boring maths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5435.095,
    "end": 5436.72,
    "text": "And so it made me think that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.903,
    "end": 5443.179,
    "text": " All of this stuff hinges on the fact that there is some level of self-evidencing going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5443.42,
    "end": 5445.285,
    "text": "The mechanism itself stays the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5445.766,
    "end": 5446.047,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.147,
    "end": 5448.072,
    "text": "I thought that was interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5448.132,
    "end": 5449.155,
    "text": "All right, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.636,
    "end": 5453.646,
    "text": "You're still interacting with your environment through your Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5453.626,
    "end": 5460.078,
    "text": " The morphological substrate instantiation of it evolves with time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5460.439,
    "end": 5462.283,
    "text": "It's still a market blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5462.303,
    "end": 5464.607,
    "text": "You're still interacting with sensory and active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5464.707,
    "end": 5466.992,
    "text": "You're sense-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.094,
    "end": 5474.065,
    "text": "What's cool about Evan Thompson's work and the inactive tradition is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5474.551,
    "end": 5480.377,
    "text": " the autopoiesis is is is also so it's not just that sense make is happening, but also autopoiesis is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.737,
    "end": 5482.839,
    "text": "It just depends on your scale of analysis, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.879,
    "end": 5488.705,
    "text": "So you have cell autopoiesis as well as cell sense making, but that's embedded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5488.785,
    "end": 5501.457,
    "text": "It's not it's not distinct, it's embedded within the auto poetic sense making of a nervous system, which itself is doing sense making because it's got action, it's got sensory motor relations going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.057,
    "end": 5502.718,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5503.39,
    "end": 5511.203,
    "text": " It's not just that this is transformative of X to Y, it's also recursive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5512.645,
    "end": 5518.134,
    "text": "That you could have A and B bracketed within A or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5518.235,
    "end": 5520.178,
    "text": "It's like language in many ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.198,
    "end": 5525.787,
    "text": "We've just got loads of relative clauses and these are embedded Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5525.969,
    "end": 5527.351,
    "text": " We also do that in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.411,
    "end": 5532.677,
    "text": "We also have a, I don't know if you caught that, Mortal Computers within Mortal Computers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5532.737,
    "end": 5536.182,
    "text": "We had a C subunit, because I did talk about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5536.222,
    "end": 5537.844,
    "text": "Yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.864,
    "end": 5542.009,
    "text": "Yeah, and one Mortal Computer sets the set point of another Mortal Computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5542.029,
    "end": 5546.474,
    "text": "So you get that recursive, beautiful construction that you just mentioned there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5546.514,
    "end": 5548.256,
    "text": "You can have that in the framework as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5548.377,
    "end": 5548.897,
    "text": "I like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.278,
    "end": 5549.878,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5550.059,
    "end": 5551.2,
    "text": "It's wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5551.619,
    "end": 5558.629,
    "text": " So I wanted to ask one more kind of specific technical thing about the paper and then a couple final more, you know, more general questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5558.789,
    "end": 5559.33,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5559.35,
    "end": 5561.312,
    "text": "I thought this notion I'd never come across before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5561.352,
    "end": 5564.457,
    "text": "And I was really, I really liked it was cybernetic variety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.538,
    "end": 5567.321,
    "text": "Ah, I thought this was really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5567.481,
    "end": 5569.664,
    "text": "And the law of requisite variety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5570.625,
    "end": 5574.851,
    "text": "I thought these were really, really fascinating additions to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5574.931,
    "end": 5579.938,
    "text": "By the way, for people wondering, because, you know, this is in the paper, this in the paper, the paper is brilliant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5580.577,
    "end": 5583.347,
    "text": " big and bold and it's got a lot in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5583.689,
    "end": 5585.054,
    "text": "And it has an appendix too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.636,
    "end": 5586.64,
    "text": "And it has an appendix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.041,
    "end": 5587.724,
    "text": "I didn't read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.764,
    "end": 5589.852,
    "text": "You didn't need to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5589.872,
    "end": 5590.755,
    "text": "You didn't need to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5591.512,
    "end": 5594.776,
    "text": " The paper's fantastic, but yeah, it has a lot in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5594.916,
    "end": 5598.321,
    "text": "And I really enjoyed this bit on cybernetic variety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5598.762,
    "end": 5601.946,
    "text": "So maybe just for our audience, if you could explain what that means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5602.687,
    "end": 5603.007,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5603.027,
    "end": 5608.795,
    "text": "And I remember too reading that there was, even in cybernetics, confusion as to what variety was.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5608.975,
    "end": 5611.258,
    "text": "But I think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5611.238,
    "end": 5616.929,
    "text": " The simplest way to look at it is that it's the number of states in an entire system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5617.109,
    "end": 5619.233,
    "text": "So the cardinality of the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5619.714,
    "end": 5626.727,
    "text": "So very specifically, it's actually the log base two of the cardinality of the state space to give it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.128,
    "end": 5629.973,
    "text": "So we got to give... So the thing I...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5630.24,
    "end": 5637.188,
    "text": " We got to give Ross Ashby, who's the author of things like the law of requisite variety and the good regulator theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5637.208,
    "end": 5643.356,
    "text": "Actually, one of the one of the many core contributors to the field of cybernetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5643.376,
    "end": 5648.202,
    "text": "We got to talk about Wiener and the other wonderful guys that were cybernetics as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5648.222,
    "end": 5653.648,
    "text": "But Ross Ashby made some really wonderful contributions and.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.628,
    "end": 5657.792,
    "text": " So variety effectively is like I said, the different number of different states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5658.413,
    "end": 5663.398,
    "text": "And I was thinking about this last night in preparation for this meeting just to remind myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5663.878,
    "end": 5673.768,
    "text": "So one thing you can think of it is that you have the number of distinct kind of configurations and you could think of I'll use an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.808,
    "end": 5675.11,
    "text": "I think it's better to explain it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.47,
    "end": 5678.573,
    "text": "Let's say you're trying to debug",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5678.553,
    "end": 5681.159,
    "text": " the fact that your light's not turning on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5681.5,
    "end": 5684.948,
    "text": "You have one component you could look at, which is the light switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5685.77,
    "end": 5690.019,
    "text": "The light switch itself has two states, on or off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5690.581,
    "end": 5691.422,
    "text": "It's binary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5692.264,
    "end": 5695.191,
    "text": "The variety of that's actually log base two of two, which is one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5695.392,
    "end": 5697.777,
    "text": "There's one difference or distinction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5697.757,
    "end": 5715.732,
    "text": " and that's right one that's where the word variety i believe really gets it um but no one really quite says it except ross ashby in his textbook you can find it somewhat described in there um there's one distinction between the on and the off seat and that's by the way that is variety right there and it's wholesale but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.712,
    "end": 5719.801,
    "text": " One way to think about you're trying to debug why your light's not turning on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.821,
    "end": 5723.849,
    "text": "So you identify, oh, the problem is in the light switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5724.871,
    "end": 5728.058,
    "text": "So this will help us understand the law of requisite variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5728.098,
    "end": 5735.273,
    "text": "You had one controllable changeable aspect of the environment, which was one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5735.253,
    "end": 5741.719,
    "text": " And you had one hypothesis or one kind of thought internally about how to fix that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5742.14,
    "end": 5746.944,
    "text": "And so one, you had internal variety of one and the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5747.485,
    "end": 5748.826,
    "text": "Ah, yes, I see where you're going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5748.946,
    "end": 5749.146,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5749.206,
    "end": 5752.249,
    "text": "Just to help us connect parts together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5752.63,
    "end": 5755.412,
    "text": "Variety is useful to understand the cybernetic principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5755.973,
    "end": 5757.594,
    "text": "Okay, so that's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5757.654,
    "end": 5761.598,
    "text": "Internal variety was one, external variety was one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.814,
    "end": 5766.665,
    "text": " Now, let's say that it wasn't the problem, the light switch is not the reason why it's not broken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5767.005,
    "end": 5769.371,
    "text": "So now you have to figure out something else in the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5769.391,
    "end": 5779.553,
    "text": "So there's also, let's say, I don't know, a battery or an internal component that's really, I'm not going to give us the right electronics engineering, but there's another component that you figure out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5779.533,
    "end": 5782.616,
    "text": " It's either broken or not broken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5782.757,
    "end": 5788.203,
    "text": "It had these two possible states or let's say it's either this or it's that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5788.503,
    "end": 5790.285,
    "text": "You figure out that was the source of the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5790.585,
    "end": 5796.572,
    "text": "Well, your variety is two because it's a sum of these independent components that make up the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.772,
    "end": 5805.381,
    "text": "You had two binary states and you just sum up these independent components that are not necessarily we're going to act as if they are directly jointly distributed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5805.421,
    "end": 5806.823,
    "text": "They are independent components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5807.056,
    "end": 5812.421,
    "text": " you solve the problem, your internal variety was two, the external variety was two, you solve the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5812.601,
    "end": 5815.664,
    "text": "Because solving the problem, by the way, is that you found stability, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5815.964,
    "end": 5819.707,
    "text": "You fix the issue that you don't want to be in a dark room, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5819.727,
    "end": 5821.989,
    "text": "That's kind of against your life, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5822.07,
    "end": 5824.772,
    "text": "That's sort of like you want the room to be lit up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5825.232,
    "end": 5826.694,
    "text": "So that was the other thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5826.734,
    "end": 5837.063,
    "text": "And so then you could continue extending this out and finding chains of things that are problematic, and you keep summing up the log base two of the number of distinct states that these components have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5837.043,
    "end": 5842.227,
    "text": " But let's say that you just did those two and that wasn't the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5842.763,
    "end": 5843.764,
    "text": " And that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5843.885,
    "end": 5848.171,
    "text": "Those are the only two things you can think of from your internal model of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5848.191,
    "end": 5851.836,
    "text": "You're like, well, there's a light switch, and I know there's a power source to that light switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5852.256,
    "end": 5853.338,
    "text": "I've looked at both those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5854.059,
    "end": 5854.88,
    "text": "They're not broken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5854.9,
    "end": 5858.045,
    "text": "I still have a dark room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5858.565,
    "end": 5862.01,
    "text": "Well, now the environment has greater variety than you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5862.03,
    "end": 5871.083,
    "text": "It turns out that if you had known there's actually a power breaker outside, all you had to do was flip it on and off, and you would have had to turn it back on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5871.063,
    "end": 5872.946,
    "text": " But you never get to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5873.087,
    "end": 5877.835,
    "text": "So the external variety is three, but your internal variety is two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5878.235,
    "end": 5885.007,
    "text": "You have now failed or you are violating the law of requisite variety in the sense that you are not going to be able to solve your problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5885.027,
    "end": 5885.949,
    "text": "You won't survive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5886.009,
    "end": 5891.839,
    "text": "And you could then connect this problem solving back to homeostasis or homeoesis where you're trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5891.819,
    "end": 5899.328,
    "text": " block or protect these life-critical variables or metabolic variables, which Ashby does talk about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5899.348,
    "end": 5909.461,
    "text": "He doesn't maybe always call them metabolic things, but he does use the word homeostasis, which is another way of saying in cybernetics ultra-stability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.501,
    "end": 5917.471,
    "text": "You're able to very quickly go back to that optimal configuration or that good configuration you have currently found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.092,
    "end": 5919.193,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5919.173,
    "end": 5923.481,
    "text": " So that's like the law of requisite variety and helping you define variety all at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5923.521,
    "end": 5929.032,
    "text": "I think it's good to just connect the two varieties useful, though, for like a ton of other principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5929.092,
    "end": 5932.9,
    "text": "And I think you probably you mentioned law of requisite variety and the good regulator theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5933.741,
    "end": 5935.945,
    "text": "There's a lot of other and there's even more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5935.965,
    "end": 5938.33,
    "text": "There's a few others that I didn't include in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5938.31,
    "end": 5961.28,
    "text": " about they're all driven by variety like for example blind selection and retention and order through noise because this touches on I noticed chaotic systems and random dynamical systems there's a lot of relationships and overlap between modern-day cybernetics in those principles but like the idea in terms of variety is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5961.26,
    "end": 5990.71,
    "text": " there are all these states in the environment and what you want to do is you want to try to reduce that variety you want to find configurations where there is less variety because then that will your ultimate goal and we uh carl and i sort of reframed a little bit cybernetics it were reorganized it into these pillars so one of them is what's your goal which is you want ultra stability not just stability ultra stability which is there your ease in which you can self-organize or get back into that condition where again",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5990.69,
    "end": 5993.914,
    "text": " Your internal variety is balanced to the external variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5993.954,
    "end": 5997.019,
    "text": "You're able to continue your homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5997.059,
    "end": 5999.102,
    "text": "You are not going to dissolve or disintegrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6000.283,
    "end": 6002.767,
    "text": "The other one that we had was, what was it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6003.187,
    "end": 6004.789,
    "text": "Regulation or was it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6004.809,
    "end": 6006.231,
    "text": "No, it was growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6006.452,
    "end": 6007.834,
    "text": "Sorry, I got to remember there were three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6008.194,
    "end": 6009.596,
    "text": "The one is growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6009.616,
    "end": 6015.324,
    "text": "Of course, the idea and cybernetics just talk about this is where I said earlier about the principle of self replication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6015.785,
    "end": 6018.048,
    "text": "There are two other principles I just want to tag in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.368,
    "end": 6020.511,
    "text": "The principle of auto catalytic growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6020.491,
    "end": 6046.347,
    "text": " and the principle of recursive systems which is that um you know the idea is that once you start to find the right resources right and assuming that there are enough you're going to grow and grow bigger and bigger and bigger because the idea is that you want to preserve your configuration you want to continue um and then recursive systems just talks about the fact that well these little building blocks as they you know stabilize into configurations and replicate and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6046.327,
    "end": 6067.221,
    "text": " know you get more of them they start to connect to each other and this is how you get complex systems right you can build heterarchical or hierarchical systems and this gets into herbert simon he wrote some nice papers about this so you get more and this is you could relate that to cells like for example single cells organizing and combining together create multicellular structures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6067.201,
    "end": 6073.971,
    "text": " which eventually give rise to organs, which give rise to subsystems and gives rise to complex entities like animals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6075.173,
    "end": 6079.92,
    "text": "And then the final part is regulation, which we just talked about, law of requisite variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6080.42,
    "end": 6084.547,
    "text": "And I should mention too, you want noise in this process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6084.627,
    "end": 6087.511,
    "text": "This is one of the other pillars that helps us search through the space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6087.551,
    "end": 6091.136,
    "text": "This gets a little bit like reinforcement learning for exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6091.457,
    "end": 6093.4,
    "text": "You need noise and then that's how you get order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6093.42,
    "end": 6095.082,
    "text": "It's called the signal to order process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6095.062,
    "end": 6100.634,
    "text": " And then the final component is, like you said, law of requisite variety, the good regulator theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6100.834,
    "end": 6111.838,
    "text": "I don't know if you wanted to make the audience clear on that, but it just basically says in order to be a controller of your environment or something that controls its environment is a model of its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6111.818,
    "end": 6112.219,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6112.38,
    "end": 6114.766,
    "text": "First to its internal generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6115.187,
    "end": 6121.946,
    "text": "And so in order to be good at manipulating and doing niche construction, right, you need to have a good internal generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6122.267,
    "end": 6125.536,
    "text": "And what better generative model than to be a model of your environment or the.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6125.617,
    "end": 6126.84,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6126.82,
    "end": 6132.171,
    "text": " And then there's one last one is called model of internal model controller IMC principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6132.672,
    "end": 6136.039,
    "text": "I just wanted to give that guy that principle credit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6136.36,
    "end": 6136.961,
    "text": "It's not fair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6137.001,
    "end": 6138.705,
    "text": "Sometimes you see like, oh, it's only Ashby.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6138.725,
    "end": 6142.112,
    "text": "It's like, no, there are a lot of other wonderful scientists there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6142.092,
    "end": 6154.065,
    "text": " And that just basically talks about, uh, we talk about a synthesis of a controller and environment, and we want to deem it to be, uh, stable from what's called a closed loop point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6154.105,
    "end": 6156.868,
    "text": "Um, because that's where feedback is introduced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6156.948,
    "end": 6161.213,
    "text": "And so there's this basically just an extension of like the good regulator theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6161.773,
    "end": 6163.175,
    "text": "Uh, I'm trying to remember his name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6163.195,
    "end": 6170.563,
    "text": "This is what makes me feel bad because I wanted to highlight his principle, but he worked actually with Ashby on the good regulator is Conan and Ashby.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6170.543,
    "end": 6172.786,
    "text": " Yeah, Conan, that's the name I wanted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6172.806,
    "end": 6183.701,
    "text": "And he had another principle, the model principle, internal model control, which just talked about, you want us to be you want it to be structurally stable from a closed loop perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6183.761,
    "end": 6186.985,
    "text": "And that that's another component that you would like in your system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6187.045,
    "end": 6191.071,
    "text": "So I think that gives you your definition of right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6191.492,
    "end": 6192.192,
    "text": "That's nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6192.213,
    "end": 6193.955,
    "text": "I got to get more into my cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6195.096,
    "end": 6196.719,
    "text": "Yeah, yeah, really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6197.58,
    "end": 6199.342,
    "text": "There are several things that popped into my head there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6199.362,
    "end": 6199.943,
    "text": "I mean, one is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6200.547,
    "end": 6216.413,
    "text": " I think there's a really nice mapping between the law of requisite variety and Bayesian inference in the sense that to be able to conduct a posterior, I need my states and I need to conduct, okay, what's the probability of the state given an observation, but that itself is making the inference of that state is there in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6216.974,
    "end": 6223.044,
    "text": "So I have to have a kind of isomorphism between the states in my generative model and the states that I know, or my expected states and the states are in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.725,
    "end": 6226.369,
    "text": "That said, something that I was thinking is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6227.834,
    "end": 6251.631,
    "text": " going back to our conversation about entropy and again i'm not going to annoy the physicists but as i reduce my internal variety i'm bringing entropy down which thermodynamically means that i have to be introducing some variety in the environment yeah so i think what's interesting there is i think it's just in the term and i think it's very clever term law of requisite variety it's not like the law of identical variety",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.59,
    "end": 6258.497,
    "text": " Because I have to have enough that I can do sufficient tracking of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6259.198,
    "end": 6266.006,
    "text": "But that doesn't mean that that is sufficient, that I have enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6266.987,
    "end": 6270.391,
    "text": "But where am I going with this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6270.932,
    "end": 6271.973,
    "text": "You know where I'm going with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6272.854,
    "end": 6274.136,
    "text": "I was fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6274.156,
    "end": 6276.058,
    "text": "Yeah, I lost myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6276.138,
    "end": 6278.361,
    "text": "But in the sense that, yeah, as I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6278.695,
    "end": 6289.658,
    "text": " bring, it doesn't mean that the external system and the internal system are always the same, because it just depends on sort of your, again, everything comes back to the kind of lens of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6291.221,
    "end": 6293.025,
    "text": "You might be causing entropy elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6293.174,
    "end": 6297.32,
    "text": " But you just need enough variety so that you can account for your little niche over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6297.34,
    "end": 6297.821,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6297.841,
    "end": 6299.783,
    "text": "I think I got that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6299.883,
    "end": 6304.55,
    "text": "No, I thought that's where you were going because it was talking about your local environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6304.57,
    "end": 6305.071,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6305.231,
    "end": 6305.652,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6306.032,
    "end": 6309.076,
    "text": "Because you're not all over the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6309.096,
    "end": 6309.657,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6309.877,
    "end": 6314.524,
    "text": "Exist in this, as we said earlier, in our least offensive way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6314.791,
    "end": 6317.155,
    "text": " The entire universe is the complete closed system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.215,
    "end": 6323.705,
    "text": "So that's what allows us to be happy and reconcile the second law of thermodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6323.765,
    "end": 6334.082,
    "text": "But you and I, while we are in the entire universe, we actually really care about and we are working and operating in this very local component of the local eco-diche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6334.062,
    "end": 6340.051,
    "text": " We're not everywhere on the planet because, you know, we could talk about the collective, but just talking about you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6340.071,
    "end": 6342.695,
    "text": "And I think that's where I think you were going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6343.176,
    "end": 6344.137,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.157,
    "end": 6351.088,
    "text": "Your law of requisite variety really was really about your local eco niche related to you at this moment in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6351.108,
    "end": 6352.229,
    "text": "Yeah, exactly, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6352.269,
    "end": 6354.653,
    "text": "We're not talking about the variety of the entire universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6354.633,
    "end": 6379.375,
    "text": " precisely precisely yeah i guess the optimal thing is just to dump my entropy elsewhere and just run back to my bed you know exactly throw that entropy away yeah yeah okay cool that's really good i just wanted to uh ask i guess a very theoretical question which i think is a kind of yes or no which is that if so with your life i thought your light bulb example was really really useful if let's say uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6379.642,
    "end": 6387.533,
    "text": " So in terms of the external variety, let's say there are multiple binary things that might be causing the light bulb to not be working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6387.593,
    "end": 6391.017,
    "text": "So the switch, the battery, the fuse, whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.738,
    "end": 6393.2,
    "text": "But I get it right the first time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6393.901,
    "end": 6397.927,
    "text": "But I've only got the knowledge of the thing that I got right the first time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6398.488,
    "end": 6400.51,
    "text": "So let's say I go for the battery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6400.53,
    "end": 6402.413,
    "text": "And I think, oh, I don't know anything about light bulbs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6402.433,
    "end": 6403.274,
    "text": "I'm four years old.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6403.334,
    "end": 6404.375,
    "text": "I only know about batteries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6404.396,
    "end": 6405.317,
    "text": "Let me go look at the battery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6405.337,
    "end": 6406.278,
    "text": "Oh, it was the battery was dead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6406.839,
    "end": 6406.999,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6408.042,
    "end": 6410.565,
    "text": " has the four year old in that example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6411.546,
    "end": 6413.688,
    "text": "Like, what are they intelligent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6414.149,
    "end": 6417.893,
    "text": "It's a kind of it's a kind of Getty a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6417.913,
    "end": 6419.735,
    "text": "I'm not sure whether you're aware of Getty a problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6419.975,
    "end": 6428.545,
    "text": "Getty a was a M and Getty was a French philosopher, I believe, who basically, since Plato knowledge was defined as justified true belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6429.506,
    "end": 6431.568,
    "text": "So how do I know it's raining?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6431.649,
    "end": 6432.97,
    "text": "Well, I can look outside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6433.304,
    "end": 6438.389,
    "text": " and I believe that it's raining, it's true that it's raining, and I have a justified belief it's raining because I can see that it's raining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6438.789,
    "end": 6443.834,
    "text": "But if, let's say, my curtains were closed and I said, and it was raining, and do I know that it's raining?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6443.994,
    "end": 6447.318,
    "text": "I say it's raining, I believe that it's raining, but I'm not justified in my belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6447.498,
    "end": 6450.501,
    "text": "So that was kind of, since Plato, what people thought knowledge was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6451.282,
    "end": 6457.948,
    "text": "Edmond Gettier comes up and basically says, for example, it's like the same way that a wrong clock is right two times a day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6458.509,
    "end": 6459.97,
    "text": "I can look at that clock",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6460.253,
    "end": 6463.617,
    "text": " And it might be accidentally true that it's that time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6464.117,
    "end": 6467.762,
    "text": "But is it justified because I'm using a clock?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6467.782,
    "end": 6468.322,
    "text": "It's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6468.482,
    "end": 6469.103,
    "text": "And I believe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6469.243,
    "end": 6471.846,
    "text": "But do I know that it's that time because I've looked at that clock?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6471.866,
    "end": 6474.289,
    "text": "Well, so that's the philosophical background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6474.91,
    "end": 6476.992,
    "text": "I can't remember where I was going with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6477.012,
    "end": 6477.453,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6477.473,
    "end": 6489.366,
    "text": "But the four-year-old who's got less, who is not obeying the law of requisite variety, who's got fewer sort of internal states than the actual volatility in the external world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6490.038,
    "end": 6493.842,
    "text": " How does cybernetics deal with that individual?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6495.244,
    "end": 6502.472,
    "text": "At that moment in time, your internal variety is less than the external variety, so you're in trouble.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6502.872,
    "end": 6511.642,
    "text": "But the other component, at least where I'm going for, is that we're forgetting too that there's an evolution in time adaptation to the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6511.702,
    "end": 6518.83,
    "text": "So that four-year-old at that moment failed to identify the problem, but that doesn't mean that they can't explore",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6518.81,
    "end": 6522.196,
    "text": " And like you said earlier, I think you gave me sort of a piece of the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6522.216,
    "end": 6526.224,
    "text": "You said, well, they'd look up batteries or you looked up a battery and you learned how that works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6526.244,
    "end": 6528.548,
    "text": "You might later learn about the circuit breaker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6528.969,
    "end": 6535.02,
    "text": "So the cybernetics, you got to understand that you are in the process of reducing your variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6535.141,
    "end": 6538.607,
    "text": "And so you are changing your configuration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6538.587,
    "end": 6552.403,
    "text": " the configuration or changing your state means that earlier principle I mentioned, the principle of order from noise, I think is important because it always tells you, we are trying to find attractors in our state space, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6552.423,
    "end": 6553.825,
    "text": "It's an optimization problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6554.165,
    "end": 6566.94,
    "text": "And we want to find an attractor or a pullback attractor is what people say, where it's like something you'd like, which again, connects nicely to any SS, but without repeating ourselves, you're trying to find these attractors and to reach again, like I said,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6566.92,
    "end": 6591.73,
    "text": " ultimate goal is ultra stability you want to be really good at solving this light problem you want to understand your generative model sorry you want to understand your world which requires you to update your generative model there's a learning component an evolving adaptivity process and that's where like the good regulator theorem says well you know you if you're a good controller of your environment you're a model of that environment but you might not start out that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6591.71,
    "end": 6594.294,
    "text": " You need to adapt, you need to acquire information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6594.334,
    "end": 6602.746,
    "text": "So exploration and exploitation is actually in cybernetics, even though we typically nowadays think, oh, that's just the reinforcement learning concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6602.766,
    "end": 6609.636,
    "text": "No, they talked about exploitation, which is, I like my particular tractor, I'd like to stay there and it's not very easy to leave it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6610.037,
    "end": 6615.145,
    "text": "However, that noise is what pushes us out and learns to find a better configuration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6615.725,
    "end": 6621.514,
    "text": "There is also some other principles in the law of requisite variety, the law of asymmetric transitions, which says,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6621.494,
    "end": 6629.042,
    "text": " that it's less likely for you to go from a lower variety area to a higher variety area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6630.143,
    "end": 6633.868,
    "text": "That means we're always looking for those spaces where we have less variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6633.908,
    "end": 6637.932,
    "text": "Again, we could use what you and I discussed earlier, your local eco-niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6637.952,
    "end": 6646.101,
    "text": "You want to find such that you have the least amount of external variety so that you can match it to satisfy the law of requisite variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6646.081,
    "end": 6648.886,
    "text": " But the other part is the order to noise principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6649.227,
    "end": 6652.834,
    "text": "And then there's the selective retention principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6652.854,
    "end": 6658.104,
    "text": "And I'm going to mess these up, even though I made sure to carefully outline all of them in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6658.144,
    "end": 6662.612,
    "text": "So I do recommend to read that to see their interrelated components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6662.652,
    "end": 6668.443,
    "text": "But the idea is that selective retention and blind selection is the idea that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6668.423,
    "end": 6674.452,
    "text": " You're more likely to stick to better configurations or states that you find in your optimization process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6674.853,
    "end": 6676.355,
    "text": "But that means you have to be changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6676.375,
    "end": 6682.004,
    "text": "You have to leave where you currently are, especially if it's a suboptimal configuration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6682.024,
    "end": 6692.44,
    "text": "So I think that four-year-old that you talked about earlier will eventually, I mean, it might be a little difficult for, you know, in this practical example, you're going to figure out what a circuit breaker is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6692.42,
    "end": 6694.583,
    "text": " But maybe they're looking up things on the internet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6694.603,
    "end": 6699.009,
    "text": "They're learning things about electronics because they're like, I really don't want a dark house.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6699.029,
    "end": 6700.331,
    "text": "And they're not going to just give up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6700.431,
    "end": 6705.519,
    "text": "Let's assume that they are going to want to tend because they want to survive and the light represents the survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6705.839,
    "end": 6707.662,
    "text": "They're going to learn about the circuit breaker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6708.062,
    "end": 6711.527,
    "text": "And so ultimately, they are evolving to a different configuration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6711.587,
    "end": 6718.116,
    "text": "And now they have a better generative model of their environment, or it's more close to the actual environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6718.137,
    "end": 6722.022,
    "text": "Because this was a factor, a causal factor that they just hadn't identified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6722.002,
    "end": 6725.885,
    "text": " But once you learn about that circuit breaker, now that's back into your system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6725.905,
    "end": 6727.347,
    "text": "Now you understand its amount of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6727.627,
    "end": 6736.535,
    "text": "And now you can match the external variety of your local eco niche or the components of the local eco niche that are related to the problem you're trying to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6736.575,
    "end": 6740.818,
    "text": "Because I think we could probably cut up the niche in different ways and say, I have different goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6740.859,
    "end": 6744.442,
    "text": "Like the light only requires these pieces of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6744.742,
    "end": 6746.864,
    "text": "The other parts are not relevant to this problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6746.924,
    "end": 6751.688,
    "text": "So we don't have to even account, like we said earlier, for that variety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6751.668,
    "end": 6754.274,
    "text": " We only need the variety that's related to the circuit breaker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6754.615,
    "end": 6758.925,
    "text": "And you just need to uncover through intelligent exploration, which connects back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6758.945,
    "end": 6761.812,
    "text": "Now we can even say, oh, that justifies active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6761.832,
    "end": 6767.666,
    "text": "We need to actively sample our environment so that way you can learn more about how the electronic system works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6767.686,
    "end": 6769.39,
    "text": "So that way you can turn the lights back on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6769.859,
    "end": 6770.62,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6771.26,
    "end": 6774.163,
    "text": "Very much so it was thank you for doing the active inference spin, I was gonna do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6776.425,
    "end": 6786.415,
    "text": "We're maximizing our Bayesian surprise where we're doing our KL divergences between our priors and posteriors about future states, but no, it's fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6786.655,
    "end": 6787.496,
    "text": "But no, very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6787.716,
    "end": 6788.136,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6788.817,
    "end": 6790.799,
    "text": "It's not it can't all just be pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6790.819,
    "end": 6799.427,
    "text": "There are epistemic affordances that we need to not exploit, but we need to access to be self evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6800.048,
    "end": 6807.019,
    "text": " that's all in the equations for people who are wondering for the call has derived in terms of expected free energy in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6807.76,
    "end": 6808.121,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6808.161,
    "end": 6811.767,
    "text": "Okay, so we're coming up to two hours, I've got a couple final questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6812.127,
    "end": 6816.434,
    "text": "One is very well, you can take it as long as short as you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6816.474,
    "end": 6821.842,
    "text": "But I was just interested to see I've taken this habit of when I read papers, I love reading the reference list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6822.864,
    "end": 6824.066,
    "text": "Because you know, they have numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6824.386,
    "end": 6827.912,
    "text": "So you know, you either put the names or you put the numbers, I love looking at the numbers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6828.297,
    "end": 6854.912,
    "text": " you have a lot of numbers in yours and i couldn't help but stumble across um donald hoffman i don't know if that was you or carl um let me just look at what the title was because i didn't it would have been his what's it called um oh i can't remember the name of his paper in any case it doesn't really matter um it's just he has a very funky theory about what reality is um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6855.803,
    "end": 6859.098,
    "text": " And anyone who knows about Donald Hoffman, I have to ask about Donald Hoffman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6859.118,
    "end": 6861.429,
    "text": "But let's skip that then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6863.659,
    "end": 6864.463,
    "text": "Final question is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6865.321,
    "end": 6869.367,
    "text": " there's a big hubbub, I would say, still your thunder here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6869.407,
    "end": 6872.991,
    "text": "But yeah, because it says the interface theory of perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6873.012,
    "end": 6879.761,
    "text": "So can you briefly remind me because I feel like that'll help trigger why I included him in the ref.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6879.801,
    "end": 6886.57,
    "text": "Yeah, so Hoffman has this idea that we are evolved, there's multiple points of convergence here, but basically that we're evolved",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6887.005,
    "end": 6890.51,
    "text": " not for veridical perception, but for survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6891.011,
    "end": 6895.237,
    "text": "And so what we actually perceive is not what's really out there, but fitness payoffs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6895.898,
    "end": 6898.342,
    "text": "And what he says is, so that's not particularly controversial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6898.382,
    "end": 6900.525,
    "text": "You have that in indirect realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6900.865,
    "end": 6905.091,
    "text": "You have that going all the way back to Bertrand Russell and even prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6905.893,
    "end": 6912.422,
    "text": "But what becomes sort of radical about Hoffman is he says, well, time and space itself are part of that interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6912.959,
    "end": 6927.956,
    "text": " And he derives a lot of this from theories of physics where he says, Okay, now, physics, modern physics, I believe the Nobel Prize in 2022 was one for something along this area is showing that there are these symmetries outside of space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6927.976,
    "end": 6933.563,
    "text": "And he has these extremely funky, Greek derived names, which I won't even try and pronounce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6934.303,
    "end": 6940.03,
    "text": "And he's very popular on in academia and in popular academia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6940.297,
    "end": 6945.163,
    "text": " So whenever I see his name come up, because I've read his book and I'm interested in his work, I like asking people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6945.504,
    "end": 6946.625,
    "text": "But in any case, it doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6946.845,
    "end": 6951.131,
    "text": "I think it's the first component of what you explained is why at least I remember.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6952.312,
    "end": 6958.28,
    "text": "I know Carl and I had different references, but I remember that resonating with the survival component of the argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6958.3,
    "end": 6962.785,
    "text": "That's probably the piece of his work that we thought resonated in this work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6962.805,
    "end": 6969.814,
    "text": "I don't have anything to say about the other part, although I should dig a little bit further and see if there might be something that changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6969.794,
    "end": 6975.221,
    "text": " Well, he's got plenty of podcasts out there and his book is very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6975.682,
    "end": 6976.383,
    "text": "What's it called?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6976.643,
    "end": 6980.568,
    "text": "Anyway, you're writing his name on Google.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6981.63,
    "end": 6998.873,
    "text": "So the final thing I wanted to ask is a kind of more broad sociological thing, which is that there's a huge hubbub going on at the moment about AGI, Artificial General Intelligence, and the fact that Sam Altman came out and said that neural nets or large language models are not going to get us there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6999.342,
    "end": 7011.433,
    "text": " And I think people have thought that, people have had their suspicions since the 90s, since inactive, you know, inactivist cognition, 4E cognition, because where are your action perception loops, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7011.453,
    "end": 7013.716,
    "text": "Where's your grounding in the world and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7014.657,
    "end": 7022.804,
    "text": "And so then we have a company like Versys, which is trying to implement active inference intelligence into, you know, in silico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7024.286,
    "end": 7028.91,
    "text": "Just as a computer scientist, I can't help but ask you, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7029.16,
    "end": 7031.622,
    "text": " what do you think is going to be the trajectory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7031.662,
    "end": 7039.53,
    "text": "And do you think mortal computation in the form of active inference is going to get us there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7041.072,
    "end": 7043.434,
    "text": "Oh, this is a this is a good one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7043.474,
    "end": 7047.198,
    "text": "And I feel like I should be a little careful with my answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7047.238,
    "end": 7056.687,
    "text": "Because there's that not with you, but there's politics and yeah, I'm worried about what we think might be the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7057.763,
    "end": 7063.691,
    "text": " So I guess I'll say one thing about the paper, because the paper does sort of touch on this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7063.731,
    "end": 7071.582,
    "text": "It actually has a section towards the end that talks about the need to reconsider the path of machine intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7071.662,
    "end": 7079.333,
    "text": "I think you remember we talked, so Carl and I mentioned in there about tool-centric AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7079.448,
    "end": 7087.265,
    "text": " So in that regard, just from the broader perspective, I'll decouple the versus thing in just a minute and I'll address the active inference component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7088.828,
    "end": 7096.444,
    "text": "While I don't feel if mortal computation is the only path, we do say it's one possible viable stepping stone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7096.424,
    "end": 7097.486,
    "text": " to a different path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7097.546,
    "end": 7102.316,
    "text": "And I do think it's a reconsideration of how we build intelligence systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7102.396,
    "end": 7104.56,
    "text": "And I think that that's kind of it's another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7104.82,
    "end": 7112.796,
    "text": "So even though it's a survey, right, because it's trying to survey all these wonderful ideas from brilliant thinkers and engineers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7112.776,
    "end": 7126.219,
    "text": " theoreticians and engineers and scientists across all these different domains, we're trying to say this echoes a direction that we want to build our adaptive systems, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7126.62,
    "end": 7127.842,
    "text": "And we don't have that right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7127.922,
    "end": 7129.705,
    "text": "I mean, we do have...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7129.685,
    "end": 7131.349,
    "text": " the, what do you call flickers of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7131.449,
    "end": 7141.211,
    "text": "And the other piece I just want to point to the audience is towards the end, we give examples of what we would consider viable mortal computers that are not even necessarily all in silico.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7141.632,
    "end": 7144.739,
    "text": "Ross Ashby does deserve a little more love and attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7145.04,
    "end": 7146.563,
    "text": "He has the homeostat, which is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7146.543,
    "end": 7169.85,
    "text": " we actually have a little pseudo taxonomy and we call that a homeostatic mortal computer although it can kind of be allostatic depending on the later innovations other scientists made on his homeostat um we also talk about these biotic uh mortal computers like fungal systems we talk about uh organoids which even though i haven't had the pleasure to work with them i'm deeply fascinated by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7169.83,
    "end": 7183.105,
    "text": " Or the sentient organoid, as Carl has called them, and Smirnova and those that have done this wonderful microphysiological construction of these little entities that can play Atari, even if it's for a short time span.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7183.125,
    "end": 7187.07,
    "text": "It's still fascinating to me that we can use stem cells to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7187.59,
    "end": 7191.215,
    "text": "Also, we got to get Michael Levin some wonderful attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7191.275,
    "end": 7193.357,
    "text": "We celebrate the Xenobot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7193.337,
    "end": 7210.975,
    "text": " and the xenobot swarm which can do these wonderful things so i think those are examples of the type of intelligence that we would want to strive to emphasize and build more like because they can do things like self-repair and self-damaging they are truly adaptive in the sense that i don't think the robotics that we have today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7210.955,
    "end": 7229.908,
    "text": " can do right so things are very brittle it's very hard you want to i i tell some of my colleagues you want to sober up about the state of ai because you know there's a lot of wonderful things that current models and systems can do but there's a lot that they can't do i say go to a robotics conference and you'll see instantly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7229.888,
    "end": 7237.76,
    "text": " how far we are from AGI or even just really powerful AI, narrow AI, like to get a robot to get you a cup of coffee.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7237.78,
    "end": 7242.166,
    "text": "Although there's some nice recent advancements in robotics, but we still have a long ways to go, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7243.067,
    "end": 7248.235,
    "text": "And those are the types of problems that I think emphasize where mortal computation might play an important role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7248.215,
    "end": 7268.535,
    "text": " it really gets into this other domain of robotics that i've been fascinated with which is neuro robotics and neuro robotics says very shortly i just try to distill it is um we want to build an intelligence system like a like a brain if you will something that's biological within the robot it must learn and do inference and engage with this environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7268.515,
    "end": 7270.478,
    "text": " inside the body of the robot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7270.718,
    "end": 7272.04,
    "text": "There is no simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7272.721,
    "end": 7274.704,
    "text": "You must have physical hardware to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7274.804,
    "end": 7276.546,
    "text": "Otherwise, it's not neuro robotics research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7276.566,
    "end": 7279.17,
    "text": "You're just doing simulated stuff, as I have done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7279.831,
    "end": 7288.723,
    "text": "And so I think mortal computation sort of emphasizes and celebrates those domains that really require this entanglement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7288.883,
    "end": 7294.371,
    "text": "We want our neural adaptive systems to actually work in noisy, uncertain environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7294.872,
    "end": 7298.016,
    "text": "And the tools that we have today with back propagation of errors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7297.996,
    "end": 7322.164,
    "text": " reinforcement learning and modern-day deep neural nets they're not always the best they're not best suited sometimes to these particular problems so think that's me waxing about the general problem I will comment that while transformers and the models that we have today are doing some really wonderful things and there's no dismissing of that I do not believe that the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7322.144,
    "end": 7326.809,
    "text": " Key to artificial general intelligence lies in that they are very still tool oriented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7327.169,
    "end": 7346.11,
    "text": "And while that's important instance to make wonderful impacts and healthcare and other aspects of humanity, that's not going to get us to the dreams of original AI, right to build cognitively viable, functional, generally intelligent systems that can act even like I'd see even at the level of a simple animal, forget about humanoid intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7346.09,
    "end": 7353.021,
    "text": " So I do think mortal computation says maybe we should consider these concepts and here's we even give a definition in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7353.041,
    "end": 7358.229,
    "text": "It's not perhaps the most perfect definition and it'll probably change if more people work on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7359.15,
    "end": 7369.887,
    "text": "But it gives you some ideas about how origins of life tie into mind and how maybe what are the design principles we should be considering to actually build this because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7369.867,
    "end": 7374.296,
    "text": " Another under the hood of my lab coat, if you will, is I'm an engineer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7375.498,
    "end": 7386.339,
    "text": "And someone that I should mention did some light reviewing and nice feedback for me, not light reviewing, was my father, which you might see in the acknowledgments, Alexander Robius Sr.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7386.52,
    "end": 7390.187,
    "text": "So it's not me thanking myself, it's me thanking my dad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7390.167,
    "end": 7395.093,
    "text": " And he had told me in one of the very earliest drafts of this, he says, you should probably emphasize, how do you build this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7395.353,
    "end": 7407.448,
    "text": "I mean, obviously, we don't give you the final answer, but that's where the engineering takes are in there, where I try to explain, well, okay, this is where the sensory motor dependencies might exist on metabolism, homeostasis, allostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7407.748,
    "end": 7414.977,
    "text": "And you notice that, so that's where, to encourage the audience, read the paper, because we talk about where autopesis fits in this framework and poiesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7415.648,
    "end": 7418.932,
    "text": " So I think that's kind of one general answer about AGI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7418.973,
    "end": 7422.157,
    "text": "And I don't think the current path we have will get us there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7422.798,
    "end": 7423.499,
    "text": "I could be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7423.659,
    "end": 7424.68,
    "text": "Carl and I could be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7425.842,
    "end": 7432.671,
    "text": "Now to address versus AI and active inference, I do believe active inference is very promising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7433.232,
    "end": 7436.116,
    "text": "Again, it might not be the complete story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7436.236,
    "end": 7437.578,
    "text": "It might not be all that we need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7438.239,
    "end": 7443.406,
    "text": "And I do think that it is, but it is important that we make advancements in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7443.426,
    "end": 7444.187,
    "text": "I think that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7444.167,
    "end": 7457.603,
    "text": " uh you were you said very early in this interview that your discussion that you were talking about you were going to mention reinforcement learning right so may i can help bring that little tiny sprinkle in here and say that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7458.275,
    "end": 7463.307,
    "text": " I think it's important that active inference seems to get a little overshadowed by reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7463.608,
    "end": 7470.584,
    "text": "If you can design a really good reward function, you can build a sufficiently operating system and we're good enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7471.085,
    "end": 7472.067,
    "text": "But they're very brittle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7472.087,
    "end": 7474.453,
    "text": "They don't work very well in the continual learning setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7474.493,
    "end": 7475.355,
    "text": "They catastrophically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7475.335,
    "end": 7475.856,
    "text": " forget.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7476.276,
    "end": 7477.698,
    "text": "It's very hard to train them online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7477.718,
    "end": 7478.779,
    "text": "They're sample inefficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7478.799,
    "end": 7480.762,
    "text": "I could go on and on about all the problems with RL.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7481.082,
    "end": 7485.587,
    "text": "And I think active inference stands to say, wait a minute, maybe we should turn this problem on its head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7485.627,
    "end": 7496.501,
    "text": "And as long as we have some definition of a prior preference, which I think is one of the more difficult components of active inference to get right, that's the inductive bias that evolution would give us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7496.561,
    "end": 7498.423,
    "text": "So at least it's got the connection to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7498.403,
    "end": 7503.488,
    "text": " biology, active inference really emphasizes that intelligent exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7503.988,
    "end": 7509.973,
    "text": "And there's some nice results that I've seen out there that, you know, reduce the number of samples that you need to learn a good policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7510.334,
    "end": 7516.199,
    "text": "So I think active inference represents a really nice alternative to reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7516.539,
    "end": 7521.103,
    "text": "And it even has some really nice bio neuro biological and cognitive connection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7521.163,
    "end": 7527.069,
    "text": "So it gives you that like process theory, it's often called a neuro biological process theory for adaptation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7527.669,
    "end": 7528.41,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7528.39,
    "end": 7535.159,
    "text": " I do think that's important, and I'm happy that Versus AI is pushing along that path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7535.76,
    "end": 7539.565,
    "text": "And obviously, I might be a little biased because I work with Carl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7539.665,
    "end": 7541.828,
    "text": "I work with Tomaso Salvatore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7542.489,
    "end": 7544.011,
    "text": "He's also there, and Chris Buckley.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7544.692,
    "end": 7554.525,
    "text": "So even though I'm not part of Versus AI and I don't speak for them in any capacity, obviously, I'm going to be biased because I collaborate with a lot of the people that are there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7555.947,
    "end": 7556.908,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7557.168,
    "end": 7558.33,
    "text": "I thought that was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7558.512,
    "end": 7560.114,
    "text": " very diplomatic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7561.555,
    "end": 7564.718,
    "text": "I'm watching there's no no saying who's wrong or right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7564.919,
    "end": 7565.799,
    "text": "But I do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7566.22,
    "end": 7569.764,
    "text": "I do want to say I urge everyone to consider mortal computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7570.244,
    "end": 7575.73,
    "text": "And perhaps fleshing that out further, because I think there's still this is a stepping stone paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7575.75,
    "end": 7578.653,
    "text": "I do not by any means think we said, Oh, just do what we say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7578.753,
    "end": 7581.496,
    "text": "It's like, to get you thinking, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7581.516,
    "end": 7581.856,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7582.437,
    "end": 7586.781,
    "text": "Well, hopefully, you know, in addition to the paper, this has got a lot of people thinking,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7587.301,
    "end": 7599.935,
    "text": " Um, but it's got me thinking I'm going to, and I'm going to go and practice the pronunciation of home or homey or he says homey or he says, and apparently also laboratory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7600.355,
    "end": 7602.077,
    "text": "Um, I didn't know that one was a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7602.638,
    "end": 7604.72,
    "text": "Um, Alex, thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7605.621,
    "end": 7607.323,
    "text": "Um, it's been an absolute joy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7607.343,
    "end": 7615.452,
    "text": "Um, just for people wanting to know more about you, what have you, you know, what work have you got coming up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7616.09,
    "end": 7619.233,
    "text": " And if people have got questions, can they reach out to you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7619.293,
    "end": 7620.314,
    "text": "How should they reach out to you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7620.655,
    "end": 7621.075,
    "text": "Please?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7622.276,
    "end": 7624.298,
    "text": "Well, first of all, I want to thank you for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7624.318,
    "end": 7625.96,
    "text": "This was a very welcome discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7626.06,
    "end": 7630.665,
    "text": "I very much enjoyed talking with you about mortal computation and AGI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7631.366,
    "end": 7634.869,
    "text": "And even poking at the holes in my knowledge, there was a few points there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7634.889,
    "end": 7637.132,
    "text": "I was like, Oh, no, I'm not a physicist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7637.152,
    "end": 7639.374,
    "text": "And I should be clear here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7639.674,
    "end": 7641.456,
    "text": "By the way, wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7641.436,
    "end": 7647.664,
    "text": " In terms of how to reach me, I mean, there's my email contact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7647.724,
    "end": 7648.905,
    "text": "I'm also on LinkedIn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7648.945,
    "end": 7656.314,
    "text": "Apparently that's becoming sort of more the social science platform I've noticed, as opposed to Twitter X, as they call it nowadays.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7657.175,
    "end": 7659.158,
    "text": "So you can look me up there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7659.238,
    "end": 7662.742,
    "text": "And I do now start to engage with information that people are posting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7662.782,
    "end": 7667.308,
    "text": "And I made my first announcement on there about one work that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7667.288,
    "end": 7668.792,
    "text": " I would like to highlight here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7668.832,
    "end": 7679.42,
    "text": "So while Carl and I did this wonderful survey on mortal computation and kind of provide a definition, another massive survey of mine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7679.44,
    "end": 7682.327,
    "text": "So if you thought this was long, I have a longer one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7682.307,
    "end": 7684.329,
    "text": " It came out at the end of December.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7684.55,
    "end": 7696.703,
    "text": "It's called Brain Inspired Machine Intelligence, a survey of neurobiological credit assignment, where I also review over the last several decades as much as I possibly could.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7696.743,
    "end": 7699.767,
    "text": "I know for a fact I'd probably still miss something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7700.387,
    "end": 7711.74,
    "text": "All the different approaches that have been neurobiologically inspired to training neural networks or constructing new neural models that are more biologically faithful and just don't do it with back",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7711.72,
    "end": 7727.839,
    "text": " So basically everything that's wrong with backprop and we look at everything ranging from like Boltzmann machines to recirculant autoencoders all the way up to modern day stuff, including Jeff's work on forward-forward only learning and some other flavors of signal propagation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7727.9,
    "end": 7728.902,
    "text": "Nice thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7728.882,
    "end": 7756.948,
    "text": " i really really urge that one i like to pull uh plug that work because i also think it's a nice resource for uh phd students and postdocs who want to maybe engage in uh alternatives to the modern days we do ai and i think that gives you a lot of uh historical context and it makes you pay proper credit assignment to the wonderful minds so many researchers over the decades you know sometimes get overlooked in this uh you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7757.755,
    "end": 7759.558,
    "text": " rapidly moving information age.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7759.578,
    "end": 7761.061,
    "text": "So that's one paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7761.121,
    "end": 7763.766,
    "text": "There is one more survey that I also recommend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7764.247,
    "end": 7766.632,
    "text": "So last year was the year of surveys for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7766.652,
    "end": 7768.736,
    "text": "Another survey on predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7768.836,
    "end": 7779.115,
    "text": "I know you and I didn't really touch a whole lot on it, but Tomaso Salvatore is my friend and he and I sort of in Ankar Mali, we set up this wonderful survey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7779.195,
    "end": 7781.299,
    "text": "Carl's on there, Rajesh Rao.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7781.279,
    "end": 7786.227,
    "text": " one of the most important figures in predictive coding, Chris Buckley's on there, Thomas Lukowitz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7786.748,
    "end": 7788.231,
    "text": "I recommend people look up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7788.291,
    "end": 7792.478,
    "text": "It's like brain inspired computational intelligence via predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7793.099,
    "end": 7799.59,
    "text": "And that reviews everything that's happened in predictive coding as much as we could over the last several years for machine intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7799.61,
    "end": 7801.914,
    "text": "So I think I'd like to those two specific ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7802.274,
    "end": 7803.376,
    "text": "They're very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7803.657,
    "end": 7806.882,
    "text": "And well, we'll put them in the we'll put them in the video description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7807.199,
    "end": 7830.743,
    "text": " so people have direct access to it as well as the mortal computation paper we've been discussing today perfect and you can reach me by my email i should last point i i don't know if you want to give that in the link to the video or so feel free to take it now so that you know um sure ago at cs.rit.edu you can reach me there cool i'm sure that's on the internet as well um everything's on the internet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7831.313,
    "end": 7832.9,
    "text": " Alex, thank you again so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7833.924,
    "end": 7836.233,
    "text": "It's been really, really fun and super informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7836.434,
    "end": 7838.623,
    "text": "So thank you from me and from the Institute as well.",
    "speaker": "SPEAKER_00"
  }
]