[
  {
    "start": 4.267,
    "end": 7.493,
    "text": " Welcome everybody to the fourth episode of Active Inference Insights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7.894,
    "end": 13.003,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I have the pleasure of hosting Inez Hipolito.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 13.585,
    "end": 17.612,
    "text": "Inez is a lecturer of philosophy of artificial intelligence at Macquarie University in Australia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.173,
    "end": 25.026,
    "text": "Her research focuses on 4E cognition, which holds that cognition is embodied, embedded, enacted, and extended beyond the brain,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.006,
    "end": 35.49,
    "text": " and she studies how this framework can help us understand and build other systems that exhibit a form of augmented cognition, including brain-computer interfaces, neurotechnologies, and smart environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.51,
    "end": 42.205,
    "text": "In addition to this, she co-founded the International Society of the Philosophy of the Sciences of the Mind, Ugualti Eropicini,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.185,
    "end": 55.351,
    "text": " And she is currently the ethics advisor in artificial intelligence versus the cognitive computing company, which implements active inference into artificial intelligence agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.654,
    "end": 58.297,
    "text": "Inez, thank you so much for joining me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.437,
    "end": 59.359,
    "text": "It's an absolute pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.261,
    "end": 61.443,
    "text": "Thank you so much for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.744,
    "end": 62.826,
    "text": "The pleasure is mine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.278,
    "end": 69.648,
    "text": " And we were just discussing off air that we're doing this across many oceans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.908,
    "end": 74.976,
    "text": "So Nez is in Australia, I'm in London, but we managed to sync it up, which is fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.858,
    "end": 76.238,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.399,
    "end": 80.525,
    "text": "So I wanted to start with Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.288,
    "end": 84.932,
    "text": "All things start with Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.064,
    "end": 99.064,
    "text": " Markov blankets really play a fundamental role in active inference and in the framework that we apply to artificial intelligence, to cognition more generally, and also just the underlying physics and maths of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.084,
    "end": 105.633,
    "text": "And a lot of your work has focused on Markov blankets and the scaling up of Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.054,
    "end": 114.666,
    "text": "So maybe a good place to start for our audience would be if you could just give a simple overview of exactly what a Markov blanket is, and then we can go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.27,
    "end": 116.191,
    "text": " Yeah, fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.572,
    "end": 120.658,
    "text": "You're absolutely right when you say that everything starts with a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.159,
    "end": 125.525,
    "text": "Everything that is a thing has got a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.186,
    "end": 136.541,
    "text": "And that does not necessarily mean that a Markov blanket is going to correspond to a certain kind of like physical boundary that one can see, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.002,
    "end": 144.653,
    "text": "A Markov blanket is a theoretical formal construct that what it does is it tells you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.633,
    "end": 151.306,
    "text": " how or what things are going to be influencing a certain state to be the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.927,
    "end": 162.186,
    "text": "So it is a statistical tool precisely to understand something really important, which is how a certain thing is coupled",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.166,
    "end": 165.778,
    "text": " within or with its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.878,
    "end": 175.45,
    "text": "So everything does start, everything has its Markov blanket, does start with the Markov blanket because it is a way in which we can capture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.801,
    "end": 194.704,
    "text": " two very important aspects, and these two aspects are that a thing, typically an open system as a thing, is both thermodynamically open and operationally closed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.887,
    "end": 207.803,
    "text": " So this is quite crucial because it is what allows the thing to persist, not to perish, not to succumb to the second law of thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.823,
    "end": 220.438,
    "text": "So Markov blankets really come very useful because, to my understanding, they allow us to capture simultaneously these two features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.418,
    "end": 226.39,
    "text": " being both operationally closed and thermodynamically open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.831,
    "end": 233.844,
    "text": "Because what happens is the system is situated in the environment in a way that is open to the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.924,
    "end": 238.393,
    "text": "It must be coupled with the environment, otherwise it is perishing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.373,
    "end": 248.625,
    "text": " It will not maintain itself, but it also has a certain boundary that allows it to maintain its coherent form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.086,
    "end": 256.474,
    "text": "So the Markov blankets become really interesting because they allow us to capture those two dimensions of an open system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.494,
    "end": 257.536,
    "text": "And what is an open system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.556,
    "end": 260.239,
    "text": "An open system is mostly everything that we see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.86,
    "end": 263.723,
    "text": "We don't really come across closed systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.766,
    "end": 265.187,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.207,
    "end": 265.848,
    "text": "Yeah, that's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.028,
    "end": 271.376,
    "text": "I'm wondering whether you could give us a sort of overview of exactly how that coupling works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.057,
    "end": 278.166,
    "text": "So people may have seen that the Markov blanket is essentially composed of active states and sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.429,
    "end": 286.518,
    "text": "That makes sense if we're talking kind of about physical boundaries like actuators, arms, legs, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.119,
    "end": 291.465,
    "text": "But on the understanding of the Markov blanket as a statistical entity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.8,
    "end": 299.076,
    "text": " What really are active states and sensory states in the theoretical way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.63,
    "end": 302.073,
    "text": " Well, there are many ways to answer this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.434,
    "end": 314.17,
    "text": "It will depend on how much you want to connect then the active inference framework and formalism with other theories that we find in physics or in neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.791,
    "end": 319.818,
    "text": "So there are many different ways in which one can answer this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.759,
    "end": 323.443,
    "text": "But for the sake of remaining,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.423,
    "end": 347.835,
    "text": " with the kind of like more skill-free application of Markov blankets and not reducing it to immediately to the brain, I will keep the formalism as something that we can apply to understand the statistical relations or influences between a system, an open system and its environment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.855,
    "end": 353.262,
    "text": "So then what you have is you have the possibility of understanding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.242,
    "end": 356.85,
    "text": " how a certain system is in a particular state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.311,
    "end": 358.433,
    "text": "So you understand that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.014,
    "end": 368.635,
    "text": "And then what you can also understand is you can make predictions about future states in which you may find the system by virtue of using this kind of formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.222,
    "end": 380.803,
    "text": " So then what you have is you employ or define that the level or aspects of scientific interest are going to be your internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.865,
    "end": 391.382,
    "text": "And then your next question is going to be, okay, how do I find this system in this precise time and space in this particular state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.362,
    "end": 402.46,
    "text": " What are the states in which the system is situated that are going to be crucial for me to find the system in this particular state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.54,
    "end": 409.651,
    "text": "And therefore I understand the system and potentially, ideally, I can make some nice predictions about future states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.092,
    "end": 412.476,
    "text": "So these would be our internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.912,
    "end": 419.103,
    "text": " So then what we need to get on is then we need to get to define what are the external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.123,
    "end": 429.721,
    "text": "And those are, like I said, the states that are going to be immediately influential for the system to be in a specific kind of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.443,
    "end": 431.224,
    "text": "Now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.592,
    "end": 432.393,
    "text": " This is all done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.934,
    "end": 440.646,
    "text": "The next step is to understand that internal and external states, they mutually influence one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.046,
    "end": 444.231,
    "text": "That's what it means about something being an open system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.391,
    "end": 458.933,
    "text": "Is that there is exchange of matter and energy such that the system is remaining in a certain state and, for example, is not going into a phase space such as...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.913,
    "end": 461.778,
    "text": " perishing or towards death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.18,
    "end": 476.061,
    "text": "So then what you get is an understanding of what I was just saying, which is how the system is coupled and in this permanent continuous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.041,
    "end": 483.853,
    "text": " exchange of matter and energy in order to remain alive and push back on the second law of thermodynamics, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.873,
    "end": 492.467,
    "text": "So you get this operationally closed and open system at the same time that is very well captured by these internal and external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.228,
    "end": 496.193,
    "text": "And I did say that they influence one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.32,
    "end": 502.287,
    "text": " But it is important to understand that they do not directly influence one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.068,
    "end": 504.831,
    "text": "They need a second set of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.592,
    "end": 520.192,
    "text": "So basically, internal and external states are conditionally independent, and they will require the intervention of a second set of states, which is very much what you asked, the active and the sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.212,
    "end": 527.142,
    "text": "So these are going to be the ones that are doing the direct communication, if you will, between each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.122,
    "end": 536.256,
    "text": " where hopefully and ideally we have a balanced influence between sensory and active states, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.897,
    "end": 555.745,
    "text": "And these direct influences between sensory and active states are going to play a crucial role in order for us to mathematically track down and understand the coupling of the system in the environment, which is the system being internal states, the environment being external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.725,
    "end": 564.933,
    "text": " So this is just like the overview of the Markov blanket and the active inference formalism that we could apply to anything that is an open system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.415,
    "end": 566.735,
    "text": "Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.775,
    "end": 567.456,
    "text": "Yeah, that's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.476,
    "end": 570.498,
    "text": "That's a really useful explication of the framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.199,
    "end": 579.166,
    "text": "I think it's, as I kind of hinted to in my initial question, it's rather easy to think of it as a physical boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.927,
    "end": 585.512,
    "text": "So we can think of cell boundaries or the blood-bane barrier or the boundaries of my body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.1,
    "end": 595.575,
    "text": " And then when we do that, the notion of sensory active states really becomes intuitive in the sense that in the case of my body, all it is, is an action perception loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.996,
    "end": 600.723,
    "text": "And that's been known to be critical to intelligence or cognition for a very long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.584,
    "end": 601.965,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.194,
    "end": 612.445,
    "text": " That said, there's also a very strong position, which is that it's actually just a statistical description of the way things act, the way things persist through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 613.386,
    "end": 631.268,
    "text": "That leads me to ask the question of, should we consider the Markov blanket to be interpreted in an instrumentalist way, in the sense that it's a tool that we can use in modeling objects, open systems, or should we be interpreting it in a realistic way, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.488,
    "end": 633.15,
    "text": "there is actually something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.232,
    "end": 643.275,
    "text": " is ontologically a Markov blanket that is truly out there as a Markov blanket embedded within lots of other Markov blankets of course",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.217,
    "end": 647.021,
    "text": " Yes, I'm really glad that you asked that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.041,
    "end": 648.102,
    "text": "It's a live question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.403,
    "end": 653.25,
    "text": "And there are many ways to answer this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.29,
    "end": 670.714,
    "text": "So the way that I decided to answer the previous question was in a way that one understands that a Markov blanket is a tool, is a statistical tool, it's a formalism, it's a mathematical construct, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.179,
    "end": 696.988,
    "text": " And I also did not go immediately into the brain or an organism with actions and sensations because I'm trying to avoid precisely the literature that tends to reduce the framework to thinking that active states and sensory states are going to be action and sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.289,
    "end": 699.071,
    "text": " That is not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.393,
    "end": 707.423,
    "text": "A Markov blanket formalism from active inference can be applied to anything that is an open system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.523,
    "end": 722.484,
    "text": "There are many examples of this in the literature, such as, for example, I can think of the example of when you have a set of pendulums in a room or a set of clocks in the same room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.864,
    "end": 726.469,
    "text": "What's going to happen is that eventually they will synchronize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.449,
    "end": 732.299,
    "text": " And you can use this framework to capture, to predict that synchronization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.101,
    "end": 745.302,
    "text": "So it is important to understand that this is a mathematical construct that you can employ to precisely understand patterns of behavior in the natural world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.282,
    "end": 746.583,
    "text": " So we've done that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.364,
    "end": 748.185,
    "text": "We understood that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.365,
    "end": 749.967,
    "text": "So then we can think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.427,
    "end": 772.369,
    "text": "You can use this framework to develop, for example, simulation models, which allow you to understand the phenomenon of scientific interest, as well as hopefully, it's a good model, it's going to give you some prediction power over future states of the thing, which doesn't have to be anything to do with cognition, can be something that is situated in the natural world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.754,
    "end": 777.079,
    "text": " Right, then a certain phenomenon happens specifically in cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.06,
    "end": 798.103,
    "text": "When we notice that specifically in cognitive science, even if you apply a certain computational framework, doesn't have to be active inference, a certain computational framework is applied to model, simulate and get some predictive power about, for example, black holes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.927,
    "end": 800.348,
    "text": " let's say black holes, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.189,
    "end": 805.193,
    "text": "And you use that kind of like mathematical framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.213,
    "end": 817.205,
    "text": "And then you employ the same kind of mathematical framework, the same kind of like computationalism to understand the brain, because after all, both a black hole and a brain are complex systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.225,
    "end": 818.086,
    "text": "What does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.386,
    "end": 821.969,
    "text": "It means that it is extremely difficult for us to model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.43,
    "end": 824.432,
    "text": "Why is it extremely difficult to model it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.532,
    "end": 827.635,
    "text": "Because it is very high in dimension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.615,
    "end": 840.713,
    "text": " So it's really hard for us, we don't have the computational power to model it, which is why we need to incorporate something called dimensionality reduction, because we don't have the tractability to precisely do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.963,
    "end": 847.278,
    "text": " Keeping up with what I was saying, in cognitive science specifically, a phenomenon happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.8,
    "end": 859.107,
    "text": "So imagine this, we use the same computational strategy to model things from the natural world all the way to the brain, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 859.087,
    "end": 880.892,
    "text": " And then what happens is that we would never say that the black hole or something that is not part of a living system would have specifically a Markov blanket or would engage in literally active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.872,
    "end": 891.94,
    "text": " we would understand very clearly that this is a computational strategy that we are developing and employing for epistemic purposes to understand the phenomenon and to get some predictive power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.803,
    "end": 893.444,
    "text": "That's what we're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.484,
    "end": 894.286,
    "text": "And we are happy with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.387,
    "end": 897.615,
    "text": "If we get some predictive power, that's success in science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.135,
    "end": 905.389,
    "text": " And then once we do this move and apply exactly the same formalisms into, for example, the brain or an organism, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.85,
    "end": 909.998,
    "text": "We tend to anthropomorphize it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.319,
    "end": 918.034,
    "text": "So we tend to say, okay, so then the brain is acting precisely literally by engaging in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.52,
    "end": 922.609,
    "text": " or in other realms engaging in predictive coding, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.99,
    "end": 932.13,
    "text": "So we lose track of understanding that, okay, these were the tools that we started off with, and we were very happy when we were modeling black holes with these tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.33,
    "end": 936.259,
    "text": "We were happy that we had some predictive power, but now it's not enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.239,
    "end": 936.921,
    "text": " We want more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.682,
    "end": 943.757,
    "text": "Well, now we want to go from the epistemic virtue into an ontological predictor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.777,
    "end": 948.949,
    "text": "Now we want to say that the thing that we are modeling, trying to understand, the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.216,
    "end": 962.36,
    "text": " developing models for epistemic gain is precisely has the properties or the ontological properties that the model, the computational model has, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.38,
    "end": 970.414,
    "text": "And that's when you get into making a realist or taking a realist stance on and upon active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.394,
    "end": 970.875,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.895,
    "end": 980.065,
    "text": "You don't have to, you can do it, but then you're going to have to defend that position in a way that, okay, you're going to have to answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.505,
    "end": 994.14,
    "text": "So if you are applying the question that you need to answer then is, if you're applying exactly the same framework to model and predict black holes that you are to do the same with brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.745,
    "end": 1000.858,
    "text": " Do you get to say that brains engage literally in active inference in ways that black holes don't?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.679,
    "end": 1002.2,
    "text": "And why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.601,
    "end": 1008.754,
    "text": "So that's the realism take and the problems that you find and where you would be led to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.173,
    "end": 1024.051,
    "text": " Or you remain in the more cautious kind of position, which is the instrumentalist or non-realist position, in which case the position is there are things in the world with a real existence, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.632,
    "end": 1035.805,
    "text": "And those things behave in ways that we would develop models to understand that behavior in terms of patterns, patterns of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.831,
    "end": 1038.456,
    "text": " The things exist in themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.596,
    "end": 1040.903,
    "text": "They interact with the world in themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.244,
    "end": 1045.778,
    "text": "The patterns of behavior are our scientific constructs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.007,
    "end": 1060.37,
    "text": " So then we talk and then we can start talking about, okay, so I can pattern behavior through, for example, employing, developing a model on the basis of Markov blankets, active inference, and then I pattern the behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.431,
    "end": 1061.072,
    "text": "What did I did?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.513,
    "end": 1067.062,
    "text": "What I did was I found patterns and therefore an explanation for a behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.082,
    "end": 1070.348,
    "text": "And this explanation is something that I didn't have before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.104,
    "end": 1072.466,
    "text": " Right, right, right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.486,
    "end": 1086.128,
    "text": "Well, I'm going to take us towards the realist position now, because I think people will find it interesting about the ontological claims, ontological implications that active inference has, especially within the cognitive science and the neuroscience community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1086.749,
    "end": 1095.002,
    "text": "And I guess when you were taking a realist stance on the Markov blanket, that there are these structures which have some kind of embedded nature in the brain, right, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.353,
    "end": 1102.482,
    "text": " People have probably heard for us and talk about how this is actually reflected in the phenotype phenotypic nature of the brain and its hierarchies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1103.403,
    "end": 1106.306,
    "text": "Um, it makes me think about modularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.327,
    "end": 1114.036,
    "text": "So modularity for people who don't know was introduced by Jerry photo, um, in 1983.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1115.297,
    "end": 1123.487,
    "text": "And the basic idea is that modules are these kinds of, um, innate neural structures, which have kind of very specific functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.058,
    "end": 1136.824,
    "text": " And Fodor in 83 laid out certain category, certain functions that a modular system would have to obey by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.505,
    "end": 1145.121,
    "text": "So domain specificity, the fact that modules have to operate on a very specific type of input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.573,
    "end": 1154.987,
    "text": " There's also informational encapsulation, this idea that like, at least how we portrayed it in 1983, that these modules are encapsulated with respect to higher order beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1156.168,
    "end": 1166.684,
    "text": "That notion got sort of, you know, weakened over time, let's say, and then there were further about the actual neural architecture would have to be involved in modules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.704,
    "end": 1169.928,
    "text": "But anyway, people can get the basic idea of a module.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.269,
    "end": 1171.851,
    "text": "We might have a visual module, a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.253,
    "end": 1181.447,
    "text": " hearing module or module for language, which is an idea clearly taken up or that Chomsky found a lot of joy in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.671,
    "end": 1191.162,
    "text": "All that to say, what does active inference have to say about this picture of the mind as being modular to any interesting degree?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1192.224,
    "end": 1198.834,
    "text": "And does this notion of kind of, at least for a predictive coding position,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.219,
    "end": 1206.655,
    "text": " a hierarchy in which you have feedback loops in which the top down affects the bottom, the top layers affect the bottom layers and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1207.356,
    "end": 1212.587,
    "text": "Does that actually really have anything to say about modularity and more generally the architecture of the brain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.327,
    "end": 1216.831,
    "text": " Yes, well, I'm really glad that you're taking us there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.891,
    "end": 1223.939,
    "text": "We do have a couple of papers that do engage a little bit with the modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.079,
    "end": 1226.762,
    "text": "One of them is Markov blankets in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.782,
    "end": 1229.706,
    "text": "And that paper and the other one is parcels and particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.066,
    "end": 1236.313,
    "text": "And in there, we do briefly mention",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.087,
    "end": 1255.399,
    "text": " reasons why thinking or patterning the brain behavior, the brain activity in terms of Markov blankets would be useful for many reasons, for applications that go all the way to DCM, dynamical causal modeling in neuroimaging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.379,
    "end": 1261.265,
    "text": " But I'm going to set that to the side and I'm going to specifically speak to the modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.625,
    "end": 1284.627,
    "text": "You very well said the modularity of the mind is one of those theories that we've been having in philosophy of mind that has been very foundational for cognitive science and for the ways in which we ask questions, for the ways in which we look for things in the brain and has been as influential as it has been refuted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.607,
    "end": 1294.03,
    "text": " So very few people today, I can think of three people, that would endorse good old school Fedorian modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.431,
    "end": 1298.481,
    "text": "And there are philosophical reasons for that and there are scientific reasons for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.187,
    "end": 1304.761,
    "text": " Philosophically, there's been made very substantial, solid, strong arguments against it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.443,
    "end": 1316.25,
    "text": "And scientifically, evidence shows neuroplasticity, shows neural reuse in ways that would contradict the modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.23,
    "end": 1330.499,
    "text": " I will make here just a bracketing of a little bit of history of philosophy of mind just before I get into the active inference understanding of cognitive slash brain activity and dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.88,
    "end": 1334.507,
    "text": "Just to say that it's interesting to see that we have this tendency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.527,
    "end": 1336.551,
    "text": "So I'll do a little bit of philosophy of mind here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.531,
    "end": 1365.88,
    "text": " we have been having this tendency in philosophy of mind, or at least analytic philosophy of mind, which is to look at, and this is a point that has been made by many influential philosophers, for example, Frances Egan, she has made this very clever point, and I think she's absolutely right, when we look into, we philosophers of mind, look into what is happening in computer science, and then we adopt the best computer science at the time to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.86,
    "end": 1371.107,
    "text": " establish a kind of like a metaphor to how the mind supposed to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.127,
    "end": 1385.585,
    "text": "At the time, as you said, in 83, Jerry Fodor looked at Turing machines and he asked the question, what would happen if one would conceive the mind as if it were a Turing machine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.025,
    "end": 1388.408,
    "text": "And then he writes the book, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.388,
    "end": 1403.41,
    "text": " What happened is that what starts off as being like sort of like metaphorical thinking, right, it eventually starts becoming a very ontological claim that the mind is ontologically modular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.39,
    "end": 1411.104,
    "text": " And that is very important for us to look back in history so that we know what to do and what not to do in the future, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.284,
    "end": 1416.754,
    "text": "Because what happens is then you set off cognitive science to look for those modules in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.995,
    "end": 1422.765,
    "text": "As you set up experiments, as you set up simulations, computational simulations, you set off",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.745,
    "end": 1429.074,
    "text": " to look for and find those very, then you have all of those sets of properties that are supposed to be the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.314,
    "end": 1442.273,
    "text": "So there's the automaticity, there's the domain specificity, there's the information encapsulation, there's the top-down information, sorry, the bottom-up information going all the way up to cognition, cognition means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.253,
    "end": 1452.746,
    "text": " all of that framework that was a theoretical framework adopted from computer science then is defining the whole cognitive science field and what we should look for, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.086,
    "end": 1466.202,
    "text": "So it's quite interesting and important for us to know our history, to know how things really happen in a way that, well, you look back and you see how it then science came back and said, well, it kind of actually doesn't make sense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.182,
    "end": 1468.345,
    "text": " that the mind is modular in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.046,
    "end": 1481.182,
    "text": "So not only philosophically we have refuted it in ways that we have forced the modularity of the mind to reinvent itself, to revise itself, to survive, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.202,
    "end": 1492.037,
    "text": "And what happened was because the problems were coming to arise from philosophy and from neuroscience, what happened was we started having to revise the modularity of the mind because the novelties were coming up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.017,
    "end": 1494.782,
    "text": " But we did not want to let go of the modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.802,
    "end": 1500.05,
    "text": "So we start revising the basic pillars and then we start having to let go of basic pillars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.07,
    "end": 1504.878,
    "text": "And that's when you have Massive Modularity by Peter Carreras, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.898,
    "end": 1508.524,
    "text": "And still challenges continue to come up, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.544,
    "end": 1511.629,
    "text": "So then you start going into this other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.609,
    "end": 1517.036,
    "text": " this other field, which was known at the time, cognitive penetrability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.457,
    "end": 1527.451,
    "text": "So now what you allow is you revise modularity to the point that it's not just bottom-up information going up, but now you allow for bottom-up and top-down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.471,
    "end": 1529.574,
    "text": "So that's cognitive penetrability, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.894,
    "end": 1532.858,
    "text": "And then it comes up around 2010.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.838,
    "end": 1550.343,
    "text": " and stays until 2020 still is a little bit here because as we sort of like explored a little bit in a special issue that we just had out this year with Michael Kishoff, it's a special issue in consciousness and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.383,
    "end": 1557.934,
    "text": "And it's about the Bayesian brain and how or whether the Bayesian brain predictive coding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.914,
    "end": 1570.288,
    "text": " is compatible to the modularity of the mind and specifically to the one that allows this traffic going up and down, such as cognitive penetrability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.908,
    "end": 1583.382,
    "text": "And there are still a few people that are very engaged in defending that kind of modularity of the mind that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.362,
    "end": 1589.731,
    "text": " quite agreeable and compatible with predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.152,
    "end": 1600.167,
    "text": "And examples of that are, for example, more conservative approaches within predictive processing theories of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.547,
    "end": 1608.559,
    "text": "For example, predictive mind prediction error minimization, mostly developed and headed by Jakob Huy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.539,
    "end": 1615.849,
    "text": " there would be one that you can find as having some agreement with modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.909,
    "end": 1623.519,
    "text": "Of course, the revised version of it, which is the one in which it allows traffic to go up and down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.0,
    "end": 1627.645,
    "text": "And that's, of course, you can see the parallel as it being predictions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.625,
    "end": 1633.492,
    "text": " coming down, prediction errors coming up, and the traffic being very contentful in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.772,
    "end": 1642.782,
    "text": "Therefore, you have a version that has got this compatibility between modularity of the mind and the predictive brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.363,
    "end": 1652.113,
    "text": "What happens is, and I'll just wrap this up and go then to active inference, what happened there, if you think about it, is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.093,
    "end": 1655.438,
    "text": " You let go of two things that were very precious for Jerry Fuller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.879,
    "end": 1660.367,
    "text": "You let go of horizontal boundaries and vertical boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.847,
    "end": 1664.854,
    "text": "And once you let go of that, you really have to ask the question, what is left of the modularity of the mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.934,
    "end": 1667.919,
    "text": "Why should we keep it in place at all whatsoever?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.48,
    "end": 1671.705,
    "text": "Because what happened was you let go of one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.208,
    "end": 1683.808,
    "text": " there was the basic pillar of the modularity of the mind, which was the boundary that was distinguishing or dividing cognition on top and modules at the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.948,
    "end": 1688.095,
    "text": "This boundary doesn't, you don't have this boundary anymore because now you have predictions coming down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.616,
    "end": 1690.74,
    "text": "So you let go of this boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.72,
    "end": 1693.366,
    "text": " Jerry doesn't get that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.386,
    "end": 1705.432,
    "text": "And they have the vertical boundaries as well, which were very precious because those were about information encapsulation such that different modules are the main specific and they do not talk to each other, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.452,
    "end": 1709.1,
    "text": "So what you do is you get rid of those vertical boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.198,
    "end": 1714.165,
    "text": " There's an interesting historical point here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.506,
    "end": 1725.502,
    "text": "Sorry to interrupt, but there's an interesting chronology here, which I actually learned during my undergrad when I was looking at whether language comprehension was fundamentally modular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.803,
    "end": 1726.624,
    "text": "So it was related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.664,
    "end": 1729.468,
    "text": "That's hence why I brought up Noam Chomsky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.786,
    "end": 1735.213,
    "text": " In 83, Fodor has very distinct definitions of information encapsulation and domain specificity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.854,
    "end": 1737.857,
    "text": "So domain specificity is actually, we just spoke about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.158,
    "end": 1741.883,
    "text": "There's a proprietary database that each module works on, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.903,
    "end": 1750.815,
    "text": "So visual, the visual module work on, uh, photons or whatever, you know, or the language module works on syntactic nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.808,
    "end": 1762.002,
    "text": " And informational encapsulation in 83 was top-down beliefs, expectations doesn't affect the workings of those modules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.022,
    "end": 1769.873,
    "text": "Interestingly, in 2000, so he writes another book or article about modularity in the year 2000.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.554,
    "end": 1773.678,
    "text": "He kind of conflates, and again, I don't want to speak ill of Jerry Fodor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.698,
    "end": 1776.562,
    "text": "He's very important, and he's also not here anymore, so he can't defend himself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.143,
    "end": 1781.629,
    "text": "But he seems to confuse information encapsulation with domain specificity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.609,
    "end": 1791.869,
    "text": " Because he talks about, and this is a quote, that a module is encapsulated if its function is restricted to what its proprietary database contains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.51,
    "end": 1796.939,
    "text": "So I think what's interesting there is practically what you're talking about in terms of horizontality and verticality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.62,
    "end": 1799.484,
    "text": "He kind of abandons the verticality there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.225,
    "end": 1803.752,
    "text": "Yeah, he abandons the verticality in the sense that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.867,
    "end": 1814.31,
    "text": " By sort of omission, he concedes that maybe we should let go of this idea that top-down beliefs, expectations don't influence lower levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.33,
    "end": 1817.016,
    "text": "But he does keep the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.198,
    "end": 1827.351,
    "text": " The horizontality, which is let's keep these as distinct systems working on discrete languages or data for want of a better term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.471,
    "end": 1845.433,
    "text": "So it's just an interesting historical fact there that I think if he was here, if Frodo might, he could obviously offer some clarification, but may also go back on his original 83 position of the restriction for top-down information to flow into modules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.987,
    "end": 1846.908,
    "text": " Yes, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.048,
    "end": 1858.659,
    "text": "And I think that this is also how you are absolutely right in specifically the point about the conflation between information encapsulation and domain specificity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.679,
    "end": 1859.78,
    "text": "These are two different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.182,
    "end": 1873.193,
    "text": "And one of the aspects that I think would need to be abandoned and that we abandoned in our Markov blankets in the brain is precisely that notion of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.763,
    "end": 1882.591,
    "text": " Because you can have domain specificity without relying on this notion of information encapsulation and things not conversing with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.891,
    "end": 1887.676,
    "text": "Because again, to my perspective, that is anthropomorphizing the brain and brain activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1887.956,
    "end": 1893.541,
    "text": "We're talking about dynamics and activities of the biology kind in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.021,
    "end": 1898.085,
    "text": "And there is an anthropomorphization that I don't think it's necessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.225,
    "end": 1901.408,
    "text": "And again, it proves itself unnecessary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.843,
    "end": 1909.153,
    "text": " But we learn so much from learning the history of where these ideas come from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.173,
    "end": 1911.216,
    "text": "And they have a place, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.536,
    "end": 1924.594,
    "text": "And I think it's important for us to precisely learn where they come from, such that we start improving and advancing our understanding of the brain and cognition in different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.574,
    "end": 1927.337,
    "text": " So there is definitely a place for Jerry Fodor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.918,
    "end": 1935.867,
    "text": "And I think that this is the place is to get us into other advancements in the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.588,
    "end": 1953.568,
    "text": "And what we have been able to see and through scientific evidence in neuroscience is precisely that that kind of way of thinking that may have started as a metaphor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.548,
    "end": 1955.831,
    "text": " doesn't really hold, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.551,
    "end": 1961.577,
    "text": "And that there may be domain specificity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.597,
    "end": 1963.399,
    "text": "I think you put it in a very nice way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.419,
    "end": 1968.946,
    "text": "There may be domain specificity without it being information encapsulation, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.667,
    "end": 1976.274,
    "text": "And once you start having to let go of all of these basic pillars of modularity, it's gone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.336,
    "end": 1982.762,
    "text": "We can try to salvage it and then call it something and brand it something else, but it's gone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.742,
    "end": 1992.873,
    "text": " And that's when then you also see in the history, well, we have now new computational capacity or strategies such as parallel distributed processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.194,
    "end": 1993.875,
    "text": "What shall we do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.195,
    "end": 2001.463,
    "text": "Let's try to apply the same thing that we did, which is what if we would think about the mind as if you were a parallel distributed processing system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.904,
    "end": 2008.551,
    "text": "And then you have the networks and predictive processing theory start rising up on the basis of that analogy as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.092,
    "end": 2010.353,
    "text": "I am careful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.333,
    "end": 2017.061,
    "text": " about going over and above it being a metaphor, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.141,
    "end": 2028.334,
    "text": "Because I always think about the brain as a very biological kind of system as opposed to a full agent with full capacities that thinks and reasons and models as if it were a scientist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.755,
    "end": 2029.936,
    "text": "So I push back on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.016,
    "end": 2031.038,
    "text": "I'm careful about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.558,
    "end": 2039.007,
    "text": "So the way from that position on, then the way in which we theorize Markov blankets as being useful was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.117,
    "end": 2045.303,
    "text": " You start from those understandings that the brain is a dynamical complex system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.323,
    "end": 2047.886,
    "text": "That it changes over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.386,
    "end": 2067.508,
    "text": "That the ways in which a full agent engages with the environment is going to have significant impacts on the ways in which pathways are strengthened or are weakened in the ways in which the brain is going to develop itself as an organ, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.488,
    "end": 2075.342,
    "text": " So you start from that very neurobiology kind of understanding of the brain, that it is a complex system, meaning that it is a coupled system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.382,
    "end": 2084.778,
    "text": "It is situated in a body, it is situated within other organs in the organism, and this organism is situated in the environment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.798,
    "end": 2091.37,
    "text": "So we completely abandon the view of the brain as being a predictive machine there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.35,
    "end": 2100.362,
    "text": " even though you can, and there's literature on building upon the idea of the brain, which of the brain being a predictive machine, which comes from Helmholtz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.582,
    "end": 2102.925,
    "text": "And more recently you can theorize it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.965,
    "end": 2110.995,
    "text": "And I've been presenting on that as you can theorize it as the low road or the high road to active inference, which we can talk about later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2111.316,
    "end": 2114.279,
    "text": "But the view is you can take that pathway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.56,
    "end": 2116.362,
    "text": "That's not the one that we took.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.342,
    "end": 2127.735,
    "text": " We took the pathway of the very neurobiology kind of way of the brain being a highly situated organ within a larger system, the larger system being situated in an environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.135,
    "end": 2139.548,
    "text": "And all of these influences and interactions are going to have an effect on the state that you're going to find the brain in a specific point in time and space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.085,
    "end": 2147.515,
    "text": " So then starting from that understanding, as opposed to the brain being a machine, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.656,
    "end": 2162.937,
    "text": "So then we ask the question of whether or not, because this is crucial, this is the crucial point, which is why I started by describing Markov blankets as this scientific construct that you can apply skill-free, come skill-free,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.917,
    "end": 2167.125,
    "text": " that you can apply to anything that is a thing, that is an open system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.185,
    "end": 2168.207,
    "text": "You can apply it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.488,
    "end": 2170.131,
    "text": "You can also apply it to the brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.151,
    "end": 2173.578,
    "text": "But then once you do that, you have to test it out, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.638,
    "end": 2176.423,
    "text": "You have to look into, okay, does this really make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.824,
    "end": 2178.327,
    "text": "Can we find...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.133,
    "end": 2191.494,
    "text": " patterns of activity that would be explainable through the application of Markov blankets at different levels of organization within the brain itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.015,
    "end": 2204.517,
    "text": "So then in that particular paper, what we did was we start from a standpoint where we reject the modularity of the mind because we do not think that there are reasons, scientific reasons, to think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.712,
    "end": 2218.212,
    "text": " The brain is organized in very strict, rigid ways, call it modules, whatever we want to call it, but in very strict, rigid ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.313,
    "end": 2222.86,
    "text": "We do not think that that's the case because there is scientific reason not to take that path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.447,
    "end": 2233.48,
    "text": " and the brain being a very dynamic and changing system, then the question that you have is, how do we make sense of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.221,
    "end": 2240.029,
    "text": "How do we find patterns in such a dynamical system, in such a coupled system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.129,
    "end": 2241.311,
    "text": "How do we find those patterns?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.391,
    "end": 2242.753,
    "text": "Can we find those patterns?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.073,
    "end": 2249.742,
    "text": "So then let's apply this Markov blanket formalism at different levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.89,
    "end": 2255.84,
    "text": " given the data that we have coming from DCM, coming from Dynamical Causal Modeling of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.88,
    "end": 2271.848,
    "text": "So basically, in very, very simple terms, the view here is that we put the brains in scanners, we get the data out of the scanner, and then we look at that and it's just vast data that we can't make sense of it, can't even start to think about how to make sense of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.828,
    "end": 2275.915,
    "text": " you employ DCM as a model to make sense of that data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.935,
    "end": 2285.631,
    "text": "And what you would get from that is a nice causal topology about how connections are made and dynamics are formed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.911,
    "end": 2292.081,
    "text": "So you get a nice pattern of that if the model is suitable and useful, then that's what you get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.061,
    "end": 2308.332,
    "text": " So then from that kind of like scientific point, we grab all of that, all of those nice models from DCM and we see, we look at whether or not we could apply the Markov blanket formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.312,
    "end": 2320.829,
    "text": " So the two sets of states, internal and external, active and sensory states, in order to get an explanation of those pattern dynamics at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.849,
    "end": 2329.24,
    "text": "So we start off with the scale of a single neuron, and then we have a cortical column, and then we have regions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.22,
    "end": 2332.825,
    "text": " And what is the take-home message from this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.845,
    "end": 2336.851,
    "text": "Because, of course, if anybody's interested in the details, then the paper is out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.572,
    "end": 2339.235,
    "text": "But what is the take-home message there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.315,
    "end": 2347.928,
    "text": "Is that we do find the same patterns of behavior across scales by virtue of employing this formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.368,
    "end": 2349.991,
    "text": "And that is really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.031,
    "end": 2358.383,
    "text": "That's already quite important because that means that you can get what we started off our conversation with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.363,
    "end": 2374.937,
    "text": " you can get understandings of activity that is occurring in the brain at different scales, where each of those scales is both operationally closed and thermodynamically open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.086,
    "end": 2382.639,
    "text": " So then what you get is you let completely go of that rigid systems that you had with the modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.02,
    "end": 2384.723,
    "text": "You completely let go of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.605,
    "end": 2397.786,
    "text": "And what you get is an understanding of how certain neurons in specific environments, you can think about it in a very simple way as like a cell in a cell tissue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.766,
    "end": 2403.714,
    "text": " how a cell in a cell tissue is interacting and engaging with the tissue in order to do what it needs to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.754,
    "end": 2415.471,
    "text": "So you can think about, you can use this formalism to precisely understand how that particular system is behaving according to the environment that it is at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.451,
    "end": 2437.634,
    "text": " So then you find these patterns of behaviors of like certain neurons firing given certain conditions, and then you get all of this nice understanding of this coupled behavior being situated that is highly dynamic and it really is dependent on the environment that it is situated at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.054,
    "end": 2444.04,
    "text": "What you also realize is that there are certain parts of the brain, there are certain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.02,
    "end": 2460.167,
    "text": " specific parts of the brain that you can see that they may be insulated, that they do not conform to active inference, they do not exchange.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.229,
    "end": 2462.451,
    "text": "And that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.431,
    "end": 2469.362,
    "text": " In a way, if you wanted to say that would be what Jerry Fodor had in mind as a modularity of the mind, you could say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.702,
    "end": 2480.439,
    "text": "But all that happens there is a very simple biology process, which is the system already knows what to do without needing to know what is going on in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.779,
    "end": 2483.704,
    "text": "It is what we say as it is set by evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.044,
    "end": 2488.371,
    "text": "It's been working so well that way that it doesn't need to know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.351,
    "end": 2491.376,
    "text": " or get to know feedback from its environment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.596,
    "end": 2494.46,
    "text": "So those would be the ones in which you would say, oh, it's encapsulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.801,
    "end": 2496.323,
    "text": "But it's informationally encapsulated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.844,
    "end": 2497.745,
    "text": "I wouldn't say so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.027,
    "end": 2500.029,
    "text": "Right, right, right, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.189,
    "end": 2500.95,
    "text": "Yeah, there's a lot of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.271,
    "end": 2502.693,
    "text": "There's a lot of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.854,
    "end": 2504.115,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2504.195,
    "end": 2511.246,
    "text": "I mean, you also gave a really nice description of 4E cognitive science there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2511.947,
    "end": 2515.472,
    "text": "So exactly as I said in my introduction before,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.807,
    "end": 2521.874,
    "text": " He's, for those who can't remember, embodied, extended, see if I remember, enacted, extended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.655,
    "end": 2523.096,
    "text": "You get all of them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.256,
    "end": 2524.097,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.617,
    "end": 2527.521,
    "text": "And I'm enjoying the history lesson as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2527.541,
    "end": 2536.031,
    "text": "So, because I do, as you said, I think the chronology is really important here, just to get a picture of the philosophical foundations on which this work is being done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.531,
    "end": 2543.94,
    "text": "But eight years after Jerry Fodor releases The Modularity of the Mind, a very important book comes out, which is The Embodied Mind of Rela Thompson and Roche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.713,
    "end": 2552.123,
    "text": " Before we go there, because you work, I guess, within that framework of, as you said, Fourier cognitive science and the embodied mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2553.204,
    "end": 2561.134,
    "text": "I think listeners will be curious about, you mentioned scientific evidence refuting modularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.156,
    "end": 2569.185,
    "text": "I was just wondering if you could provide us maybe just with one example of a module which is not exhibiting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.537,
    "end": 2576.129,
    "text": " the typical features that Fodor laid out, which would make it fundamentally modular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.149,
    "end": 2579.455,
    "text": "So what makes it open, let's say, to its environment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2580.277,
    "end": 2584.845,
    "text": "Yeah, one very clear example comes from all the research in neural reuse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.062,
    "end": 2605.791,
    "text": " So that would itself already sort of like move us away, or I would say it's strong reasons to move away from that rigidity of modules that do not change, that are, as Jerry Fodor would conceive of it, they are hardwired in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.331,
    "end": 2610.898,
    "text": "So another feature that you lose is the automaticity, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.958,
    "end": 2614.883,
    "text": "So the idea with the automaticity is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.863,
    "end": 2617.83,
    "text": " Modules in a way are silly, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.85,
    "end": 2619.313,
    "text": "They don't know really what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.353,
    "end": 2626.189,
    "text": "They are hardwired to automatically process the information that they are domain specific to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.658,
    "end": 2626.898,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.359,
    "end": 2629.463,
    "text": "So that's the automaticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.523,
    "end": 2640.201,
    "text": "They don't really have a say in the matter, so to speak, even though I'm completely anthropomorphizing this story as one with the modularity of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.003,
    "end": 2649.477,
    "text": "So you do lose that with the large evidence on neural reuse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.457,
    "end": 2671.971,
    "text": " where you see, which is extremely compelling and it's absolutely fascinating that you see certain neurons that were used to be neurons for vision to become neurons for something else like auditory system, for example, depending on the necessity of the whole overall system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.149,
    "end": 2687.116,
    "text": " So what you see is the neural reuse cases where, well, it really challenges the basic aspects or properties that would make a module a module, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.216,
    "end": 2689.541,
    "text": "Domain specific, well, is it domain specific?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.561,
    "end": 2695.292,
    "text": "If it becomes domain specific to something else, the automaticity as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.863,
    "end": 2701.23,
    "text": " The neural reuse, I think would be, it's a great challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.49,
    "end": 2703.452,
    "text": "Another one is of course, neuroplasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.873,
    "end": 2716.969,
    "text": "So the studies in neuroplasticity do challenge, again, the rigidity of the non-changeability of this hardwired system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2717.469,
    "end": 2718.25,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.551,
    "end": 2719.091,
    "text": "Okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.111,
    "end": 2719.792,
    "text": "That's really useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.912,
    "end": 2723.777,
    "text": "Yeah, I always think about, I think I got a tour about the McGurk effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2724.095,
    "end": 2731.625,
    "text": " when I was learning about modularity of mind, which is this auditory visual illusion that when people, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.785,
    "end": 2734.068,
    "text": "People can search up or do the McGurk effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.088,
    "end": 2739.194,
    "text": "But again, that brings into question this encapsulated idea that modules can't speak to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.615,
    "end": 2740.135,
    "text": "Okay, excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.496,
    "end": 2751.79,
    "text": "Well, as I said, what became very popular after these kinds of rigid computational accounts of the mind was inactivist embodied models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2751.854,
    "end": 2753.977,
    "text": " following Varela Thompson and Rush.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.117,
    "end": 2756.18,
    "text": "And Varela was of course a biologist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.001,
    "end": 2767.094,
    "text": "And so, and he introduced the term autoparesis, which kind of means this central organization that we now speak of or self-evidencing before 1991.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.394,
    "end": 2775.205,
    "text": "So, as you were saying, we are inclined now to look at the brain as a biotic thing, as a biological system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.665,
    "end": 2779.971,
    "text": "And this is very much full grounded in embodied cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.761,
    "end": 2786.738,
    "text": " Maybe it would be useful for everyone if we could just go through the four E's firstly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.511,
    "end": 2790.293,
    "text": " It doesn't have to be super, it's a very rich history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.414,
    "end": 2803.825,
    "text": "So, you know, as long as short as is suitable, that maybe we could go one by one and think about where is the evidence or where is the philosophy or where's the intuition that this is true?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2804.866,
    "end": 2808.99,
    "text": "And we can start, I guess, with the first one, which is embodiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.45,
    "end": 2811.031,
    "text": "What does embodiment mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.091,
    "end": 2814.654,
    "text": "And kind of what is the research around the embodied brain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.734,
    "end": 2815.715,
    "text": "What does it focus on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.735,
    "end": 2816.556,
    "text": "What does it center on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.076,
    "end": 2818.699,
    "text": " All right, very, very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.899,
    "end": 2830.661,
    "text": "So embodiment is something that is a concept that comes from phenomenology, from the existentialist philosophy, from phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.701,
    "end": 2838.696,
    "text": "It's a very rich concept and it is fundamental to understand a lot of confusion in the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.676,
    "end": 2843.324,
    "text": " Because we need to distinguish between weak and strong embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.344,
    "end": 2851.238,
    "text": "I will call strong embodiment the one that comes from phenomenology and existentialist philosophy, such as the one that, for example, Simone de Beauvoir had in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.659,
    "end": 2855.666,
    "text": "The body that one has that grounds our experience of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.746,
    "end": 2859.553,
    "text": "That's the kind of embodiment from Simone de Beauvoir or Maudle Pontique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.833,
    "end": 2867.984,
    "text": " And then within the E-frameworks, within the E-framework, you have different theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.746,
    "end": 2880.765,
    "text": "And while they do agree with, let's say, a couple of principles, they are going to disagree within certain more nuanced aspects of their own theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.745,
    "end": 2890.336,
    "text": " And I think the embodiment is one that is mostly useful for us to understand the state of affairs in the field and the theory and the confusions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.997,
    "end": 2904.812,
    "text": "So let's say that it is very reasonable to think that most people in the field of cognitive science today are not going to reject that the body plays a role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.792,
    "end": 2908.536,
    "text": " to understand the brain, that the body plays a role to understand cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.157,
    "end": 2912.48,
    "text": "Very few people would disagree with this, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.502,
    "end": 2916.765,
    "text": "The follow up question is, how do you understand the body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.005,
    "end": 2917.846,
    "text": "And I will get to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.966,
    "end": 2932.302,
    "text": "I will just say that only those that would conceive of cognition as encapsulated in the brain as a computer system, such as the prediction error minimization accounts,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.282,
    "end": 2948.025,
    "text": " for example, Jakob Huy's kind of conservative account, that there he says very clearly you can't throw away the body, the world, and other people because the brain sufficiently as a machine takes care of the cognitive business.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2948.566,
    "end": 2954.374,
    "text": "So that would be the only account that I know of that would not bring in the body to play a fundamental role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.248,
    "end": 2957.332,
    "text": " All other accounts do agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2957.552,
    "end": 2962.982,
    "text": "I think we have come to that agreement that the body plays a fundamental role, embodiment plays a fundamental role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.603,
    "end": 2966.749,
    "text": "Now the question, the follow-up question is how do you conceive of embodiment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.769,
    "end": 2968.852,
    "text": "And then you have two ways, the weak and the strong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.115,
    "end": 2979.231,
    "text": "Weak embodiment is the one that is endorsed, for example, by predictive processing theories, such as Andy Clark as the visionary behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.43,
    "end": 2986.883,
    "text": " What happens there is that Andy Clark, in his account, invites the body to play a causal role in cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.504,
    "end": 3000.105,
    "text": "And this is important because also with the body, you can interact with a world that is technological, where there are things that then give you the extended mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.507,
    "end": 3002.61,
    "text": " But I'll get to that if we have the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.71,
    "end": 3004.432,
    "text": "Anyway, so it's weak embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.492,
    "end": 3005.473,
    "text": "What does this mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.154,
    "end": 3013.624,
    "text": "This means that cognition is a predictive processing that takes place in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.904,
    "end": 3020.372,
    "text": "So this agrees with more conservative predictive error minimization accounts, but not only in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.352,
    "end": 3025.402,
    "text": " Predictions, the prediction processing machine includes the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.903,
    "end": 3026.925,
    "text": "What does this mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.306,
    "end": 3032.796,
    "text": "This means that the body is seen as part of the predictive machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.217,
    "end": 3035.201,
    "text": "The body is seen as computational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.402,
    "end": 3037.786,
    "text": "Cognition is computational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.806,
    "end": 3040.251,
    "text": "So that's why this is weak embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.231,
    "end": 3047.438,
    "text": " So Andy Clark does not endorse the embodiment that Merleau-Ponty or Simone de Beauvoir had in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.658,
    "end": 3050.821,
    "text": "He endorses a very computationalist kind of embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.121,
    "end": 3057.527,
    "text": "So this is why you can kind of like to understand the e-cognitive science, you kind of have to spread it out within a range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.848,
    "end": 3062.992,
    "text": "And then you get like the more conservative ones and the more radical ones, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.032,
    "end": 3067.977,
    "text": "The more conservative ones are the ones that I'm going to say that cognition is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.957,
    "end": 3072.385,
    "text": " computational, the more radical ones are going to say that cognition is not computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.826,
    "end": 3085.029,
    "text": "And then you have a spread out of the question that you can ask to help navigate the e-cognition literature is, how radical do you want to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.171,
    "end": 3090.319,
    "text": "Because if you want to say that cognition is computational, you're not radical at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.43,
    "end": 3093.634,
    "text": " And radical doesn't have anything to do with original.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.416,
    "end": 3102.532,
    "text": "Radical just means how radical you are in comparison to all theories such as the computational theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.993,
    "end": 3104.336,
    "text": "What is the computational theory of mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.356,
    "end": 3108.764,
    "text": "It's everything we've been talking about with the modularity of the mind and predictive processing theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.784,
    "end": 3110.608,
    "text": "This is all computational theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.628,
    "end": 3113.674,
    "text": "How radical are you in relation to the computational theory of mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.755,
    "end": 3128.727,
    "text": " where the basic assumptions are two, that cognition comes down to computational processes of information processing, that's computational theory of mind, and that the mark of the mental is mental representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.415,
    "end": 3140.052,
    "text": " There would be more nuanced things to say, but these would be two that you can ask yourself, and then you can ask how radical am I away from these two assumptions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.072,
    "end": 3140.753,
    "text": "So that's the view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.254,
    "end": 3151.71,
    "text": "And then you get like this weak embodiment, which is very close to, or if not, it is kind of like right in the border between computational theory of mind and e-cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.69,
    "end": 3160.556,
    "text": " almost like shouldn't be there if you would conceive that cognition within the E umbrella is not computational, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.616,
    "end": 3162.181,
    "text": "So that's the very weak embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.281,
    "end": 3166.594,
    "text": "And then you have the strong embodiment, which is any theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.777,
    "end": 3176.072,
    "text": " that explains cognition by grounding cognition very much within the embodiment, the experience that one has of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.412,
    "end": 3187.89,
    "text": "Of course, here, what we are talking about is the level of analysis and understanding that people working in that field are looking at is about the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.87,
    "end": 3193.177,
    "text": " full agent that is situated in an environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.197,
    "end": 3194.559,
    "text": "We are not talking about neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.659,
    "end": 3211.903,
    "text": "Of course, we take that into consideration in the sense of the causal relations that I mentioned before, which is how is it that the experience of the world is going to affect and influence the bodily biological processes and in there you also find the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.883,
    "end": 3224.821,
    "text": " So that's kind of like the strong embodiment for Marloponti, Husserl and all of that kind of thing that we have and mostly applied to psychotherapy and psychological analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.742,
    "end": 3230.989,
    "text": "And then you get into, let's say, inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.408,
    "end": 3235.592,
    "text": " Right, and then in inactivism, you find different kinds again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.093,
    "end": 3241.558,
    "text": "But let's say that both strong embodiment and inactivism, they reject these two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.618,
    "end": 3249.926,
    "text": "They reject that cognition is a computational process of information processing, and they reject that the mark of the mental is mental representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.986,
    "end": 3251.828,
    "text": "So they reject these two things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.489,
    "end": 3261.077,
    "text": "They're rejecting kind of like different ways, but not non-compatible, but they want to reject these two assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.057,
    "end": 3268.264,
    "text": " So the inactivist has different ways in which you can also formulate of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.565,
    "end": 3288.803,
    "text": "So you have the Varela, Thompson and Roche, so Varela and Maturana starting the autopoietic inactivism, which is a very rich literature, very based in biology and extremely compelling and very well formed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.783,
    "end": 3303.124,
    "text": " And then, of course, others more recently pick up on autopoietic inactivism, and they have developed more recently the framework towards sense-making inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.144,
    "end": 3313.98,
    "text": "Now, I want to just stop here to go to autopoiesis just to make the bridge with active inference, where you can, or at least where I find that it's reasonable to make that bridge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.96,
    "end": 3335.827,
    "text": " Autopoetic inactivism brings out, and a lot of recent work by inactivists, they also stress that out, they bring out the understanding of crucial aspects of leaving systems from bacteria to us as having those two aspects as being thermodynamically open and as being operationally closed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.328,
    "end": 3340.172,
    "text": "And those two aspects launch the system into a state of precariousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.753,
    "end": 3343.917,
    "text": "So these are main concepts within the autopoetic inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.69,
    "end": 3352.025,
    "text": " And what this can then mean that we can think of is that what does it mean for a system to be precarious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.045,
    "end": 3359.44,
    "text": "Well, what it means is that the system must, must interact with the environment in order to remain alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.801,
    "end": 3360.742,
    "text": "What does this mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.783,
    "end": 3364.47,
    "text": "Well, this means that the system is coupled with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.45,
    "end": 3365.873,
    "text": " Now again, what does this mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.913,
    "end": 3371.544,
    "text": "This means that the system, the living being cannot be encapsulated from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.564,
    "end": 3382.425,
    "text": "What this would refute is the conservative computationalist views that cognition comes down to being encapsulated in the brain and we can't throw away the body, the world and other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.405,
    "end": 3384.447,
    "text": " So that's kind of like what these means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.687,
    "end": 3392.336,
    "text": "So that's why the question is, how radical are you from the view that cognition comes down to computations in the brain, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.396,
    "end": 3393.156,
    "text": "How radical are you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.176,
    "end": 3395.719,
    "text": "So we're making our way towards a more radical one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.24,
    "end": 3407.772,
    "text": "And then once you find these ideas of like operationally closed, thermodynamically open, therefore a state of precariousness, therefore must be coupled, otherwise it dies, then you say, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.752,
    "end": 3424.993,
    "text": " And this Active Inference Framework actually captures that very nicely because I get conditional independency from internal and external states that would allow me to get the operationally closure, but I also get the direct influence of being thermodynamically open that comes from active and sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.013,
    "end": 3429.338,
    "text": "So then it really nicely captures that state of precariousness as a tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.892,
    "end": 3431.634,
    "text": " So that's nice, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.255,
    "end": 3458.886,
    "text": "And then you can go as radical as you want, which is to completely push back on any views or kinds of theories or ways of thinking that would bring out cognition and cognitive systems from bacteria to more sophisticated, inculturated systems like us as being computational of any kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.866,
    "end": 3476.435,
    "text": " And this is something that I've been presenting as augmented cognition in the sense of the kinds of like computational models that we develop and mathematical thinkings that we develop, they are our cultural practices, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.455,
    "end": 3485.329,
    "text": "So in that sense, we developed these very sophisticated ways of making sense of the natural world of which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.309,
    "end": 3488.459,
    "text": " Brains are part of, living systems are part of, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.479,
    "end": 3498.492,
    "text": "We develop all of those very highly sophisticated systems and computational capacity to make sense of the world around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.826,
    "end": 3517.969,
    "text": " And what I'm very, very careful is not to make that last step, which would bring me back to the computational theory of mind to say that those computational strategies are ontological predictors of what the brain is or of what the living system is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.37,
    "end": 3519.852,
    "text": "So I am very careful about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.892,
    "end": 3522.555,
    "text": "That maybe put me in the very radical position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.535,
    "end": 3527.049,
    "text": " because I reject all of the computational theory of mind view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.811,
    "end": 3536.477,
    "text": "So that's how you kind of like make your way within the e-cognition is by asking how radical are you in respect to computational theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.672,
    "end": 3538.133,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3538.493,
    "end": 3538.754,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3539.655,
    "end": 3543.923,
    "text": "I think we have two more E's, but we basically touched upon them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.585,
    "end": 3550.253,
    "text": "One is embedded and the next one is extended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.273,
    "end": 3553.639,
    "text": "Do you want to give a brief word to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.619,
    "end": 3554.2,
    "text": " Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.24,
    "end": 3568.439,
    "text": "So the embedded one is the one that, as I was spreading it out in range, and I was saying that, well, you have here very close, you have a boundary with the computational theory of mind, and here you have the radical stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.459,
    "end": 3572.364,
    "text": "So embedded is here, close to the computational theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.504,
    "end": 3576.91,
    "text": "And this is the E that I mentioned before when I explained that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3576.89,
    "end": 3586.298,
    "text": " Very few people in cognitive science in the field would reject that the brain is embedded in the body and the body is embedded in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.939,
    "end": 3588.34,
    "text": "Very few people would reject that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.64,
    "end": 3589.681,
    "text": "So that's the embedded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.082,
    "end": 3595.146,
    "text": "That's why this can be seen as almost close to the weak embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.587,
    "end": 3596.667,
    "text": "That's the embeddedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.028,
    "end": 3599.01,
    "text": "Very few people will talk about encapsulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.491,
    "end": 3605.175,
    "text": "Only with that exception of the one that is the prediction error minimization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.358,
    "end": 3609.965,
    "text": " by Yakov who can throw away the world and the body and other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.985,
    "end": 3611.107,
    "text": "So that's the embeddedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.408,
    "end": 3617.437,
    "text": "It's just the claim that the brain is situated in the body, the body is situated in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.758,
    "end": 3631.399,
    "text": "Now then, how you are going to explain that situatedness is where you are going to fall in different ease, in the strong embodiment, in the different kinds of inactivism, the radical inactivism or the more sense-making inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.379,
    "end": 3638.591,
    "text": " how you are going to explain that the embeddedness is what's going to make the difference on how radical you go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.212,
    "end": 3641.856,
    "text": "And then you have the extended, which I briefly mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.758,
    "end": 3650.13,
    "text": "So the extended comes as a part of like a package with Radical Predictive Processing by Andy Clark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.11,
    "end": 3661.192,
    "text": " So the package is that it is radical in relation and in comparison with prediction error minimization or conservative one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.352,
    "end": 3665.36,
    "text": "It's radical in relation to that, but it's not radical in relation to other E's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3665.8,
    "end": 3672.253,
    "text": "So what happens is that what you have is an understanding of cognition as being a computational process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.233,
    "end": 3673.254,
    "text": " that takes place where?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.495,
    "end": 3675.898,
    "text": "Well, not only in the brain, but also in the body, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.918,
    "end": 3683.267,
    "text": "The body plays a causal role for that information processing, predictive processing to occur and to happen in the ways that it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.808,
    "end": 3694.461,
    "text": "Now, you can also incorporate objects, tools from the environment that are going to play a causal role of the same kind as your body plays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.441,
    "end": 3696.703,
    "text": " So then you have a whole system that is distributed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.843,
    "end": 3697.925,
    "text": "It is a computational system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.945,
    "end": 3699.766,
    "text": "We're still talking about computational theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.087,
    "end": 3703.51,
    "text": "It is a computational system that involves brain, body, and tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.792,
    "end": 3706.173,
    "text": "And that's the extended mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.374,
    "end": 3708.335,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.716,
    "end": 3712.96,
    "text": "And yeah, I always feel the need to kind of refer people to where these ideas come from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.98,
    "end": 3720.107,
    "text": "So, Extended Mind Hypothesis, Clark and Chalmers, classic paper, and definitely worth checking out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.608,
    "end": 3720.988,
    "text": "I think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.048,
    "end": 3741.812,
    "text": " When I hear these stronger and activist or stronger 4E cognition perspectives, which refute representation as the mark of the mental or mark of cognition, it makes me think, where does consciousness fit into all of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.792,
    "end": 3754.489,
    "text": " Because as a cautious being with a subjective stance upon the world, I have some sympathy for the entire of this view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.01,
    "end": 3766.045,
    "text": "Because I think it feeds into some intuitions that this mind is privileged and can be divorced in some sense from the world upon which it does some computational work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.868,
    "end": 3784.429,
    "text": " So if really we take the privilege away from representation, which I think is also a kind of one, so we don't have to get into exactly what is a representation, but maybe we can go there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.431,
    "end": 3794.682,
    "text": "What's the kind of realm of qualia, subjectivity, intentionality, and the kind of features of consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.033,
    "end": 3796.635,
    "text": " Oh, thank you for that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.655,
    "end": 3810.896,
    "text": "I always feel like when we go that path, the mental representation being the mark of the mental, it feels like we are getting to watch a TV show halfway through, like in season two, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.916,
    "end": 3816.144,
    "text": "Because we don't ask the questions where the representations and content comes from, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.164,
    "end": 3818.087,
    "text": "So that's the hard problem of content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.185,
    "end": 3831.027,
    "text": " So I know that we want to get that because that would allow us, because we already are in the place where we do have, we can engage and develop and more and more sophisticated mental representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.107,
    "end": 3841.324,
    "text": "That's part of what we are doing here is engaging in ways in which we are involving and employing mental representations such that we can understand each other, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.304,
    "end": 3845.492,
    "text": " So it's like we're already half season, halfway through the TV show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.512,
    "end": 3846.874,
    "text": "We are already like in season three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.457,
    "end": 3851.202,
    "text": "But there was a beginning of the TV show, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3851.462,
    "end": 3853.185,
    "text": "Well, you didn't have any of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.346,
    "end": 3858.274,
    "text": "You as a baby, as an infant could not be communicated with me in this way about these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.655,
    "end": 3859.897,
    "text": "Where does that come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.957,
    "end": 3862.502,
    "text": "That comes from something called inculturation, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.482,
    "end": 3873.643,
    "text": " So I think before we start explaining things as if they were always like that, we need to understand that there is a trajectory in cognition, in cognitive development that we shall not forget.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.023,
    "end": 3879.293,
    "text": "So all of those things had to be acquired unless you want to defend nativism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.184,
    "end": 3898.495,
    "text": " that also could be very close to Jerry Fodor as well, because you already have these starter packs, you already have this very much in place machinery that would allow you to have all of these semantic content already ready to use that you could start making sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.755,
    "end": 3901.72,
    "text": "Now, if you reject Fodor, you reject it all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.442,
    "end": 3905.745,
    "text": " Now you have to answer the question, how can we do this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.346,
    "end": 3907.607,
    "text": "Where does this come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.827,
    "end": 3909.329,
    "text": "You've rejected Fuller, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.569,
    "end": 3910.63,
    "text": "So you have a story to tell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.451,
    "end": 3931.47,
    "text": "Now, the way that I see it, and many activists do see it, and by the way, also very much compatible then with mathematical frameworks of dynamical and complex systems theory, and that is employed in a lot of psychology empirical research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.45,
    "end": 3938.159,
    "text": " as opposed to the computational theory of mind, even though that's the mainstream in cognitive psychology, it's not the only one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3938.74,
    "end": 3947.772,
    "text": "And the way in which you can think about it is that you... So I'll start by saying this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.513,
    "end": 3955.582,
    "text": "I've heard many times, people ask me, but how is it possible that there's cognition but there is no mental representations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.263,
    "end": 3957.525,
    "text": "No one is saying that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.214,
    "end": 3959.877,
    "text": " So that's not a claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.997,
    "end": 3961.559,
    "text": "That's not a claim from an activist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.639,
    "end": 3964.964,
    "text": "An activist don't say that there aren't mental representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.345,
    "end": 3970.513,
    "text": "What they want to tell you is that mental representations do not come for free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3971.013,
    "end": 3972.816,
    "text": "You are not born with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.876,
    "end": 3977.864,
    "text": "You had to do things in the environment in order to acquire them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.884,
    "end": 3980.728,
    "text": "You have to develop it as a skill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.708,
    "end": 3992.167,
    "text": " So we give you a story about a hard problem of content, where does that come from when it does not come as within a nice starter pack that Cherry Folder or Descartes would tell you that it comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.487,
    "end": 3995.933,
    "text": "So once you get rid of that, you have a story to tell and the story is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.537,
    "end": 3998.44,
    "text": " that it depends on enculturation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.921,
    "end": 4006.032,
    "text": "So basically as you start as an infant, as a baby, we come into the world and we start interacting with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4006.473,
    "end": 4010.599,
    "text": "This world is, and this is the key point, this world is already social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.16,
    "end": 4012.822,
    "text": "It's already a social cultural setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.163,
    "end": 4019.553,
    "text": "There is no baby that is born and is developing within a setting that is not social already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.914,
    "end": 4023.439,
    "text": "So it is in the ways in which the baby interacts with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.419,
    "end": 4045.393,
    "text": " their caregivers, the parents, the caregivers, and the world around them that is going to gradually allow them to build simpler concepts, simple ways of using concepts, and then scaffolding that into a numerical system, in a conceptual framework,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.373,
    "end": 4061.948,
    "text": " and then later on in being able to engage in logical thinking and reasoning, and then being able to express some sophisticated ideas, and maybe even becoming a scientist and contribute to developing highly sophisticated computational models that study black holes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4061.928,
    "end": 4063.93,
    "text": " So it's an enculturated process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.431,
    "end": 4089.758,
    "text": "Of course, as we are here doing this interaction, what we are using is we are making the best use of our most skilled till so far, and I'm sure that we'll keep going in a trajectory, but our best skills of explaining ideas and discussing, so we are using and making the best use of our best mental representations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.738,
    "end": 4096.009,
    "text": " But I also have to say that this interaction does not reduce to those mental representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.29,
    "end": 4099.756,
    "text": "There is an embodiment aspect of the situation that we are at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.617,
    "end": 4108.371,
    "text": "A very clear example of that is that the interaction is different whether or not we are having interaction in person or we are having the interaction online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.351,
    "end": 4112.336,
    "text": " We'll make things different because we don't share the same physical space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.356,
    "end": 4118.204,
    "text": "So this is just an example of how embodiment here would play out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.525,
    "end": 4130.14,
    "text": "But the idea is that eventually you'll start developing the capacity to develop and engage in mental representations also as you talk to other people and you make sense of the world around you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.74,
    "end": 4132.382,
    "text": " Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4132.903,
    "end": 4146.643,
    "text": "I'm not going to play devil's advocate, but I also don't want to make you commit to any position, nor am I asking you to solve the hard problem of consciousness, because that's not going to happen, and it's also not the purpose of the podcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.86,
    "end": 4156.471,
    "text": " I understand in that sense that mental representations are kind of downstream on enacted behavior on socio-cultural norms, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.831,
    "end": 4163.459,
    "text": "As you say, there's a lot of evidence to suggest that it's not some hardwired Chomskyian module, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.619,
    "end": 4165.141,
    "text": "We can take that as kind of axiomatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.082,
    "end": 4170.547,
    "text": "I guess my question here is that kind of makes sense in terms of mental representations per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.567,
    "end": 4176.073,
    "text": "Let's say they develop out of this inactivist way of being that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.458,
    "end": 4182.828,
    "text": " What it doesn't necessarily answer is the kind of characteristic features and the idiosyncratic features of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.849,
    "end": 4191.521,
    "text": "So the actual fundamental what it is like to be me, what it is like to be you, to use Thomas Nagel's terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4192.222,
    "end": 4195.747,
    "text": "So I guess my question here is, again, not trying to pin you down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.787,
    "end": 4197.049,
    "text": "I understand there's a lot of nuance here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4198.615,
    "end": 4205.087,
    "text": " Would the inactivist be sort of, would they be attracted to the notion that consciousness is epiphenomenal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4205.668,
    "end": 4212.62,
    "text": "And by that I mean, for people who don't know, epiphenomenal consciousness is the idea that consciousness is like the steam coming off a steam train.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4212.68,
    "end": 4219.172,
    "text": "So it's caused by neural physiological behavior, but does it actually have any causal effect?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.152,
    "end": 4221.956,
    "text": " on those mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.617,
    "end": 4225.08,
    "text": "So it happens, it's there, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.12,
    "end": 4228.906,
    "text": "And it kind of depends on what philosophy of mind theory you subscribe to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4229.667,
    "end": 4232.891,
    "text": "But would they say that consciousness has no causal role?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.252,
    "end": 4242.185,
    "text": "I'm imagining that there aren't many substance dualists and activists, but what kind of considerations have they made of the role of consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.745,
    "end": 4243.507,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4243.727,
    "end": 4248.113,
    "text": "So I'll just bring something in so that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.443,
    "end": 4270.978,
    "text": " So when we talk about qualia, epiphenomenalism, and what it is like to be a bat, like Thomas Nagel, or the whole problem of consciousness, when we talk about that, we are within a certain conceptual toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.819,
    "end": 4276.506,
    "text": " We are already within what Wittgenstein would call a bottle, a theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.869,
    "end": 4297.86,
    "text": "And it's important to understand that when we start making our way within a theoretical path, it's like we're building blocks of a house and then we're getting a certain kind of house by virtue of the belief system, thoughts and the path that we are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4298.988,
    "end": 4303.978,
    "text": " That's the kind of like conceptual machinery that you get once you play that game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.759,
    "end": 4311.032,
    "text": "So, and by playing that game, I'm here referring to or having in mind Wittgenstein's language games.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4311.753,
    "end": 4314.178,
    "text": "So you can tell the story of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.462,
    "end": 4324.376,
    "text": " or you can do the epistemology of understanding how cognition comes around and about and works by playing different games.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4324.796,
    "end": 4329.964,
    "text": "And that is the traditional analytic philosophy of mind game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.665,
    "end": 4335.211,
    "text": "And that game is very associated with the computational theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.231,
    "end": 4343.743,
    "text": "So what I'm trying to say here is that once you put on certain goggles, there are certain things that you're going to see, and there are certain things that you cannot see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4344.736,
    "end": 4350.783,
    "text": " So once you start on that path of thinking journey, those are the problems that you're gonna find.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4350.803,
    "end": 4361.976,
    "text": "Those are the problems that like the heart problem of consciousness is a problem that you're gonna find because then what you get is how do we study both the easy problem and the hard problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.156,
    "end": 4367.322,
    "text": "So you necessarily, when you start going in that direction, you find those problems and then you have the explanatory gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.602,
    "end": 4368.984,
    "text": "Now, how do we close the gap?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.204,
    "end": 4371.587,
    "text": "So these are problems that come up within",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.567,
    "end": 4374.476,
    "text": " The computational theory, thinking, language game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4374.717,
    "end": 4376.222,
    "text": "So those are the goggles, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.706,
    "end": 4381.358,
    "text": "And of course, we can try to make these theories talk to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.692,
    "end": 4393.022,
    "text": " But it's very important to understand that it's almost like axiomatic in the sense that you start solving an equation in one way, the equation will look a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.363,
    "end": 4397.867,
    "text": "You start solving the equation in a different way, the equation will look in a different way, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.628,
    "end": 4401.21,
    "text": "So that's almost what we are talking about, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4401.811,
    "end": 4409.978,
    "text": "Because we are not starting from the point, any cognition doesn't start from the point of view of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.725,
    "end": 4416.33,
    "text": " in the other more traditional computational theory of Maya, of course it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.751,
    "end": 4421.497,
    "text": "So once you do start from the brain being a machine, note what questions come up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.517,
    "end": 4425.743,
    "text": "Okay, so if the brain is a machine, then how is it that it gives rise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.544,
    "end": 4427.686,
    "text": "So it's a scaling up problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.966,
    "end": 4430.951,
    "text": "How is it that it gives a rise to consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.491,
    "end": 4434.315,
    "text": "How does this machine give rise to consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4435.217,
    "end": 4437.54,
    "text": "Because there is evidence that there's consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.56,
    "end": 4439.162,
    "text": "That is what it is like to be a bat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.423,
    "end": 4440.284,
    "text": "There's qualia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.464,
    "end": 4442.547,
    "text": "There's a hard problem of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.864,
    "end": 4449.976,
    "text": " This is within that kind of thing, because you start by the brain being a machine, and then you ask, how do we get to the good stuff?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.637,
    "end": 4451.479,
    "text": "And then you get all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.741,
    "end": 4458.751,
    "text": "From within the more radical e-cognitive science, you don't start from the brain being a machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.851,
    "end": 4460.975,
    "text": "That's the first thing you reject, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.115,
    "end": 4464.18,
    "text": "And that's also in dynamical and complex systems theory, the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.397,
    "end": 4480.123,
    "text": " They have phenomenal work by Van Helder and other people that precisely reject that cognition has anything to do of being anywhere, or we should use any conceptual, any concept from a computational scientist perspective toolkit, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.143,
    "end": 4481.645,
    "text": "So then you don't start from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.046,
    "end": 4490.64,
    "text": "You start from the point of view that living systems are precarious and they engage with the world to maintain themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.008,
    "end": 4494.113,
    "text": " The brain is part of the story, but you don't start there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.514,
    "end": 4501.966,
    "text": "So in this engagement, what happens is you have, you engage with the world because you have certain goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.046,
    "end": 4506.814,
    "text": "Usually the goals have to do in a more minimalistic biology way is that you don't want to die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4506.974,
    "end": 4510.941,
    "text": "It's the precariousness of pushing back on the second law of thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4510.921,
    "end": 4516.074,
    "text": " So you engage in the world for that reason, because you want to remain alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.675,
    "end": 4518.76,
    "text": "Typically, this is the most basic biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.8,
    "end": 4521.206,
    "text": "There's much more than that, but let's just stay with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.226,
    "end": 4524.454,
    "text": "So then what happens is you start exploring the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.015,
    "end": 4529.065,
    "text": "And in exploring the world, you do that by exploring your body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.045,
    "end": 4539.664,
    "text": " So that's when the body comes in as the body is the means by which you have access and explore the world and respond to the world's invitations to exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.466,
    "end": 4544.854,
    "text": "So it is in these interactions with the world that are extremely embodied and limited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.114,
    "end": 4552.808,
    "text": "They're both constrained and possible by the body that whatever you do, it's cognitive behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.788,
    "end": 4558.484,
    "text": " And this cognitive behavior is what are the goods that we want to understand in cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.246,
    "end": 4564.28,
    "text": "And we do that by explaining them through patterns of behavior, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.042,
    "end": 4567.168,
    "text": "So it's completely different goggles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.376,
    "end": 4572.359,
    "text": " Yeah, I am going to push back because I think it's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4572.539,
    "end": 4574.361,
    "text": "It's not adversarial, it's collaborative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.901,
    "end": 4583.189,
    "text": "I just sense, or I just kind of believe that the Wittgensteinian relativism has its limits, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4583.689,
    "end": 4588.393,
    "text": "It has its points where you say, well, there are certain things that maybe aren't relative in a language game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.974,
    "end": 4598.843,
    "text": "And maybe one of those are the fundamental aspects of my experience that I can attest to, regardless of if I'm in a Breda Levat or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4599.262,
    "end": 4601.005,
    "text": " if an evil demon is tricking me, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4601.025,
    "end": 4614.591,
    "text": "Like, unless I adopt some illusionism about consciousness, which I'm not willing to do, but again, like, it's not that it's not a viable position to do, but I'm going to take it for granted that, like, even radical illusionists wouldn't say that qualia doesn't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4614.611,
    "end": 4615.653,
    "text": "It's just not what we think it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.733,
    "end": 4617.456,
    "text": "And I'm thinking of Keith Frankish and Dennett.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.448,
    "end": 4629.91,
    "text": " So for me, like the Wittgensteinian relativism, that qualia is itself part of a paradigm, to use a term of Thomas Kuhn, or it's part of a bottle, it's part of a theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.531,
    "end": 4638.887,
    "text": "Yes, in the sense of the linguistic aspect of it, but the fundamental phenomenon is, at least for what I can tell, is real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4638.935,
    "end": 4641.319,
    "text": " So what is the alternative?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.62,
    "end": 4642.762,
    "text": "I guess is my question, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.143,
    "end": 4653.923,
    "text": "I don't, I'm not refuting the notion that our cognition is in some way constrained and opened up impossibility by having a body, by being embedded in the social context and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.848,
    "end": 4660.958,
    "text": " in my opinion, we still have to grasp with the fundamental facts of phenomenal experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.759,
    "end": 4675.04,
    "text": "So I'm sorry if I sound like David Chalmers and David Chalmers and Parrot, but it seems to me that I can't get away from the explanatory gap, and I don't think that that's a problem in my theoretical framing of the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.841,
    "end": 4677.143,
    "text": "I think that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.73,
    "end": 4684.905,
    "text": " because the phenomena associated with consciousness is so radically different from anything else in the physical universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.189,
    "end": 4696.804,
    "text": " Yeah, and I must say that there are very good points that are made by David Chalmers in that respect that I very much agree with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4698.226,
    "end": 4711.163,
    "text": "Now, to go back to that and to link that in a way that would be compatible within my view of inactivism, I would say that, and also Wittgenstein,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.218,
    "end": 4715.881,
    "text": " There is a real world that you don't have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4717.442,
    "end": 4720.045,
    "text": "So I completely agree with what you said, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.225,
    "end": 4724.029,
    "text": "I completely agree that there is a limit to relativism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.209,
    "end": 4725.01,
    "text": "Yes, that's the limit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.09,
    "end": 4727.593,
    "text": "The limit is the limits of my view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.833,
    "end": 4733.639,
    "text": "I'm not going to say the limits of my language as Wittgenstein did in the first book in Tractatus because he overcame that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4733.699,
    "end": 4742.989,
    "text": "So I'm just going to, I'm going to dare to reformulate that for him and say the limits of my perspective are my world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.34,
    "end": 4748.006,
    "text": " So there are aspects of the world that I will not have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4749.848,
    "end": 4751.31,
    "text": "And that's just the way things are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4751.53,
    "end": 4768.791,
    "text": "I will not have access to your experience of the world because, and here's the inactivist bit coming in, because my experience is determined by the set of past interactions that I've had",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.328,
    "end": 4775.562,
    "text": " with the world and this moment right here where this experience is taking place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.465,
    "end": 4779.612,
    "text": "And everything else outside of this, I don't have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.416,
    "end": 4785.345,
    "text": "That's the beetle in the box, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.612,
    "end": 4790.599,
    "text": " The idea is not the rejection of other perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4790.64,
    "end": 4799.893,
    "text": "And that's precisely Wittgenstein's point is understanding that there are, it's the humility of understanding that there are other perspectives in the world and you do not have access to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.494,
    "end": 4806.583,
    "text": "You only have access to your own very specific kind of perspective to the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4806.844,
    "end": 4813.594,
    "text": "Now, another thing that he adds that it may be useful is to say that for him, these are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4814.992,
    "end": 4818.237,
    "text": " seen in terms of aspects of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.798,
    "end": 4825.147,
    "text": "You see the world through the aspects that are made relevant to you right here, right now, given what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.508,
    "end": 4829.253,
    "text": "Given your past experiences, your past interactions of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.594,
    "end": 4841.792,
    "text": "That's why certain things will become salient in this particular moment in the environment, which, connecting to the other theory, you would call the what it is like to be me, the what it is like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.616,
    "end": 4843.778,
    "text": " See, I don't know if I would.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.263,
    "end": 4848.785,
    "text": "Well, to me, I wouldn't, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4848.805,
    "end": 4854.293,
    "text": "I mean, the salience of my environment, I completely agree, is shaped by my body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4854.333,
    "end": 4856.216,
    "text": "It's shaped by my homeostatic requirements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4856.296,
    "end": 4860.102,
    "text": "It's shaped by my sociocultural upbringing status and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4861.103,
    "end": 4862.886,
    "text": "But the fact of the matter is, is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.423,
    "end": 4867.937,
    "text": " Things we could describe things as being salient without necessarily invoking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.92,
    "end": 4872.631,
    "text": "Well, that's a good question, I guess, whether we could invoke salience of out consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.213,
    "end": 4875.981,
    "text": "But I guess, I mean, as a force experiment, you can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.142,
    "end": 4882.109,
    "text": " In a sense, I had John Verveke on last week and he was talking about relevance realization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.149,
    "end": 4884.913,
    "text": "And so it's all very sort of still fresh in my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.413,
    "end": 4890.861,
    "text": "I said my reading of this would be that salience is just a manifestation of the conscious experience itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4890.921,
    "end": 4895.948,
    "text": "But are we going to get any closer to the actual fundamental characteristics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.968,
    "end": 4900.314,
    "text": "Like whether it's salience or visual perception or auditory perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4900.394,
    "end": 4905.04,
    "text": "I mean, like the charmer's problem is still there, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.235,
    "end": 4912.305,
    "text": " Let me just go back to the initial thing because otherwise I'll lose it that you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4914.588,
    "end": 4926.387,
    "text": "Note that the difference between the frameworks, it's quite this simple thing, which is things become relevant and salient and experienced in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.518,
    "end": 4932.705,
    "text": " within e-cognition because of the embodied experiences that you've had in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.486,
    "end": 4936.229,
    "text": "Within a computational theory of mind, you might say the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4936.249,
    "end": 4939.873,
    "text": "You might say things are relevant, what it is like to be me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4940.113,
    "end": 4940.454,
    "text": "Why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4940.634,
    "end": 4947.201,
    "text": "Well, because of the way that information has been processed in the brain as a machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.782,
    "end": 4951.046,
    "text": "So these are different explanations for the same kind of phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.086,
    "end": 4952.527,
    "text": "They are completely different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.547,
    "end": 4954.99,
    "text": "So this is where they are apart, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.083,
    "end": 4964.389,
    "text": " Now, as to the problem of the heart, I think when you said Chalmers problem, you meant the heart problem of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.314,
    "end": 4966.396,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.917,
    "end": 4967.158,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4967.519,
    "end": 4971.507,
    "text": "So it may be the case, and this is also a Wittgenstein move, so I'm not going to take credit for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4971.787,
    "end": 4983.532,
    "text": "It may be the case, and this is very in line with David Chalmers, which is why I think there are certain features of Chalmers' thinking that I really like and agree with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.816,
    "end": 4986.698,
    "text": "Wittgenstein makes this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.129,
    "end": 5000.361,
    "text": " Not everything that is there to be understood about the mind can be understood through the scientific method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.381,
    "end": 5006.367,
    "text": "And this is the hard problem of consciousness that Chalmers talks about, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.387,
    "end": 5008.469,
    "text": "And I think that he makes a good point there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.61,
    "end": 5013.474,
    "text": "I think that he is very clever and very, very correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.655,
    "end": 5018.119,
    "text": "And I completely agree with three points that he makes, which is that many",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5018.099,
    "end": 5033.099,
    "text": " people are falling on the trap of claiming to study consciousness and experience and first person, however you want to call it, depending on the theory you're coming from, embodiment, if you like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5033.78,
    "end": 5044.495,
    "text": "They claim to study embodiment and conscious experience and all of those kind of like good things that really make us by going to the brain alone, by studying easy stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5045.352,
    "end": 5047.679,
    "text": " And that is a theoretical trap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.979,
    "end": 5048.842,
    "text": "It's a fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5049.002,
    "end": 5052.071,
    "text": "And that's where I really agree with, oh, it's a David Chalmers work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5053.234,
    "end": 5060.355,
    "text": "Which is why I'm doing what I'm doing in eCognition precisely because I do not want to get into that trap, which I think it's a trap as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.415,
    "end": 5060.796,
    "text": "I agree with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5061.586,
    "end": 5061.866,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.167,
    "end": 5062.367,
    "text": "Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.407,
    "end": 5064.331,
    "text": "Well, that's all, that's our convergence point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5064.351,
    "end": 5073.627,
    "text": "And again, it's not so much that we need to solve the hard problem, but I'm just curious about whether it retains its problematic nature in 4E.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.667,
    "end": 5075.511,
    "text": "So that's good to get some clarity on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5076.252,
    "end": 5084.186,
    "text": "I wonder, it's a difficult question, but again, I'm not trying to get you to solve the hard problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5084.206,
    "end": 5085.889,
    "text": "I'm just curious about your thoughts on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5086.139,
    "end": 5100.089,
    "text": " I said I had John Verveke on last week, and he's got this idea that getting more precise on the function of consciousness would help us in resolving the nature of consciousness, the hard problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.851,
    "end": 5104.519,
    "text": "Do you see any viability in that link?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5106.49,
    "end": 5109.517,
    "text": " You can get something by the function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.559,
    "end": 5116.973,
    "text": "Within the frameworks that I work on, active inference and activism, within these frameworks, I'm going to give the answer within these frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5117.013,
    "end": 5126.052,
    "text": "You can get some explanatory traction, you can get some epistemic virtue out of thinking function, but it doesn't get you all the way through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.032,
    "end": 5132.039,
    "text": " It gets you to understand the precariousness and why systems behave in the way that they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5132.359,
    "end": 5137.205,
    "text": "It's because the function is that they want to push back on the second law of thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.225,
    "end": 5138.366,
    "text": "They want to remain alive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5139.007,
    "end": 5153.423,
    "text": "But then you think about a point that Simone de Beauvoir made, which is also a very clever point, which is if all there is to life is to not to perish, then what is it that makes us different to vegetation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.517,
    "end": 5154.837,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.857,
    "end": 5166.488,
    "text": "So function gives you as much as it's interesting and relevant to the point that it explains or it gives you as far as across life explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.928,
    "end": 5171.773,
    "text": "So one thing that you get is the function is all life does not want to die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.614,
    "end": 5173.014,
    "text": "Typically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.075,
    "end": 5174.615,
    "text": "That's the law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.795,
    "end": 5176.157,
    "text": "That's the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5176.537,
    "end": 5179.039,
    "text": "That's the law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.059,
    "end": 5180.301,
    "text": "But it gets you as far as that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.121,
    "end": 5181.942,
    "text": "And you want more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.732,
    "end": 5188.453,
    "text": " because you want to get to the goods of like embodied experience, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5189.155,
    "end": 5191.784,
    "text": "Why people behave in the way that they do, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5192.447,
    "end": 5194.193,
    "text": "So here, I think that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5195.438,
    "end": 5204.17,
    "text": " You can bring in also again Simone de Beauvoir, I think is a good segue into making this point, which is very under the EAM umbrella.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5204.571,
    "end": 5220.113,
    "text": "But I think she makes this point in a way that here it's going to make the point clearer, which is that if, again, going back to the point, if all there is to life is not to perish, then what makes us different from vegetation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5220.093,
    "end": 5230.224,
    "text": " What makes us different from vegetation is that we are in a kind of cognitive development trajectory that will become enculturated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5230.424,
    "end": 5234.035,
    "text": "We are situated in sociocultural environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.044,
    "end": 5253.525,
    "text": " And once that happens, we start behaving in ways that not only do we get the conceptual toolkits, the reasoning, et cetera, but we also have access and contribute and co-construct those social environments from the very embodied situation that we are at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5254.012,
    "end": 5273.9,
    "text": " So in a way, the biological body constrains the access and co-construction that you do with the world, as well as the social, culturally developed embodiment also plays a role in the participation that you have or not have within the environment that you navigate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5273.92,
    "end": 5275.682,
    "text": "Now, she puts this in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5277.299,
    "end": 5291.464,
    "text": " the living being between its condition, between freedom and facticity, which see how compatible this is with what we were saying about pushing back on the second law of thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.725,
    "end": 5296.493,
    "text": "You want to remain alive, but you don't want to remain alive within an encapsulated environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.513,
    "end": 5300.32,
    "text": "You want to remain alive and do really well in a social cultural environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.3,
    "end": 5304.071,
    "text": " Which is why we are more than simple vegetation that just wants to live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5304.351,
    "end": 5307.46,
    "text": "We want to live well, we want to live good, we want to do things that are good for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5307.761,
    "end": 5315.322,
    "text": "So we start now entering the realm of reasons, like reasons that we need to give for the things that we do in the ways that we act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5315.302,
    "end": 5322.579,
    "text": " So now we start to become very sophisticated, start to get to this mental representation, if you will, but it doesn't come for free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5322.86,
    "end": 5323.682,
    "text": "It's not a commodity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.584,
    "end": 5330.257,
    "text": "Now we start getting into season three, which is things start to get really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5330.277,
    "end": 5333.344,
    "text": "So then you can explain...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5334.134,
    "end": 5342.546,
    "text": " embodied experience as being socioculturally situated that is dependent on the embodiment that you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.806,
    "end": 5352.18,
    "text": "And that embodiment that you have is what is going to somehow determine where you are navigating continuously between freedoms and facticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5353.241,
    "end": 5359.45,
    "text": "And she puts it even more precisely between agency and objectification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5361.202,
    "end": 5365.209,
    "text": " And then you start giving reasons to how you navigate the social cultural world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5366.07,
    "end": 5366.451,
    "text": "Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5366.471,
    "end": 5367.031,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5367.051,
    "end": 5373.562,
    "text": "It's the first time I've had Simone de Beauvoir brought up in an active inference conversation, but that's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5373.963,
    "end": 5378.33,
    "text": "Yeah, it's a wonderful segue actually into existentialism and phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5378.871,
    "end": 5382.917,
    "text": "And we're big fans of Merleau-Ponty and Heidegger and Dreyfus on this podcast as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5383.578,
    "end": 5386.483,
    "text": "I thought what you said was interesting, which is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5386.463,
    "end": 5390.709,
    "text": " As you said correctly, the free energy principle is a principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5391.53,
    "end": 5395.035,
    "text": "It's like Hamiltonian's principle of least action, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5395.075,
    "end": 5405.569,
    "text": "It's the first principle's ontological explanation of just like what, in the case of the free energy principle, what things have to do if they're going to continue through time to persist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5406.764,
    "end": 5419.706,
    "text": " But active inference, or in certain cases, predictive processing, or in certain cases, computational theories of mind, or in certain cases, inactivist theories of mind, are what we call process theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5420.448,
    "end": 5425.296,
    "text": "So if we take the free energy principle just to be axiomatically true,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5425.377,
    "end": 5434.229,
    "text": " In the sense that it's kind of, and I think Carl would say this himself, if you actually put it down to its nuts and bolts, it doesn't say too much, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.249,
    "end": 5438.434,
    "text": "It's things do what things have to do to continue to be the things that they are, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5439.035,
    "end": 5446.305,
    "text": "And there's a lot of fun maths, but it's really about how it's implemented in us or artificial intelligence or whatever it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.264,
    "end": 5449.908,
    "text": " Those process theories become falsifiable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5450.749,
    "end": 5464.807,
    "text": "So predictive processing might not be the right account of continuous state space, active inference, or perhaps the mind is fundamentally downstream on the body in a radically embodied way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5465.769,
    "end": 5468.192,
    "text": "I guess because it's falsifiable,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5468.459,
    "end": 5486.62,
    "text": " A question that came to my mind when you were speaking about activism and the history as well of cognitive science is, as you say, there's very few people who will adopt a radical computational position these days, a la Descartes, a la John Searle, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5487.441,
    "end": 5492.847,
    "text": "But for me, cognitive science is very popular, to put it simply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5493.248,
    "end": 5505.905,
    "text": " Can you envisage a future where future science and future philosophy tell us that viewing the mind as embodied, enacted, embedded... What was the last one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5507.046,
    "end": 5508.228,
    "text": "Go on, Wikipedia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5509.109,
    "end": 5509.529,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.15,
    "end": 5516.218,
    "text": "Is not the right way to view it as we now look back on the computational picture and think it's incomplete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5517.58,
    "end": 5518.381,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5518.401,
    "end": 5520.363,
    "text": "So I'm going to go back to the goggles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.684,
    "end": 5523.087,
    "text": "It seems that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5523.505,
    "end": 5536.28,
    "text": " So science is built on first steps, on the goggles that you put, and then you end up with certain kinds of theories that now you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5536.4,
    "end": 5537.541,
    "text": "And now what do I do with this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.962,
    "end": 5538.462,
    "text": "I test it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.783,
    "end": 5539.664,
    "text": "I see if it makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.844,
    "end": 5547.673,
    "text": "In the case that it doesn't make sense, we don't know, but it is about putting these goggles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5548.801,
    "end": 5560.219,
    "text": " A lot of what is done still in cognitive psychology is very Descartes, is very starting in season three in like, okay, minds are mental representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5560.78,
    "end": 5568.733,
    "text": "So nobody cares about things that, or about experiments or setting up experiments or thinking or reasoning about how did it come to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5570.148,
    "end": 5579.124,
    "text": " where we should put more effort on how it came to be, which is what, by the way, dynamical and complex systems theory applied to psychology does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.805,
    "end": 5580.687,
    "text": "That's all they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5581.328,
    "end": 5594.451,
    "text": "All they do is to focus on the developmental trajectories to understand how they evolve and develop, how states change into developing and evolving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5594.431,
    "end": 5601.4,
    "text": " And much of what is done in cognitive psychology is starting in season three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5601.44,
    "end": 5603.522,
    "text": "The mind is representational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5603.843,
    "end": 5612.594,
    "text": "And now we got to find that not only in our cognitive psychology experiments as we design our experiments, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.654,
    "end": 5614.396,
    "text": "Is with that assumption in place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5614.716,
    "end": 5616.118,
    "text": "And that's why this is so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5616.571,
    "end": 5627.241,
    "text": " It may be the case that one is right to think that the mark of the mental is mental representation, but not criticizing it and not having a critical point of view about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.401,
    "end": 5646.578,
    "text": "What it means is that everything that we do within cognitive science, within setting up experiments, within setting up computational models, simulations, it's going to be starting with the assumption that the mark of the mental is mental representation and that the brain is an information processing machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.558,
    "end": 5650.423,
    "text": " So this is going to be defining for everything that we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.944,
    "end": 5659.696,
    "text": "And all that I'm saying is that let's take a step back and go to the beginning of the series as opposed to starting in season three and question these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5659.797,
    "end": 5664.383,
    "text": "And if they still make sense, great, we've done a very good job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5664.423,
    "end": 5666.686,
    "text": "So that's the point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5667.147,
    "end": 5673.696,
    "text": "And I think that what e-cognition, the more radical view does is it takes away those toys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5674.199,
    "end": 5680.285,
    "text": " and puts you into, okay, when you have to start from the very beginning, what do you have and how do you build?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5681.086,
    "end": 5699.785,
    "text": "So it puts things into pressure on whether that is the case, because when you do the bit of the history of philosophy of mind, and you realize that a lot of it has been done by borrowing conceptual toolkits from computational science, then you ask the question, what is left",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5699.765,
    "end": 5701.311,
    "text": " for philosophy of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.412,
    "end": 5702.898,
    "text": "Is there a philosophy of mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5703.36,
    "end": 5707.176,
    "text": "Or is there a borrowing conceptual toolkit from computer science?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5708.54,
    "end": 5710.662,
    "text": " Now that is a, that's a provocative question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5710.803,
    "end": 5712.725,
    "text": "I'm not going to, I'm not going to try and answer it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5712.905,
    "end": 5716.068,
    "text": "It's cool the way you talk about the scientific theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.088,
    "end": 5719.893,
    "text": "It reminds me, we had Mal Al-Barassad on as our second guest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.913,
    "end": 5723.497,
    "text": "And actually on the day of us recording this, the podcast just came out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5723.537,
    "end": 5724.898,
    "text": "So everyone should definitely go watch it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5724.918,
    "end": 5729.864,
    "text": "But we had a long chat about epistemic communities and the kind of silos that people end up in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5729.944,
    "end": 5735.49,
    "text": "And that's actually very much akin to what you were saying, that people can really end up stuck in their scientific paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5736.211,
    "end": 5737.973,
    "text": "And I'm really hoping that doesn't happen to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5738.29,
    "end": 5740.994,
    "text": " In fact, I think it kind of happening already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5741.494,
    "end": 5748.364,
    "text": "I mean, it makes me think the, my, my sort of philosophy of science is not as good as it should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5748.384,
    "end": 5758.999,
    "text": "And it should get better that I'm aware of Thomas Coon and this idea of the paradigm, the way it sounds to me is that like, I don't know, I'm adopting a kind of moral Hegelian perspective where.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5759.333,
    "end": 5768.785,
    "text": " you've got the computational theory of the mind and inactivism, like radical inactivism as your thesis and your sort of antithesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5768.825,
    "end": 5771.228,
    "text": "And you have this dialectical relationship, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5771.248,
    "end": 5773.211,
    "text": "And then what you might end up with is a synthesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.653,
    "end": 5781.582,
    "text": "And that might, I don't know, it's a very broad question, but do you see science unfolding in that manner?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5782.282,
    "end": 5788.21,
    "text": "Or is it kind of more of a incremental pursuit towards a higher or getting closer to truth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5788.595,
    "end": 5795.924,
    "text": " So, yeah, you do have those two different paradigms and I would answer that in a very clear way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5796.144,
    "end": 5814.467,
    "text": "I think that all that we have in the computational theory of mind is our human socioculturally situated experience as a human species best efforts to understand a phenomenon in the natural world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5814.717,
    "end": 5821.168,
    "text": " So we develop all of this computational machinery, strategies, models, et cetera, because this is what makes us human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5821.448,
    "end": 5824.273,
    "text": "We want to understand the world around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5824.393,
    "end": 5828.039,
    "text": "And part of the world around us is human beings, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5828.2,
    "end": 5840.961,
    "text": "So then we have all of that as a reflection or as telling or as a manifestation of what we can do as a species when we come down to being epistemic communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5841.515,
    "end": 5849.465,
    "text": " And these epistemic communities are, and Mao was absolutely right, are completely socioculturally situated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5850.526,
    "end": 5859.737,
    "text": "So science itself, like our own individual experience of the world, does not occur in an encapsulated manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5860.298,
    "end": 5862.24,
    "text": "We could aim...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5862.659,
    "end": 5871.011,
    "text": " for an ideal bird's eye view perspective of doing science in a way that is completely objective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5871.331,
    "end": 5874.937,
    "text": "But as Wittgenstein already told us, we don't have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5875.898,
    "end": 5879.723,
    "text": "We cannot get out of the trajectory that brought us here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5880.585,
    "end": 5885.211,
    "text": "We cannot have access to that other perspective, only our own, and that is going to be biased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5885.231,
    "end": 5887.755,
    "text": "And overlooking that, it's dangerous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5888.09,
    "end": 5890.814,
    "text": " Because one would claim that that is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5890.835,
    "end": 5913.692,
    "text": "And that's not, that's why our best capacity as a human species is these epistemic communities where we can exchange ideas, test ideas with each other, give feedback to each other and improve each other's thinkings and experiments such that we improve in a collective effort that is scientific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5915.731,
    "end": 5916.212,
    "text": " Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5916.472,
    "end": 5917.273,
    "text": "I like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5917.293,
    "end": 5918.134,
    "text": "It's spiriting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.254,
    "end": 5922.159,
    "text": "I don't write the idea that we're just stepping on the toes of our ancestors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5922.259,
    "end": 5925.203,
    "text": "Maybe they did have something good to tell us and we can build together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5925.343,
    "end": 5929.168,
    "text": "But maybe never get there because we're blinded in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5929.228,
    "end": 5934.855,
    "text": "I mean, obviously, where one cannot speak, therefore one must be silent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5936.096,
    "end": 5937.418,
    "text": "In this case...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5937.398,
    "end": 5963.338,
    "text": " we could go on forever and i do want to make it clear that your work is incredibly broad and diverse and touches on a wonderful range of things so we could have spoken about religion you have a wonderful paper on religion from an active influence perspective um autism among other things uh we didn't even touch upon artificial intelligence agents um so there's gonna have to be around two i suppose",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5964.297,
    "end": 5967.169,
    "text": " It has, where can people find your work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5967.209,
    "end": 5968.032,
    "text": "What are you working on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.052,
    "end": 5968.836,
    "text": "What have you got coming out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5968.876,
    "end": 5970.0,
    "text": "Where can people find you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5970.021,
    "end": 5972.35,
    "text": "Because I'm sure they'll want to know more about what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5972.515,
    "end": 5979.867,
    "text": " Yeah, just on my website, that's usually what is updated, which is www.EnergyPolito.com.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5979.887,
    "end": 5984.214,
    "text": "So usually there you got the links to other places like publications, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5985.116,
    "end": 5987.5,
    "text": "And on Twitter as well, I'm usually active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5987.56,
    "end": 5995.053,
    "text": "So anything that comes out, any conference that I'm organizing, I'm participating or papers that are out, I always share them on my Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5995.213,
    "end": 5997.156,
    "text": "So that's usually the places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5997.98,
    "end": 5998.521,
    "text": " Super.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5999.182,
    "end": 5999.462,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5999.903,
    "end": 6000.604,
    "text": "Okay, that's wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6000.844,
    "end": 6004.389,
    "text": "Well, it's half past 11 UK PM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6004.409,
    "end": 6006.613,
    "text": "So I need to dash off to bed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6006.733,
    "end": 6008.696,
    "text": "But this has been an absolute pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6009.257,
    "end": 6011.36,
    "text": "Ines, thank you so much for your time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6011.4,
    "end": 6012.982,
    "text": "And yeah, as I said, we should definitely do this again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6013.463,
    "end": 6014.464,
    "text": "Oh, thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.504,
    "end": 6017.869,
    "text": "What a terrific, exciting conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6017.909,
    "end": 6018.73,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6018.771,
    "end": 6020.253,
    "text": "And definitely up for round two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.954,
    "end": 6021.334,
    "text": "Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6021.715,
    "end": 6022.135,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6022.716,
    "end": 6023.177,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]