[
  {
    "start": 1.345,
    "end": 8.091,
    "text": " Welcome, it's cohort one, meeting 17 already, and it's September 23rd, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.251,
    "end": 13.795,
    "text": "We're having our first discussion of chapter seven in the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.677,
    "end": 19.28,
    "text": "Well, we have many ways to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.381,
    "end": 25.805,
    "text": "We have questions on chapter seven that people have been adding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.567,
    "end": 29.569,
    "text": "We also have some questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.115,
    "end": 36.199,
    "text": " summaries and overviews and can walk through the text directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.18,
    "end": 54.515,
    "text": "But first, does anyone want to just raise their hand or unmute and give any thought that they had on chapter seven, their experience reading it, their understanding of where it's situated in the textbook overall, what was in it or what was not in it, etc. ?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.986,
    "end": 108.153,
    "text": " okay well i'll uh open again please raise your hands or write in the chat if you want to address anything at any point i want to open um by acknowledging a lot of the contributions ali uh made and uh in some conversations that he and i had earlier this week that i believe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.321,
    "end": 113.425,
    "text": " all of you cohort learners will find interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.667,
    "end": 118.37,
    "text": "But first, let's just start with this quotation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.61,
    "end": 127.438,
    "text": "We're gonna start with the opening quotation of the chapter, then I'm gonna surface some discussions with Ali, and then we're gonna go into some details of the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.559,
    "end": 131.122,
    "text": "So the quote is, what I cannot create, I do not understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.403,
    "end": 132.963,
    "text": " by RF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.643,
    "end": 140.945,
    "text": "So what does anyone think about that quotation or what does it mean in this context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.947,
    "end": 155.488,
    "text": "I think, I mean, it's more applicable",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 158.2,
    "end": 186.714,
    "text": " applicable the more complex the thing is that you're trying to build but like how could your generative what priors or afford it what way could your generative model create an accurate prediction of the operation of something or the underlying dynamics of something if you do not kind of step by step",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 189.548,
    "end": 193.489,
    "text": " generate the afford and take the actions that generate those affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 195.45,
    "end": 207.454,
    "text": "I don't see any causal path to doing so without like you would have to step through it necessarily if it's computationally like complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 210.095,
    "end": 213.137,
    "text": "So that's most things in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 214.177,
    "end": 214.317,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.262,
    "end": 217.562,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.762,
    "end": 219.684,
    "text": "It's like, this is like the low road answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.404,
    "end": 227.33,
    "text": "Like how can the generative model have anything like understanding without generating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.81,
    "end": 229.011,
    "text": "You can't just have it on the shelf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.811,
    "end": 233.114,
    "text": "And then someone has added the mild answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.015,
    "end": 246.424,
    "text": "We can't have understanding just through mental envisioning that the algorithms need to be implemented for a learner's journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.38,
    "end": 274.168,
    "text": " then this is also um an even deeper or stronger point which first and others have been working on for a long time which is like it's sentient artifacts in the world that will be the realization of active inference it's not just like some nice derivations brock and then anyone else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.615,
    "end": 278.196,
    "text": " I was just going to add something about hidden states there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 278.477,
    "end": 304.111,
    "text": "I mean, it's, again, coming back to computational complexity, but there's things now that we're starting to build that we don't really 100% understand all of the dynamics of what is, or just in general, like we invent things that we don't completely understand first, and then based on the observational, based on the evidence that we observe, that it is consistently exhibiting some behavior that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 305.191,
    "end": 316.3,
    "text": " that directs our attention, that directs where our generative model pursues, like, you know, more observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.4,
    "end": 334.074,
    "text": "But we're definitely getting towards a point where that's, like, kind of no longer going to be possible in the way that we usually try to use math to just shortcut stuff, where the operation of the dynamics of the things that we're going to build are necessarily going to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 335.569,
    "end": 357.098,
    "text": " they will be the proof their existence will be their own proof awesome okay so just fun you know starting quotation upload that one for sure though um there's some detailed things about um the examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.564,
    "end": 362.968,
    "text": " And I also, and some of these I've been working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.068,
    "end": 367.632,
    "text": "Everyone is welcome for every chapter to be contributing on these pages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.732,
    "end": 378.721,
    "text": "Like kind of just trying to overview what these examples are because a chapter, it states it up front, yet I missed it the first several times reading it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.382,
    "end": 386.287,
    "text": "Like these illustrated models of Every Color in the Rainbow are the section titles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.284,
    "end": 394.245,
    "text": " And those are the functionalities that are getting layered in, sometimes building on the same model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.665,
    "end": 397.966,
    "text": "Like there's like Team A's version one, and then there's Team A's version two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.146,
    "end": 405.548,
    "text": "Other times it's switching between models or showing two different models that illustrate the same cognitive functionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.928,
    "end": 410.709,
    "text": "Other times the simulation outputs are shown, other times they're not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.049,
    "end": 416.77,
    "text": "So there's like a lot of heterogeneity in the observations in this chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.03,
    "end": 446.038,
    "text": " but it really wasn't until i saw that these first paragraph words were the section titles that it made more sense how the chapter was being like laid out um so that's just kind of one uh note um ali do you want to raise any thoughts or describe a little bit about our discussion on like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.435,
    "end": 449.136,
    "text": " how we're gonna move forward on the equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.156,
    "end": 456.299,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.379,
    "end": 457.819,
    "text": "If you unmute, then go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.859,
    "end": 458.54,
    "text": "Otherwise, I'll...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.117,
    "end": 460.477,
    "text": " Let me see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.178,
    "end": 461.978,
    "text": "Okay, yes, no mic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.538,
    "end": 462.959,
    "text": "Thank you, Ellie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.019,
    "end": 463.279,
    "text": "All good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.779,
    "end": 472.645,
    "text": "So we were discussing how there are several layers as with other scriptural traditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.865,
    "end": 474.446,
    "text": "There's levels of readings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.686,
    "end": 485.833,
    "text": "So there's a level of reading that is even more granular or below where we've been currently targeting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.733,
    "end": 487.514,
    "text": "Like here's equation 2.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.468,
    "end": 503.542,
    "text": " There's a reading for accessibility and understanding that would potentially be like F open square bracket, Q comma Y closed bracket equals negative sign expectation over Q open parenthesis X, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.083,
    "end": 508.267,
    "text": "So it's like the reading of the notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.313,
    "end": 538.943,
    "text": " then the notation can be substituted for terms in the act in fontology which is like the level that's being described here but this is not to be seen here um this is the level where notation could be aligned across papers because their notational reading would be different but then they might be referring to the same exact composition of the act in fontology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.72,
    "end": 563.481,
    "text": " Then once the ontology definition has been squared, the terms could be condensed into meaningful units like accuracy, complexity, risk, expected risk that gives symbolic in the more conversational sense rather than in the like notational sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.103,
    "end": 566.444,
    "text": "And then that's where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.081,
    "end": 575.407,
    "text": " memes and themes and rhetoric around like what active inference formalisms say start to arise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.668,
    "end": 582.373,
    "text": "And then there's the consequences of changes in relationships within and outside the formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.594,
    "end": 589.158,
    "text": "Because it's kind of like there's this larger structure for like a POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.299,
    "end": 596.224,
    "text": "And changing one variable, if you're only looking at like one view or one kind of sub formalism,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.654,
    "end": 598.995,
    "text": " like, you know, turn it up to 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.076,
    "end": 604.161,
    "text": "Yet that might influence other variables that aren't part of that formalism itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.081,
    "end": 615.932,
    "text": "And so this is like a very open question that touches on everything from like the implications of changes to relationships that aren't formally specified",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.84,
    "end": 627.485,
    "text": " For example, the Bayes graph, the edges reflect a certain type of relationship as we've explored, but changes from one can propagate throughout a whole system, potentially in nonlinear ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.366,
    "end": 635.209,
    "text": "So it's always going to be this kind of open area, how changes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.02,
    "end": 639.462,
    "text": " including like counterfactuals about the formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.502,
    "end": 642.044,
    "text": "What if risk were situated this way instead of that way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.804,
    "end": 644.665,
    "text": "Or how does that relate in this case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.006,
    "end": 646.367,
    "text": "So this is kind of an open one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.507,
    "end": 649.129,
    "text": "Again, people please update it and modify it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.47,
    "end": 652.251,
    "text": "But like some of these equations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.088,
    "end": 673.571,
    "text": " which we'll get to so we'll come to why we had that conversation in 7.8 later but that was like one um really interesting conversation and then um there was one other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.651,
    "end": 702.072,
    "text": " okay then just to kind of jump into a chapter seven topic but also kind of reframe our learning journey as we're all working through this for the first time um in the textbook group so they wrote um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.068,
    "end": 716.812,
    "text": " This choice in the teammates, and then Eric or anyone else, I know that you had some questions on the teammates, or we can go to the earlier examples, but this choice of what to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.092,
    "end": 722.834,
    "text": "Do you seek out the informative cue and then go to the arm that you've now reduced your uncertainty about where the reward is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.455,
    "end": 728.777,
    "text": "So do you take an epistemic action and then have like a better chance of making the pragmatically good choice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.657,
    "end": 732.438,
    "text": "Or do you just, you know, go and make the pragmatic choice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.859,
    "end": 735.72,
    "text": "Do you take one step up or do you take one step back for two steps up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.239,
    "end": 741.802,
    "text": " It speaks to the exploration exploitation dilemma in psychology and machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.722,
    "end": 744.944,
    "text": "A dilemma that's resolved under active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.825,
    "end": 761.174,
    "text": "So we were just cracking up because first a low familiarity learner might not know what these terms are or like why it's relevant to even talk about this situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.072,
    "end": 772.676,
    "text": " Familiarity might look like knowing metaphors, examples, intuition, some relevant citations or historical anecdotes about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.637,
    "end": 784.762,
    "text": "The understanding in terms of what the active inference formalism says about this, if it's resolved under active inference, then understanding that resolution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.839,
    "end": 786.84,
    "text": " is about the basis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.82,
    "end": 792.463,
    "text": "And then from understanding, there could be further developments and applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 794.223,
    "end": 810.412,
    "text": "And then we'll come to this, but what was making us laugh was surely there are parameterizations in which the rat in the tea maze always does one thing or always does the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.017,
    "end": 833.696,
    "text": " So it's not that the explore-exploit trade-off is simply resolved under active inference, even though people commonly point to things like the ability to rapidly switch between exploratory and exploitative behavioral policies, because there's parameterization of that model and structure learning, including that, that has to be accomplished",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.855,
    "end": 847.024,
    "text": " such that the model can be in a kind of critical point where it behaves adaptively and thus in a situation manages the explore-exploit tension under certain constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.746,
    "end": 851.828,
    "text": "But how could it be said that active inference resolves that dilemma?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.289,
    "end": 858.113,
    "text": "So maybe to whomever wrote this one, what is happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.153,
    "end": 858.913,
    "text": "Yes, please, Eric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 859.894,
    "end": 861.535,
    "text": "Classical Eric writing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.695,
    "end": 863.377,
    "text": "So what about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 866.112,
    "end": 869.093,
    "text": " Yeah, I'm kind of the heckler at the garden party here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 869.713,
    "end": 871.934,
    "text": "You can see in most of my comments and questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 874.335,
    "end": 880.377,
    "text": "But yeah, I mean, maybe it's just best to, I mean, it's maybe better read than spoken.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 880.437,
    "end": 889.12,
    "text": "But yeah, I don't see this as a valid claim that they, well, first of all, I don't want to call it a dilemma for psychology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 889.18,
    "end": 889.9,
    "text": "It's a trade-off.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 891.172,
    "end": 895.374,
    "text": " been understood for years and there's ways of formalizing it and you solve it through optimization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 897.856,
    "end": 906.34,
    "text": "It might be a dilemma for a creature because they don't know what they should do, but that's not a dilemma for the field.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 908.461,
    "end": 915.865,
    "text": "And then I guess the other paragraph is I don't see that they offer any resolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 917.206,
    "end": 918.907,
    "text": "All they do is they put it into the same",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 920.123,
    "end": 921.784,
    "text": " They use a common language, free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 921.844,
    "end": 932.972,
    "text": "They put exploration and exploitation into the same equation and call it, you know, with this information-based term called free energy, which is perfectly valid.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 933.172,
    "end": 933.612,
    "text": "That's great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 934.233,
    "end": 938.736,
    "text": "But that doesn't resolve the problem because, as you pointed out, you've got parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 940.117,
    "end": 945.641,
    "text": "And the designer or somebody has to figure out what those relative weights are, the parameters are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 947.141,
    "end": 966.073,
    "text": " and uh so you really haven't advanced any you know fundamentally simply by using this free energy way of expressing what the trade-off is as opposed to some arbitrary measure called energy or preference or something like that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 967.492,
    "end": 973.614,
    "text": " So I just think that it doesn't help them when they over-claim, which is my opinion, and you can convince me otherwise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 974.234,
    "end": 974.615,
    "text": "I'm open.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 975.815,
    "end": 985.879,
    "text": "But it seems to me it doesn't help them by overstating their contribution to resolving exploration versus exploitation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 988.399,
    "end": 990.04,
    "text": "Yes, very insightful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.06,
    "end": 991.18,
    "text": "I actually totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.501,
    "end": 992.601,
    "text": "I purposely tried to not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.127,
    "end": 995.369,
    "text": " mention it as a dilemma either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.649,
    "end": 999.815,
    "text": "I think tensions, trade-offs, these are all valid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.277,
    "end": 1003.941,
    "text": "But that's kind of micro-linguistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.602,
    "end": 1009.368,
    "text": "And a more serious issue is that claims",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.526,
    "end": 1023.78,
    "text": " that do crystallized out from the text and things that people can copy and paste and quote, you know, if this were a courtroom scenario, I mean, did you say that active inference resolves exploitation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.041,
    "end": 1027.644,
    "text": "The answer has to be yes, it was claimed in the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.783,
    "end": 1031.244,
    "text": " Could somebody contextualize that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.284,
    "end": 1052.109,
    "text": "Like it's providing a first principles way where there are tunable or learnable or parameter sweepable features of models that sit at a really well positioned intersection of human interpretability and manifolds of relevant model variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.971,
    "end": 1063.459,
    "text": " Yes, in an extremely charitable reading, one could kind of bring this from coming off over the edge back onto the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.541,
    "end": 1078.311,
    "text": "That would also make active inference less surprising and less realistically hyperbolic and be part of this process of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.138,
    "end": 1097.246,
    "text": " seeing the evidence in the realization not in the um kind of ironic like we have a different partitioning of a statistical variable value so nice points um brock",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.73,
    "end": 1107.035,
    "text": " I guess I wanted to agree with that and then also maybe play a little devil's advocate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1107.735,
    "end": 1113.06,
    "text": "It's like, yeah, it's all information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1113.84,
    "end": 1116.883,
    "text": "So, solved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1117.523,
    "end": 1125.77,
    "text": "That's not really, just because it's been formulated or renamed to something pragmatic value, epistemic value, it doesn't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1126.923,
    "end": 1129.624,
    "text": " seem like that resolves it or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1134.467,
    "end": 1142.471,
    "text": "I'm wondering if the reading of that, though, could be that not that there is a there is still a trade off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1143.852,
    "end": 1149.535,
    "text": "But that the dilemma is that what they're talking about is that the trade off",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1150.279,
    "end": 1176.457,
    "text": " like when do you explore or when do you exploit not that there is a trade-off but that that is uh this last sentence and a half here of um or the resolution stems from the minimization of free energy is that whether you would seek pragmatic value or epistemic value is conditioned on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1177.478,
    "end": 1185.803,
    "text": " which your model believes to be the free energy minimizing choice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1188.565,
    "end": 1193.668,
    "text": "Though you still have the dilemma, so to speak, or the trade-off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1194.489,
    "end": 1206.437,
    "text": "But which side of the trade-off you take is maybe resolved by a generative model here, or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1206.457,
    "end": 1206.877,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.036,
    "end": 1238.537,
    "text": " that a thanks brock i think the field is set for situational resolution that may be as good or maybe better than other ways that it's been addressed um but it comes down to the exact numbers that are chosen so like in the example of the teammates um so we can look at for example this zero six and negative six huh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.08,
    "end": 1243.183,
    "text": " What if it was negative 3000 and positive 3000?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.683,
    "end": 1253.592,
    "text": "And so this came up in the live stream 45 with Ryan Smith on the folk psychology where the intensity of the preference was represented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.513,
    "end": 1259.417,
    "text": "And so if the preference is so, if you're okay, we prefer having more food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.599,
    "end": 1263.881,
    "text": "Is that gonna be a thousand versus zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.241,
    "end": 1267.004,
    "text": "Because if so, even the scantest probability",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.007,
    "end": 1270.248,
    "text": " of achieving food will be pursued.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.508,
    "end": 1280.512,
    "text": "In other words, that model is gonna be parameterized way, way, way on one side and it's gonna exploit only, or it's only gonna take locally greedy behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.453,
    "end": 1293.158,
    "text": "Whereas if someone said, well, my behavior for food is 0.00001, then maybe even the most obvious strategy would not be undertaken because it's so close to having a flat preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.389,
    "end": 1299.233,
    "text": " why is 3,000 too high and 0.01 too low?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.153,
    "end": 1305.657,
    "text": "Well, it has to do with like the ratios and the interactions of a lot of the parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.579,
    "end": 1311.602,
    "text": "So it's not even gonna be like, well, my preference is three comma one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1313.023,
    "end": 1319.768,
    "text": "That is gonna be just like two parameters being drawn out from a potentially massive parameterization of a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.451,
    "end": 1337.256,
    "text": " And so preferences, just only speaking of preferences, may be very hard to compare across situations because it's not like plus six for the preference for food and negative six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.596,
    "end": 1340.797,
    "text": "It doesn't have a semantic meaning in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.517,
    "end": 1343.217,
    "text": "It's literally a model parameterization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.798,
    "end": 1345.138,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.573,
    "end": 1370.552,
    "text": " then the question becomes how can this framework or this way of combining probabilistic inference and energy-based inference for strategic decision-making, how can those parameters be tuned into a region of subspace or manifold where the behavior is flexible and adaptive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.392,
    "end": 1375.756,
    "text": "So I think the stage is prepared for a first principles resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.483,
    "end": 1400.953,
    "text": " in that charitable reading sorry yes please yeah i was just going to say ali shared this paper medic control uh of the exploitation uh exploration exploitation it's in that nearby okay chat link um nice but that yeah that's that is it's it's not that it solves it like in some",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.233,
    "end": 1424.122,
    "text": " grand, it eliminates exploration, exploitation, or that it even completely currently, yeah, it's just the affordance, I guess, seems to be there to explain which one, why, like you're going through that, you know, there's a preference, heavy here or heavy there, and it's, you know, not that it's, it's optimal, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1424.302,
    "end": 1429.264,
    "text": "It's not that it makes sense or it's adaptable or anything like that necessarily, just that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1430.404,
    "end": 1432.265,
    "text": " there is some causal through line, maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1433.625,
    "end": 1433.845,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1434.666,
    "end": 1434.906,
    "text": "Eric?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.906,
    "end": 1437.527,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1437.787,
    "end": 1440.528,
    "text": "So I want to first read Ali's comment here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1441.228,
    "end": 1456.334,
    "text": "The critical point to establish is to define action selection as a balance between maximalization of expected reward and expected information gain, which are functionals of posterior beliefs about latent states of the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1458.062,
    "end": 1466.569,
    "text": " So that touches on a different one of the questions, which I also wrote comments on, which is about the TMAs example in particular.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1467.01,
    "end": 1470.793,
    "text": "And we may, I don't know if we'll have time, but we may get to that one today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1473.035,
    "end": 1480.302,
    "text": "So, but the question specifically, I want to raise about this comment, or maybe this, I guess, is a quote about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1481.536,
    "end": 1490.799,
    "text": " there being a balance between maximization of expected reward versus expected information gain, that's one way of having a trade-off.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1491.479,
    "end": 1501.042,
    "text": "But you might look for an agent that only wants to maximize reward in the long run.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1501.782,
    "end": 1504.843,
    "text": "But in order to do that, that entails information gain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1504.903,
    "end": 1508.685,
    "text": "And that, therefore, gives them motivation for why you want to...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1510.552,
    "end": 1521.098,
    "text": " attend to the other term, the information-based, or learning-based term, or knowledge refining of state-based term.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1521.498,
    "end": 1523.219,
    "text": "But that's in the service of the larger game.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1523.239,
    "end": 1533.904,
    "text": "And that's essentially what a reinforcement learning tries to do, is say, look, we're going to look ahead so that the moves we take now will bring us advantage in the future.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1533.944,
    "end": 1536.146,
    "text": "And there's a time discounting and all that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1536.906,
    "end": 1546.073,
    "text": " So that takes away the idea of information as being a value in and of itself, but it's only for a purpose.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1546.133,
    "end": 1553.018,
    "text": "And so I raised that specifically with regard to the TMA's example in a different question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1554.88,
    "end": 1556.521,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.081,
    "end": 1557.422,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.983,
    "end": 1562.766,
    "text": "The balance between pragmatic and epistemic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.199,
    "end": 1590.844,
    "text": " is the optimization so that is the question and that is the critical point and that's the situational balance that bottling is going to be evolving around it's like some situationally um optimal or preferable strategy around that is the point but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.772,
    "end": 1593.912,
    "text": " Pointing to the point is not the resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.793,
    "end": 1602.054,
    "text": "Does active inference provide us a natural language grounded first principles approach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.214,
    "end": 1611.976,
    "text": "It may, but that is also not dilemma resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.916,
    "end": 1617.077,
    "text": "So onto some questions, but these are really great points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.077,
    "end": 1619.257,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.041,
    "end": 1634.272,
    "text": " This is just an example of a type of question that I encourage people, especially if they're going back to the earlier chapters or just whenever they feel like making a contribution of this kind, these are like super helpful questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.432,
    "end": 1646.101,
    "text": "Again, the questions we write, some of them may be included in really important educational materials, not the least of which many further textbook groups, but potentially even far beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.19,
    "end": 1653.936,
    "text": " So what would you ask somebody to understand their comprehension of the materials?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.678,
    "end": 1660.342,
    "text": "So I just said, what are the rows, columns, and numbers in these equations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.145,
    "end": 1664.546,
    "text": "And it even says it in the text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.207,
    "end": 1666.608,
    "text": "It's the probability of the next state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.509,
    "end": 1671.532,
    "text": "So the next state is in the rows, and then the current state is in the columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.831,
    "end": 1685.68,
    "text": " And this gets distributed across everything so that the rows and columns sum to one as any other transition probability matrix would be expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.707,
    "end": 1713.58,
    "text": " to have um so we don't need to discuss it unless somebody wants to go into a little more detail but this is going to be at the core of that third step of the recipe which is you might have the structural form from the second step of the recipe in chapter six and then the next step is to kind of specify or instantiate like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.562,
    "end": 1721.264,
    "text": " in code what the dimensions are of these matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.964,
    "end": 1723.865,
    "text": "This is just saying like, they are matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.905,
    "end": 1730.647,
    "text": "There's some prior tensor matrix, some hidden state, some transition matrix, some emission matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.667,
    "end": 1734.168,
    "text": "And this is like the structure, step two of the recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.028,
    "end": 1737.529,
    "text": "Step three, how many rows and columns?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.569,
    "end": 1741.21,
    "text": "And as Jakob and others have been exploring,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.52,
    "end": 1746.963,
    "text": " There's the rows and columns of the analytical representation with the equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.444,
    "end": 1752.007,
    "text": "And then there's how pi MDP does it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.388,
    "end": 1756.41,
    "text": "And there's how different computational realizations do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.232,
    "end": 1762.915,
    "text": "Jakob, if you want to add anything about the dimensionality of these matrices, it could be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.338,
    "end": 1767.859,
    "text": "Yeah, I mean...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.259,
    "end": 1782.469,
    "text": " I can probably speak more to how time DB deals with the dimensionality, which currently is probably redundant, um, unnecessarily as unnecessary, like redundancy to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.41,
    "end": 1797.02,
    "text": "Uh, like if you're dealing with more complex state space or rather more high dimensional state space, and you have different modalities that you want to encode in these matrices, you, uh, because you're then, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.724,
    "end": 1813.693,
    "text": " performing matrix multiplications, you need to keep the dimensions of the matrices in those given modalities equal, at least in PyMDP, not in other methods, as far as I'm aware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.194,
    "end": 1820.318,
    "text": "But that means that then you have dimensions within these matrices that don't contain any information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1820.998,
    "end": 1826.622,
    "text": "So say you have a grid that you represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.847,
    "end": 1835.292,
    "text": " for the likelihood mapping of observation and state in physical world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.912,
    "end": 1844.197,
    "text": "But then you have another type of observation, like, where is another agent located with respect to you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.678,
    "end": 1846.959,
    "text": "Like, are they in a certain direction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.979,
    "end": 1848.38,
    "text": "And that might be represented by...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.253,
    "end": 1870.864,
    "text": " five observations, say like they're above, they're below, they're to the right, to the left, or not at all, then you would need to encode the observation in the nine by nine matrix, but then you need to replicate it five times because that is the same for each of those relative observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.324,
    "end": 1877.807,
    "text": "But then when you want to encode the likelihood mapping just for the second type of observation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.508,
    "end": 1888.772,
    "text": " I'm actually not entirely sure what that would be, but I'm presuming it's going to be like five by five, but then replicated nine times or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.753,
    "end": 1896.515,
    "text": "Just so the dimensionality matches, because then you're doing inference over both modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.635,
    "end": 1905.739,
    "text": "And at least in ClimbDP, you're then performing matrix multiplications over both of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.439,
    "end": 1908.2,
    "text": "Thank you, Jakob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.574,
    "end": 1937.362,
    "text": " One way I'm kind of like seeing that is there's the sparsity of the graph, but then in PyMDP or in any given computational implementation, the data structures, including potentially like auxiliary data constructs may have a dimensionality that reflects potentially at worst",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.775,
    "end": 1967.131,
    "text": " a combination of the dimensionality of other aspects as part of even just a temp file that you didn't even exactly specify there might be some intermediates stated or unstated intermediates whose dimensionality isn't merely the dimensionality of the analytical representation it's a little bit of a subtle implementational point but this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.433,
    "end": 1971.795,
    "text": " the mountain to climb to implement these kinds of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.456,
    "end": 1994.527,
    "text": "And also just while we're on this topic, I think it's one area where CAD-CAD is going to be very interesting to explore in active block inference package, because we also can imagine that the execution order of certain operations, even in a single agent setting, not just the multi-agent setting, is really relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.907,
    "end": 1996.548,
    "text": "So there's that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.288,
    "end": 2000.269,
    "text": " All right, so figure 7.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.349,
    "end": 2004.61,
    "text": "All right, so the first example is about a musician playing music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.472,
    "end": 2014.594,
    "text": "We are not aware of this example being used anywhere else, like the citations following those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.114,
    "end": 2018.375,
    "text": "This musical note type representation is not shown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.256,
    "end": 2025.238,
    "text": "And previously, we kind of discussed how some of these trace black and white images are really ambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.9,
    "end": 2030.361,
    "text": " Because of being like intersecting black lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.461,
    "end": 2035.443,
    "text": "And then of course, the empty square.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.883,
    "end": 2037.843,
    "text": "So, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.624,
    "end": 2040.544,
    "text": "Can you say where those black lines come from?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2040.584,
    "end": 2042.445,
    "text": "You want to dive into that right now?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2043.505,
    "end": 2044.786,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.086,
    "end": 2047.806,
    "text": "Well, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.047,
    "end": 2055.869,
    "text": "The upper left, each black line, even though it can be hard to trace them, I think they're just being shown like representationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.546,
    "end": 2062.75,
    "text": " they're beliefs about each note in the sequence at each time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.79,
    "end": 2074.48,
    "text": "So the time steps are on the X axis and the belief in terms of a probability are on the Y axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.563,
    "end": 2083.25,
    "text": " So initially- Right, so there's some sort of, and this gets to another question that was raised, but maybe this is time to talk about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2083.81,
    "end": 2090.616,
    "text": "There's some sort of engine, some sort of differential equation simulator or something running underneath here, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2091.997,
    "end": 2113.805,
    "text": " is not discussed in the chapter but that's generating these belief curves yes yes it's related to some functions in matlab and i was just going to mention that because my sense from the discrete model would be you'd have five let's say points on time zero then you'd have five points on time one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.532,
    "end": 2120.516,
    "text": " So I thought, well, what is happening with this kind of like, you know, little fractal crash right here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.556,
    "end": 2133.365,
    "text": "I mean, how could you have a continuously differentiable oscillating type behavior when all you're calculating analytically is just one, two, three, four, five?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.566,
    "end": 2140.05,
    "text": "Then I thought, is it meaning, are the points actually at the midpoints?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.508,
    "end": 2149.955,
    "text": " And there's a differential equation that's sort of like ribboning an action perception loop through a discrete time matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.035,
    "end": 2162.104,
    "text": "But then if this is a function that's evaluatable at every point, aren't we in a continuous time setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.911,
    "end": 2175.697,
    "text": " So wouldn't that have to imply like a machinery for unpacking a continuous time action perception cycle from discrete time specification?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.678,
    "end": 2179.979,
    "text": "So I agree very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.999,
    "end": 2183.521,
    "text": "I thought these two were, yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.402,
    "end": 2188.984,
    "text": "My guess is what they do is they've got their, you know, these equations,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2189.962,
    "end": 2194.972,
    "text": " the free energy equations, and the parameters are these distributions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2195.112,
    "end": 2197.798,
    "text": "Okay, what's your belief in these different properties?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2198.867,
    "end": 2206.594,
    "text": " And those parameters evolve over time through a differential equation because you turn this, you turn these things into a differential equation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2207.134,
    "end": 2218.484,
    "text": "And when you change, when you change the state, something like, okay, now we've got another note comes in, then that's what's going to trigger the differential equation to go in a different direction, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2218.504,
    "end": 2222.588,
    "text": "And that's what, that's why you've got the five discrete kind of, well,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2226.454,
    "end": 2232.856,
    "text": " or regimes here or target points that it kind of evolves to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2234.716,
    "end": 2240.178,
    "text": "And then the next note comes in and now the boundary conditions change essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2240.198,
    "end": 2242.819,
    "text": "So your differential equation takes you in a different direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2243.479,
    "end": 2246.02,
    "text": "And I recall that there's something like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2247.645,
    "end": 2255.048,
    "text": " you know, you guys probably discuss this more than I paid attention, but there's some sort of universal solver that they are providing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2256.169,
    "end": 2269.775,
    "text": "So you just plug in your state, your matrices, your state equations, your transition matrices, and then it'll solve it all for you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2269.815,
    "end": 2273.296,
    "text": "And that may be what this differential equation solver is about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2273.616,
    "end": 2274.697,
    "text": "You think that sounds right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2275.595,
    "end": 2299.617,
    "text": " yes i think the um yes when whenever variously in the method sections and supplemental sections of paper they'll say in the paper we're only specifying the generative model and the matrices and then we use standard routines to address it now i don't think that has the um it's not the pinnacle of accessibility and reproducibility",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.495,
    "end": 2307.019,
    "text": " However, it does at least use standard routines, but again, those are not always specified in the paper, which is an issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.04,
    "end": 2312.783,
    "text": "So it'll be important to regenerate examples within SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.494,
    "end": 2343.675,
    "text": " and then also to use some of these things that we were discussing with like the ability to move between different languages um but like vbx variational base x i don't know what the x is actually for um it is very it's one of the core functions it is actually doing the variational inference in spm and again spm is like this sort of like chimera package because it arose",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.656,
    "end": 2349.897,
    "text": " from the immediacies of needing to do neuroimaging registration and dynamical analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.998,
    "end": 2370.263,
    "text": "That then broached into dynamic causal modeling, random field theory-based statistical testing, permutation testing, all of these areas that are not themselves formally linked per se, but rather useful as part of the toolkit of a neuroimaging researcher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.941,
    "end": 2391.513,
    "text": " Then, just as we were a little bit discussing in like chapter two, and of course, many times earlier, in that generalized Bayesian inferential framework, hierarchical modeling, including action is actually not the hardest thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.394,
    "end": 2395.416,
    "text": "Yes, implementing action is one thing, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.638,
    "end": 2409.601,
    "text": " treating action selection as inference, planning as inference, it has some challenges that arise relative to just doing time series anticipation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.101,
    "end": 2417.402,
    "text": "But then those functions became compiled into SPM in a limited capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.422,
    "end": 2419.023,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.164,
    "end": 2448.909,
    "text": " they again they go through some of this but but i think it's it's a key issue um ali will definitely look forward to what the um free energy gradients are um but like what where the continuous nature of these curves and like why there are the numbers that there are one two three four five six seven eight nine ten now there's five notes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.52,
    "end": 2452.701,
    "text": " 10 is two times five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.782,
    "end": 2458.266,
    "text": "Like it's just, there's a little bit more that needs to be fleshed out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.787,
    "end": 2470.416,
    "text": "And then one question that was like, again, somewhere between testing our comprehension and being clear about what we're doing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.546,
    "end": 2478.29,
    "text": " And in this ambiguity, we can ask it without any bias.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.17,
    "end": 2481.532,
    "text": "The negative free energy gradients, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.632,
    "end": 2482.512,
    "text": "prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.874,
    "end": 2485.094,
    "text": "What?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.174,
    "end": 2488.716,
    "text": "Is a prediction error a free energy calculation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.421,
    "end": 2492.182,
    "text": " Well, ignore gradient for a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.062,
    "end": 2495.142,
    "text": "Free energy calculations are not prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.282,
    "end": 2498.263,
    "text": "Prediction errors are observations minus expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.963,
    "end": 2502.945,
    "text": "So this is like some finite value in the state space of what is being measured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.965,
    "end": 2505.945,
    "text": "Free energy is not that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.526,
    "end": 2511.147,
    "text": "It references potentially those variables, but it does things that we know about like KL divergences and such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.707,
    "end": 2514.248,
    "text": "Okay, so free energy is not prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.848,
    "end": 2517.749,
    "text": "And that's a huge difference between, for example, a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.161,
    "end": 2526.863,
    "text": " predictive processing framework, and a free energy hierarchical predictive architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.663,
    "end": 2527.863,
    "text": "Eric?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.943,
    "end": 2531.804,
    "text": "But they're saying the gradient in free energy is a prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2533.044,
    "end": 2533.464,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.765,
    "end": 2540.426,
    "text": "So even if it were... Then that was the next question, which was, what's the difference between free energy and the free energy gradients?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.186,
    "end": 2547.888,
    "text": "Are we talking about a landscape of derivatives of free energies...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.06,
    "end": 2552.801,
    "text": " Or are we talking about what here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.982,
    "end": 2569.09,
    "text": "Like, is it being described as a gradient, as a landscape and hence gradient-ish because it can be calculated over some discrete bicontinuous state space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.11,
    "end": 2577.774,
    "text": "It's like five skyscrapers that you could have derivatives over in the Y direction, but you couldn't take the partial X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.989,
    "end": 2589.038,
    "text": " Or is it truly... Or is it a continuous landscape that's just being tethered to the discrete values in X?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.138,
    "end": 2591.4,
    "text": "But then again, that's the whole continuous discrete question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.241,
    "end": 2595.003,
    "text": "Or are the values gradients?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.545,
    "end": 2599.287,
    "text": "Which has an even more complex interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.729,
    "end": 2604.012,
    "text": "So we don't have the answers on these, but these...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.372,
    "end": 2619.422,
    "text": " It's hard to understand how these figures could have epistemic or pragmatic value for learners or practitioners without some of these questions being resolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.305,
    "end": 2623.605,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.448,
    "end": 2630.351,
    "text": "The first example, this is just kind of from walking through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.431,
    "end": 2635.976,
    "text": "So the first example was just hidden Markov model, hidden states updating through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.94,
    "end": 2638.441,
    "text": " Bayesian filter, Kalman filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.521,
    "end": 2641.622,
    "text": "This is like just standard signal processing in a Bayesian framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.383,
    "end": 2647.565,
    "text": "And we're going to see a lot of echoes of the step-by-step model stream one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.285,
    "end": 2664.833,
    "text": "They give an even simpler example with static perception, one-step perception, and then go second to the dynamic case, then introduce action, pi policy, and then nuance policy through like uncertainty and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.364,
    "end": 2668.525,
    "text": " So that's the first inferential case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.305,
    "end": 2673.466,
    "text": "They're then going to head into decision-making and planning as inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.586,
    "end": 2685.768,
    "text": "So we see policy being introduced as a variable that influences how states change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.849,
    "end": 2691.289,
    "text": "Does policy do that or does action do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.33,
    "end": 2694.47,
    "text": "In the one step limit,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.087,
    "end": 2709.925,
    "text": " policies are actions are affordances but pi is specifically reserved for sequences of actions so is it that sequences of actions like do that or is it um you know is this the actual Bayes topology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.976,
    "end": 2727.95,
    "text": " But nonetheless, that architecture allows the evaluation of alternate policies in terms of their relative variational or expected free energy, depending on whether a one-step policy is accomplishable with variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.491,
    "end": 2734.156,
    "text": "That's like the instantaneous move, most consistent instantaneous maneuver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.316,
    "end": 2746.205,
    "text": " versus even one step in advance is going to broach into this whole expected free energy space we had on 1.30.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.707,
    "end": 2751.95,
    "text": "So there's a really important discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.411,
    "end": 2756.954,
    "text": "Bozaki is also very interesting researcher, neural rhythms and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.657,
    "end": 2762.979,
    "text": "Factorization is a really important topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.042,
    "end": 2790.823,
    "text": " and being able to distinguish like neurologically what do we mean when we talk about the what and the where stream the dorsal and the ventral stream and critiques of it etc but just what and where in the brain and um then in the factor graphs and computationally because the unfactorized models if we're just doing the all by all by all by all those become intractable very fast",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.832,
    "end": 2801.754,
    "text": " And the specification of the sparsity of the model is one of the same in the variational Bayes framework as the factorization of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.614,
    "end": 2812.836,
    "text": "So factorization is like kind of focusing your search efforts on manifolds where you've constrained certain things to be like linked or unlinked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.956,
    "end": 2817.477,
    "text": "That is what motivates the structure learning problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.738,
    "end": 2830.206,
    "text": " and the need to have, to not be locked into factorization schemes at a given level of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.487,
    "end": 2834.749,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.37,
    "end": 2843.875,
    "text": "Another just question to explore, like here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.438,
    "end": 2847.179,
    "text": " We have the top half of figure four, three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.819,
    "end": 2849.06,
    "text": "There's just one A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.701,
    "end": 2853.662,
    "text": "So why are there two A matrices here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.282,
    "end": 2860.605,
    "text": "Well, it's not an impossible question and the symbols go a long way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.865,
    "end": 2864.667,
    "text": "Here's the four locations that the animal can be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.227,
    "end": 2869.829,
    "text": "Starting position, bottom position, left arm or right arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.601,
    "end": 2891.55,
    "text": " Then here are the, it's five on the X here because that bottom could reveal an R or reveal an L. In this case, it reveals an R. And the food is honestly there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.871,
    "end": 2899.294,
    "text": "And then this is a second A matrix that is describing how location",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.399,
    "end": 2905.981,
    "text": " is associated with the food, non-aversive or positive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.541,
    "end": 2909.202,
    "text": "But this ties into the earlier discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.282,
    "end": 2914.163,
    "text": "Like it might be all one thing to say, well, it's four by five and then four by three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.784,
    "end": 2919.265,
    "text": "But is this actually a four by five by three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.506,
    "end": 2924.246,
    "text": "I know it's not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.787,
    "end": 2926.347,
    "text": "Eric, what do you think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.594,
    "end": 2943.361,
    "text": " Yeah, and they mentioned in this a tensor also, and the tensor means that you're stacking this one, this image against the version where the reward is on the left side.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2943.981,
    "end": 2948.503,
    "text": "So the tensor is going to be 4 by 8 by 2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2949.924,
    "end": 2952.065,
    "text": "So that makes sense for being the tensor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2952.105,
    "end": 2954.386,
    "text": "So the state is another layer on top of this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2954.406,
    "end": 2956.547,
    "text": "The hidden state is another layer on top of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2958.393,
    "end": 2958.613,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.301,
    "end": 2968.082,
    "text": "Section 7-3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.422,
    "end": 2976.309,
    "text": "So this would be a fun, you know, kind of like PhD qualifying level question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.67,
    "end": 2979.272,
    "text": "Just describe the whole team ace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.253,
    "end": 2983.175,
    "text": "Every row, every column, and every value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.216,
    "end": 2984.977,
    "text": "Why is it that way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.318,
    "end": 3017.758,
    "text": " so we're going to type it out here but that is to understand that that example and what what the b matrices are and just what what and and to have agility and just identifying the differences between these matrices numerically like pattern recognition like oh here there's two ones here two zeros here two zeros here two ones here one and zero these stay the same and then to be able to transpose that in your understanding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.922,
    "end": 3029.108,
    "text": " to what this means in terms of transition frequencies, every place where there's a difference, it's a difference that makes a difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.248,
    "end": 3035.291,
    "text": "So being able to understand what those are is about understanding this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.232,
    "end": 3047.558,
    "text": "And one can imagine, especially if they're wanting to make a application of active inference that's more complex than this four by four, being fluent with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.102,
    "end": 3077.607,
    "text": " how these matrices are constructed their dimensionality how um differences in the generative process are incorporated how differences in the generative model are incorporated all these different features are um important um this is yes eric this is definitely very important um question agreed like it it looks extremely neural",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.141,
    "end": 3082.343,
    "text": " This has, and these traces come up all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.666,
    "end": 3089.268,
    "text": "Similarly here, we have three discrete time points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.05,
    "end": 3096.874,
    "text": "Starting, going to the Q, getting the L, and then going to the left arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.055,
    "end": 3100.777,
    "text": "But then what is this step one and a half?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.658,
    "end": 3106.281,
    "text": "Is the one all of these points?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.762,
    "end": 3111.265,
    "text": " And then by two, the uncertainty is resolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.325,
    "end": 3113.047,
    "text": "The belief about certain things goes to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.087,
    "end": 3114.488,
    "text": "The belief about other things goes to one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.549,
    "end": 3129.341,
    "text": "And this is just a pure interpolation, but that is quite a specific interpolation, including what appear to be some like dopaminergic spikes or something that are not reflected at either of the time points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.502,
    "end": 3132.804,
    "text": "My guess is that you've got three different blocks there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3132.944,
    "end": 3135.246,
    "text": "So if you take the one as being the width",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3136.152,
    "end": 3146.076,
    "text": " you know, one third of the way across, the two is another third and the three is another third, then that switch there that you see happens as soon as you transition from the one to the two.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3150.038,
    "end": 3150.278,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.199,
    "end": 3158.142,
    "text": "Although still there's even the graphical interpolation question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.382,
    "end": 3162.244,
    "text": "And it's so easy to be like reading...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.711,
    "end": 3166.573,
    "text": " Is it just a quirk of the dashed line?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.153,
    "end": 3171.595,
    "text": "But are there two dashed lines and one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.415,
    "end": 3175.157,
    "text": "Two dashed lines diverged in a neural trace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.777,
    "end": 3179.539,
    "text": "So, but it's kind of clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.619,
    "end": 3181.54,
    "text": "These ones, the discrete formulations are clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.48,
    "end": 3183.681,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3184.921,
    "end": 3185.141,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.142,
    "end": 3187.762,
    "text": "Are rats prone to useless behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.383,
    "end": 3188.803,
    "text": "What do you think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.124,
    "end": 3191.004,
    "text": "What useless behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.916,
    "end": 3195.556,
    "text": " I wrote it out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3196.177,
    "end": 3196.777,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.817,
    "end": 3197.377,
    "text": "Yeah, this is good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.397,
    "end": 3203.559,
    "text": "Maybe we don't have time for today, but that's my most provocative comment on this one, and maybe we can save that for next week.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3204.619,
    "end": 3205.38,
    "text": "Okay, perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.44,
    "end": 3209.321,
    "text": "Let's pick up with this one and any other questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.101,
    "end": 3219.044,
    "text": "Then we'll glance over the visual saccade, look at the learning example, consider the hierarchical example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.385,
    "end": 3220.065,
    "text": "There's the maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.645,
    "end": 3222.145,
    "text": "Then there's the hierarchical example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.946,
    "end": 3223.286,
    "text": "Another...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.651,
    "end": 3235.756,
    "text": " nested discrete meets neural continuous trace and then we end on seven squared so thank you all have an excellent day",
    "speaker": "SPEAKER_00"
  }
]