[
  {
    "start": 2.798,
    "end": 10.109,
    "text": " All right, it's our second discussion in cohort four of chapter one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 12.432,
    "end": 18.742,
    "text": "Does anyone at the beginning want to just bring up any comment or any specific question about chapter one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 20.705,
    "end": 26.393,
    "text": "Or otherwise, we can look at one recent stream transcript.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 34.237,
    "end": 40.288,
    "text": " Okay, so Terry, you asked a question about the generative model and the generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.829,
    "end": 42.673,
    "text": "So maybe just summarize that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.733,
    "end": 48.904,
    "text": "And then we'll see how it played out recently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 50.791,
    "end": 63.924,
    "text": " My question was when we were trying to create a model, we create the generative model, we sort of define it in four sort of domains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 64.604,
    "end": 71.11,
    "text": "And then you define the generative process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 72.192,
    "end": 78.958,
    "text": "But now if we think of the Markov blanket as separating the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 79.782,
    "end": 103.562,
    "text": " internal state from the unknowable external state well if we're creating a model and that model depends on us creating something that is in fact unknowable or is there not a corruption within that thought process so it creates",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 104.268,
    "end": 128.115,
    "text": " an impression that within the context of if I take my Markov blanket as being my skin then um I uh I cannot know what is the generative process so there's got to be some flaw in our system of modeling if it depends on creating something we can't know",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 132.837,
    "end": 133.618,
    "text": " All right, awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.938,
    "end": 145.548,
    "text": "And when you when you asked that, it made me think of the recent stream with Maxwell Ramstead, Mal Apparasan and Ali and others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.869,
    "end": 155.116,
    "text": "And this highlighted a inconsistency in the generative model, generative process topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.196,
    "end": 162.102,
    "text": "Ali, do you want to summarize what you what you asked and what they wrote or said?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.06,
    "end": 163.784,
    "text": " Yeah, of course.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 164.266,
    "end": 171.282,
    "text": "Well, we were talking about the discrepancy between Maxwell's presentation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 171.616,
    "end": 184.19,
    "text": " and also the recent paper, because in figure one in inner screen paper, they have indicated generative model as encompassing the whole shebang.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 184.27,
    "end": 189.756,
    "text": "I mean, encompassing the internal states, the external states, and of course the blanket states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 190.217,
    "end": 196.644,
    "text": "So nowhere generative process was visible in this diagram.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 196.684,
    "end": 201.049,
    "text": "So we were discussing with Daniel and Sanjeev and others",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 201.029,
    "end": 206.977,
    "text": " where exactly generative process can be manifested in this diagram.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 207.698,
    "end": 214.828,
    "text": "So I basically asked this question, where is the generative process in this diagram?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 215.529,
    "end": 222.379,
    "text": "And surprisingly, Maxwell somehow",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 222.933,
    "end": 226.478,
    "text": " disowned the earlier literature on generative process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 227.199,
    "end": 246.966,
    "text": "And basically, I mean, he just, I mean, interpreted the generative model in a kind of new, more sophisticated way that wouldn't require any separate entity as generative process, because generative model basically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 247.722,
    "end": 258.233,
    "text": " includes the joint probability of everything that Markov blanket partitions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 258.553,
    "end": 265.601,
    "text": "So it is a joint probability of internal states, blanket states, and the external states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 265.621,
    "end": 277.493,
    "text": "But on the other hand, when we want to model a situation and not just describe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 277.473,
    "end": 291.702,
    "text": " a physical phenomena or a physical system then of course we can define our own generative model as something that or let's put it this way as",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 292.762,
    "end": 299.733,
    "text": " Roozbeh Gharakhloo, kind of dynamics that we expect the system or the situation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 300.233,
    "end": 309.808,
    "text": "Roozbeh Gharakhloo, The situation we have to follow those dynamics and so, for instance, if we want to model, a very simple.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 310.193,
    "end": 314.919,
    "text": " linear behavior of a, I don't know, mechanical system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 315.34,
    "end": 327.916,
    "text": "But then, of course, the Newtonian mechanics or, you know, the terms, the Lagrangian mechanics of the system can constitute the generative process of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 328.617,
    "end": 339.711,
    "text": "So yeah, that's basically the gist of Maxwell's argument, at least as far as I understand it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 342.374,
    "end": 367.572,
    "text": " yeah quite a discussion we can kind of parse it out better but the transcripts out there like so um as with everything in the textbook it's kind of like there's a there's some internal ontology",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 368.345,
    "end": 374.612,
    "text": " And then, um, it's somehow aligned with the broader active gestalt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.632,
    "end": 383.441,
    "text": "And for that, you will still, it helps to understand the generating process and the particles of the agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.382,
    "end": 391.63,
    "text": "And so, um, like to, to the, to, uh, the earlier question, how can you model the unknown?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 391.67,
    "end": 396.715,
    "text": "Because you you're modeling something into existence in the act of modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.606,
    "end": 404.414,
    "text": " So you can have the real temperature of the room, do statistics on an unobserved that maps to the observables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 405.375,
    "end": 414.186,
    "text": "So in practice, there's no issue, but then people have a lot of degrees of interpretation with what that means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.226,
    "end": 417.91,
    "text": "And that's the whole, and what that means for different situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 419.933,
    "end": 427.562,
    "text": "But all of that aside, in terms of these two ways to talk about generative model, generative process,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.032,
    "end": 445.07,
    "text": " As it's being shown in the inner screen paper, the generative model is just the entire process giving rise to 100% of the system's level description, including states that generate other observables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 446.812,
    "end": 456.182,
    "text": "Whereas in the textbook, they go to some length and distinction to highlight the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.782,
    "end": 462.047,
    "text": " which has an aboutness of a generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.388,
    "end": 470.256,
    "text": "The underlying particular partition, like separating it this way, is not changed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 471.237,
    "end": 482.05,
    "text": "So it's the same topology of the underlying graph that gives rise to all the formalisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.271,
    "end": 486.895,
    "text": "But it's just kind of, it's truly a nomenclature question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 489.338,
    "end": 493.246,
    "text": " About where you say okay now these it's like what yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 494.668,
    "end": 499.658,
    "text": "it's just nomenclature question about describing this but it's one that always comes up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.401,
    "end": 501.622,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.165,
    "end": 508.495,
    "text": "What does anyone think about this it's kind of a funny random but cool ongoing topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 518.752,
    "end": 525.115,
    "text": " Sorry, if I may add some additional comments to what I just previously said.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 526.339,
    "end": 529.47,
    "text": "I mean, to my mind, this recent interpretation actually",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 529.72,
    "end": 553.348,
    "text": " uh makes more sense because uh one of the misconceptions around fep uh has always been how i mean how can we sure about how to model generative process if the causes of the observables are as the name suggests latent states or hidden states right so if we don't know uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 553.767,
    "end": 564.037,
    "text": " the exact causes of those observations, how is it possible to model it in a precise probabilistic terms?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 564.637,
    "end": 580.973,
    "text": "But in this new way of looking at the generative model versus generative process, well, we can basically, I mean, somehow put this issue under the rug by",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 581.223,
    "end": 597.325,
    "text": " by somehow reinterpreting the generative model as including both the external states and the internal states and only following the variational density of the internal states as",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 597.305,
    "end": 603.573,
    "text": " I mean, tracing or tracking or not tracking the external states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 603.693,
    "end": 625.742,
    "text": "So that's basically, I mean, the whole thing, the whole model and its whole relation with the quote-unquote reality is something more akin to probably an instrumentalist view of reality rather than",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 626.414,
    "end": 644.361,
    "text": " I mean the realist, the perspective, because here we just use this theoretical framework only to account for the parts of the reality or the behavior of the reality that we can model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 645.222,
    "end": 653.535,
    "text": "It looks like a luxury tautology, but that's basically what I understood by this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 653.903,
    "end": 655.166,
    "text": " a new interpretation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 656.048,
    "end": 669.162,
    "text": "So that's probably one of the ways to evade those criticisms or misconceptions around the generative process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 673.495,
    "end": 674.116,
    "text": " Thank you, Ali.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 674.576,
    "end": 675.497,
    "text": "Very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.318,
    "end": 685.346,
    "text": "Just to kind of connect this to a previous discussion in Livestream 6, one of the early paper-based discussions, this was described as the tale of two densities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.406,
    "end": 688.109,
    "text": "And we probably even use this meme still.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.13,
    "end": 700.38,
    "text": "But the tale of two densities was the generative direction from the temperature in the room, hidden state, emitting thermometer readings was the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.597,
    "end": 727.6,
    "text": " a generative direction it's referring to the same graph still and the recognition density was like from the sensor data the incoming and so that led to a lot of um well like okay the generative is action the recognition sensory and uh i think what ali is pointing to is that um if you just kind of say uh well even if it has a million nodes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.014,
    "end": 753.638,
    "text": " the weather one's internal external blanket is relative to whichever one you're talking about so those are not absolute states so you might as well just call the whole thing a generative model still with certain uh components whose sparseness gives them certain properties but there's no need to necessarily distinguish",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.098,
    "end": 771.171,
    "text": " John Kane- Between these two um but still it makes sense to think take it think about an agent based modeling perspective and about the process that generates so so it's not that he invalidates what the textbook says just from a first thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 771.151,
    "end": 792.366,
    "text": " it just sort of expands the scope of what people will probably mean with generative model which is just to say the whole generating architecture of the program probably also closer with generative ai so it's it's um probably a good direction to go but it will still but but this is could be thought of as just like agent and niche",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.342,
    "end": 794.344,
    "text": " But can I?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 796.027,
    "end": 796.428,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 796.468,
    "end": 799.794,
    "text": "This could be a problem for me about using language.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 800.395,
    "end": 807.688,
    "text": "So whenever you say there is a temperature in the hidden external state,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 808.158,
    "end": 811.944,
    "text": " When you say temperature, that's a perception.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 811.964,
    "end": 823.483,
    "text": "We can think of it as a representative of the amount of energy in that external state, and we perceive it as a qualia of heat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 823.463,
    "end": 830.709,
    "text": " So, but actually we've kind of no idea what that is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 830.749,
    "end": 835.353,
    "text": "We use this term temperature, but we don't know what that means.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 836.114,
    "end": 843.32,
    "text": "If you think of that, you know, like the physics of information, or physics as information process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 843.4,
    "end": 853.369,
    "text": "And so the temperature is information that exists in the unknowable external state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 853.501,
    "end": 866.478,
    "text": " Rupert Clayton, Our perception of temperature is actually part of the electromagnetic spectrum, you know the infrared light is what we're is what we detect as temperature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 866.538,
    "end": 877.011,
    "text": "Rupert Clayton, And then we call we call it a thing in the X or we make we make an assumption about what that means and the external state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 877.295,
    "end": 889.449,
    "text": " David Sloan- But really I kind of think that we are our quality of temperature isn't what we mean when we measure the temperature of the external state with a thermometer or.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 889.949,
    "end": 892.933,
    "text": "David Sloan- temperature receptor in our skin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 895.175,
    "end": 903.505,
    "text": "David Sloan- You know, so I can I always feel like i'm talking like i've taken too many drugs and i'm a 14 year old, but you know it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 904.463,
    "end": 907.627,
    "text": " Summit HQ- It cut this this kind of em.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 908.889,
    "end": 919.922,
    "text": "Summit HQ- It feels like there are loads of like syntax errors in the thought processes around all this and and it it it it confuses me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 924.228,
    "end": 924.548,
    "text": "I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 925.186,
    "end": 927.331,
    "text": " Yeah, I was had a perspective on this question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.411,
    "end": 929.856,
    "text": "Please bear with me if it sounds a little too simplistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.956,
    "end": 931.84,
    "text": "And, you know, think about it this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.88,
    "end": 933.785,
    "text": "You know, I'm quoting Mark Solms, by the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.526,
    "end": 944.207,
    "text": "If my body is immersed in an environment with, you know, 70 degrees Celsius temperature and I don't solve that problem, I die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.879,
    "end": 950.349,
    "text": " If my body is immersed in the environment with zero degrees Celsius and I don't solve that problem, I die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.031,
    "end": 955.519,
    "text": "So at some point, it is not about complex philosophical things because you can go into physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.74,
    "end": 962.112,
    "text": "Originally, temperature and entropy were variables designed for a system at equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.885,
    "end": 985.348,
    "text": " so we can get as semantically complex as you like but again taken back to bodies you know there is that very specific thing that if you you know are outside of the homeostatic range of temperatures and you do not solve that problem originally through reflexes through sweating or whatever and maybe through behavior if you don't solve it you die so how is that for the you know temperature is that okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.337,
    "end": 991.024,
    "text": " Yeah, but just one point on temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.044,
    "end": 993.469,
    "text": "I think it's a great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 994.11,
    "end": 1001.104,
    "text": "And you are indicating like sort of the real ontological base existence reality, which of course, even people have different views on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.645,
    "end": 1009.581,
    "text": "But you can model the unobserved state as like, we could say, this is the SAT score.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1009.78,
    "end": 1013.125,
    "text": " But we're not fully observing it because we have a partially ripped up file.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1013.666,
    "end": 1021.176,
    "text": "So the modeling of what is a hidden state versus an observable is really just a question of like, what do you have data for?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.216,
    "end": 1031.451,
    "text": "And then what do you want to include as a causal or latent factor in your model, but you don't necessarily have data for as an observable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1032.157,
    "end": 1059.396,
    "text": " but you may even choose to have hidden states for things that you could get data for so I think that's the kind of deflationary bent in this textbook and and it may be in many people's active inference Journeys when the model itself is built as they encourage people to do from the first chapter to the last then you see the specifics of how it plays out in that generative model and the contributions to the field consist of specific generative models made",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1059.832,
    "end": 1088.809,
    "text": " and general claims with the active inference ontology can i just say alexi the thing um that it struck me is to in order to act in the world to remove myself from the temperature that's going to burn my skin i don't actually have to know anything about the generative process i can make assumptions about the generative process and then act in the world to try to alter that but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1089.194,
    "end": 1104.539,
    "text": " My confusion lies with how we can then within a model construction dictate what the process, what the generative process is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1104.659,
    "end": 1113.514,
    "text": "And I can understand why you have to do that if you're going to create a model, but it kind of just doesn't speak to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1115.401,
    "end": 1123.109,
    "text": " to the ideas laid out in chapter one in this book.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1123.129,
    "end": 1133.961,
    "text": "Another angle is when you approach a specific question or line of inquiry, you're not trying to make the total twin through a scientific model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.762,
    "end": 1144.092,
    "text": "You could learn something about the knee without having the full simulation, whatever that would even mean, of a knee.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.502,
    "end": 1171.277,
    "text": " in the specific modeling but maybe that's coming from an experimentalist's perspective so I'm not sure Alexi yeah I I had I had maybe in a reaction but I wonder if maybe we need to maybe time to maybe let this idea sink is it appropriate for me to ask another question on a slightly different topic or would that be too abrupt yeah yeah definitely that sounds totally good if you are if it's here or just ask it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.477,
    "end": 1175.613,
    "text": " So it's about chapter one, and I'm reacting to this text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.994,
    "end": 1179.327,
    "text": "Action is quintessentially goal-directed and purposive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.728,
    "end": 1185.116,
    "text": " OK, so I understand that, you know, there's a goal to stay alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.337,
    "end": 1185.998,
    "text": "No questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.078,
    "end": 1186.318,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.438,
    "end": 1200.681,
    "text": "But, you know, if we move to human subjects and, you know, please forgive me, sort of clinical psychology, psychotherapy, then there's a ton of action that humans do that at least doesn't appear as goal directed or purposive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.222,
    "end": 1206.63,
    "text": "In fact, if every action humans did was goal directed and purposive, we wouldn't need psychotherapy at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1207.302,
    "end": 1214.418,
    "text": " Like we have, I don't know, maladaptive behaviors, we have obsessions, compulsions, tics and whatnot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.438,
    "end": 1226.965,
    "text": "So I'm not exactly sure if we stand with that postulate that every action is quintessentially goal-directed and purposive, would that model not oversimplify things for human subjects?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.155,
    "end": 1252.716,
    "text": " that's a great question a short thought on it and then anyone can raise their hand is even an isocade can be purposeful uh purposive because you can explain it in terms of using this framework so it doesn't necessarily mean that in some integrated way it's beneficial for the person's life or for any given social recognition or bodily health necessarily",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1252.696,
    "end": 1259.727,
    "text": " because you can do modeling of pathologies too, but the purposiveness is just local teleology, local directedness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.328,
    "end": 1266.177,
    "text": "Moving the elbow to do a slot machine again and again is purposive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.418,
    "end": 1273.489,
    "text": "You can argue whether it is with the person's long-term professional interest, but the action is still purposive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1274.701,
    "end": 1296.473,
    "text": " yeah well my my issue with the teleological explanation is that it is often uh very speculative when people for example tell me that my state of depression has a purpose to inform me that i have an unmet need which is mainstream you know models and clinical psychology sometimes like how do you know that depression doesn't have five different purposes and models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.453,
    "end": 1319.22,
    "text": " we pretty much you know if you if you say infer speculate that that's the the purpose of depression so the teleology is is a little kind of weird for me maybe it is mainstream and active inference framework but it's a little weird yeah but maybe i'll think about it more a related question is this when we say the goal directed character of action the question is whose goal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1319.2,
    "end": 1325.445,
    "text": " Again, going back to human subjects, there's conscious, there's unconscious processes, and sometimes people do something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.866,
    "end": 1327.127,
    "text": "And they're like, I did this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.307,
    "end": 1339.998,
    "text": "I rationally know I shouldn't have done it, but I did it anyway, which suggests that they have multiple components of their agency and not just a unitary John who decided all the goals and purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.058,
    "end": 1341.9,
    "text": "So the question is, whose goals?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.8,
    "end": 1343.641,
    "text": "What exactly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.701,
    "end": 1345.122,
    "text": "Do we assume unitary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1345.142,
    "end": 1348.245,
    "text": "Do you assume that the agent is a singular thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.085,
    "end": 1355.468,
    "text": " Yeah, great question, Kate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.489,
    "end": 1373.575,
    "text": "Well, my thoughts on this are that I would say that in my understanding, at least active inference views the mind as a hierarchical structure, but definitely hierarchical build up of many different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.466,
    "end": 1384.221,
    "text": " Sub layers of the brain and ultimately the goal of therapy like in some other therapies, but in some way could be the integration of all these different cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.602,
    "end": 1394.938,
    "text": "But those in by themselves, the lower lower levels or parts of the hierarchy or components of the hierarchy within their own domain, they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.239,
    "end": 1409.474,
    "text": " purposive, the action within those domains, they don't solve the host necessarily as such, but within their own logic, internal logic, even if you could put it in the math, it would fit the free energy principle and the active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.194,
    "end": 1416.941,
    "text": "So the goal there is to figure out how to bring the hierarchy together in a more purposive or healthy way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.062,
    "end": 1420.785,
    "text": "That's the thought that your comment triggered, Alexei.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.906,
    "end": 1422.327,
    "text": "That's all I have to say about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.577,
    "end": 1444.516,
    "text": " I am very much for this thought, and it's beautiful, except, you know, bear with me, maybe I'm a devil's advocate, but what I see in clinical work and what is mainstream in psychodynamic psychotherapy is mental conflicts, such as, I want this, but I cannot have it, or I should be doing this, but I want to do something else, or I want A and B and they're mutually exclusive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.077,
    "end": 1446.858,
    "text": "And in that regard, there is no hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.918,
    "end": 1448.66,
    "text": "There is an unresolved conflict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.04,
    "end": 1452.583,
    "text": "Mind in a conflict is very mainstream kind of hundred-year-old",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.563,
    "end": 1481.203,
    "text": " clinical tradition and you know ultimately you don't resolve those things you know that that mind goes from one conflict to another to the third one we have multiple needs like the famous madonna horse syndrome is an example of that and how people find a compromise from that is a sort of personality so i i just do think that some of these assumptions and postulates we make early on that there's this you know either it's resolved through the hierarchy or there's a singular agent whose goals and purposes we follow are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.183,
    "end": 1485.108,
    "text": " you know, okay for a bacteria, but maybe not for a human mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.151,
    "end": 1509.942,
    "text": "Well, but Kurt Harris, his studies on psychedelics and his theory of how the psychedelics would kind of reset the priors, reset the precision of the priors, the valence, and in many cases it oftentimes helps with some of the symptoms, which would argue for that view,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.124,
    "end": 1530.04,
    "text": " So you may not be able to do it verbally through verbal interaction or through language, but in some other parts of it may be open to more chemical or neurotransmitter kind of related reset as opposed to a verbal reset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.522,
    "end": 1534.665,
    "text": " Anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.886,
    "end": 1546.118,
    "text": "Just to kind of give one thought and then Ali, goal is not really a required term, just my personal view, in the active inference ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1546.539,
    "end": 1548.621,
    "text": "We don't talk about kicking a ball through a goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1548.681,
    "end": 1551.224,
    "text": "We don't talk about a milestone-based goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1551.284,
    "end": 1556.109,
    "text": "It doesn't come up when we're actually using the active ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.189,
    "end": 1560.634,
    "text": "It's not a parameter in the model, but cybernetics has long been",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1560.614,
    "end": 1562.517,
    "text": " and telios and all of these debates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1562.537,
    "end": 1579.821,
    "text": "So I think actually what's really exciting and I'll say here for now is it actually points towards exciting different ways of understanding purpose of behavior and where goals and rewards come into play by thinking about likely paths being selected",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.071,
    "end": 1592.505,
    "text": " rather than rewarding paths, and how that generalizes across a system that stays in a wooden groove, and how that also may relate to these higher order sophisticated cognitive functions like narrative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1593.206,
    "end": 1596.55,
    "text": "But that is not something that we're going to see in figure 4.3.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1596.57,
    "end": 1599.673,
    "text": "That's something where once you build that Tower of Babel, then you'll know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1600.054,
    "end": 1604.179,
    "text": "But hypothetically, what can you say without the generative model of what people are talking about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1604.679,
    "end": 1609.825,
    "text": "Because we're not talking about just the base four nodes modeling the whole brain like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1609.805,
    "end": 1614.872,
    "text": " if you were going to make a model that had multiple debating personalities, then it simply would have that feature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.174,
    "end": 1616.414,
    "text": "Ali?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.239,
    "end": 1630.773,
    "text": "Well, actually, I think the term action here is used instead of I mean, to refer to intentional action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1631.795,
    "end": 1638.664,
    "text": "So I don't think it's action in its broadest sense, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1638.644,
    "end": 1650.696,
    "text": " even if we restrict ourselves to only intentional actions, there are some theories, both philosophical and in cognitive science, that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1651.3,
    "end": 1659.73,
    "text": " tries to somehow frame this notion of action in terms of an alternative conception of causality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1660.15,
    "end": 1669.441,
    "text": "So one notable work in that regard is the work of Alicia Huarjero in her work, in her book, Dynamics in Action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1669.561,
    "end": 1675.468,
    "text": "So in this book, I mean, the basic premise of this book is exactly",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1675.448,
    "end": 1680.74,
    "text": " the question, what is the difference between a wink and a blink, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1681.482,
    "end": 1687.315,
    "text": "So, I mean, in order to come, in order to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1687.497,
    "end": 1698.011,
    "text": " come up with a viable theory of action that can include all of these intentional and non-intentional actions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1698.712,
    "end": 1717.437,
    "text": "She proposes a theory of causation based not on traditional linear cause and effects, but rather looking at the whole complex adaptive system as",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1717.417,
    "end": 1729.449,
    "text": " as possessing some constraints and looking at those constraints as somehow giving rise to causation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1729.849,
    "end": 1742.462,
    "text": "In other words, what we mean by causation is actually undertaken by those constraints of those complex adaptive systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1743.539,
    "end": 1752.84,
    "text": " Rameen Mohammadi, Sorry, so these dynamical constraints can actually account for both bottom up and top down causal relations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1753.175,
    "end": 1759.543,
    "text": " So in this sense, it can include both intentional action and non-intentional action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1760.004,
    "end": 1780.009,
    "text": "And if we take goal-directed action as kinds of action that tries to satisfy those dynamical constraints, then this, I mean, claim in the book can make sense in this complex dynamical system framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1784.157,
    "end": 1785.018,
    "text": " Great, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1785.299,
    "end": 1785.659,
    "text": "Alexey?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1787.462,
    "end": 1793.731,
    "text": "I just had a couple of reactions, Daniel, to what you said, and thank you for your comment about gold being necessary or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.132,
    "end": 1796.616,
    "text": "Please forgive me if my metaphors are very simplistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.036,
    "end": 1802.184,
    "text": "So the car sitting in the parking lot idling, burning gas, is increasing entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.705,
    "end": 1805.629,
    "text": "It is not moving anywhere, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.97,
    "end": 1808.173,
    "text": "A car going to where I need it to go",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.491,
    "end": 1811.938,
    "text": " is going toward a goal and perhaps it is wasting some energy as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.038,
    "end": 1822.098,
    "text": "So if we remove the goal out, then how will we actually look at the free energy versus the energy used toward a meaningful purpose?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.318,
    "end": 1830.955,
    "text": "So I think implicitly, perhaps a goal is to survive for an organism and to maintain survival evolutionarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.935,
    "end": 1831.255,
    "text": " Arun Rao, Ph.D.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1831.235,
    "end": 1832.898,
    "text": ": survive until reproductive age and reproduce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.038,
    "end": 1835.822,
    "text": "You know some kind of goals like that exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.923,
    "end": 1839.168,
    "text": "Perhaps, you know, if you take all of them out, then then it's all entropy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.809,
    "end": 1851.306,
    "text": "And also I had a maybe reaction to Kate that you know I am very, very respectful of Carthright Harris's work and psychedelics with that I just i'm highly skeptical of the idea of reset or anything brief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.286,
    "end": 1856.954,
    "text": " Because attachment style in a human being takes from six to 18 months.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.855,
    "end": 1860.378,
    "text": "Nine women pregnant for a month will not produce a baby.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.939,
    "end": 1862.601,
    "text": "Personality takes time to form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.801,
    "end": 1871.973,
    "text": "And all of this sort of quick resets, whether it's ayahuasca or ketamine or even electroconvulsing therapy, I just don't buy that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.494,
    "end": 1875.799,
    "text": "I think that it's mind in a conflict remains in a conflict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.959,
    "end": 1878.582,
    "text": "It's just how it solves the conflict is the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1878.602,
    "end": 1880.685,
    "text": "It may be solving it more adaptively, more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.172,
    "end": 1882.674,
    "text": " you know, in a more nuanced way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.694,
    "end": 1887.762,
    "text": "But I don't think that anything quick, like a magic wand of psychedelics, will resolve that in any way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.131,
    "end": 1897.856,
    "text": "Yeah, one paper by Adam Safran is the Albus model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1897.996,
    "end": 1901.982,
    "text": "So while that relaxation of beliefs was more visible,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.333,
    "end": 1909.702,
    "text": " and led to a kind of relaxation-based emphasis on what psychedelics might do, which may be half the picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.763,
    "end": 1929.927,
    "text": "Adam just kind of generalized it to altering, like, well, depending on which generative model you make or how you think about what the brain is or whatever, different pharmaceutical or non-pharmaceutical experiences are going to not just purely relax a distribution, the distributions are part of the map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1929.907,
    "end": 1958.513,
    "text": " so I think um like it it's not a property of a physical molecule to do so except again interpreted in this more abstract causal space um to your question Alexi um you know you should talk about a car in the parking lot it's great it's just disordering material and it's not going anywhere it's not goal oriented but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1959.421,
    "end": 1969.237,
    "text": " Its purpose could be described hyperlocally as just being in one place, like a rock's purpose, just using, again, this broader concept of purpose, which doesn't come up in the acting fontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1969.457,
    "end": 1970.139,
    "text": "We don't need the goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.72,
    "end": 1972.242,
    "text": "But the rock's goal is just to be right there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.643,
    "end": 1974.185,
    "text": "The leaf's goal is to go downstream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1974.746,
    "end": 1986.205,
    "text": "So by having a deflationary optional concept of intentional behavior, including like Carl Woodlice's example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1986.185,
    "end": 1995.353,
    "text": " where there was insects running around on the pavement and they went faster where it was light and slower where it was dark, so they accumulated where it was dark.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.373,
    "end": 2008.585,
    "text": "So including a whole continuum of intentionality based upon return to an attracting set, it just turns out to be enormously general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2009.506,
    "end": 2013.93,
    "text": "Now, how to connect that to the physical entropy lost by organisms?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2014.17,
    "end": 2015.331,
    "text": "Open question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2015.699,
    "end": 2024.073,
    "text": " And then how to use some other terms from thermodynamics, like what would informational work be versus informational heat?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.093,
    "end": 2031.565,
    "text": "Well, Chris Fields is certainly approaching those types of questions, but I hope that addresses a few pieces of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.612,
    "end": 2059.982,
    "text": " something doing the most likely thing is exactly the criterion that you would use for for statistics and so in that way it's why we can use statistics so um adeptly in this modeling because statistics isn't about simply maximizing reward but like all statistics is about finding um this path of least action in an informational space ollie",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2063.472,
    "end": 2066.575,
    "text": " Sorry, it was my hand risen from before.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2066.595,
    "end": 2067.596,
    "text": "Sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2067.616,
    "end": 2068.177,
    "text": "Oh, no worries.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2069.939,
    "end": 2076.045,
    "text": "Anyone who hasn't brought something up just definitely it's gone all over, which is totally cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.085,
    "end": 2080.15,
    "text": "But if somebody wants to go to a specific question of chapter one or a quote, we could do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.46,
    "end": 2092.062,
    "text": "I did want to chime in on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2093.02,
    "end": 2101.031,
    "text": " the previous topic about action is quintessentially goal-directed and propulsive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2102.193,
    "end": 2109.824,
    "text": "We have some ways to get further into the textbook, but we're going to be going over things like policy selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.445,
    "end": 2117.695,
    "text": "I'm assuming active inference involves not just settling upon a single unchanging",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2117.894,
    "end": 2143.429,
    "text": " policy right continuing with them that's what an agent operates with rather it would be you know a potential entire series of competing policies that may very well be actively updated based upon what the agent has maybe learned in the past new incoming observations so i'm just kind of reflecting on everything that's been said and um because whenever i read this i",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2143.898,
    "end": 2162.197,
    "text": " It feels a little bit easier for me to take the phrase goal directed with a bit of a grain of salt and think like, oh, there could be multiple potentially even conflicting policies in play that themselves are constantly potentially changing or shifting in a variety of ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2162.357,
    "end": 2170.345,
    "text": "So just, yeah, it's just a kind of final comment, I suppose, on that topic I was thinking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2170.477,
    "end": 2187.945,
    "text": " yeah that's awesome it's so true policy is evaluated every time step, so this is exactly how we integrate action into the loop with like a loop or just behavioral loop so that's a great point Terry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.444,
    "end": 2216.734,
    "text": " The way I interpreted that was that the goal is fundamentally to answer questions of the universe and therefore get evidence that then can be fed into the variational free energy model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2216.714,
    "end": 2227.104,
    "text": " to either update our priors or act in the world to reduce the variational free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2227.144,
    "end": 2231.889,
    "text": "So the goal isn't a goal to achieve an end.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2232.37,
    "end": 2244.662,
    "text": "The end is to answer the question about minimising variational free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2245.081,
    "end": 2263.046,
    "text": " And then our behavior in the world that we read as policy-led, goal-directed is actually more a function of that primary objective of the organism, which is to minimize variational free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2266.631,
    "end": 2268.473,
    "text": "Great points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2269.246,
    "end": 2279.36,
    "text": " Matt Bolian- Again i'd highlight that we can model a baseball on a parabola as doing the most likely thing we could identify a radioactive isotope that's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.56,
    "end": 2293.819,
    "text": "Matt Bolian- probabilistically emitting things over a given time window as doing the most expected thing, so a lot can get brought into statistics, which does breed this whole fascinating area of like map territory type distinctions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2293.9,
    "end": 2304.69,
    "text": " So suffice to say, action is going to be totally integrated into this model, enabling a lot of interpretations as the recent literature witnesses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2305.031,
    "end": 2305.733,
    "text": "Lexi?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2306.506,
    "end": 2307.628,
    "text": " Thank you so much, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.668,
    "end": 2313.556,
    "text": "I was just thinking about what everyone said, but I think your word intentionality connected it for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.637,
    "end": 2316.881,
    "text": "And maybe the issue that I have, please forgive me, is lexical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.162,
    "end": 2321.268,
    "text": "So in my world, intentionality is required.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.969,
    "end": 2330.742,
    "text": "The sentence you said that rock's goal is to stay in place is an oxymoron in sort of psychology because you can only have a goal if you have a mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.11,
    "end": 2340.984,
    "text": " So in that regard, bacteria that moves toward the gradient of the food and withdraws from pain does not have a goal and a purpose because it ain't got a mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.664,
    "end": 2344.669,
    "text": "So that maybe is a different use of language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.689,
    "end": 2349.355,
    "text": "And if they use the word goal here in a sense that the rock's goal is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.335,
    "end": 2350.196,
    "text": " to stay in place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.216,
    "end": 2351.118,
    "text": "It's an attribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.238,
    "end": 2360.273,
    "text": "I would perhaps it's an unfortunate use of a term, but maybe we can say it's, you know, the rock's dynamic started to stay in place, but it doesn't have any goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.533,
    "end": 2361.495,
    "text": "You know, there's no mind there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.535,
    "end": 2362.316,
    "text": "There's no agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.877,
    "end": 2367.184,
    "text": "There's no agent capable of choosing A versus B in a rock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.304,
    "end": 2367.765,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.011,
    "end": 2370.714,
    "text": " I totally agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.994,
    "end": 2381.59,
    "text": "In a narrow and a broad sense, sometimes there's going to be gray area assignment, just like, well, this enzyme wants to bind to this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2382.672,
    "end": 2384.134,
    "text": "I've heard it a thousand times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.516,
    "end": 2390.904,
    "text": "But it's not intended as a reflexive statement about the protein being a strange loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.984,
    "end": 2394.289,
    "text": "Maybe it's below some level of critical ability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2394.991,
    "end": 2397.955,
    "text": "But we can model this all in an integrated fashion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2398.424,
    "end": 2405.793,
    "text": " So we can still model the game theory of something that we don't even think plays an implicit representational game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2406.634,
    "end": 2408.937,
    "text": "That's why there's this whole representationalist debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.778,
    "end": 2427.52,
    "text": "And then we can do all these kinds of modeling links really composably, which is kind of the exciting piece, which is also why the kernel, ultimately what we're working towards, like figure 4.3, these generative models, the kernels vary dramatically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2428.63,
    "end": 2451.347,
    "text": " it's it's not applicable to any given situation except a purely purely pedagogical and it's extremely sparse on commitments because it's basically of the same type as every other statistical model in Bayesian statistics so it's not like an esoteric type of model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2453.251,
    "end": 2461.626,
    "text": " But it opens many questions that I think again we see every day, which is really exciting and part of the fun, and and why many people can contribute in as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2462.989,
    "end": 2468.138,
    "text": "But there's just so many interesting angles to it, and I think also Sanjeev's textbook",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2468.54,
    "end": 2474.467,
    "text": " that is in progress with several of you here who may be in that group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2474.748,
    "end": 2490.107,
    "text": "There's a whole statistics degree slash undergraduate or beyond leading up to a lot of things that really help set the stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2491.408,
    "end": 2496.775,
    "text": "And his work, I think, will be for people who want to see that level of depth,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.856,
    "end": 2504.925,
    "text": " And then meanwhile, understanding what other fun paths and ways are there in this whole work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.945,
    "end": 2512.394,
    "text": "Because certainly it's always every sentence you could be like, what is happening?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.014,
    "end": 2526.61,
    "text": "And if this word meant that, and if this person was defining it this way, so certainly finding a path on through and like, what's the claim when a lot of it is internally referential?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2527.4,
    "end": 2547.568,
    "text": " um however that's part of its coherence and consistency and the but sometimes the evidence for the consistency is a little bit hard to convey because these are relatively recent understandings hopefully that's just like a little context",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2558.669,
    "end": 2561.414,
    "text": " What's it anything else have a thought or a question on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2562.676,
    "end": 2564.56,
    "text": "Chapter one Terry or than anyone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2566.703,
    "end": 2566.884,
    "text": "And.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.988,
    "end": 2581.47,
    "text": "yeah it's it's relevant this thing about that Iraq has no mind, but Iraq is you know, maybe over longer timescales to sustain itself as a rock, it has to a.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2583.104,
    "end": 2588.93,
    "text": " minimise its free energy in terms of its interactions with the external state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2588.95,
    "end": 2596.677,
    "text": "And whenever the variational free energy within that system alters, it will maybe oxidise or get broken up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2596.717,
    "end": 2608.209,
    "text": "It can't act in the world to maintain its variational free energy at a minimum, but it still has to maintain that variational free energy at a minimum.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2608.829,
    "end": 2612.453,
    "text": "And when it can't, it changes to something else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2612.433,
    "end": 2628.973,
    "text": " So the notion that all objects in the world sustain themselves in the state that they are currently in by",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2630.759,
    "end": 2638.096,
    "text": " Rupert Clayton- minimizing variation of free energy, whether you're a tree a human rock or a you know, a galaxy probably and.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2639.64,
    "end": 2645.173,
    "text": "Rupert Clayton- I what's your reaction to that because I know that we, you know the reference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2646.352,
    "end": 2652.483,
    "text": " like trees can't do things, but trees do communicate with each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2652.643,
    "end": 2668.11,
    "text": "And I suppose I was struck by this concept of panpsychism that exists within the sort of the thinkers in the nature of consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2668.911,
    "end": 2670.975,
    "text": "I'm just interested.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2670.955,
    "end": 2678.997,
    "text": " It's something that's stimulated by what Alexei said, and I'm interested in what you have to say about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2681.605,
    "end": 2681.725,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2682.633,
    "end": 2683.875,
    "text": " It's very, it's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2684.255,
    "end": 2701.157,
    "text": "I mean, it's certainly interesting areas you brought up and the way that there could be a kind of deflationary account where just it's pancognitivist or just pancomputationalist, but then people debate what's a computer and they say, well, it's pancognitivist, but then they debate what is cognition?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2701.798,
    "end": 2705.944,
    "text": "Is the baseball computing and is the water computing where it expects to be downhill?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.565,
    "end": 2712.252,
    "text": "So those are all the debates, but most of us, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2714.088,
    "end": 2737.665,
    "text": " see a world with dense but sparse connectivities so it sometimes it's like a lot of problem admiration which can be a good thing but um pointing to communication pathways amongst living things is only surprising in light of extremely recent specific scientific observations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2741.594,
    "end": 2743.2,
    "text": " So, but I'm not sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2743.221,
    "end": 2746.072,
    "text": "I mean, there's so many other areas you brought up in the consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.132,
    "end": 2749.687,
    "text": "And I mean, these are all the huge questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.53,
    "end": 2750.811,
    "text": "Ali?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2753.356,
    "end": 2769.759,
    "text": " Yeah, again, one of the other common misconceptions about FEP is that some people think FEP as providing kind of ontological conditions for existence or at least persistence through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2770.921,
    "end": 2775.027,
    "text": "But actually, what FEP claims is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2775.007,
    "end": 2785.657,
    "text": " If something exists, it must have properties that look as if they follow the path of least action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2786.678,
    "end": 2789.24,
    "text": "So it's the other way around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2789.761,
    "end": 2795.986,
    "text": "FEP doesn't provide any conditions for the existence or persistence through time at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2796.627,
    "end": 2803.393,
    "text": "But if we take the persistence or the existence,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2803.373,
    "end": 2821.45,
    "text": " as the basic premise of our argument, then we can follow that by describing the behavior of the phenomenon or the system by describing the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2821.548,
    "end": 2828.208,
    "text": " I mean trajectories of their variational density in terms of least action principle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2828.79,
    "end": 2833.684,
    "text": "So I think this is one of the things that people",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2833.951,
    "end": 2855.571,
    "text": " sometimes criticize FEP as something that, I mean, of course, it's claimed to be theory of everything, but it's not something as some ontological or metaphysical",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2855.551,
    "end": 2883.651,
    "text": " um theory for anything it just uh tries to describe I mean beginning from the ontological existence it tries to describe the ensuing characteristics of the systems that persist through time and in particular highly complex high dimensional self-organizing systems amazing points Ali thank you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2888.727,
    "end": 2917.755,
    "text": " the condition of modeling something is to have these properties every measurement that's that's if it's static it's it's up with its movement is within the measurement the classical limit if it's so dynamic it's moving faster than the time scale measurement you just get basically uninformative signal so we have this kind of tuned in bucky fuller zone of modeling proximal modeling which we can extend with microscopes uh telescopes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.735,
    "end": 2940.047,
    "text": " um that's one way to look at this that's a kind of like scientific realism approach but then for things that you can't or didn't model you have hidden states so ultimately you have it covered um but then this is really the the inversion of the um ontological theories of everything that this is how it really is this is how it is out there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2940.28,
    "end": 2944.164,
    "text": " This is how the metaphysics are that project our world a certain way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2944.224,
    "end": 2948.469,
    "text": "That is like why ontology is the philosophy of what is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.311,
    "end": 2957.038,
    "text": "However, if we precondition upon existence, someone will look at an ant and why did it go off the trail there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.078,
    "end": 2963.525,
    "text": "It's like, but you have the whole evolutionary history that sets up its decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.845,
    "end": 2968.11,
    "text": "So maybe the proposiveness of that, you might have a super deflationary response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2968.158,
    "end": 2988.816,
    "text": " But again, whatever level of sophistication the thing is from essentially inert or totally inert to repetitive motion to sophisticated motion, that can be understood by an observer as a path of least action as they do statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2989.657,
    "end": 2998.21,
    "text": " So in that sense, it licenses little more metaphysics than a linear regression as an analytic method.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3000.714,
    "end": 3013.133,
    "text": "Then I think, again, there's so many interesting angles why it has been discussed in all of these more philosophical contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3014.176,
    "end": 3017.5,
    "text": " because reductionism isn't the whole picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3017.54,
    "end": 3023.726,
    "text": "So the theory in itself or any given theory in itself might not take on all these accounts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3024.827,
    "end": 3034.498,
    "text": "And there may just be tangled webs of perspectives and different languaging and different applications around some of these topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3037.261,
    "end": 3044.048,
    "text": "But it is fun and fast when it's small and the few people's perspectives are essentially knowable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.382,
    "end": 3054.852,
    "text": " And there are always new information coming in literally through these funny modern channels and hearing what Maxwell and Carl at all think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.052,
    "end": 3055.353,
    "text": "Andrew?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3058.055,
    "end": 3068.626,
    "text": "Yeah, I just, just my two cents there is that, you know, I find the pan-cognitive stuff rather interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.726,
    "end": 3072.87,
    "text": "And that said, I personally came to active inference because I'm interested in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.424,
    "end": 3099.094,
    "text": " its application to living systems and especially human beings and so the brain from a neuroscience perspective but also how it might be applied in working with psychopathologies treatments and so on and so um i think so far i'm just viewing it in more pragmatic sense of like how can we use this in the same way that i also work as a data scientist and so i don't view everything as a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.344,
    "end": 3126.82,
    "text": " gradient boosting machine but i will attempt to apply a model to a situation to see if i can get anything useful out of it right so that's that's kind of how i've taken this so far i mean i've read some really fascinating papers you know one by a psychiatrist who applied active inference to post-traumatic stress disorder described hyper precise priors in the upper cortical regions is like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.289,
    "end": 3142.689,
    "text": " Justin Delacruz, You know, someone who experiences reliving the excuse me, they can be triggered by certain phenomena that kind of spark reactivate those those previous priors that gets superimposed on the incoming sensory observations, even though it's inaccurate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3144.432,
    "end": 3155.406,
    "text": "Justin Delacruz, So that's I mean i'm personally a little less concerned with the precision of ontological claims and so on, but but kind of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3156.128,
    "end": 3158.792,
    "text": " how this can help us to reinterpret different kinds of phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3159.513,
    "end": 3164.641,
    "text": "And from there, maybe use it for good, for some kind of useful purpose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.122,
    "end": 3167.105,
    "text": "It's really fascinating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3171.011,
    "end": 3171.392,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.672,
    "end": 3172.934,
    "text": "Thank you for sharing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3174.496,
    "end": 3174.737,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3176.48,
    "end": 3177.862,
    "text": "It is very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.025,
    "end": 3184.532,
    "text": "Anyone else want to just give a comment in the last minutes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3191.448,
    "end": 3197.079,
    "text": " Well, otherwise we will be going into chapter two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3197.119,
    "end": 3205.796,
    "text": "Chapter two is going to be another two weeks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.159,
    "end": 3211.988,
    "text": "We can look at the figure and look at the high road and low road again to kind of look ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.432,
    "end": 3223.297,
    "text": " David Price- low road and the high road chapter two and Chapter three that will be the coming month also some people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.598,
    "end": 3228.812,
    "text": "David Price- have asked about the math learning group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3230.243,
    "end": 3233.466,
    "text": " So I made a little comment thread.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3233.546,
    "end": 3239.713,
    "text": "If you just comment on this thread, then I think people who want to do a certain kind of work can maybe find each other this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3239.733,
    "end": 3244.017,
    "text": "And it can be in the Discord or a Jitsi link or however people prefer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3245.419,
    "end": 3259.373,
    "text": "And yeah, continue to check out and comment or improve if you want any of the AI math things as we head into chapter two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.825,
    "end": 3288.634,
    "text": " um explore which of these equations if you can evaluate which one of these ai explanations or make comments on them some are useful some are not so you know but i hope there's a lot of fun things we can do in the coming weeks chapter two is definitely going to get into it because it just starts the real non-introduction part of the book um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3290.926,
    "end": 3295.393,
    "text": " But yeah, does anyone have any other thoughts or questions or anyone who's read chapter two before?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3295.453,
    "end": 3298.338,
    "text": "Want to give a teaser?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3298.378,
    "end": 3308.614,
    "text": "Ali, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3311.497,
    "end": 3315.553,
    "text": " Well, yeah, actually, chapter two is where the real fun begins.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3315.573,
    "end": 3321.658,
    "text": "I mean, after the introductory chapter, now we're",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3322.297,
    "end": 3341.324,
    "text": " into the real thick of things by considering two of the most central equations of active inference, namely equations 2.5 and 2.6, one for variational free energy, the other for expected free energy, which we'll come to time and time again throughout the whole book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3342.206,
    "end": 3348.034,
    "text": "So it's probably one of the most fundamental important chapters",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3351.372,
    "end": 3352.054,
    "text": " Great comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3352.816,
    "end": 3353.9,
    "text": "Anyone else want to add anything?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.932,
    "end": 3358.193,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.299,
    "end": 3360.5,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.881,
    "end": 3361.362,
    "text": "Thank you all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3362.024,
    "end": 3362.606,
    "text": "See you around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3363.428,
    "end": 3363.649,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3365.394,
    "end": 3365.635,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  }
]