[
  {
    "start": 7.247,
    "end": 8.108,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.629,
    "end": 11.553,
    "text": "This is the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.813,
    "end": 15.217,
    "text": "It is guest stream number 15.2 on July 26, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.318,
    "end": 24.83,
    "text": "We're here with Bobby Azarian, and this is going to be the second part of a discussion that we opened some months ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.951,
    "end": 27.313,
    "text": " And looking forward to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.373,
    "end": 29.055,
    "text": "Really appreciate your visit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.495,
    "end": 33.159,
    "text": "And please just set it up and continue however you see fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.78,
    "end": 38.305,
    "text": "I'll be documenting questions in the live chat and looking forward a lot to this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.325,
    "end": 40.788,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.808,
    "end": 41.629,
    "text": "Thanks for having me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.248,
    "end": 47.03,
    "text": " So, the talk isn't quite what I promised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.47,
    "end": 48.691,
    "text": "It's not part two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.871,
    "end": 52.012,
    "text": "I'd like to come back in the future and talk about, you know, that stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.873,
    "end": 59.716,
    "text": "It's kind of what I talked about last time but a little bit more focused, more specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 60.136,
    "end": 67.42,
    "text": "There was a recent Guardian article that came out that was talking about whether there's this need for a new evolutionary synthesis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.254,
    "end": 82.341,
    "text": " We have the modern synthesis, and then the modern synthesis has been challenged by the extended evolutionary synthesis, which includes more mechanisms, things that weren't recognized by the modern synthesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.641,
    "end": 91.065,
    "text": "So things like epigenetics and Lamarckian mechanisms like the Baldwin effect, multi-level selection or group selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 91.926,
    "end": 95.788,
    "text": "So this is actually saying that that's not radical enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.334,
    "end": 109.024,
    "text": " the integrated evolutionary synthesis has that name because it integrates evolutionary theory with thermodynamics and information theory and it gives us",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.218,
    "end": 117.24,
    "text": " I think a much clearer picture of how evolution works and why it's generating complexity in the biosphere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.06,
    "end": 122.141,
    "text": "So originally this talk was also titled something different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 122.261,
    "end": 125.342,
    "text": "It said a unifying theory of reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.462,
    "end": 139.626,
    "text": "And yeah, it's been kind of downgraded to something a little less ambitious because I did not have time to include slides that talk about there's an interpretation of quantum mechanics called quantum Darwinism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.987,
    "end": 147.213,
    "text": " and a solution to the fine-tuning problem called cosmological natural selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.754,
    "end": 161.128,
    "text": "So what I'm trying to paint today is a picture of a Darwinian reality and those paradigms are consistent with this Darwinian framework, kind of a universal Darwinism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 161.829,
    "end": 186.253,
    "text": " type thing uh dand in it you know comes to mind um so this is just gonna focus on uh the evolution of the biosphere the evolution of life towards higher complexity and in the future we can talk about all that other stuff um awesome sounds good yeah um who would you say this is for and how would you like to update their cognitive model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 188.382,
    "end": 192.085,
    "text": " Yeah, so I love that you put it that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 192.105,
    "end": 195.627,
    "text": "Yeah, I hope I'm updating people's model of reality today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 196.148,
    "end": 204.134,
    "text": "So it's for the Active Inference Lab, so it's a bit more technical than it might be if I was giving it to a general audience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 204.914,
    "end": 209.538,
    "text": "But I tried to not get too technical at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 209.698,
    "end": 215.782,
    "text": "In my last talk, I really just talked about everything and used a lot of terminology that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 217.424,
    "end": 219.145,
    "text": " I assume that your audience would know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 219.166,
    "end": 224.111,
    "text": "Today, if anything's unclear or you want",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.237,
    "end": 248.579,
    "text": " uh me to go into a little bit more detail uh please feel free to ask jump in i'll try to pause um a few times throughout the presentation and see if anybody has any questions because it's really this story of evolution that's something that you know you can tell as a story um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.76,
    "end": 256.422,
    "text": " And I want people to understand the mechanisms better than giving the perfect presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.462,
    "end": 260.583,
    "text": "I just want people to see how all of these things work together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 262.063,
    "end": 266.824,
    "text": "So it's from my book that just came out a month ago, and that's available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.904,
    "end": 276.206,
    "text": "So if you like what you hear, this is basically a kind of superficial version of the content in part two of the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 276.987,
    "end": 277.647,
    "text": "There's three parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.878,
    "end": 287.926,
    "text": " There's this kind of famous quote from Dobzhansky, who did a lot of work creating the modern synthesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 288.567,
    "end": 290.468,
    "text": "And the modern synthesis is basically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 292.358,
    "end": 318.111,
    "text": " taking darwin's theory of natural selection and updating it with a modern understanding of genetics so it's not really modern anymore i mean this was like you know the gene was uh dna was discovered in the 50s and then in the 60s and 70s uh this was uh formulated so he said nothing in biology makes sense in except in the light of evolution",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 319.019,
    "end": 320.101,
    "text": " And I think it's a great statement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 320.201,
    "end": 320.982,
    "text": "I think it's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.783,
    "end": 333.842,
    "text": "But the integrated evolutionary synthesis says that doesn't go far enough, that nothing in biology or evolution makes sense except in light of thermodynamics and information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 334.818,
    "end": 339.259,
    "text": " And Shannon's information theory is really the same theory as statistical thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 339.279,
    "end": 341.38,
    "text": "There's a lot of the same formalisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.14,
    "end": 358.505,
    "text": "And we're going to see today that biological information, really the role of information is that it allows life to sustain itself against this tendency toward decay described by the second law of thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 359.865,
    "end": 369.191,
    "text": " And basically, there's just one evolutionary algorithm, one mechanism that is behind all of this complexity creation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.051,
    "end": 372.533,
    "text": "And that has been called variation and selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.854,
    "end": 381.679,
    "text": "That's a term from evolutionary epistemology, which is based on the ideas of Karl Popper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.759,
    "end": 384.661,
    "text": " But it actually wasn't founded by Karl Popper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.801,
    "end": 393.63,
    "text": "It was founded by a cognitive psychologist named Donald Campbell, who was inspired by Popper's view, and then Popper contributed to it later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 394.731,
    "end": 403.721,
    "text": "But the idea is that variation and selection, the mechanism of evolution, is a form of trial and error learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.798,
    "end": 409.1,
    "text": " So evolution adaptation is the same as learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.64,
    "end": 413.462,
    "text": "It's a learning mechanism and it creates biological knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.662,
    "end": 415.063,
    "text": "It creates knowledge in the biosphere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.084,
    "end": 425.248,
    "text": "And David Deutsch is one person who has written a lot about evolution as a knowledge creation process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 425.288,
    "end": 429.971,
    "text": "And I think that's how we need to understand it from now on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 429.991,
    "end": 434.473,
    "text": "And this is arguing that evolution does have an arrow or a direction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.686,
    "end": 436.908,
    "text": " It is progressive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 437.689,
    "end": 443.276,
    "text": "In other words, in the 20th century, Stephen Jay Gould was very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 445.842,
    "end": 450.103,
    "text": " adamant about killing this idea that evolution is progressive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.303,
    "end": 464.627,
    "text": "He saw it as being teleological, kind of implying that there's some mystical force driving evolution towards higher levels of complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 465.627,
    "end": 467.888,
    "text": "And I think that is wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 469.448,
    "end": 472.309,
    "text": "Evolution is progressive, but there's no mystical force driving it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.889,
    "end": 483.274,
    "text": " It is just mechanisms that are completely intelligible and formalizable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 484.275,
    "end": 489.417,
    "text": "And Richard Dawkins was one person who challenged Gould on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 489.517,
    "end": 500.903,
    "text": "He wrote a book review about Gould's book and basically said that this idea that evolution towards higher complexity was this statistical illusion was wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.806,
    "end": 516.515,
    "text": " evolutionary transitions as being a mechanism of complexity generation and we're going to talk about evolutionary transitions today, which is left out of the modern synthesis they don't talk about these transitions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 518.433,
    "end": 520.234,
    "text": " This quote is from Stuart Kaufman.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 520.354,
    "end": 522.615,
    "text": "He says, there are things Darwin couldn't have known.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 522.715,
    "end": 526.297,
    "text": "One of them was self-organization in complex dynamical systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 526.477,
    "end": 532.7,
    "text": "If the new science of complexity succeeds, it will broker a marriage between self-organization and selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.48,
    "end": 535.141,
    "text": "It'll be a physics of biology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 535.901,
    "end": 544.305,
    "text": "So that's part of what we're going to talk about today, how self-organization fits into the evolutionary picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.014,
    "end": 568.474,
    "text": " because it wasn't recognized by most evolutionary biologists for a long time and santa fe institute was one place really you know doing the complexity research that that has made you know this mechanism of self-organization uh kind of famous um it started off with uh the cyberneticist so ross ashby uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.123,
    "end": 574.206,
    "text": " had a principle of self-organization in, I think, the 40s or 50s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 574.946,
    "end": 585.774,
    "text": "So it's an old idea, and it's time that, I guess, mainstream evolutionary theory incorporates self-organization into the picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 586.334,
    "end": 593.339,
    "text": "And we'll see that self-organization is really the process that creates the evolutionary transitions that I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 598.123,
    "end": 604.231,
    "text": " So we're going to start off with some quotes just to give some context before getting into the details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 606.075,
    "end": 628.94,
    "text": " Thomas Huxley, a 19th century English biologist known as Darwin's Bulldog for his advocacy of evolutionary theory, said that the question of all questions for mankind, the problem which underlies all others is more deeply interesting than any other is the ascertainment and of the place which man occupies in nature and of his relations to the universe of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 629.2,
    "end": 631.64,
    "text": "So what's our relationship to the cosmos?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.34,
    "end": 633.081,
    "text": "Do we have one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.921,
    "end": 634.321,
    "text": "Is life...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 635.523,
    "end": 652.36,
    "text": " completely insignificant or could it have deep cosmic significance could it influence the future evolution and developmental trajectory of the universe so here's uh one answer to that question kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.796,
    "end": 669.548,
    "text": " pessimistic answer man at last knows that he is alone in the unfeeling immensity of the universe out of which he emerged only by chance so this quote comes from jacques mono uh noble prize winning french biochemist uh really smart guy uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 670.929,
    "end": 684.486,
    "text": " this book was really influential and kind of painted this nihilistic picture of reality that was consistent with the reductionist model of the world which was you know the reigning view in the 20th century and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 686.638,
    "end": 710.288,
    "text": " today we're going to challenge that idea uh christian deduve another nobel prize winning biologist uh said that the natural constraints within which chance operates are such that evolution in the direction of increasing complexity was virtually bound to take place if given the opportunity chance does not exclude inevitability so there's certain certainly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 711.522,
    "end": 739.58,
    "text": " chance and contingency and randomness operating in evolutionary processes you have genetic mutation which is at least partially a random blind process and that's okay that doesn't mean the whole thing is random so there's a lot of evidence from convergent evolution the work of simon conway morris that uh shows that uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.825,
    "end": 751.16,
    "text": " the certain you know designs organism designs are regularities so we see them uh emerge kind of expectedly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.463,
    "end": 770.414,
    "text": " So David Deutsch, founder of quantum computation and author of some great books, Fabric of Reality and his newer The Beginning of Infinity said, narrowly conceived evolutionary theory considers as mere vehicles for the replication of our genes or memes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.514,
    "end": 780.92,
    "text": "And it refuses to address the question of why evolution has tended to create ever greater adaptive complexity or the role that such complexity plays in the wider scheme of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 782.028,
    "end": 792.678,
    "text": " So you see, right here, he was hinting at life, which he calls adaptive complexity, as having this larger cosmic role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.779,
    "end": 797.403,
    "text": "And I think adaptive complexity is a great term for life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.086,
    "end": 816.961,
    "text": " uh kind of replacing the word life that would be a good idea because life has these mystical connotations so as soon as you say something like life is in some sense some statistical sense destined to spread through the universe it sounds mystical but when you say adaptive complexity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 818.122,
    "end": 838.107,
    "text": " uh will spread um you get a lot less uh groans because uh it makes it clear that what life is is this phenomenon that learns living systems are complex adaptive systems so adaptive complexity is just a way to talk about the network",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.607,
    "end": 842.069,
    "text": " of complex adaptive systems that make up the biosphere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.47,
    "end": 862.203,
    "text": "And once you learn that life is really this phenomenon that is continuously learning and self-correcting, then you see why it's so robust and why it seems like there is this inevitability to evolution and life getting off of its planet of origin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.666,
    "end": 865.711,
    "text": " So we're going to kind of demystify that process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.791,
    "end": 871.583,
    "text": "But in demystifying it, we see a natural process that is pretty mystical as far as just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 874.936,
    "end": 888.173,
    "text": " I think it doesn't make sense to use the term, to not say that there's not this kind of magical or mystical quality of the process just because we can understand it mechanistically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.814,
    "end": 892.799,
    "text": "To me, this paints a picture of nature that's more wondrous than...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 894.326,
    "end": 897.928,
    "text": " any sort of conception of nature that involves supernatural things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 898.008,
    "end": 907.293,
    "text": "I think the natural self-organizing process is as interesting as any supernatural concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.074,
    "end": 917.959,
    "text": "And then you see this really bold quote by the great physicist Freeman Dyson, who just passed away a year or two ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.32,
    "end": 921.261,
    "text": "It is conceivable that life may have a larger role to play",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.072,
    "end": 924.194,
    "text": " Sorry, I can't see the quote.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 924.775,
    "end": 930.263,
    "text": "Then we have yet imagined life may succeed against all odds in molding the universe to its own purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 932.557,
    "end": 936.1,
    "text": " So we're going to see if we can make an argument for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.78,
    "end": 945.107,
    "text": "Last quote, Paul Davies says, we now see how it is possible for the universe to increase both organization and entropy at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 945.707,
    "end": 948.969,
    "text": "The optimistic and pessimistic arrows of time can coexist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 949.009,
    "end": 954.273,
    "text": "The universe can display creative unidirectional progress even in the face of the second law.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 955.259,
    "end": 961.064,
    "text": " So nothing in this story in any way violates the second law of thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 963.186,
    "end": 976.236,
    "text": "And it's important that that's emphasized because a lot of people had this just superficial interpretation of the second law that the universe is growing increasingly disordered on average over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 977.097,
    "end": 981.06,
    "text": "And this presentation will say that that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 981.98,
    "end": 993.848,
    "text": " you know, popular understanding of the second law is wrong and that the universe is becoming more organized at the largest scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 994.148,
    "end": 994.488,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.589,
    "end": 997.83,
    "text": "Let's get into it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 997.87,
    "end": 1002.853,
    "text": "If anyone has any questions about that introduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.873,
    "end": 1005.295,
    "text": "Nope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.635,
    "end": 1006.055,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.095,
    "end": 1006.255,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.947,
    "end": 1022.53,
    "text": " The paradigm of emergence and cosmic evolution says each emergence in the cosmic self-organization process is brought together by a meta-system transition or an evolutionary transition that moves life further",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1023.271,
    "end": 1026.654,
    "text": " away from a state of thermodynamic equilibrium and total disorder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1026.734,
    "end": 1040.046,
    "text": "Through a nested series of such phase transitions where functional things come together to make larger functional things, which come together to make even larger ones, and so on, adaptive complexity becomes better equipped to dominate the cosmos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1040.667,
    "end": 1048.554,
    "text": "Life acquires an organization that is increasingly hierarchical and integrated, and therefore more resilient and computationally powerful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1049.71,
    "end": 1053.212,
    "text": " So this is what that process looks like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.552,
    "end": 1059.115,
    "text": "You see this structure of hierarchy and of matter, which continues with the hierarchy of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.162,
    "end": 1084.801,
    "text": " uh so we're gonna show how these new levels emerge and on the right here you see that uh there's this hierarchy of science that has tried to you know model this natural phenomenon phenomena and you get these levels uh that represent these different emergencies so with biology we have life",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1085.66,
    "end": 1092.571,
    "text": " Then we have the emergence of mind and we get psychology, and then we have the emergence of civilization and we get culture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1094.662,
    "end": 1117.285,
    "text": " so this framework says that and it's really the framework of evolutionary epistemology and universal darwinism it says that the emergence and evolution of life mind society and technology are all part of one thermodynamic process one evolutionary process one computational process unified by the concept of knowledge",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.36,
    "end": 1122.764,
    "text": " And it says that humans are neither a cosmic accident nor the end goal of evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1124.486,
    "end": 1132.053,
    "text": "Humans are a step on the evolutionary ladder of becoming and an essential driver of increasing complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.955,
    "end": 1142.243,
    "text": "And it says the universe is undergoing a grand and majestic self-organizing process and at this moment in time, in this corner of the universe, we are the stars of the show.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.806,
    "end": 1155.83,
    "text": " So this is what this process of cosmic evolution looks like this comes from a book called cosmic evolution by the Harvard astrophysicist Eric Jason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.85,
    "end": 1155.91,
    "text": "and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1160.55,
    "end": 1164.814,
    "text": " These are some unifying paradigms of the past and present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1164.994,
    "end": 1170.559,
    "text": "The integrated evolutionary synthesis is not really a novel thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1170.799,
    "end": 1177.364,
    "text": "It's sort of an update to all of these unifying paradigms that have come before it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.505,
    "end": 1181.988,
    "text": "General systems theory came out of cybernetics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1183.189,
    "end": 1187.413,
    "text": "It was founded by Ludwig von Bertalanffy and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.297,
    "end": 1194.527,
    "text": " basically says that all complex systems have similar organizing principles that can be described conceptually and modeled mathematically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.866,
    "end": 1201.21,
    "text": " The problem with this theory was that it was a little too broad and not specific enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1202.171,
    "end": 1213.6,
    "text": "Evolutionary epistemology came after that, and it emphasizes that the evolutionary process is a problem-solving procedure that creates knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.481,
    "end": 1224.689,
    "text": "So the growth of complexity and the emergence of intelligence in the biosphere arises out of a knowledge accumulation process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1226.346,
    "end": 1254.765,
    "text": " this view when i say knowledge accumulation uh this knowledge is encoded in uh the different forms of memory um that life allows for so genetic memory neural memory uh cultural memory and we'll talk about that more later um universal darwinism came after evolutionary epistemology was basically the same theory though um so richard dawkins and and are people that are associated with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1255.68,
    "end": 1262.763,
    "text": " universal Darwinism, and it emphasizes that the universe is evolving at all these different scales and levels of complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1263.784,
    "end": 1272.248,
    "text": "So universal Bayesianism is a term that some people are using, and it's just basically an update of the previous paradigms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1273.288,
    "end": 1283.313,
    "text": "So it basically says the same things that now evolution is knowledge creation process, but it specifically says that this knowledge is encoded in biological systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.393,
    "end": 1307.381,
    "text": " uh that knowledge is stored in the form of a world model and that the model is an internal representation and statistical mapping of the environment which gets updated through adaptation and learning and we're going to see that adaptation is a form of learning and that learning is a form of adaptation so to kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1308.527,
    "end": 1337.402,
    "text": " frame this story earlier i said it's you you can tell the story in a kind of like mythological way so david deutsch says if one can speak of a cosmic war it's a war between monotony and novelty between stasis and creativity and in this war our side is not destined to lose if we choose to apply our unique capacity to create explanatory knowledge we could win so it's a pretty uh optimistic uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.285,
    "end": 1343.568,
    "text": " and a story that I think is probably a lot",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.502,
    "end": 1354.928,
    "text": " more comforting, satisfying than the old view that the universe is becoming increasingly disordered and that life is just a transient phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.889,
    "end": 1360.612,
    "text": "We'll see that adaptive complexity isn't transient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1361.392,
    "end": 1370.778,
    "text": "So you could frame this as this battle between order and disorder or life versus entropy or knowledge versus ignorance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.915,
    "end": 1385.286,
    "text": " And so the story starts with the second law of thermodynamics, which is kind of a nice way to frame the evolutionary story since the second law of thermodynamics is this kind of ironclad law that everybody accepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1385.947,
    "end": 1390.41,
    "text": "So it's kind of built on a really firm theoretical foundation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1391.031,
    "end": 1395.235,
    "text": "So to understand life and its role in cosmic evolution, we have to understand the second law.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.755,
    "end": 1402.379,
    "text": " which says that the entropy of a system naturally increases over time, at least on average.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.22,
    "end": 1407.842,
    "text": "You could sum this up by the quote, things fall apart.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1408.563,
    "end": 1411.825,
    "text": "So it's describing this tendency toward decay and disorder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.625,
    "end": 1416.327,
    "text": "And we see that in this little simple cartoon below.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1416.608,
    "end": 1420.41,
    "text": "So in our everyday experience, things don't typically organize themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1420.51,
    "end": 1422.491,
    "text": "Rooms get messier and buildings erode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.131,
    "end": 1423.972,
    "text": "Not the opposite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1426.18,
    "end": 1440.835,
    "text": " Okay, so yeah, this is just a depiction of that same process, which was the model that the founder of the statistical interpretation of the second law used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1440.875,
    "end": 1443.137,
    "text": "So Ludwig Boltzmann...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.958,
    "end": 1464.064,
    "text": " imagined uh simple system so an ideal gas in a box and you see that if this system is just left to evolve over time uh the these molecules spread out simply because uh if they're just all moving at random",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1465.544,
    "end": 1476.448,
    "text": " then there are many more configurations that the system can be in that are disordered compared to patterned arrangements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1477.169,
    "end": 1485.772,
    "text": "So just due to this statistical tendency, you will get a system evolving toward a more disordered state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1486.949,
    "end": 1495.943,
    "text": " If it's a closed system and there's no way for the system to access any energy from the outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.963,
    "end": 1496.704,
    "text": "So this model...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.33,
    "end": 1503.932,
    "text": " is looking at a gas in a box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.212,
    "end": 1517.666,
    "text": "It's not looking at the universe, but people were quick to jump, uh, to apply this to the universe as a whole, um, under the assumption that the universe is a closed system, uh, but it ignores a lot of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.726,
    "end": 1523.272,
    "text": "So this model ignored the effect of gravity, um, because gravity doesn't really have, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.333,
    "end": 1542.229,
    "text": " uh a noticeable effect on things that small so it was just seen as negligible and it also assumes that these particles stay uncorrelated after they interact and um we know that with you know certain chemical systems in life the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.234,
    "end": 1547.536,
    "text": " The molecules are held together by chemical bonds and forces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1548.617,
    "end": 1557.902,
    "text": "So this model ignores a lot of things which make it probably not very useful to apply to the universe as a whole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.703,
    "end": 1563.505,
    "text": "And it leaves out this phenomenon of life that we've called adaptive complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1566.427,
    "end": 1567.167,
    "text": "So if...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1569.221,
    "end": 1573.302,
    "text": " systems naturally become more disordered than what's going on with life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1573.602,
    "end": 1586.144,
    "text": "We see life maintaining its structure and has the capability of regenerating itself and making copies of itself and producing all of this order that we see around us in the biosphere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.585,
    "end": 1593.206,
    "text": "And so adaptive complexity is this local reversal of the second law.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.68,
    "end": 1604.783,
    "text": " And Schrodinger was one of the first people to really talk about this mystery and give us one piece of the puzzle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.883,
    "end": 1616.646,
    "text": "So life is able to evade this tendency towards disorder because it is an open system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.666,
    "end": 1619.987,
    "text": "The planet is receiving energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.532,
    "end": 1624.034,
    "text": " all of this free energy from the sun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.915,
    "end": 1633.32,
    "text": "And that energy allows an adaptive system to stay far from thermodynamic equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1635.066,
    "end": 1645.172,
    "text": " The trick to life evading the tendency toward decay is that it has the ability to extract energy that allows it to do work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.313,
    "end": 1652.296,
    "text": "That work is maintaining its stable, non-equilibrium, steady state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.316,
    "end": 1654.457,
    "text": "You can think of life as...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.841,
    "end": 1660.522,
    "text": " playing a game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.962,
    "end": 1666.627,
    "text": "So the game of life is this battle between order and disorder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1666.788,
    "end": 1679.359,
    "text": "So the challenge that life has that any system, any adaptive system, any conceivable sentient system in any universe abiding by the second law",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.267,
    "end": 1688.933,
    "text": " has this intrinsic problem, and that's it has to be able to resist the natural tendency toward disorder, which requires work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1689.753,
    "end": 1694.016,
    "text": "So this intrinsic challenge gives life an intrinsic goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.997,
    "end": 1706.024,
    "text": "So life does have a goal, and the goal is simply to continue to persist, to stay far from thermodynamic equilibrium, or to survive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1707.445,
    "end": 1707.645,
    "text": "Now,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.965,
    "end": 1734.636,
    "text": " what must life do in order to achieve that goal it has to be able to extract the energy from the environment and that's not a trivial task in order to be able to navigate its environment and actually extract or absorb this energy it has to acquire information about the environment that it's in it has to model the world and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1736.451,
    "end": 1743.635,
    "text": " Life strategy is to search the space of possible configurations for structural and functional solutions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.255,
    "end": 1747.837,
    "text": "We call those adaptations to the problem of survival.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1750.298,
    "end": 1755.741,
    "text": "And so evolution is this process of life exploring the design space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.761,
    "end": 1762.444,
    "text": "And Dennett made this way of looking at it popular in his book, Darwin's Dangerous Idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1763.94,
    "end": 1768.305,
    "text": " On an abstract level, we can imagine a certain practical problem or challenge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1769.346,
    "end": 1772.609,
    "text": "Any challenge...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1776.738,
    "end": 1784.928,
    "text": " We can imagine a challenge as having a solution that exists somewhere out there in the space of possibilities, just waiting to be found by adaptive complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.988,
    "end": 1794.339,
    "text": "So it may take some time, but if the possibility space, the space of possible solutions is continuously explored in an efficient way, eventually a solution will be discovered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1795.06,
    "end": 1801.785,
    "text": " So Darwinian evolution is a problem-solving algorithm, and that algorithm is called variation and selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1801.805,
    "end": 1804.227,
    "text": "Yeah, this slide was old.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1804.407,
    "end": 1805.247,
    "text": "I meant to update that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1805.287,
    "end": 1813.854,
    "text": "So this is supposed to show that variation and selection is the method of adaptation, and that this is a trial and error learning process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.914,
    "end": 1816.375,
    "text": "So trial and error is the mechanism for learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1816.896,
    "end": 1817.936,
    "text": "Those are the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1818.817,
    "end": 1829.364,
    "text": " So adaptation is equivalent to problem solving, is equivalent to learning, is equivalent to knowledge creation, and we're going to see an illustration of that to make it a lot clearer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1831.946,
    "end": 1837.99,
    "text": "So this is an evolutionary epistemology-inspired picture that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1839.534,
    "end": 1842.115,
    "text": " David Deutsch supports.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1842.395,
    "end": 1848.098,
    "text": "He says that the whole scientific process resembles biological evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1849.139,
    "end": 1856.202,
    "text": "A problem is like an ecological niche, and a theory is like a gene or a species which is being tested for viability in that niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.567,
    "end": 1866.11,
    "text": " The way we should think about organisms now is that they are embodied theories about how to survive in a particular niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1867.851,
    "end": 1871.953,
    "text": "So a genome is basically a strategy for survival.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1876.61,
    "end": 1899.884,
    "text": " okay so this picture looks complicated at first but it's pretty simple once you break it down so here on the left we see you know one of the most simple organisms we have a single-celled organism and this says that an adaptive system is an embodied theory about how to stay far from equilibrium",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1901.045,
    "end": 1906.107,
    "text": " And that basically it's searching for a winning design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.907,
    "end": 1912.329,
    "text": "So a winning design is specifically one that allows for energy extraction from the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.589,
    "end": 1919.751,
    "text": "So now we're just really understanding life as having to solve a thermodynamic problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.191,
    "end": 1926.273,
    "text": "It has to find free energy to maintain its non-equilibrium steady state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1927.689,
    "end": 1934.872,
    "text": " And it does this without any consciousness or conscious intent at first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.992,
    "end": 1940.834,
    "text": "So let's imagine that this is the origin of life that we start with this one organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.199,
    "end": 1945.121,
    "text": " It's a replicator, so it makes copies of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1945.682,
    "end": 1952.768,
    "text": "And because genetic mutation is unavoidable, the copying process will always make errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1953.388,
    "end": 1961.215,
    "text": "Then you get a generation of new designs that are variations on the original design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.236,
    "end": 1972.304,
    "text": " So here you see design one, two, three, and four, and you can have as many designs as copies that this organism can make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.225,
    "end": 1981.632,
    "text": "So just through replication with mutation, you get this variation in selection mechanism that will create learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.713,
    "end": 1988.517,
    "text": "So natural selection is a filter and natural selection",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1989.71,
    "end": 1998.909,
    "text": " filters out the dysfunctional designs so we see that uh and you could imagine that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.107,
    "end": 2006.591,
    "text": " So bacterium, some bacteria perform a process known as chemotaxis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2006.851,
    "end": 2011.534,
    "text": "So they will swim towards molecular food and away from toxins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2012.335,
    "end": 2025.623,
    "text": "So they have some sort of very basic abstract world model of the environment, some statistical mapping that allows the system to basically swim towards food and away from threats.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2026.904,
    "end": 2034.348,
    "text": " And you can imagine that this first one, maybe it swims in random directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2034.408,
    "end": 2037.05,
    "text": "It doesn't swim towards food yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.19,
    "end": 2039.071,
    "text": "It just moves around randomly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2039.171,
    "end": 2041.272,
    "text": "So it makes a copy of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2041.312,
    "end": 2045.995,
    "text": "Let's say that copy still has that same behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2046.695,
    "end": 2048.936,
    "text": "And then you have another copy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.497,
    "end": 2054.98,
    "text": "Let's say this one, because of random mutation, swims toward poisons and away from food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.432,
    "end": 2067.966,
    "text": " And this third one, just by chance, has a better design, a more optimal design where it swims towards food and away from toxins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.667,
    "end": 2069.508,
    "text": "And you can imagine...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2070.81,
    "end": 2075.292,
    "text": " However, many types of different designs with different functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.172,
    "end": 2083.875,
    "text": "And so some of these designs will die out because they can't fulfill this task of extracting energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.436,
    "end": 2086.517,
    "text": "So they can't stay far from equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2087.477,
    "end": 2092.399,
    "text": "They get filtered out and this winning design gets to make copies of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2095.788,
    "end": 2102.029,
    "text": " This winning design is the one that can best predict its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2103.59,
    "end": 2111.111,
    "text": "It's the one that's best at extracting energy because it has the ability to predict its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2111.631,
    "end": 2117.732,
    "text": "This process continues with a second iteration and it creates this new generation of designs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2121.972,
    "end": 2144.344,
    "text": " again some of these designs will be dysfunctional or at least not optimal and especially if they're competing uh the uh dysfunctional ones will die out so natural selection acts as a filter again and again we have another generation so this iterative process is how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2146.223,
    "end": 2168.882,
    "text": " basically the species design gets optimized and it is also a knowledge creation process because this organism has a genetic code that codes for these functional designs or dysfunctional designs and random mutation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.682,
    "end": 2172.684,
    "text": " is creating random bits of code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.164,
    "end": 2180.267,
    "text": "It's creating random changes, and some of that code will produce functional designs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.127,
    "end": 2187.731,
    "text": "So, while it's producing all this information, some of it is information that's not predictive of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.831,
    "end": 2188.931,
    "text": "It's useless information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.531,
    "end": 2196.715,
    "text": "The information that survives the filter of natural selection has proved itself to be knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2197.628,
    "end": 2211.472,
    "text": " And the reason I call the information in these systems that survive knowledge is because they contain information that reduces the organism's uncertainty regarding the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2213.493,
    "end": 2215.394,
    "text": "So you can look at this whole process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.685,
    "end": 2236.603,
    "text": " as basically a world model, and there's variations being created to this embodied internal model, and that with these iterations, the model is getting updated to be more accurate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2238.802,
    "end": 2256.746,
    "text": " I'm not going to go into active inference and the free energy principle and the Bayesian brain hypothesis here, but I will mention some things for people who already are familiar with it, since this is the active inference channel, that this whole process would be minimizing free energy or prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2256.926,
    "end": 2259.587,
    "text": "As adaptation occurs and you have these different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.529,
    "end": 2265.374,
    "text": " generations, the model is getting updated in a Bayesian fashion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.774,
    "end": 2275.565,
    "text": "And John Campbell has done work showing that the evolutionary process is a process of learning and specifically Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2275.905,
    "end": 2278.768,
    "text": "And Carl Friston has worked with him on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.488,
    "end": 2288.291,
    "text": " So I'm calling this knowledge, the information that encodes these structures, knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.131,
    "end": 2291.152,
    "text": "And that comes from evolutionary epistemology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2291.852,
    "end": 2293.373,
    "text": "So what do I mean by that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.033,
    "end": 2301.315,
    "text": "So a dolphin's streamlined design, which is a product of the information stored in its genome, contains a knowledge of hydrodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2302.236,
    "end": 2307.398,
    "text": "And similarly, an eagle's wing design contains a knowledge of aerodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2308.243,
    "end": 2318.309,
    "text": " So not only can we be certain that engineers see knowledge in these functional structures, there should be little doubt that these designs provided the original inspiration for our aircraft and submarine technology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2319.369,
    "end": 2327.554,
    "text": "So yeah, you can think of evolution as a knowledge creation process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2328.434,
    "end": 2337.519,
    "text": "And you can think about all of the species that exist as being solutions to different types of problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.799,
    "end": 2359.172,
    "text": " environmental challenges and so humans scientists studying these species can learn a lot about how to better manipulate the universe and better solve our challenges by looking at how evolution has solved challenges in the past so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2360.694,
    "end": 2371.143,
    "text": " This process of adaptation that's creating this knowledge is also creating statistical correlation between the organism and its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2372.544,
    "end": 2379.049,
    "text": "And when you understand this, you see that natural selection is something like an information channel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2380.2,
    "end": 2384.302,
    "text": " you could think of as pumping in information from the environment into life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.623,
    "end": 2387.224,
    "text": "Life models its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2387.664,
    "end": 2390.065,
    "text": "It's isomorphic to its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.365,
    "end": 2400.45,
    "text": "So an organism is a model of its environment in the way that a key is a model of the lock it opens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.471,
    "end": 2405.793,
    "text": "So as this process that we see here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2407.809,
    "end": 2416.618,
    "text": " takes place and you have these different iterations of the adaptation process, it's becoming more correlated with its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.339,
    "end": 2425.768,
    "text": "So we talked about these different designs and being different types of bacteria, some that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.949,
    "end": 2431.71,
    "text": " swim towards poisons and some that swim away and towards food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2431.73,
    "end": 2441.672,
    "text": "This is the work of physicist Carlo Rovelli, who is now interested in evolution and how evolution creates information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2443.192,
    "end": 2448.494,
    "text": "His work builds on the work of David Wolpert and Artem Kolchinsky at the Santa Fe Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2450.774,
    "end": 2464.826,
    "text": " Just to explain this concept of adaptation, creating statistical correlation and mutual information, and this is really what underlies its ability to predict its environment, we have this simple example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2465.486,
    "end": 2470.41,
    "text": "So a well-adapted organism is one that is statistically correlated with its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2471.091,
    "end": 2476.355,
    "text": "So a bacterium that swims to the left when nutrients are on the left and swims to the right when nutrients are on the right prospers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2476.896,
    "end": 2479.498,
    "text": "A bacterium that swims at random has less chances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.856,
    "end": 2489.862,
    "text": " So increasing statistical correlation represents the creation of mutual information, and that comes from Shannon's information theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.722,
    "end": 2493.404,
    "text": "So basically, when...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.598,
    "end": 2496.838,
    "text": " you have this correlation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.439,
    "end": 2504.8,
    "text": "Basically, the information in these organisms is predictive of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.201,
    "end": 2514.883,
    "text": "And this quote from Fred Dretzky, who did a lot of the pioneering work applying information theory to natural selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.724,
    "end": 2521.825,
    "text": "This is from the biologist John Maynard Smith's essay on biological information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.376,
    "end": 2524.797,
    "text": " Dretzky argues as follows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.837,
    "end": 2536.744,
    "text": "If some variable A is correlated with the second variable B, then we can say that B carries information about A. For example, if the occurrence of rain is correlated with a particular cloud, then the type of cloud tells us whether it would rain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.426,
    "end": 2548.832,
    "text": "So we see here that adaptation equals statistical correlation, equals mutual information, equals model optimization, equals knowledge creation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.295,
    "end": 2558.756,
    "text": " Let me just skip some of this stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.536,
    "end": 2578.963,
    "text": "So we see how knowledge is created in this example and species are becoming optimized for extracting energy in their niche, but they're not becoming more complex per se.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2579.243,
    "end": 2583.145,
    "text": "So since an organism...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.389,
    "end": 2588.452,
    "text": " is an embodied theory about how to extract energy from the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2588.872,
    "end": 2591.574,
    "text": "It kind of follows Occam's razor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2591.694,
    "end": 2596.898,
    "text": "So it's really trying to be the simplest solution to a thermodynamic problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2597.955,
    "end": 2611.079,
    "text": " So at the beginning of this talk, I said that this was going to explain mechanisms of complexity generation and this tendency towards higher intelligence that we've seen in our biosphere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2612.279,
    "end": 2621.802,
    "text": "But it's not the case that natural selection is making every species more complex or more intelligent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2621.902,
    "end": 2623.583,
    "text": "And Stephen Jay Gould was right about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.683,
    "end": 2634.232,
    "text": " Uh, if a organism is extracting energy and avoiding threats, just fine in its niche, um, it doesn't need to become more complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.773,
    "end": 2639.697,
    "text": "So crocodiles and sharks are common examples of, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.598,
    "end": 2666.258,
    "text": " organisms that haven't become more complex over millions of years of evolution and there are examples like cave fish that um fish that you know weren't previously existing in caves uh got trapped in caves or some sort of underground environment where having eyes was no longer a selective advantage you saw those organisms actually become more simple",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.589,
    "end": 2682.395,
    "text": " So if evolution isn't making organisms more complex and more intelligent, or certain species, then how do we argue that intelligence is inevitable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2682.695,
    "end": 2683.395,
    "text": "How does that work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2684.075,
    "end": 2688.377,
    "text": "So it's not that evolution makes every species more complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.577,
    "end": 2694.6,
    "text": "It's that evolution will create new species, and there will be this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2695.76,
    "end": 2713.992,
    "text": " growing ladder of complexity such that the new species that emerge have to solve more complicated energy extraction problems and that is uh basically what ratchets up complexity so we're going to talk about that now this tendency towards intelligence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2716.365,
    "end": 2732.871,
    "text": " So we can think of each niche on Earth as a sort of energy slot, a thermodynamic slot for a given species, and an evolving population of organisms efficiently searching the space will discover a solution to a thermodynamic problem that it didn't know existed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2733.511,
    "end": 2741.714,
    "text": "So the discovery of a novel energy source or energy extraction technique is both how a new niche and a new species come into existence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2743.402,
    "end": 2766.706,
    "text": " So this Darwinian evolution process, which is also called phylogenetic learning, this iterative learning process, it's generational learning, will naturally lead to speciation because organisms will stumble upon ways to exploit thermodynamic niches that were previously inaccessible to life purely for design reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.666,
    "end": 2770.927,
    "text": "So let's look at that picture one more time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2772.964,
    "end": 2779.246,
    "text": " So when this organism self-replicates, it's making these different designs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.647,
    "end": 2784.728,
    "text": "Some of them will be better at extracting that source of energy for the first organisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.808,
    "end": 2793.852,
    "text": "It was thought to be the geochemical energy that was around these hydrothermal vents, these deep sea volcanoes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2795.459,
    "end": 2808.502,
    "text": " And you could imagine just by chance that it creates a copy of itself and that it discovers a configuration that can suddenly absorb sunlight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2809.642,
    "end": 2813.463,
    "text": "So that's how we get the generation of photosynthetic bacteria.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2814.344,
    "end": 2819.665,
    "text": "And when you get this new source of energy unlocked,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2820.498,
    "end": 2825.141,
    "text": " then that is basically what creates a new species.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.162,
    "end": 2833.848,
    "text": "And then you don't just have this one species exploring this solution space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2834.488,
    "end": 2837.39,
    "text": "You have a growing problem space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2837.45,
    "end": 2845.756,
    "text": "So you will have organisms discovering new sources of energy that weren't available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2845.856,
    "end": 2849.019,
    "text": "So basically, if life is something like a game and it's trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.247,
    "end": 2862.811,
    "text": " you know, find these configurations that are best at predicting the environment, it'll kind of just by chance, you know, discover that there's like a different aspect of the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2862.871,
    "end": 2871.254,
    "text": "So it will unlock a new source of free energy, which creates a new species and a new niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2876.349,
    "end": 2901.283,
    "text": " okay so just to make that idea a little more clear um there's a great paper called the energy expansions of evolution by olivia judson and she says the history of the life earth system can be divided into five energetic epochs each featuring the evolution of life forms that can exploit a new source of energy these sources are geochemical energy sunlight oxygen flesh and fire",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2902.008,
    "end": 2908.05,
    "text": " The first two are present at the start, but oxygen, flesh, and fire are all consequences of evolutionary events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.59,
    "end": 2923.335,
    "text": "Since no category of energy source has disappeared, this has, over time, resulted in an expanding realm of the sources of energy available to living systems and a concomitant increase in the diversity and complexity of ecosystems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2925.154,
    "end": 2927.955,
    "text": " So why do increasingly intelligent species emerge?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.475,
    "end": 2952.426,
    "text": "So first we have these organisms around the hydrothermal vents I mentioned, reductive chemoautotrophs, their solutions to the problem of how to extract energy from geochemical gradients, photosynthetic bacteria, the single-celled ancestors of plants are a solution to the problem of how to extract work from all the solar energy that was flowing through the planetary system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.425,
    "end": 2962.162,
    "text": " and heterotrophic organisms, then emerge, which are organisms that eat other organisms, and their solution to the problem of how to extract energy from life itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.684,
    "end": 2980.73,
    "text": " And this explains how intelligence emerges because once life starts having to model life, other agents with causal power and adaptive behavior, the computational task of extracting free energy gets increasingly difficult as increasingly complex species arise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2981.41,
    "end": 2988.392,
    "text": "By virtue of having to model each other, the complexity of some species gets ratcheted up by what's known as an evolutionary arms race.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.177,
    "end": 3001.667,
    "text": " So here I'll mention this law from cybernetics created by Ross Ashby called the law of requisite variety and applied to evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.687,
    "end": 3014.097,
    "text": "It basically says that an adaptive system must have as many states like cognitive states, behavioral states, as there are challenges in its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.248,
    "end": 3042.604,
    "text": " And so when you have this process of new species emerging that basically discover configurations that allows them to extract a new source of energy or eat a new source of energy, you get this pressure towards or this tendency towards species that have a larger repertoire of cognitive states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.008,
    "end": 3045.832,
    "text": " And so they can deal with more challenges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.654,
    "end": 3049.962,
    "text": "And so this increases an agent's empowerment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.883,
    "end": 3053.965,
    "text": " That's a term from the computational neuroscience literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3054.906,
    "end": 3060.749,
    "text": "Harvard AI researcher Alex Wisner-Gross has this concept of a causal entropic force.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.269,
    "end": 3072.116,
    "text": "But basically, we can see that the biosphere as a whole is increasing its repertoire of internal states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3073.036,
    "end": 3076.118,
    "text": "And the most complex species is also...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3078.019,
    "end": 3082.984,
    "text": " possessing a repertoire of larger internal states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.425,
    "end": 3088.89,
    "text": "And this is one explanation for this tendency towards higher intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3092.674,
    "end": 3101.862,
    "text": "So just to reiterate those points once more, why has the evolutionary record shown a trend of the emergence of increasingly complex forms?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3102.981,
    "end": 3106.944,
    "text": " When all conceivable niches on the earth were filled, that wasn't the end for complexification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3107.464,
    "end": 3111.908,
    "text": "New species create new niches because the free energy slot they provide is themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.468,
    "end": 3128.841,
    "text": "So they become food for any sort of other organism that through blind variation and natural selection discovers a configuration that allows them to exploit that new source of food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3129.932,
    "end": 3143.58,
    "text": " So the cyberneticist Francis Heiligen said it is well documented by evolutionary biologists that ecosystems tend to become more complex, the number of different species increases, and the number of dependencies and other linkages between species increases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3144.721,
    "end": 3144.881,
    "text": "E.O.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3144.901,
    "end": 3154.567,
    "text": "Wilson said not only do ecosystems contain typically lots of niches that will eventually be filled by new species, there is a self-reinforcing tendency to create new niches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3157.527,
    "end": 3177.382,
    "text": " And Stu Kaufman actually has shown this parallel between niche emergence and the autocatalytic process that we see with basically the precursor to life was this chemical autocatalytic set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3179.784,
    "end": 3193.031,
    "text": " Stu Kaufman says, ecosystems are auto-catalytically closed, self-sustaining reaction networks that reliably drive up biological diversity and complexity as they self-amplify and evolve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3196.03,
    "end": 3210.395,
    "text": " Okay, so that tells us how we get species of increasing intelligence, but it doesn't answer everything about how that happens because it isn't telling us how you go from single-celled organisms to multicellular organisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.256,
    "end": 3218.018,
    "text": "And it's not addressing the complexity that we see with these collectives, with society.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.078,
    "end": 3222.019,
    "text": "So how do we go from multicellular organisms to these larger societies?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3222.9,
    "end": 3223.0,
    "text": "And...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3224.028,
    "end": 3246.558,
    "text": " We've seen that because of the internet, that human societies have become integrated into this larger computational network that some have called a global brain, because humans are basically nodes exchanging information in the same way that neuronal populations or neurons are exchanging information in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.019,
    "end": 3251.481,
    "text": "So we need to talk about more than normal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3253.497,
    "end": 3263.904,
    "text": " Darwinian evolution, competitive evolution, and we need to include self-organization in this model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.724,
    "end": 3279.154,
    "text": "So before I start talking about self-organization, and that will kind of be the second half of this, and it's a bit shorter, any questions about any of the mechanisms that have been presented so far?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3281.055,
    "end": 3283.016,
    "text": " Yeah, there's definitely a few questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.136,
    "end": 3284.737,
    "text": "Would you like me to ask them now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.937,
    "end": 3290.901,
    "text": "Or do you think it makes more sense to just present everything you'd like to get out and then we can have just a full Q&A?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.782,
    "end": 3301.987,
    "text": "If the questions are like broad questions that aren't specifically asking about like the mechanisms that were just described, then we could wait.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3302.107,
    "end": 3305.789,
    "text": "But if it's about this stuff, maybe it'd be good to talk about now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.707,
    "end": 3312.175,
    "text": " Let's go through the whole presentation, and then I'll have compiled questions by then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.235,
    "end": 3312.595,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.777,
    "end": 3314.078,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3315.66,
    "end": 3315.88,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3317.302,
    "end": 3322.49,
    "text": "All right, so this is that same thing that we were looking at earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.5,
    "end": 3326.443,
    "text": " It was an older version, looks a bit different, all these arrows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.523,
    "end": 3335.35,
    "text": "But yeah, this is showing the same process, this phylogenetic learning process that happens through competitive evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3335.41,
    "end": 3338.813,
    "text": "So this is normal Darwinian evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3339.374,
    "end": 3351.204,
    "text": "But you see here at the bottom, this part at the bottom right, is showing that these organisms down here, these different designs, they don't have to compete.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3352.145,
    "end": 3353.326,
    "text": " They can cooperate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3353.607,
    "end": 3359.273,
    "text": "They can find synergistic collective configuration and form a larger unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3360.454,
    "end": 3367.382,
    "text": "And so this is the process of self-organization right here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.463,
    "end": 3372.627,
    "text": "And basically that creates a new level of complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3373.689,
    "end": 3393.448,
    "text": " So if you think of life as a game, and it's this game where life's exploring the design space, looking for configurations that solve its thermodynamic problem of staying far from equilibrium, this process of self-organization is how life graduates to a new level in the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3394.716,
    "end": 3396.237,
    "text": " So you don't always have to compete.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3396.317,
    "end": 3397.218,
    "text": "You can cooperate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3398.398,
    "end": 3410.066,
    "text": "And we're going to talk about self-organization as a Darwinian process, this marriage of self-organization and selection that Stu Kaufman talked about in that quote at the beginning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3411.807,
    "end": 3420.112,
    "text": "So Richard Dawkins says, Darwin's survival of the fittest is really a special case of a more general law of survival of the stable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3421.124,
    "end": 3428.79,
    "text": " And this concept of evolution being about survival of the stable will allow us to understand how self-organization is a Darwinian process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.491,
    "end": 3438.538,
    "text": "And by a Darwinian process, I mean that it works through the evolutionary algorithm that we've called variation and selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3442.301,
    "end": 3449.586,
    "text": "So here you see that the self-organization process up top",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3450.435,
    "end": 3458.337,
    "text": " there's just a couple examples of collectives of higher level systems that are made of many units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.417,
    "end": 3465.599,
    "text": "So it can be a collection of molecules forming something like an autocatalytic set, or it can be a collection of agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3466.099,
    "end": 3467.459,
    "text": "It can be people in a society.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3468.36,
    "end": 3469.02,
    "text": "But basically,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3470.461,
    "end": 3472.243,
    "text": " This is the evolutionary process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3472.563,
    "end": 3483.715,
    "text": "It works through variation and selection because to have variation on a design or a structure, you don't need replication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3483.735,
    "end": 3486.078,
    "text": "You don't need a system that's making copies of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.178,
    "end": 3490.923,
    "text": "That makes the process more efficient in ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3491.744,
    "end": 3499.091,
    "text": " But you can have a single system that's exploring a variety of internal configurations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.332,
    "end": 3509.441,
    "text": "And so you see this flowchart here where it says, system blindly explores various configurations in the space of possible designs via trial and error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3509.981,
    "end": 3512.404,
    "text": "So it's just being pushed by a flow of energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3513.304,
    "end": 3516.527,
    "text": "With humans, we're powered by metabolism, so metabolism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3518.65,
    "end": 3531.93,
    "text": " It's still a flow of energy pushing us technically, and it's basically causing the system to randomly explore different states in the configuration space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3533.726,
    "end": 3546.553,
    "text": " Now those configurations that it discovers that allows the system to extract sufficient energy to stay out of equilibrium are the ones that get retained, and the system is able to persist for longer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3547.473,
    "end": 3552.796,
    "text": "So it's the same variation and selection mechanism, but here, since there's only one system,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.932,
    "end": 3566.276,
    "text": " Donald Campbell, the inventor of evolutionary epistemology, being influenced by the cybernetesis, called this blind variation and selective retention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3567.536,
    "end": 3572.238,
    "text": "So the stable states are selectively retained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3572.858,
    "end": 3582.502,
    "text": "So those states that the system moves into that does not allow the system to persist are filtered out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3583.482,
    "end": 3591.568,
    "text": " So really, you can explain evolution with this simple kind of tautological phrase, what works persists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3592.188,
    "end": 3605.037,
    "text": "And that Dawkins simplification of Darwin's law as really being about the survival of the stable shows us why this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3605.99,
    "end": 3608.431,
    "text": " integrated evolutionary synthesis is important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3609.051,
    "end": 3613.653,
    "text": "We can see the second law's tendency toward disorder as being a selection pressure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3614.253,
    "end": 3617.434,
    "text": "It's the second law that filters out the unstable designs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.355,
    "end": 3620.896,
    "text": "And they're not just filtering out the unstable designs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3621.776,
    "end": 3627.878,
    "text": "It's specifically filtering out designs that are less functional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3628.179,
    "end": 3631.54,
    "text": "So the stable designs, because of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3632.957,
    "end": 3654.932,
    "text": " this thermodynamic constraint that systems must be able to extract energy to maintain their order, it is really discovering the most functional designs, the designs that are best at predicting the environment and the designs that are most robust and most functional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3656.973,
    "end": 3661.917,
    "text": "So this process explains the origin of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3662.739,
    "end": 3664.84,
    "text": " So you have all these interacting components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3665.02,
    "end": 3670.663,
    "text": "These are molecules, the molecules that are involved in organic chemistry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.483,
    "end": 3679.547,
    "text": "And Jeremy England, who did this work when he was at MIT, named this process dissipative adaptation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3680.388,
    "end": 3691.213,
    "text": "So he was showing how basically a flow of energy pushing a system of molecules far from thermodynamic equilibrium will lead to this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3694.13,
    "end": 3711.993,
    "text": " increasingly ordered state because the system is exploring configurations and finding those information, getting stuck basically in the configurations that allow the system to extract and dissipate more energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.548,
    "end": 3726.931,
    "text": " So the book discusses this principle of recursive self-organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3727.432,
    "end": 3741.978,
    "text": "The name is inspired by Ross Ashby's principle of self-organization, but this is basically explaining why interacting agents will consistently link up to form stable wholes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3743.402,
    "end": 3750.026,
    "text": " And that's because working together allows the individual systems to extract more energy with less work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3750.767,
    "end": 3753.909,
    "text": "So there's this effect that has been called synergy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3754.71,
    "end": 3760.934,
    "text": "So nature promotes cooperation because it's thermodynamically beneficial for all parties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3761.074,
    "end": 3773.102,
    "text": "And for that reason, synergistic collective configurations will eventually be discovered by a many component system that's exploring various states or configurations through the blind variation and selective retention mechanism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3774.002,
    "end": 3778.886,
    "text": " So agents will compete until they discover that working together makes everyone's task easier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3779.887,
    "end": 3791.274,
    "text": "And this is a lesson for humanity because the challenges, the sustainability challenges, which is an entropy problem, can only be solved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3791.715,
    "end": 3796.378,
    "text": "These global sustainability challenges can only be solved if we work together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3798.564,
    "end": 3822.767,
    "text": " working together increases the computational power of the system so um it's it's self-organization i guess i think was kind of ignored by evolutionary biologists for a long time because they they didn't want to recognize anything that sounded like a teleological mechanism like something like kind of mystical and it was like how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3824.012,
    "end": 3825.474,
    "text": " There's the second law of thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3825.754,
    "end": 3828.037,
    "text": "How can there be spontaneous self-organization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3828.658,
    "end": 3830.961,
    "text": "Well, the answer was it's not exactly spontaneous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3831.081,
    "end": 3840.892,
    "text": "It requires energy flowing through the system, pushing the system far from equilibrium and forcing it to explore the configuration space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3841.573,
    "end": 3857.037,
    "text": " And that's how we see that it's a Darwinian process, that it explores these different configurations and the configurations that are most functional are the ones that survive and pass the filter of natural selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3857.918,
    "end": 3869.821,
    "text": "So here's just an illustration showing that self-organization is something that can happen at all of these levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3871.175,
    "end": 3875.657,
    "text": " So complex adaptive systems are nested systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3875.757,
    "end": 3879.798,
    "text": "They're systems made of smaller systems that are interacting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3881.779,
    "end": 3885.861,
    "text": "And they build on one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3886.081,
    "end": 3894.064,
    "text": "So you have single-celled organisms coming together to form this multicellular unit, like a slime mold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3896.403,
    "end": 3918.291,
    "text": " humans are multicellular organisms that come together and make societies uh you have ant colonies here which do the same and so these form a collective unit that function very much like the units that they're made of so you see that adaptive systems can exist in all these levels",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3919.524,
    "end": 3926.068,
    "text": " And these adaptive systems have similar dynamics and work through these same variation and selection mechanisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3926.688,
    "end": 3933.052,
    "text": "And that's how they evolve toward increasing robustness and complexity and computational power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.052,
    "end": 3938.775,
    "text": "Jeffrey West's book, Scale, is a great book about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3941.336,
    "end": 3947.8,
    "text": "So this principle of recursive self-organization says that as long as a biosphere is creating a growing variety of complex adaptive systems,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3949.383,
    "end": 3956.611,
    "text": " Some of those systems will interact to produce higher level complex adaptive systems, which will come together to form even larger complexes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3957.432,
    "end": 3962.337,
    "text": "This process continues at higher and more computationally sophisticated levels as time marches on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3962.357,
    "end": 3969.584,
    "text": "Familiar examples of superorganisms include ant colonies, termite mounds, human societies, and the ecosystems that make up the biosphere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3970.86,
    "end": 3979.168,
    "text": " And all of these distributed networks process information and fight to maintain their organization in ways that are surprisingly similar to the organisms they're made of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3980.669,
    "end": 3988.916,
    "text": "So it tells us that knowledge of the dynamics and mechanisms at one level can be informative of isomorphic phenomena at other levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3989.877,
    "end": 3995.823,
    "text": "So it's kind of interesting here because you see that this theory has predictive power that no reductionist model has.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3996.889,
    "end": 4016.655,
    "text": " This reductionist model where it's trying to look, trying to understand reality and predict reality by looking at this most base level, such as the interactions of basic particles and forces, don't give us this predictive power that this paradigm does because it basically says that we can use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4017.555,
    "end": 4043.381,
    "text": " adaptive systems we can look at those patterns at one level and then we can use that to understand things that might not be easy to see at another level so for example um and this we saw that paper with stew kaufman saying that ecosystems were auto catalytic sets setting auto catalytic sets can tell us about ecosystem dynamics and vice versa",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4044.68,
    "end": 4049.742,
    "text": " Studying human brains can tell us about the emerging global brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4050.903,
    "end": 4056.065,
    "text": "So this is something that I won't go into here, maybe in the next talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4057.245,
    "end": 4062.648,
    "text": "But there's this question of if there is a global brain, is a global mind emerging?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4063.339,
    "end": 4065.961,
    "text": " Could the global mind even be like a conscious mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4067.301,
    "end": 4089.395,
    "text": "And I think that something at this paradigm, some sort of predictive power that it has would say that for that mind to emerge, the system might have to duplicate the dynamics that you see underlying conscious brain states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4089.955,
    "end": 4092.057,
    "text": " So not all brain states are conscious states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4092.097,
    "end": 4102.229,
    "text": "When you go to sleep before you enter a dream, there are periods where consciousness ceases to be, but the brain state is still functioning physiologically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4102.309,
    "end": 4103.27,
    "text": "It's keeping you alive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4104.767,
    "end": 4120.416,
    "text": " So to understand how a global mind emerges from a global brain, we would we probably want to look at how we probably want to look at like human brains and looking at this transition between unconscious to conscious states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4121.536,
    "end": 4123.558,
    "text": "And every level has novelty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4124.538,
    "end": 4126.761,
    "text": " And so they're not going to be exactly the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4127.922,
    "end": 4129.304,
    "text": "New properties will emerge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4129.364,
    "end": 4143.259,
    "text": "So it's not certain that these predictions will tell you everything about the higher level that hasn't emerged, but it will give you a sort of outline of the dynamics that could be really useful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4145.942,
    "end": 4155.669,
    "text": " So this process of recursive self-organization creates this hierarchical emergence that we saw at the beginning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4156.409,
    "end": 4157.95,
    "text": "Now we see exactly why it happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4158.09,
    "end": 4159.311,
    "text": "These things come together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4160.452,
    "end": 4170.579,
    "text": "These units come together to make larger units because cooperating makes the thermodynamic task of staying far from equilibrium easier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4172.004,
    "end": 4182.452,
    "text": " And you get the emergence of new properties as these higher levels emerge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4184.234,
    "end": 4198.345,
    "text": "And so with brains, which is left out of this, but with the emergence of brains, you have a system that can encode the causal consequences of its actions in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4199.734,
    "end": 4204.337,
    "text": " And that allows the system to create a variable for itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4204.558,
    "end": 4211.843,
    "text": "Before brains, an organism that does something like interacts with the environment, there's no synaptic plasticity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4211.883,
    "end": 4217.687,
    "text": "There's no mechanism for creating a memory of the effects on that environment in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4218.801,
    "end": 4228.945,
    "text": " And so what brains allow is the system to encode the consequences of its actions, which gives it an understanding of itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4229.185,
    "end": 4231.806,
    "text": "It's really the beginning of self-modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4232.806,
    "end": 4246.952,
    "text": "And so something that's in addition to this concept of intelligence being about like the size of the repertoire of mental states, which is increased by this niche emergence process that we discussed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.711,
    "end": 4256.921,
    "text": " You also need to think about these levels of awareness that come from self-reference in the form of self-modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4258.062,
    "end": 4263.608,
    "text": "So that would be for another talk where we talk about how does consciousness emerge from this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4265.896,
    "end": 4280.91,
    "text": " But yeah, I just wanted to point out that these levels of awareness are another important factor of the emergence and growth of intelligence that we can't leave out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4282.611,
    "end": 4284.954,
    "text": "And it's an emergent property.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4285.154,
    "end": 4290.098,
    "text": "So this process of multi-level self-organization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4292.495,
    "end": 4299.898,
    "text": " and recursive emergence is creating more complex structures, these hierarchical adaptive systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4300.578,
    "end": 4310.001,
    "text": "And these systems are, these evolutionary transitions are also revolutions in information storage and processing machinery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4311.041,
    "end": 4321.085,
    "text": "So we start out with genetic material and then brains emerge and we have neural memory that sits on top of the genetic memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4322.391,
    "end": 4327.427,
    "text": " And then we have collective form and then we get cultural memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.618,
    "end": 4333.123,
    "text": " So memory that's shared among all of the brains of the individuals in the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4333.803,
    "end": 4342.172,
    "text": "And then we get things like books and journals, and then eventually technological memory, digital memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4342.912,
    "end": 4352.162,
    "text": "So you can see that this process is a process of knowledge accumulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4353.049,
    "end": 4362.207,
    "text": " and that the biosphere and technology, the technosphere, you could call it, this is all one continuous process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4363.297,
    "end": 4375.706,
    "text": " I didn't talk about it here, but one of the big insights of Karl Popper's evolutionary epistemology was that science and adaptive learning all work through this variation and selection mechanism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4376.347,
    "end": 4381.151,
    "text": "So it's called trial and error learning in the developmental psychology literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4382.211,
    "end": 4385.794,
    "text": "And you can understand science as evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4387.372,
    "end": 4412.013,
    "text": " competing theories uh that that works through like this darwinian process and the mechanism he used the name for that was called conjecture and refutation but it's it's all trial and error learning it's all variation and selection you have these different models and then these models get tested and natural selection weeds out the models that aren't predictive of the environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4414.62,
    "end": 4420.475,
    "text": " so what does the integrated evolutionary synthesis show us this theory of knowledge creation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.59,
    "end": 4423.731,
    "text": " It shows us that knowledge is power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4425.591,
    "end": 4430.813,
    "text": "So this UTOR was just an acronym for Unifying Theory of Reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4432.033,
    "end": 4436.935,
    "text": "Shows us that knowledge is power is not just a hollow buzz phrase from the digital age.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4437.495,
    "end": 4439.076,
    "text": "It's true in the most fundamental way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4439.656,
    "end": 4444.818,
    "text": "Uncertainty reducing information is life's first and last weapon in the ongoing war with disorder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4445.378,
    "end": 4448.319,
    "text": "And it infuses organic matter with control and causal power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4449.119,
    "end": 4454.222,
    "text": " Without knowledge, life cannot exist for more than a moment, much less colonize the galaxy and beyond.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4455.163,
    "end": 4466.691,
    "text": "This suggests that setting out on the path toward cosmic superiority is not a choice that intelligent agents like Homo sapiens make upon careful reflection, nor is it just some quirky ambition we stumbled onto by chance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4467.371,
    "end": 4471.474,
    "text": "Humanity's collective desire to transcend mortality and expand outward into space is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4472.094,
    "end": 4492.254,
    "text": " so apparent from our current scientific and technological endeavors emerges not incidentally but as an inevitable consequence of the fact that continual knowledge acquisition is a fundamental biological imperative so the sun is our source of energy it's what allows us to stay far from equilibrium",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4493.619,
    "end": 4508.842,
    "text": " intelligent species that are modeling the world with increasing sophistication will realize that there's this thermodynamic game clock that if life is to persist in the long term, it has to leave the planet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4509.342,
    "end": 4514.323,
    "text": "SpaceX isn't Elon Musk's creative idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4514.383,
    "end": 4522.085,
    "text": "This is an imperative that any sufficiently intelligent species will recognize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4523.36,
    "end": 4532.764,
    "text": " And this has hopefully shown how natural selection is an information channel that pumps information from the inanimate world into life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4533.905,
    "end": 4536.466,
    "text": "And through that process, nature begins modeling itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4536.686,
    "end": 4544.709,
    "text": "So matter starts finding a configuration that allows it to model the world around it that it's part of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4545.63,
    "end": 4547.35,
    "text": "So it's encoding its own structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4547.891,
    "end": 4550.992,
    "text": "Reality is encoding its own structure and the universe begins to wake up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4552.714,
    "end": 4560.478,
    "text": " So some of the other wording was, you know, life ascending to this cosmic superiority and being able to dominate the cosmos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4560.598,
    "end": 4575.807,
    "text": "But you can similarly look at this whole story, not as a battle between life and entropy and order and disorder, but that those things are complementary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4575.827,
    "end": 4579.749,
    "text": "So they sort of need each other and they work together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4581.269,
    "end": 4587.852,
    "text": " And so it's not the case that life is dominating the cosmos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4588.192,
    "end": 4593.135,
    "text": "It's that the universe itself is self-organizing through this process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4594.795,
    "end": 4603.299,
    "text": "And that basically life and agents are these kind of sensory modalities for the universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4603.94,
    "end": 4607.241,
    "text": "I think it's appropriate to look at it that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4607.261,
    "end": 4608.302,
    "text": "I don't think there's anything...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4609.244,
    "end": 4609.724,
    "text": " wrong with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4611.004,
    "end": 4616.846,
    "text": "So here's a quote from Harold Morowitz, who was a founding member of the Santa Fe Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4617.886,
    "end": 4622.547,
    "text": "He was a professor of mine, and it was a big inspiration on the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4623.328,
    "end": 4631.51,
    "text": "He says, we start with observations, and if the evolving cosmos has an observed direction, rejecting that view is clearly non-empirical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4632.73,
    "end": 4636.771,
    "text": "There need not necessarily be a knowable endpoint, but there may be an arrow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4638.046,
    "end": 4647.528,
    "text": " And so Christoph Koch, one of the world's most respected neuroscientists, wrote, The rise of sentient life within time's wide circuit was inevitable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4647.828,
    "end": 4656.49,
    "text": "Teilhard de Chardin is correct in his view that islands within the universe, if not the whole cosmos, are evolving toward ever greater complexity and self-knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4657.191,
    "end": 4659.071,
    "text": "The universe is a work in progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4659.311,
    "end": 4662.832,
    "text": "The evidence from cosmology, biology, and history is compelling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4664.192,
    "end": 4681.406,
    "text": " though we're seeing a kind of change in sentiment, and it's been brewing for a long time, but that this idea, this paradigm of the universe being self-organizing and becoming increasingly complex is completely scientific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4681.767,
    "end": 4686.01,
    "text": "And I think given what we know, it is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4688.277,
    "end": 4689.558,
    "text": " It has predictive power too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4689.618,
    "end": 4693.32,
    "text": "We can understand, we can predict things about future emergencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4693.4,
    "end": 4700.045,
    "text": "So I would like to see this paradigm of emergence replace the reductionist paradigm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4704.107,
    "end": 4705.088,
    "text": " Where is this taking us?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4705.328,
    "end": 4713.177,
    "text": "So this is a kind of far out speculation, but I think, you know, given the story told so far, it's OK to go here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4713.678,
    "end": 4719.745,
    "text": "Paul Davies, super respected theoretical physicist, says many scientists have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4720.846,
    "end": 4722.107,
    "text": "Sorry, I can't see that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4722.227,
    "end": 4722.488,
    "text": "Whoops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4726.752,
    "end": 4728.594,
    "text": " There was stuff over the text.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.855,
    "end": 4742.165,
    "text": "Many scientists have speculated that as the timeline stretches toward infinity, so an emerging superintelligence will become more and more godlike so that in the final stage, the mind will emerge with the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4747.978,
    "end": 4748.458,
    "text": " Sorry about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4749.019,
    "end": 4751.82,
    "text": "That's kind of anticlimactic for me to mess up here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4752.48,
    "end": 4755.762,
    "text": "So that in the final stage, the super mind will merge with the universe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4755.922,
    "end": 4757.643,
    "text": "Mind and cosmos will be one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4758.104,
    "end": 4776.334,
    "text": "He goes on, then the whole character of the universe, including the emergence of its laws and the nature of its states become inextricably intertwined with its mentality, with its mindfulness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4777.735,
    "end": 4780.756,
    "text": " And so what would that look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4780.836,
    "end": 4793.402,
    "text": "This is from Ray Kurzweil's The Singularity is Near, where it shows this trajectory where life creates technology and it merges with technology and you get the universe waking up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4794.642,
    "end": 4795.482,
    "text": "What about heat death?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4797.703,
    "end": 4803.646,
    "text": "Does this process happen and then fade out because the universe is going towards thermodynamic equilibrium?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.605,
    "end": 4810.63,
    "text": " Well, people like Stu Kaufman and David Deutsch have challenged the heat death scenario.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4811.731,
    "end": 4826.744,
    "text": "More and more physicists are with different alternative models, but some of these models basically say that the expanding universe allows for continual free energy supply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4828.712,
    "end": 4831.257,
    "text": " I will get into that in another talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4832.719,
    "end": 4834.843,
    "text": "But yeah, so where is this heading?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4836.406,
    "end": 4837.368,
    "text": "Maybe something like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4837.448,
    "end": 4839.031,
    "text": "Maybe something like a cosmic mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4839.592,
    "end": 4840.293,
    "text": "Can't rule that out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4842.234,
    "end": 4844.976,
    "text": " And yeah, this comes from that book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4846.196,
    "end": 4850.579,
    "text": "The almighty Carl Friston was nice enough to give me a blurb for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4851.299,
    "end": 4863.385,
    "text": "If you email the Romance of Reality, if you buy it from Amazon or wherever and send me a screenshot of the receipt with your address, I'll send you a signed and numbered book plate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4863.425,
    "end": 4865.847,
    "text": "It's like a sticker that goes inside the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4867.648,
    "end": 4870.329,
    "text": "And yeah, thank you so much for having me again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4872.185,
    "end": 4872.466,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.066,
    "end": 4874.088,
    "text": "Thank you very much, Bobby.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.212,
    "end": 4877.593,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.374,
    "end": 4881.739,
    "text": "Let's take a deep breath and then to the question and answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.759,
    "end": 4883.101,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.862,
    "end": 4884.163,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.204,
    "end": 4885.485,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.556,
    "end": 4888.896,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.717,
    "end": 4889.937,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.957,
    "end": 4891.298,
    "text": "A lot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4891.598,
    "end": 4898.283,
    "text": "So I'm just going to ask some questions that were asked in the live chat during the stream and also just some other ones I wrote down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.303,
    "end": 4899.523,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4900.604,
    "end": 4904.347,
    "text": "So I'd like to start with one of the first parts of the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.707,
    "end": 4910.371,
    "text": "You read the Dubjansky quote, nothing in biology makes sense except in the light of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.791,
    "end": 4912.832,
    "text": "So famous and memeable quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.573,
    "end": 4913.733,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.853,
    "end": 4915.975,
    "text": "My question was, what else...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.875,
    "end": 4939.021,
    "text": " is necessary and or sufficient for sense making in biology like is evolution the only light or what what are the lights that help us bring light to those issues so first part is about what else is necessary or sufficient and the second part is how should we move forward knowing um what is necessary to make light of evolution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4941.946,
    "end": 4949.789,
    "text": " Well, I guess it depends on how you define evolution, because some people might be defining evolution very narrowly in terms of like the modern synthesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4949.869,
    "end": 4952.29,
    "text": "And someone might say, we need to understand self-organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4952.83,
    "end": 4954.271,
    "text": "We need to understand emergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4954.831,
    "end": 4961.413,
    "text": "But with this framework, all of those things are included under the umbrella of evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4962.094,
    "end": 4970.557,
    "text": "So I'd say that you need evolution to understand the generation of complexity and intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4971.736,
    "end": 4985.707,
    "text": " Um, but you need these, you know, it needs to be expanded to include these ideas, uh, about, um, multi-level emergence and, uh, this process where you have like self modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4985.747,
    "end": 4986.948,
    "text": "So we need to understand like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4987.807,
    "end": 4990.349,
    "text": " how self-reference fits into this picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4990.869,
    "end": 5004.76,
    "text": "Brains allow self-modeling and first you have the emergence of consciousness, which in this definition, I would be talking about subjective awareness, not necessarily like self-awareness or self-conscious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5006.071,
    "end": 5008.972,
    "text": " So self-awareness would be a higher level of self-reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5013.614,
    "end": 5029.42,
    "text": "To explain all of this stuff, the evolutionary model would have to be this model of cosmic evolution where you talk about adaptation through Darwinian competitive evolution, but you also have this cooperative evolution",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5030.612,
    "end": 5041.559,
    "text": " with self-organization, creating these new emergencies and these emergencies bringing about new properties, new causal powers, and higher levels of awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5042.64,
    "end": 5049.344,
    "text": "But, you know, it's, I don't want to be, it's like reductionistic to be like, is it all evolution?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5049.584,
    "end": 5051.765,
    "text": "So I think it's important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5051.785,
    "end": 5053.246,
    "text": "There are a lot of trends today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5053.286,
    "end": 5056.929,
    "text": "You're seeing like Whitehead's process ontology coming back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5057.902,
    "end": 5065.085,
    "text": " and this understanding of systems as processes rather than things, I think that's enlightening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5068.787,
    "end": 5077.37,
    "text": "I think that we need to talk about philosophy and metaphysics even.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5078.451,
    "end": 5085.894,
    "text": "For example, and I talked about this in my last talk, but we need to think about is hard determinism true or is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5087.532,
    "end": 5105.268,
    "text": " reality a little bit more complex, where reality fundamentally has this probabilistic element at the lowest level, but then these higher-level systems emerge with these deterministic trajectories, and you get...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5108.703,
    "end": 5125.327,
    "text": " Yeah, so because the model, the hard determinism model that comes kind of from this Laplacian model of reality, this idea that there's just particles following these trajectories, it has metaphysical and philosophical implications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5125.387,
    "end": 5130.368,
    "text": "Like we have no agency, that there's just one future and it's completely determined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5130.388,
    "end": 5133.729,
    "text": "And if we had a powerful enough computer, we could even predict that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5134.249,
    "end": 5135.449,
    "text": "Turns out that that's wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5137.271,
    "end": 5162.772,
    "text": " and uh this new model uh allows for true agency and it allows for um organisms that emerge that have something like free will and that term opens up a different bag of worms um that's like something you know i'd like to talk about that in the next presentation but when i say free will i'm talking about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5164.315,
    "end": 5191.192,
    "text": " biological agency and the fact that organisms making decisions um we're not just particles following trajectories we're actually cybernetic control units um that have emerged through these evolutionary processes that i explain this time um basically those processes that are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5192.593,
    "end": 5205.099,
    "text": " pumping information into the system, that information gives agents causal power such that you will see systems behave very differently than inanimate systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.52,
    "end": 5209.622,
    "text": "So an inanimate system like a rock only moves if it's pushed by a force.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.402,
    "end": 5221.588,
    "text": " But living systems, because they metabolize and store energy, they have self-generated motion and they're not predictable with classical mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5222.248,
    "end": 5228.731,
    "text": "You have to have some sort of higher level theory like Friston's Bayesian brain hypothesis, the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5229.452,
    "end": 5233.454,
    "text": "So it's not that organisms aren't predictable at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5234.314,
    "end": 5235.115,
    "text": "You can actually...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5236.115,
    "end": 5243.356,
    "text": " predict what they will do based on saying, for example, that they're going to behave in a way that minimizes their model's prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5244.622,
    "end": 5251.567,
    "text": " And that's very different than trying to calculate what the system's going to do based on microphysics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5251.927,
    "end": 5252.988,
    "text": "First of all, you can't do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5253.088,
    "end": 5269.599,
    "text": "Second of all, I'm saying that that idea is misguided to begin with because this process where natural selection pumps information into these adaptive systems creates systems that have what...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5270.399,
    "end": 5274.382,
    "text": " people like Sarah Walker and Paul Davies have called informational control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5275.043,
    "end": 5280.928,
    "text": "So it creates these cybernetic systems which use feedback mechanisms to stay far from equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5281.008,
    "end": 5286.493,
    "text": "And we can't understand causality without understanding the role that information plays in biology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5286.513,
    "end": 5287.894,
    "text": "So, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5291.098,
    "end": 5306.959,
    "text": " evolution can explain a lot, but it requires us to talk about thermodynamics and information and really what information allows systems to do is to continue to persist in the world against this tendency towards decay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5308.996,
    "end": 5322.532,
    "text": " okay I've noted it down I have uh causal powers free will agency the role of information evolution energy thermodynamics for the part three so let's um leave a little footnote there um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.815,
    "end": 5343.801,
    "text": " I wanted to add a few kind of resonances that I saw with Active Inference, like places where there was a nice plug-in or like a saddle point between the way that you framed it just in this nice presentation and in some of the ways that people are modeling in Active Inference today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5344.681,
    "end": 5349.183,
    "text": "So you provided a Dawkins quote with survival of the stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.363,
    "end": 5375.266,
    "text": " and that is kind of like a operational definition for the related claim survival of the fittest and people sometimes say well that's circular and survival of the stable almost says like it steps into that circularity it's like yes in fact it is that way and that's what our operational definition is repeated measurements",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5376.295,
    "end": 5379.459,
    "text": " is going to be what a thing is over a given time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.839,
    "end": 5390.59,
    "text": "So there might be some spatial or temporal scale where a gradient or a boundary or a blanket does exist, but that's gonna be like an observer and a relational,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5391.451,
    "end": 5411.722,
    "text": " specific situation rather than like an all or none question about what kinds of things and processes exist so um just want to give that one and then i have a few more but what do you what do you think about that like where does this survival of the stable come in and how do you think that's different than how sometimes people have framed evolution and ecology in the past",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.447,
    "end": 5429.772,
    "text": " So yeah, there is this criticism of the survival of the fittest being this kind of tautological hollow statement because what survives is what's fit, but what's fit and you define it as what survives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5430.012,
    "end": 5431.453,
    "text": "So you're not really getting to the bottom of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5432.133,
    "end": 5442.136,
    "text": "But that's one thing that's one of the, I guess, highlights of this integrated synthesis is we get an answer to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5443.276,
    "end": 5448.358,
    "text": " And you're right saying what's stable, you know, it actually like kind of embraces that thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5448.418,
    "end": 5458.861,
    "text": "Like what, what works persist or what's stable persists kind of has that same problem, but the thermodynamic perspective gives it a specific answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5458.941,
    "end": 5463.062,
    "text": "It says what is stable is what's able to extract energy from the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5463.722,
    "end": 5465.122,
    "text": "So it's what's functional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5465.702,
    "end": 5470.324,
    "text": "So we finally have an answer to like what fitness is that isn't tautological.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5470.484,
    "end": 5470.604,
    "text": "It's,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5471.846,
    "end": 5487.898,
    "text": " It's a system's ability to extract energy to stay far from equilibrium, but also avoid threats because if something kills you, it's going to rupture the Markov blanket and you are going to collapse to equilibrium.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5488.058,
    "end": 5488.839,
    "text": "You're going to die.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5489.419,
    "end": 5500.688,
    "text": "So yeah, the answer to what fitness is, is this ability to evade thermodynamic decay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5505.276,
    "end": 5522.181,
    "text": " okay thank you let me go to the next one of these resonances because again i really liked how it was laid out and i guess how many paths we walked around some core points you mentioned learning and adaptation and seeing those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5523.101,
    "end": 5525.825,
    "text": " in a new light, like on part of a new continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5526.205,
    "end": 5537.459,
    "text": "And so that's a lot like an active inference, how there's similarity in how perception is modeled and in how slower and even slower processes of learning and memory happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.24,
    "end": 5540.663,
    "text": "And all of that is framed as a type of parameter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5541.872,
    "end": 5558.485,
    "text": " finding whether that's what organisms are doing which is realism that's one perspective or whether it's just a way that we can model organisms that's another perspective instrumentalism so like when the perception of the ball crossing the visual field is happening is that perception of the location",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5559.471,
    "end": 5563.174,
    "text": " especially if we think from this generative approach, like the Bayesian brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5563.954,
    "end": 5564.635,
    "text": "Is it perception?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5564.695,
    "end": 5564.975,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.295,
    "end": 5569.919,
    "text": "Is it learning the parameter, like in a technical sense, like machine learning of a parameter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.999,
    "end": 5572.561,
    "text": "Is it learning the parameter representing the location?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.061,
    "end": 5573.561,
    "text": "Also, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.861,
    "end": 5577.344,
    "text": "So there's kind of a connection between learning and adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.085,
    "end": 5586.711,
    "text": "And because data and observations coming in through the blanket are sometimes like sparse, conflated,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5588.129,
    "end": 5601.748,
    "text": " related through causal mechanisms that aren't directly observed all these challenges with them evolution shapes systems ability for their for their sense making with the statistical regularities of the niche",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5602.642,
    "end": 5624.187,
    "text": " And that's been something that has been approached from people outside of the free energy principle, active inference, just from different angles, for example, like collective behavior with the work of Deborah Gordon and thinking about how collective behavior evolves to be fitting statistical regularities of different niches, like for ant colonies, like you mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.828,
    "end": 5629.609,
    "text": "And then also on the other hand, this imperative to be fitting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5630.589,
    "end": 5654.565,
    "text": " literally the statistical regularities of the niche leads directly to the embedded and the inactive all the four e's etc and then the kind of piece that ties that all together is you talked about the need to extract free energy like in a chemical sense in a dissipative situation you need to extract chemical free energy liberatable work from the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5655.245,
    "end": 5671.354,
    "text": " and then in order to navigate the uncertainty at higher and higher levels more and more planning has to come into play and then that is like modeled with variational free energy in active inference which isn't exactly like that liberatable biochemical energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5672.054,
    "end": 5681.883,
    "text": " But it seems to be, and people interpret it differently, but they overlap in certain situations because the systems that are planning well are planning well to extract energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5682.404,
    "end": 5686.888,
    "text": "The systems that are not planning well are not succeeding at extracting effective energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5687.188,
    "end": 5690.792,
    "text": "So there is a relationship, even though those variables are not formally the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.917,
    "end": 5692.297,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5692.597,
    "end": 5692.978,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5693.098,
    "end": 5693.538,
    "text": "Very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5693.838,
    "end": 5704.985,
    "text": "So, yeah, it's this story of free energy that the active inference paradigm is exploiting, but it becomes literal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5705.685,
    "end": 5718.873,
    "text": "So minimizing information theoretic free energy or predictive model error is exactly what allows the system to minimize actual thermodynamic errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5719.053,
    "end": 5719.573,
    "text": " free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5719.653,
    "end": 5738.939,
    "text": "So if you look at the biosphere as a whole system, you can look at individual agents, individual organisms, or these collectives, Maxwell Remsted and first in have done work showing that, you know, at these talking about complex adaptive systems that are societies, these things are minimizing free energy as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5739.659,
    "end": 5741.0,
    "text": "Um, so yeah,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5742.133,
    "end": 5752.799,
    "text": " Yeah, basically, you have this story, this kind of neat little story where you can explain it all in terms of different types of entropies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5753.439,
    "end": 5758.121,
    "text": "So life is trying to keep internal entropy low.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5758.682,
    "end": 5760.823,
    "text": "And to do that, it needs to extract free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5761.723,
    "end": 5767.966,
    "text": "But by extracting free energy, it's dissipating more of the world's free energy supply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5768.046,
    "end": 5770.548,
    "text": "So it's keeping internal entropy low.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5771.885,
    "end": 5795.652,
    "text": " increasing external entropy and it does that by myth minimizing its prediction error and that's minimizing Shannon entropy or uncertainty or ignorance so yes I think what one kind of goal of this you know integrated synthesis is to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5797.912,
    "end": 5814.577,
    "text": " Basically, it can incorporate the free energy principle because to minimize actual thermodynamic free energy to stay far from equilibrium, you have to minimize your uncertainty of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5814.897,
    "end": 5818.558,
    "text": "That's what Bayesian inference is doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5818.578,
    "end": 5826.12,
    "text": "There's one other point I was going to make about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5828.652,
    "end": 5830.093,
    "text": " Yeah, well, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5830.113,
    "end": 5845.648,
    "text": "So the free energy principle, I think on its own, it's just saying that systems will minimize the model's prediction error, but it doesn't talk about how you get more complex species or anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5845.688,
    "end": 5848.03,
    "text": "It doesn't really tell us this whole story of evolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5848.09,
    "end": 5850.253,
    "text": "It just talks about minimizing free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5850.833,
    "end": 5853.135,
    "text": "So what this story does is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5854.156,
    "end": 5880.969,
    "text": " starts to get us thinking about niches and that each niche represents this set of challenges and this set of computational problems and that systems, basically, when you want to think about why complexity increases, well, so minimizing complexity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5882.13,
    "end": 5906.88,
    "text": " free energy like trying to reduce surprise uh will keep you um far from equilibrium only for so long so if the environment changes then that species will die that species will get filtered out by natural selection so um there is a benefit to being curious there's a benefit to seeking out surprise",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5907.82,
    "end": 5923.028,
    "text": " And that's because basically if you can find a new niche to exploit, then you don't have to compete with everyone else in the species or whatever group that is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5923.708,
    "end": 5934.834,
    "text": "So it's not just about minimizing surprise in many cases, you know, more complex species,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5935.831,
    "end": 5953.778,
    "text": " the most complex species, especially like humans, um, it's beneficial to, um, be curious and do epistemic foraging and try to, you know, imagine the space of possible configurations where society is headed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5953.858,
    "end": 5955.639,
    "text": "So there's this, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5956.829,
    "end": 5985.154,
    "text": " real benefit uh to to seeking out new knowledge that i think the free energy principle may kind of leave out or hint at awesome thanks for sharing that just to add a few more points um so you mentioned daniel dennett's 1995 book darwin's dangerous idea and one of the really memorable parts in that book",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5985.994,
    "end": 6013.073,
    "text": " is this distinction between the cranes and the sky hooks and the image is like a building is constructed and then we're going to see the artifact but not the process of how it was made and then ask like was this likely constructed by a crane that put the last windows on the top or put the last piece of um you know building on top or was there a sky hook that built kind of a castles in the sky and then built down",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.994,
    "end": 6033.006,
    "text": " and um the constructivist answer just a construction site but like a biological constructivist answer which is to say like a developmental perspective it's like well it was cranes all the way down and smaller cranes are basically constructing larger cranes if needed and then at some level there's like some um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6033.746,
    "end": 6060.087,
    "text": " way for the seething of tiny tiny cranes somehow to facilitate larger cranes arising um so i was reminded of the cranes and sky hooks and and then as you just brought up in that light dance last answer and in some of the figures the design approach connects us with that kind of darwinian constructivism that dennett laid out but also you connected that to um process ontology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6061.474,
    "end": 6089.371,
    "text": " And that in a sense, this constructivism, this niche constructivism, and the way that the bottom of forces are leading to increasingly powerful, large scale organizations of systems, like whether we call it life or adaptive complexity, like you laid it out, I'm seeing a sort of omega point direction towards, instead of like finite competition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6090.563,
    "end": 6110.734,
    "text": " curiosity driven niche creation for certain systems or maybe something involving other scales, where like, there's a rebalancing of the relevance of different mechanisms, because we're seeing the adaptive complexity process playing out in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6111.074,
    "end": 6116.677,
    "text": "But that was what I was thinking and wondering how this framing influences how we act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6118.595,
    "end": 6125.879,
    "text": " Yeah, so I think it basically demystifies what looks like a teleological process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6126.559,
    "end": 6143.007,
    "text": "And I still think it's okay to call it teleological because it is goal-directed, but it's not teleological the way some theologians have used it to mean that there's this mystical force or something like... Well, it's really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6143.047,
    "end": 6145.089,
    "text": "It gets into language issues because...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6146.389,
    "end": 6165.28,
    "text": " Henry Bergson, who coined that term, Ilan Vital, and Teilhard de Chardin, who had a similar concept of radial energy, and even going back to Aristotle and his Intelechi and Telos, these people claim to be talking about something natural, even Teilhard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6165.961,
    "end": 6172.605,
    "text": "And so what we're seeing is that you can have this directional evolutionary process that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6173.665,
    "end": 6175.746,
    "text": " without there being any mystical force.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6176.466,
    "end": 6195.655,
    "text": "So it's, you know, it's not the case where we're demystifying everything and then getting, you know, because we got rid of this teleological force, we show that it doesn't exist, this mystical, you know, immaterial force, like pushing things toward progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6196.816,
    "end": 6199.437,
    "text": "By showing that doesn't exist, we're not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6200.56,
    "end": 6211.625,
    "text": " Killing the argument that evolution is progressive or actually showing that this idea can exist in a completely naturalistic framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6212.486,
    "end": 6214.287,
    "text": "And to me, it makes it more interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6214.727,
    "end": 6218.829,
    "text": "But you do clearly see this statistical tendency towards higher intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6219.369,
    "end": 6220.23,
    "text": "And not only that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6221.283,
    "end": 6228.988,
    "text": " evolution advances at a rate that allows life to leave the planet before its star dies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6229.148,
    "end": 6251.043,
    "text": "And that's specifically because the process creates consciousness and higher levels of awareness that basically create this imperative in the most intelligent species of a biosphere such that they understand that long-term persistence requires getting off the planet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6253.183,
    "end": 6265.005,
    "text": " So, yeah, it is the case that a lot of species just evolved to be as complex as their niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6265.305,
    "end": 6276.608,
    "text": "And if they're getting their energy just fine, like bacteria, there's no reason for there to be any pressure towards higher complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6276.688,
    "end": 6278.588,
    "text": "But with humans, for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6279.548,
    "end": 6282.25,
    "text": " we start to construct our environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6282.31,
    "end": 6283.791,
    "text": "We construct niches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6283.851,
    "end": 6292.778,
    "text": "We build all of this order around us and we create these new selection pressures and we create all of these new biologically relevant variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6293.138,
    "end": 6304.206,
    "text": "So there's a tendency where the most complex species, uh, basically how many variables they have to model is open-ended and anyone who is willing to, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6305.347,
    "end": 6332.606,
    "text": " kind of go beyond um you know the amount of things that most people model um is going to have some sort of advantage let me make that a little bit more clear so someone in some very simple let's say small rural rural conservative town i'm not saying that in a bad way but um you could imagine a you know a culture with a simple lifestyle it might not be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6334.983,
    "end": 6339.185,
    "text": " adaptive to be someone like Roger Penrose, like some freak genius.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6339.425,
    "end": 6345.789,
    "text": "I think I read that Penrose gets lost walking around his office and stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6345.949,
    "end": 6350.571,
    "text": "He's just really absent-minded because his head's probably in the clouds thinking about mathematics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6351.252,
    "end": 6353.233,
    "text": "He might not do well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6353.313,
    "end": 6358.115,
    "text": "He might even be considered the town's crazy person in a small conservative town.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6358.476,
    "end": 6362.218,
    "text": "If your niche is simple, you don't have to have a complex...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6363.318,
    "end": 6385.8,
    "text": " uh world model and something simple like a worldview like a religion can serve you just fine it might actually be better because it's this sense-making lens that simplifies reality but if you're motivated uh and you're someone who wants to uh take on you know this i guess you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6386.781,
    "end": 6405.821,
    "text": " modeling more variables in the world, there will always be niches for you to exploit at places like academic universities and corporations where there are these niches that create this environment where there's actually this pressure towards",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6407.703,
    "end": 6408.983,
    "text": " more complex models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6409.384,
    "end": 6418.566,
    "text": "And that means there will be this evolutionary tendency towards organisms with a larger mental repertoire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6418.586,
    "end": 6434.991,
    "text": "So this niche emergence process where you get these increasingly complex species, you can actually measure that increase using something like integrated information theories, PHI, which measures basically the size of the mental repertoire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6436.051,
    "end": 6441.238,
    "text": " And so that's what this niche emergence process is doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6441.278,
    "end": 6450.851,
    "text": "It's creating increasingly complex species that are more intelligent because they have a larger repertoire of accessible mental states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6451.532,
    "end": 6452.653,
    "text": "But on top of that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6453.57,
    "end": 6468.83,
    "text": " you have this other uh component of intelligence which relates to um how the system is reflecting on itself so you get these emergence of higher levels of um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6469.731,
    "end": 6475.073,
    "text": " And I didn't talk about this, but that's really what the prefrontal cortex in the brain does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6475.253,
    "end": 6483.836,
    "text": "It's a module that unites these other computational modules, which often do processing individually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6484.797,
    "end": 6486.857,
    "text": "There's this global workspace that emerges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6487.578,
    "end": 6492.659,
    "text": "And basically, that's a meta system transition as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6493.16,
    "end": 6493.34,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6494.699,
    "end": 6511.369,
    "text": " As far as lessons for society, I think part of intelligence is these levels of awareness where you have consciousness and then you have self-consciousness or self-awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6511.909,
    "end": 6531.004,
    "text": " that leads to different types of behavior um but then there's another level that you might call meta-awareness and it's realizing that you're a conscious agent in a network of conscious agents that form this higher level meta system that we call society and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6533.607,
    "end": 6541.5,
    "text": " So basically to and I hinted at this during the talk to overcome our.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6542.532,
    "end": 6553.481,
    "text": " existential challenges, our sustainability challenges, ensuring that artificial intelligence isn't used in this way that destroys civilization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6554.501,
    "end": 6568.972,
    "text": "All of these big problems require us coming together and the nations working cooperatively because solving those problems requires the computational power of the full system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6569.793,
    "end": 6581.987,
    "text": " So we need to cooperate to basically exploit this synergistic effect that occurs when you work with others rather than working alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6583.479,
    "end": 6593.683,
    "text": " The other thing I guess I'd say right now about lessons for society is that complexity is really a function of two things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6594.343,
    "end": 6600.746,
    "text": "You need a lot of parts, and the parts need to be highly connected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6600.886,
    "end": 6603.387,
    "text": "The more connections between the parts...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6604.207,
    "end": 6613.524,
    "text": " and the more diversity there is among the components, then the more complex that system is and the more computational power it can have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6614.165,
    "end": 6614.406,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6617.898,
    "end": 6625.105,
    "text": " That's basically why you can't have life emerge if you only have all hydrogen elements or all oxygen elements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6625.265,
    "end": 6628.368,
    "text": "You can't just have one or two types of atoms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6628.428,
    "end": 6637.758,
    "text": "You need this distribution of molecules because they function as something like a division of labor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6638.398,
    "end": 6641.581,
    "text": "At the society level, a society full of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6642.422,
    "end": 6661.453,
    "text": " exclusively made of engineers or made of doctors or made of artists like none of those societies would be functional if they had one type of person so you need a diversity among the component parts and you want a lot of connections between those parts so technology that um uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6662.153,
    "end": 6691.049,
    "text": " connects us um not just the internet but social media and blockchain technology anything that bypasses middlemen and is starting to make all these connections between the units those things are good they can also be bad as well um we don't want to connect in a way where we become some sort of homogenous hive mind i know when i say the global brain a lot of people express problems with that fears over becoming this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6691.849,
    "end": 6719.682,
    "text": " kind of hive mind which i think china's government is like like basically trying to create and they have this philosophy of that the that the citizens um recognizes that they're part of an interdependent whole and they kind of use this to you know tell people like uh convince people that like surveillance and all these other things like you know that take away freedoms is good because you're doing it for the greater good",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6720.925,
    "end": 6730.818,
    "text": " So what this paradigm says is that we want to become increasingly connected, but we don't want to be homogenous because we want diversity among the component parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6731.459,
    "end": 6738.267,
    "text": "And a system like that, especially a system that doesn't allow criticism, doesn't allow for a diversity of ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6739.288,
    "end": 6742.57,
    "text": " A system that's homogenous doesn't allow for cultural diversity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6743.091,
    "end": 6746.533,
    "text": "So diversity and interconnection is good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6746.993,
    "end": 6747.933,
    "text": "We want to come together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6747.973,
    "end": 6750.795,
    "text": "We want to bring the nations together, but we also want to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6752.816,
    "end": 6757.418,
    "text": " keep the identities of the nations at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6757.458,
    "end": 6758.919,
    "text": "We want to preserve the cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6759.639,
    "end": 6776.626,
    "text": "A brain is super integrated with, you know, 80 billion neurons and 10,000 connections between each of those neurons, but it's also structured hierarchically and you have these different levels of modules and you have, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6777.486,
    "end": 6780.927,
    "text": " You have like the fusiform face area, processing phases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6780.987,
    "end": 6783.748,
    "text": "You have like the visual cortex doing visual stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6784.469,
    "end": 6789.09,
    "text": "All these things are specialized, but they're working together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6789.851,
    "end": 6806.757,
    "text": "And I think that provides a model for optimizing society and that evolutionary principles can inform how we structure our governance systems, our economic systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6809.972,
    "end": 6831.659,
    "text": " okay a few more questions if you'd like is that cool sure yeah all right so you've mentioned a few things about the trajectory towards integration what do you say to you see that where you see it up until you don't and where you don't see it so how do we really assess what is like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6833.274,
    "end": 6857.738,
    "text": " what must happen or what probably happens given our really limited knowledge and how do we sort of balance this optimization across multiple points in a design space with this n equals one trajectory that our one body one spaceship earth all this sort of stuff is um limited by in the scenario that we're in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6859.133,
    "end": 6862.996,
    "text": " Yeah, so I mean, we can't see what we don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6864.037,
    "end": 6873.945,
    "text": "So I'm definitely not arguing that this process is inevitable in the way that would make our civilization incapable of failing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6875.186,
    "end": 6884.474,
    "text": "Evolution towards higher progress occurs because life is always learning from its mistakes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6884.995,
    "end": 6886.576,
    "text": "So it's failing constantly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6886.736,
    "end": 6888.057,
    "text": " It's failing constantly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6888.878,
    "end": 6892.6,
    "text": "And I didn't mention this principle in the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6892.66,
    "end": 6896.222,
    "text": "I call it Popper's principle, but it says problems create progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6896.703,
    "end": 6914.615,
    "text": "So it's a story of this eternal thermodynamic challenge of staying far from equilibrium, which requires extracting energy, which requires also avoiding threats and just maintaining the stable state in the face of a chaotic and noisy world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6917.776,
    "end": 6928.178,
    "text": " Um, that, uh, yeah, it's, it's basically the challenges that we face that, uh, force us to find solutions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6929.058,
    "end": 6932.019,
    "text": "Um, so it's not this straight march of progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6932.079,
    "end": 6936.58,
    "text": "It's not teleological in that way where there's like nothing stopping our failure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6936.96,
    "end": 6941.941,
    "text": "We're actually going to fail over and over, but because there's memory, uh, and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6943.422,
    "end": 6944.823,
    "text": " We learn from our mistakes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6945.864,
    "end": 6954.031,
    "text": "As long as those failures are encoded in memory in some way, you get this progressive process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6955.692,
    "end": 6967.522,
    "text": "As far as how do we handle what we don't know, we have to actually engage in this process that I would say is very Bayesian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6968.663,
    "end": 6969.564,
    "text": "We have to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6971.525,
    "end": 6975.587,
    "text": " try to imagine all of the possible futures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6975.667,
    "end": 6983.81,
    "text": "We have to map out all of the counterfactuals because that sort of allows us to see the possibility space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6984.01,
    "end": 6991.273,
    "text": "And if we don't do this, we're like sitting ducks, like there's no way for us to be able to handle the challenges that are coming.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6992.293,
    "end": 7011.987,
    "text": " And it was interesting like writing the book and thinking about these ideas and, you know, going from non-equilibrium thermodynamics to finding out about like the free energy principle and that it's basically part of this non-equilibrium story, like how systems persist in a universe abiding by the second law of thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7012.827,
    "end": 7014.469,
    "text": "I was talking, I was telling a friend about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7015.309,
    "end": 7042.42,
    "text": " um who was in design school i think it was parsons design school and they had this class they were teaching on future forecasting and it was literally i guess it was for people like architects all types of jobs but their job was to map out like the different possibilities of reality like the different trajectories of ways we could go and they had to map out what was like likely and like less likely and you know at all these different levels of likelihood",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7043.393,
    "end": 7049.525,
    "text": " But if one thing, if current events have showed us anything, it's that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7050.609,
    "end": 7054.992,
    "text": " Things don't always happen that we predict are likely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7055.152,
    "end": 7060.176,
    "text": "I don't think Trump becoming president would have seemed likely 10 years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7060.196,
    "end": 7066.641,
    "text": "I don't think the pandemic, I don't think the storming of the Capitol would have seemed likely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7067.642,
    "end": 7075.208,
    "text": "So we actually have to do the work of mapping out the space of all possible futures to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7076.226,
    "end": 7077.447,
    "text": " And this is part of planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7077.487,
    "end": 7079.168,
    "text": "I mean, this is what good planning does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7079.688,
    "end": 7082.31,
    "text": "This is made possible by the prefrontal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7082.43,
    "end": 7091.415,
    "text": "We can uniquely do this process because we're at the leading edge of intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7092.315,
    "end": 7101.501,
    "text": "But it's a practice that we have to engage in now if we want to be prepared for the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7104.184,
    "end": 7104.524,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7105.504,
    "end": 7112.366,
    "text": "I just wanted to post this out on a little bit more of a general or personal note, perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7113.506,
    "end": 7130.389,
    "text": "Wanted to hear your view on how the writing and the reception of your book, as opposed to, say, other livestream appearances or articles you've written, how did that process of writing the book update your sense of science's direction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7131.309,
    "end": 7136.353,
    "text": " especially in terms of global participation and education and research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7137.054,
    "end": 7148.884,
    "text": "Like where are we at with science, inclusion, participation, and just where is science going with all these topics that you thread together in the work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7149.124,
    "end": 7151.886,
    "text": "Like where does that bundle of science go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7152.947,
    "end": 7156.41,
    "text": "And how did writing the book update the way that you were seeing that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7158.243,
    "end": 7173.355,
    "text": " Yeah, so I guess the first thing I would say was that it became very apparent, especially reading about evolutionary epistemology and Karl Popper, because his work was the philosophy of science and epistemology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7174.116,
    "end": 7178.239,
    "text": "And it became really clear that academia kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7179.824,
    "end": 7183.028,
    "text": " You know, you can't think of an idea like too radical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7183.168,
    "end": 7187.693,
    "text": "Everything you do has to be based on past research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7187.733,
    "end": 7199.087,
    "text": "You can't just invent a question and, you know, write a paper about like some like if you try to submit a paper to a journal that didn't reference research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7199.207,
    "end": 7216.31,
    "text": " past work it would not have any chance of getting accepted um and this is good in a way because it forces people to read the literature and understand what's out there um but it's really constraining and you have this publisher parish game that makes it such that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7217.071,
    "end": 7222.253,
    "text": " people are just going where there's easy publications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7222.353,
    "end": 7225.414,
    "text": "So you're being conservative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7225.434,
    "end": 7231.555,
    "text": "You want to just build very small incrementally on the work that has come before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7232.096,
    "end": 7232.896,
    "text": "But the problem is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7234.266,
    "end": 7260.866,
    "text": " that if you have this big integrated view, because you've looked at all of these different fields, like if you look at, you know, from biology to neuroscience, to thermodynamics, to information theory, uh, cybernetics, um, you're going to be seeing connections that people that are just like biologists working in the field, like in paying attention to those mainstream biology journals that they just don't see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7262.187,
    "end": 7263.127,
    "text": "And, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7264.895,
    "end": 7270.38,
    "text": " So there's not enough interdisciplinary connection, collaboration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7271.901,
    "end": 7273.282,
    "text": "There's not enough emphasis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7273.482,
    "end": 7276.305,
    "text": "There's not enough appreciation for generalists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7276.345,
    "end": 7277.185,
    "text": "Everybody's like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7279.456,
    "end": 7296.391,
    "text": " uh basically pressured to be a specialist in science and um we really need generalists right now to step back and look at all the different fields and not just fields of science but philosophy because anytime you do science you're making philosophical and metaphysical assumptions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7297.251,
    "end": 7308.92,
    "text": " Um, and, uh, yeah, the, and the, the, the hardest problems that you haven't understood, like say the hard problem of consciousness, it's always philosophy at first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7308.96,
    "end": 7316.066,
    "text": "That's going to kind of define like the territory, like make you understand like what, what the problem is and like how to approach it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7316.106,
    "end": 7316.366,
    "text": "So yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7317.347,
    "end": 7343.76,
    "text": " we need generalists we need scientists working with philosophers we need scientists becoming philosophers we need philosophers caring more about science and all these mechanisms rather than just like picking panpsychism as a stance because it seems cool to you and then you just defend it for the rest of your career i also see a lot of philosophers just picking like illusionism or something and sticking to it like i think that's bad too we should all be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7344.946,
    "end": 7349.13,
    "text": " know, excited about updating our model when new evidence comes in that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7349.811,
    "end": 7358.26,
    "text": "Um, so yeah, we, we shouldn't get tied to any one idea too much and, um, not, you know, there's a role for specialists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7358.32,
    "end": 7367.85,
    "text": "I mean, people solve these really hard problems in their fields because they're just kind of have this one track mind and tunnel vision, but they're",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7368.368,
    "end": 7377.499,
    "text": " at the time we're at right now, to make progress and to really apply this stuff to society, because societies are complex adaptive systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7377.639,
    "end": 7385.448,
    "text": "It's a big mistake to think these things can't, these scientific understanding of evolutionary mechanisms and emergence",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7386.192,
    "end": 7399.901,
    "text": " can't inform like our institutions and our sense of morals that's a big mistake so um yeah writing it uh that just became very apparent that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7400.672,
    "end": 7404.893,
    "text": " And I was lucky enough to have, I mentioned him before, Harold Morowitz as a professor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7404.913,
    "end": 7410.315,
    "text": "And he was just someone, you know, it was a neuroscience department, but he was an origin of life researcher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7410.895,
    "end": 7417.878,
    "text": "So, you know, he got us like understanding that like we had to start thinking about like, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7419.092,
    "end": 7439.432,
    "text": " energy like free energy and uh staying far from equilibrium um that information theory is important and epistemology um that uh and santa fe institute is you know a good place to mention because their work is interdisciplinary by nature and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7440.566,
    "end": 7450.574,
    "text": " So, yeah, we need to be that way and we need to push back on the culture that like actually some scientists are threatened by this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7450.854,
    "end": 7456.479,
    "text": "And like the extended evolutionary synthesis, like if you read that Guardian article I mentioned,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7457.338,
    "end": 7461.581,
    "text": " that a lot of these scientists are saying that we need to extend the modern synthesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7462.022,
    "end": 7465.985,
    "text": "A lot of scientists were really mad and insulted by that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7466.585,
    "end": 7470.688,
    "text": "And they feel like it's attacking this sacred thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7471.229,
    "end": 7477.554,
    "text": "And some of them might even claim that some concepts are pseudoscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7478.214,
    "end": 7481.216,
    "text": "I still see people thinking like emergence, like some people thinking",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7482.037,
    "end": 7486.022,
    "text": " you know, some of these different concepts from complexity science are like not real science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7486.142,
    "end": 7491.348,
    "text": "And a lot of times those are people that are just have been like indoctrinated by like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7492.912,
    "end": 7494.113,
    "text": " militant reductionism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7494.133,
    "end": 7497.797,
    "text": "I won't talk too bad about reductionism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7497.837,
    "end": 7501.72,
    "text": "It's a great method, but it's a terrible philosophy and worldview.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7504.762,
    "end": 7510.948,
    "text": "I think there needs to be a big push to have an awareness that we need generalists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7511.008,
    "end": 7512.849,
    "text": "We need people looking at everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7513.51,
    "end": 7520.236,
    "text": "I think people who aren't in academia, who are interested in this kind of stuff, people who follow the channel, but they're not at a university...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7520.836,
    "end": 7530.746,
    "text": " they have a big role to play here and they can, you know, see these connections and blog about it, whatever they do to like create content that kind of shapes the narrative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7531.366,
    "end": 7539.475,
    "text": "Because that's one thing I've seen, like the narrative does get shaped by culture and by these people who are really good at articulating things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7540.315,
    "end": 7542.317,
    "text": "Daniel Schmachtenberger is kind of like a,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7543.078,
    "end": 7562.243,
    "text": " complexity theorist philosopher but you know i as far as i'm aware he doesn't have like you know he's he's not in academia but um people like this are kind of like showing us these connections and trying to create a sense-making lens out of our scientific paradigms and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7563.183,
    "end": 7564.404,
    "text": " I think we're going in the direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7564.744,
    "end": 7580.61,
    "text": "I'm excited to see, like, I've been finding all these new communities I'm looking for, like metamodern communities and game B. And these people are looking for this kind of like integrated paradigms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7580.831,
    "end": 7581.931,
    "text": "And it's pretty exciting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7584.107,
    "end": 7584.988,
    "text": " Thanks for the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7585.168,
    "end": 7590.711,
    "text": "Just to share a few more ideas and you can feel free to respond or we can go as long as you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7590.912,
    "end": 7607.583,
    "text": "So when you were mentioning those regimes of attention, which is an active inference term, meaning the regimes of action and cognitive states, like what entities are doing in the niche and what their cognitive models are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7607.603,
    "end": 7613.907,
    "text": "And in the social context, that relates to the concept of scripts, like strong and weak scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7614.728,
    "end": 7638.426,
    "text": " and when it comes to science broadly that niche and the scripts and the norms and the archetypes and all the different players include like the journals the publishers what people are paying attention to the public science meme pages like everything and then i heard the call for the normalization of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7639.269,
    "end": 7665.042,
    "text": " transdisciplinary collaboration which implies at least like an island of shared generalism like not everyone in the transdisciplinary collaboration is going to be pan generalist but there has to be some overlap in their venn diagram or some way that they can align in their perspectives which is related to generalism or being able to take different vistas on the differences between the perspectives",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7666.062,
    "end": 7689.669,
    "text": " um and then like that transdisciplinary collaboration whether in the mind of one person or on teams it happens and and hopefully will happen at the informal like everyday level just bringing that kind of curiosity and synthesis to like whoa it's really cool that the algae are growing here next to the waterfall and not here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7690.549,
    "end": 7693.31,
    "text": " what does that mean about uncertainty?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7693.37,
    "end": 7696.951,
    "text": "Or how are they minimizing free energy by living here, not there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7696.991,
    "end": 7709.915,
    "text": "So that kind of like everyday embodied science conversation, and then also hopefully the rigorous, like decentralized science, DeSci research that teams and communities could be carrying out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7710.715,
    "end": 7717.657,
    "text": "So I just thought it was kind of cool how this is a idea that applies to like the whole continuum of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7718.908,
    "end": 7743.479,
    "text": " what today is occupied by like research institutions doing research and then like the the citizenry in the population receiving a very certain kind of science communication and not necessarily like a including or engaging one and then just the last point was i um heard you talk about pluralism and this sort of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7744.67,
    "end": 7764.86,
    "text": " bayesian pluralism like you have a portfolio of models and maybe on some features or over some time scales some fit better than another but just one model in a portfolio of models like one investing strategy or one chess move transiently doing better in a situation is hardly like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7765.82,
    "end": 7786.302,
    "text": " something objective about that strategy or that chess move it's something that should be seen in context and across its distribution of all the chess moves and so on so I think that's a really rich angle and that Avenue of scientific pluralism which uh Helen longano and others have explored",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7787.063,
    "end": 7811.502,
    "text": " is really rewarding because it just speaks to some of those questions about like modernism and game b and so on and resolving the sometimes apparent tension between like multiple truths and scientific pursuit of what is epistemically good and so i guess i'll just close by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7812.623,
    "end": 7837.099,
    "text": " giving you the floor for any other comments you'd like to make and otherwise just say this was a great discussion i really appreciate the work and coming on and sharing yeah all that you said was great um totally agree uh and i think these kind of conversations just you know us recording this and putting it online and you creating this channel um i think we're seeing you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7839.001,
    "end": 7842.505,
    "text": " All of these things are popping up partially because of the pandemic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7842.625,
    "end": 7850.134,
    "text": "It was great that people had to embrace Zoom because we were going crazy being by ourselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7850.975,
    "end": 7853.979,
    "text": "But yeah, I'm seeing so much excitement now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7854.221,
    "end": 7860.185,
    "text": " regarding like these kind of questions, like the hard problem of consciousness, like, you know, origin of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7862.346,
    "end": 7873.593,
    "text": "All of this stuff people are super excited about to where like all of, you know, these people working in these fields from science to AI, they've become like celebrities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7874.414,
    "end": 7880.538,
    "text": "And it's amazing that I saw the kind of progression in the last few years of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7881.198,
    "end": 7905.098,
    "text": " where the the kind of the amount of knowledge of people who weren't in academia uh just was like so much higher than it was before like i would say like 10 years ago being on facebook like regular people were learning about like schrodinger scat and like making jokes about it and making memes about it and you know there were these specific ideas things that you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7906.846,
    "end": 7911.19,
    "text": " Stephen Hawking wrote about in A Brief History of Time, like black holes, singularities, whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7911.59,
    "end": 7917.675,
    "text": "There were all these topics that people were getting into and understanding enough to where they were becoming memes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7918.235,
    "end": 7928.804,
    "text": "But in the last few years, I've seen this crazy explosion where people in these communities, like these Facebook groups or on Twitter, I mean, they know a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7928.924,
    "end": 7936.17,
    "text": "They know sometimes it seems like they have a lot more knowledge as far as the philosophical context of one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7936.57,
    "end": 7956.913,
    "text": " like problem than the actual like experts in the field and so i think this is great and people just need to have these dialogues they need to record them and put them online and there needs to be like this like discussion you know between different fields different groups um and yeah it's great that so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7959.008,
    "end": 7961.89,
    "text": " you talked about like, you know, asked about like the experience writing the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7962.51,
    "end": 7965.472,
    "text": "Um, I wrote an article called is the universe pro life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7965.552,
    "end": 7972.796,
    "text": "And it really just argued that, um, uh, life was inevitable, uh, the emergence of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7972.876,
    "end": 7977.118,
    "text": "It wasn't saying anything about the emergence of intelligence or anything, but, um, so it was a pretty, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7978.553,
    "end": 7983.317,
    "text": " it was a pop article, but it got into like thermodynamics, non-equilibrium thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7983.658,
    "end": 7986.961,
    "text": "And, um, but it had this like catchy title is the universe per life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7987.861,
    "end": 7993.006,
    "text": "And, uh, Sean Carroll was nice enough to give a quote for it and then retweet it with like an endorsement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7993.487,
    "end": 7996.209,
    "text": "And I think that helped, um, get the book deal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7996.87,
    "end": 8000.893,
    "text": "But, um, so, uh, I was pitching it to different publishers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8001.374,
    "end": 8003.235,
    "text": "Um, and, um, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8005.179,
    "end": 8009.924,
    "text": " And the Harvard editor saw that article and was interested.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8010.725,
    "end": 8012.426,
    "text": "And we had lunch and I told him about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8012.526,
    "end": 8018.452,
    "text": "But when he heard the whole story and then saw the proposal, he was like, this is just too big.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8018.472,
    "end": 8019.193,
    "text": "I'm not sure...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8020.254,
    "end": 8025.42,
    "text": " which reviewers to get for this because it's just, you know, so many different fields.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8025.801,
    "end": 8027.964,
    "text": "It seemed like very philosophical to him.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8028.564,
    "end": 8035.933,
    "text": "It was great because then I got my publisher, Ben Bella, which publishes like pop science books.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8037.575,
    "end": 8042.66,
    "text": " And that gave me the freedom to write something like this big in scope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8042.78,
    "end": 8045.983,
    "text": "So it's great that popular science books exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8046.023,
    "end": 8052.649,
    "text": "I hope more scientists start writing stuff outside of their field in journals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8054.11,
    "end": 8059.635,
    "text": " But it was funny because once I wrote it, my agent was like, this is really technical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8059.695,
    "end": 8064.16,
    "text": "I'm not sure how it's going to do because it's written at a college level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8064.3,
    "end": 8067.923,
    "text": "And usually pop books are written at a high school level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8068.764,
    "end": 8073.509,
    "text": "And so it turned out being a book that probably would have worked for an academic press.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8075.273,
    "end": 8087.781,
    "text": " But so, yeah, I wasn't sure how it was going to be received because it had this larger kind of teleological narrative that was purely mechanistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8089.502,
    "end": 8091.703,
    "text": "And so far, it's been great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8091.963,
    "end": 8098.888,
    "text": "It was really surprising that I got people who people like Michael Schermer, who are known for being.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8099.608,
    "end": 8122.169,
    "text": " like skeptics and atheists um because you know they felt that it was you know the the mechanisms were articulated well enough to to show that you know something like this teleological narrative um was you know legitimate science and uh something really exciting um but it was funny because like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8123.345,
    "end": 8135.296,
    "text": " I won't say this person's name, but they were a famous cosmologist that I thought would be really into the ideas of the book because it were these ideas of like emergence and kind of this teleological stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8135.316,
    "end": 8141.061,
    "text": "And that person was like really influential in that kind of niche area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8141.161,
    "end": 8147.146,
    "text": "But they said that they thought that the book was written, you know, super well and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8148.587,
    "end": 8160.254,
    "text": " uh that they thought it would um be successful but that he couldn't endorse it because it was it talked it mentioned too many reductionists it was like too much reliant on um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8161.856,
    "end": 8163.557,
    "text": " Richard Dawkins and Dan Dennett.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8163.757,
    "end": 8170.819,
    "text": "So where I thought it was really going to appeal to the spiritual scientists, it was too reductionistic for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8170.839,
    "end": 8176.06,
    "text": "And then for some maybe reductionist scientists, it was too much on the emergent side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8176.14,
    "end": 8181.522,
    "text": "So it became very clear there was a culture war and that we've",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8182.202,
    "end": 8202.461,
    "text": " been held back from progress just talking about like a science of agency like it an emergence these ideas for some reductionists like were too abstract and not well defined and were considered pseudoscience or like new age stuff or you know whatever theology um so um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8203.806,
    "end": 8226.273,
    "text": " both sides have to kind of see where the other side's coming from and what they have to contribute and i hope the book you know i wish i would have had a year two more years to like really make the book what it was it feels like something that's like not complete or something that needs to be like continually updated because they're definitely",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8228.078,
    "end": 8244.677,
    "text": " open questions like I forgot to like put I didn't have time to like address like the Fermi paradox stuff that was like really relevant and hopefully I've talked about in these talks but I was really happy with the way you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8245.731,
    "end": 8261.746,
    "text": " people who are looking for a science book have embraced and got excited about this larger story of purpose and progress because it totally changes the narrative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8261.946,
    "end": 8262.746,
    "text": "It really just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8263.447,
    "end": 8272.674,
    "text": " goes from the reductionist worldview, which said, you know, life and mind are epiphenomena and we don't have true agency and that life is transient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8273.075,
    "end": 8279.98,
    "text": "It's a really nihilistic, depressing worldview to a scientific worldview that does have spiritual implications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8280.22,
    "end": 8288.347,
    "text": "We're not, we're not, we're not these, we're not destined for transience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8288.927,
    "end": 8292.27,
    "text": "And one person wrote me and said something like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8294.736,
    "end": 8308.548,
    "text": " understanding this worldview made reality like our like just the general experience of being alive feel different feel like more infused with like meaning and purpose and that you know would be like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8309.52,
    "end": 8324.815,
    "text": " One of the major goals of that is that people don't feel like life is some sort of fluke or cosmic accident, that we're actually a natural manifestation of physical laws and that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8326.957,
    "end": 8333.199,
    "text": " this actually, it's not just this optimistic picture that's fun to believe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8333.679,
    "end": 8338.161,
    "text": "It actually gives us a picture of where we might be going and how to deal with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8338.741,
    "end": 8353.266,
    "text": "So doing this thing that I mentioned about like mapping out all the counterfactuals so we can ensure that we move along the trajectory that's consistent with the continual existence and progression of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8354.606,
    "end": 8380.115,
    "text": " um so yeah let's let's open our arms to philosophy and metaphysics and anything that can inform the scientific picture because science needs philosophy amazing bobby thank you again for this and really appreciate the time and we'll plan point three when the time is right yeah so good luck with everything and see you around",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8380.845,
    "end": 8381.747,
    "text": " Thank you so much, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8381.767,
    "end": 8382.489,
    "text": "Love the questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8382.789,
    "end": 8385.816,
    "text": "Thanks to everybody else who is in the chat or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8385.836,
    "end": 8387.159,
    "text": "Appreciate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8388.642,
    "end": 8388.923,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8388.983,
    "end": 8389.364,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8390.125,
    "end": 8390.486,
    "text": "Have a good one.",
    "speaker": "SPEAKER_01"
  }
]