[
  {
    "start": 7.777,
    "end": 8.278,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.619,
    "end": 10.32,
    "text": "Hello, welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.402,
    "end": 14.644,
    "text": "It is April 16th, 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.224,
    "end": 29.319,
    "text": "This is ActiveInference Stream 12.2, and we will begin it with making a GitHub push to the repo that all of the work is going to be in, continuing on from 12.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.2,
    "end": 31.881,
    "text": "Start stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.424,
    "end": 37.767,
    "text": "This is going to the GitHub repo",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.13,
    "end": 41.413,
    "text": " active inference Institute slash cerebrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.762,
    "end": 53.068,
    "text": "And looking forward to people's ideas and questions during the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.129,
    "end": 60.497,
    "text": "So this is the case of the evolving cerebrum, the curious language of the incident.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.008,
    "end": 70.397,
    "text": " We're going to be using Cursor IDE version 48.9 on the date of edge of development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.838,
    "end": 82.871,
    "text": "LLMs, the two main LLMs that are being used in this development have been Claude 3.7 and Gemini 2.5 Pro EXP325.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.051,
    "end": 92.442,
    "text": "So I'm just going to delete things as we go through them and look at some practical and some theoretical aspects of Cerebrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.367,
    "end": 118.125,
    "text": " all right so uh to begin with and sort of catch up on the Zenodo um the version one was uploaded on April 7th and commonalities similar topic also there was a script that was in an older folder called cerebrum in the repo that was used to assemble the the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.308,
    "end": 147.69,
    "text": " um in doing that learned a lot about assembling papers and writing them expanding them and in this current version 1.4 release today it's up to 146 pages and still generated by a single simple script which we'll look at in a second um and how it's expanded so there's this sort of paper component and the papers generated from the paper folder in the repo",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.885,
    "end": 168.042,
    "text": " let's look into it in cursor first how the paper is made then we will look at some cool applied outcomes like making a linear regression neural network and partially observable markov decision process model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.022,
    "end": 189.49,
    "text": " declining those into different cases and getting different kinds of behavior from different from the same model but of different model types and getting a little bit clearer of a view in a few specific cases what it means to have a given generative model in a different case",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.668,
    "end": 201.36,
    "text": " Okay, first the paper, then to the source code, and deleting things along the way, adding things as people add anything in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.38,
    "end": 209.61,
    "text": "All right, first the paper generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.711,
    "end": 212.473,
    "text": "Oh, and the documents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.347,
    "end": 221.772,
    "text": " The README in the paper folder describes this process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.214,
    "end": 234.448,
    "text": "Assemble paper is a script of 551 lines that looks into the component section and assembles them into the output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.249,
    "end": 244.84,
    "text": "So in the output, there is the PDF that's generated, which concatenates the title page",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.575,
    "end": 257.375,
    "text": " makes a table of content, including all the main text sections, however many there are, and then all of the supplements, however many there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.702,
    "end": 268.937,
    "text": "It also outputs a pure Markdown concatenated version of the assembly process, and it outputs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.115,
    "end": 300.122,
    "text": " an HTML version so here's a website rendering clickable links still has the inserted images so a lot of flexibility in how and and also the the paper and the images are also vastly improved so there's multiple ways to make static documents interactive websites um and markdown files for easy machine reading and formatting as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.823,
    "end": 321.942,
    "text": " it's generated from the components folders there's templates so you can add more sections then there's three folders figures main text and supplements so the figures are the 15 current figures and they have their name and title there's there's more general ways to do it uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.922,
    "end": 326.909,
    "text": " using LaTeX, Overleaf, all these kinds of things so that the numbering is automatic as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.93,
    "end": 331.336,
    "text": "So this is kind of a fixed numbering system, but could be generalized too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.157,
    "end": 342.112,
    "text": "So it has, for each figure, a caption, a title, a caption, and the mermaid markdown code to produce the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.114,
    "end": 346.799,
    "text": "Those get saved into the output as direct PNGs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.542,
    "end": 350.545,
    "text": "And also there's a graphical abstract",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.145,
    "end": 360.437,
    "text": " which looks a little better in PNG, which has the figures and the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.477,
    "end": 362.425,
    "text": "So kind of like scientific poster style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.755,
    "end": 367.1,
    "text": " Then there are the main text and the supplemental information sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 367.681,
    "end": 384.146,
    "text": "The main text is again determined by the numbering of the file, but these are markdown files with no mermaid diagrams, but citing the mermaid diagram for insertion and linking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.626,
    "end": 387.771,
    "text": "So these are markdown files in the main text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.637,
    "end": 400.45,
    "text": " title page, abstract, introduction methods, case functions and cognitive models, model workflows as case transformations, active inference models and conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.571,
    "end": 403.854,
    "text": "Then there are the supplemental sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.156,
    "end": 417.893,
    "text": "And if people have ideas for other supplemental sections to add, we can just add a 13, 14, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.05,
    "end": 423.833,
    "text": " I'll open up the website just to get a look at what's in the supplements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.547,
    "end": 429.872,
    "text": " Supplement 1 is a mathematical details and glossary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.953,
    "end": 435.76,
    "text": "Supplement 2 breaks out the novel proposed linguistic cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.021,
    "end": 439.966,
    "text": "Supplement 3 focuses on different practical applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.986,
    "end": 444.752,
    "text": "4 is a bibliography type section with related work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.934,
    "end": 448.357,
    "text": "5 goes into more category theory details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.377,
    "end": 453.364,
    "text": "6 gives future directions and roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.344,
    "end": 458.601,
    "text": " 7 goes into some computational complexity estimates for different transformations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.846,
    "end": 462.635,
    "text": "8 goes into more detail on active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.759,
    "end": 466.307,
    "text": "9 more information on math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.726,
    "end": 488.565,
    "text": " 10 algorithmic details 11 the formal definitions of the core linguistic cases the main ones that are focused on in the paper and section 12 uh case study on writing a research paper and how in different sections of the paper there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.693,
    "end": 509.727,
    "text": " different ways that sections are used and do different things with respect to each other and the ideas and the reader so that different cases could be applied to characterize the nature of a model or a process in that way for those phases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.592,
    "end": 520.604,
    "text": " Just going through this last one, just as an example of a supplement and kind of thing that if we wanted to build another supplement, someone can make a suggestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.006,
    "end": 538.971,
    "text": "Precision management in research paper writing, equivalent to learning rate, forgetting rate, attention, precision, broadly just describing modulatory strategies for different kinds of upweightings and downweightings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.052,
    "end": 568.62,
    "text": " message passing occurring amongst author and manuscript amongst sections manuscript and readers and reviewers with kinds of intent oriented um entities in different cases or using a similar joint model of communication in in different settings motivating why to have cases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.57,
    "end": 598.523,
    "text": " writing strategies haven't looked into any of these maybe some are useful um how to make certain kinds of pivots rhetorically in i guess speech or writing and different ways to interpret how uh regimes of attention change with with uh across different sections all right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.241,
    "end": 605.066,
    "text": " So that's the paper on Zenodo, and we can add more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.807,
    "end": 614.396,
    "text": "Just to close off this section on the paper assembly process, there are probably other tools to do this more flexibly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.436,
    "end": 620.462,
    "text": "There's things like DeepWriter and a lot of other approaches to doing structured document generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.343,
    "end": 628.611,
    "text": "Building it from scratch with Cursor is still pretty interesting, and having",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.89,
    "end": 654.717,
    "text": " plain text multiple sections possibly doing um lumping and splitting like have introduction 3.1 3.2 3.3 or just a more flexible way to order the sections it makes it really easy to go into a section and add some kind of feature using cursor like here in the introduction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.152,
    "end": 660.019,
    "text": " Just add one relevant paragraph to the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.173,
    "end": 675.061,
    "text": "Structured, smaller forms, figuring out the right kinds of coarse graining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 675.803,
    "end": 678.507,
    "text": "Obviously just having a dictionary isn't writing a paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.087,
    "end": 681.531,
    "text": "So having things broken out to the word level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.169,
    "end": 695.534,
    "text": " might be kind of a granular way, but maybe there's something interesting about that format, having a lookup table of the dictionary and encoding sections and words in a totally graphical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.554,
    "end": 702.287,
    "text": "It's just easier to write and version just small updates to the text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.731,
    "end": 706.353,
    "text": " can be done and reviewed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.893,
    "end": 712.399,
    "text": "So collaborative editing can zoom in and break out different sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.559,
    "end": 727.715,
    "text": "It'd be pretty clear if there's a flexible ordering method or just with the file names, even if someone broke out 4A and 4B or 4.1, 4.2, updated the assembly script, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.456,
    "end": 731.059,
    "text": "So, okay, that's the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.119,
    "end": 761.012,
    "text": " next uh how about the examples of the specific models then the documents then anything that that people have brought up by then bigger picture how do we integrate case-based logic so nouns in different roles and sentences however treating models as sort of noun entities how do we do that in theory and practice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.258,
    "end": 763.34,
    "text": " Different ways to make visuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.38,
    "end": 764.762,
    "text": "Mermaid's been super useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.962,
    "end": 777.26,
    "text": "Maybe there's other plain text formats that are useful too, but creating good system and process diagrams, structuring information from pros and tables and lists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.387,
    "end": 782.308,
    "text": "Math with LaTeX.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.33,
    "end": 784.65,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.652,
    "end": 788.256,
    "text": "Linear regression, POMDP, neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.338,
    "end": 794.886,
    "text": "So this is in the tests, in the source SRC folder, tests, subfolder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.129,
    "end": 800.655,
    "text": "Let's see if CodeViz will give a good representation of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.194,
    "end": 813.274,
    "text": "Hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.49,
    "end": 814.652,
    "text": " Okay, maybe not today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.692,
    "end": 833.068,
    "text": "In the tests folder, there are several script files",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.213,
    "end": 842.04,
    "text": " testing each of these different models, some utilities, and read me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.3,
    "end": 849.407,
    "text": "The three that are fleshed out at this point are neural network, linear regression, active inference, POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.147,
    "end": 862.178,
    "text": "So in each of these cases, there's going to be a single model that gets defined, and then it's going to be deployed in different ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.17,
    "end": 869.033,
    "text": " leading to visualizable, analyzable differences in outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.555,
    "end": 871.965,
    "text": "So let's just look at some of the images first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.173,
    "end": 889.447,
    "text": " Okay, here's a graphical summary of how for the very same neural network, whatever kind of technique is being used, there are different ways that just considering neural network like a noun, let alone the referent of what it means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.247,
    "end": 892.349,
    "text": "But there are ways that people talk about models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.95,
    "end": 897.534,
    "text": "That's the curious language is the what people talk about when they talk about models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.075,
    "end": 904.18,
    "text": "And it's right there in the sentence, though in a way silence in most cases in English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.16,
    "end": 929.374,
    "text": " there's the neural network does something standard dictionary form nominative the researcher trains the neural network like the researcher looks at the neural network accusative case recipients of action direct and indirect similar with dative more of like to give rather than to look upon",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.704,
    "end": 938.098,
    "text": " genitive outputs of one of the cases that's visible in english with the apostrophe s like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.04,
    "end": 960.778,
    "text": " the table's leg so it's the outputs of the table and these are it's a different way to talk about the outputs of something just at the first pass it's used in a different way in the sentence and then looking from the way it's used in a sentence on up through what the real reference is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.758,
    "end": 982.53,
    "text": " it starts to become a little clearer how these kinds of sentiments that are already expressed in natural language in method sections in people's own inner voice and conversations around modeling different ways that the words are used correlate or relate to in this linguistic fashion to differences in the deployment of the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.51,
    "end": 1000.89,
    "text": " hence possibly regularities that can be described and also structured in ways that are outside of these okay just the last cases here instrumental by means of the team solves a problem by using or with a neural network locative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.815,
    "end": 1016.837,
    "text": " the patterns exist within the neural networks layer so referring to the model as a location where there are spaces within or being in time within the model ablative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.817,
    "end": 1039.163,
    "text": " the errors originate from the neural network weight it's kind of an interesting case has some similarity with genitive in some situations and then the vocative which is the direct addressment like calling a different digital assistant with a name or calling the model to see if it exists like a ping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.712,
    "end": 1048.667,
    "text": " Then in each of those cases, the same neural network gets run with these slight differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.747,
    "end": 1052.233,
    "text": "So it's pretty variable per, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.995,
    "end": 1056.782,
    "text": "So in the ablative case, it was discussing the errors of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.042,
    "end": 1063.935,
    "text": "So in the accusative,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.514,
    "end": 1086.278,
    "text": " the model was being trained so this is just a trace as would be in some other kind of machine learning paper describing the target of optimization like in the method section where they say we train the neural network to dot dot dot here in the dative was the giving of data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.523,
    "end": 1111.692,
    "text": " so this is just describing as a function of input distribution what do different activations look like in the model so as it's being given different gifts what patterns are arising same neural network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.971,
    "end": 1130.255,
    "text": " Here in the generative case is describing function outputs, output distributions, some animations of generating output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.006,
    "end": 1138.607,
    "text": "Instrumental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.726,
    "end": 1162.688,
    "text": " this might be showing different ways that statisticians do things with the model looking at inputs outputs activations looking at the structure of the model looking at the model's training history for a given curriculum as a kind of empirical data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.313,
    "end": 1187.241,
    "text": " looking at kinds of interpretabilities looking at the structure of the neural network as as something that can be done with like tool engineering all right locative describing possible locations inside of not not super fleshed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.043,
    "end": 1216.941,
    "text": " showing the model in its agentic operation like when people say the model does this the model learns to fit this working as active agent generating predictions though those predictions would be the predictions of so it could be the same reference it could be used in in within one sentence a through the ball to b then b through the ball to a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.14,
    "end": 1220.947,
    "text": " So within one sentence or across sentences, different nouns are used in different cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.948,
    "end": 1226.917,
    "text": "And they're marked differently from a written, from a speaking perspective in different languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.48,
    "end": 1238.237,
    "text": "Similarly, models as slash like nouns are used in sentences in different case settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.293,
    "end": 1268.241,
    "text": " so those have different implications for what is viewed what is meant what kind of capacities would be required from that model like does the model need to turn on does it need to just give a ping like with evocative or does it need to make a prediction so that's the neural network example now there's two more examples there's the linear regression next",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.815,
    "end": 1277.597,
    "text": " So here is a Y equals MX plus B type linear regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.461,
    "end": 1282.416,
    "text": "So ablative predictions of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.995,
    "end": 1288.76,
    "text": " There were some very interesting diagrams that were arising in this linear case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.381,
    "end": 1293.486,
    "text": "So here are talking about the model as a causal originator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.067,
    "end": 1302.237,
    "text": "So there's the model which causes predictions, which influence or lead to decisions, which have these sort of causal consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.281,
    "end": 1310.968,
    "text": "So that's model as a source of causation and prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.572,
    "end": 1339.032,
    "text": " cross-validation here there's an evaluator who is a value doing something such that they it is said that they evaluate that model so that the model is being here evaluated to well residuals analysis doesn't have anything cross-validation in the evaluation phase",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.132,
    "end": 1369.66,
    "text": " here the model is in the dative case the recipient of data like I sent I gave a present to my friend I sent data to the model and that is reflected in the batch ingress process with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.72,
    "end": 1398.853,
    "text": " different sets of data or like perfective and imperfective like the streaming online real-time data model was receiving data in a continuous and then the perfective like the model finished receiving 50 units of data generative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.555,
    "end": 1425.094,
    "text": " is like apostrophe s so it's the possessives of the model so it's the intercept of the model the slope of the model mean squared error of the model all these kinds of statistical expressions things that might be in a results section instrumental",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.12,
    "end": 1434.093,
    "text": " used as an instrument of action, used as a tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.154,
    "end": 1436.481,
    "text": "Like, we hit the nail with the hammer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.722,
    "end": 1438.729,
    "text": "We analyze the data with the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.789,
    "end": 1446.255,
    "text": " So that's doing different, again, variable functional images, but looking at different kinds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.275,
    "end": 1451.32,
    "text": "Okay, so we train this model best as we could, whether it was this or that method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.081,
    "end": 1458.767,
    "text": "And then now we're going to look at the correlation or the causal interaction between factors one and two, and then factors one and three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.368,
    "end": 1466.995,
    "text": "And then we're going to use that instrumentally and say, oh, okay, here's a 0.14 correlation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.975,
    "end": 1486.249,
    "text": " and and we're this confident this far away from zero and here it's this correlation so this is these two features are more correlated or they have this causal relationship so doing things with models locative positions within the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.815,
    "end": 1491.799,
    "text": " So where's the model located in information spaces?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.879,
    "end": 1495.083,
    "text": "That's one, that's the kind of interpretation locative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.764,
    "end": 1510.74,
    "text": "And there are multiple senses in which a given case is used, but one of them was highlighted in that neural network example, which was a location in the model, like on the third floor of the neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.44,
    "end": 1512.962,
    "text": "And here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.942,
    "end": 1541.245,
    "text": " that would still apply you still could talk about i'm talking about the y in the equation and then here's another view which is the location of the model like they are at the store the model is at two comma three nominative this is sort of even though the the uh animation doesn't really work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.693,
    "end": 1566.642,
    "text": " nominate nominative is when using the standard dictionary type sense of the word when the model does something like that model fit the data that entity did that model as actor fitting the data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.693,
    "end": 1571.215,
    "text": " Model fitting data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.056,
    "end": 1578.906,
    "text": "All the kinds of sentences where the model is, it could be replaced like with a person's name or a doer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.778,
    "end": 1593.245,
    "text": "Vocative, so here this has some, there's a few funny ways the vocative is used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.265,
    "end": 1598.232,
    "text": "This one is, in the vocative case, data points directly address the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.173,
    "end": 1602.909,
    "text": " So each point communicates its residual value to the model line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.973,
    "end": 1609.757,
    "text": "This direct communication visualizes the conversation between data and models similar to how we might address someone by name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.193,
    "end": 1628.118,
    "text": " So this is almost at a sort of algorithm as communication level, thinking about information processes within like, oh, negative 2.55 told the slope where it was and the slope told back its residual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.12,
    "end": 1636.47,
    "text": "So that kind of, whereas in the neural network case, the vocative focused on the addressment by name for like a digital assistant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.184,
    "end": 1664.213,
    "text": " okay here's some other vocative uses even in linear regression so it's the data and then the model's prediction and then is saying i i'm telling you how far i am under the value another interpretation of algorithm as communication where a given variable x is saying hey slope multiply me",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.716,
    "end": 1687.095,
    "text": " so x times 1.97 and then to the intercept the other part of the mx plus b says add 4.98 and then combine us both or we get combined or i'm the final answer after combining it's sort of like a linguistic approach to describing information flows and algorithms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.442,
    "end": 1719.343,
    "text": " okay so that's the uh linear regression model and this is all from like test linear regression test neural network test active inference palm dp so here in the in the palm dp case um for a given model it's being described in different cases so just to read the sentences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.298,
    "end": 1723.62,
    "text": " I'll just say the model instead of the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.221,
    "end": 1727.204,
    "text": "The model decides which action it takes next, nominative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.265,
    "end": 1732.269,
    "text": "The programmer evaluates the model's performance, accusative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.289,
    "end": 1736.453,
    "text": "The environment gives observations to the model, dative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.473,
    "end": 1741.718,
    "text": "The model's belief about the state guides decision, genitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.738,
    "end": 1745.562,
    "text": "We solve the problem using a model framework, instrumental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.603,
    "end": 1750.427,
    "text": "Different policies exist in the model state space, locative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.572,
    "end": 1777.208,
    "text": " the new algorithm deviates from the standard model approach ablative and hey model what action should I take next vocative so now let's look through those start at the bottom so here is a direct addressment like the sort of digital assistant addressing a model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.673,
    "end": 1782.88,
    "text": " and also which kinds of functions are going to come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.28,
    "end": 1797.222,
    "text": "So this gets towards one of the use cases for having this type of lexical intelligence for modeling is if one expression block or methods block has a bunch of vocatives,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1797.202,
    "end": 1823.158,
    "text": " then you know that for whichever agents are addressed these are the only commands that you need to spin up whereas if it was some other case like it making a prediction or like you know doing forward inference might be a different computational setup than getting trained than getting evaluated so in that way just you could say like what was happening with one actor through a paragraph where they were being referred to in different cases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.138,
    "end": 1851.137,
    "text": " you can trace the same model as it's being referred to within and across sentences in perhaps different ways and different computational setups and build for that okay so here is focusing on the vocative nature of the call and response between the agent and the environment in the nominative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.34,
    "end": 1858.226,
    "text": " So here's the model in determination of what to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.666,
    "end": 1873.648,
    "text": "For example, by doing policy inference like expected free energy policy selection as inference on which actions that I select given the states and those might invoke policy inference methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.278,
    "end": 1905.694,
    "text": " simple two by two matrices for the observation transitions so this is tracing out the decision making process looking at the palm dp as an agent and as it's learning and updating its belief so what and just here just an example animation what is its belief and action conditional upon observation okay in the locative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.497,
    "end": 1935.192,
    "text": " here is using again the um a little bit of a fusion of referring to policies existing in the state space which is pointing to the model's state space so in that way referring to like a location in the model however the location of the of the the location of the state space in the model may be locational so like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.792,
    "end": 1963.035,
    "text": " the location parameter of the model is in three comma four so here referring to the point sp the phase space location so all the kinds of theory and empirical aspects of saying like the the model oscillated around a point attractor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.602,
    "end": 1971.733,
    "text": " or the model made its way from thinking it was a cool day to thinking it was a warm day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.554,
    "end": 1976.119,
    "text": "Those are paths and passages in phase space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.94,
    "end": 1980.746,
    "text": "So those may use verbs of motion or locative in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.65,
    "end": 1989.559,
    "text": "Instrumental, people saying stuff like, we solve the problem using the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.862,
    "end": 1992.904,
    "text": "So showing the model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.491,
    "end": 2003.468,
    "text": " looking at different ways in which the model is used to explore questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.329,
    "end": 2034.231,
    "text": " So making predictions, looking at computational phenotypes, like the magnitude of belief updating or the different aspects of the simulated or actual behavior of model, being used as a tool, looking at different statistical traces from the tool, looking at error envelopes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.016,
    "end": 2069.061,
    "text": " genitive is like the the degenerative ai the generative ai like the output of gpt or the text wrote gpt's text the text wrote by gpt predictions of the model the model's predictions looking at the beliefs of the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.699,
    "end": 2086.527,
    "text": " looking at the collection of them looking at the predictions of the model looking at the beliefs of the model in relation to observations of the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.367,
    "end": 2103.925,
    "text": " or it could be said in relation to observations sent to the model so it'd be like another way to use observation and basically convey the same syntax which is like we all get it it's getting data points but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.187,
    "end": 2118.555,
    "text": " Literally, as it would be with a noun, even though the two expressions, as a function of observations of the model, as a function of the model's observations, is using model in the genitive,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.637,
    "end": 2132.309,
    "text": " as having observations that are possessed by it, or you could focus on the sender of the data and say that the data were sent to, or the observations were sent, or X sent observations to the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.989,
    "end": 2135.632,
    "text": "So those two features might both be true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.672,
    "end": 2137.573,
    "text": "They might be isomorphic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.593,
    "end": 2147.682,
    "text": "They might highlight different features of that setting, but that's just an example of how many ways there are to map",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.662,
    "end": 2170.851,
    "text": " expressions about models model linguistics to models in in theory and practice just like there's a ton of stuff that could be said about a tree and just the tree grows the leaves of the tree people looking at the tree like all those things that are kind of kicked off by prepositions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.468,
    "end": 2189.278,
    "text": " in context all right last ones for the uh palm dp and then to the documents and then to any uh ideas or questions people have here in the data environment giving observations to the palm dp like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.777,
    "end": 2218.877,
    "text": " what its direct indirect object the palm dp gets observations from the environment is having the palm dp doing something getting and then here the environment gives observations to the palm dp so looking at the impact of observations which might describe very well the same graphic or or related graphic as was used just like the mass of the leaves and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.173,
    "end": 2247.632,
    "text": " the branches mass are referring to different levels of analysis of a tree and they're using a different case but they still may be very related measurements and more importantly we're talking about the same tree so this is the same palm dp possibly the same run of the same palm dp but if you start to think about just models as they are spoken",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.899,
    "end": 2271.156,
    "text": " about the kinds of things people say about models like first we designed the model then we use the model to generate this then we sent training data to the model we got the model's errors as it's like that kind of talking about models aspect sometimes refers to the very same model in the exact same situation other times it refers to the same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.592,
    "end": 2274.716,
    "text": " lineage of model being used in different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.497,
    "end": 2291.398,
    "text": "Like if it says we use the model to sweep across this parameter range or parameter range was swept across those kinds of things, but then maybe only some of those parameterized models were taken forward and then they were used to generate predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.418,
    "end": 2298.628,
    "text": "So just it could be a variant of something that was described like not exactly the same single file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.608,
    "end": 2304.323,
    "text": " But in these simple examples, it is like the exact same generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.047,
    "end": 2314.288,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.58,
    "end": 2320.488,
    "text": " So that's a bit about the testing suite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.889,
    "end": 2327.923,
    "text": "And test-driven development is very effective in this kind of augmented coding setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.106,
    "end": 2334.657,
    "text": "It can help lock in a lot of functions, as can good use of Git.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2335.936,
    "end": 2350.958,
    "text": " okay now to the doc section which actually has many many many documents so uh we will definitely not look at all of them but at the top level of the docs folder there's some information about cerebrum I just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.938,
    "end": 2376.996,
    "text": " how works this live stream file um different features about cerebrum maybe these will go into a folder and then there's several folders so starting from the smaller ones uh dialogues these are like 17 different genres of sort of creative dialogue around and about some of these different themes so it's and and possible to to write",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.313,
    "end": 2403.051,
    "text": " more so just to show what that looks like just dragging dialogues in or it could have been at dialogues write a new dialogue that will be very youtube appropriate for all the topics that are referred to in paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.352,
    "end": 2415.387,
    "text": " comma it is a live stream so make it most possible like most youtube live streams do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.337,
    "end": 2420.039,
    "text": " Okay, discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.059,
    "end": 2426.026,
    "text": "This is a few different comments that people have stated related to the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.046,
    "end": 2439.703,
    "text": "And I just responded to the comments in writing and GitHub just because it was easier to express and share it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.08,
    "end": 2468.188,
    "text": " examples uh there's just a few examples and we can revisit this one too um just just this can have a growing number of specific the the linear the linear regression but it's just documents related to examples so here let's let's do a new now there's up to three parallel chats in cursor so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.784,
    "end": 2494.092,
    "text": " let's write examples up for the functional taking an output maybe in the future these kinds of drags will be less needed they they help get it right on the first one linear regression neural network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.404,
    "end": 2511.557,
    "text": " In examples, please make three markdowns comprehensively for the three main tests in output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2515.3,
    "end": 2539.114,
    "text": " have each doc example be comprehensive explain why and how it matters why and how cerebrum and cases come into play show not tell all the kinds of things",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.908,
    "end": 2558.706,
    "text": " pre-addressed that anyone thinking seriously about this would come to wonder initially okay back in the dialogue space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.702,
    "end": 2585.132,
    "text": " so like that once there's a genre within a folder even if it's a hyper meta genre like dialogue um it's possible just say okay or add a new dialogue with this theme okay so that's the examples happening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.783,
    "end": 2589.387,
    "text": " All right, then there's the insects folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.708,
    "end": 2595.398,
    "text": "So some of this may have images that fail to render, but let's look at these in GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.505,
    "end": 2609.702,
    "text": "Okay, so here's just zooming in just a couple layers, just a couple prompts deeper into, all right, how do we apply cerebrum to entomology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.909,
    "end": 2622.939,
    "text": " So just like we were previously talking about the linear regression used as a tool or the predictions of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.76,
    "end": 2628.387,
    "text": "So this is kind of a classic standard entolinguistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.288,
    "end": 2631.691,
    "text": "What do people talk about when they talk about bugs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.933,
    "end": 2641.225,
    "text": "And thinking about what functions, the kinds of things people do and have and will and would say about insects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.28,
    "end": 2669.068,
    "text": " taking a first pass at the syntax of what they said what are those insects being said to do or have done to them or their location etc in that method section or in that natural history report so it's like are we talking about different functional roles different places where in describing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.466,
    "end": 2674.431,
    "text": " function, that natural linguistic case would be used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.417,
    "end": 2700.287,
    "text": "Different speculative insect cases, mixing the sort of hyper-practical discourse analysis, scientific reproducibility avenue, literature annotation, hypercharging, mixing with these speculative cases like talking about the ants' pheromonal implication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.503,
    "end": 2702.706,
    "text": " That's kind of an interesting possibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.428,
    "end": 2710.158,
    "text": "Now it might be morphologically silent in English or some other language, just as other cases are in other languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.959,
    "end": 2716.127,
    "text": "So it isn't even that the words have to be spelled any differently or pronounced any differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.948,
    "end": 2725.402,
    "text": "It could just be a situation where it's understood that the ant as a pheromonal actor or recipient is coming into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.742,
    "end": 2728.907,
    "text": "Maybe these are even over meshed with other linguistic cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.76,
    "end": 2750.929,
    "text": " So different kinds of topics that come up in ants, but different aspects of their activity that kind of give a special spin or clarity or relevance to different ways to talk about an object under different sorts of constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.326,
    "end": 2785.303,
    "text": " looking at the ways in which this big difference amongst languages of the world the nominative accusative distinguishing models acting from models being acted upon regardless of the actions transitivity this might map to systems with clear initiators and responders so the queen lays an egg irrigative absolutive groups models performing intransitive actions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.638,
    "end": 2785.999,
    "text": " e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.019,
    "end": 2794.433,
    "text": "moving, with models receiving transitive actions, accusative, distinguishing them from models performing transitive actions, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.613,
    "end": 2795.715,
    "text": "depositing pheromone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.178,
    "end": 2803.188,
    "text": "This might map to systems where the state change of a model is paramount regardless of whether it caused or received it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.231,
    "end": 2811.021,
    "text": "I'm like, whoa, whole ontological...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.355,
    "end": 2839.658,
    "text": " assertional frameworks where different languages are like falling in different ways across these two different kinds of grammar systems and maybe there are situations where one or the other has a different feature defined as all the ways in which they're different are ways in which they could be different in function or in fitness in a situation okay that's the least technical of them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.789,
    "end": 2867.316,
    "text": " here is applying those kinds of case to pictures like imagine if the case to picture were a suffix or a prefix or a subscript or a font or something like steganographic hidden in the word or it's just a reading lens but it's like the projections of the neurons send data give data to the calyx",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.102,
    "end": 2873.97,
    "text": " So again, it's not the only way to use these parts of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.03,
    "end": 2876.273,
    "text": "It's not associating them with parts of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.814,
    "end": 2889.895,
    "text": "It's like saying there could be method sections that use these regions and describe these processes using this kind of linguistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.507,
    "end": 2920.017,
    "text": " different computational precision parameters and how they are in causal relationship with sort of natural ethological behavioral linguistics about what is happening like this is a classic professor Deborah Gordon point with the space between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.997,
    "end": 2941.448,
    "text": " seeing the nestmate on the ground and then identifying the task it's doing like it is foraging or it's part of foraging and then going from the task identification to the identity assertion like it is a forager but it's like a nestmate that we see nursing is that a nurse",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.457,
    "end": 2950.553,
    "text": " Is it like, is a person who plants trees when they're not planting a tree still a planter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.477,
    "end": 2954.982,
    "text": "That's more classic antilinguistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.443,
    "end": 2957.226,
    "text": "More from the Wittgenstein side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.501,
    "end": 2974.033,
    "text": " So different ways that StigmaG studied all these kinds of scenarios, looking at beehive foraging, looking at the algorithms of the different ways that information flows and processes happen in the relocation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.135,
    "end": 2983.972,
    "text": " Okay, here's more acronyms and puns for more topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.992,
    "end": 2992.073,
    "text": "So in the kind of last section, as we sort of go beyond cerebrum probably today, maybe we can use some of these or another one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.639,
    "end": 2995.081,
    "text": " Insect cognitive architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.502,
    "end": 2995.762,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.604,
    "end": 2999.909,
    "text": "I was happy to see the harvester ants, Pogonomyrmex barbatus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.072,
    "end": 3015.713,
    "text": "So different insect species and ways that they've been studied, even though many or all could be studied for all, but there's just many model-ish organisms that have been studied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.374,
    "end": 3017.436,
    "text": "Well-studied insects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.93,
    "end": 3036.943,
    "text": " looking at how different brain regions are described of if not playing functional roles of using different cases again like are there more mentions in the literature of we injected the dye into the projections of the neurons",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.923,
    "end": 3058.847,
    "text": " or is the just like in the different methods sentences of the statistics paper it was like describing the linear regression or the neural network or the palm dp as getting things done to it or doing things or being used with all of those similarly happen for descriptions of insect brain regions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.464,
    "end": 3066.493,
    "text": " different classical behavioral types, keywords for literature search.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.114,
    "end": 3083.878,
    "text": "Like let's do a literature search on spatial learning plus hymenoptera, pull all those papers, download all the papers, break them into sentences, look at every sentence, do entity extraction, determine what case different entities are in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.38,
    "end": 3087.703,
    "text": "So this is kind of like a formal linguistic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.865,
    "end": 3100.127,
    "text": " complement to statistically driven n-gram learning, like classically just taking large bodies of text and then looking, okay, we can look at the word frequency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.147,
    "end": 3101.069,
    "text": "That's like the one gram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.169,
    "end": 3105.077,
    "text": "We can look at the word co-occurrence, the two gram and going on and on and on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.578,
    "end": 3110.788,
    "text": "And that kind of leads to one thing after another to the attention is all you need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.87,
    "end": 3120.178,
    "text": " which has some kind of engram, like basically the context and the attention mechanisms with a bit more nuance, but a lot like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3123.201,
    "end": 3139.915,
    "text": "Okay, more tables, just linking up different ways that different functionalities, different, you know, what cases would we want to transfer from how we talk about ants in order to be able to say those kinds of things about swarms of robots?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.434,
    "end": 3146.176,
    "text": " Okay, more case studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.179,
    "end": 3153.526,
    "text": "Here is more of a deep dive on insect brain anatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.669,
    "end": 3168.265,
    "text": "So looking at the different sections of the brain in different ways, tables, looking at different adaptations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.497,
    "end": 3186.388,
    "text": " more brain mapping more connection with species behavioral functions neurotransmitters so it's like there's again going to the literature and annotating where those kinds of things are said",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.212,
    "end": 3191.158,
    "text": " And then that is already just sort of the forensic cerebrum approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.259,
    "end": 3193.442,
    "text": "It's just a purely annotative strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.143,
    "end": 3206.303,
    "text": "And then also it implicitly and explicitly involves sketching out these state spaces, even where some of those combinatorics are like grammatically invalid or prohibited for one reason or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.986,
    "end": 3209.228,
    "text": "Okay, not all these work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.869,
    "end": 3210.79,
    "text": "This one doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.588,
    "end": 3232.71,
    "text": " different brain region different insect research that could be done okay then there's two folders with a lot of documents so the first one there is languages so languages first there's a folder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.939,
    "end": 3234.42,
    "text": " Computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.764,
    "end": 3241.14,
    "text": "This has several dozen computer languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.902,
    "end": 3243.145,
    "text": "So let's look at Go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.248,
    "end": 3247.999,
    "text": "We'll just look at one computer language and then mainly at natural languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.396,
    "end": 3265.565,
    "text": " overviews the code, different kinds of use cases, annotates the code with different case annotations on different processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.786,
    "end": 3268.873,
    "text": "So you can see all of these kinds of abbreviations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.478,
    "end": 3297.274,
    "text": " So different ways, just on looking at even just one line of code, one language might say the data is sent to X from Y or Y sends the data to X or just data X Y. Not to go into this on the computer side, but the human languages folder is also very rich.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.452,
    "end": 3302.422,
    "text": " There are a variety of languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.605,
    "end": 3308.677,
    "text": "The README is pretty much updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.379,
    "end": 3310.441,
    "text": "Let's just look at a few.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3310.462,
    "end": 3311.905,
    "text": "Esperanto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.247,
    "end": 3330.4,
    "text": " in the previous stream we looked at how the hungarian case system has onto on and from a surface so sort of perfect for different functionalities of interfaces and and boundaries interslavic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.104,
    "end": 3354.777,
    "text": " Russian English goes into more detail just grammatically and cognitively on some common first and second language learning combinations of Russian and English and why certain failures of language are common cognitively and grammatically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.939,
    "end": 3356.541,
    "text": "Sanskrit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.264,
    "end": 3358.665,
    "text": "Tibetan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.505,
    "end": 3380.105,
    "text": " So Esperanto, overviewing the case, just like kind of more like a grammar textbook, like a really fast summarized grammar textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.125,
    "end": 3386.413,
    "text": "Sanskrit went into a bit more detail here, just several times it would add a couple hundred lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.473,
    "end": 3390.998,
    "text": "I'd say, awesome, add more interesting, funny, useful,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3392.513,
    "end": 3394.296,
    "text": " meaningful sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.498,
    "end": 3416.091,
    "text": "So different case information, different ways that a model like an NLP model could be used according to those cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.753,
    "end": 3439.429,
    "text": " grammatical number one two many where some languages might only have one and many but you know it could be helpful are we talking about a single agent are we talking about the dyadic communication setting or are we talking about the more you know three three's a party",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.514,
    "end": 3463.678,
    "text": " different syntactic speeches features so this could relate to if we have a given model and just we're going to be using python or subscript or special characters or prefix it's like whatever um morphology setting you're in with the model there might be different kinds of of um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.658,
    "end": 3489.328,
    "text": " certain things might be easier to express or others or might have difference consequences all right then just kept on going and just say add more so lots of more um more connection with temporal and modal systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.996,
    "end": 3508.465,
    "text": " like it starts to get into the beyond cerebrum stuff that we'll do in a few minutes but like there are other parts of speech and other linguistic techniques other than case even though cerebrum has focused heavily on case in these kind of two streams slash early versions of the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.445,
    "end": 3520.658,
    "text": " But of course there's a whole bevy of conditionalities and moods and all these different kinds of things, which like could be used to describe even just statistical models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.998,
    "end": 3527.725,
    "text": "Like while this is happening, if that happens, then this will be happening at the same time as viewed from this perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.928,
    "end": 3534.132,
    "text": "So different languages have different natural expressivities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.833,
    "end": 3559.309,
    "text": " ways of modifying how things look and seem some languages modify certain things for sex others don't some modify for number differently they of course have different heritages and connotations and different concepts that are sort of already there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.289,
    "end": 3569.823,
    "text": " And then also, they all have different, and including created contrived semantic systems as well, they have some commonalities and differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.504,
    "end": 3581.839,
    "text": "So for certain kinds of computational semantics, there may be some very small programs or some very secure ways to do this or that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.859,
    "end": 3583.241,
    "text": "And then Tibetan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.261,
    "end": 3583.862,
    "text": "Let's just see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.027,
    "end": 3593.028,
    "text": " Trust systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.372,
    "end": 3596.714,
    "text": "Evidentiality markers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.667,
    "end": 3606.688,
    "text": "Evidential systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.352,
    "end": 3610.975,
    "text": "Direct sensory evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.596,
    "end": 3612.998,
    "text": "General knowledge or inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.799,
    "end": 3615.461,
    "text": "Personal experience or witness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.603,
    "end": 3618.726,
    "text": "With suffixes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.081,
    "end": 3626.029,
    "text": " Direct, indirect, witnessed, hearsay, and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.351,
    "end": 3633.162,
    "text": "Also think about legal ontologies and different ways that this kind of relates there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.884,
    "end": 3635.246,
    "text": "So that's the languages folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.266,
    "end": 3640.917,
    "text": "There's all the computer languages and then, I mean, not every single one, but that is where all of the computer languages are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.897,
    "end": 3661.504,
    "text": " and the natural languages all right last folder to look at is the speculative design so just to show uh kind of similarly here okay just to quickly return to the examples let's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.893,
    "end": 3671.679,
    "text": " Push the GitHub, go to the examples, and then look at the three new that were written just now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.4,
    "end": 3675.602,
    "text": "POMDP, linear regression, neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.006,
    "end": 3688.593,
    "text": "So introduction, laying out, what are all these different cases about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.633,
    "end": 3690.315,
    "text": "How do they apply to the POMDP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.957,
    "end": 3694.258,
    "text": "What does the demonstration do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.365,
    "end": 3702.831,
    "text": " Linear regression, background on linear regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.851,
    "end": 3706.675,
    "text": "Laying out what is different and why it matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.86,
    "end": 3714.662,
    "text": "And the neural network case similarly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.445,
    "end": 3726.253,
    "text": "Okay, in the speculative design folder, we will add one more document.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.766,
    "end": 3748.066,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.509,
    "end": 3751.91,
    "text": "Dragged in speculative design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.315,
    "end": 3776.473,
    "text": "In this folder, write the most vast, vastly layered, comprehensive synopticon of the Shin Dragon, the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.567,
    "end": 3806.19,
    "text": " or I'll just drag in the single markdown output assembled paper write the most and do it most absurdly and information densely in the style",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.976,
    "end": 3832.667,
    "text": " of something that strangely would make a lot of sense to see visually on a live stream about this topic yet be essentially incoherent in the linear reading conveying all the concepts totally",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.763,
    "end": 3853.231,
    "text": " The user wants me to create a new file, assembled paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.255,
    "end": 3862.721,
    "text": "Okay, we're looking at the chain of thought of Gemini, so-called chain of thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.741,
    "end": 3865.323,
    "text": "They want me to create a new file, assembledpaper.md.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.544,
    "end": 3868.106,
    "text": "Not really, I didn't say that title, but let's go with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.548,
    "end": 3870.889,
    "text": "It should be a synopticon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.063,
    "end": 3876.067,
    "text": " It should be visually interesting but incoherent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.129,
    "end": 3880.614,
    "text": "List the files, read the files, synthesize the content, create the file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.176,
    "end": 3883.678,
    "text": "How to make it absurdly layered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.521,
    "end": 3888.906,
    "text": "All these different strategies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.83,
    "end": 3894.654,
    "text": "How to make it incoherent linear reading but make sense visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.976,
    "end": 3897.518,
    "text": "How to convey all the concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.962,
    "end": 3912.587,
    "text": " file list then it lists out the files in speculative design it's like you know it's not exactly what i thought i wanted to know or see but but it's starting to get to a very interesting place",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.862,
    "end": 3928.755,
    "text": " For each snippet, randomly or pseudo-randomly, maybe, based on file order, intersperse headings, bold terms, list items, and short sentences phrase into the main synopticon string.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3929.496,
    "end": 3931.038,
    "text": "Use heavy markdown formatting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.679,
    "end": 3935.244,
    "text": "Prioritize density and visual chaos over linear coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.924,
    "end": 3938.608,
    "text": "Ensure terms concepts from all files are included.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.642,
    "end": 3950.002,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.937,
    "end": 3961.658,
    "text": "Still going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.039,
    "end": 3964.301,
    "text": "This is just the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.721,
    "end": 3965.603,
    "text": "Incorporating elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.623,
    "end": 3974.434,
    "text": "It's like this is doing quite many cycles of thinking, reading, doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.19,
    "end": 3993.604,
    "text": " lots of tokens being generated here but meanwhile let's let's let's let it cook and uh there's a few that are pretty fun here so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4010.543,
    "end": 4032.113,
    "text": " okay so here's a daisy dollyrimple um satire uh free speech usage as they all are where it's a sort of early 1900s detective story",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4032.093,
    "end": 4057.645,
    "text": " and the first part is is just story then it goes into this truly delightful sequence of uh looking at the first off speculating some some ancient origins looking at the difference i'll turn off dark",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.603,
    "end": 4084.678,
    "text": " looking at different hypotheses sort of like this like mystery science theater 3000 reading of a dollyrimple situation talking about how in their case in their situation in their case in their cases how different processes happened",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.886,
    "end": 4110.177,
    "text": " different context shifting different processes that different ways that that then it kind of comes around at the very end to uh highlight the unique values of the different languages and then I believe they they call it a night and have some Hungarian dinner",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.22,
    "end": 4134.46,
    "text": " okay this was one that I just said make a new speculative design document go go somewhere that's that's never been done or something you know glitch ontology and error-based learning so it's like kind of glitch pop which has like a visual and a auditory uh so it's kind of a multi-modal glitch",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.857,
    "end": 4139.142,
    "text": " But it also comes up in programming and it's kind of a digitized format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.223,
    "end": 4153.102,
    "text": "So like different ways that glitch-based methods, we can fix some of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4153.122,
    "end": 4160.633,
    "text": "New tab, glitch ontology, fix and improve all the mermaid diagrams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4166.924,
    "end": 4172.976,
    "text": " This is probably the longest Gemini sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.957,
    "end": 4174.819,
    "text": "Okay, so it ended there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4176.623,
    "end": 4188.325,
    "text": "Continue to refine the synopticon and read all papers and then save the final full file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4200.05,
    "end": 4202.533,
    "text": " Could be slight differences in mermaid rendering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.42,
    "end": 4209.182,
    "text": "But cool idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.602,
    "end": 4211.124,
    "text": "Glitch-based ontologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.605,
    "end": 4219.655,
    "text": "Like ontologies of errors for describing systems that have certain relationship with error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4222.96,
    "end": 4226.344,
    "text": "Okay, this is a very long one, but an extremely worthwhile one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.535,
    "end": 4249.21,
    "text": " looking at William Blake so started with just this bullet point type stuff now starts getting into Blakean engineering like the fourfold vision discussed elsewhere with single vision being like leading up to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.612,
    "end": 4269.932,
    "text": " metacognitive integrations so it's kind of like this is not dissimilar than a three or four layer hierarchical model like thought seeds or Sanved Smith type model and then it just shows like okay which model in that fourfold vision paradigm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.549,
    "end": 4301.556,
    "text": " going into detail like this is kind of like the retinal layer with the convolutional neural networks dropout layers that kind of stuff because it's like the sensory so it's like multi-scale hierarchical architectures possible self-similarity of the two three and four-fold visions in terms of their their capacities going into the zoas looking at cognitive functions of the the integrated albion and the different kinds of functionalities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.536,
    "end": 4325.35,
    "text": " fractal self-similarity with eternity in an hour how would that really get implemented um different cosmological parallels what would really be different with a Blake inspired cerebrum using AI well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.152,
    "end": 4349.059,
    "text": " single objective, contrary balancing, multi-objective to target the creation and maintenance of tension or paradox architecture, detailed architecture, layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.954,
    "end": 4377.477,
    "text": " it's kind of like there's the does this accurately describe what tharmas is in the blakey and ontology it's kind of like a separate question that's interpreting this just as like structured humanities research and just is that uh of the different places this box could be pointing or connected to does that align and and surely there's multiple",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.457,
    "end": 4399.431,
    "text": " uh takes even for one character and then it's like what are the functional attributes of this kind of architecture so what is that transfer path from loose or ambiguous or or multiple or even contradictory poetic description and basically all of these kinds of information processes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.727,
    "end": 4423.782,
    "text": " generation reality layer belua generative layer that's the twofold vision threefold vision golganuza creative layer and then the eden integration layer okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.82,
    "end": 4446.529,
    "text": " there's just too many funny things this this was a funny one the eternity sunrise development so 2025 this very year implement the core zoa's architecture begin contrary processing research so little different spin than predictive processing okay contrary processing research hmm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.319,
    "end": 4473.917,
    "text": " but that's that sort of unity is plural at minimum two research agenda but then that's also the paradox well but then isn't the single objective unity is plural at minimum two so how to hold the one and the two that's like the single and twofold vision then over the years leading to 2029 eternity's Sunrise self-evolving cognitive architecture begin Albion integration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4478.588,
    "end": 4487.687,
    "text": " more sections then really nice process diagrams super information dense",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.933,
    "end": 4518.012,
    "text": " looking at at different and being able to do programmatic generation archetypal description of logistics for perception action cycles so this is kind of like a whole cognitive sequence it's not just saying well there's a for loop that gets an observation and then uh puts out an action or it's like an observation comes in this parallel processing like marriage of heaven and hell status occurs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.312,
    "end": 4547.172,
    "text": " certain sequences happen then there's a back and forth here and then this all etc it could be make a dynamic control flow in the marriage of contraries let's do make a vast comprehensive dynamic control flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.755,
    "end": 4576.112,
    "text": " with massive level of detail of process diagrams something completely capturing the spirit of james joyce",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.307,
    "end": 4600.767,
    "text": " all the most chaotic and river run-esque stuff also do the same in another design file for cerebrum plus infinite jests",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.383,
    "end": 4611.592,
    "text": " Okay, wow, still plugging on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.612,
    "end": 4619.925,
    "text": "Those are almost certainly the two very longest executions I've ever seen from Gemini.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.948,
    "end": 4625.995,
    "text": "For the sheer number of steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.995,
    "end": 4629.256,
    "text": " Okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.038,
    "end": 4632.465,
    "text": "Then the last one before we push those updates, look at the new ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.548,
    "end": 4642.051,
    "text": "This was as per the request of a friend on John D. who lived from 1527 to 1608.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.472,
    "end": 4644.237,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.217,
    "end": 4664.723,
    "text": " i was not extremely familiar with d but this was a really interesting approach that brought together those process diagrams um different kinds of cartography spatial computing time cryptography secure communications so it's kind of like john d's work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.103,
    "end": 4690.643,
    "text": " transferring onto what what was said in that work and what has been said about that work onto the specification of cryptographic or of like esoteric semantic components correspondence tables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.862,
    "end": 4722.03,
    "text": " active inference topics category theory terms different ciphers we can do a whole okay that was okay that was it did the full assembled paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.305,
    "end": 4743.174,
    "text": " Make a vast speculative design document on using cerebrum for cryptographic design, syntax, semantics, cognitive narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4750.826,
    "end": 4752.068,
    "text": "This one halted early.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4760.519,
    "end": 4762.261,
    "text": " Okay, let's look at the assembled paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.714,
    "end": 4787.775,
    "text": "Okay, Synopticon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.475,
    "end": 4804.802,
    "text": " This was prompted again to be incoherent to read out loud, but to give a lot of information when visually looked at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.293,
    "end": 4845.268,
    "text": " okay let's look at those the joyce and infinite chest then we'll look at the live chat if anyone has an idea or a question then go into the sort of beyond",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.281,
    "end": 4858.649,
    "text": " So here it didn't make the file, but that's what's so fun about cursor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.931,
    "end": 4866.141,
    "text": "Put that and improvements and additions into a file with the right name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.825,
    "end": 4873.252,
    "text": "And also this chat is getting long, so that's why there's this start a new chat for better results down there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4875.075,
    "end": 4876.217,
    "text": "Okay, push these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.127,
    "end": 4894.871,
    "text": " Okay, Joyce and Jest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.439,
    "end": 4914.4,
    "text": "Okay, Infinite Jest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.927,
    "end": 4919.788,
    "text": "First one doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.278,
    "end": 4953.083,
    "text": " bayesian funhouse mirrors this sounds clean it rarely is okay and the joists i don't think i can evaluate the details but you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.505,
    "end": 4985.297,
    "text": " it's cool okay and there's the cryptographic that's what you know again it's just it's the concept it's it's the possibility that these spaces can be defined up front or on the fly and they can be passed to the right other agents or people or just generated from scratch or in the future in a better way okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.078,
    "end": 5017.579,
    "text": " okay so the main piece to sort of leave a little snippet of again in this last part it's going to be just a few uh what's next in our path and then if anybody has a idea or a question live chat that they can write it so let's go into a whole new folder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.655,
    "end": 5033.509,
    "text": " Beyond cerebrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5033.529,
    "end": 5034.31,
    "text": "Beyond spec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5046.285,
    "end": 5046.385,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5056.27,
    "end": 5083.172,
    "text": " so given all that information on cerebrum and all it can do with grammatical case let's zoom out and think beyond it let's come up with insects or other inverts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5085.008,
    "end": 5107.101,
    "text": " related acronyms conveying absolute the total scope of what can be considered a quote full linguistic intelligence method",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.279,
    "end": 5136.7,
    "text": " whereby all the parts of language verb noun all parts of speech modes etc are firstly formalized into the kind of operations which flexibly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.861,
    "end": 5141.547,
    "text": " can and do apply to e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.048,
    "end": 5162.181,
    "text": "linear regression neural network Bayesian graphical model then in that case with full formalization we are only in the tip of the iceberg",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5163.747,
    "end": 5188.253,
    "text": " in terms of xeno and exo linguistics firstly come to totally understand that then spec out completely this quote beyond cerebrum efforts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.302,
    "end": 5204.604,
    "text": " Okay, planning a response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5212.475,
    "end": 5212.996,
    "text": "Hormica.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5214.318,
    "end": 5215.019,
    "text": "Hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.039,
    "end": 5216.461,
    "text": "That's a nice ring to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5217.623,
    "end": 5218.244,
    "text": "Myriad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5220.747,
    "end": 5221.328,
    "text": "Mantis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.749,
    "end": 5222.129,
    "text": "Apis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5225.254,
    "end": 5225.754,
    "text": "Locust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5225.915,
    "end": 5226.455,
    "text": "Vespa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5227.217,
    "end": 5227.757,
    "text": "Arachne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.018,
    "end": 5231.182,
    "text": "Silk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.202,
    "end": 5231.723,
    "text": "All good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.474,
    "end": 5237.795,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.922,
    "end": 5242.15,
    "text": "Formica Locust Arachne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.823,
    "end": 5246.826,
    "text": "Let's go with Formica.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.107,
    "end": 5247.428,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.271,
    "end": 5249.475,
    "text": "First idea is the best one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.959,
    "end": 5273.63,
    "text": " Even just pre-writing what I believe or expect I will want to say soon or next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5281.321,
    "end": 5293.097,
    "text": "With all needed files for functions underpinned by the same",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5294.714,
    "end": 5322.139,
    "text": " functions described in core beyond spec document, which is always growing and improving iteratively, such as forensic work describing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.279,
    "end": 5351.586,
    "text": " the lexical environments of a model in time and place in use, all modern machine learning, cutting edge questions, interpretability, scaling, safety, pure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5352.916,
    "end": 5378.873,
    "text": " entomological linguistic pragmatism wow already jumping to the tools that you know it could be a it could be a uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5381.789,
    "end": 5383.872,
    "text": " Wow, I've never seen a chain of thought that looked like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.38,
    "end": 5389.441,
    "text": "Create directory structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5390.764,
    "end": 5397.975,
    "text": "Okay, a source folder within, then update the spec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5401.301,
    "end": 5403.865,
    "text": "Create the innate scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5404.773,
    "end": 5405.714,
    "text": " Add or read me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5405.814,
    "end": 5406.094,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.095,
    "end": 5409.357,
    "text": "Now this is the part I've never seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5409.818,
    "end": 5411.58,
    "text": "Constraint, checklist, and confidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5411.76,
    "end": 5412.681,
    "text": "Follow cursor rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5412.761,
    "end": 5413.061,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5416.184,
    "end": 5417.105,
    "text": "Here's the cursor rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5420.028,
    "end": 5432.62,
    "text": "One funny prompt in another setting was like, write yourself a prompt that will lead you to generate the prompt that will help you generate the greatest, most accurate, relevant, possible cursor rules file set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.953,
    "end": 5464.733,
    "text": " okay so it's like this is kind of where q kids and catechisms come into play which is just developing these sets of questions so oh yeah that's the q78 or like oh you you could you could just use the use the q600 ask all those figure it out you know okay placeholder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.945,
    "end": 5467.348,
    "text": " for a lexical environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.31,
    "end": 5484.848,
    "text": "So for this one, we can download, we could scrape papers or scrape websites and then use anything from rule-based methods to existing software packages to LLM API calls",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5485.334,
    "end": 5496.065,
    "text": " to say, okay, given what we know about cerebrum and whatever this formica or whatever system is, given that, what are the entities, what cases are they in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.592,
    "end": 5502.812,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.835,
    "end": 5512.843,
    "text": "Given the structure now then, comprehensively continue so that all docs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5513.785,
    "end": 5539.525,
    "text": " formal specs of the parenthesis, more than language, formal type, theory, category, calculus, and Bayesian cognitive functions are 100%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.545,
    "end": 5541.328,
    "text": "100%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5562.47,
    "end": 5576.331,
    "text": " It's not sort of where I hope to and will go over the coming little bit with anyone's open source participation if they're interested listening along this far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.445,
    "end": 5586.587,
    "text": "Let's read that doc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5609.905,
    "end": 5610.266,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.269,
    "end": 5621.544,
    "text": "Cerebrum provides a powerful framework for integrating case-based reasoning and Bayesian representations, focusing significantly on the role of grammatical case in structuring meaning and reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5621.644,
    "end": 5626.893,
    "text": "While valuable, case grammar represents only one facet of the complex system that is human or potentially non-human language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.894,
    "end": 5634.445,
    "text": "To achieve a truly comprehensive computational understanding of linguistic intelligence, we must expand our scope significantly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5640.432,
    "end": 5658.475,
    "text": " new chat tab speculative design looking past even future horizons",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.172,
    "end": 5687.854,
    "text": " write a vast comprehensive speculative design doc with valid mermaid diagrams and tabular intelligence about what glial maximalism really means in group discussion only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5695.057,
    "end": 5695.337,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5700.605,
    "end": 5702.167,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5702.187,
    "end": 5704.971,
    "text": "Define base types for fundamental linguistic units.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5705.311,
    "end": 5720.693,
    "text": "Phony, morpheme, lexical item, syntactic constituent, semantic concept, pragmatic concept, composite types, dependent types, connections to formal grammar frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5727.592,
    "end": 5754.493,
    "text": " laying out those types research challenges relation okay but just continue i'll start a new chat for better results continue compre intensively with developing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5764.16,
    "end": 5786.067,
    "text": " have all needed documents in fractal docs folder, have all source code and tests start running and developing the full simple modular test suite now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5801.858,
    "end": 5802.279,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5811.052,
    "end": 5812.233,
    "text": "Okay, question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.716,
    "end": 5819.845,
    "text": "What kind of predictions might you have about case uses across disciplines, experience in the field or experience with the language?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5821.107,
    "end": 5824.472,
    "text": "What would it reveal if case use was different across groups?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5828.477,
    "end": 5828.878,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5830.799,
    "end": 5856.672,
    "text": " and another question live chat can we can we mechanically deform the cranium to 10x the cerebrum um probably but you probably couldn't get it back tucker",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5859.082,
    "end": 5862.789,
    "text": " But I think with a 3D printer and a shipping container, it could be possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.216,
    "end": 5868.6,
    "text": "What would it reveal if case use was different across groups?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5869.863,
    "end": 5877.698,
    "text": "Yeah, there'd be so many interesting topics, like the discovered slash invented...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5879.264,
    "end": 5901.762,
    "text": " question of case to what extent are to on at from of an object fundamental aspects of semantics are there other fundamental aspects of semantics that we get through or get around in human language in other ways i think that at the very least a first step not the only first step um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5901.742,
    "end": 5928.795,
    "text": " not not not a last step but a first step is this kind of beyond cerebrum approach where it's like first get the full interoperable category theoretic calculus type you know algebra etc etc etc for all the languages that we know about partially to scaffold and improve the fluency of people and llms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5928.775,
    "end": 5957.044,
    "text": " partially to understand well what are all the state spaces and then if we find that there's something where there's always exactly three in every language even if they were all the same we could still say like well what if it was four or maybe we'll find that there's um one two and many for marking numbers in one language and another one it's one two three and many another one it's just one and many or another one doesn't have that distinction it's like any of those even just seeing two examples is kind of like the arc challenge it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5957.513,
    "end": 5962.962,
    "text": " You see that this could have been this way or that way, and then there's a whole state space that it could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5962.982,
    "end": 5972.778,
    "text": "So there could be a special numerosity for multi-agent models where it's like there's a subscript for how many agents there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5973.279,
    "end": 5983.335,
    "text": "But it can have 50 subscripts coming out of every corner, different fonts, all these different kinds of modifications, and that's just typographically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5984.935,
    "end": 5997.292,
    "text": " let alone how it's spoken or how it gets rendered computationally, where it doesn't even need to be limited by how many suffixes can you add or how many subscripts would make sense in your word processor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5997.332,
    "end": 6002.378,
    "text": "It's about these higher order modifications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6002.919,
    "end": 6012.512,
    "text": "So when people say, I'm talking about sending the data to the Affective Active Inference Models API,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.808,
    "end": 6027.627,
    "text": " That could be something that gets fully fleshed out, maybe static analysis on certain components, but certainly for scientific integrity, full reproducibility, understand what is that category of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6028.289,
    "end": 6029.472,
    "text": "And so that is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6029.452,
    "end": 6058.783,
    "text": " the curious language of the incidents which is for the incident which motivates languaging what is the curious languages that let that semantics get communicated okay some more great questions from tucker we will make documents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6060.721,
    "end": 6080.974,
    "text": " okay okay it seems like human language taking a survey of different semantics and grammars around the world doesn't need case and that even semantic density is not specifically correlated to case versus no case structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.359,
    "end": 6099.148,
    "text": " Yeah, it's highly possible that by kind of sandpapering the language of the exoteric markers of case, like English for the most part, it could be associated causally or just correlationally with an increased or decreased information density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6099.736,
    "end": 6120.563,
    "text": " so consider different ways like per phoneme um whereas like if you're doing stem modifying like a slavic language then maybe there's only so many modifications that you can overlap if you're doing suffixing then maybe you can have more but you know suffixing might lead to very long symbol density",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6121.37,
    "end": 6135.924,
    "text": " Then again, if there's a certain number of symbols that are needed for the subscripting, I don't think there's a single answer, especially in the absence of empirical evidence in our hands and mandibles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6136.465,
    "end": 6148.997,
    "text": "But we could say, write a speculative design dissertation summary of all the situations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6150.158,
    "end": 6175.862,
    "text": " where human languages with and without different case systems would and would not have different information densities and designs considered at syntax, semantic, narrative, cognitive levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6180.736,
    "end": 6208.92,
    "text": " okay fill in all placeholder methods dart to run log confirm the test suite for formica okay glial maximalism oh wow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6211.06,
    "end": 6218.032,
    "text": " being a little bit recalcitrant to write this document, despite its absolutely benign cellular nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.102,
    "end": 6235.101,
    "text": "Write that and improve that into a file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6235.121,
    "end": 6235.482,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6238.499,
    "end": 6242.705,
    "text": " Okay, Tucker wrote, why do so many ancient languages Sanskrit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6242.725,
    "end": 6244.347,
    "text": "I don't know what Usarti is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6245.108,
    "end": 6245.729,
    "text": "Usakri.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6247.972,
    "end": 6248.473,
    "text": "Uskari.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6251.297,
    "end": 6254.181,
    "text": "Oh, thank you for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6254.341,
    "end": 6258.086,
    "text": "We should add this to languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6258.106,
    "end": 6259.628,
    "text": "Oh, it is there as Basque.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6260.55,
    "end": 6261.05,
    "text": "Uskara.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6266.338,
    "end": 6267.359,
    "text": "Why do they have nutshell?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6267.459,
    "end": 6268.0,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6277.345,
    "end": 6305.378,
    "text": " now fully write out that dissertation tons of tabular formatted crystal good stuff information vast technical mermaid diagrams unique explanations and predictions unknown",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6308.159,
    "end": 6337.052,
    "text": " and under known through linguists in 2025 wow still still dragging heels on the glial component maybe switch to clot oh great question great question let's ask perplexity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6341.572,
    "end": 6349.051,
    "text": " Okay, Tucker wrote, are any modern languages in widespread use gaining in case complexity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6350.615,
    "end": 6353.202,
    "text": "Let's do the perplexity research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6372.149,
    "end": 6395.608,
    "text": " base evolution today dot md okay that's interpreting that okay oops",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6399.065,
    "end": 6428.38,
    "text": " research and fully empirically address this question from my good friend the answer must ring in his ears like gold and silver and he is a refined listener he expects only the finest information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6435.11,
    "end": 6435.39,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6436.412,
    "end": 6437.574,
    "text": "Meanwhile, perplexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6440.76,
    "end": 6443.845,
    "text": "Let's do the slower or the faster mode of perplexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6445.909,
    "end": 6446.229,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6455.766,
    "end": 6456.848,
    "text": "Yeah, that would be a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6460.169,
    "end": 6463.833,
    "text": " This is kind of one approach that could be used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6465.515,
    "end": 6469.379,
    "text": "Beast, which is Bayesian evolutionary analysis by sampling tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6470.561,
    "end": 6472.523,
    "text": "Let's write out this document.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6472.543,
    "end": 6479.491,
    "text": "This is going to be beast case analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6481.253,
    "end": 6481.433,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6485.998,
    "end": 6488.421,
    "text": "I'm just going to copy in just one paragraph about beast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6494.611,
    "end": 6520.939,
    "text": " we have so much good stuff happening though okay that one will finish soon that one will finish soon let's just see where it got with the development yeah making good progress on formica okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6523.147,
    "end": 6552.85,
    "text": " with this description of beast write up a fully technical nsf postdoc proposal for using cerebrum and formica parentheses look them up if you need",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6557.015,
    "end": 6584.693,
    "text": " to do ancestral state bayesian phenotypic reconstruction of ancients linguistic elements we are going way into the past we will use generative ai as needed for creating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6586.225,
    "end": 6614.629,
    "text": " creating fluent text audio and visual media given the explicit probabilistic models and empirical data we will be compiling and inferring on ancient and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6615.824,
    "end": 6638.878,
    "text": " contemporary languages okay glial maximalism oh it's okay it says it's for internal discussion only i feel like i could share it here though but we'll reset that chat go back to gemini",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6642.402,
    "end": 6648.428,
    "text": " write it out fully, the full postdoc application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6649.489,
    "end": 6649.91,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6656.056,
    "end": 6656.977,
    "text": "Okay, glial archetypes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6658.418,
    "end": 6659.9,
    "text": "Oh, this will look better on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6670.51,
    "end": 6672.072,
    "text": "Okay, test infrastructure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6673.469,
    "end": 6676.833,
    "text": " Okay, we stop the agent after 25 calls, continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6685.003,
    "end": 6685.683,
    "text": "Look at the glial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6697.838,
    "end": 6703.324,
    "text": "Tests, developing, writing that postdoc application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6708.282,
    "end": 6710.345,
    "text": " Okay, but to Tucker's question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6712.488,
    "end": 6717.916,
    "text": "Most linguists agree that human languages tend to simplify their case systems over time rather than develop more complex ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6718.097,
    "end": 6724.366,
    "text": "Of course, just like in genomic and phenotypic settings, it's like, but then how is there a more complex one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6725.487,
    "end": 6730.395,
    "text": "The historical trend seen in Indo-European languages has been towards case reduction, not expansion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6731.697,
    "end": 6734.26,
    "text": "Latin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6734.281,
    "end": 6735.302,
    "text": "Old English.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6735.738,
    "end": 6739.503,
    "text": " Old East Slavic and Sanskrit, all of them have dropped in cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6741.967,
    "end": 6744.731,
    "text": "Are we buying the dip with respect to case number?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6744.831,
    "end": 6745.232,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6745.452,
    "end": 6746.694,
    "text": "Maybe it could go down further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6748.256,
    "end": 6750.579,
    "text": "Not financial advice, not linguistic advice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6752.041,
    "end": 6752.923,
    "text": "Okay, counter evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6753.183,
    "end": 6760.193,
    "text": "Virtually no documented examples of modern widely used languages that have developed more complex systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6765.775,
    "end": 6792.222,
    "text": " as Anatoly Levenchuk wrote in languages cases usually die out it's a known process why would they appear instead of disappearing right why would they appear instead of disappearing absolutely perplexity let's see there's no strong evidence that a modern language but but but could could a language with more cases gain more popularity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6795.745,
    "end": 6823.525,
    "text": " are any languages getting keys but english is right now rare but possible oh they debate about mandarin chinese okay deeper research okay but you now you you know what i am going to ask next if that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6824.534,
    "end": 6849.006,
    "text": " case reduction is such a slam dunk that it is pervasive today, give me the most complete account of how those complex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6850.893,
    "end": 6869.863,
    "text": " many haste systems ever even came to be okay glial cells",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6871.598,
    "end": 6898.635,
    "text": " okay so centering the role of the glia and then there's the neuronal processing layer but it's like we don't really talk about those in glia science it's more about the kind of multiple types of glia microglial criticism okay so that's kind of like the feedback okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6900.472,
    "end": 6921.552,
    "text": " centering the role of the oligodendrocyte between neurons using formica in the sort of neural semantics of glial okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6925.312,
    "end": 6950.847,
    "text": " emergence of elaborate case paradigms and languages such as proto-indo-european pi sanskrit and finno-ogric languages involve layered grammaticalization processes and socio-linguistic factors the pi case system so this is the one that is mostly used in cerebro the system likely arose through spatial and semantic differentiation but i repeat myself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6951.468,
    "end": 6952.71,
    "text": " Analogical extension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6953.471,
    "end": 6956.174,
    "text": "Case markers originally tied to specific semantic roles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6957.996,
    "end": 6961.261,
    "text": "Instrumental for tools expanded to abstract syntactic functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6962.422,
    "end": 6963.664,
    "text": "Phonological reinforcement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6964.064,
    "end": 6970.833,
    "text": "Sound changes eroded distinctions between stems, prompting speakers to innovate new markers to avoid ambiguity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6977.782,
    "end": 6979.264,
    "text": "Stable case systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6980.493,
    "end": 7004.374,
    "text": " oh some languages did have expanded case complexity i mean like maybe hungarian or some of these other ones the date of plural um persisted due to its role in marking indirect objects yeah interesting but a little little but but that's exactly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7006.21,
    "end": 7017.184,
    "text": " That's exactly what we can analyze with this postdoc application that we're writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7019.687,
    "end": 7025.134,
    "text": "Just like you could use Beast to look at the genomic or phenotypic patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7028.339,
    "end": 7031.382,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7031.402,
    "end": 7035.728,
    "text": "Run the full Formica Pest Suite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7038.323,
    "end": 7068.043,
    "text": " develop and improve the formica tests methods visualizations animations documentation okay okay vastly expand the nsf postdoc application add",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7070.622,
    "end": 7083.338,
    "text": " comprehensive tables, specific explanations and predictions in huge, valid mermaid diagrams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7093.871,
    "end": 7096.174,
    "text": "Okay, still plugging away on Formica.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7101.098,
    "end": 7113.91,
    "text": " Okay, we're going to get this postdoc application done, read it on GitHub, see if anyone else has any questions or ideas in the live chat, and then call it a day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7144.045,
    "end": 7144.345,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7152.236,
    "end": 7152.516,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7154.579,
    "end": 7157.663,
    "text": "Develop everything fully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7159.706,
    "end": 7172.263,
    "text": "Run and improve that test suite, which yields full computations and visualizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7183.398,
    "end": 7183.618,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7183.638,
    "end": 7186.623,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7187.284,
    "end": 7190.528,
    "text": "Just save that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7198.58,
    "end": 7207.212,
    "text": "A few improvements on this kind of stuff with like the need to reapply tools and better situational awareness for the code base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7208.609,
    "end": 7221.741,
    "text": " reading folder structures kind of doing better in uh that could be partly in cursor partly uh other other approaches all right speculative design beast",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7242.68,
    "end": 7248.445,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7248.465,
    "end": 7254.451,
    "text": "Reconstructing ancient linguistic phenotypes using integrated Bayesian modeling and case-based reasoning enhanced by generative AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7261.958,
    "end": 7262.779,
    "text": "Okay, intellectual merit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7268.304,
    "end": 7270.206,
    "text": "Pioneering the use of generative AI",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7271.283,
    "end": 7273.346,
    "text": " Specific generative AI model name, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7273.386,
    "end": 7275.128,
    "text": "GPT-4 Tacotron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7277.25,
    "end": 7277.711,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7279.734,
    "end": 7282.397,
    "text": "It is an end-to-end text-to-speech Tacotron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7284.68,
    "end": 7285.561,
    "text": "Broader impacts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7293.551,
    "end": 7293.651,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7294.112,
    "end": 7295.974,
    "text": "Oh, that's going to cost you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7304.813,
    "end": 7334.365,
    "text": " foible yes lexicon swadesh lists perfect it's like there's just so much to learn a lot of it is out there a swadesh list is a list of forms and concepts which all languages without exception have terms for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7340.707,
    "end": 7342.81,
    "text": " Okay, new file just dropped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7344.792,
    "end": 7346.434,
    "text": "Swadesh lists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7352.562,
    "end": 7358.951,
    "text": "Yes, run the test suite and add tests that show off and visualize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7362.095,
    "end": 7362.555,
    "text": "More like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7364.338,
    "end": 7366.18,
    "text": "New chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7366.2,
    "end": 7370.005,
    "text": "Write a Swadesh list for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7371.875,
    "end": 7399.958,
    "text": " cerebrum and formica as language okay thank you tucker then write another file meta swadesh list markdown both maximum length and accuracy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7409.337,
    "end": 7430.333,
    "text": " yeah cursor writing these terminal commands running the pi test by itself super big speed up super effective okay hyper swadesh that could be next morris swadesh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7434.802,
    "end": 7453.857,
    "text": " he started with a list of 215 meanings falsely introduced as a list of 225 meanings in the paper due to a spelling error yeah hate to see that happen whoa",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7461.312,
    "end": 7487.995,
    "text": " wow great great topic to have okay this is the swadesh minimal minimal terminology who what what where when all could be associated develop further and furthermore",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7490.067,
    "end": 7516.142,
    "text": " the swadesh list include all swadesh terms and add case annotation okay then the meta meta swadesh well then okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7516.477,
    "end": 7522.624,
    "text": " Clearly, there has been a kind of misunderstanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7524.126,
    "end": 7537.602,
    "text": "A metaswadesh list is like a swadesh list for such lists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7539.184,
    "end": 7542.248,
    "text": "A list of all the criterion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7544.81,
    "end": 7564.658,
    "text": " you'd use in the production or inference productions or inference of a swadesh list coming to a file near you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7582.002,
    "end": 7584.105,
    "text": " Okay, Formica is up and running.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7586.609,
    "end": 7590.695,
    "text": "Add a visualization script for Formica.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7593.019,
    "end": 7608.482,
    "text": "Ensure that running the test suite yields copious, accurate visualizations and .gif.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7614.689,
    "end": 7614.969,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7617.193,
    "end": 7626.327,
    "text": "You're doing okay with the Swadesh lists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7628.43,
    "end": 7628.671,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7636.062,
    "end": 7641.911,
    "text": "Let's look at the first, the layer one Swadesh list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7641.931,
    "end": 7642.452,
    "text": "The L1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7645.79,
    "end": 7674.717,
    "text": " yes perfect like this is the basis of what we need for formica which is what what are the what are the 200 or so concepts that we need in formica for total ant colony modeling what are their parts of speech",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7676.975,
    "end": 7699.624,
    "text": " here nest core their forage zone so it's like home and away like over here over there many many mandibles other alien scents one two three four five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7700.903,
    "end": 7729.324,
    "text": " i guess you don't even need six maybe you call that just like legish or something okay different different um different creatures in the nest okay body parts actions natural colors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7730.502,
    "end": 7757.826,
    "text": " adjectives directions great okay okay now we're on the right page with the meta swadesh list now write that meta swadesh list fully",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7758.245,
    "end": 7761.689,
    "text": " 200 concepts or so please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7768.839,
    "end": 7770.641,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7770.661,
    "end": 7778.211,
    "text": "Run the test suite, confirm and log where visualizations are made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7785.042,
    "end": 7786.164,
    "text": " Okay, I understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7786.684,
    "end": 7793.114,
    "text": "You want a significantly more detailed and exhaustive breakdown of criteria, principles, and considerations related to Swadesh lists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7798.021,
    "end": 7798.282,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7800.545,
    "end": 7800.645,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7805.152,
    "end": 7810.56,
    "text": "Our next album.md.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7813.966,
    "end": 7815.128,
    "text": " Okay, new chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7819.934,
    "end": 7824.781,
    "text": "Prediluvian Superswadesh is the name of our next album.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7826.504,
    "end": 7831.45,
    "text": "Write out all the song names and lyrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7836.678,
    "end": 7842.606,
    "text": "And in callouts, describe the bat sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7846.923,
    "end": 7849.947,
    "text": " Meta Swadesh list, we're there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7854.912,
    "end": 7858.216,
    "text": "It really did go up to 207.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7858.417,
    "end": 7872.373,
    "text": "See also external resources on Swadesh lists, lexicostatistics and glottochronology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7877.163,
    "end": 7882.612,
    "text": " write another comprehensive document on glottochronology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7894.571,
    "end": 7898.337,
    "text": "Okay, 27 tests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7898.538,
    "end": 7904.267,
    "text": "Looks like Beyond Cerebrum is coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7913.377,
    "end": 7915.041,
    "text": " Let's see where it's saving things to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7917.928,
    "end": 7928.314,
    "text": "Yes, run the script and then run a terminal command to confirm where the visualization is saved to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7934.707,
    "end": 7955.77,
    "text": " glottochronology is a controversial method within historical linguistics that aims to estimate the time depth since two or more related languages separate from a common ancestor it attempts to do this by quantifying the degree of lexical replacement within a specific subset of core vocabulary yeah i think bayesian methods could help a lot there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7963.36,
    "end": 7985.25,
    "text": " okay our album we're gonna look at this album on github all right this is gonna be this will be the last piece i think people get it it's possible to um go beyond cerebrum in like a 20 minute period",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7994.731,
    "end": 8023.573,
    "text": " okay we'll close with this the pre-diluvian super swadesh so it speaks first primordial murmur obsidian shards on the shore the cartographer's dream that's an instrumental occasional occasional sonar pings or distorted radio static hint at failed surges and forgotten geographies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8024.887,
    "end": 8045.697,
    "text": " whispers from the ziggurat's core arc construct gopher wood and pitch 40 days delusion dissolution ararat landing new soil old sun well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8057.962,
    "end": 8066.976,
    "text": " hope this has been a uh interesting stream for people uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8078.296,
    "end": 8102.38,
    "text": " it's all Creative Commons by NCND so if you want to work on it feel free to make contributions to the repo if you want to collaborate on a future part of the formica stack there's uh there's always a always a way and we should be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8107.473,
    "end": 8108.735,
    "text": " We should be on our way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8132.937,
    "end": 8133.177,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8135.063,
    "end": 8135.725,
    "text": " That's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8135.746,
    "end": 8138.014,
    "text": "Looking forward to people's comments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8138.134,
    "end": 8143.514,
    "text": "Thank you, Glea Maximalist and Jeff and Tucker for the live chats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8144.799,
    "end": 8146.284,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8146.304,
    "end": 8146.525,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]