[
  {
    "start": 2.63,
    "end": 2.97,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3.811,
    "end": 4.692,
    "text": "Welcome back, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5.853,
    "end": 7.875,
    "text": "It is October 17.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8.996,
    "end": 13.12,
    "text": "And we're in our second discussion on chapter two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 14.462,
    "end": 17.625,
    "text": "So let's head over there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 17.665,
    "end": 26.634,
    "text": "And first, does anybody interesting little colors were added?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.497,
    "end": 30.898,
    "text": "Does anyone want to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.752,
    "end": 43.581,
    "text": " give any opening thoughts or reflections on chapter two, or just bring up some question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 51.768,
    "end": 62.117,
    "text": "So I can share a briefly experience too, in comparison to the previous sections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 63.008,
    "end": 65.451,
    "text": " It took me longer for sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 65.491,
    "end": 81.994,
    "text": "And I had to do more, search for more reference material because I think it's the first section that's really trying to introduce the mathematics of the framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 83.596,
    "end": 90.906,
    "text": "And the first part where we're discussing variational free energy,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 91.493,
    "end": 102.084,
    "text": " which is only taking into account information about the past and the present to compute free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 102.124,
    "end": 107.85,
    "text": "This was relatively straightforward.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 107.87,
    "end": 121.264,
    "text": "I think the section on expected free energy is a more significant leap, and I think I need to spend more time",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 122.932,
    "end": 134.785,
    "text": " uh, analyzing that and, and really making sense of, of that part of, of the chapter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 134.805,
    "end": 135.166,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.286,
    "end": 135.726,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.746,
    "end": 139.57,
    "text": "Anyone else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.59,
    "end": 150.002,
    "text": "What, again, just any part of two that stuck with them or a question they have or, uh, a thought on the role of the low road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.179,
    "end": 182.74,
    "text": " I will just echo the sentiment that I think I finally, you know, got the handle on free energy as a concept, but the expected free energy is still completely impenetrable, making that cognitive leap is still a little bit beyond my reach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 185.42,
    "end": 209.993,
    "text": " cool we can definitely look over it okay at the at the uh at the very small font overview we have perception as inference so it's still passive ish even though we can discuss there are some ways that action is related to even what might be seen as passive inference background on Bayesian statistics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 211.12,
    "end": 239.727,
    "text": " example on the background on bayesian statistics which we can look at again but there's an object in a person's hand and they're updating their beliefs about what they think that object is based upon what they observe it might be an apple it might be a frog and then they see it jump and they update their belief from thinking that it's probably an apple to probably a frog um that case is carried through in the exact bayesian setting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 240.044,
    "end": 247.795,
    "text": " And for smaller state spaces and smaller scale computational problems, you can utilize exact Bayes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.917,
    "end": 254.405,
    "text": "However, for larger state spaces, you can't always do exact Bayes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.586,
    "end": 266.642,
    "text": "And so that requires an approximation method and variational free energy or the evidence lower bound is a common approximation method.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.909,
    "end": 290.014,
    "text": " doing variational bayesian inference um doing approximate bayesian inference is then mobilized in this particular partition cybernetic setting which leads to a discussion of action still we're in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.602,
    "end": 299.715,
    "text": " cybernetic setting, continuing to discuss perception and action as part of this unified approximation challenge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 301.258,
    "end": 305.264,
    "text": "Then we get to the real equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.284,
    "end": 308.188,
    "text": "Equation 2.5 and 2.6 are like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 308.945,
    "end": 330.16,
    "text": " the two key equations in this chapter 2.5 is the variational free energy so here is where we have um the ability to build on people's work previously and also make massive massive um contributions with our studying here in 2.5",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 333.093,
    "end": 362.087,
    "text": " previous cohorts have used the ontology to provide natural language descriptions of the equation so if this just looks like a lot of symbology then it may be helpful to read the ontology description of it 2.5 variational free energy is about beliefs and data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 362.708,
    "end": 371.119,
    "text": " So variational free energy is like the real-time sense-making vibe check.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 372.26,
    "end": 377.607,
    "text": "It's very closely related to how surprising incoming observations are given beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 381.612,
    "end": 384.776,
    "text": "Some more discussion on how the KL diversions comes into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 386.739,
    "end": 389.442,
    "text": "And then it goes from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 389.86,
    "end": 416.509,
    "text": " consideration of the real-time variational free energy into the future oriented expected free energy and planning as inference with equation 2.6 but that's not something that all cognitive systems necessarily do not all systems engage in explicit planning and then there's some discussions about special cases of expected free energy and that's the end of the low road",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.468,
    "end": 435.43,
    "text": " So chapter two pretty much starts with a simple exact base setting, slides over to the approximate variational case, applies it to cybernetics, and then introduces the two key equations in 2.5 and 2.6, variational and expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.951,
    "end": 446.563,
    "text": "Just to kind of give an overview, but like, so as you have highlighted, like those are the exact things to pick up in the low road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.155,
    "end": 461.851,
    "text": " So, anyone else wanna just bring up any thought or question or what area can we go to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 464.054,
    "end": 477.833,
    "text": "Yeah, I think maybe before we move on to the more technical details, I think it's important to highlight the significance",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 478.302,
    "end": 484.331,
    "text": " of this jump, like it's a conceptual leap that was very striking to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 484.491,
    "end": 490.6,
    "text": "And I think I have to spend some time studying this kind of area.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 490.8,
    "end": 494.105,
    "text": "It's it becomes kind of intuition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 494.165,
    "end": 505.862,
    "text": "But but this idea of perception as inference in contrast to what at least throughout my life, the way that I've thought about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 506.45,
    "end": 523.38,
    "text": " seeing things has been this straight transaction from from objects in the world to just lights on my retina and then some processing through my brain and then just kind of this image being projected somewhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 525.825,
    "end": 529.892,
    "text": "But the predictive aspect, the inferential top-down",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 530.26,
    "end": 559.238,
    "text": " component of it is is i think is a remarkable idea and it's interesting that um this isn't it's not really something that you can tell at least i i have couldn't couldn't tell just by observing how i look at the world at least not not earlier in my life so so i'm",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 560.315,
    "end": 584.297,
    "text": " i just wanted to highlight that as a as an interesting uh but significant like a significant leap i think in in thinking about perception yes sarah and then anyone else hello i have a disclosure a comment and a question so my disclosure is i read the wrong chapter",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 584.716,
    "end": 588.241,
    "text": " I missed two weeks, so I thought I'd missed two chapters, but obviously I didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.182,
    "end": 593.388,
    "text": "I did read this chapter, but I read it like six months ago, so I'm just flicking through very fast now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.408,
    "end": 594.249,
    "text": "So that's my disclosure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.61,
    "end": 596.613,
    "text": "My comment is, yeah, I totally get the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.633,
    "end": 602.661,
    "text": "It's such a it's such like a flip to go from this idea of light coming in your eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.681,
    "end": 607.448,
    "text": "I remember in primary school being told off for doing it the wrong way, feeling like light goes out and she's like, no, it goes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.488,
    "end": 611.854,
    "text": "And like we we kind of grow up with this idea like we're sensory machines, but then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.834,
    "end": 628.915,
    "text": " i feel like once you make the flip it's all predictive it's really actually hard to go back and like not see it anymore and then my question was so is it i guess it does relate to this chapter which is lucky because you know that's what we're actually on so like to figure 2.5 right so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.895,
    "end": 648.372,
    "text": " you've got this idea of the perception and the action and one thing I've been struggling with is the how they're different right because perception changing your perception is actually an internal action so it's you're updating a model well what's that that's changing a synaptic way that's an action but it's just being performed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.352,
    "end": 672.081,
    "text": " internally so one thing I've didn't realize I was struggling with this till today is uh yeah how why is perception separate to action and I know like the idea is it's a unified theory of perception action but why do we still have those and how are they different am I missing something so thank you yes yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.529,
    "end": 678.455,
    "text": " Okay, how are perception and action similar and different and related?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 678.495,
    "end": 679.817,
    "text": "Okay, and Christoph?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 683.862,
    "end": 686.726,
    "text": "So I just want to say kind of a couple of things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 686.746,
    "end": 698.14,
    "text": "I like this idea of this, what Sarah just said about light going out, rather than, it reminded me of a quote from Kierkegaard, that life has to be lived forwards, but can only be understood backwards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 698.661,
    "end": 702.085,
    "text": "And there's something about the way we explain the world,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 703.516,
    "end": 708.963,
    "text": " you know, to ourselves or others that has this kind of like inversion quality to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 709.023,
    "end": 717.272,
    "text": "And I kind of I can't put my finger on it precisely, but I see it as a kind of some kind of universal phenomenon that's lurking there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 717.873,
    "end": 727.785,
    "text": "But about this leap from perception to to inference, I remember one of the earlier papers by Carl Fristen,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 727.765,
    "end": 751.09,
    "text": " he mentioned something really fascinating and he mentions the hubel and weisel um uh experiments with um a cat retina I don't know if you um if all of you are familiar with that but they basically were shiny like um uh onto cats uh retina anesthetized cat and measuring response from some um um some neuron there for you know uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 751.07,
    "end": 779.22,
    "text": " measuring electric response and they found these uh receptive these ideas receptive fields that responded to various kinds of orientations and and and so on and the interesting phenomenon that they couldn't explain was end stopping so when you have a receptive field you know like it will it will respond to the specific neuron will respond to some specific orientation and specific length of the um of the rectangle that they were projecting but when the rectangle gets wide enough it stops",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 779.538,
    "end": 799.217,
    "text": " And the question was why, and neuroscience couldn't quite explain this, but the predictive framework, I remember Carl mentioned that in one of his papers, it starts to suddenly make sense because in nature, you don't really see short lines.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 799.197,
    "end": 803.725,
    "text": " So when you're looking at the horizon, it's always a very, very long line.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 804.105,
    "end": 808.072,
    "text": "But if it becomes shorter, then it's something that does not occur in nature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 808.432,
    "end": 812.419,
    "text": "And therefore, the neuron fires because it actually is a prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 813.441,
    "end": 823.838,
    "text": "So it's kind of fascinating that this inversion of this idea suddenly made the phenomenon explainable, which I thought was really, really interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 828.492,
    "end": 843.312,
    "text": " yes so first this uh like coming in and out of the eye um it is really a different view on perception",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 844.591,
    "end": 863.089,
    "text": " when as um was brought up like whether we think about well there's this unrolling generative model that's getting light touches from the sensory information getting fine-tuned that's the sort of like inside out view of experience",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.778,
    "end": 866.301,
    "text": " as opposed to a sensory processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.481,
    "end": 885.324,
    "text": "I mean, sensory processing, even as a framework, makes it sound like the information is out there and we're going to like process the wheat, separate the wheat from the chaff, and then we're going to end up with like just the real, you know, we're going to have the pixels on the camera and then we're going to process the pixels and figure out whether it's a cat or a dog.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 886.004,
    "end": 890.73,
    "text": "Or even further, like we're going to process the pixels and then we're going to figure out what to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.71,
    "end": 897.822,
    "text": " as opposed to we're going to have this unfolding model about how things are and their likelihoods and what to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 898.083,
    "end": 900.768,
    "text": "And then we're going to get just light touches from sensory data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.669,
    "end": 911.807,
    "text": "And I guess the trip is that if we believe that sensory processing is outside in,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.973,
    "end": 939.195,
    "text": " world will confirm our beliefs i think there's a few truth drops just in the visual experience that help us understand the inside out perception so the first is the blind spot which we don't attend to it's filled in perfectly even though there's a large um patch on the retina that doesn't get that much visual input second one is that in the periphery there are uh fewer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.361,
    "end": 961.2,
    "text": " um there's lower resolution vision and there's no color vision however in healthy vision we have color and equal resolution and there's experiments that show like actually well it is lower resolution in the periphery but it's not intended to as such and then we just look over and then the third aspect is the cicade so multiple times per second our eyes are moving",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 961.568,
    "end": 971.541,
    "text": " And with active inference, we can understand, okay, it's like when the gaze is fixed, our precision is high and we're paying more attention to visual input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.561,
    "end": 981.493,
    "text": "And then right before we're ready to execute a saccade, of course, this is subconscious, precision is alleviated, the eye moves, and then it's like the foot goes back on the gaps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 982.354,
    "end": 988.622,
    "text": "So the fact that the blind spot, the periphery, and the saccades are not attended to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 989.902,
    "end": 1009.243,
    "text": " is very tangible that just our visual experience is what we generate it to be with, of course, information coming from what's external, but it's not being processed merely from what's external.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1011.505,
    "end": 1015.369,
    "text": "Okay, so let's go to Sarah's question here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.003,
    "end": 1022.269,
    "text": " How are action and perception similar, different, or related?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.112,
    "end": 1030.118,
    "text": "What's anything that anyone wants to add on this where there's a few pieces to bring in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1034.904,
    "end": 1042.152,
    "text": "The part about the planning, is that in between or is that part of action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.256,
    "end": 1046.217,
    "text": "Yeah, great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1047.749,
    "end": 1060.267,
    "text": " So, Christoph brought up the Hubel and Wiesel experiments with the cat, retina, and the selectivities in different brain regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.168,
    "end": 1073.385,
    "text": "And that actually connects to one of the most cited neuroscience papers, certainly within the Act-Inf space, which is Rao and Ballard, 1999.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.517,
    "end": 1097.601,
    "text": " which provided some of the early strong evidence for predictive coding as I was like well so in that retina experiment they had classical patterns like classical cell types oh this one responds to vertical lines this one responds to diagonal lines this one's horizontal or so on however there were these receptive fields",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.138,
    "end": 1123.015,
    "text": " like patterns of activation of visual neurons that were extra classical like they were not accounted for within a classical receptive field model and this paper with empirical evidence and and mathematical modeling established that predictive coding which is to say like expectations about visual input",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.535,
    "end": 1151.196,
    "text": " were able to account for some of these extra classical phenomena um um Andrew oh yeah I just wanted to say just very generally on the the action perception relationship um active inference seems to take the stance that like we are actively inferring information around us and so rather than",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1151.783,
    "end": 1167.8,
    "text": " being like passive observers who are just sitting there, we engage in actions in order to kind of impact our perceptions, such as like you pick something up and look at it, like you can look at it from different angles.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1167.98,
    "end": 1170.383,
    "text": "All of those are like actions that you're taking.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1170.443,
    "end": 1180.373,
    "text": "That's my general sense of the relationship between the two, as opposed to some classical view that we're just sitting there, we're taking in,",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1180.69,
    "end": 1183.053,
    "text": " What are the supposed reality is around us?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1183.113,
    "end": 1185.155,
    "text": "We're not actually doing anything.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1185.175,
    "end": 1186.397,
    "text": "We're just observers.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1187.618,
    "end": 1190.181,
    "text": "Um, that's it.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1190.201,
    "end": 1191.122,
    "text": "I don't know if that tracks.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1191.783,
    "end": 1192.023,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1192.484,
    "end": 1192.844,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1193.045,
    "end": 1194.206,
    "text": "Um, Jesse, then Manuel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1198.051,
    "end": 1207.021,
    "text": "Yeah, I think, I mean, isn't the, the two options either you change your mind or you change the world, right.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1207.041,
    "end": 1209.044,
    "text": "To minimize the free energy.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1209.104,
    "end": 1209.364,
    "text": "So.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1210.627,
    "end": 1234.896,
    "text": " um that's kind of how I see it anything that you do that act that changes the world materially falls in the category of action where um changing your mind is perception I guess what I'm struggling with is that your mind is in the world right so you say you change your mind but that's the same thing as changing the world",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1235.213,
    "end": 1240.827,
    "text": " Like I'm still struggling with the, the difference because changing your mind, it's just okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.847,
    "end": 1246.281,
    "text": "Even, even if we reduce it to it's changing firing rates, it's changing patterns in, in neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.301,
    "end": 1249.169,
    "text": "It's not some esoteric mind concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.249,
    "end": 1251.214,
    "text": "It's still something physical we're changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.7,
    "end": 1258.589,
    "text": " there's an action there to change the synchrony between different brain regions or whatever it is that causes that sort of perceptual switch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1259.21,
    "end": 1260.832,
    "text": "But it's not like an esoteric concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.952,
    "end": 1263.956,
    "text": "It's still something physical that's changing is what I'm struggling with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.496,
    "end": 1265.978,
    "text": "But I completely get what you're saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.018,
    "end": 1267.06,
    "text": "Like, I do agree with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.12,
    "end": 1270.604,
    "text": "But then the smallest more you get, it's like, well, what is changing your mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.745,
    "end": 1272.447,
    "text": "It's just a changing weights between neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.487,
    "end": 1273.388,
    "text": "It's changing synchrony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.869,
    "end": 1275.03,
    "text": "It's changing something physical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.07,
    "end": 1281.218,
    "text": "Unless, you know, maybe this will be the answer and we'll find something metaphysical finally in the brain somehow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.813,
    "end": 1284.374,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.454,
    "end": 1286.036,
    "text": "Manuel and then Susan.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1287.559,
    "end": 1290.203,
    "text": "Yeah, just to give my 2 cents on this point.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1290.223,
    "end": 1291.385,
    "text": "I think he's really interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1291.425,
    "end": 1292.306,
    "text": "What sorry saying, but.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1293.188,
    "end": 1299.497,
    "text": "You know, in the formalism where the free energy principle comes from, my understanding is, you know, you have to find.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1300.118,
    "end": 1303.864,
    "text": "A dynamical system, which has many variables.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1303.912,
    "end": 1328.67,
    "text": " and for this thing to apply there has to be a concept of a mark of blanket which will come later in the book but it's like you have a separation of variables that do not have direct contact with other variables within the system only through this this layer of interaction and perception and action are different there in the directionality of the influences so perception",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1328.937,
    "end": 1340.854,
    "text": " only influences the internal state of the subsystem you care about, but doesn't do the opposite, or sorry, the internal system doesn't influence the perception states, and the opposite with action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1341.535,
    "end": 1357.577,
    "text": "And when you say, yeah, like the brain also is taking an action in a physical world, and that's true, you know, Friston seems to mention pretty often how these Markov blankets, I think of them as, you know, the matryoshka, the Russian doll, many layers of these",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1357.557,
    "end": 1359.179,
    "text": " Marcos blankets on top of each other.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1359.279,
    "end": 1368.59,
    "text": "So a cell it's doing its own active inference, but it's so it's had its own mark of blanket, maybe defined by its own cellular membrane and whatnot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1369.07,
    "end": 1383.647,
    "text": "But it's part of a circuit, and that circuit is also has now more functional mark of blanket, and they take actions towards other systems and many, many scales of this kind of thing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1384.268,
    "end": 1385.269,
    "text": "But the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1385.705,
    "end": 1396.082,
    "text": " I think the more precise differences these of of what variables are changing your system versus what variables you change of what is not the system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1396.784,
    "end": 1410.126,
    "text": "All defined by what the mark of blanket is always in this in the sense that there has to be something that is that you care about and some and the rest that you don't care about directly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1411.304,
    "end": 1429.198,
    "text": " Yes, very interesting and important point, which is a simple or a narrow technical difference between action and perception is for a given system of interest that we're just going to focus on, the inbound dependencies are perceptual, the outbound dependencies are action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1429.999,
    "end": 1432.063,
    "text": "And then with a different blanket,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.432,
    "end": 1442.586,
    "text": " or a different system of interest, a given causal influence might be understood as, well, it was an action for the speaker, but then it was a perception for the listener.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.548,
    "end": 1458.649,
    "text": "So then by swapping a perspective, we might give a different act infantology tag to the same causal edge on a base graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.45,
    "end": 1460.532,
    "text": "Ra, then Andrew.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.127,
    "end": 1489.067,
    "text": " Yeah, I was thinking a bit about this after I got to figure 2.2 in the textbook because they're illustrating this interface or this influence that an agent has on the world to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1490.448,
    "end": 1512.878,
    "text": " uh generates some kind of uh observations why here and in my mind the difference between perception is that inaction is at least based on the formalism that we're given here is in the access that we have to the hidden states so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1512.858,
    "end": 1517.965,
    "text": " Out in the world, there's some process, some generative process, as they refer to it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1518.245,
    "end": 1524.454,
    "text": "And there's no way to observe the hidden states of that generative process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1525.015,
    "end": 1530.843,
    "text": "And the hidden states are the causes of whatever observations you have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1530.863,
    "end": 1539.895,
    "text": "So, for example, if you see an apple, there's something out there in the world that is generating apple-like observations on your retina.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1540.077,
    "end": 1550.795,
    "text": " And then inside of your mind you have some also you have a general model of what that process is in out in the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1551.035,
    "end": 1560.972,
    "text": "But you actually have some maybe some influence, some more direct influence over that over the configuration of the generative model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1561.323,
    "end": 1577.391,
    "text": " And so even if you take some actions internally to update that model, it's different than like some proxy action that you take to change your observations out in the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1577.624,
    "end": 1596.73,
    "text": " um that's as far as the distinction has been clear enough to me but i think this idea of a marker of blanket which would probably explore more um in the high road to active inference uh i think that's also a deep important idea for",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1596.71,
    "end": 1616.541,
    "text": " establishing what it means to be a system what it means to be a thing that that is separate in some significant way in some statistical way perhaps from from the external world thank you great point",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1617.044,
    "end": 1643.98,
    "text": " even if we chose to take a kind of active modeling approach to internal action like through attention or whether we even conceptualized of learning as action like just the actual parameter updating of learning not just like moving around the world only through the agent's boundary would the object be intervened upon in the world it'd be like you know if people are watching a movie",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1644.483,
    "end": 1664.978,
    "text": " And they might be doing attentional modulation or something, but they're not intervening with what's on the movie screen versus an outgoing dependency, which is to say real overt action, then does modify how hidden states change through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.081,
    "end": 1667.242,
    "text": "Andrew?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.262,
    "end": 1667.402,
    "text": "Andrew?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.913,
    "end": 1680.342,
    "text": " Adrian Holovaty, Sorry, you know I think everyone just before me largely summed up what I wanted to say, I guess i'll just add.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1681.324,
    "end": 1700.07,
    "text": "Adrian Holovaty, Another way I kind of think about it is like the inclusion of the the idea of preferences and the generative model carries preferences and in differentiating the system of interest, like the model versus the process whose true states, we don't have direct access to and so on.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1700.931,
    "end": 1702.013,
    "text": "Adrian Holovaty, Like.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1702.634,
    "end": 1706.181,
    "text": " For me, a human is a generative model.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1706.301,
    "end": 1712.273,
    "text": "I have preferences or homeostatic set points or however you want to view those.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1712.894,
    "end": 1714.177,
    "text": "I want to keep my hunger low.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1714.217,
    "end": 1716.02,
    "text": "I would like to get some good sleep.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1716.081,
    "end": 1719.327,
    "text": "I would like to have a well-regulated body temperature.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1719.307,
    "end": 1727.779,
    "text": " And while I would say, yes, my body, my mind and so on are in fact part and parcel with the world, I'm in the world.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1728.32,
    "end": 1731.564,
    "text": "I don't think that the world around me has the same preferences I do.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1731.724,
    "end": 1738.634,
    "text": "I don't think it's attempting to regulate my body and maintain my homeostatic set points.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1739.215,
    "end": 1747.727,
    "text": "I have to engage in action as well as like attempting to get rather tractable, accurate perceptions of the world around me.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1747.707,
    "end": 1755.102,
    "text": " in order to act and realize my preferences that are all of these homeostatic",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1755.537,
    "end": 1785.156,
    "text": " um set points um active inference seems to paint the process around the model potentially as just like an entropic dissipative set of forces that the the agent is trying to act against um in some ways and that's not necessarily a big antagonistic picture between us and the world around us but in some ways yeah we do have to kind of um fight for our lives something like that so",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1787.752,
    "end": 1789.916,
    "text": " Yeah, great points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.28,
    "end": 1801.137,
    "text": "You could specify a generative model where the environment was just at the exact temperature that the agent preferred.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1803.057,
    "end": 1830.246,
    "text": " or you could have one where the environment had some regions that were the preferred temperature and some that weren't and then that would lead to the question of well then how would the agent select where to move and that would take us literally exactly to expected free energy where pragmatic value would um up weight or up regulate policy selection that led to observations aligning with preferences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1833.77,
    "end": 1858.697,
    "text": " but again to this top question um action and perception certainly work together that is a kind of way pre-active insight that that there's this um inextricable relationship between perception and action like the um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1860.196,
    "end": 1887.283,
    "text": " uh even the opening quote of the chapter by William James is connecting thinking and and doing um however they're not the same we've talked about how for a given system of interest their directions are different across a blanket um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1888.006,
    "end": 1913.693,
    "text": " they're they're also modeled as difference in the generative model that we specify like this is looking to figure 4.3 but perception is going to be loaded in between observations and hidden states so perception is going to be just from from what variables you you actually use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1913.96,
    "end": 1919.785,
    "text": " it's mediating the relationship between observations and unobserved latent causes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.105,
    "end": 1925.791,
    "text": "Like here's the thermometer reading, and then here's the estimate of what temperature it is in the room.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.912,
    "end": 1928.253,
    "text": "That's where perception is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1928.973,
    "end": 1934.418,
    "text": "Whereas action is seen as intervening in how hidden states change through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.76,
    "end": 1941.925,
    "text": "You're not reaching in and changing how the thermometer reading is related to temperature in the abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.327,
    "end": 1947.551,
    "text": " You're actually doing something that modifies how temperature in the world changes through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1948.452,
    "end": 1951.395,
    "text": "And then the thermometer readings might be different later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.315,
    "end": 1961.183,
    "text": "So action and perception are coming in differently to how we specify the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1963.585,
    "end": 1965.366,
    "text": "Susan or anyone else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1968.069,
    "end": 1968.989,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.25,
    "end": 1972.232,
    "text": "So here's how I'm kind of interpreting the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.398,
    "end": 1979.968,
    "text": " the planning, and this kind of brings in the changing your mind versus changing your world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.73,
    "end": 1989.841,
    "text": "So changing the world, if I'm trying to change my world, then I'm acting on the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1990.481,
    "end": 1998.692,
    "text": "And bringing in the expected ambiguity and risk, that's what's emerging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.685,
    "end": 2008.497,
    "text": " And if I'm not able to reach the expectations of what's changing in the world, then that's going to bring me back to changing my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.577,
    "end": 2019.091,
    "text": "So that planning is the inferences that I have about what my power in the world is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2019.171,
    "end": 2027.042,
    "text": "And I think that for me, that's kind of where I bring in the affordances because what you talked about, Andrew, was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.377,
    "end": 2051.494,
    "text": " was I interpreted that as you know someone feels entitled um that the world is going to provide them and then they act out in the world as if they're entitled they may well you know either have to change their mind or they're going to get reinforcement that they are entitled is that is that cohere",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.427,
    "end": 2078.173,
    "text": " yeah like if there's a door and one expects to be on the other side of the door then it's like you try to open the door okay if it opens then you change the world and then you proceed on and as you described like then that was like confirmed or reinforced whereas if it doesn't open I mean what yeah you can keep on trying but at some point if it's not openable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2079.908,
    "end": 2109.055,
    "text": " there's gonna have to be a belief update that that in that moment at the very least that door can't be open otherwise it's going to be just you know you're gonna um not drink any water and you're gonna die trying to open that door it's like there has to be a stopping point um and and that brings in the expected ambiguity plus risk yes let's definitely this yes we'll look at 2.5 2.6 and see what um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2110.148,
    "end": 2110.929,
    "text": " where these come in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2111.109,
    "end": 2111.63,
    "text": "Andrew?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2117.236,
    "end": 2117.416,
    "text": "Hi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.898,
    "end": 2119.899,
    "text": "Multitasking again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2120.64,
    "end": 2121.641,
    "text": "Just a quick question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2123.162,
    "end": 2132.153,
    "text": "This action perception conversation reminded me I have some questions about attention and intention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.593,
    "end": 2139.801,
    "text": "Are those concepts kind of covered or addressed anywhere in Active Inference or this textbook?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2141.418,
    "end": 2167.273,
    "text": " attention absolutely in its more uh technical parametric meaning of attention as precision as well as in its kind of broader psychological uh meaning intention probably more of a nebulous concept so not to say that you couldn't um assign",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.642,
    "end": 2194.459,
    "text": " preferences to be intentions for example the belief desire intention model that's explored in livestream 46 by ryan smith at all where they associate preferences just straightforwardly um with they talk about the generative model in terms of the belief desire intention folk psychology model but in this textbook it's um gonna certainly talk about attention and that's a major topic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2197.628,
    "end": 2226.15,
    "text": " cool yeah I was just noticing the other day how um with your perceptions there's certain modalities like your sense your skin sense and your body sense that can be masked um in terms of perception in a way that like noise cannot from your conscious experience and I thought that might say something interesting about the active inference model or the the structure in our brains",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2229.353,
    "end": 2259.09,
    "text": " yes cool yeah this is uh 6.2 here's like different kinds of observations so sensor fusion setting and then attention is it allocated across sensory modalities or how is it or where is it distributed across um or within sensory modalities how are those attentions to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.218,
    "end": 2266.744,
    "text": " observations related to like the unexperienced beliefs about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.066,
    "end": 2276.093,
    "text": "Like you're not actually directly experiencing whether there's a jumping frog, but you may experience interception, auditory, visual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.797,
    "end": 2280.137,
    "text": "Jesse?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2282.78,
    "end": 2287.204,
    "text": "Could you look at, to Andrew's question, could you look at policy as intention?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2288.939,
    "end": 2297.629,
    "text": " more or less because it's projecting a series of actions that you'd like to have happen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2297.729,
    "end": 2299.751,
    "text": "Yeah, I was thinking that exact same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2301.853,
    "end": 2314.187,
    "text": "So there's a quote on page 38, I believe, where they're discussing beliefs over policies.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2314.471,
    "end": 2342.014,
    "text": " as intention and this is related to the expected uh free energy um formalism and yeah i think this is interesting quotes to discuss if people have any thoughts about it nice great reference there i i don't know if there's two two general the statements but",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2343.53,
    "end": 2359.25,
    "text": " To go from something that is technical and within the active fontology and then kind of like zoom out or adapt it to a more nebulous setting, that's on you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.192,
    "end": 2373.267,
    "text": "If you choose to take that interpretation of a given aspect of active inference in a setting, then it'll be valid in the ways that it's valid for that setting and it won't be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2373.753,
    "end": 2401.043,
    "text": " whole story in the ways that it's not the whole story for that setting however that kind of a question is difficult to answer in the abstract because when we're talking about policy selection we're talking about metronomes and particles of dust and computers and groups of people so so then if but so if someone's thinking well intention i'm meaning like what i experience when i want to do something",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.377,
    "end": 2426.44,
    "text": " then you're already in the case of a given system of interest at which point it's no longer like a general question about the active ontology it's more about how you're adapting a term or an equation or something to a given setting at which point will be useful how it's useful and it'll be not the whole story in the ways that it isn't um andrew",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2430.841,
    "end": 2453.524,
    "text": " sorry I never um raised my hand but I I do actually have a comment on that um related to policy one thing I maybe this is discussed in later uh chapters but policy generation it seems like at least in these early equations they're they're",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2454.567,
    "end": 2481.081,
    "text": " a set of policies is inferred but I don't see how policies are generated is is that discussed or implied somewhere yeah good question it connects to the where is planning so um policies just as a first pass answer policies are the affordances that are available",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.233,
    "end": 2491.784,
    "text": " multiplied to the exponent of how many time steps the planning horizon is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2492.666,
    "end": 2500.978,
    "text": "So if their affordances are up, down, left, right, there's four affordances, over one time step, there's four policies that can be selected, up, down, left, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.079,
    "end": 2506.647,
    "text": "So for a time horizon of one, affordances and policies are identical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.778,
    "end": 2514.388,
    "text": " For a time horizon of two, you'd have 16 policies of length two, up, up, up, down, up, right, up, left, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.311,
    "end": 2524.922,
    "text": "So in this setting, policies are just affordances over a horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.643,
    "end": 2533.714,
    "text": "So then how do- I'm not sure that really answers it unless affordances are generated because it just moves the question to affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2534.048,
    "end": 2534.65,
    "text": " Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.87,
    "end": 2538.3,
    "text": "So how are affordances learned or how are they provided?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.541,
    "end": 2545.24,
    "text": "So like in the TMAs or something like that, it's like, how does the rat know that it can move up, down, left, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.343,
    "end": 2547.045,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2547.532,
    "end": 2549.494,
    "text": " First, we're dealing with maps, not territories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2549.755,
    "end": 2559.385,
    "text": "So just specifying a given vector of affordances doesn't mean that the rat knows that it can do those affordances or has any kind of like awareness about them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.146,
    "end": 2562.97,
    "text": "It's just us describing what we've seen the system do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.71,
    "end": 2572.24,
    "text": "So when we're talking about the policy prior or the habit vector, the prior on policy,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2573.03,
    "end": 2602.885,
    "text": " um affordances those are something that the modeler infers not necessarily the system of interest itself however it still is the question of interest well how are those affordances known and what happens when it up down left right and then all of a sudden up down left right and raise up you know an arm or something like that like how do new affordances come into play",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2607.235,
    "end": 2632.281,
    "text": " we can express the question in the act infantology but write it out for a given system of interest and then I think you'll be well closer to the answer but certainly you can develop nested models where like there's a um a a context shift that leads to a different set of affordances",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2635.771,
    "end": 2638.657,
    "text": " But that's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.861,
    "end": 2646.733,
    "text": "Let's look at 2.5 and 2.6 and just look at their partitionings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2653.848,
    "end": 2655.631,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2655.651,
    "end": 2656.513,
    "text": "So here's 2.6.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2658.046,
    "end": 2675.768,
    "text": " five and they write that variational free energy so variational it just means we're using variational methods so we're doing approximate Bayesian computation not exact base but approximate base using variational methods",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2677.469,
    "end": 2688.278,
    "text": " It may seem an abstract concept, but its nature and role it plays in active becomes apparent when decomposed into quantities that are more intuitive and familiar in cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2689.76,
    "end": 2699.928,
    "text": "So these three lines are different decompositions of variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2701.149,
    "end": 2706.514,
    "text": "So they differently partition the kind of same pie.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.08,
    "end": 2735.033,
    "text": " in a few ways the top line is more of a statistical physics decomposition that is most like for example gibbs free energy for those with a chemistry background whereas the second and third line have more to do with statistics and model fitting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2735.468,
    "end": 2758.084,
    "text": " and in both cases I mean ultimately in all cases since they're describing the exact same quantity but especially um in this pure statistical second and third decompositions it highlights that we're fitting data but also not wanting to overfit data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.093,
    "end": 2771.113,
    "text": " and the family of distributions that are being utilized are whatever are used for Q. Q is the distribution that we control from the family that we selected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2771.874,
    "end": 2784.375,
    "text": "So if we say we're going to do variational inference on temperature in this room, and we're going to use a Gaussian distribution, so like a bell curve distribution, that doesn't mean that the temperature in the room",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.216,
    "end": 2811.46,
    "text": " is actually changing according to a bell curve or that the thermometer is giving us readings according to that gaussian distribution maybe it has like a long tail or maybe it has some other distribution but it means that we are going to have our hands on the knobs of q and get to the best fitting which is to say anything wider would be under fit anything tighter would be over fit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2812.199,
    "end": 2840.08,
    "text": " those are the knobs that we can control it might be grossly inadequate but there is a way to fit the best possible Q to a given Y data and the way to fit the best Q to a Y is with reducing the KL divergence shown here and that is variational free energy minimization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2841.629,
    "end": 2871.417,
    "text": " if you can reduce that KL divergence between the variational free energy and surprise to zero then variational inference is identical to exact Bayesian inference because minimizing surprise is kind of like the actual Target here if you minimize surprise you've maximized model evidence you know you're getting new thermometer readings coming in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.835,
    "end": 2899.176,
    "text": " you were minimally surprised by those readings you would have the highest model evidence you would have the best belief so instead of trying to maximize model evidence directly with like a hill climbing approach statistical physics kind of inverts that problem and says well let's think about going downhill with a gradient descent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2899.915,
    "end": 2921.316,
    "text": " And here is our way to have a tractable, incrementally improvable approach that we know is going to be moving in the right direction to surprise minimization with variational free energy minimization, which is highly optimizable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.988,
    "end": 2925.953,
    "text": " Again, doesn't mean that it's going to get exactly here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.994,
    "end": 2930.759,
    "text": "Doesn't even mean it'll get close.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2930.779,
    "end": 2936.706,
    "text": "But you will be able to take incremental improving moves, which is kind of shown here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.369,
    "end": 2948.08,
    "text": "So that's the real-time beliefs, the approximate posterior Q, and the incoming data Y.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.954,
    "end": 2950.456,
    "text": " That's the variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2951.117,
    "end": 2959.289,
    "text": "And again, the first decomposition is more like statistical physics free energies, and the second and third decompositions are more like statistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.652,
    "end": 2964.196,
    "text": "This doesn't have anything to do with the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2965.117,
    "end": 2967.38,
    "text": "This is just like a real-time unfolding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2972.848,
    "end": 2976.193,
    "text": "Then we get into expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2977.034,
    "end": 2998.317,
    "text": " so expected free energy extends active inference to include a prospective form of cognition which is planning so now um rather than just the kind of ball rolling down the hill okay sometimes it jumps left sometimes it jumps right but each time its movement is basically um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2998.432,
    "end": 3011.209,
    "text": " dictated or constrained by its local surroundings so we could talk about that ball having policy decisions or taking actions in some sort of um very like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3011.729,
    "end": 3028.725,
    "text": " real-time unfolding way but we might not need to appeal to planning however we may be interested in cognitive models that have an explicit planning component like deliberation or consideration of multiple decisions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.515,
    "end": 3036.963,
    "text": " Again, this isn't to say that that system does planning, just that we're going to make a cognitive model that includes the planning component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.126,
    "end": 3054.983,
    "text": "Key notation is when there's a tilde, little curvy line, over a variable, that is being used to refer to like a whole time series of that variable over a given time horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3057.747,
    "end": 3064.977,
    "text": " So now we move from F of Q and Y, variational free energy, to G of pi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.738,
    "end": 3068.362,
    "text": "So it's different in a bunch of different ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.363,
    "end": 3086.067,
    "text": "Expected free energy is looking to the future with these series of expected hidden states and observations that of course have not happened yet, whereas variational free energy was dealing with the actual data Y. We also noticed that expected free energy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3086.418,
    "end": 3108.401,
    "text": " is taking in as an argument policy priors, not taking in beliefs and data directly, but rather, even though we see the Q and the Y, but what G is doing most proximally is taking in the prior on policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3109.102,
    "end": 3112.105,
    "text": "So this is like a vector of all the possible policies",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3113.215,
    "end": 3116.479,
    "text": " Again, if it was only one time step, that's the same as the affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3117.299,
    "end": 3119.862,
    "text": "If it was two time steps, it would be like affordances squared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3120.803,
    "end": 3130.954,
    "text": "Taking in the prior distribution on those policies and then sharpening or reweighting them according to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.257,
    "end": 3137.001,
    "text": "So let's think about that up, down, left, right, two time step settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3137.061,
    "end": 3139.223,
    "text": "So there's 16 policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3139.321,
    "end": 3144.518,
    "text": " So if we had no a priori habit of any of those, they would all be like 1 16th.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3145.942,
    "end": 3152.082,
    "text": "And that vector would look like 16 tall and each value would be 1 16th.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3152.45,
    "end": 3160.518,
    "text": " Or if we always did policy one and two, and then we very rarely did the other ones, it would be like 0.5, 0.5 in all zeros.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.318,
    "end": 3168.024,
    "text": "Or you might put that in a computer as like 0.49, 0.49, and then very small values for things that are rarely done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3169.466,
    "end": 3179.335,
    "text": "G takes in that policy prior and it updates it according to this calculation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3179.618,
    "end": 3184.603,
    "text": " And so for people who want to look at the code, that's very helpful to see where exactly this comes into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3185.463,
    "end": 3206.723,
    "text": "Takes in that vector and then it sharpens or updates it to give more weight, make the policy posterior bigger where the policy contributes information gain or pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3206.973,
    "end": 3218.368,
    "text": " Pragmatic value rewards or updates or increases the weighting on policies that bring expected future observations into alignment with preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.669,
    "end": 3221.652,
    "text": "That is the definition of pragmatic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3222.934,
    "end": 3234.769,
    "text": "The definition of information gain or epistemic value is about the difference that you're expected to get",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3235.711,
    "end": 3238.675,
    "text": " depending on the observations that you expect to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3242.179,
    "end": 3243.34,
    "text": "So it's definitely a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.742,
    "end": 3254.093,
    "text": "However, that is what this top and most common decomposition of expected free energy does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.835,
    "end": 3260.841,
    "text": "And then as Susan brought up, another decomposition of G",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.243,
    "end": 3276.813,
    "text": " is rather than thinking about what G does as up-weighting based upon epistemic and pragmatic value, you could think about G as changing the weighting of policies based upon their expected ambiguities and risk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.474,
    "end": 3283.646,
    "text": "David, and then Andrew.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.187,
    "end": 3284.247,
    "text": "Hi."
  },
  {
    "start": 3284.648,
    "end": 3296.621,
    "text": " I guess a major, a major obstacle for me to understand all of this is literally the mathematical construction of this sentence.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3296.641,
    "end": 3305.05,
    "text": "So like I, for example, here, I just didn't know where the, what the tilde means in X and Y or what, where the C comes from.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3305.57,
    "end": 3309.154,
    "text": "Just asking because I don't know if somebody has this sense of discomfort.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3309.134,
    "end": 3331.362,
    "text": " not being able to decode what what's this trying to tell me and I don't know if somebody has some good research on how to really understand this this construction yeah thanks for asking totally agreed um hopefully you're in a good resource now and and thank you again for asking",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3332.27,
    "end": 3356.303,
    "text": " depending on someone's familiarity with math or computer science and programming there's definitely a lot of approaches but the big approach is many coats of paint like coarse grain it just say okay 2.6 is expected free energy and you can go down fractal rabbit holes for the rest of your life or at some point you can just say okay expected free energy is about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3356.958,
    "end": 3386.29,
    "text": " updating beliefs about action another really helpful resource that again I encourage people to contribute to is the natural language descriptions of the questions it's a lot easier to read there's still a lot of terms in here but the blue terms are ones where we have mouse over definitions um and then also maybe someone's interested in playing around more with the AI",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3387.4,
    "end": 3414.893,
    "text": " explanations that we used these may be helpful um certainly on your own notebook or however like the notation uh and understanding like you know q approximate posterior x hidden states through time y observations through time pi policy it is like learning a vocabulary or a symbol matching exercise",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3415.177,
    "end": 3418.962,
    "text": " And math is a language, and actinth is a dialect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3419.683,
    "end": 3425.43,
    "text": "So it just is a lot of exposure and hearing about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3426.651,
    "end": 3428.233,
    "text": "Christoph, they pulled the equation out of the hat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.696,
    "end": 3433.159,
    "text": "Yeah, in some ways, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3434.081,
    "end": 3443.192,
    "text": "Also, the textbook is distilling and summarizing across research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.341,
    "end": 3471.627,
    "text": " and there are more lengthy derivations elsewhere the the math learning group again to the extent that people want to to do these activities um there's always been like a more fundamentals of math learning group side like just like what does it mean when we have two matrices and then we just like put them next to each other like what does that mean to multiply them",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3471.742,
    "end": 3486.269,
    "text": " And then also some people like Jonathan and Ali and others have worked on the derivations of the equations and Sanjeev Namjoshi textbook and other resources help so it's just like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.289,
    "end": 3491.218,
    "text": "But being in the game is the key enabling step um Andrew.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3494.742,
    "end": 3524.175,
    "text": " yeah i'm actually kind of related to this uh just one aside for some of the greek characters as soon as i start like memorizing what the pronunciation of the characters are you find that there is a mapping between like mu and mind there's some alliteration going on um so that might be a little mnemonic to help um the other thing is i was wondering with the assignment of like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3524.746,
    "end": 3554.095,
    "text": " um epistemic value to part of these equations is that a generally agreed upon format within the sort of scientific body or was that sort of arbitrarily mapped by the researchers um putting these equations together so so like those statistical yeah um Bayesian sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3554.513,
    "end": 3581.112,
    "text": " uh equations is that like agreed upon as um denoting that qualitative uh term in the case of variational free energy yes I'd say it's absolutely non-contentious variational Bayesian methods or energy-based methods with these decompositions have been in play for decades",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3581.311,
    "end": 3591.064,
    "text": " Expected free energy extends VFE into the discussion of observations that have not happened yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3592.606,
    "end": 3597.372,
    "text": "Also, these are non-contentious decompositions, I believe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3598.033,
    "end": 3598.394,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.215,
    "end": 3604.162,
    "text": "I don't have any survey data on who knows or believes what, but I don't think that these are contentious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3605.203,
    "end": 3608.247,
    "text": "About the latex, if there is a column here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3608.851,
    "end": 3614.639,
    "text": " Um, if you want the raw latech, that is a good technique.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.761,
    "end": 3617.523,
    "text": "You can paste this into yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3617.703,
    "end": 3619.666,
    "text": "GPT four can use images as input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3620.908,
    "end": 3623.832,
    "text": "Um, this is why the stigma G is so important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3624.293,
    "end": 3631.943,
    "text": "The notes that people write in the questions, like the more that people add, the more material there are for human and non-human learners.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3633.225,
    "end": 3634.487,
    "text": "Um, and.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3635.041,
    "end": 3636.963,
    "text": " We make do and we stay in the game with what we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3637.183,
    "end": 3643.17,
    "text": "Like three or six months ago when we were converting them all to LaTeX, this was the best that we could do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.672,
    "end": 3646.273,
    "text": "And it works really well with Coda AI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3646.414,
    "end": 3660.289,
    "text": "Coda AI does not have the image recognition yet, but if slash when they do, we'll be able to add another column and just say, okay, given what's in the figure, dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3661.552,
    "end": 3669.04,
    "text": " So yeah, a lot of different, interesting, emerging ways to work with the material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.363,
    "end": 3671.663,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3672.524,
    "end": 3678.09,
    "text": "So that is chapter two on the low road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3679.552,
    "end": 3684.737,
    "text": "For the next two weeks, we'll head into chapter three on the high road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3685.939,
    "end": 3687.54,
    "text": "So thank you, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3688.441,
    "end": 3689.162,
    "text": "See you next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3690.391,
    "end": 3691.097,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3691.863,
    "end": 3692.105,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3693.174,
    "end": 3693.557,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3693.617,
    "end": 3694.343,
    "text": "This is great.",
    "speaker": "SPEAKER_04"
  }
]