[
  {
    "start": 1.616,
    "end": 7.704,
    "text": " Hello, this is Active Inference Textbook Group Cohort 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.925,
    "end": 19.098,
    "text": "We're in Meeting 10 on November 4th, 22, and we're having our first discussion on Chapter 5, Message Passing and Neurobiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.771,
    "end": 31.319,
    "text": " So to begin, does anyone want to share any general thoughts or remarks on chapter five?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.72,
    "end": 44.55,
    "text": "Just any experiences they had reading it, any topics that they thought they want to discuss a little bit today, just anything about their reading of chapter five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.611,
    "end": 58.172,
    "text": " Yes, Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.936,
    "end": 80.872,
    "text": "Well, I think in Chapter 5, since the authors decided to go pretty deep into neuroanatomical structures or neuroanatomical substrates of most of the active inference concepts,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.234,
    "end": 96.009,
    "text": " Well, having kind of basic understanding of neuroanatomy, in my view, is an essential prerequisite to understanding the contents of this chapter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.75,
    "end": 124.857,
    "text": " But otherwise, it provides some empirical evidence for why active inference modeling works or to put it this way, it explains some of the testable predictions we can get from applying, from seeing active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 125.818,
    "end": 127.939,
    "text": " from a neuroanatomical perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 130.521,
    "end": 130.821,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 131.722,
    "end": 132.082,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.663,
    "end": 137.807,
    "text": "Anyone else want to share a general thought on Chapter 5?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.479,
    "end": 180.599,
    "text": " yeah as Ali stated the chapter is going to provide a host of examples which are going to be discussed separately and then synthesized together regarding neurobiology specifically mammalian neurobiology which is one of the most important",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.304,
    "end": 196.315,
    "text": " systems of interest of us as humans and also it's one of the most studied in terms of different um zones where active inference models have been applied ranging from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.654,
    "end": 226.135,
    "text": " as we'll see in this chapter the micro circuit level so the connectivity patterns of small numbers of computational elements which might be like neurons or it could be brain regions then there's a discussion of motor commands in terms of continuous time active inference and how motor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.676,
    "end": 231.163,
    "text": " uh, behaviors in the periphery are coordinated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.203,
    "end": 239.889,
    "text": " There are then several discussions about decision-making, neuromodulation, and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.89,
    "end": 256.403,
    "text": "And then there's a hierarchical hybrid model that's presented, which integrates the continuous and the discrete cases of active inference in a unified generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.004,
    "end": 260.146,
    "text": "And that's what brings it all together in the summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.207,
    "end": 279.165,
    "text": " and also just one note maybe we've mentioned before um chapter one provides an overview of the book much like chapter 10. chapter two and three are the roads to active inference but not active inference itself though it also kind of is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.629,
    "end": 290.117,
    "text": " Chapter four, we learned about the essence of specifying an active inference entity, which is its definition in terms of a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.938,
    "end": 297.223,
    "text": "And now, immediately, we're moving to the area with the most empirical support,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.172,
    "end": 305.056,
    "text": " and popular interest, which is understanding active inference in the context of mammalian neuroanatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.736,
    "end": 310.258,
    "text": "And that will conclude the first half of the book, which is the epistemic component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.119,
    "end": 320.924,
    "text": "The second half of the book, chapter six through 10, heads into some of the step-by-step and recipes around designing active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.63,
    "end": 335.082,
    "text": " But in some ways, as we complete this last chapter in the first half of our cohort, it's just good to keep in mind that we spent 60% of the time getting into the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 336.523,
    "end": 341.227,
    "text": "Then where the low and the high road intersected was in the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.928,
    "end": 345.531,
    "text": "And now we're immediately going to be talking about topics related to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.532,
    "end": 369.681,
    "text": " applications and specific generative models applied to neurobiological phenomena in health and in disease okay does anyone else want to add a comment on chapter five before we start moving through it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.677,
    "end": 397.877,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.562,
    "end": 403.824,
    "text": "Chapter four described the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.106,
    "end": 413.335,
    "text": "In this chapter, there's a focus on the process theories arising from those dynamics, theories that explain how the brain may implement variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.232,
    "end": 425.362,
    "text": " So as per classical scientific criterion, the goal of a theory or a contribution is to variously explain, predict, design, control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.183,
    "end": 434.129,
    "text": "These are the criteria that active inference can and should be compared and juxtaposed with other competing theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.99,
    "end": 439.014,
    "text": "And so many of these aspects are going to be touched upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.015,
    "end": 441.296,
    "text": "Explain and predict",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.731,
    "end": 448.374,
    "text": " and ultimately to design and control, but initially in this setting to explain and predict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.975,
    "end": 463.563,
    "text": "So we'll be keeping an eye out for unique and valuable explanations and predictions that active inference modeling of a given system of interest provides in comparison with some other approach that could be taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.049,
    "end": 478.751,
    "text": " Let us take a step back from the technical material of Chapter 4, the generative model, and turn our attention to the process theories accompanying active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.712,
    "end": 490.814,
    "text": "It's important to draw a distinction between a principle, like the free energy principle, and a process theory about how the principle may be implemented in a certain kind of system, such as the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.435,
    "end": 497.316,
    "text": "The latter lets us develop hypotheses that are answerable to empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.177,
    "end": 512.328,
    "text": " so quite commonly we hear about the non-falsification or the non-falsification of the free energy principle as a principle akin to a principle of least action and one can see that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.509,
    "end": 536.661,
    "text": " comment addressed at the beginning of this chapter which is sure whatever you think about whether free energy principle is tautological or it can it can't be falsified when we develop specific hypotheses embodied as models of given systems of interest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.541,
    "end": 566.448,
    "text": " then we're certainly in the space of being able to find unique explanations and predictions to falsify or not like we could have one model that says that two brain regions are connected in some way and then there could be an experimental study that falsifies or adds or removes evidence to support that claim so this is where we actually get into the last mile of scientific modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.659,
    "end": 572.984,
    "text": " where we're going to be saying specific things about specific systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.479,
    "end": 584.462,
    "text": " The dual aim of this chapter is to introduce readers with a technical background to the neurobiology of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.283,
    "end": 605.474,
    "text": "So that's people coming from a math and modeling perspective to learn about some of the important neurobiological substrates where active inference models have been constructed over the last 10 or so years, and to highlight to biologists the relevance of theory to practical neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.604,
    "end": 619.831,
    "text": " So for those who are coming from more of a embodied or biological angle here, why does it matter that we're adding this mathematical layer on top of the raw anatomical observations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.591,
    "end": 628.015,
    "text": "Like the structural connectivity of different brain regions is an empirical measurement about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.795,
    "end": 634.018,
    "text": "So what are we doing that goes beyond saying this is connected to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.149,
    "end": 638.37,
    "text": " And the chapter is not the final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.511,
    "end": 644.393,
    "text": "It is simply some interpretations that seem most consistent with the currently available evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.595,
    "end": 650.397,
    "text": "Here, they describe how in the following sections,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.394,
    "end": 673.374,
    "text": " they're going to bring up first, as mentioned briefly before, the role of the microcircuit as a computational component, which is very common to computational neuroscience, then moving through motor and cortical regions of the mammalian neuroscience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.295,
    "end": 700.952,
    "text": " to understand first modularly and then in composition how decisions around motor behaviors can be seen as the coordination among multiple active inference generative models anyone want to give a general thought or just like something that's interesting or exciting about this framing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 719.508,
    "end": 735.576,
    "text": " okay section 5.2 microcircuits and messages so in chapter 4 there was a discussion about belief updating which we spoke a little bit about in terms of message passing and belief propagation in bayesian graphical networks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.916,
    "end": 744.78,
    "text": " And here they provide some written overview of the layered structure of the mammalian cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.521,
    "end": 754.245,
    "text": "So does anyone want to give a note on the mammalian cortex or the layer structure, the so-called six-layer structure of the mammalian cortex?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.976,
    "end": 787.878,
    "text": " so just for context this is like um let's see where it's actually sliced through here we have a prototypical mammalian brain I'm always emphasizing mammalian because this is not some general um property of brains like invertebrate brains have a very different layout they don't have cortical layers in the same way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.613,
    "end": 809.001,
    "text": " And so these cortical regions near the top of the head, if one slices through them, they reveal a very specific pattern of cells that are arranged in these laminar or layer-like ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.241,
    "end": 816.284,
    "text": "And so there are these six areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.348,
    "end": 841.214,
    "text": " six layers one two three four five um maybe that should be six um or maybe there's some other thing happening here but this is representing like a slice through cortex and so this has been modeled as a column because as you go across",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.223,
    "end": 868.716,
    "text": " the cortical surface there are these repeating units that have this kind of laminar structure it's like six layers of lacquer across the cortical surface once it's unfolded and then sliced through and that's represented from a Bayesian computational view in figure 5.1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 870.64,
    "end": 878.085,
    "text": " Canonical cortical microcircuits illustrating relationship between inferential message passing and the architecture of the cerebral cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.607,
    "end": 891.094,
    "text": "On the left is a schematic of some anatomy, where the different connections represent inhibitory or excitatory signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.62,
    "end": 913.526,
    "text": " synapses so inhibitory synapses reduce the likelihood of the downstream neuron firing when activated and upstream and excitatory synapses increase the likelihood of the downstream neuron firing when activated so the left is not a base graph it's actually a summary of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.506,
    "end": 935.683,
    "text": " structural anatomical histological that means tissue level anatomy connectivity in the middle is a message passing architecture so like a scheme for variables and their connectivity within a hierarchical predictive processing architecture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.838,
    "end": 945.344,
    "text": " And on the right side is a message passing scheme that's described to solve a partially observable Markov decision process, POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.225,
    "end": 952.929,
    "text": "Now, on the left is an empirical neuroanatomical structural map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.15,
    "end": 960.254,
    "text": "On the right, we see two computational implementations of inference and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.639,
    "end": 965.201,
    "text": " and they're being kind of laid out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.881,
    "end": 967.502,
    "text": "They could be laid out in any way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.602,
    "end": 986.09,
    "text": "They could look like the Big Dipper graphically, but they're being juxtaposed with the cortical layers so that we can start to see some concordances and resonances between the location of a given variable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.19,
    "end": 1008.079,
    "text": " in a statistical model of inference and action and the neurobiological substrates who with plausible biological connectivity might be implementing or doing something like the computational role that the variables play in the abstract models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.66,
    "end": 1016.483,
    "text": "So that's going to be the path towards or the template of the path towards unique explanations and predictions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.339,
    "end": 1023.301,
    "text": " from using computational modeling of the structural neuroanatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.302,
    "end": 1043.83,
    "text": "Does anyone have any thoughts or questions on figure five one or like how a structural anatomical empirical map might be juxtaposed with statistical models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.651,
    "end": 1068.824,
    "text": " Maybe a good thing to think about or question and answer here is like what connections or what structure reflects something like a belief in the statistical sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.067,
    "end": 1074.929,
    "text": "Or what connection could be made there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.032,
    "end": 1079.633,
    "text": "So what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.478,
    "end": 1108.996,
    "text": " neurobiological structures can reflect or represent beliefs sure yeah that's fair or in what way are they different or yeah what what's not a belief here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.171,
    "end": 1114.572,
    "text": " Does anyone have any... A lot of arrows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.172,
    "end": 1115.452,
    "text": "Thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.532,
    "end": 1115.712,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.533,
    "end": 1120.175,
    "text": "And then the quarterback is going to sit to heat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.916,
    "end": 1122.196,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.157,
    "end": 1128.22,
    "text": "One thing I noticed immediately in this previous is just the cortical layers there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.92,
    "end": 1137.385,
    "text": "And there's this two on the right hand side of that for layer three and layer four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.405,
    "end": 1141.167,
    "text": "So I'm not sure what exactly...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.781,
    "end": 1165.287,
    "text": " One important thing to note about the cortical layers, which is almost obtrusively under-discussed, is the cortical column performs as one integrated unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.704,
    "end": 1173.149,
    "text": " The fact that it's six layers doesn't mean that there's like a little act-inf loop and then a second act-inf loop and then a third act-inf loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.309,
    "end": 1192.502,
    "text": "So it's not like a six, if someone said, I'm looking at a six layer predictive processing hierarchy, one might think that there's like six cleanly separated layers of a wedding cake, but actually the cortical column has six arbitrarily defined layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.092,
    "end": 1199.381,
    "text": " Not to say that there's no grounding, but there's finer scale differences and there's coursing and there's overlapping zones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.442,
    "end": 1204.748,
    "text": "And it's behaving with connections that span across multiple layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.816,
    "end": 1210.519,
    "text": " So this isn't like a clean six layer predictive processing model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.34,
    "end": 1217.044,
    "text": "This is like one integrated architecture that functions with this connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.865,
    "end": 1224.469,
    "text": "And importantly, this is the basis of like the thousand brains hypothesis and Numenta AI",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.39,
    "end": 1251.286,
    "text": " and people who have been pursuing the cortical architecture as the or a basis for intelligence in natural and artificial systems and it's long been hypothesized when comparing the brains of different mammals like what neuro-anatomical features are associated with differences in perceived intelligence or learning capacity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.333,
    "end": 1266.276,
    "text": " And one of the features is the prevalence in the primates and in humans of higher cortical regions, so-called higher cortical regions with this specific architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.336,
    "end": 1278.939,
    "text": "Whereas other brain regions maybe have not had so much evolution in their size or in their circuitry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.376,
    "end": 1298.092,
    "text": " doesn't mean that they're unimplicated in intelligence it just means that people have looked for where there are more differences um to this question that brock asked about like where might beliefs be embodied",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.079,
    "end": 1309.604,
    "text": " So within the Bayesian setting, the statistical setting, a belief is just any parameterization, can be said to be a belief about a variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1309.885,
    "end": 1310.385,
    "text": "So we're not,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.397,
    "end": 1316.059,
    "text": " talking about experienced or personally held or verbally stateable beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.799,
    "end": 1320.901,
    "text": "We're talking about statistical parameterization of a given variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.981,
    "end": 1328.724,
    "text": "And there's at least two ways one could think about beliefs being represented or embodied in a structure of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.584,
    "end": 1337.388,
    "text": "And we're going through this in slow time because like this kind of general questions about what is the structural neuroanatomy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.311,
    "end": 1350.48,
    "text": " and how does it relate to statistical modeling thereof is gonna be at the heart of the following examples as well, not just this cortical case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.621,
    "end": 1367.112,
    "text": "One can see the firing rate of a neuron in like an artificial neural network setting, or just the value that a statistical variable takes on as representing a belief about that variable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.891,
    "end": 1390.082,
    "text": " then one can think about the presence or absence or the waiting or the type like inhibitory excitatory of a connection between two variables as embodying a hypothesis about the structure of how those variables are connected",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.589,
    "end": 1397.891,
    "text": " under the implicit assumption that we're developing models that actually do functional things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.811,
    "end": 1404.272,
    "text": "Of course, one could just connect all of the variables and have an all-by-all model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.453,
    "end": 1416.016,
    "text": "However, as we sparsify the relationships amongst variables, which is to say remove edges from the all-by-all, the model becomes computationally easier to fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.731,
    "end": 1424.473,
    "text": " And we talk about that in terms of the factorizability of the variational Bayesian approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.914,
    "end": 1431.195,
    "text": "So if none of the variables were connected, they're all independently fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.696,
    "end": 1436.657,
    "text": "That's like the simplest it can be to fit n variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.958,
    "end": 1441.379,
    "text": "If all the variables were interacting in combinatoric ways,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.54,
    "end": 1445.761,
    "text": " that would be increasingly computationally complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.301,
    "end": 1465.527,
    "text": "And for a given amount of data, we would have less and less statistical power to resolve any given variable or combination of variables because the same amount of information from our observations is now being like partitioned and spread out over fitting estimates for more and more variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.928,
    "end": 1467.268,
    "text": "And so,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.706,
    "end": 1490.141,
    "text": " what biological systems do and what statistical models do is enforce either just through physical constraints or through design sparsity conditions on functional statistical modules such that the models are more computable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.943,
    "end": 1496.566,
    "text": "Though they only may be exploring a subset of the space of total possible models,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.228,
    "end": 1521.721,
    "text": " exploring well a subset whose sparsity embodies certain aspects of the world may be a more appropriate um model to fit situationally figure 5.2 simplified version of the predictive coding scheme shown in the middle of 5.1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.293,
    "end": 1527.454,
    "text": " So does anyone want to give a thought on 5.2?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.098,
    "end": 1545.019,
    "text": "So here's message passing between three cortical regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.059,
    "end": 1549.72,
    "text": "So here's three cortical columns, each consisting of like one through six layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.414,
    "end": 1556.198,
    "text": " and there's going to be message passing happening laterally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.72,
    "end": 1564.865,
    "text": "Dotted lines show ascending messages, prediction errors, and solid lines show descending messages or predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.826,
    "end": 1577.475,
    "text": "So in this setting, this rightmost region is like the quote top most, but left, right, top down, bottom up, those are all just spatial metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.547,
    "end": 1606.435,
    "text": " but we'll continue to use this higher and lower in the hierarchical modeling where the lower levels of the hierarchical model are more close to where the rubber hits the road in terms of like the perceptual machinery and the action effectors and higher levels of a hierarchy are associated with more and more abstract or general or deeper or slower features of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.235,
    "end": 1607.355,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.601,
    "end": 1635.747,
    "text": " This figure is representing how there is a within cortical column relationship between predictions and prediction errors between the superficial and the deep levels using the concordance between variables and cortical layers established in 5.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.787,
    "end": 1635.987,
    "text": "And then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.494,
    "end": 1665.789,
    "text": " the um outcome of one cortical layer can also be engaged in this prediction and prediction error relationship with an anatomically lateral cortical column however from a computational perspective this is like the top the middle and the bottom",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.461,
    "end": 1690.512,
    "text": " of a three-layer cognitive model the superscripts are describing the level so here is like i i plus one and i minus one so this is just describing that this is a scheme that can be computationally extended to many levels of hierarchical modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.656,
    "end": 1698.685,
    "text": " And it's being embodied by the lateral juxtaposition neuroanatomically of cortical columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.458,
    "end": 1711.18,
    "text": "Ali, did you have something you wanted to add there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.993,
    "end": 1742.239,
    "text": " Well, yeah, I just wanted to mention Friston's recent paper from a couple of months ago in which the neurobiological substrates of prediction errors are explained in detail, namely the computational psychiatry, which is a great overview paper of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1743.759,
    "end": 1747.84,
    "text": " of the whole field of computation psychiatry through the lens of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.92,
    "end": 1767.505,
    "text": "And especially on the matter of prediction error, sorry, on the matter of prediction error, I just wanted to point to the section, let me, sorry, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1769.022,
    "end": 1771.144,
    "text": " Here are the importance of being precise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.625,
    "end": 1793.12,
    "text": "I just wanted to quote a couple of sentences from this paper, which says, predicting or estimating precision is a universal requisite for making sense of data from estimating the signal to noise ratio in some sensory apparatus through to estimating standard error when making inference by some Nyman-Pearson statistic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1794.02,
    "end": 1802.829,
    "text": " Affording certain prediction errors, greater precision increases their influence on belief updating and has all the hallmarks of attentional selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1803.329,
    "end": 1813.438,
    "text": "Physiologically, this simply entails an increase in the excitability or postsynaptic gain of neuronal populations broadcasting prediction errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1814.403,
    "end": 1834.132,
    "text": " In this view, there is an intimate relationship between attention and the modulation of synaptic efficacy by classical neuromodulators and nonlinear postsynaptic responses responsible for mediating the exchange between fast-spiking inhibitory interneurons and superficial pyramidal cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.053,
    "end": 1842.977,
    "text": "So it's basically the arguments from the book, but in a much more concise and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.237,
    "end": 1847.9,
    "text": " a little bit well-structured argument, in my opinion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.761,
    "end": 1863.873,
    "text": "So if anyone wants to just look at this paper, I think it might be helpful in grasping the material, which is I'm posting the link here in the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1865.735,
    "end": 1866.035,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.936,
    "end": 1867.176,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.816,
    "end": 1868.657,
    "text": "Thank you for sharing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.737,
    "end": 1869.338,
    "text": "Just to kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.569,
    "end": 1885.197,
    "text": " Again, as we walk towards unique explanations and predictions for active inference models of empirical neuroanatomy, we can think about at least a few areas of alignment between these models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.937,
    "end": 1899.004,
    "text": "So there's structural alignment, where realized anatomical connections have parallels to statistical connections in a Bayesian graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.25,
    "end": 1907.015,
    "text": " They are not one and the same, but it's just an area of alignment that can be used to explore predictions and explanations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.316,
    "end": 1927.228,
    "text": "Then also there was two areas that are mentioned by what Ali just read, which are some of the functional components, for example, neural firing rates or synchronizations and other sorts of dynamical functional relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.243,
    "end": 1933.324,
    "text": " Like when this variable is high, that one is lower, whether they're connected or not structurally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.525,
    "end": 1950.649,
    "text": "And chemical features like neuromodulation or the presence or absence of an excitatory or inhibitory neuromodulator at a given synapse, or even taking us into synaptic plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.669,
    "end": 1955.67,
    "text": "And the neuromodulation of Hebbian associative learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.19,
    "end": 1985.068,
    "text": " all of these areas when brought together in a total fabric of evidence help us strengthen the relationship between the computational models and the neuro anatomical empirical findings and then they suggest things to each other so that was heavily on the cortical architecture of the column",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.161,
    "end": 2010.196,
    "text": " and then how laterally linked columns which again is their empirical structural connectivity patterns can be thought of in terms of hierarchical bayesian modeling then they move into motor commands so let's think about the layer v of the cortex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.28,
    "end": 2028.881,
    "text": " projecting as a projection so layer v of the column here is this dp deep perimeter cell that's just the name of the cell it has a certain architecture that makes it called perimeter perimeter this is like classic santiago ramonica hall stuff",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.043,
    "end": 2034.527,
    "text": " And it has this arrow coming out, going to motor neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.108,
    "end": 2039.011,
    "text": "So here's like a motor output from this cortical column.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.932,
    "end": 2042.835,
    "text": "Not all cortical columns are involved in motor outputs, but some are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.797,
    "end": 2052.143,
    "text": "So we're going to be receiving inputs from those pyramidal neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.837,
    "end": 2057.539,
    "text": " and it's going to be projecting onto a butterfly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.039,
    "end": 2065.443,
    "text": "No, this is a cross-section of the neural cord, the spinal cord of a mammal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.164,
    "end": 2068.864,
    "text": "Figure 5-3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.845,
    "end": 2074.367,
    "text": "Neuroanatomy associated with active inference and modulating spinal motor reflexes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.67,
    "end": 2103.319,
    "text": " coming in to the system from the proprio sensors afferent meaning like um away from the sensor as opposed to efferent the proprioceptive afferent signal is being compared in an error like fashion with an epsilon with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.511,
    "end": 2126.229,
    "text": " the descending top-down predictions coming from that cortical column that we just looked at the output of this comparison is a motor message or command or signal to a motor actuator so one can imagine that where proprioception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.634,
    "end": 2153.303,
    "text": " exactly matches expectations around proprioception no motor movement might be passed forward i'm trying to hold my hand on the table all signals are suggesting that the expectation is being realized and no movement is enacted in comparison if one expects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.454,
    "end": 2170.925,
    "text": " to be receiving different proprioceptive afferent information, which is to say to be in a different postural position, then motor commands can be enacted to reduce that divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.866,
    "end": 2183.733,
    "text": "So different proprioceptors, for example, are in your elbow, such that there's a different proprioceptive afferent coming in when your elbow is extended and when it's completely closed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.154,
    "end": 2207.815,
    "text": " And then expectations in the head, the brain, can change such that different motor commands are enacted to open and or close the elbow dynamically as authentic proprioceptive information comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2212.389,
    "end": 2230.321,
    "text": " so broadly that is this neuroanatomy any thoughts or questions on it yes ollie yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.175,
    "end": 2257.272,
    "text": " Actually, I think it was in the beginning of section 5.3, there's a sentence which might result in some misunderstanding or confusions, which says, the schematic on the left in figure 5.1 shows that layer 5 of the cortex projects to spinal pyramidal neurons, and that this can be interpreted as a prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2258.093,
    "end": 2259.894,
    "text": "But if we look at figure 5.2,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.856,
    "end": 2269.877,
    "text": " I'm sorry, 5.1, we won't see this explicitly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2269.897,
    "end": 2288.801,
    "text": "I mean, anything labeled as a spinal pyramidal neurons because the primary excitation neural cell types in corticospinal tract is pyramidal neuron, spinal motor neurons and spinal parameter neurons are sometimes used",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.241,
    "end": 2290.101,
    "text": " interchangeably.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2290.201,
    "end": 2303.945,
    "text": "So in this figure, actually what we see is an excitatory connection, which is drawn from layer five to spinal motor neurons and not spinal pyramidal neurons, but they're basically the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.106,
    "end": 2311.908,
    "text": "So I just wanted to clear up that if anyone has that misunderstanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.788,
    "end": 2313.148,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.949,
    "end": 2315.269,
    "text": "The pyramidal neuron",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.997,
    "end": 2339.88,
    "text": " um there's a large diversity of structure but if you like squiggles that look like this you'll love cellular neuroscience all right um there's an extremely interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.601,
    "end": 2367.342,
    "text": " discussion around sensory attenuation in the context of motor initiation and completion so we need a way um when we want to make a move so to speak we need a way to preclude sensory data from updating our expectations so that we can entertain the initially false belief that we are moving so this belief can be realized through action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.482,
    "end": 2391.287,
    "text": " so let's just imagine that we're in a case where we are expecting the elbow to be closed but the proprioceptive information is suggesting that it's extended if um you know the cortical hierarchy simply changes its belief to it I believe that it is closed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.035,
    "end": 2398.819,
    "text": " that will immediately be overridden by the veridical proprioceptive information coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.64,
    "end": 2408.646,
    "text": "And so as we know, there's two ways to update the generative model and to minimize free energy, changing the world and changing your mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.127,
    "end": 2411.408,
    "text": "So here it's like change the body or change the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.329,
    "end": 2416.432,
    "text": "And under high precision information coming in,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.57,
    "end": 2427.861,
    "text": " changing one's mind will be brought back into alignment with the high attention, which is to say high precision to the sensory information coming back in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.082,
    "end": 2432.706,
    "text": "And so the computational strategy implemented is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.512,
    "end": 2441.096,
    "text": " that the descending motor tracks predict not just the data, but the precision or the confidence placed in those data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.516,
    "end": 2445.099,
    "text": "So high precision, high confidence, high attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.639,
    "end": 2453.585,
    "text": "That means you snap to whatever that is being, whatever that high attention, high confidence, high attention variable is saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.046,
    "end": 2458.449,
    "text": "In the extreme, just whatever it said in the last time point becomes your estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.282,
    "end": 2465.825,
    "text": " The opposite extreme is low confidence, low precision, low attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.065,
    "end": 2472.048,
    "text": "And in that case, no matter what that signal says, you don't change your mind at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.728,
    "end": 2480.391,
    "text": "And so what happens is previously we're talking about the elbows prediction around being like open or closed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.112,
    "end": 2490.096,
    "text": "But now let's think about it as providing a expectation and a variance coming down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.147,
    "end": 2501.59,
    "text": " So initially, the confidence placed in those data are decreased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.772,
    "end": 2505.673,
    "text": "That allows movement to be initiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.934,
    "end": 2511.297,
    "text": "This is known as sensory attenuation and can be thought of as the complement to sensory attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.917,
    "end": 2526.407,
    "text": "So attenuation just is low attention, diminishing, increasing of attention, equipping us with the capacity to ignore certain prediction errors, such as generated by saccadic eye movements, where sensory attenuation is known as saccadic suppression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.819,
    "end": 2550.095,
    "text": " so other than the blind spot and so on saccadic suppression is one of the most interesting examples of kind of embodied precision modulation like when you do an isocade which can happen multiple times per second there's no nausea or vertigo except when it's pathological because during that motor movement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.257,
    "end": 2555.201,
    "text": " there's a reduced attention to the bottom-up visual input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.321,
    "end": 2563.249,
    "text": "And this is highly, highly empirically demonstrated in multiple areas of the visual processing neurobiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.41,
    "end": 2574.601,
    "text": "So that like when the eye is still, there's an increased attention to the incoming raw bottom-up information, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.236,
    "end": 2586.581,
    "text": " When the eye is moving, there's a decreased attention to the bottom-up information and an increased reliance on the generative model during those transients of saccade.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.961,
    "end": 2601.467,
    "text": "And so similarly, to initiate a movement requires an initial suppression of precision alongside a change in expectation of proprioception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.458,
    "end": 2605.74,
    "text": " And that's what allows one to believe like, okay, I'm going to get out of the chair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.381,
    "end": 2608.462,
    "text": "I believe that I'm out of the chair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.662,
    "end": 2622.572,
    "text": "And then that shifts the balance of minimizing free energy towards changing your body, aka changing the world through action, rather than immediately just getting your change your mind knocked back into place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.471,
    "end": 2643.765,
    "text": " And interestingly, this is absolutely concordance with many healthy neurodiversity and pathological scenarios involving the neurobiology of failure to initiate, continue, or terminate movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.761,
    "end": 2658.326,
    "text": " So like there's scenarios where somebody may have trouble beginning movements, but once they've begun movement, they can walk normally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.047,
    "end": 2667.551,
    "text": "Alternatively, there are motor behaviors where somebody may have trouble terminating behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.853,
    "end": 2693.95,
    "text": " And so these can be modeled from a computational perspective so that not only are we able to say, well, this chemical is higher in this condition, or people with this diagnosis tend to have this comorbidity, but we can actually think about the parameterization of these computational models and have some more nuance around, well, should we be increasing what or modulating what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.811,
    "end": 2694.871,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.891,
    "end": 2694.991,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.474,
    "end": 2720.824,
    "text": " Actually, there's an interesting argument in Mark Solm's book, The Hidden Spring, which says that because consciousness, I mean, it says that consciousness is only required to mediate mismatches between internal and external states, the more adaptively and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2722.284,
    "end": 2731.57,
    "text": " predictively reliable our model becomes, the more our behavior becomes automated, operating below the level of conscious experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.63,
    "end": 2739.576,
    "text": "So basically it says that consciousness is needed in situations where surprisal needs to be minimized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.916,
    "end": 2743.358,
    "text": "When there's no surprisal, there's not much need for consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2743.538,
    "end": 2752.144,
    "text": "Or in other words, consciousness is a process that somehow seeks to overcome itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2756.275,
    "end": 2757.679,
    "text": " Well, very deep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.163,
    "end": 2760.768,
    "text": "Thank you for sharing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.511,
    "end": 2778.439,
    "text": " Okay, just to peer ahead into where we're going in the second half of five, and then people can think about some questions, hopefully write them down as they see fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.28,
    "end": 2785.183,
    "text": "So now we're coming back into the brain, into the subcortical structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.224,
    "end": 2800.116,
    "text": " So beneath the layer of cortex that has the histology described by the columnar architecture are the subcortical structures, sometimes referred to as being in the midbrain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.597,
    "end": 2807.782,
    "text": "Specifically, there's going to be a discussion of the basal ganglia and colleagues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.883,
    "end": 2821.831,
    "text": " This is one of the regions in the brain that has been implicated through many neuroimaging and disease-related and all kinds of different studies in decision-making and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.732,
    "end": 2837.702,
    "text": "And it's known to have some dopaminergic characteristics, expression of signaling related to dopamine, and actually only a very small fraction of cells in the mammalian or invertebrate neuroanatomy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.502,
    "end": 2864.245,
    "text": " are dopaminergic in this way it's not like every neuron is responsive to dopamine some of the details are described some of the mathematical parallels are drawn and here it culminates in a indirect pathway and direct pathway of decision making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.411,
    "end": 2876.336,
    "text": " that are which choice between these two pathways is favored is going to be computationally assigned to the role of this gamma variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.697,
    "end": 2895.105,
    "text": "And these two pathways can be thought of as sort of like deliberative decision-making in the direct pathway and instinctual or habitual decision-making in the indirect pathway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.997,
    "end": 2898.558,
    "text": " How do we see that playing out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.659,
    "end": 2906.124,
    "text": "Observations are coming in and in both cases, policy pi are coming out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.424,
    "end": 2922.075,
    "text": "So this neuroanatomy is implementing a computation that takes in some type of input from the cerebral cortex, which again might be a prediction about something else and results in policy evaluation and selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.168,
    "end": 2937.598,
    "text": " E is the variable representing affordances, and it can be thought of as like a habit vector because it characterizes not just what can be done, but the baseline frequencies or probabilities of those actions to be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.478,
    "end": 2948.385,
    "text": "Whereas G is expected free energy, and that relies not on the past habits and ratios of performance of different behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.335,
    "end": 2960.498,
    "text": " without consideration to the impact of those behaviors, but rather the expected free energy calculations around different policies that could be undertaken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.778,
    "end": 2978.182,
    "text": "So here we can start to see differences in decision-making where sometimes this is sort of a type one, type two manifold in terms of like quick, simple decisions that don't even need to reference the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.153,
    "end": 3001.669,
    "text": " on the indirect pathway and deliberative potentially planning like operations involving expected free energy calculations and a dopaminergic neuromodulatory feature that balances the relative contributions of these two decision-making pathways with respect to their influence on policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.173,
    "end": 3007.413,
    "text": "Table 5.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.281,
    "end": 3018.468,
    "text": " describes neurotransmitters, their associated computational role, even though they all play many roles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.168,
    "end": 3023.431,
    "text": "This is just a course reigning and a sort of starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.472,
    "end": 3032.798,
    "text": "And then empirical evidence around the role of that neurotransmitter in that computational way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.454,
    "end": 3046.551,
    "text": " Many work by Friston et al, many work just in the normal neuroscience realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.871,
    "end": 3051.057,
    "text": "5.6 is going to move us towards, it's a short section,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.887,
    "end": 3066.435,
    "text": " moving us towards thinking about stitching and composing together hierarchical active inference generative models that have continuous and discrete state spaces together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.496,
    "end": 3078.203,
    "text": "Because, as they write, our interface in the world around us is in the continuous domain, the implication of which is that the lowest level of any hierarchy in the brain must be continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.264,
    "end": 3088.806,
    "text": " However, as decision-making becomes more and more abstracted, it can be seen increasingly, in certain cases, as symbolic or discrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.007,
    "end": 3100.169,
    "text": "So from the perspective of a generative model, that means associating alternative discrete hypotheses about the world with continuous dynamics entailed by those hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.829,
    "end": 3101.95,
    "text": "Turn left or turn right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.67,
    "end": 3104.43,
    "text": "Bring an umbrella, don't bring an umbrella.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.77,
    "end": 3105.951,
    "text": "Is it raining or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.351,
    "end": 3107.551,
    "text": "Friend or enemy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.202,
    "end": 3114.506,
    "text": " juxtaposed with the continuous information arising from the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.448,
    "end": 3131.741,
    "text": "And in summary, with a short section again, they are now going to link together the three neuroanatomical systems that are described in the chapter under the spirit of this type of continuous discrete hybrid generative modeling approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.502,
    "end": 3136.085,
    "text": "Specifically, we see this cortical hierarchy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.154,
    "end": 3159.782,
    "text": " that is engaged in a relationship with the subcortical structures, a biologically plausible relationship, which reflects the actual structural anatomical connectivity between cortical and subcortical structures and of appropriate computational parallelisms, hashtag explanations and predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.142,
    "end": 3166.344,
    "text": "And in the brain, the cortical and subcortical architectures",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.092,
    "end": 3191.0,
    "text": " are ultimately resulting in this study with outputs that then engage the spinal column in the reflex arc that was described earlier so policies might be discrete throw the baseball or don't and that can be using complex cortical predictive processing like decision making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.022,
    "end": 3221.254,
    "text": " facilitated by this dopaminergically mediated handoff between more instinctual habitual like behavior and more deliberative like expected free energy comparisons and that can be enacted through a prediction minimizing approach carried out in the spinal column this is continuous whereas policies can be discretized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.032,
    "end": 3254.185,
    "text": " that's a short chapter there's no equations there's some variables in the figures but there aren't really equations this chapter over the years will be fractally unpacked to the most incredible level of detail they are just raising some key points and pointing some initial steps Ollie",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.398,
    "end": 3273.509,
    "text": " Yeah, as I mentioned in the previous cohort, I just wanted to recommend this talk from Thomas Parr, which summarizes most of the points in this chapter and some more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3274.51,
    "end": 3287.299,
    "text": "And I highly, highly recommend it for anyone reading this chapter because it really helps understanding some of the more obscure concepts here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3288.339,
    "end": 3288.7,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3289.14,
    "end": 3289.461,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.781,
    "end": 3290.002,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.242,
    "end": 3292.666,
    "text": "Any final thoughts or we will close this session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.435,
    "end": 3298.655,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.617,
    "end": 3300.398,
    "text": "Thank you cohort two.",
    "speaker": "SPEAKER_00"
  }
]