[
  {
    "start": 6.832,
    "end": 7.593,
    "text": " Hello, welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.514,
    "end": 9.775,
    "text": "It's April 9th, 2024.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9.855,
    "end": 18.343,
    "text": "We're in Active Org Stream 8.1 with Nathan Schneider discussing the work in the book, Governable Spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.023,
    "end": 22.526,
    "text": "So there's many places we can enter in and jump off from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.566,
    "end": 25.389,
    "text": "But first, Nathan, thank you very much for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.509,
    "end": 29.933,
    "text": "And perhaps you could say a quick hello, and then we'll jump into some quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.034,
    "end": 31.775,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.975,
    "end": 33.196,
    "text": "Thank you for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.216,
    "end": 34.257,
    "text": "It's wonderful to be here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.89,
    "end": 57.122,
    "text": " okay so i have two quotes prepared and then we'll also see any questions people have from live chat or anything else that comes up or anything you want to ask all right so this is a quote on page three of the book do you want to say any words before the quote about like what is this book about when did you publish it how is it published who did it etc and then we'll jump in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.406,
    "end": 58.147,
    "text": " Okay, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.668,
    "end": 63.336,
    "text": "Yeah, it was published in late February of this year, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.897,
    "end": 74.273,
    "text": "And with University of California Press, it's available for free online as well as in print from, you know, wherever you get books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.614,
    "end": 81.405,
    "text": "And it's really an exploration of why the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.347,
    "end": 89.8,
    "text": " daily aspects of our online lives and the governance in those in our daily online lives really matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.541,
    "end": 101.9,
    "text": "I've spent a lot of years exploring like political economy of online life, trying to support the development of alternative platforms that are built as cooperatives and that sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.281,
    "end": 103.663,
    "text": "So I've worked a lot with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.863,
    "end": 131.811,
    "text": " know building things at the company scale thinking about policy you know found an accelerator for those sorts of things um but in this one i i kind of stepped back or stepped into you know what is what are our political experiences in everyday life and why do these matter and it kind of starts with the history of how our our online lives came to be structured and managed the way they are and and then it it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.791,
    "end": 154.373,
    "text": " blows up from there into um suggesting that you know maybe some of these these daily practices are actually part of what's driving the kind of decline and crisis of democracy more generally and uh and then let's think about what to do about it so it's it's really a kind of plea for for um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.353,
    "end": 173.106,
    "text": " recognizing that we could do much more, much better in bringing democracy into the spaces that we inhabit online and to recognize the way in which we've often, without noticing it, failed to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.029,
    "end": 175.45,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.729,
    "end": 195.801,
    "text": " okay here's a quote on page three and when i read it i thought about active inference and about this opportunity for a two-way street like for people who are learning active inference to hear about how the perspectives that you're bringing and drawing very richly on are just right up even next to it so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.781,
    "end": 200.247,
    "text": " Much of this book dwells in interactions of human politics and technological systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.727,
    "end": 213.143,
    "text": "But as above, the more-than-human world envelops it all, providing the stage and the stakes, a planet waiting to see whether we can govern our way out of self-destruction, deciding whether to maintain the conditions necessary for human civilization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.844,
    "end": 215.366,
    "text": "Is there democracy in the wild?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.827,
    "end": 222.295,
    "text": "Creatures hurtling through space on a fragile world can expect no rights or powers of decision from physics and biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.275,
    "end": 231.808,
    "text": " A government's claim to rule means little in a high mountain wilderness or neighborhood whose residents have made themselves ungovernable to survive against a hostile police force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.429,
    "end": 243.003,
    "text": "Yet governance and its cognates are names we use for doing what all life forms must, orchestrating our perceptions and reactions so as to have a chance at thriving in our surroundings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.724,
    "end": 250.273,
    "text": "Consider it simply the intersection of power and cooperation, an intersection hardly unique to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.945,
    "end": 253.229,
    "text": " So what made you write that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.733,
    "end": 257.015,
    "text": "Great, great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.337,
    "end": 261.743,
    "text": "A very specific moment, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.043,
    "end": 273.342,
    "text": "I was kind of early in imagining this work that I'd been doing for some years already forming into a book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.659,
    "end": 302.164,
    "text": " and i was uh i at a retreat um at a catholic retreat center i go to sometimes in colorado and i was going on a long walk and felt just like deeply embarrassed actually for all i've been doing a lot of work around voting systems and all this sort of stuff and um running around with people developing like dows on blockchains and all this and i was just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.566,
    "end": 332.134,
    "text": " observing the interactions among the creatures around me and um and just recognizing like i i just have to own up to the fact that um first of all governance is not something unique to humans and um and and to kind of hold the recognition that um that the things that that this book is engaging with um are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.654,
    "end": 334.738,
    "text": " are just all around us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.981,
    "end": 348.086,
    "text": "And to connect this question of democracy in human societies with, not to say that democracy is what's happening in that ecosystem, but there is a form of governance at work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.309,
    "end": 353.818,
    "text": "And to make sure that those things aren't totally separate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 354.203,
    "end": 371.183,
    "text": " Because I think we lose a lot of our own potential when we neglect that there are things going on in the natural world and we are the natural world that are beyond the systems that we've happened to dream up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.602,
    "end": 374.808,
    "text": " So to me, it was really a kind of passage of humility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.828,
    "end": 385.447,
    "text": "And I really appreciate you lifting it up because a lot of the rest of the book is, okay, humans, let's come together and intentionally craft our governance structures and all this sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.888,
    "end": 394.504,
    "text": "But I think it's important to ground that intentionality and that kind of literal construction of humanity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.737,
    "end": 410.565,
    "text": " our own political spaces in a recognition that there's a much longer story here and we're part of a much more complex set of systems than political science as a discipline, for instance, tends to appreciate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.588,
    "end": 413.33,
    "text": "That's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.151,
    "end": 419.26,
    "text": "It's a similar perspective coming from a field ecology view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.32,
    "end": 440.168,
    "text": " we're always looking out seeing how things are natured and patterned and then people talk about governance or regulation or even democracy like in the beehive or an ant colony but also it's a mapping it's like a metaphor it's not intended to exactly describe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.84,
    "end": 467.337,
    "text": " what ought to be the case for human systems it is like the whole question of biomimicry and there's a lot of like biomaterials and biomimicry but then the question becomes for the governance and interaction systems like what can we learn from what's quote natural what is natural are computers natural what do you think well I I draw some on um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.093,
    "end": 474.178,
    "text": " on, for instance, Adrienne Lee Brown, who uses a lot of language about biomimicry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.198,
    "end": 483.506,
    "text": "She's an activist and writer associated, for instance, with Black Lives Matter and various kind of liberation movements today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.206,
    "end": 486.348,
    "text": "And she's not a scientist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.408,
    "end": 487.649,
    "text": "She's very upfront about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.689,
    "end": 497.998,
    "text": "But she draws a lot on the language and metaphors of biomimicry and related discourses to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.978,
    "end": 504.49,
    "text": " explain, to understand political change in our world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.61,
    "end": 506.454,
    "text": "And I take a lot from her.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.474,
    "end": 516.713,
    "text": "I use her in some respects to deepen and correct, for instance, a thinker like Alexis de Tocqueville, who's a kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.693,
    "end": 535.579,
    "text": " founding figure in the theories of democracy right who traveled around in the in the early united states in the 1930s wrote democracy in america the kind of letter to the european aristocrats like himself about like how this whole democracy thing was going and what he emphasized was um this this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.099,
    "end": 546.818,
    "text": " weird pattern, which was that he just saw these civic associations and small, ordinary practices of democratic life in people's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.967,
    "end": 547.788,
    "text": " communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.389,
    "end": 552.634,
    "text": "And he saw this as vital to the practice of larger scale democracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.655,
    "end": 572.721,
    "text": "And this is a finding, an observation that's been reaffirmed in later political theory and empirical political science, that healthy democracies at the level of a nation state or a region, you know, really tend to have these kinds of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.701,
    "end": 578.248,
    "text": " thick textures of democratic life in their everyday environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.468,
    "end": 597.473,
    "text": "And Adrienne Marie Brown takes that same idea, but puts it in this kind of biomimicry language, this recognition of the fractal, the way in which the small is kind of in a system, small scales, what occurs at small scales resembles what occurs at larger scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.234,
    "end": 600.497,
    "text": "And that to me is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.477,
    "end": 623.498,
    "text": " just an important lens through which to recognize what's going on in our everyday online lives is affecting in ways that are sometimes hard to perceive and understand, but that appear to be very real, affecting our ability to practice democracy at larger scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.866,
    "end": 630.54,
    "text": " I think we also have to be careful about these kinds of inferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.722,
    "end": 637.234,
    "text": "But at the same time, democracy is such an imaginative activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.434,
    "end": 640.761,
    "text": "I mean, it can only be what we imagine it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.281,
    "end": 642.062,
    "text": " to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.222,
    "end": 647.63,
    "text": "It can only be what we let ourselves be, what we let ourselves practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.971,
    "end": 658.767,
    "text": "And therefore, I think the space of metaphor and relationship is really important in constructing our political lives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.227,
    "end": 663.574,
    "text": "What we map ourselves onto is vital.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.594,
    "end": 665.897,
    "text": "And this is also in the context of human societies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.957,
    "end": 667.98,
    "text": "When",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 668.652,
    "end": 678.476,
    "text": " project that I explore some in the book that's still quite preliminary is this idea of governance archaeology I've been working on with Federica Carugatti, who's a political scientist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.198,
    "end": 686.155,
    "text": "And what we've been exploring is how to broaden the repertoires of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.489,
    "end": 698.609,
    "text": " of governance histories that we can draw on by building databases and repositories of these histories to catalog what has and does go on in our world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.99,
    "end": 707.063,
    "text": "Thinking about the way in which, for instance, the so-called founding fathers of the United States, for instance, they were reading books about often ancient",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.38,
    "end": 708.822,
    "text": " Greece and Rome, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.842,
    "end": 715.373,
    "text": "And they were often referring to those while they were justifying the possibility of building a new kind of democracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.413,
    "end": 728.815,
    "text": "And that makes me wonder what repertoires, what histories are we turning to today as we, for instance, design the flows of power in online life?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.795,
    "end": 746.145,
    "text": " or in other kinds of spaces around you know addressing climate change or governing undersea cables or governing ai what metaphors are we going to draw on what what playbooks are we going to turn to and if we are able to allow ourselves to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.125,
    "end": 757.826,
    "text": " to consider biomimicry, to consider indigenous practices that have been so often suppressed or neglected by dominant powers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.989,
    "end": 769.568,
    "text": "If we allow ourselves to have some humility, for instance, about those colonial histories we've been told and we've often integrated into our own self-understanding,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.548,
    "end": 773.073,
    "text": " Suddenly, the range of motion becomes broader.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.113,
    "end": 777.399,
    "text": "The range of possibilities of what we could do become broader.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 777.539,
    "end": 789.456,
    "text": "And essential critique for me in online spaces is just like we've limited ourselves with a very, very profound set of constraints, a design pattern I call implicit feudalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 789.517,
    "end": 793.362,
    "text": "The admins, the mods, having all the power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.966,
    "end": 797.935,
    "text": " addressing problems through censorship and exile.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.937,
    "end": 809.46,
    "text": "You know, these things that we're very used to in online spaces are actually a very small subset of the possibilities of how humans could interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.803,
    "end": 813.344,
    "text": " Yeah, thanks for adding all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.505,
    "end": 822.753,
    "text": "I really like the biological thread and the naturalizing of the decision making and the different perspectives that are involved in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.393,
    "end": 840.088,
    "text": "It was focused on the human and the anthropological, but also like you mentioned in that first quote, like we're also dealing with governance spaces that don't only include humans, as if that wasn't already like a totally broad enough space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.068,
    "end": 855.681,
    "text": " and then the bottom up in the top down is often how it's explored like from a multi-scale biological systems view looking at multi-scale governance or regulation like of tissue homeostasis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.661,
    "end": 872.505,
    "text": " And then that's kind of the discussion is about the bottom up signaling and the top down influences and people who kind of favor one of those accounts, like the bottom up being kind of explaining things in a sense by their lower components, but also giving those lower components agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.485,
    "end": 892.485,
    "text": " um so it's just very interesting as we develop like the particular works that connect the systems and the broader perspectives on human systems helping us see on one hand the similarities that help make biomimicry plausible",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.714,
    "end": 895.356,
    "text": " However, it's not going to provide any answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.396,
    "end": 912.899,
    "text": "It's only going to provide us kind of the path or the tools to get up to a very challenging human point, which is like, well, then how do we want the online governance to be, if not the Linux kernel or Reddit or social media platform model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.46,
    "end": 917.325,
    "text": "So how have you kind of explored that with MetaGov and elsewhere?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.841,
    "end": 926.816,
    "text": " Just for context, for those who aren't familiar, MediGov is an organization that we met through, as I recall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.978,
    "end": 932.487,
    "text": "And it's a network of people working around online governance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.587,
    "end": 939.28,
    "text": "And this community has been really central to, for me, in writing this book and doing this work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.26,
    "end": 959.158,
    "text": " And one of the founding ideas that we, a group of us, developed as MediGov was coming into being was this idea of modular politics, which is a language just for imagining a different texture, a different framework for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.138,
    "end": 960.84,
    "text": " for our online spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.621,
    "end": 985.332,
    "text": "So today we tend to assume, okay, you start a Facebook group or you start a group chat or whatever platform it is, whoever starts it has essentially all the power and they can delegate some of that power, but it all kind of comes from them and it's not changeable, it's kind of crude.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.312,
    "end": 998.754,
    "text": " And it's built on this logic of the earliest online communities, which were like, you know, a BBS server, a bulletin board system, like sitting in somebody's house and the people who logged in were guests in that person's house.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.854,
    "end": 1000.557,
    "text": "And so, yeah, they had all the power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1001.578,
    "end": 1008.549,
    "text": "But is that really does that model describe the kinds of communities that we're working with now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.77,
    "end": 1009.411,
    "text": "I don't think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.451,
    "end": 1010.813,
    "text": "I think for many of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.147,
    "end": 1015.582,
    "text": " we can imagine some really different kinds of structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.304,
    "end": 1023.047,
    "text": "And the idea with modular politics is rather than when you start a new community, you just kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.601,
    "end": 1026.765,
    "text": " fall into this default implicit feudalism design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.226,
    "end": 1034.335,
    "text": "Instead, you have the ability to actually design using assembling modules the kind of governance that you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.595,
    "end": 1052.157,
    "text": "So using a kind of collection of tools that you choose, you can try to capture the most appropriate governance for the kind of space that you're building.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.525,
    "end": 1064.718,
    "text": " And, you know, all this is to say, I mean, in some ways it's all about just like catching up to existing organizations where, you know, you can write bylaws in a lot of different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.48,
    "end": 1068.829,
    "text": "And we need, I think, a kind of digital equivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1068.809,
    "end": 1078.1,
    "text": " to that option to be able to really define and reflect on what do we need in a given space?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.4,
    "end": 1082.685,
    "text": "Is this space something where I can vote the mod out if I don't like what they're doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.925,
    "end": 1087.751,
    "text": "Or is it one where there's a jury that makes decisions where people get randomly selected?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.791,
    "end": 1093.137,
    "text": "There are all kinds of ways you could imagine online spaces being governed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1093.558,
    "end": 1097.162,
    "text": "And we just really haven't had the chance to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.142,
    "end": 1120.112,
    "text": " there are a few exceptions that that i look at that show that this approach is not crazy because whenever people do actually have the opportunity to self-govern in digital space they end up going this kind of route so for instance when the city of barcelona said hey we want to support a whole lot more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.463,
    "end": 1129.115,
    "text": " citizen participation and they helped develop this platform called Decidim, then actually, what did they do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.155,
    "end": 1132.038,
    "text": "People started building a bunch of modules for that system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.058,
    "end": 1146.758,
    "text": "They built the system so they could handle people essentially writing plugins, kind of like plugins for a WordPress website, except in this case, they're like decision making tools that you can add and you can pick and choose which ones you want to use in the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.738,
    "end": 1151.585,
    "text": " And in this case, it's less for the platform than for the city.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.986,
    "end": 1162.121,
    "text": "But still, when you have that invitation to say, how could we self-govern, suddenly people get really creative about what they build.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.762,
    "end": 1169.472,
    "text": "Another context where this has occurred is in the context of blockchains, where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.452,
    "end": 1191.612,
    "text": " This is a network design that, unlike the server-based logic of earlier internet technologies, the network is governed across servers, whether you're talking about Bitcoin being governed by miners or Ethereum by stakers or a DAO, like an organization on, say, Ethereum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.592,
    "end": 1213.144,
    "text": " uh governed by token holders in each case there is governance is a problem in crypto context in a way that it really hasn't been another web context regardless of you know in this is all in the context of lots of scams and you know malfeasance and all this stuff that that we all know about but but this nevertheless",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.445,
    "end": 1224.763,
    "text": " has produced really the first explosion of innovation in governance technology for the Internet, just because it's really the first time people have had to figure this out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.883,
    "end": 1230.411,
    "text": "And there's been billions of dollars at stake in how you self-govern these networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.112,
    "end": 1238.524,
    "text": "And if you look at the popular tools, for instance, for developing DAOs like Aragon, for instance,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.504,
    "end": 1259.809,
    "text": " they have adopted essentially a modular structure where you have a kind of base layer and you can assemble, you know, or the Gnosis system, you can assemble different modules for how you want to self-govern and, you know, build your community stepwise like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.81,
    "end": 1264.174,
    "text": "So, you know, we could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.593,
    "end": 1289.233,
    "text": " allow ourselves this tremendous creativity that we've seen in these little pockets where people have had the opportunity to self-govern online suddenly they start really going crazy and coming up with some some really really interesting designs um and uh but in most of our online lives that is not even an opportunity so the question hasn't really arisen for for so many people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.85,
    "end": 1315.356,
    "text": " great all right i'll ask some questions from live chat so two questions from sid feel free just to answer however you want is it democratic if the community admin makes everyone in the group an admin what is the equivalent of a democratic space in a telegram or facebook community and another related question what are some affordances in modern online communities that allow for governable spaces",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.618,
    "end": 1317.299,
    "text": " Okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.519,
    "end": 1326.132,
    "text": "Um, let's see, maybe I'll start with the second one, you know, what are some affordances, you know, in the in the current context that we see?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.755,
    "end": 1343.238,
    "text": "You know, one thing I found is that trying to bring democracy into particular spaces, for instance, like, I co founded a mastodon server called social.coop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.359,
    "end": 1346.102,
    "text": "It took a lot of work to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.622,
    "end": 1361.678,
    "text": " to build in uh democratic structures we have to go to a separate platform lumio to do decision making we have a separate platform a wiki for managing our bylaws and and the kind of how-to guides and all those sorts of things um the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.658,
    "end": 1368.968,
    "text": " Mastodon did not allow us to do a lot just by default built into the tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.389,
    "end": 1380.985,
    "text": "But the fact that it's a federated network that is small enough that a group of people can download it, run it on a server, and start trying to figure out how to govern it, that's a powerful affordance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.447,
    "end": 1385.371,
    "text": "Subreddits have a lot of group autonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1385.391,
    "end": 1391.58,
    "text": "They're able to build at least significant group culture, even though they rely a lot on admins and mods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.56,
    "end": 1402.617,
    "text": " And I think Reddit's strengths really demonstrate the power of community self-governance and how much more could be possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.951,
    "end": 1419.125,
    "text": " And so these communities that allow, these platforms, I mean, that allow kind of distinct communities to form and to have real autonomy, that's an important prerequisite, but it's really not sufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.307,
    "end": 1422.512,
    "text": "And in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.492,
    "end": 1448.314,
    "text": " what you can do with those tools you're often working against them you're often kind of bending over backwards to try to get tools not designed for democracy to work that way for instance like giving everyone admin authority I don't know like that's kind of like giving everybody the nuclear football you know that's um that's not necessarily what a lot of us would recognize as democracy that's kind of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.239,
    "end": 1451.801,
    "text": " crazy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.182,
    "end": 1458.027,
    "text": "It allows everybody to act and do whatever they want without necessarily having structural accountability to others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.767,
    "end": 1467.475,
    "text": "And the fact that that feels like the best option or the closest thing is just another reminder of how poorly equipped these tools are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.275,
    "end": 1478.284,
    "text": "So, for instance, what if there were functionality built in where you could say, okay, you know, if an admin starts really like going off the rails, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.635,
    "end": 1489.769,
    "text": " the participants, maybe the people with enough reputation in the community, who've been upvoted a certain number of times, can vote that person out of that role and vote somebody new in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.812,
    "end": 1495.456,
    "text": "There are a wide range of structures one could incorporate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.476,
    "end": 1505.689,
    "text": "There could be a petition system, there could be a jury system, there could be votes that are ongoing rather than just at one time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.669,
    "end": 1520.286,
    "text": " When you look at, for instance, the world of crypto, despite, you know, and you see through all the scams and nonsense, you know, there's actually been a ton of creativity and okay, how do we get decision making structures that actually reflect what we're doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.789,
    "end": 1529.57,
    "text": " trying to do, and they're continually iterating on this in that context, and increasingly also using the kind of biomimicry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.252,
    "end": 1537.87,
    "text": "But it requires designing these systems differently in the context where we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1537.85,
    "end": 1549.066,
    "text": " had kind of exceptions that proved the rule, like the Debian project or the transition of Debian as a kind of operating system based on Linux.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.927,
    "end": 1555.935,
    "text": "It's run as like a direct as a constitutional democracy that took a lot of work to build in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.356,
    "end": 1563.165,
    "text": "If you download Wikipedia or sorry, MediaWiki, the software underlying Wikipedia, it's all the same software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.145,
    "end": 1570.481,
    "text": " But you start to realize it doesn't have any of the cool governance structures that make Wikipedia great built in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.022,
    "end": 1575.511,
    "text": "Those are things that had to be added on top, built on kind of at the cultural layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.551,
    "end": 1578.758,
    "text": "And what would it look like to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.738,
    "end": 1591.709,
    "text": " to have tools that were more set up to enable people to have appropriate and diverse kinds of governance structures built into their tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.729,
    "end": 1593.253,
    "text": "Right now, if you want",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.571,
    "end": 1610.382,
    "text": " you know to practice democracy if you want to do things that are kind of recognizably democratic online you have to really bend over backwards you have to really really work against the biases of the system in order to get what you want what i hope for is a world where you know as the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.362,
    "end": 1624.641,
    "text": " The poet Peter Morin put it, a world where it's easier to be good, where the default settings are a little closer to the values that we claim to hold about how civic life should proceed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.815,
    "end": 1650.932,
    "text": " great thank you all right some questions from love evolve what are the patterns of governable spaces and please contrast physical governable spaces with digital slash virtual governable spaces yeah that's a good question in terms of patterns um one tool that my lab has built is called community rule it's a very prototype",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.368,
    "end": 1658.705,
    "text": " platform, communityrule.info, that enables people to author simple bylaws.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.825,
    "end": 1660.529,
    "text": "And we have some templates built in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.191,
    "end": 1663.035,
    "text": "We turned them into a book as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.717,
    "end": 1666.744,
    "text": "The templates are really, you know, they're things like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.045,
    "end": 1685.374,
    "text": " um an elected board a jury petitions consensus duocracy all these things are practices that exist offline as well as online in some contexts and in some respects i think of the challenge as like catching",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.793,
    "end": 1702.367,
    "text": " online spaces back up to what we've been doing offline um you know at the beginning of the book i compare a mailing list i was running to my mother's garden club and the garden club had much better governance tooling than the mailing list um but um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.87,
    "end": 1721.138,
    "text": " But at the same time, I think when you look at what people are doing in online contexts where self-governance has really been taking off, you see possibilities of things way beyond what we we do in offline spaces or at least just very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.619,
    "end": 1731.173,
    "text": "So, for instance, in those crypto contexts I was talking about, you know, often you're dealing with anonymous users, you're dealing with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1731.575,
    "end": 1736.702,
    "text": " You can't rely on a court system to address wrongdoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.063,
    "end": 1744.433,
    "text": "You have to design structures in a way that is kind of foreign to, say, running a bowling club, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.533,
    "end": 1754.106,
    "text": "Because the bowling club is able to build on a lot of infrastructure of the nation state and law and courts and police and all these things that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.086,
    "end": 1756.679,
    "text": " can be used to prevent wrongdoing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.363,
    "end": 1762.83,
    "text": "And in the context of network native organizations that aren't dependent on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.333,
    "end": 1768.861,
    "text": " on a nation state and all these things, you need to design governance around that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.881,
    "end": 1777.292,
    "text": "You need to make sure that there are consequences for harmful actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.013,
    "end": 1780.677,
    "text": "And so it invites a different kind of design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.737,
    "end": 1791.332,
    "text": "A lot of the crypto governance designs have involved some blend between financial stake and personhood and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.312,
    "end": 1810.473,
    "text": " attempts to build in this combination of like cryptography to secure a network and economic incentives, we would probably react really viscerally to the idea of economic incentives in like voting for a president.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.655,
    "end": 1814.738,
    "text": "But in the context of an online network,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.718,
    "end": 1822.871,
    "text": " it might make more sense because we don't have the infrastructure of citizenship and we don't have all these other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.931,
    "end": 1824.794,
    "text": "And maybe we don't want those things, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.854,
    "end": 1829.242,
    "text": "Because those things are protected by violent borders, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1829.262,
    "end": 1834.19,
    "text": "And we want to create online networks that are more inclusive than our nation states, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.271,
    "end": 1838.617,
    "text": "So to me, that is just thrilling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.797,
    "end": 1841.181,
    "text": "And part of what motivated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.6,
    "end": 1856.199,
    "text": " at the heart of what motivated me to write this book, as with my last few books, earlier one on the cooperative movement, and then the one before that on Occupy Wall Street and the movements of 2011.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.359,
    "end": 1861.506,
    "text": "It's just like the thrill at seeing people reinvent democracy in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.407,
    "end": 1863.709,
    "text": "That to me is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.398,
    "end": 1866.04,
    "text": " I just love seeing that happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.38,
    "end": 1868.883,
    "text": "And I just fall in love every time I experience it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.104,
    "end": 1873.668,
    "text": "And in some of these online spaces, I have seen that happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.728,
    "end": 1880.576,
    "text": "I've seen people go back to the drawing board and ask, no, wait, what would we actually want this structure to be set up as?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.237,
    "end": 1883.279,
    "text": "How would we actually want to self-govern?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.359,
    "end": 1884.841,
    "text": "And they make all kinds of mistakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.941,
    "end": 1891.628,
    "text": "And it's like embarrassing to watch and all these things, just like watching a social movement form is kind of cringy constantly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.668,
    "end": 1894.371,
    "text": "But still, you have this feeling like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.857,
    "end": 1922.687,
    "text": " this is this process is alive you know we are learning something new and it's that kind of moment that i hope more people can can somehow experience wow very cool what about the art in the book or perhaps more broadly how do you see visualizations and art and aesthetics and governance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.072,
    "end": 1924.394,
    "text": " Yeah, thanks for asking that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.794,
    "end": 1934.206,
    "text": "So I turn to a collaborator I've worked with before, including on the Governance Archaeology Project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.266,
    "end": 1940.894,
    "text": "I mentioned Daria Medic, who's a really brilliant artist and digital rights activist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.255,
    "end": 1948.524,
    "text": "And to me, I've always been really interested in the visual quality of books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.884,
    "end": 1950.987,
    "text": "My lab does a lot of really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.726,
    "end": 1981.429,
    "text": " um you know art heavy productions um and uh i'm you know i think the words and images are you know produce an important dialogue in particular i was interested in how to represent interfaces for this book um and if you look at you know the normal way of doing this is okay you do something on a web browser and you take a screenshot and i i did that initially i had a bunch of screenshots and i when i looked at them i thought you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.253,
    "end": 1992.347,
    "text": " It's not really clear here what is going on for the user in a kind of visceral way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.479,
    "end": 1995.003,
    "text": " What's going on phenomenologically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.364,
    "end": 1997.568,
    "text": "What does this interface feel like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.708,
    "end": 1999.491,
    "text": "It doesn't translate in a screenshot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.792,
    "end": 2015.179,
    "text": "When we're moving our way through online space and we're manipulating a mouse and a keyboard or we're using our fingers or we're manipulating the space, we see it really differently than just looking at a screen or looking at a page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.159,
    "end": 2040.627,
    "text": " And in order to show the aliveness of these spaces, I thought, okay, for this book, I really want to not just rely on the screenshots, but I want to create illustrations that surface and bring forward the significant parts of the interfaces I'm trying to highlight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.927,
    "end": 2045.938,
    "text": " and that reveal something about what using them might be like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.74,
    "end": 2054.438,
    "text": "And, you know, Daria is someone who I just really appreciate her recognition of that vision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.498,
    "end": 2057.164,
    "text": "She also has, we did this work in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.465,
    "end": 2066.776,
    "text": " during weekends at the Media Archaeology Lab, which is a lab here on campus that's a basement full of old computers that work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.397,
    "end": 2076.427,
    "text": "And so we were kind of surrounded by these retro interfaces and built the illustrations in that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.467,
    "end": 2079.591,
    "text": "Also, it was important to, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2079.908,
    "end": 2095.588,
    "text": " When you look at a book that's like 10 years old about the Internet and you look through the screenshots that are that are depicted in it and they all look like old and, you know, kind of it makes the book age more of interfaces drawing on kind of 80s aesthetics and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.61,
    "end": 2119.534,
    "text": " that's great um like to kind of represent that and the darker and the lighter the the the negative and the positive like visions for the interface like in figure three it's the admin options and there's the create rules there's so many options to create rules there's no um opportunity to ask",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.514,
    "end": 2146.298,
    "text": " what people feel like and then you can just jump down the wormhole with getting started before even creating a rule that's kind of like a nudge and then like contrasting with figure eight where it's like these overlapping overlays community fridge library for all transformative Justice Center and then at in the intersection of these multiple layers and function there's more like a neighborhood",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.278,
    "end": 2168.202,
    "text": " but one of those might extend beyond the neighborhood but then it's not as rich as like when it's overlapping yeah no it's um you know she also incorporated these these um kind of natural textures there are like fractal images there there are roots and and um you know the the goal was to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.57,
    "end": 2173.64,
    "text": " recognize the way in which we are always approaching interfaces through metaphors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.644,
    "end": 2186.646,
    "text": "Going back to the names of interface designs like window, mouse, pointer, everything is a metaphor to something else in crypto wallet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.626,
    "end": 2200.852,
    "text": " And and coin token, all every piece of language that we use to describe our online lives are full of metaphors to earlier regimes of of manipulation and design and and and power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.113,
    "end": 2203.858,
    "text": "And so we tried to capture that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.838,
    "end": 2212.749,
    "text": " not only the literal buttons and so forth on the interface, but also like what is the metaphor going through here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.769,
    "end": 2228.688,
    "text": "I thought about a lot like the early online services like GeoCities or there was eWorld from Apple, which like imagine the internet is like a city where you're going from building to building.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2228.748,
    "end": 2232.613,
    "text": "GeoCities was like you're in different cities, different districts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.593,
    "end": 2245.935,
    "text": " And I think those early experiments with language around the internet were really important in terms of like helping people imagine what was going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.316,
    "end": 2257.555,
    "text": "And I wanted to make sure that those metaphors were very present because that's exactly kind of the thrust of the book that these experiences of interfaces we have are not just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.957,
    "end": 2284.234,
    "text": " are not just some kind of mundane thing technical thing we have to work with they actually are shaping our our political imaginations in really fundamental ways that's awesome like a ballot or a request for information is more than the paper it's printed on it's different than it has causal efficacy in the real system that people are in so now to a quote from page 129",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.45,
    "end": 2308.517,
    "text": " near the end and then there's also like 50 pages of citations and index so that was very cool this section on 129 i think bookends shortly where as there's many powerful pieces in this last section but on 129 says implicit feudalism has been a kind of meta governance and like so much meta governance it too often hides beneath our notice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.497,
    "end": 2313.446,
    "text": " But changing how we govern requires being attentive to the meta governance at work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.466,
    "end": 2317.853,
    "text": "Shaping the background conditions of governance is itself a form of governance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.795,
    "end": 2320.478,
    "text": "So what about that quote?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.718,
    "end": 2324.565,
    "text": "How is it related to attention and perception and action and all of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.625,
    "end": 2336.769,
    "text": " Well, when we started this organization, the Meta Governance Project, which had already been named when I got involved, I hadn't come across that term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.789,
    "end": 2345.828,
    "text": "It just kind of sounded cool because for some reason these days, attaching meta to anything sounds cool to some people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.28,
    "end": 2357.559,
    "text": " And then I realized really through collaborators in that community that, oh, this is actually a term that political scientists have developed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.579,
    "end": 2363.209,
    "text": "And that just helped me understand all the more what we were up to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.189,
    "end": 2386.935,
    "text": " um what this this concept of meta governance came from was the recognition that okay if you look at the global order you know of like governments and ngos and all these things um there are there are the structures in place like the government of egypt but then there's also the meta structures that say okay here are the constraints in which the government of egypt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.915,
    "end": 2388.781,
    "text": " is going to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.864,
    "end": 2393.033,
    "text": "These are the structures within which NGOs operate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.096,
    "end": 2397.988,
    "text": "For instance, the government of Egypt is essentially a military dictatorship, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.593,
    "end": 2406.525,
    "text": " There are a bunch of reasons why it kind of makes sense to make it at least look like it's a constitutional democracy with a president.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.007,
    "end": 2421.006,
    "text": "And that's the nomenclature that gets used because it creates a kind of compatibility with the global community and creates this kind of perception and this kind of plausible deniability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.986,
    "end": 2448.445,
    "text": " um and that there is a kind of meta order underlying what is possible i mean even the idea of west folly and nation states the idea of like governments with a monopoly over land within certain specified borders is a form of meta governance at the end of the book i point to this wonderful website native hyphenland.ca that that maps indigenous territories and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.049,
    "end": 2450.07,
    "text": " They're overlapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.43,
    "end": 2456.135,
    "text": "I live on the land of principally Arapaho, Cheyenne, and Ute people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2456.516,
    "end": 2463.402,
    "text": "They historically have shared this land, used it in different ways, and used it in a migratory fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.502,
    "end": 2469.027,
    "text": "And they didn't claim a kind of monopoly over it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.708,
    "end": 2476.474,
    "text": "And so there are other ways of ordering our governance systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.825,
    "end": 2483.14,
    "text": " And what starts as a quibble about user interface design at the beginning of the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.44,
    "end": 2509.583,
    "text": " ends with this whole question about like hey you know we could have a very different way of understanding how we self how we govern ourselves when because actually in order to get to this interface design question we have to start thinking about the meta governance have to start thinking about what is the underlying set of rules that constrain and define the possible set of rules",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.563,
    "end": 2519.895,
    "text": " And once we start messing with that meta governance, a lot of things start opening up, a lot of pretty radical possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.015,
    "end": 2528.625,
    "text": "And I do hold out a kind of, you know, I'm a media studies professor, so I have to be cynical about most things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.665,
    "end": 2531.689,
    "text": "But, you know, I do kind of hold out a kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.669,
    "end": 2550.15,
    "text": " um hope in like some of the early dreams of the internet which is to create a world where people can connect across borders where um where geographic accidents of birth and so forth are less important and people can find their people and their communities regardless of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.738,
    "end": 2555.125,
    "text": " you know, of where they come from and what they look like and all these sorts of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2555.846,
    "end": 2573.573,
    "text": "And, you know, I think now the question is more like, how can we, rather than say regardless, how can we live in where we are, hold our identities, our multiple forms of identity, and also connect with each other through, you know, as like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.059,
    "end": 2577.904,
    "text": " true peers across the networks that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.204,
    "end": 2595.966,
    "text": "And in order to really make good on that promise, I think we need to revise the kind of meta governance of online life and imagine what it means to be a kind of true citizen, truly empowered with the right to co-govern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.351,
    "end": 2609.601,
    "text": " in these online spaces, rather than simply deferring to what I think are, in many respects, deeply dangerous and failed state-based institutions or corporations to run these things for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2611.403,
    "end": 2635.707,
    "text": " awesome thank you all right in our last minute some more questions love evolve writes pair of questions thoughts on the metaphor of community garden and more so gardening verb analogy to shared governing digital spaces question and thoughts on citizen assemblies and their rise in localities along with online tools and platforms to support these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.294,
    "end": 2637.295,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2637.335,
    "end": 2644.322,
    "text": "Yeah, the garden metaphor is really present, I hope, throughout.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.102,
    "end": 2656.193,
    "text": "The book starts out with a picnic in a park that I imagined as Prospect Park in New York City and talks about my mother's garden club.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.853,
    "end": 2666.082,
    "text": "I don't think I have done my best thinking around that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.72,
    "end": 2673.45,
    "text": " you know, deepening that set of relationships between human political governance and broader ecologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.811,
    "end": 2676.695,
    "text": "There's so much more to be done and there's so much more that others have done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.715,
    "end": 2686.23,
    "text": "I just wanted to make sure to have the nods in there, you know, to have that place, you know, to those kind of bookmarks to say, OK,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.548,
    "end": 2689.492,
    "text": " Let's not forget we're part of a broader ecology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.532,
    "end": 2694.74,
    "text": "Let's not forget that humans are not the only things managing resources on this earth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.4,
    "end": 2712.825,
    "text": "And so I hope that those nods just at least convey some recognition for the limitations of so much else that's in this book and my thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.447,
    "end": 2717.874,
    "text": " Let's see, the other question was, oh, it was around citizens assemblies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.535,
    "end": 2720.738,
    "text": "I think this is a really important opening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.219,
    "end": 2735.622,
    "text": "I hope everybody, you know, learns about it and follows what's going on in many parts of the world, in Africa, in South America, in Europe in particular, and Canada has been experimenting with these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.882,
    "end": 2738.046,
    "text": "We're starting to get some exploration in the US.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.486,
    "end": 2740.77,
    "text": "The idea here is to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.122,
    "end": 2758.115,
    "text": " to develop structures alongside or instead of representative elections to instead have randomly selected citizens making decisions or at least developing proposals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.816,
    "end": 2762.303,
    "text": "So, you know, for instance, this could look like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.688,
    "end": 2790.636,
    "text": " a government saying okay we're kind of stuck on this issue of how to address climate change this is the you know what the government of france has done and so we're going to have an assembly to come together and develop a new set of solutions that we could potentially adopt um there's some controversy in this in this scene of people doing this stuff around should we make these binding um i'm personally in favor of that i think we need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2791.021,
    "end": 2808.557,
    "text": " to um have you know essentially new channels for you know shaping our societies and this is a really powerful way we could do that to to really work against the bias of who ends up being a politician which is like somebody who thinks they should be a politician right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.537,
    "end": 2818.104,
    "text": " A lot of the people who I trust most in my life are the people who don't want a lot of power, who aren't motivated by seeking and retaining power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.147,
    "end": 2823.559,
    "text": "And so I would love to see those people have actually more power in our world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.539,
    "end": 2827.886,
    "text": " And this kind of assembly process is a way of achieving that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.028,
    "end": 2832.554,
    "text": "I think that these experiments have been extremely promising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.955,
    "end": 2841.89,
    "text": "There are some pretty cool ways in which people are now incorporating AI and other technologies, like with platforms like Polis and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.99,
    "end": 2848.821,
    "text": "There's an experiment going on at MIT right now around this, around integrating AI with a citizen assembly model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2848.801,
    "end": 2859.402,
    "text": " I've been advocating for that with my own city government, trying to identify ways in which we could use assemblies and other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.888,
    "end": 2866.293,
    "text": " processes like this to solve some of our most polarized challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.373,
    "end": 2884.088,
    "text": "But to me, this is just one example of what we could explore if we allowed ourselves to recognize that democracy is not just a set of fixed institutions that we have to defend against like authoritarians, but actually that democracy is an ongoing process that we constantly have to be reinventing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2884.149,
    "end": 2886.951,
    "text": "That was something Alexis de Tocqueville recognized, that W.E.B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.331,
    "end": 2889.473,
    "text": "Du Bois recognized, that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.453,
    "end": 2900.809,
    "text": " that, you know, I think just runs, you know, it's a deep part of this democratic tradition and something that is really being forgotten today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.849,
    "end": 2905.255,
    "text": "You know, I just plead that, you know, the best defense is offense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.275,
    "end": 2916.591,
    "text": "The best, the only way to help democracy thrive as a practice and vision is to keep reinventing it and to enable it to evolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.765,
    "end": 2930.175,
    "text": " thank you that really resonates with a lot of the discussion in autopoiesis and self reconstitution and regeneration within biological systems and that is kind of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.083,
    "end": 2953.986,
    "text": " naturalizing and the biopolitics of cyber physical systems which is a novel niche to be in so in the last minutes what is medigov slash your lab and your research going to be working towards how can people like learn more and do more and differently",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.81,
    "end": 2967.443,
    "text": " Yeah, so MediGov is a community that is open and on a good day welcoming that I really invite folks who are interested in this conversation to join.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.483,
    "end": 2969.805,
    "text": "You can find more information at MediGov.org.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.326,
    "end": 2973.369,
    "text": "A lot of the community lives in a Slack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.29,
    "end": 2978.194,
    "text": "So unfortunately, participation generally involves joining that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.254,
    "end": 2981.357,
    "text": "But we've got a bunch of different research projects going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.337,
    "end": 2984.56,
    "text": " as well as community explorations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.241,
    "end": 2995.091,
    "text": "I recently finished drafting a paper with some folks in that community on attention economies and governance design, exploring how to make those fit together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.131,
    "end": 3000.877,
    "text": "There's work on public AI, rethinking the political economy of AI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.937,
    "end": 3006.783,
    "text": "There's work on rethinking the governance of philanthropy and grant making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.624,
    "end": 3011.007,
    "text": "So there are a bunch of lines of work that are going on there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.987,
    "end": 3015.593,
    "text": " And my lab is the Media Economies Design Lab at CU Boulder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.613,
    "end": 3019.037,
    "text": "I primarily work with graduate students here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.057,
    "end": 3032.535,
    "text": "So if you're interested in doing, you know, especially master's or PhD work on around issues like democratic economies or online governance, I'd love to love to talk with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.137,
    "end": 3034.918,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.938,
    "end": 3038.783,
    "text": "Thank you very much for the work and for doing all this cool work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.315,
    "end": 3047.237,
    "text": " projects and more so until next time thank you Nathan absolutely such a pleasure to be on here thank you peace bye",
    "speaker": "SPEAKER_01"
  }
]