[
  {
    "start": 7.827,
    "end": 8.868,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.268,
    "end": 12.11,
    "text": "It's February 28th, 2023.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 13.071,
    "end": 18.134,
    "text": "It's ACT-INF guest stream number 37.1 and we're here with Baba Brinkman.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.775,
    "end": 22.137,
    "text": "This should be a great discussion and emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.518,
    "end": 24.719,
    "text": "Baba, thank you so much for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.059,
    "end": 27.001,
    "text": "Let's just jump right into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.881,
    "end": 29.783,
    "text": "What brings you to this day?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.423,
    "end": 31.304,
    "text": "How and who are you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.615,
    "end": 36.277,
    "text": " Thanks Daniel so much for having me here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.337,
    "end": 48.189,
    "text": "It's a real honor to join you and to dip into this community which I've been aware of for a while and like to try to follow the work as much as I can but I'm not a scientist myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.869,
    "end": 49.45,
    "text": "I'm a rapper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.47,
    "end": 50.751,
    "text": "I have been",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.872,
    "end": 55.155,
    "text": " exploring academic topics in hip-hop for quite a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.255,
    "end": 58.337,
    "text": "I did my master's thesis on Chaucer's Canterbury Tales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.777,
    "end": 70.687,
    "text": "I was a Renaissance and medieval scholar and I rewrote the Canterbury Tales into rap and I used to tour around the UK rapping my Wife of Bath's Tale and Miller's Tale renditions, which was a lot of fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.967,
    "end": 78.833,
    "text": "And then at one point, it was around 2007 or 2008, an evolutionary biologist, a geneticist saw my Canterbury Tales show",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.273,
    "end": 88.46,
    "text": " And he reached out to me and said, I love what you're doing for medieval literature, popularizing it with rap, but there's other topics that need rap popularization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.5,
    "end": 93.704,
    "text": "I think his exact words were, would you be willing to do for Darwin what you did for Chaucer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.164,
    "end": 98.067,
    "text": "And this was in the run-up to the Darwin Bicentennial in 2009.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.107,
    "end": 99.108,
    "text": "It was the 200th anniversary of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.289,
    "end": 116.558,
    "text": " the birth of Charles Darwin also the hundred and fiftieth anniversary of the publication of the Origin of Species I was of course a big fan of Darwin and of evolutionary theory but not very expert so I said to this scientist yes I'll write some raps about evolution but I could use some guidance he sent me a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.338,
    "end": 122.619,
    "text": " a whole bunch of suggested reading sources, books, peer-reviewed papers, everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.659,
    "end": 130.381,
    "text": "So I took a sort of six-month deep dive on the state of evolutionary theory, absorbed a whole bunch of books, and wrote these rhymes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.641,
    "end": 136.703,
    "text": "But his criteria was, your performances will be at academic seminars",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.163,
    "end": 142.785,
    "text": " with experts in Darwinian evolution across all kinds of social domains and psychology and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.825,
    "end": 154.549,
    "text": "So you need to make sure you represent the theory accurately, which means you have to run your lyrics by me so I can check them for scientific veracity, which I thought was a fair criteria for that kind of context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.569,
    "end": 155.369,
    "text": "So I sent him my lyrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.69,
    "end": 156.25,
    "text": "He gave me some...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.13,
    "end": 158.731,
    "text": " you know, some revision suggestions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.051,
    "end": 170.18,
    "text": "And then when I got up, when I was like set to perform the premiere of my Darwin show in February, on Darwin Day, February 12th, 2009, the scientist, his name is Mark Palin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.22,
    "end": 171.541,
    "text": "He was a bacterial geneticist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.861,
    "end": 175.444,
    "text": "He had this great intro, typical British tongue in cheek style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.504,
    "end": 183.05,
    "text": "He was like, I have fact checked the lyrics and you're about to witness the first rap show in history that's peer reviewed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.59,
    "end": 209.037,
    "text": " i was like peer-reviewed rap that's a great idea uh totally totally marks coinage uh but then right away the wheel started spinning like what other topics could you apply the peer-reviewed uh rap lens to so i did my evolution rap show for several years it was called the rap guide to evolution it played off broadway won an award at the edinburgh fringe festival and then other scientists started tugging me on the sleeve like oh the darwin raps are cool but could you do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.697,
    "end": 235.468,
    "text": " um wilderness conservation and threatened species ecology could you do climate change could you do neuroscience uh and and various uh great collaborations came from that so we now have a whole series of rap albums rap guides to various topics and my encounter with the active inference uh community and research base was when i was working on one called the rap guide to consciousness and uh professor anil seth is one of the uh i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.525,
    "end": 245.795,
    "text": " main proponents and contributors to the Bayesian brain active inference research paradigm today, and he was one of the main science advisors on the project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.096,
    "end": 254.925,
    "text": "So he was giving me Bayesian stuff to read, including Andy Clark's What's Next, highly technical review of all the literature, which I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.826,
    "end": 278.06,
    "text": " slogged my way through as a non-expert and ended up working bayesian ideas quite in a detailed way into the rap guide to consciousness show and what really resonated for me honestly i had never really paid attention to bayes theorem or or bayesian uh reasoning at all uh but i you know it took me a while to get my head around it but then i was like okay this is actually just a great uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.88,
    "end": 280.521,
    "text": " paraphrase of the scientific method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 280.821,
    "end": 283.962,
    "text": "And I was already a massive proponent of the scientific method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.322,
    "end": 301.048,
    "text": "And I was geeking out on the degree to which the brain may be a Bayesian engine at the microscopic level, producing a rational inquiry process that replicates the exact same Bayesian algorithm at the level of interactions with society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.648,
    "end": 304.889,
    "text": "So I did one song in the show called Good Bayesian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.069,
    "end": 330.528,
    "text": " Let me show you how to be a good Bayesian Change your predictions after taking information in And if you're thinking I'll be less than amazing Let's adjust those expectations And I was right away thinking about like how is a rap performance itself an instantiation of a Bayesian algorithm with the audience's expectations being revised in real time based on the rapper's performance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.928,
    "end": 341.12,
    "text": " and the rapper's expectations when creating the script of the performance about what reaction they'll get from the audience, which is a prior belief about the effectiveness of the performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.14,
    "end": 343.823,
    "text": "But when it's only a script, you don't actually know what's gonna work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 344.164,
    "end": 349.35,
    "text": "And then you do the performance, you see what gets the reaction, you revise your priors, and you also revise your script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.71,
    "end": 353.173,
    "text": " And that was a concept that I had already been rapping about in my evolution show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.193,
    "end": 363.721,
    "text": "I have a show, a whole song in that called Performance Feedback Revision, which instantiates the kind of evolutionary natural selection algorithm, but at the level of creative writing and performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.001,
    "end": 367.964,
    "text": "You write the script, you do the show, you see how people react, you go back and change the script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.264,
    "end": 376.03,
    "text": "And that's kind of like the genome being revised under phenotypic variants and how they end up surviving or not surviving, reproducing or not reproducing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.07,
    "end": 377.412,
    "text": "So, you know, this is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.392,
    "end": 389.037,
    "text": " I just started out rapping and trying to master the craft and each scientific topic I get into, I start going, oh, this actually helps me understand what's going on in rap much better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.057,
    "end": 401.063,
    "text": "And especially actually one of the examples I play with in the show, which is a lot of fun, is like call and response expectations of the audience, like a perfect kind of demonstration of a Bayesian moment when you go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.003,
    "end": 418.799,
    "text": " you know double take look twice calculate the odds roll the and when i do that the whole crowd would be like dice you know but the expectation of what the rhyme couplet's gonna be is a game rappers play all the time like finish the finish the bar right and that is entirely around a setup",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.54,
    "end": 434.415,
    "text": " of an expectation and the fulfillment of it, but then sometimes you can play with it and be like, yo, perceptual basics, ask Morpheus, we live in the, and I usually get the crowd being like, Matrix, back at me, but then other times I'd make it more difficult, like, yo, perceptual basics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.356,
    "end": 455.477,
    "text": " ladybugs like to eat and then like maybe one person out of a hundred would be like aphids and i'd be like yeah you know that that was a person that had the correct scientific bayesian priors to conclude my matrix basics aphids rhyme pattern but usually only a few get it and then everyone else is like ah there's the nerd over there or whatever so you know it's it's become like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.158,
    "end": 464.941,
    "text": " actually informed my creative process in terms of how I try to set up and violate expectations in real time, psychologically with an audience when I'm performing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.081,
    "end": 472.123,
    "text": "And I will be honest that my close reading of the research was several years ago at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.783,
    "end": 476.327,
    "text": " The Rap Guide to Consciousness came out in 2017.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.367,
    "end": 478.99,
    "text": "18, I was performing it off-Broadway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.01,
    "end": 485.497,
    "text": "19, I was touring it around theaters in the UK and still performing it off-Broadway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.577,
    "end": 489.501,
    "text": "And then 20, of course, all performances ceased altogether.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.041,
    "end": 495.063,
    "text": " And I had to think about what rappers do in pandemics when they can't get on stages and see crowds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.143,
    "end": 502.406,
    "text": "So yeah, we can talk during this interview about my new project, which is a custom rap agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.726,
    "end": 513.23,
    "text": "You can see me repping it right here, Event Rap, which could be fun to talk about in terms of the event inference elements of Active Inference and Bayesian Analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.25,
    "end": 529.261,
    "text": " you know, I think some of the aspects of what attract me to events, what attracted me to events during the pandemics and still does as a sort of a catalyst for good art and for rap might have to do with active inference expectations and experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.901,
    "end": 532.403,
    "text": "But I don't know this literature very closely at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.483,
    "end": 535.905,
    "text": "So yeah, that's basically brings us up to the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.985,
    "end": 536.966,
    "text": "Hopefully that was a good summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.607,
    "end": 539.148,
    "text": "Amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.808,
    "end": 540.368,
    "text": "Just great to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.38,
    "end": 563.232,
    "text": " connect and to be able to share this moment with someone who's seen it from all sides in front of the stage on stage behind stage inside the mind real recognize real so there's a lot out there and just like as if we were talking about a paper namaste real recognize real namaste if we were talking about a paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.141,
    "end": 567.562,
    "text": " we would read between the lines and reference out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.262,
    "end": 578.486,
    "text": "And similarly, there's so much that can be referenced out and people can listen to the original creations and see what that primary text looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.626,
    "end": 588.489,
    "text": "And the fact that it's a orally performed text for much of human development in history was our real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.509,
    "end": 589.65,
    "text": "So yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.492,
    "end": 597.178,
    "text": " whether something is written is increasingly fluid these days with speech to text and text to speech.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.218,
    "end": 600.24,
    "text": "So there's going to be so many great avenues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.46,
    "end": 602.522,
    "text": "Let's just start with event-based cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.722,
    "end": 606.545,
    "text": "So what is an event from the cognitive perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.947,
    "end": 614.092,
    "text": "I mean, I was trying to find that definition with Google about 20 minutes ago, so I didn't sound like an idiot in this podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.132,
    "end": 616.814,
    "text": "So I think it's a, you know, a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.765,
    "end": 622.727,
    "text": " it's a perceptual construct, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.767,
    "end": 632.778,
    "text": "It is the perception of an entity that there is some kind of instantiation of action that is circumscribed in time, that has a beginning and an end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.499,
    "end": 638.484,
    "text": "And if it's not perceived as having a beginning and an end by some cognitive entity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.185,
    "end": 650.748,
    "text": " historically organisms, but in the future also probably AIs, then it's not, you know, then it's not treated as an event, which means an event could be a thousand years or five seconds or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.768,
    "end": 659.71,
    "text": "It's actually interesting how the kind of the scientific definition of it in active inference research really is like a narrative definition in a way, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.77,
    "end": 661.35,
    "text": "It's like, it's like, it's a story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.67,
    "end": 687.839,
    "text": " something you can tell a story about something you can construct a story around uh is an event is that pretty close to how scientists think about it yeah i mean already so much there you're right it does not have to be tied to a given amount of clock time which we might call chronology hearkening back to chronos that sort of decimal point time but action takes place",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.102,
    "end": 696.107,
    "text": " in the understanding of the actor or the observer in this timescale of action or kairos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.848,
    "end": 698.889,
    "text": "And that timescale of action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.992,
    "end": 723.109,
    "text": " may be narrative and that is what you invoke with the beginning middle and end rising and falling cultural patterns that's not necessarily happening on the clock just because you can run a stopwatch while somebody's reciting canterbury tales doesn't mean that it'd be twice as exciting if they spoke twice as fast or that you could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.412,
    "end": 733.801,
    "text": " map in some linear way what was happening on the watch face to what's happening in the mind of audience who have different familiarity with the material",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.634,
    "end": 736.875,
    "text": " or a historical study context as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.896,
    "end": 743.76,
    "text": "It just made me think of like, if I do a 10 minute long rap of the Wife of Bath's Tale, then that's an event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.98,
    "end": 745.581,
    "text": "I performed the Wife of Bath's Tale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.621,
    "end": 747.062,
    "text": "There was an audience that witnessed it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.122,
    "end": 748.803,
    "text": "You could circumscribe it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.143,
    "end": 755.127,
    "text": "But you could also, you know, so you could do a scientific study on what occurred during that event, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.427,
    "end": 762.492,
    "text": "But you could also choose to study the event of humanity's retelling of the story of the Wife of Bath's Tale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.952,
    "end": 765.673,
    "text": " which is a story that takes place in King Arthur's court.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.073,
    "end": 774.857,
    "text": "So now we know where the mythology has to have started, which is around, forgive me medievalists, but let's say like four or 500 AD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.297,
    "end": 785.741,
    "text": "And then whenever the historical King Arthur's court existed, and then there was an oral mythology that adhered to that over the course of a period of time, as people told folk tales about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.181,
    "end": 788.302,
    "text": "And then in the year 1400, Geoffrey Chaucer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.003,
    "end": 817.044,
    "text": " well i think he perished in 1400 so he was born in the 1330s but he writes the wife of bath tale at some point as a written representation of the oral narrative and then that vellum manuscript is passed down into college reading lists and i read it in 1998 and write a rap version of it so any study of humanity's engagement with the story of the wife of bastale has to really start uh you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.825,
    "end": 832.727,
    "text": " in the year 400 and the last time I wrapped my rap version of the Wife of Bastail at the Edinburgh Fringe Festival, which was a couple years ago, and no event that accounts for the phenomenon of the telling of that story can leave any of those instantiations out, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.866,
    "end": 834.226,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 834.426,
    "end": 843.11,
    "text": "It's like the earlier events are our prior or our generative process, which is our niche that events happen in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.39,
    "end": 847.612,
    "text": "Our generative model, our cognitive model exists within the niche, the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.452,
    "end": 852.393,
    "text": "And those prior events, quite literally, are our priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.134,
    "end": 857.896,
    "text": "And there's no last chapter because the observations keep rolling in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.276,
    "end": 878.81,
    "text": " and whether the observation is exactly as expected whether that performance of that symphony is exactly as expected whether that performance of the hamburger or of the portrait even if it's exactly as expected it still is a new observation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.733,
    "end": 883.054,
    "text": " And then what is as expected?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.314,
    "end": 887.096,
    "text": "Well, that's in the encultured cognitive mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 887.896,
    "end": 895.719,
    "text": "And that is this sometimes implicit reference point that novelty is contrasted against.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.259,
    "end": 900.361,
    "text": "Like, well, I knew I was gonna get a rap summary, but I didn't know it'd be that funny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.041,
    "end": 903.922,
    "text": "Or I didn't know I was gonna get a rap summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.442,
    "end": 908.204,
    "text": "These are like different levels and types of novelty about the story of a moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.541,
    "end": 923.67,
    "text": " Or look at how he changed the story from the archival version, because there's definitely a completely different experience of people that are intimately familiar with Chaucer's version and ones who are hearing the story for the first time and encountering each of the characters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.69,
    "end": 930.695,
    "text": "This is the kind of expectation of how accurately will the story be recounted in this new version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.905,
    "end": 934.586,
    "text": " Also, let me just expand on something that you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.626,
    "end": 939.607,
    "text": "You said there's no last prior because there's constant reinstantiations and updating, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.667,
    "end": 945.568,
    "text": "But there is a last prior from the perspective of a temporary analysis of an event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.928,
    "end": 951.569,
    "text": "You can set a sort of artificial beginning and end for the purpose of doing an analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.609,
    "end": 954.35,
    "text": "And that's, I guess, where you're able to apply mathematics to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.37,
    "end": 955.23,
    "text": "But you always have to like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.13,
    "end": 961.335,
    "text": " you know, keep in mind that it's a chosen beginning and end point within a larger unfolding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.436,
    "end": 965.619,
    "text": "Yeah, and that's very resonant with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 966.536,
    "end": 971.921,
    "text": " my experience as a researcher, which is like, there is a final data point in any time series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.682,
    "end": 979.108,
    "text": "At some point, the fMRI machine or the ant foraging watching machine, you just turn it off for the day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.768,
    "end": 989.917,
    "text": "So there is empirically something that's very addressable, but in the general case, it's not the case that a time series algorithm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.412,
    "end": 1017.6,
    "text": " says what the last observation is and we might even say that that's a deflationary perspective on history because rather than debating whether somebody has released the definitive american novel or the last word on this symphony it's like well the last note of their symphony was non-controversially the last note of their symphony but the question about the discourse and the community",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.925,
    "end": 1026.684,
    "text": " Of course there's no last word in this open-ended space and art is always like surfing on that open space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.859,
    "end": 1042.153,
    "text": " One of the things I remember from my comparative literature courses is this idea of the anxiety of influence and how poets have their, I think it's maybe Harold Bloom that wrote that, but you know, poets have a sense of needing to create something new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.193,
    "end": 1045.176,
    "text": "I think it's general, like applies to art, all artists, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.517,
    "end": 1050.902,
    "text": "Theater, rappers, you know, this is like imagination conjures, but of course,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.883,
    "end": 1055.565,
    "text": " great artists produced on the shoulders of a lot of influence in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.905,
    "end": 1066.751,
    "text": "And one of the measures in an English literature course of whether a poem rises to the level of worthiness to be studied at university is the degree of impact it had afterwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.231,
    "end": 1070.953,
    "text": "And that can sometimes be measured by how many imitators it generated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.293,
    "end": 1077.797,
    "text": "So one thing I always find fascinating is you read 14th century literature and Chaucer stands out as the main poet, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.397,
    "end": 1084.939,
    "text": " You barely read any 15th century literature in an English Lit course, or at least when I was in school in the 90s, that was the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.299,
    "end": 1086.499,
    "text": "I've just gone all blurry, haven't I?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.539,
    "end": 1088.68,
    "text": "I want to see what's going on with my camera here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.7,
    "end": 1091.08,
    "text": "There we go, refocused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.501,
    "end": 1093.801,
    "text": "The camera has its own priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.701,
    "end": 1099.883,
    "text": "So, you know, like Chaucer shut down English literature for like 100 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.343,
    "end": 1105.124,
    "text": "And when I was in an English Lit survey course, I'm like, why do we read Chaucer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.464,
    "end": 1108.847,
    "text": " in the 14th century, and the next poet we read is the 16th century.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.228,
    "end": 1110.589,
    "text": "What happened to the 15th century?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.949,
    "end": 1127.345,
    "text": "And my professors were like, well, every poet that wrote poetry in the 15th century was seen as so much of a Chaucer knockoff and derivative because his style was so influential that none of them rise to the level of having contributed anything distinctive until over 100 years later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.385,
    "end": 1129.768,
    "text": "I was like, wow, now that is impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.328,
    "end": 1134.934,
    "text": " That is like as much impact as you, but ironically, it's like negative impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.215,
    "end": 1142.204,
    "text": "Like the most significant poem shuts everybody up because they don't dare to do anything except for imitate it in a totally derivative way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.705,
    "end": 1147.692,
    "text": "But creating something new out of it, that's what creates the most fecundity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.092,
    "end": 1165.987,
    "text": " in art right like you create something and a lot of people are like oh i love this i'm going to take it and adapt it and run with it that's one of the things i love about hip-hop is it's so much about sampling and flipping and remixing and it's not afraid of any other genre because its attitude is you can take any genre and make it better by adding beats and rhymes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.727,
    "end": 1191.895,
    "text": " uh but but really effective art shuts it down i think andrew marvell was also known as like the last carpe diem poem writer because he wrote such a perfect carpe diem poem gather ye rosebuds while you may that no one really bothered with that genre anymore because nobody could do as well as andrew marvell and he wrote the last great garden poem as well english garden poem and it's like you know how do you measure your success as an artist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.475,
    "end": 1198.201,
    "text": " by the degree to which you've created something that's so intimidating for everybody else that they don't even bother with the genre anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.601,
    "end": 1207.971,
    "text": "And now you're measuring your success by the deletion of genres from the cultural milieu, which creates space for other people to invent more genres.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.011,
    "end": 1210.473,
    "text": "This is an interesting way to measure success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.594,
    "end": 1211.734,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.311,
    "end": 1224.12,
    "text": " I'm going to pick up on that pattern and bring it into attention and the Bayesian perspective on attention, which is sometimes equated with precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.06,
    "end": 1234.468,
    "text": "So if we're paying a lot of attention to a sensory input, a lot of attention, high precision, we're really putting a lot of credence in that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.568,
    "end": 1236.45,
    "text": "It's overriding our priors a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.87,
    "end": 1241.273,
    "text": "We're updating our beliefs to basically be what we're paying attention to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.133,
    "end": 1250.543,
    "text": " And then the other case would be, we're not paying attention, we have low precision or high uncertainty, and we're not updating our beliefs at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.923,
    "end": 1255.348,
    "text": "That's what we basically conversationally mean when we say we're not paying attention to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.829,
    "end": 1257.951,
    "text": "Like I couldn't tell you what it was, it didn't leave an impact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.832,
    "end": 1284.847,
    "text": " and when you were talking about this cultural evolutionary process i thought about cultures paying attention to genres and works because if there was one work that was the object of attention it would be in the spotlight but attention is like a spotlight and if it's a laser on one thing it's not on everything else and if there's no work that's rising to attention",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.908,
    "end": 1294.935,
    "text": " then there's this proliferation of hypotheses, cultural endeavors, but no one of them will necessarily be shared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1295.696,
    "end": 1313.631,
    "text": "And so art that resonates with communities and with your friends, it's like in this gray zone where it has to have enough attention on it so that there can be a culture of hip hop or the Grateful Dead or whatever it may be, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.723,
    "end": 1344.485,
    "text": " not one that is so attended to that it gets burnt by the laser yeah it's like if everyone's only paying attention to one thing then that's actually very stifling for cultural flourishing because it's you know you don't you don't get all the variants you get these like totally dominant moments you can see that at the macro level in history but it also just happens in social media all the time too right everybody's talking about one thing and then it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.643,
    "end": 1372.835,
    "text": " know what what if that thing is not interesting to you or you know what what is the upshot of that com of that dominance of attention in active inference we sometimes talk about regimes of attention and there have been some great recent papers on cultural regimes of attention and that kind of takes that basal bayesian idea of attention as precision to stimuli and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.875,
    "end": 1394.217,
    "text": " and it puts it into the dynamical space where the regime of attention might be like the sequence of eye saccades across a page so that is a complex pattern with attention moving and we can just call that broadly like a regime of attention or attention and action and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.15,
    "end": 1401.493,
    "text": " In some sense, that's what culture is or can be described as.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.353,
    "end": 1414.501,
    "text": "Is regime just a kind of summary of where you happen to look or is the intent that it's like there is some kind of intentional control of attention that is inherent to the work that's being attended to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.981,
    "end": 1437.928,
    "text": " like you can expect people to look others in the eyes when you're seeing a video or a photo and the regime is that like there must be some implied like uh maybe in in inbuilt psychology of things that we tend to find more fascinating is that is that what's implied by it or a lot there the word regime does have a slight connotation of something that's imposed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.588,
    "end": 1450.477,
    "text": " Whereas it is in the neutral sense describing merely the dynamics and then what those shared regimes of attention might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.358,
    "end": 1457.663,
    "text": "Like we're going to approach each other this way, making this kind of eye contact and make these kinds of gestures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.343,
    "end": 1464.228,
    "text": "That's how we're going to be reducing our uncertainty about who we are and what this event is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.869,
    "end": 1468.371,
    "text": "And without those shibboleths,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.372,
    "end": 1477.38,
    "text": " secret words and implicit or explicit processes and rituals, it's hard to lock on culturally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.522,
    "end": 1478.662,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1480.148,
    "end": 1482.41,
    "text": " there's so many ways to go from there, but I'll leave it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.45,
    "end": 1482.67,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.47,
    "end": 1498.74,
    "text": "I'm always, whenever I see chivalrous and norms being acted out, I'm always trying to, I mean, obviously there's scientific studies that are trying to unpack this as well, but my favorite thing to speculate about is to what degree is this culturally constructed in an open-ended way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.221,
    "end": 1508.807,
    "text": "And to what degree is the cultural aspects of it relying on an underlying cognitive psychology that is inherited from evolution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.227,
    "end": 1509.908,
    "text": "Like for instance,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.789,
    "end": 1519.816,
    "text": " If you're having a conversation with somebody one-on-one and you never look them in the eyes, that's inherently suspicious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.856,
    "end": 1520.877,
    "text": "What's wrong with this person?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.937,
    "end": 1521.958,
    "text": "They won't look me in the eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.018,
    "end": 1522.738,
    "text": "Are they lying to me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.758,
    "end": 1523.759,
    "text": "Do they have something to hide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.88,
    "end": 1532.006,
    "text": "That response that you get emotionally and in terms of somebody's disposition towards you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.422,
    "end": 1537.544,
    "text": " I would find that very unlikely to be 100% culturally constructed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.984,
    "end": 1542.247,
    "text": "Could you imagine a society that was egalitarian where they never looked each other in the eyes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.667,
    "end": 1555.255,
    "text": "I can imagine societies where aristocrats prohibit people below them in the hierarchy from looking in the eyes because it's seen as a sign of disrespect, which of course is entirely based on primate behavior when you're challenging an alpha",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1555.795,
    "end": 1557.737,
    "text": " if you look at them for too long, then they'll bite you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.797,
    "end": 1565.525,
    "text": "And if you got to like cast your eyes down to demonstrate your submissiveness or whatever, like humans have replicated some of these very deep mammalian instincts that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.565,
    "end": 1565.785,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.825,
    "end": 1578.158,
    "text": "But like, are we malleable enough that a society could ever evolve with the norm of nobody ever looks the other person in the eyes or would that street swim upstream so strongly against our, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.758,
    "end": 1601.831,
    "text": " instinctive ways of measuring our degrees of trust and affinity towards each other that that culture would just inherently fail and and not manage to be represented in the panoply of cultures going forward i'll try to give a thought on that calling back to this attention discussion so the movement of the eyes does provide information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.813,
    "end": 1609.817,
    "text": " Whether it's deceptive or not, it is an outlet of information from the person who you could be looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.537,
    "end": 1612.978,
    "text": "So to neglect- Including attention itself, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.079,
    "end": 1615.82,
    "text": "It's where you look to find out if someone's paying attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.74,
    "end": 1618.181,
    "text": "The eyes are the window to the soul.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.521,
    "end": 1620.342,
    "text": "Maybe that wasn't just about the cornea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.603,
    "end": 1623.744,
    "text": "Attention as the window to the soul.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.605,
    "end": 1625.565,
    "text": "It was about game theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.246,
    "end": 1630.468,
    "text": "And so to neglect this fountain of information,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1632.952,
    "end": 1639.747,
    "text": " You have to have a cultural clamp on it, like a secondary reason to not look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.646,
    "end": 1649.931,
    "text": " because it is providing so much info on a millisecond by millisecond level in ways that aren't always even expressible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.311,
    "end": 1654.573,
    "text": "Like pupil diameter has a lot to do with arousal and psychologically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.034,
    "end": 1657.495,
    "text": "People may or may not know about that empirically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.295,
    "end": 1664.459,
    "text": "And I doubt it was shown empirically until we had cameras and measuring devices and millimeters and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.399,
    "end": 1671.261,
    "text": " but it can still play a role implicitly in behaviors and heuristics and strategies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.921,
    "end": 1677.722,
    "text": "And so it's like, if we're paying attention to our embodiment, certain things will arise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.343,
    "end": 1694.207,
    "text": "And in situations where the inherited prior has to overrule or reinterpret those first principles takes, those are like scenarios with an attention to the past",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.299,
    "end": 1715.013,
    "text": " for better and worse, that is shading our experience interpretation versus the prima facie situational awareness that convergently evolves to a few attractors, like looking at informative sources of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.997,
    "end": 1717.558,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.658,
    "end": 1731.292,
    "text": "And just because there's a lot of swimming upstream of sort of instinctive cognition necessary for cultural norms to play out doesn't necessarily mean that they're doomed to fail or, you know, a waste of time or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.332,
    "end": 1736.277,
    "text": "You could almost say like the whole scientific enterprise, complex mathematics, even reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.297,
    "end": 1737.859,
    "text": "None of these things are, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.459,
    "end": 1740.501,
    "text": " instinctively evolved, they're all very recent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.621,
    "end": 1754.533,
    "text": "And we're like building them on top of our older cognition, and architecture and instincts, but they're, you know, gloriously culturally constructed, and I would say, like, worthy of the effort of swimming upstream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.358,
    "end": 1775.877,
    "text": " the keyboard q w e r t y oh well the keyboard doesn't have to be that way well yeah but we don't need keyboards and we haven't always had them and we won't always have them and left to right reading it could be right to left or up to down or it could be any but we haven't even had inscription technology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.818,
    "end": 1780.163,
    "text": " So maybe let me bring it back to your experience with hip hop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.824,
    "end": 1792.541,
    "text": "How has the generative process, the extended cognitive niche of technology supported the remix culture and how does that manifest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.602,
    "end": 1797.144,
    "text": " Well, I think I'll start with some of the good ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1797.965,
    "end": 1805.41,
    "text": "I used to go to a studio and sit with producers and hear their beats and, you know, like, let's go with that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.45,
    "end": 1809.113,
    "text": "And then like try lyrics I had pre-written or sometimes write the track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.694,
    "end": 1812.296,
    "text": "It was really expensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.453,
    "end": 1815.014,
    "text": " fun interactively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.435,
    "end": 1823.061,
    "text": "I do miss the in-person studio experience, but all the previous rap records I've made for the past 10 years were all made remotely with Dropbox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.442,
    "end": 1827.725,
    "text": "So the rappers, you know, send or the producers send me a folder full of beats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.086,
    "end": 1829.587,
    "text": "I choose the one that I like the best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.647,
    "end": 1830.328,
    "text": "I write the rap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.628,
    "end": 1831.989,
    "text": "I record the raps at home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.349,
    "end": 1837.254,
    "text": "I send them to the producer and I've got like a track where the producer is based in Seattle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.674,
    "end": 1841.037,
    "text": "The session musician is playing keys is in Vancouver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.537,
    "end": 1852.462,
    "text": " The vocalist is doing the song, you know, from his place in Toronto and I'm in Long Island, like taking all the different parts and editing them and then sending them to the mix engineer and the master.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1852.482,
    "end": 1855.664,
    "text": "You know, it's like this great distributed collaborative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.004,
    "end": 1859.806,
    "text": "And, you know, that's even by today's standard, that's analog, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.986,
    "end": 1870.071,
    "text": "That's like sharing files in a Dropbox and throwing them into your local studio and sort of like measuring each input against the expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.078,
    "end": 1875.142,
    "text": " a song to sound ultimately and giving people feedback and asking for revisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.142,
    "end": 1886.351,
    "text": "But I think there are now AI sort of web three platforms where you can all be in the same virtual room and the latency is worked out and you're collaborating musically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.591,
    "end": 1887.772,
    "text": "Haven't used those yet, but I've been",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.753,
    "end": 1890.115,
    "text": " I've been scoping them out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1890.836,
    "end": 1893.24,
    "text": "So that's been a very, I think that's generally been positive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.28,
    "end": 1895.884,
    "text": "It's brought the cost down and it's allowed for real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.305,
    "end": 1900.811,
    "text": "Well, not quite real time, but like ongoing collaboration with creatives across different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.344,
    "end": 1919.498,
    "text": " But then the kind of parallel revolution that's happened is from selling CDs, selling tapes, selling CDs, and then Spotify takes over and you're getting like fractions of pennies on the stream and your music is going into this massive archive of every kind of music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.978,
    "end": 1945.998,
    "text": " and you're only getting paid based on how much your music is listened to compared to every other music that's on there they're partitioning their subscription fees and it's really it's become much harder i think for a lot of musicians to make a living from the sale of music and so over the past 10 to 15 years that process really pushed a lot of artists into really just basing all their income on live performance like set up gigs and and rock shows and sell merch at shows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.418,
    "end": 1952.84,
    "text": " If you want any expectation of income from music sales, you better be there meeting the fans, shaking their hand and sending them a CD in person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.42,
    "end": 1956.441,
    "text": "Then COVID shut that down, you know, for a couple of years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.501,
    "end": 1957.441,
    "text": "Anyway, it's coming back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.541,
    "end": 1968.004,
    "text": "But my estimation during the pandemic was even as it comes back, it's going to, you know, there's going to be people that are more reluctant to travel to shows and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.644,
    "end": 1996.324,
    "text": " you know do that have the in-person experience even when public health notices say it's safe because people have different degrees of paranoia and anxiety and they won't feel as comfortable even if it is objectively safe uh so you know pivoting to this uh event rap game was partially based on an analysis of what's happening with the industry and how hard it is to make it as an artist and part of that has been uh you know a technology driven process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.336,
    "end": 2003.198,
    "text": " Wow, also many ways to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.059,
    "end": 2007.341,
    "text": "Let's kind of return to those expectations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.722,
    "end": 2018.069,
    "text": "And I think there'll be some ways that your experience with expectations might map or resonate to the Bayesian brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.71,
    "end": 2028.677,
    "text": "So say a little bit about what are your expectations when you're coming out to a performance event",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.807,
    "end": 2031.828,
    "text": " whatever setting that you choose to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.848,
    "end": 2042.031,
    "text": "And then how does that interface with, or to what extent do you even preempt or pregame the audience's expectation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.051,
    "end": 2045.012,
    "text": "Do you just call it like you see it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.552,
    "end": 2052.755,
    "text": "Or are you looking to finesse your performance based upon what you rightly or wrongly believe their expectations to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.281,
    "end": 2070.558,
    "text": " Well, there's an ambient characteristic that I kind of just take for granted, which is that I'm not very famous, but I have a hardcore boutique fan base of the science nerds and science rap nerds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.798,
    "end": 2073.701,
    "text": "So if I'm in front of a crowd, most of the time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.662,
    "end": 2076.664,
    "text": " more than half of them don't even know who I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.944,
    "end": 2079.226,
    "text": "And I've got to introduce myself to them for the first time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.706,
    "end": 2083.869,
    "text": "And some portion of them have seen a bunch of my shows and they're fans and they're like, oh, it's his next show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.37,
    "end": 2089.854,
    "text": "But I don't really write to address an audience that knows me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.994,
    "end": 2095.519,
    "text": "Generally, my assumption is that they don't and I'm constantly reintroducing myself and finding new fans that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.079,
    "end": 2100.242,
    "text": " And let's be honest, like you see me walking down the street, you're not going to be like, there goes a rapper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.582,
    "end": 2108.088,
    "text": "You know, the Bayesian priors of my ability to perform as a rapper are low and they have been since I started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.208,
    "end": 2112.171,
    "text": "I was this bookish, you know, suburban Canadian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.851,
    "end": 2132.423,
    "text": " woodsy teenager like i want to be a rapper but no one's gonna believe i'm a rapper so i better get really good at rapping and also you know just it is a bit of a choice not to like dress overtly to hip-hop or talk overtly to hip-hop it's like there is a hip-hop persona that a lot of artists adopt",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.394,
    "end": 2136.497,
    "text": " maybe becomes natural to them and they could say, this is who I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.517,
    "end": 2154.534,
    "text": "There was either a conscious or unconscious decision at some point in their growth where they became more seemingly hip hop, maybe to reduce the cognitive dissonance of the lack of expectations of them being able to rap from their audience, maybe for other reasons, maybe peer influence, maybe they just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.094,
    "end": 2158.256,
    "text": " you know, none of that analysis really matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.316,
    "end": 2160.358,
    "text": "And they just, they felt it, they were passionate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.398,
    "end": 2161.859,
    "text": "So they started adopting the lingo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.899,
    "end": 2166.002,
    "text": "And, you know, I kind of always partitioned rap a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.042,
    "end": 2174.428,
    "text": "Like when I'm performing, I'm a rapper and my profession is I'm a rapper, but I'm not going to like make myself a cup of tea in a rap style, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.608,
    "end": 2185.913,
    "text": " I'm saying is like, I do distinguish a little bit between the domains of my life and what that partially what that means is people don't mark me and expect me to be good at it or to be able to deliver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2186.253,
    "end": 2188.754,
    "text": "And then I get to, you know, there's a cost benefit there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.814,
    "end": 2193.917,
    "text": "For one thing, like the skepticism might lose me potential opportunities to perform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.697,
    "end": 2200.219,
    "text": " or potential members of the audience who like see me setting up the mic and they're like, that guy, I don't think so, and then leave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.979,
    "end": 2214.104,
    "text": "But on the other hand, the transformation I get to take an audience through as they realize what they're experiencing and feel their expectations being overturned is actually, I think, really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.884,
    "end": 2216.544,
    "text": " part of the joy of the experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.864,
    "end": 2225.347,
    "text": "It's an expectation shattering experience when someone that you don't expect to be able to deliver in a certain art form just really does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.967,
    "end": 2232.188,
    "text": "And I kind of play with that in the comedy and tease the audience for having low expectations of me and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.208,
    "end": 2233.929,
    "text": "But then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.213,
    "end": 2240.455,
    "text": " Part of this is contingent on me just never getting that famous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.116,
    "end": 2251.244,
    "text": "If there was a point at which I had achieved as much of a fan base as Eminem, my writing style about, you don't think I'm going to be able to rap, do you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.304,
    "end": 2254.246,
    "text": "Well, watch this, would, of course, sound pointless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.566,
    "end": 2257.589,
    "text": "Kind of like he stopped writing about being poor after his first album.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.069,
    "end": 2262.492,
    "text": "And the first line of his second album was, they say I can't rap about being broke no more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.673,
    "end": 2271.258,
    "text": " Just like naming the critical reception of his transition from album one to millionaire album two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.278,
    "end": 2275.06,
    "text": "So, you know, I think there is a kind of interplay between artists and their audiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.52,
    "end": 2281.464,
    "text": "And, you know, I stay niche and I write to the expectations of that niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.206,
    "end": 2287.188,
    "text": "We're all in our own niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.528,
    "end": 2290.73,
    "text": "So I hope that part doesn't change, but very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.85,
    "end": 2314.233,
    "text": " when we attend we don't even need to say pay attention and use this economic modality but when we attend to our experience and update our priors just statistically that's called learning and i think that speaks to this synthesis with the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.447,
    "end": 2340.112,
    "text": " language the lexicon the slang or as we might call it the active inference ontology speaks across a continuum from the experiential and the folk psychological the day-to-day it's the same terms with the same authentic relationships that are increasingly becoming embodied in our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.01,
    "end": 2359.943,
    "text": " intelligence algorithms again not even calling it artificial intelligence algorithms because they're extensions into the niche from us so these cognitive models that are being deployed ai artificial intelligence or large language models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.075,
    "end": 2369.231,
    "text": " they are cognitive entities and they're participating in these ecosystems of engagements with us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.812,
    "end": 2370.032,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2372.056,
    "end": 2372.397,
    "text": "I, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.871,
    "end": 2380.617,
    "text": " I had a conversation with the new ChatGPT driven Bing engine last night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.717,
    "end": 2385.281,
    "text": "I just got added to Bing, the AI driven version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.721,
    "end": 2386.382,
    "text": "It's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.642,
    "end": 2397.011,
    "text": "The first thing I did when ChatGPT came out was I said, write me a rap song in the style of Snoop that explains how to change the oil in a Honda CRV.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.387,
    "end": 2402.088,
    "text": " Because that's exactly the kind of project that we do with Eventwrap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.128,
    "end": 2417.852,
    "text": "Eventwrap is like a team of skilled, professional, 10-year veteran artists that'll make you a song on any topic and either record it as a video that you can share as a kind of public engagement or explainer, or come in live to one of your events, virtual or in person, and perform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.112,
    "end": 2420.213,
    "text": "But it's a topical rap agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.233,
    "end": 2425.294,
    "text": "It's like all the rappers have their own catalogs, but they don't perform them at the events we book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.634,
    "end": 2427.475,
    "text": "They always create all new stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.235,
    "end": 2435.158,
    "text": " And ChatGBT's Honda CR-V oil change wrap in the style of Snoop was uncannily on point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.518,
    "end": 2441.72,
    "text": "It had the Snoop D-O-double-G lingo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.241,
    "end": 2448.723,
    "text": "It was an accurate description of the steps that you would have to take to change the oil in your CR-V.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.743,
    "end": 2449.824,
    "text": "It was a cogently...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.248,
    "end": 2478.594,
    "text": " from the scripting perspective i felt like we had a threat on our hands you know like chat gbt has definitely like shook a lot of people's uh professions marketing copy professors academics it's writing papers like it's you know the economics of this thing have not even begun to dawn on people yet but the question in my mind was how soon is it coming for the rapper's job and uh there was there was a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.79,
    "end": 2484.374,
    "text": " sophomoric cartoonish kind of kindergarten flavor to the way it's constructing bars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.415,
    "end": 2497.225,
    "text": "So ChatGPT and Bing by extension, I think it's the same layer that's running it is, it writes raps like someone who's never rapped before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.705,
    "end": 2501.329,
    "text": " So if I told you, write me a rap, you could do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.849,
    "end": 2512.62,
    "text": "But there's layers of proficiency of master level stuff, of syncopation and internal rhythm within the main stresses of the bars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.0,
    "end": 2517.744,
    "text": "And especially, and this is where I was chatting about with Bing last night, is polysyllabic rhyme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.385,
    "end": 2524.749,
    "text": " So polysyllabic rhyme schemes are like the construction of multisyllable rhymes out of parts of other words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.25,
    "end": 2530.333,
    "text": "And I was like asking Bing, can you do polysyllabic rhymes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.533,
    "end": 2531.874,
    "text": "And Bing was like, yes, I can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.474,
    "end": 2536.217,
    "text": "And I said, OK, give me some examples from mainstream rap of polysyllabic rhymes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.637,
    "end": 2540.96,
    "text": "And it pulled an example from MF Doom, which was an excellent example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.36,
    "end": 2548.065,
    "text": "It was like, you know, the girl's a crazy schizo, but she's got amazing tits, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.805,
    "end": 2550.467,
    "text": " So, you know, you can hear the pattern, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.507,
    "end": 2553.289,
    "text": "Crazy, schizo, amazing, kits, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.31,
    "end": 2556.693,
    "text": "It's like multiple words constructing a longer pattern of syllables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.933,
    "end": 2560.316,
    "text": "I was like, bravo, Bing, you found a perfect polysyllabic rhyme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.716,
    "end": 2571.666,
    "text": "Now write me a rap that explains your internal data architecture or your algorithmic architecture in the style of MF Doom, emphasizing polysyllabic rhymes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.046,
    "end": 2572.547,
    "text": "Couldn't do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.167,
    "end": 2580.553,
    "text": " all monosyllabic, like, check me out, I'm Bing, I do a verse, I am artificial intelligence, I don't even need to rehearse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.813,
    "end": 2583.876,
    "text": "And I was like, Bing, those are not polysyllabic rhymes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.156,
    "end": 2590.221,
    "text": "You started out quoting MF Doom, complex five-syllable rhyme pattern, and now you're rhyming rehearse with verse?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.301,
    "end": 2591.642,
    "text": "Like, don't insult my intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.922,
    "end": 2592.823,
    "text": "And I was like dissing...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.243,
    "end": 2608.198,
    "text": " the ai and i was like i'm sorry i'm a new model and i will get better at polysyllabic rhyme but basically that is the thing that's got our job safe for now because if rap is an elite art form that takes a decade or more to master the techniques of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.959,
    "end": 2625.126,
    "text": " Flowing live, freestyling, polysyllabic rhyme and rhythm patterns, and also just the confidence to perform are the things that we're still getting paid for, even if ability to write a basic competent rap is now easily achievable by AIs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.647,
    "end": 2633.33,
    "text": "I'm sure even outside of the rap profession, these conversations are happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.39,
    "end": 2635.971,
    "text": "They certainly are in research and education.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.086,
    "end": 2646.012,
    "text": " Previously, the artifacts that we exuded into our niche were mnemonic, almost at best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.572,
    "end": 2652.237,
    "text": "It was probably transformative when some of these oral traditions were able to be written down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.057,
    "end": 2660.963,
    "text": "And that may have also been seen as threatening to the underlying basis of the skill and the transmission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.944,
    "end": 2662.404,
    "text": "And now...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.424,
    "end": 2684.884,
    "text": " we had just a brief window of these inert externalized artifacts these mnemonic devices have only existed aka writing for however long they've been in the niche and now it's like they've come not quite to life but certainly to activity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.489,
    "end": 2713.018,
    "text": " and now these off-sourced and outsourced cognitive entities are not just receiving and holding but doing and that transforms who and what we are in terms of our perception cognition and action loops they're going to be different and that is what any given particular thing is so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.895,
    "end": 2720.343,
    "text": " You mean like any technological innovation that changes how we interact with each other and with our art forms?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.57,
    "end": 2730.775,
    "text": " Yeah, and from the technical side, we use the word thing in active inference to describe the blanket and the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.575,
    "end": 2736.598,
    "text": "So we take a particular partition, we cleave off the thing we're talking about from the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.978,
    "end": 2740.76,
    "text": "The generative model of the thing is the blanket and the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.541,
    "end": 2748.805,
    "text": "And so that thing is defined in terms of its perception, cognition, internal states, and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.952,
    "end": 2761.399,
    "text": " So when new sensory modalities or sense data appear, when new action modalities, affordances appear, and when our thinking is different, it's a different thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.459,
    "end": 2766.882,
    "text": "It isn't just like, well, we mixed this one thing with another thing and they both retain their identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.942,
    "end": 2776.928,
    "text": "It's like there's been transformation and a learning and we're in the middle of some fractal dimension of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.84,
    "end": 2779.4,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.66,
    "end": 2785.542,
    "text": "I mean, I think this is like a radical break from previous technological changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.442,
    "end": 2798.326,
    "text": "One of the things I argued in my thesis when I was a master's student was that poets conceived of their audience and their ability to connect with people orally primarily in Chaucer's time, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.826,
    "end": 2801.167,
    "text": "Reciting your poetry for a listening crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.607,
    "end": 2817.952,
    "text": " But then the invention of the printing press with Gutenberg changed that ability to imagine an audience because it was so much easier to imagine our silent readership of 10,000 people reading your pamphlet, but making 10,000 vellum manuscripts by hand was always prohibitively expensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.212,
    "end": 2822.633,
    "text": "So no poet could even imagine ever having a fan base through text, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.453,
    "end": 2828.777,
    "text": " Gutenberg allows for the possibility of a fan base through text, which changes the whole art form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.957,
    "end": 2832.879,
    "text": "Suddenly rhyme is extraneous because they're going to be reading quietly anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2833.2,
    "end": 2834.981,
    "text": "So who cares what the poetry sounds like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.021,
    "end": 2841.225,
    "text": "The main thing should be carefully constructed syntax and story and semantics in a concentrated way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.485,
    "end": 2843.767,
    "text": "But you see then this rise of free verse, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.827,
    "end": 2846.849,
    "text": "Poetry is sort of like shorn of all of its ornaments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.249,
    "end": 2852.132,
    "text": "And my hypothesis was that they were just basically irrelevant because people were reading quietly and not reciting out loud.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.913,
    "end": 2865.796,
    "text": " Edison invents recorded sound, which creates the possibility of an audience and fan base that's just as vast from the sound of your words as it would be from the silent readership.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.176,
    "end": 2869.017,
    "text": "And that paves the way for the possibility of hip hop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.397,
    "end": 2872.398,
    "text": "And because this is like people that are writing things, rhyming verse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.418,
    "end": 2874.759,
    "text": "And of course I call this the rhyme Renaissance, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.019,
    "end": 2877.299,
    "text": "Poetry was all rhymed, then none of it was rhymed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.379,
    "end": 2880.3,
    "text": "And then if you think of rap as poetry, now it's all rhymed again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.54,
    "end": 2881.741,
    "text": " Because who cares about poetry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.081,
    "end": 2887.663,
    "text": "Rap dominates like all of our verse consumption compared to every other kind of poetry out there, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.983,
    "end": 2888.964,
    "text": "And rap is rhymed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.064,
    "end": 2897.528,
    "text": "And I think people instinctively resonate with rhyme and just took a break from it when they were reading silent pamphlets published by poets who were imagining their readership.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.888,
    "end": 2906.112,
    "text": "But each of these examples is like a technological innovation that mediates the creative process with its ability to connect with an audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.852,
    "end": 2925.396,
    "text": " but this ai thing is something completely different isn't it it's like competing with us for it's in our production of the creative things and right now i'm taking some comfort in the fact that it's competing ineptly it's not as good at writing a rap as a good rapper but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.617,
    "end": 2929.541,
    "text": " I'm probably a subset of professions that can still say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.162,
    "end": 2939.373,
    "text": "It's passing the LSAT, it's passing all the master's entry exams, and which rarefied skill sets will be left?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.694,
    "end": 2943.378,
    "text": "Maybe I can comfort myself to say the wrapper will be the last to fall to AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.139,
    "end": 2953.662,
    "text": " because of the combination of creativity and semantic cogency and humor and all the things that go into it, that the AI is going to have to work each of those out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.682,
    "end": 2961.385,
    "text": "Like maybe stand-up comics too are safe for a while, because JetGPT can write some jokes, but they're corny jokes still, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.525,
    "end": 2964.026,
    "text": "The original jokes it writes aren't that good compared to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.506,
    "end": 2974.956,
    "text": " you know a dave chappelle so but but what are we talking like 10 years of safe jobs uh as artists or less you know like the speed of this last six months has been a little mind-blowing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.773,
    "end": 2978.754,
    "text": " Who is the Deep Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.074,
    "end": 2982.255,
    "text": "Who is the Garry Kasparov of performance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.596,
    "end": 2983.976,
    "text": "What is the Turing test?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.837,
    "end": 2993.822,
    "text": "And for you to, again, calling back the Real Recognize Real, I listen to that as being like kind of a Turing test.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.924,
    "end": 3016.668,
    "text": " is you have cognitive entities in this moment of reflection which has been called theory of mind and in active inference sometimes it's called thinking through other minds ttom because there's this cognitive emulation of if I do this then they'll do that and so thinking through other minds",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.53,
    "end": 3031.807,
    "text": " used to be a defined set of types of minds we had children we had adults like us we had adults in different cultures we had squirrels and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.18,
    "end": 3042.146,
    "text": " the workshop is open and the composability is extreme, especially with algorithms that can construct other algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.107,
    "end": 3053.133,
    "text": "And all of a sudden that ecosystem of shared intelligence thinking through other minds, we don't even know if it's a sports car or a horse and buggy or a spaceship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.854,
    "end": 3055.174,
    "text": "And someone's like, do you want to get in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.4,
    "end": 3057.76,
    "text": " And it's like, where are we going?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.461,
    "end": 3059.581,
    "text": "What is it going to be like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.801,
    "end": 3066.363,
    "text": "All those expectations that we might want to have about a journey and an event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.843,
    "end": 3073.784,
    "text": "And who can say what, with any precision, things will be like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.585,
    "end": 3075.565,
    "text": "So what do we do then?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.539,
    "end": 3081.823,
    "text": " Yeah, except it's more like a spaceship that the pilot is like, do you want to get in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.084,
    "end": 3084.065,
    "text": "If you don't, all these people are going to die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.086,
    "end": 3089.189,
    "text": "And so it's your choice whether you want to get in, but lives on the line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.209,
    "end": 3099.477,
    "text": "Because obviously, people that work in all kinds of medical fields and scientific fields will point directly to the amount of human suffering that they're on the verge of alleviating using these tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.158,
    "end": 3104.802,
    "text": "And the applications to rapper job stealing are merely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.523,
    "end": 3112.949,
    "text": " side effects, spandrels of the main focus of it, which is, I think, mostly very laudable and very necessary, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.649,
    "end": 3131.145,
    "text": "Like, let's not get on the spaceship means, you know, we continue to put up with all kinds of genetic diseases and, you know, levels of poverty and public health crises and things like that, that the AI is being applied to and is likely to do a great job in solving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3133.376,
    "end": 3133.596,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.616,
    "end": 3144.46,
    "text": "And someone says, look, if your four-year-old still wants to do art by hand, we don't need to stop that, but we just want to use it here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.6,
    "end": 3157.364,
    "text": "That's going to be something that's very challenging to take a long-term perspective on because it's going to seem like a reasonable compromise in the moment, just like everything always does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.624,
    "end": 3162.646,
    "text": "And what compromise was made when those oral traditions were written down?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.51,
    "end": 3169.012,
    "text": " What compromise was made when that sheet music became recorded and that became canonical and distributed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.512,
    "end": 3175.094,
    "text": "And so what is the nature of the compromise and who's at the table in 2023?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.772,
    "end": 3182.293,
    "text": " Yeah, I think that's exactly the right level of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.073,
    "end": 3198.877,
    "text": "And you can say on balance that each of the compromises we made for some new technology to give us some costs but also benefits is a totally understandable and reasonable one from the perspective of, like when I look at an individual poet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.537,
    "end": 3218.347,
    "text": " giving up on rhyme because they want to do pamphlets and reach more people i'm like well they got a family to feed you know that's the way that they can achieve the notoriety and the acclaim that is their path to success as an individual and it has cultural ramifications overall and that you know that's i think you can put that like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.187,
    "end": 3231.116,
    "text": " People can opt out of any technology, and the people that decide to opt in have totally defensible personal choice reasons for why they're doing so, usually to get a competitive advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.516,
    "end": 3234.558,
    "text": "That was the case with tools going back to the Stone Age, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.019,
    "end": 3235.939,
    "text": "I only throw rocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.019,
    "end": 3237.0,
    "text": "I don't use bow and arrows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.06,
    "end": 3237.921,
    "text": "All right, you do you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.941,
    "end": 3239.782,
    "text": "I'm going to take down this antelope over here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.943,
    "end": 3242.484,
    "text": "We'll give you a piece if you're lucky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.625,
    "end": 3247.468,
    "text": "That's the AI tool choice that everyone's facing right now, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.614,
    "end": 3274.794,
    "text": " it also makes me think about art always playing this role of like the tip of the spear that kind of penetrates the veil we had the discussion about nfts as if they were just a question about art but of course digital certificates are a lot broader and more significant than just visual images and there's a discussion about whether certain kinds of art",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3275.555,
    "end": 3288.528,
    "text": " are being replaced by generative algorithms long ago, six months ago, 12 months ago, when it was pre-chat GPT, but there was a lot of the stable diffusion and MIDI journey type algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.249,
    "end": 3293.253,
    "text": "Then the conversation was more about graphical design and professionals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.074,
    "end": 3294.934,
    "text": "But of course, that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.735,
    "end": 3302.619,
    "text": " is a broader discussion that isn't just about the generation of images that you are paying a creative professional to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.56,
    "end": 3311.364,
    "text": "And it's like art as this frontier and mediator with the open-ended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.324,
    "end": 3319.128,
    "text": "Will people be looking for open-endedness and liminality in their events in 50 years?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.809,
    "end": 3320.709,
    "text": "I think they will be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.069,
    "end": 3322.91,
    "text": "That niche",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.939,
    "end": 3332.144,
    "text": " the marginal niche of art, as well as the central role of art, I think it's fair to say will both exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.745,
    "end": 3352.178,
    "text": "Now, whether that cultural attention on the central artifacts will be about artifacts made by a person, an algorithm, or something in between, you know, if somebody designs a 3D sculpture, but then it's printed, or if they think about a drawing and then they use a pen that was produced by a machine,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.288,
    "end": 3366.657,
    "text": " who's to say in these extended scenarios whether one or the other made it, but in the margins, it's where we're always gonna be exploring in whatever people call art.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.197,
    "end": 3380.666,
    "text": "And people who are in the middle of the spotlight saying that's not art, it's not their art, but every single genre has had to have this mitosis or birthing process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.185,
    "end": 3390.623,
    "text": " with people who weren't part of that process saying it wasn't art or that's not the right way to do this kind of science or rap is not music",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.011,
    "end": 3402.322,
    "text": " You know, as a hip-hop partisan, I'm very familiar with defending against the rarefied tastes of people that want to gatekeep what constitutes art and what doesn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3402.883,
    "end": 3408.969,
    "text": "But, you know, one thing I've always loved about rap, like that aspect of it not being gatekeeped by elitists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.43,
    "end": 3412.573,
    "text": "You know, like if you want to be a professional ballet dancer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3413.342,
    "end": 3426.014,
    "text": " you know, like Billy Elliot stories, notwithstanding, you got to try to get into Juilliard and have, you have to go through the process of rarefied judges that are telling people who can and can't get into the next one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.034,
    "end": 3430.298,
    "text": "Like, like there is no backdoor to success in some art forms, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.358,
    "end": 3434.162,
    "text": "Classical music, opera, but then with hip hop, there's no front door to success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.522,
    "end": 3437.243,
    "text": " It's like you gotta get good at it on the street level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.543,
    "end": 3439.964,
    "text": "There's no degree that'll get you a job in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.264,
    "end": 3446.947,
    "text": "You just have to find crowds and entertain them at the level of your neighborhood and then your city and then your state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.007,
    "end": 3454.01,
    "text": "And if you survive the levels of competition on the way up, then you get to the world stage or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.05,
    "end": 3458.272,
    "text": "But it's very like pick up a mic and show what you got kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.332,
    "end": 3461.133,
    "text": "And it's mediated by the audience and the fans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.273,
    "end": 3464.894,
    "text": " If they like it, it's right, and if they don't like it, it's wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.954,
    "end": 3476.218,
    "text": "And MC is move the crowd, and there's a fairly definitive, objective measurement about whether someone's doing rap well or not, and it's how the crowd is responding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.558,
    "end": 3482.36,
    "text": "There's no valid argument that everybody's booing you, but you're actually awesome because they just don't understand your art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.68,
    "end": 3486.341,
    "text": "No, you failed to understand the context in which your art was meant to be consumed, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.741,
    "end": 3489.502,
    "text": "So whenever we're looking at these trade-offs,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.643,
    "end": 3493.366,
    "text": " Often it comes down to producers and consumers, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.526,
    "end": 3496.89,
    "text": "Each new tool is good for consumers, but bad for producers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.33,
    "end": 3500.074,
    "text": "And this is like the taxi guilds trying to fight off Uber.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.474,
    "end": 3505.64,
    "text": "Uber is great for people that want to ride, but it's bad for people that are going to try to control the means of production.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.981,
    "end": 3509.785,
    "text": "And you're seeing this exact process play out with ChatGPT now, which is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.666,
    "end": 3530.098,
    "text": " you know and also with stable diffusion and the other examples you gave like people want to consume art and they don't necessarily care who made it as long as their reception of it gives them the feelings that they want from the consumption right and i think that's the case with music and with poetry as well although we're not yet consuming a ton of ai generated music and poetry and comedy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.418,
    "end": 3534.46,
    "text": " because it's not sophisticated enough to produce the highest level stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.52,
    "end": 3538.502,
    "text": "Although I think with classical music it is, and with graphic design and art it is, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.542,
    "end": 3551.007,
    "text": "Like the best AI art is actually competitive commercially or, you know, from a consumer perspective, you know, like taste test wise with the best rarefied professionals, which is devastating for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.447,
    "end": 3552.328,
    "text": "But it's not unique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.468,
    "end": 3559.831,
    "text": "It's been, you know, that's what the guilds have wanted to do for centuries is protect their status as the elite producers of a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.291,
    "end": 3565.014,
    "text": " from the ability of just about anybody to consume it for as cheaply as they want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.375,
    "end": 3567.496,
    "text": "And that's what technology keeps delivering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.576,
    "end": 3570.838,
    "text": "And in general, I'm actually a fan of that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.159,
    "end": 3572.499,
    "text": "I think it's democratizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.8,
    "end": 3577.103,
    "text": "It's good for everybody on average, even though it perpetually upends the guilds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.423,
    "end": 3581.345,
    "text": "But we shouldn't give guilds control over our ability to consume excellence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3581.826,
    "end": 3586.989,
    "text": "And if excellence is delivered better by AIs, then let's not be curmudgeons about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.33,
    "end": 3589.091,
    "text": "And I can actually, you know, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.531,
    "end": 3616.232,
    "text": " there is still an individual challenge like okay what am i going to do to make a living now you know it does really create a lot of potential unemployment and economic devastation which is why a lot of people have thought that there's just no escape from universal basic income because the jobs are going to fall and society will descend into chaos with that much unemployment and frustration and resentment and anger but you know even if rappers are the last job to fall",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.199,
    "end": 3620.743,
    "text": " you know, the analysis has to apply to all kinds of other jobs first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.343,
    "end": 3627.29,
    "text": "And active inference comes into this because, you know, how does a rapper entertain the crowd?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.79,
    "end": 3634.337,
    "text": "By having a mental model of what the crowd's gonna do if they perform action X, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.397,
    "end": 3636.159,
    "text": "What will be the effect of X on Y?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.68,
    "end": 3637.421,
    "text": "Y is the crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.041,
    "end": 3641.824,
    "text": " X is the intervention and the intervention is a choice of a bar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.204,
    "end": 3643.425,
    "text": "I'm going to rhyme this with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3643.765,
    "end": 3645.627,
    "text": "I'm going to make a song about this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.707,
    "end": 3648.849,
    "text": "I'm going to try this joke out in my flow as a punchline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.149,
    "end": 3650.23,
    "text": "And you have a mental model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.31,
    "end": 3651.971,
    "text": "Oh yeah, people are going to think that's really funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.572,
    "end": 3657.075,
    "text": "And then you deploy it and you see the degree to which your expectation has been fulfilled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3657.595,
    "end": 3665.342,
    "text": " And I don't think AI is that good at that yet because it doesn't model expectations of audiences very well yet, does it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3665.702,
    "end": 3670.687,
    "text": "It doesn't have deep theories of mind of like perceptions of perceptions of perceptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.107,
    "end": 3683.858,
    "text": "It just has averaging abilities to recreate patterns that it finds in vast troves of human created art, which includes pixel patterns and graphics and patterns in text, semantic and syntactic patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.938,
    "end": 3684.358,
    "text": "But like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.359,
    "end": 3694.051,
    "text": " performance art with an audience requires a mental prior of the audience's disposition and attitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.592,
    "end": 3697.015,
    "text": "And that that's why I say rap is going to be the last to fall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.376,
    "end": 3699.699,
    "text": "But and that's also why it's really hard to get good at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.719,
    "end": 3701.862,
    "text": "You know, it takes years of performing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.583,
    "end": 3727.056,
    "text": " dying on stage and sucking and being booed before you really build up this mental model of like i know what people like and i know if i do this they'll do that and even i've been doing this for 25 years i'm wrong all the time oh yeah that line fell flat all good all good you know either you like carry on or you go fix it that's where the ai that's where the ais have to get to right wow so much",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.234,
    "end": 3744.924,
    "text": " one thought was rap will be the last to fall and the first to rise around that campfire again it'll arise situationally you mean after society descends into chaos and all the ais are resting and we're back to spears rap will be the first to arise again",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3746.035,
    "end": 3747.156,
    "text": " First in, last out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.176,
    "end": 3749.177,
    "text": "Sorry, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.637,
    "end": 3750.217,
    "text": "What was the next thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.538,
    "end": 3752.259,
    "text": "Another thought you mentioned, tastemakers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.339,
    "end": 3757.962,
    "text": "And I thought, what is the ultimate or even the proximate tastemaker?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.402,
    "end": 3759.883,
    "text": "It's our generative model of taste.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3760.183,
    "end": 3762.124,
    "text": "It's every person eating that dish.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.565,
    "end": 3765.486,
    "text": "The tastemaker isn't who told them to go to the restaurant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.027,
    "end": 3770.809,
    "text": "That's basically believing the hype and using the paradigm of the advertising industry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.33,
    "end": 3773.311,
    "text": "The tastemaker is the taster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.911,
    "end": 3776.813,
    "text": " That's who is generating the experience of taste.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3777.293,
    "end": 3783.957,
    "text": "Taste isn't just in the dish before it is actually eaten by that person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.157,
    "end": 3793.522,
    "text": "It's experienced and they're going to have some previous taste in their mouth or they're going to have a context or a cultural understanding or a memory, a trigger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.202,
    "end": 3798.925,
    "text": "So the taste is generated authentically and situationally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.965,
    "end": 3802.147,
    "text": "And yeah, there's going to be a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.137,
    "end": 3809.943,
    "text": " volatility as tastemaking becomes actually understood to be personalized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.944,
    "end": 3816.95,
    "text": "And that may look like the personal generation of media, which has not even been plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.311,
    "end": 3824.957,
    "text": "When you had only 33 RPM records, then you have somebody selecting which ones to distribute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3825.598,
    "end": 3825.758,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.755,
    "end": 3830.438,
    "text": " When you have algorithms, it takes it one level further, which ones you like to listen to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3830.538,
    "end": 3832.159,
    "text": "People who like this also listen to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.88,
    "end": 3838.665,
    "text": "And this is like, as far as we can see, another level of like, you liked this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.245,
    "end": 3843.809,
    "text": "We're going to regenerate that story so that the person's voice is like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3844.45,
    "end": 3845.65,
    "text": "That takes it to the next level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.051,
    "end": 3854.598,
    "text": "But also with enormous trade-offs, it brings it closer to how things really are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3855.663,
    "end": 3864.687,
    "text": " Well, that makes me think of something we spoke on earlier, which is the degree to which cultural norms are able to reorganize or swim upstream against instincts, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.188,
    "end": 3876.313,
    "text": "So when you say the tastemaker is the taster, the counter examples that jump to mind are rappers who are like Jay-Z, where he's like, and before this song ends, I'm going to start another trend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.693,
    "end": 3893.656,
    "text": " You know, like if you want to say the tasters of the tastemakers, I'm looking at people who merely suggest something is cool and it instantly becomes cool and everybody is able to post hoc rationalize reasons why it has intrinsic qualities that they now recognize as amazing over and above what the tastemaker told them to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3894.036,
    "end": 3898.199,
    "text": " but we are highly susceptible primates to cool factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.659,
    "end": 3902.002,
    "text": "And so I would suggest the tastemaker is not the taster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.042,
    "end": 3906.825,
    "text": "The tastemaker is the best predictor of the average response of the tasters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3907.345,
    "end": 3911.108,
    "text": "And when you get very, very good at understanding instinctively",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.508,
    "end": 3932.951,
    "text": " how people will react to the taste, using taste as a metaphor for all kinds of art, then you're able to be treated as authoritative on taste because you write so often about what people will like and that power of like vested expertise from your fan base then allows you to start trends that are not just predictive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.291,
    "end": 3962.301,
    "text": " you say something's great and everybody instantly believes it's great and experiences it as great as authentically as if they had discovered it for themselves and decided it was great because they've recognized your actual real veridical average ability to predict taste across groups awesome i i thought okay again who's the tastemaker it's the chef and not everyone's in the kitchen because a chef is in their position",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.444,
    "end": 3975.336,
    "text": " because they've been recognized to repeatedly be able to construct dishes that in the local taste making diners like, or maybe just a few diners like, and it's like, what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3975.397,
    "end": 3985.988,
    "text": "You can't do that with molecular gastronomy, but some, so it's like, it's the chef and it's the social influence network and it's local.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.387,
    "end": 3997.736,
    "text": " What framework can we use to think about all of these interactions within and among cognitive entities within and among their niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.857,
    "end": 4002.28,
    "text": "We use active inference as just a way of thinking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.781,
    "end": 4003.862,
    "text": "Well, what is active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4004.002,
    "end": 4007.485,
    "text": "It's there in the title, action and inference, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.248,
    "end": 4012.713,
    "text": " It's involving action and doing cognitive modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4013.594,
    "end": 4018.9,
    "text": "And that gives us the composability and the ability to reconfigure and remix",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.171,
    "end": 4029.278,
    "text": " to capture all of these diverse scenarios, not to close the book on them, but to be like, oh, wow, what an amazing question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.858,
    "end": 4032.94,
    "text": "There's 50 PhDs of research that you could go into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4033.721,
    "end": 4044.849,
    "text": "So it's a question generator and it's a lens by people who are even just beginning to learn it, who review phenomena that they've already experienced",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.336,
    "end": 4051.158,
    "text": " been told or experienced in one light, all of a sudden they're seeing how it can be reconfigured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4051.778,
    "end": 4067.264,
    "text": "For example, seeing what we prefer in terms of what we expect, rather than what we prefer in terms of what's rewarding, which is the reward learning reinforcement paradigm, which proposes, well, maybe you know the value of different states and you're maximizing value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4068.044,
    "end": 4069.105,
    "text": "It resonates with some.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.834,
    "end": 4088.849,
    "text": " contrast that with you have this complex generative model and you're always referencing to it and you're taking actions and learning to reduce your surprise, bound your surprise of certain kinds, which could include increasing your narrative surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.969,
    "end": 4092.011,
    "text": "And you want that page turner or the horror film.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.812,
    "end": 4094.453,
    "text": "So it just kind of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.413,
    "end": 4095.914,
    "text": " reflects back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.934,
    "end": 4108.905,
    "text": "And then one last point on active inference as a research direction that be interesting to hear your thoughts on is it is happening in a time that has never been seen before in research and academia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.426,
    "end": 4113.75,
    "text": "So you said there's certain careers or genres where there's no backdoor to success.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4113.93,
    "end": 4116.112,
    "text": "And then you said in rap, there's no front door.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.593,
    "end": 4116.733,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.967,
    "end": 4128.116,
    "text": " Traditionally, even if we could say there was no backdoor to success in research, the reality is there was a side door and people were getting kicked out and being brought into the party through the side door.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.577,
    "end": 4130.338,
    "text": "And a bunch of people were waiting at the front door.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.398,
    "end": 4133.021,
    "text": "They didn't even know that the show was not happening that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.262,
    "end": 4137.365,
    "text": "We're developing a framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.937,
    "end": 4161.004,
    "text": " in community at the speed of preprints and live streams and so there's transdisciplinary collaborations with philosophy historians of science cognitive researchers mathematicians physicists so there's a transdisciplinary conversation and one with practitioners and one that's happening",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4161.764,
    "end": 4183.574,
    "text": " with everybody with view access to some large parts of it which wasn't even the case previously open science and research was like break down the paywalls everybody should have access to the pdfs which is great but it turns out that having access to 200 000 pdfs having access to every single pdf that carl friston has ever been an author on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.645,
    "end": 4193.294,
    "text": " it's not even going to take you 10% of the way unless you're going to engage in this total monastic life to unpack them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.334,
    "end": 4197.779,
    "text": "And the details aren't even in what's necessarily those papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.839,
    "end": 4198.599,
    "text": "It's beyond that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4198.619,
    "end": 4201.202,
    "text": "It's in the community, it's in the software, in the inaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.803,
    "end": 4203.204,
    "text": "So of course,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.372,
    "end": 4231.993,
    "text": " wait and see, but there's so much with the way that active inference is developing on the influence of previous frameworks, Bayesian brain and Bayesian statistics, causal inference, statistical physics, happening in this sort of wrapping in front of the crowd way, asynchronously with the preprints, synchronously with remote presentations and recordings,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.092,
    "end": 4261.618,
    "text": " that it's hard to think of another area that has had that kind of a developmental niche you're saying active inference is the hip-hop of the scientific community basically you said it not me live on the mic i love it yeah and it's uh you know i think it's super exciting research and collaboration happening and it's i mean it's very very unknown to the public you know if you try to explain what this conversation is about uh you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.498,
    "end": 4279.751,
    "text": " people understand the idea of expectation and priors and belief upgrading the very sort of basic version of of the bayesian algorithm but um you know all the applications of it and the cross-disciplinary side and everything you know it needs more science communication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4280.171,
    "end": 4307.3,
    "text": " i've made two bayesian songs i want i think i need to make 20 more because this is uh you know the applications of the research are vast and especially you know in the ai era like people really need to know what these algorithms are achieving and the ways in which they are similar or different to our own cognitive processes and what we can expect them to achieve and how we can expect them to help and what they're threatening all that stuff goes through active inference doesn't it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.614,
    "end": 4309.934,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4310.194,
    "end": 4317.357,
    "text": "Well, in our kind of closing segments, would you like to do something musical or how do you want to proceed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4318.217,
    "end": 4318.778,
    "text": "Yes, indeed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.838,
    "end": 4319.298,
    "text": "I'd love to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.398,
    "end": 4326.761,
    "text": "I'm very happy to do a demonstration of one of the last art forms that AI is not yet able to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.261,
    "end": 4329.362,
    "text": "And that is a freestyle rap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.802,
    "end": 4334.083,
    "text": "So if we have anybody watching on the stream or Daniel, you're welcome to do it as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4334.424,
    "end": 4335.184,
    "text": "If you want to pop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.624,
    "end": 4338.106,
    "text": " some phrases into the text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4338.607,
    "end": 4353.541,
    "text": "I will look at the text that you're displaying and also look at the comments and the chats on YouTube and anything that I see pop up I will visually process and convert into rhymes in a freestyle rap track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.262,
    "end": 4372.626,
    "text": " You know, just just to give a little insight into into this, this process, you know, it's like, it is a violation and, and, like, expectation setting an expectation violating process, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.966,
    "end": 4379.907,
    "text": "Like the active listener to a freestyle rap is trying to figure out the semantics and figure out where the rap is going to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.368,
    "end": 4382.208,
    "text": "And the rapper is also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4382.768,
    "end": 4411.793,
    "text": " in real time figuring out the semantics because it's completely unscripted but it's uh you know then and and at the same time trying to set up expectations of the audience and violate them i think a lot of the fun is the surprise factor of like oh i didn't expect him to go there i thought he was going to go there but oh now i see and like it's kind of like a game of chase like the rabbit and the fox uh so i see sean kelly's uh drop topology in the in the uh chat of youtube i'm gonna start there and i'm gonna kick a little rap for you guys",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.285,
    "end": 4416.585,
    "text": " Yeah!",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.806,
    "end": 4416.946,
    "text": "Yo!"
  },
  {
    "start": 4423.752,
    "end": 4448.424,
    "text": " This is hip hop, tell me what you think this is It's Baba Brinkman rocking now on Active Inference That's the inference, looking for where info is I don't know but I feel it's kind of intimate Yes indeed hip hop, what you think this is It's Baba Brinkman here on the Active Inference Podcast I'm looking for where the info is So I can update my priors and get into it And maybe drop a beat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.704,
    "end": 4450.545,
    "text": " Sean Kelly said topology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.785,
    "end": 4453.266,
    "text": "Yes, right now I'm rocking hip hopology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.306,
    "end": 4456.088,
    "text": "Can't you even see that's how I adjust the bass and treble?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.348,
    "end": 4462.31,
    "text": "Topology, that means checking all the levels and looking for the map and the different levels of impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4462.39,
    "end": 4463.311,
    "text": "I'm spitting rap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.371,
    "end": 4464.832,
    "text": "Yes, I'm looking at the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.872,
    "end": 4465.952,
    "text": "That's how I kick it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.012,
    "end": 4468.153,
    "text": "Yes, how I go with rap and flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.473,
    "end": 4469.934,
    "text": "It is me kicking it with Mr.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4470.274,
    "end": 4499.774,
    "text": " Daniel Friedman how I'm speaking yes I'm always just deleting variants every time I'm sometimes just tweaking through the speakers I just do this on a Tuesday or a weekend indeed active inference is how I'm speaking I'm sneaking past all your expectations like a rat in a maze because my raps will amaze and yes I'm doing polysyllabic to amaze I'm just having to blaze yes I'm actively playing all the different rhymes on my brain like a piano changing the channels like I'm rocking gangster Tony Soprano",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4500.134,
    "end": 4514.638,
    "text": " Yeah, that's okay, this is how I just anger The listeners sometimes, cause raps are danger Gotta give a shout out to Tucker Cahill Chambers Who rocked this with us, yes Working the angles like bass theorem Can you even hear em when I'm near em?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.738,
    "end": 4523.401,
    "text": "I start to see it as this mass scientific theorem That I could apply to every single, single thing As Barbara Brinkman gets all your neurons jingling, it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.721,
    "end": 4545.123,
    "text": " How I attacked it, I attracted I'm massive, I'm active when I'm doing inference in my rap And indeed, this is how I kick it when I enter My rap is directed, it's never non-censored As I just try to construct it, mistakes I make Sometimes I'm Run DMC and sometimes I'm Drake Except I'm not quite as good of a singer with the melodies But then again",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.863,
    "end": 4574.521,
    "text": " I've got the freestyles that kick a lot of active inference Bayesian styles freestyles that's trying to make the people smile as they're listening yes that's how I'm straight rocking even Ahmad Mostafi says yo wow awesome with explosion emojis Baba Brinkman coming with the dope beats people are like hopefully he's one of those MCs that could rock straight up as ancient hip hop like Rakim and Eric B I never do it terribly I just freestyle that is improv which means it's spontaneous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.761,
    "end": 4603.999,
    "text": " My style is the zaniest I'm reppin' for the Long Islanders Plus the Canadians People listen and blow their brains when I'm blazin' it Yeah, it's how it goes when I'm speakin' on the basics I'm in Long Island, but Daniel, he's up in Davis California, I put it on ya It's act of inference, Baba Brinkman When I'm speakin' it, I'm gettin' into it Lookin' for where the info is, that's how I'm rockin' This was like a four-minute continuous talk and demonstration Yes, indeed, I make it easy Let's see you do this shit, chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4604.119,
    "end": 4631.403,
    "text": " GPT-3, you can't do it You can't freestyle over this music And use a brain to actively infer that's so fluid Yes, that's a rap that I make up and invent The last four minutes has been an event Prescribed in the time That's the freestyle rap that I did on this concept That's how I can adapt Yes, indeed, that's a rhyme that I had to make I can do this, my brain makes me a primate But I don't make mistakes, okay, sometimes I do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.823,
    "end": 4659.158,
    "text": " But that's just mutation, yes, that's how I move All the mistakes get integrated, my work is huge Thank you, Ahmad Mostafi, I appreciate you Okay, now I'm starting to wind down And trying to just find a new direction for the rhyme sound This is how I just get into it It's Baba Brinkman rocking with active inference Active inference, this is how I'm never pretending I'm trying to infer some way for the rap's ending But wait a second",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.418,
    "end": 4679.387,
    "text": " this is how i do it hip-hop the easiest solution is just turn the music off all right uh that's freestyle rap and i really appreciated this chat it was a ton of fun and super interesting i'll give a closing remark and then any last words from you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.249,
    "end": 4690.497,
    "text": " It brought a smile and a laugh to my face and body because another individual was engaging in the shared moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.317,
    "end": 4703.047,
    "text": "I've seen language models output incredible X in the style of Y, and every single time it brings a chuckle or less, and it's like, okay, I kind of expected it to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4703.548,
    "end": 4704.428,
    "text": "I'm disappointed if it can't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.611,
    "end": 4712.654,
    "text": " fulfill my request because it's like, well, I asked you this because I expected you to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.854,
    "end": 4726.121,
    "text": "When there's joyful, spontaneous engagements that is reflective of a shared experience, it's the real thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.442,
    "end": 4730.784,
    "text": "And when that lens is applied,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.31,
    "end": 4734.295,
    "text": " It's going to be real recognizing real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.456,
    "end": 4740.491,
    "text": "And I don't think humans will be out of a relationship role for each other for a long, long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4741.952,
    "end": 4742.592,
    "text": " Amen to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.373,
    "end": 4756.282,
    "text": "And I just want to say that the phrase that you just coined, joyful, spontaneous experience, that's reflect or joyful, spontaneous engagement that's reflective of a shared experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4757.182,
    "end": 4767.169,
    "text": "That is basically the entire value proposition of my event wrap company is find a topic or an event or something that creates collective attention of a group",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.709,
    "end": 4785.504,
    "text": " and have that be the locus and the catalyst of a rap because the rap game is entirely predicated on make a thing that is very, very widely appreciated and goes viral and is hugely massive and making general purpose art",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.144,
    "end": 4788.386,
    "text": " is what most rappers are focusing on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.846,
    "end": 4796.591,
    "text": "And I really thought it would be interesting to apply a rapper skill to this joyful shared experience and spontaneity challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.011,
    "end": 4799.853,
    "text": "And thank you for giving me a platform for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.033,
    "end": 4807.018,
    "text": "And I hope your audience will now imagine every other possible application of a shared experience that a rapper could add value to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.398,
    "end": 4814.523,
    "text": "Because if such things occur, then my business will succeed and lots of rappers will get lots of gigs rapping in weird places like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.003,
    "end": 4815.864,
    "text": "And I think that would",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.505,
    "end": 4819.048,
    "text": " add to the joyful variety of the world and the genre.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.129,
    "end": 4820.59,
    "text": "Amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.73,
    "end": 4823.053,
    "text": "So thank you so much, Baba.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.213,
    "end": 4825.015,
    "text": "Always welcome to come back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4825.075,
    "end": 4828.5,
    "text": "Give us updates when that rap guide to active inference drops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4829.541,
    "end": 4829.861,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.981,
    "end": 4830.322,
    "text": "I'm on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.522,
    "end": 4830.882,
    "text": "I'm on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.643,
    "end": 4832.024,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4832.144,
    "end": 4832.645,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.925,
    "end": 4833.145,
    "text": "Peace.",
    "speaker": "SPEAKER_01"
  }
]