[
  {
    "start": 7.25,
    "end": 8.892,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 9.633,
    "end": 18.544,
    "text": "It is September 1st, 2022 and we are here in model stream number 6.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 19.586,
    "end": 24.632,
    "text": "We're going to be discussing branching time, active inference, the theory and its generality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 25.709,
    "end": 44.499,
    "text": " going to have a presentation followed by a discussion so thank you ali and jacob for joining and anyone else to be adding their questions in the live chat without further ado over to tiafili champion and thanks so much for joining really appreciate it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 45.879,
    "end": 69.435,
    "text": " hello thank you very much for the kind introduction uh and thank you for inviting me to present today i'm very glad i had this opportunity so today i will be speaking about branching time active in france um basically three different versions of the of the approach the first using biological message passing the second using bayesian filtering and the third one is using",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 70.396,
    "end": 77.66,
    "text": " belief propagation and allows the model to contain several observations and several ident states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 78.801,
    "end": 86.746,
    "text": "This work has been realized in collaboration with Lancelot Acosta, Marek Jesch and Howard Bromath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 88.887,
    "end": 95.531,
    "text": "So first of all, I want to speak a bit about the action perception cycle, which is a core idea in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.431,
    "end": 98.573,
    "text": " Basically, there are two entities here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 98.613,
    "end": 103.377,
    "text": "The first is the environment, and the second is the agent, which is over there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 104.358,
    "end": 109.643,
    "text": "The environment provides an observation to the agent, for example, an image of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 110.984,
    "end": 115.648,
    "text": "And then the agent takes this input and performs inference on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 115.968,
    "end": 122.914,
    "text": "And the goal of the inference process is to extract high-level ident states, such as the position of Pac-Man in x and y,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 124.19,
    "end": 127.411,
    "text": " or the position of the ghost, or whatever information may be relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.352,
    "end": 132.873,
    "text": "Then, based on those states, we can perform planning and action selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.714,
    "end": 147.439,
    "text": "And action selection outputs the action to perform, maybe the action going up, which is fed into the environment, which produces another observation, and this cycle continues until the trail ends.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.662,
    "end": 159.026,
    "text": " Now that we have the core idea of active inference, which is the action perception cycle, I will be speaking about active inference in a bit more depth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 160.387,
    "end": 165.249,
    "text": "Basically, active inference is about an agent which is equipped of a model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 166.49,
    "end": 172.833,
    "text": "This agent makes, as I said, observations, which are represented here at the bottom of the screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.948,
    "end": 179.153,
    "text": " And those observations depend on the ident states through the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 179.634,
    "end": 185.9,
    "text": "So basically the A matrix provides a distribution of the observations for each possible latent state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.221,
    "end": 193.588,
    "text": "We also have the D-vector, which contains the parameter of the prior over the initial ident state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.023,
    "end": 200.888,
    "text": " as well as the B matrix, which explains how the transition of the environment works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.528,
    "end": 209.154,
    "text": "So basically, it explains how, given a state and an action, we get the new state at time t plus one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 210.27,
    "end": 230.332,
    "text": " we, as I said, have an action, or here it's a policy variable, and this action variable, or policy, depends on the precision parameter, which is called gamma, and as we will see, influence how stochastic or deterministic the policy of the agent will be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.321,
    "end": 237.268,
    "text": " So here we see how the prior overaction is being defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 238.109,
    "end": 249.484,
    "text": "So it depends, as I said, on the gain parameter, and it is defined as the softmax function of minus the gamma, the precision parameter, times the expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.419,
    "end": 263.305,
    "text": " And the expected free energy for a particular policy is basically a sum over all future time steps, so from t plus 1, which is the first time step into the future, to uppercase t, which is the time horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 264.726,
    "end": 270.908,
    "text": "And for each time step, the expected free energy is defined as the expected cost plus the ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.789,
    "end": 278.172,
    "text": "The expected cost is the KL divergence between the predictive posterior over future observation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.634,
    "end": 280.895,
    "text": " and the prior preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 281.536,
    "end": 286.801,
    "text": "The prior preferences defines which observation the agent wants to observe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 287.262,
    "end": 293.108,
    "text": "And this, the predictive posterior, defines how likely each observation is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.649,
    "end": 300.255,
    "text": "And so what we want to do is to minimize the divergence between those two distributions so that we actually observe what we like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 302.185,
    "end": 310.429,
    "text": " Okay, and the second term is about the entropy of the likelihood mapping expected under the variational posterior overstate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 311.209,
    "end": 312.95,
    "text": "So I'm speaking about variational posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.611,
    "end": 322.315,
    "text": "I will explain what this is in a minute, but that's the definition of the expected free energy, risk plus ambiguity, or also called expected cost plus ambiguity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 324.269,
    "end": 325.49,
    "text": " So I presented the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 325.53,
    "end": 327.291,
    "text": "Here's a more formal definition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.731,
    "end": 330.913,
    "text": "Here we have a joint over all the variables in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 331.633,
    "end": 336.316,
    "text": "We saw that the policy depends upon the precision parameter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 337.016,
    "end": 342.019,
    "text": "We have a gamma distribution for the precision, like the gamma parameter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.679,
    "end": 351.964,
    "text": "We have Dirichlet priors for each of the tensor of parameters, so A, B, and D. And we see that S indeed depends on D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 353.565,
    "end": 357.407,
    "text": " and that the observation depends on the state through the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 358.588,
    "end": 367.033,
    "text": "And same thing for the transition mapping, we have a state which depends on the previous states and the B matrix, as well as the action being performed in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.535,
    "end": 379.441,
    "text": "Okay, so now we have the model, but what we want to do is, given some observation, we want to be able to compute posterior beliefs over the latent variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 380.592,
    "end": 389.301,
    "text": " In probability theory, we call that computing the posterior distribution, and we do that through a process which is called inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 390.882,
    "end": 402.854,
    "text": "We can, for example, use exact inference, which is based on Bayes' theorem, so that the posterior is equal to the likelihood times the prior, and then we normalize using the evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.15,
    "end": 424.766,
    "text": " And basically, the evidence is just obtained from the numerators by summing out all the latent variable x. The problem is that when x is a continuous random variable, this summation turns into an integral, and we may not have an analytical solution for this integral.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 425.827,
    "end": 429.95,
    "text": "So this method, the exact inference, can become intractable because of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.107,
    "end": 448.339,
    "text": " What we do instead, when using variational inference, is that maybe this true posterior is very complex, but we are going to approximate it using this Q, this variational distribution, and try to make the divergence between those two distributions as close as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 448.959,
    "end": 459.086,
    "text": "So here we have the true posterior in red, and here we have an example of how the variational posterior may be fit to the true posterior in red.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 461.454,
    "end": 465.635,
    "text": " In the context of active inference, the variational distribution is defined as follows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.136,
    "end": 479.44,
    "text": "So it is a joint distribution over all the latent variables of the model, and we are doing what we call the mean field approximation, which means that all the variables within this distribution are assumed to be independent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.282,
    "end": 486.126,
    "text": " Thus, there is no more dependency for the pi, a, b, d, and gamma parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.746,
    "end": 492.61,
    "text": "And we do a slight exception where the state still depends on the policy pi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 493.911,
    "end": 496.793,
    "text": "Okay, so that's the definition of the variational distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.773,
    "end": 503.037,
    "text": "And now that we have the variational distribution and the generative model, we can define the variational free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.657,
    "end": 507.34,
    "text": "So the goal of the variational free energy is to make sure that the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 508.59,
    "end": 532.388,
    "text": " approximate posterior so that our variational distribution remain as close as possible to the true posterity and it is defined as the KL divergence between the approximate posterior and the generative model this variational free energy is also called like the negative evidence lower bound or ELBO in machine learning and it decomposes into",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 533.424,
    "end": 534.624,
    "text": " two intuitive terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 534.664,
    "end": 543.486,
    "text": "So this is the variational free energy, and it decomposes into the KL divergence between the approximate and the true posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 544.106,
    "end": 548.367,
    "text": "This is the term that will make the approximate posterior be as close as possible to the true posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 549.587,
    "end": 556.169,
    "text": "And here we have as evidence, but which is a constant with respect to the variational distribution, which we are optimizing for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.689,
    "end": 561.57,
    "text": "So yeah, really the variational free energy is a proxy for the first term over there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 564.363,
    "end": 566.384,
    "text": " Okay, so what is variational message passing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 566.624,
    "end": 569.445,
    "text": "Variational message passing is an inference algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 570.605,
    "end": 573.726,
    "text": "Basically, it is based on what is called the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 573.766,
    "end": 580.448,
    "text": "So let's suppose we want to compute the variational posterior for one specific node in a graphical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.469,
    "end": 589.191,
    "text": "What variational message passing is about is saying that this node A only depends on its Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 590.276,
    "end": 605.628,
    "text": " More specifically, it depends on the child of A, so here D and C. It depends on the parent of A, here F and G, and also in the co-parent of A, for example, E and B in this picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 606.469,
    "end": 616.077,
    "text": "And what this Markov blanket says is that, really, we only need to know the values of the variable inside the Markov blanket to be able to perform inference over A.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 617.935,
    "end": 622.038,
    "text": " Here is a bit more formal view on this question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 622.939,
    "end": 630.585,
    "text": "So here we have the optimal variational distribution for one random variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 630.605,
    "end": 639.913,
    "text": "So this could be, for example, A. And the equation on the right gives us basically the analytical solution for this posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.474,
    "end": 646.979,
    "text": "And we see that it's only depending on the node itself, its parents, its children, and the co-parents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 648.464,
    "end": 650.747,
    "text": " And that's all we need to know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.907,
    "end": 653.23,
    "text": "Okay, so why a variational message passing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.951,
    "end": 665.525,
    "text": "The message bit comes from the decomposition of this analytical solution into messages, which are added together to form the variational posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.772,
    "end": 670.515,
    "text": " Here we can see the first message, which basically comes from the parents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 670.695,
    "end": 673.137,
    "text": "Here we can see one message for each chap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.657,
    "end": 680.622,
    "text": "And what we do is that all those messages will be added to form the parameter of the approximate posterity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.142,
    "end": 683.403,
    "text": " Here's a graphical example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.003,
    "end": 707.074,
    "text": "Basically, we are trying to perform inference over the random variable y. So we want to compute the parameter of the distribution, like the posterior distribution over y. And the way we go about doing this is that we send messages from the parents all the way through the random variable y. And same thing for the child and the co-parents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 708.007,
    "end": 729.796,
    "text": " And each time we reach a factor node, we combine the input messages and forward the result, forward y. When we have received all the messages, we just add them together and this provides us with the parameter of the variational distribution over y. So this was variational message passing, which is basically the algorithm that we use to perform inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.7,
    "end": 742.566,
    "text": " Now I will be speaking about Monte Carlo research, which is a planning algorithm that we use to look forward into the future and estimate the quality of each policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.087,
    "end": 748.069,
    "text": "So before to do that, I want just to introduce the notion of multi-index.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.329,
    "end": 754.012,
    "text": "So here we can see the roots of the tree, which is the state at the present time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 755.427,
    "end": 764.675,
    "text": " And then from there, we see that we have nodes in the future which are indexed by sequences of indices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 765.115,
    "end": 771.38,
    "text": "For example, here's a sequence of size one, which contains just the action or the index one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 772.541,
    "end": 775.703,
    "text": "So this is a state reached after taking action one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 776.644,
    "end": 777.145,
    "text": "And then here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.45,
    "end": 790.718,
    "text": " we have the states rich when performing action one followed by action two and this those indices are called multi-index because they are composed of several indices which here represent actions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.079,
    "end": 796.264,
    "text": " OK, so now that we have this in mind, I can discuss Monte Carlo's research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 797.065,
    "end": 801.41,
    "text": "So the way Monte Carlo's research is structured is in four steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.81,
    "end": 808.018,
    "text": "First, we have the selection step, where we start at the root node and compute the UCT criteria.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.138,
    "end": 812.063,
    "text": "So this is just a real value, like a number, for each of the child.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.226,
    "end": 818.392,
    "text": " And then we select the node which actually has the highest UCT value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 818.913,
    "end": 822.957,
    "text": "For example, maybe it is S1, so the state we reach after taking action 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.778,
    "end": 829.365,
    "text": "Then from this, we can compute the UCT of each children, and maybe this node will be the highest value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.007,
    "end": 838.43,
    "text": " Okay, once we have reached a lift node, we can move towards the second phase, which is about expanding the child run of this node.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.03,
    "end": 850.475,
    "text": "And for each child, what we are going to do is just simulating some rollouts from this node and computing the average expected frequency for this node.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.528,
    "end": 869.52,
    "text": " Once we have this, there is a fourth phase, which is about updating the expected synergy of the ancestor of the node we just expanded, as well as the number of visits, because we want to explore part of the tree which have not been explored a lot in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 871.001,
    "end": 874.904,
    "text": "So we need to keep track of how many times each branch has been explored.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.065,
    "end": 877.946,
    "text": "Okay, so that was the algorithm for planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 879.434,
    "end": 889.046,
    "text": " And I now have introduced all the background required to discuss the first approach, which is branching time active inference with variational message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.115,
    "end": 893.016,
    "text": " So first, we need to define the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.917,
    "end": 895.739,
    "text": "It is basically split into two parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.159,
    "end": 900.162,
    "text": "The first one represents the past and the present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.782,
    "end": 908.668,
    "text": "And it is basically a partially observable Markov decision process, which is just a fancy word to say that we have observations, which depends on state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.169,
    "end": 910.389,
    "text": "This is with the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.53,
    "end": 917.215,
    "text": "We have action variables over there, and we have states, as I said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.264,
    "end": 924.728,
    "text": " So the likelihood mapping, as I said, is parameterized by the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 925.108,
    "end": 928.81,
    "text": "The transition, as usual, is parameterized by the B matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 929.671,
    "end": 935.575,
    "text": "And we also have here the D vector, which defines the prior over the initial island states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.235,
    "end": 939.157,
    "text": "So this is coming from standard active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.977,
    "end": 945.201,
    "text": "And then the novelty is that we are expanding basically the future",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 947.775,
    "end": 955.08,
    "text": " Each time we have this model, then we perform multi-carriage research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 955.24,
    "end": 960.743,
    "text": "Each time we want to expand a node, what we do is that we are going to add some parts, some bits to the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 960.763,
    "end": 967.508,
    "text": "For example, if we want to add this part of the generative model, we are going to add one transition mapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 969.068,
    "end": 972.47,
    "text": " This will add a random variable, here it's like S12.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.01,
    "end": 980.273,
    "text": "And then we will add the associated observation using the likelihood map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.293,
    "end": 982.834,
    "text": "This is how we expand the generative model as we go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.894,
    "end": 985.795,
    "text": "Mathematically, this is defined like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.275,
    "end": 990.416,
    "text": "So we see here a generative model over all the variables in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 991.197,
    "end": 996.859,
    "text": "We have Dirichlet prior over the parameters of the model, so the A, B, and D matrices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 998.425,
    "end": 1006.607,
    "text": " The state at time-step zero depends on D. Each observation depends on the state associated to it and the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.887,
    "end": 1015.769,
    "text": "And then we have prior distribution over actions, which depends on some theta parameters for which we have a Dirichlet prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.87,
    "end": 1026.552,
    "text": "Okay, and then the state, as usual, depends on the previous state and the previous actions, as well as on the B matrix, which defines the transition probabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1028.086,
    "end": 1034.469,
    "text": " So this is a POMDP version, like the POMDP part of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1035.19,
    "end": 1040.633,
    "text": "And this is a tree-like structure that expands as planning is going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.094,
    "end": 1048.397,
    "text": "So IT is a set of all multi-indexes which has been expanded in the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1049.017,
    "end": 1055.661,
    "text": "For example, if I come back here, we see that there are three multi-indexes that have been expanded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1057.21,
    "end": 1082.219,
    "text": " so i is equal to the multi-index is one the multi-index is two and the multi-index uh one one okay and now for each of those multi-index we add to the generative model a transition and likelihood mapping that's exactly what we are doing for each index in the set of multi-index which have been expanded we had",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1083.573,
    "end": 1087.076,
    "text": " the likelihood mapping and then transition for this specific node in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.517,
    "end": 1096.222,
    "text": "Okay, so now we need to test this approach in an environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.443,
    "end": 1104.729,
    "text": "And for now, we'll be testing it inside a maze environment where we have here the exit of the maze.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1105.626,
    "end": 1115.963,
    "text": " here the starting position and then the prior preferences of the agents will be that the closer we are from the exits the more the happier uh the agents will be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1117.287,
    "end": 1120.009,
    "text": " So here we have a distance of 0, 1, 1, 2, 3, 4.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.653,
    "end": 1128.557,
    "text": "One feature which is really important is that the prior preferences fly across both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1128.717,
    "end": 1133.942,
    "text": "So here we have 3, and here we have 4 in terms of the distance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.342,
    "end": 1135.983,
    "text": "We don't have like 5, 6, 7, 8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1137.825,
    "end": 1138.105,
    "text": "We have 4.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1139.086,
    "end": 1140.387,
    "text": "And what this produces",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1141.468,
    "end": 1166.654,
    "text": " is a blue cell and what this blue says blue cell actually is is a local minimum in which the agent can be stuck if it is not careful and the way to avoid this local minimum will be to be able to plan final into the future to see that the rewarding path is actually this one and not the one leading to the local minimum so this is basically a challenge that we are adding uh to the task",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1168.567,
    "end": 1173.63,
    "text": " And here what we can see, so here is basically an illustration of the tree which is being expanded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1174.271,
    "end": 1175.752,
    "text": "And here we have the table of results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1176.152,
    "end": 1193.484,
    "text": "We see that as we increase the number of planning iterations, we go from the agent being stuck inside the local minimum, so never reaching the exit, to an agent which is basically behaving properly and reaches the exit 100% of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1196.201,
    "end": 1202.527,
    "text": " Next, we need to compare our potential branching time active inference to the previous state of the art, which is active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1204.088,
    "end": 1214.038,
    "text": "And basically, we designed an environment in which for the agent to be able to solve it, it has to plan three, five, and then eight time steps into the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.035,
    "end": 1221.218,
    "text": " For ActiveInference, what happened is that it was able to properly solve the two first tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1221.639,
    "end": 1233.767,
    "text": "But then, what happened is that because the number of policy tasks we evaluate into the future grows exponentially with the number of times that it has to plan for, the last one, which is the biggest, crashed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.216,
    "end": 1243.565,
    "text": " With our approach, we did the exact same thing where we increased once again the number of planning iterations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1244.066,
    "end": 1257.36,
    "text": "We see that the agent becomes able to solve tasks all the time and does not crash because it is able to explore in a clever fashion the space of all possible policies using multi-carriage research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.685,
    "end": 1265.01,
    "text": " This was a bit of an empirical comparison between BTEI and active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1265.75,
    "end": 1271.796,
    "text": "Now what I want to do in this slide is to compare them in terms of complexity classes, which is a lot more theoretical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1273.462,
    "end": 1283.87,
    "text": " So basically here, each circle corresponds to a categorical distribution of a state, which means that to store one of those circles, we need to store the number of states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.631,
    "end": 1287.773,
    "text": "So a number of parameters, which is equal to the number of state values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1288.153,
    "end": 1292.997,
    "text": "So if we have a state which takes three values, we need to store three parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1295.396,
    "end": 1322.532,
    "text": " then for each time step into the future we need to store one more parameters one more categorical when it comes to active inference and we also need to store one more categorical for each possible policy so the total complexity class is equal to the number of policies times the number of time step until the time horizon times the number of parameters we need to store for each categorical distribution",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1323.479,
    "end": 1332.762,
    "text": " Now in the worst case scenario, the first thing to say is that BTEI does not store every single possible combination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1333.502,
    "end": 1341.445,
    "text": "It's using the tree structure of the generative model to store only one distribution for the past and present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1342.389,
    "end": 1361.338,
    "text": " for each time step in the past and present and then it's if we expand all the tree then it's going to x to store uh the number of action to the power of the time horizon minus t so this is still exponential in terms of course because of this change over there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.588,
    "end": 1365.87,
    "text": " But in practice, we never expand the entirety of the tree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1365.91,
    "end": 1370.452,
    "text": "So what we do is maybe we will expand this, this, this, and this, but not the two others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1370.933,
    "end": 1378.317,
    "text": "So in practice, the real complexity class of this algorithm is linear in the number of expansions that we are making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1380.258,
    "end": 1388.142,
    "text": "Okay, so that was to show that branching time active inference does not require as much storage space as standard active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.231,
    "end": 1417.353,
    "text": " now we want i want to speak about the second approach which is based on bayesian filtering so first what is bayesian filtering well basically it is an inference algorithm which starts with just a simple generative model with a state and an observation we actually know which observation we are making and we have we also know what is the prior of a state and the likelihood is and then we can for example use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.533,
    "end": 1423.354,
    "text": " by a sterine to compute the posterior overstate, given some observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.114,
    "end": 1427.015,
    "text": "And we just compute it like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.195,
    "end": 1435.376,
    "text": "Once we have a posterior overstate, we can use it as an empirical prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1436.336,
    "end": 1438.377,
    "text": "So here is our empirical prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1438.737,
    "end": 1443.958,
    "text": "And we also know the transition probability that leads us to the next time stop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1445.376,
    "end": 1459.567,
    "text": " So we can use this information as well as the action that we are actually performing in the environment to compute the predictive posterior over the state at time step one, given the action that we just made, which is U0 and the observation that we made before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.848,
    "end": 1466.992,
    "text": "And the way this is done is just by performing Bayesian prediction through the transition mapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.413,
    "end": 1470.075,
    "text": "So averaging out the dimension of S0.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1472.529,
    "end": 1485.633,
    "text": " And then comes another observation, and we can just use our predictive posterior that we got from the previous prediction step to now compute a posterior over S1 according to this new observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1486.113,
    "end": 1494.675,
    "text": "And those two steps of integrating evidence and then prediction through the transition mapping are going to be iterated as many times as we need to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1496.752,
    "end": 1503.597,
    "text": " So this leads us to the second approach that I want to present today, which is branching time active inference with Bayesian filtering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1505.018,
    "end": 1518.227,
    "text": "So first thing, we are not storing anymore the past, the past observation on state, because all the information we need is stored within the beliefs over the initial state, like the current time state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.228,
    "end": 1521.129,
    "text": "The state as a current time state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1522.841,
    "end": 1538.586,
    "text": " Okay, so we have an observation at time t. We can perform the integration of evidence step to get a belief about this state at time step t. And then we can perform forward prediction for each of the children that we want to expand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1539.793,
    "end": 1544.137,
    "text": " For example, maybe we'll compute this one, and then this one, and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1544.518,
    "end": 1553.546,
    "text": "And if Monte Carroll's research tells us to expand this child, then we will just perform forward prediction as well for this one and expand its associated observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.607,
    "end": 1555.948,
    "text": "So that's the main idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.609,
    "end": 1563.676,
    "text": "So really, the only difference here is that we don't even have any more partially observable Markov decision process for the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1564.793,
    "end": 1573.697,
    "text": " We only have the current timestep, and we are also changing the inference algorithm from variational message passing to Bayesian catchment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1576.258,
    "end": 1579.8,
    "text": "Here is a more formal definition of the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.3,
    "end": 1586.282,
    "text": "So we can see here the likelihood and prior overstate for the initial timestep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1586.803,
    "end": 1590.985,
    "text": "Here is the current timestep t. And then for each likelihood,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1593.851,
    "end": 1603.6,
    "text": " For each future state and observation, for each multi-indices that we already have expanded, we have the likelihood mapping and the transition mapping associated to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.161,
    "end": 1617.726,
    "text": " In terms of performance, we compare here branching time, active inference, using Bayesian filtering, to the same algorithm, so BTEI, but with via Einstein message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1618.286,
    "end": 1633.692,
    "text": "And we see that for the same task, one of them is performing with an order of magnitude which is about minute scale, so around four minutes, between four and seven minutes, while the other performs a lot faster, between two and 11 seconds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1634.551,
    "end": 1642.033,
    "text": " So this speed up in performance is basically made possible by the change of inference algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1644.933,
    "end": 1653.395,
    "text": "But now what we want to do is to be able to define more than one observation and state at each time point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.815,
    "end": 1663.077,
    "text": "So the way we are going to do this is by changing once again the inference algorithm from Bayesian filtering to belief propagation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1665.41,
    "end": 1666.77,
    "text": " So what is belief propagation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.511,
    "end": 1674.853,
    "text": "Basically, belief propagation is an algorithm that takes as input a function over some state variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1676.013,
    "end": 1681.935,
    "text": "And this function, we know that it factorizes into a set of n factors, which we call fi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.002,
    "end": 1697.612,
    "text": " And the question is, how can we compute the marginal distribution, like the marginal over the marginal of this function, when we marginalize out all the other random variables except for one, sm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.912,
    "end": 1702.955,
    "text": "Okay, so we want to marginalize the distribution over all but sm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.136,
    "end": 1712.362,
    "text": "And the way I believe propagation is solving this task is basically by passing messages through the computational graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1713.942,
    "end": 1715.744,
    "text": " So in the graph, we have two kinds of nodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1715.864,
    "end": 1721.329,
    "text": "We have factor nodes, which represent factors of the distribution, for example, F1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.969,
    "end": 1728.055,
    "text": "And then we have random variable, maybe X1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.016,
    "end": 1731.758,
    "text": "And we may have several of them, so F2 and then X2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.319,
    "end": 1738.625,
    "text": "Okay, and maybe we have a transition mapping between the two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.804,
    "end": 1753.613,
    "text": " this is the setting and now what we want to do is to pass some messages through the graph so when it comes to a message from a node x to a factual so let's suppose we have one more here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.747,
    "end": 1765.557,
    "text": " What we are going to do to compute the output message is just multiply the input messages that come from the other arrows that go towards this node.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.457,
    "end": 1771.021,
    "text": "And we just multiply all of the input messages and output the result.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.142,
    "end": 1777.067,
    "text": "When it comes to a message for PowerFacture,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1779.286,
    "end": 1791.671,
    "text": " We basically are going to take the factors associated to this factor node and multiply it by all the incoming messages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.071,
    "end": 1797.874,
    "text": "So we take all the incoming messages and multiply them by the factor associated to this factor node.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1798.908,
    "end": 1809.685,
    "text": " And then we marginalize out all the input dimensions so that the message has the exact same shape as the output, as the target random variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.886,
    "end": 1813.591,
    "text": "So this is the marginalization I'm speaking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.148,
    "end": 1818.61,
    "text": " We do that for every single messages we can inside of the phytograph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.13,
    "end": 1826.493,
    "text": "And then we use those messages to compute the marginal that was the goal of this algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1826.973,
    "end": 1832.556,
    "text": "And the way we do that is that we just take all the input messages and multiply them together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1833.056,
    "end": 1837.738,
    "text": "And this gives us the marginal distribution over the specific state we wanted to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.031,
    "end": 1847.134,
    "text": " So this leads us to multimodal on multifactorial branching time activity trends, which is the last approach that we have been developing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.875,
    "end": 1854.117,
    "text": "Before to be able to speak a bit more about this approach, I need to introduce the notion of temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1855.297,
    "end": 1860.659,
    "text": "So a temporal slice is just a set of states and observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.36,
    "end": 1864.441,
    "text": "We have S states and O observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.307,
    "end": 1870.429,
    "text": " So this is a plate notation which just duplicates the variable O time or S time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.41,
    "end": 1873.351,
    "text": "And then we have those dashed lines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1873.871,
    "end": 1880.614,
    "text": "What those dashed lines are doing is just connecting the observation to a subset of the states over there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.195,
    "end": 1885.837,
    "text": "So for example, maybe we have an observation 1, which depends on state 1 and state 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1888.498,
    "end": 1889.659,
    "text": "And then maybe we have observation 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1890.902,
    "end": 1892.923,
    "text": " But this observation 2 only depends on state 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1893.703,
    "end": 1901.287,
    "text": "So the reason for which it's a dashed line is because we can have a sparse mapping between the state and observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1901.747,
    "end": 1904.288,
    "text": "We don't have to have all the possible connections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1907.088,
    "end": 1914.831,
    "text": " Okay, and two slides, two temporal slides, can be connected through the transition mapping, which is these arrows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1915.251,
    "end": 1918.513,
    "text": "And what these arrows mean is exactly the same, but between two timesteps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1919.033,
    "end": 1931.998,
    "text": "So, for example, this, the state over there, can depend on the state at the previous timestep in an arbitrary fashion, exactly like the observation depends on an arbitrary subset of the state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1933.476,
    "end": 1939.069,
    "text": " But this representation is a bit unpractical when it comes to presenting the entire generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1939.63,
    "end": 1942.777,
    "text": "So what we do is that we just represent this temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.835,
    "end": 1947.376,
    "text": " as a square, which is called TST.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1947.657,
    "end": 1955.56,
    "text": "So the temporal slice at time T. And the background here is gray because the observations within the temporal slice are provided.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1956.4,
    "end": 1957.3,
    "text": "They are actually observed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1958.06,
    "end": 1963.643,
    "text": "While in the future, the background will be white because the observations are just not observed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.983,
    "end": 1969.745,
    "text": "Okay, so now that we have this more compact presentation, we can present the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.405,
    "end": 1972.066,
    "text": "So here we see the initial time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.16,
    "end": 1981.445,
    "text": " And then from there, we can expand some new temporal size, exactly when multi-carot research asks us to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.945,
    "end": 1984.887,
    "text": "So we start there, maybe we complete the UCT criterion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1985.527,
    "end": 1992.732,
    "text": "This is the node with the highest UCT criterion, so we are basically asked to expand those children.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.162,
    "end": 2010.717,
    "text": " we can do so by just using the forward prediction for computing the state here and then from the state we use forward prediction once again to predict the future observation associated to this temporal slice okay more formally",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2012.043,
    "end": 2029.206,
    "text": " this generative model is a joint over all the random variable once again and it is the product of the probability of the temporal size at time t multiplied by all the future time temporal size okay so all the temporal size we have already been expanding during Monte Carlo research",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.348,
    "end": 2042.052,
    "text": " Each observation depends on a subset of the state within this temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2042.712,
    "end": 2047.994,
    "text": "And because we are at the top of the tree, the state at time step t does not depend on anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.135,
    "end": 2054.817,
    "text": "After that, for each temporal slice in the future, we still have the dependency",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.288,
    "end": 2069.839,
    "text": " that we still have the fact that the observation depends on the state within this temporal slice, but we also have the fact that the state in this temporal slice depends on the state in the parent temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2070.42,
    "end": 2077.867,
    "text": "So, for example, the state within this temporal slice has parents inside this temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2079.828,
    "end": 2082.391,
    "text": "Okay, so this is the way the generative model is defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2083.757,
    "end": 2089.028,
    "text": " Now, the way we perform inference is using what we call the IP algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.509,
    "end": 2094.78,
    "text": "So I stand for inference and P will stand for prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2096.636,
    "end": 2108.381,
    "text": " So this slide is about the inference step, and the goal is to compute the posterior over the state within the initial, like the current temporal slice, given the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.081,
    "end": 2113.983,
    "text": "I'm not going to go through this derivation, but you can pause the video if you are watching it on YouTube.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.884,
    "end": 2120.006,
    "text": "But yeah, so basically we do some derivation and then we obtain this solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2121.175,
    "end": 2132.463,
    "text": " which just tells us to take the product over all the likelihood mapping, with all the priors, and then use the belief propagation to actually marginalize out this function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2134.325,
    "end": 2136.727,
    "text": "And that's exactly what we are going to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2137.107,
    "end": 2139.769,
    "text": "We use belief propagation within the current time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2140.229,
    "end": 2147.735,
    "text": "So if I go back here, we have some observation here, and we use belief propagation to compute the state within the initial temporal phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2149.326,
    "end": 2152.949,
    "text": " So this is the E-step, the I-step, which is the inference step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2154.01,
    "end": 2161.156,
    "text": "Then we need to perform the P-step each time the multicolored research tells us to expand a part of the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2162.216,
    "end": 2174.927,
    "text": "So once again, I'm not going to go through this derivation, but basically the idea is to compute the posterior over the state in the next temporal slice, given the observation that we made in the current temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2176.963,
    "end": 2206.253,
    "text": " so here we see that basically once again we have some kind of summation over all the parents of the states in the temporal size that we want to conclude the posterior form and this is the transition mapping that we know and this is a posterior distribution from the previous temporal size so basically what we are doing is just doing forward prediction in this case taking the expectation of the transition mapping",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2207.128,
    "end": 2211.094,
    "text": " We can do this for the state and for the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2213.218,
    "end": 2220.91,
    "text": "So to come back to the main picture, we first use the i-step to compute the posterior over the state at the initial temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.076,
    "end": 2223.076,
    "text": " So this is the I-step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.697,
    "end": 2231.54,
    "text": "And then we can use this posterior distribution to compute the posterior over the state in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.84,
    "end": 2233.521,
    "text": "So maybe the state in this top wire slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.141,
    "end": 2242.925,
    "text": "And then we can use, once again, the P-step to compute the distribution over future observations that correspond to this top wire slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2243.545,
    "end": 2250.088,
    "text": "And we are going to do that for all top wire slides we want to explain in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2253.297,
    "end": 2259.16,
    "text": " Okay, and the next thing that we need to define, and last for this approach, is the expected fringe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.06,
    "end": 2267.904,
    "text": "So basically, the way we are going to define this is by first grouping all the observations into distinct subsets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.624,
    "end": 2279.029,
    "text": "So basically, O is the set of all observations in the temporal slice index by the multi-index I. Okay, and now we are going to split",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.235,
    "end": 2298.88,
    "text": " Once we have grouped those observations into subsets, the way we define the expected free energy is just as a sum over all possible groups of random variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.18,
    "end": 2313.987,
    "text": "So each of those, we will iterate over those, and then include the K-diversions between the prior and the predictive posterior for those observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.892,
    "end": 2319.655,
    "text": " So this is the risk term, the total divergence between what will happen and what we want to happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2321.136,
    "end": 2331.583,
    "text": "And then we will compute the ambiguity for each of the observations, which is as usual defined as the expected entropy of the likelihood mapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.744,
    "end": 2340.509,
    "text": "So this vert equation is probably new for people that have not read the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2341.567,
    "end": 2346.789,
    "text": " But we can look at one specific case, which makes it more intuitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2347.229,
    "end": 2354.192,
    "text": "And basically, this specific case is just when each subset corresponds to one observation in the temporal phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.852,
    "end": 2361.955,
    "text": "And in this case, the expected free energy for a specific policy, so for one specific multi-index,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.53,
    "end": 2388.947,
    "text": " is just the risk for the specific observation plus the ambiguity for the specific observation so we still have ambiguity plus uh risk and now we need um to present like to test those approaches together so compare branching time access inference with various time message passing by the same filtering and the last approach which is based on belief propagation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.831,
    "end": 2409.993,
    "text": " way we are going to do that is by using a variant of the described data sets basically we represent the environment as a bride and so we okay in this environment we have three different shapes we have entities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2410.816,
    "end": 2433.604,
    "text": " hertz that need to be pulled towards the bottom right corner of the image and we have squares and the squares need to be pulled on the bottom left corner of the image and because there are way too many positions in x and y what we do is that we do some form of state aggregation and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2434.551,
    "end": 2447.32,
    "text": " For the 8th first position in the upper left corner, if the shape is in one of those 8 positions, we are going to aggregate them into one state with index 0.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2447.36,
    "end": 2454.305,
    "text": "And for this, it will be index 1, and so on and so forth, up to 19 for the squares.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2455.186,
    "end": 2460.63,
    "text": "And if it's a Hertz, we will just allocate those states, the indices, between 20 and 39.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.69,
    "end": 2486.595,
    "text": " something for ellipses so what we are doing is basically reducing the state space so that some of those approaches can still do something because they are not powerful enough to solve the entire state space so here are the results where we compare violation passing but by then filtering and the last one which is based on belief propagation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.28,
    "end": 2500.565,
    "text": " In variational message passing, we had to use a granularity of 4, which meant that the size of the square is like a 4x4 square.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.865,
    "end": 2503.266,
    "text": "So the cells are the size of 4x4.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.547,
    "end": 2507.208,
    "text": "And with this setting, we were able to solve 96% of the task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.228,
    "end": 2510.269,
    "text": "And the average time for one trial is around 5 seconds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.158,
    "end": 2524.98,
    "text": " With the Bayesian filtering approach, we were able to go down to a granularity of 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.64,
    "end": 2528.461,
    "text": "So this time the cells are the size of 2 by 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2529.741,
    "end": 2536.684,
    "text": "And with this granularity, the agent becomes able to solve the task 98% of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.564,
    "end": 2549.388,
    "text": " But the thing is that because we reduce the size of the granularity, we also increase the size of the state space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2549.948,
    "end": 2559.015,
    "text": "And this produces an increase in computational times, which means that each trial now requires around 17 seconds to be executed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.612,
    "end": 2567.798,
    "text": " For the last approach, we use the fact that we now know the factorization of the likelihood and transition mapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.599,
    "end": 2574.864,
    "text": "And this allows us to go down all the way to only one, a range of one, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2575.224,
    "end": 2580.449,
    "text": "So we are now able to differentiate between every single x and y position inside the image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.944,
    "end": 2585.765,
    "text": " And with this granularity, we can solve the task perfectly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2586.346,
    "end": 2594.409,
    "text": "And because we can take advantage of the factorization of the distribution, we go a lot faster than all of the previous approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.93,
    "end": 2596.831,
    "text": "And we can solve the task in around 2.5 seconds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.21,
    "end": 2622.158,
    "text": " just i would just want to make one thing uh very clear here because this approach basically was able to model every y position every x position every shapes inside like your shapes uh of the despite environments all the orientation like possible orientation of the shape and all the scale um so basically each",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2623.178,
    "end": 2651.379,
    "text": " its shape can have different sizes and this scale dimension uh represent that so basically this approach was able to to deal with around 700 000 configuration of the state space now we have presented the results and show that this approach approaches um very performance like can be a very good performance but now how do we create that uh well here i've got a very small uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2652.287,
    "end": 2658.69,
    "text": " code example, where basically I'm retrieving from the environment the A, B, C and D matrices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.67,
    "end": 2674.597,
    "text": "The C matrix corresponds to the prior preferences of the agent, and as I already said several times, A corresponds to the likelihood, B corresponds to the transition, and D is the prior of the initial states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2675.742,
    "end": 2691.506,
    "text": " And then the way we go about creating the BTEI 3MF agents is just by creating a temporary slice builder, telling him that we have one action, which is called A underscore zero, then giving it the number of value that this action can take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.563,
    "end": 2713.331,
    "text": " then we just add one state for every single state of our system so the x position y position shape scale and orientation and we provide as a second parameter the like is the parameter of the trial over the state so now within our generative model we have the state of the system then we need to add the observation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2714.735,
    "end": 2723.021,
    "text": " For each of the states, we add one observation, which depends on the state through an A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.561,
    "end": 2726.663,
    "text": "So we provide an A matrix and the list of parents over there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.544,
    "end": 2731.947,
    "text": "And this basically will add an observation for each state in the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2733.925,
    "end": 2737.866,
    "text": " The before last step is just to add transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2737.966,
    "end": 2747.429,
    "text": "So basically for each state in the system, we say what is the B matrix that need to be used and what are the parents for this state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2747.969,
    "end": 2756.771,
    "text": "So for example, the position in X of the agent depends on the position in X at the previous time step and the action which is being performed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.752,
    "end": 2762.553,
    "text": "And this will basically add transition probabilities within the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.738,
    "end": 2786.916,
    "text": " the last step before to build the temporal size is just to define our prior preferences and because in the display data set we need to have prior preferences about the x y and the shape of um of a blob what we do that we we say here is one factor this is one of the x subsets of observations and we provide the c matrix associated to that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2787.95,
    "end": 2792.995,
    "text": " Then we call the function build, which just returns the temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2793.596,
    "end": 2798.021,
    "text": "And we create a BTEI3MapAgent, which uses this temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2798.781,
    "end": 2808.091,
    "text": "And we provide the number of planning iterations we want the algorithm to use, as well as the exploration constants that trade off exploration versus exploitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2809.212,
    "end": 2810.574,
    "text": "Exploration versus exploitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2813.152,
    "end": 2817.434,
    "text": " And this is a graphical user interface that we have been developing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2817.994,
    "end": 2821.336,
    "text": "Basically, here we can see the initial temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2822.376,
    "end": 2830.28,
    "text": "If we were in the software, we can click on the temporal slice and see the different posterior over all the state variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2831.32,
    "end": 2835.362,
    "text": "We can also see different information about those as the temporal slice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2835.682,
    "end": 2837.963,
    "text": "So the number of times have been visited on all the states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2838.823,
    "end": 2846.029,
    "text": " And then we can use the button on the right, on the left, to basically perform a step-by-step multi-carriage research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2846.329,
    "end": 2857.037,
    "text": "So what will happen in the interface is just we are going to add the children, and then we will be able to click on those children to explore those parts of the trees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2857.217,
    "end": 2860.58,
    "text": "And we will have information about the temporal slice in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2862.321,
    "end": 2868.466,
    "text": "So that's a tool that you can use to analyze both planning and the beliefs of the agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2870.72,
    "end": 2874.162,
    "text": " Okay, so now I'm done with presenting the different approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.362,
    "end": 2876.363,
    "text": "It's now time for me to conclude this presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2878.224,
    "end": 2880.005,
    "text": "So we have seen three different approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.725,
    "end": 2886.268,
    "text": "The first is based on Bayerstein-Mistache passing, and obviously using active inference and multicolored research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.449,
    "end": 2891.311,
    "text": "The second is based on Bayesian filtering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2891.851,
    "end": 2897.954,
    "text": "And the last one is based on the IP algorithm, which is a mixture of belief propagation and forward prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.36,
    "end": 2914.469,
    "text": " In terms of performance, the first, so BTEI-VMP, was basically slower, like less performance than the second one, which is less performance than the third one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.55,
    "end": 2922.975,
    "text": "But even with this increase in terms of performance ability on one approach to the next, there are still some tasks that we cannot solve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2923.035,
    "end": 2926.277,
    "text": "For example, how do we solve image-based problems?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.297,
    "end": 2931.242,
    "text": " it is not clear how we can learn the structure of the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2931.282,
    "end": 2939.758,
    "text": "For now, the modeler has to provide the description of the model, but it would be very nice if we could learn it from the data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2940.719,
    "end": 2941.28,
    "text": "And also,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2942.793,
    "end": 2949.676,
    "text": " For now, we have been providing the agent with useful sequences of actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.456,
    "end": 2963.222,
    "text": "For example, if we go back to the display environment, we could imagine a task where each time we go right, it's only pushing the shape one position on the right, and then one more, and then one more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.795,
    "end": 2974.899,
    "text": " But what we have been doing to make planning tractable is just by chunking all those actions together and maybe executing like eight actions altogether or maybe four actions altogether.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2975.599,
    "end": 2982.702,
    "text": "But this has its limitation and it will be really nice if we could run sequences of action like this automatically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2984.082,
    "end": 2985.362,
    "text": "But that's all I wanted to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2985.863,
    "end": 2990.144,
    "text": "Here are a few references if you want to look them up after the presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.784,
    "end": 2992.625,
    "text": "And yeah, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.837,
    "end": 2998.138,
    "text": " Thank you for the presentation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2998.698,
    "end": 3000.86,
    "text": "Indeed use our reactions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3004.302,
    "end": 3004.482,
    "text": "Well,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3005.714,
    "end": 3010.918,
    "text": " Very interesting, a lot of material and things for us to discuss.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3011.939,
    "end": 3017.042,
    "text": "I'll start with just one general question and then Jakob and Ali looking forward to your questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3017.883,
    "end": 3025.829,
    "text": "Just for some context, how did this team and you come to be working on this problem?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3026.129,
    "end": 3034.615,
    "text": "Were you working on active inference and interested in extensions or were you working in a different adjacent area and came to this algorithm?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3035.905,
    "end": 3042.377,
    "text": " Okay, so maybe one thing that I should have said is that I started a PhD at the University of Kent and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.482,
    "end": 3050.927,
    "text": " Basically, Howard and Marek, which are two of my collaborators on this project, are my supervisors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3051.367,
    "end": 3054.75,
    "text": "So this is how we came up to work together just through my PhD.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.43,
    "end": 3067.6,
    "text": "And Nostra Lacosta is a collaborator that I've been working with because I've been doing some presentation at the FILM, which is the Institute of Neuroscience, where Carl Finston is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3068.4,
    "end": 3075.789,
    "text": " And likely through a presentation, like during a presentation, Lancelot told me that he was interested in working with me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.089,
    "end": 3078.852,
    "text": "So this is how I started working with Lancelot da Costa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3079.813,
    "end": 3084.439,
    "text": "And so in terms of my background, I'm coming from a very computer science-like school.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.814,
    "end": 3093.366,
    "text": " pull up into coding, and then I arrived at the University of Kent, where I started to study about machine learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.947,
    "end": 3100.297,
    "text": "And this is where I started to gain some experience into reinforcement learning or even active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3101.238,
    "end": 3124.885,
    "text": " and uh basically Howard Bowman was initially and my suggestion as well was uh where two of my teachers and Howard Bowman was already interested in uh active inference and one one day basically after those classes i came and see him and say well i would be interested to a side project and that's how everything started and i ended up doing a PhD after that so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3126.502,
    "end": 3126.782,
    "text": " That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3127.282,
    "end": 3128.823,
    "text": "So basically, a bit of both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3129.063,
    "end": 3130.843,
    "text": "I come from machine learning, my address as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.524,
    "end": 3133.064,
    "text": "Low slow comes from pure mathematics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.744,
    "end": 3140.666,
    "text": "And what comes from, like neuroscience is a guy which bringing the activity from subject to the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3142.307,
    "end": 3142.627,
    "text": "Excellent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3143.027,
    "end": 3143.367,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3143.907,
    "end": 3146.168,
    "text": "So I have many more questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3146.288,
    "end": 3148.569,
    "text": "But how about Ali first with a question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3152.383,
    "end": 3157.187,
    "text": " Yeah, well, first of all, thanks a lot for your amazing presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.207,
    "end": 3159.369,
    "text": "I really learned a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.23,
    "end": 3166.035,
    "text": "Well, I'd like to make a couple of comments, if I may, and maybe a bunch of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.156,
    "end": 3175.743,
    "text": "Well, as you're well aware, active inference slash FVP research has been going on recently in basically two distinct paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.664,
    "end": 3179.086,
    "text": "The theoretical work geared",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.91,
    "end": 3183.254,
    "text": " mostly toward developing the underlying foundational principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.334,
    "end": 3188.62,
    "text": "For example, the work of Dalton, Sack, DeVita, Bell, Maxwell, Ramstead and colleagues comes to mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.621,
    "end": 3199.251,
    "text": "And the more application-oriented research, perhaps not unlike the distinction between theoretical and experimental physics line of researchers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.198,
    "end": 3221.819,
    "text": " But I'm not sure if you agree with me on this, but it seems to me that sadly the application-oriented research and especially the work on the various algorithmic implementations of active inference has not gained as much recognition as it should, at least as compared to the research and theoretical side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.54,
    "end": 3223.461,
    "text": "I mean, the amount of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.142,
    "end": 3228.687,
    "text": " related published literature is pretty scarce comparatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.248,
    "end": 3230.83,
    "text": "So in light of this context,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.441,
    "end": 3238.467,
    "text": " Your line of research seems to me a lot more daring and, again, much more significant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.487,
    "end": 3240.508,
    "text": "So I wanted to congratulate on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.269,
    "end": 3247.094,
    "text": "But you see, I'm a big fan of unification in science and technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.154,
    "end": 3254.101,
    "text": "So my first question is about your opinion on the possibility of unifying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.945,
    "end": 3262.167,
    "text": " the different algorithmic implementations of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.008,
    "end": 3273.836,
    "text": "As an example, you just mentioned the automatic learning of the structure of the generative model as a possible subject for future research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.336,
    "end": 3277.018,
    "text": "I'm not sure if you've seen Wuthier et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.998,
    "end": 3286.805,
    "text": "'s very recent paper from a couple of weeks ago, namely Learning Generative Models for Active Inference Using Tensor Networks, if I'm correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.325,
    "end": 3291.667,
    "text": " which outlines an interesting physics-inspired approach for that task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.567,
    "end": 3302.912,
    "text": "But it doesn't include any citations to any of the branching time active inference papers, probably because they weren't aware of your work at the time of their writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.532,
    "end": 3314.337,
    "text": "But this work looks to me as a pretty good candidate for a potential integration with BTAI in order to overcome some of the limitations you just mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.656,
    "end": 3320.681,
    "text": " Or another recent example would probably be Senech et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.641,
    "end": 3333.373,
    "text": "'s paper deriving time-averaged active inference from control principles, which is an attempt to derive an infinite horizon average surprise formulation of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.634,
    "end": 3338.458,
    "text": "So I really liked your comparative overview of the different variants of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.008,
    "end": 3342.431,
    "text": " branching time active inference, especially the benchmark analyses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.032,
    "end": 3350.979,
    "text": "And I know you described a sophisticated active inference in your work as a subset of branching time active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.999,
    "end": 3364.151,
    "text": "But regardless of these specific examples I just mentioned, I wanted to ask, how do you see the future of BTAI in terms of its possible unification with the other variants of active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.611,
    "end": 3375.499,
    "text": " implementations, each with its own pros and cons, in order to overcome some of their limitations without compromising the advantages of each.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3376.42,
    "end": 3388.589,
    "text": "I mean, do you see it as a possibility that branching time active inference will one day subsume all the other approaches somehow in a truly integrated kind of framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.915,
    "end": 3392.076,
    "text": " So to be honest, I don't exactly know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3392.096,
    "end": 3403.323,
    "text": "The only part of the literature that I've been exploring is the connection with project-time active inference as being active inference and sophisticated inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3404.023,
    "end": 3412.368,
    "text": "I won't be able to speak about this in the presentation, but I can quickly give the idea of what has been the conclusion of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3415.379,
    "end": 3429.591,
    "text": " And basically, it is really about how we backpropagate what I call the local expected free energy, which is basically the expected free energy associated with one node in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.312,
    "end": 3435.156,
    "text": "And so if you backpropagate those upwards in the tree following",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.957,
    "end": 3465.768,
    "text": " like multi-carriage research which basically comes from Bellman's equations and all this kind of literature and reinforcement learning you will fall into you will end up with an approach which is very close to sophisticated inference basically because sophisticated inference is also taking some inspiration into the Bellman equations just applying it to the expected free energy instead of just having reward",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3466.628,
    "end": 3484.766,
    "text": " uh if you go downward so if you back propagate those local local costs towards the future then what you are effectively doing is just computing like the path integral of the expected free energy and so this will be active inference just taking the sum of all future parent stat of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.286,
    "end": 3488.427,
    "text": " of the expected for energy basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3488.447,
    "end": 3491.169,
    "text": "So this was sophisticated inference and this would be active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3491.71,
    "end": 3499.174,
    "text": "Now concerning the other approaches that you mentioned, I haven't been reading those papers, so I can't really state on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.075,
    "end": 3503.437,
    "text": "But yeah, I believe that branching time-active inference is a fairly general framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3503.797,
    "end": 3508.961,
    "text": "So it may be the case that some of them will be related, but more research is needed on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3511.082,
    "end": 3511.742,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3512.563,
    "end": 3513.504,
    "text": "Great comments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3514.104,
    "end": 3515.525,
    "text": "Jakob, do you have any question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3516.949,
    "end": 3520.935,
    "text": " Yeah, once again, thanks a lot for the awesome presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3521.215,
    "end": 3530.249,
    "text": "It definitely explained a lot of things that I didn't understand on my reading through the original paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3532.001,
    "end": 3540.087,
    "text": " I'm wondering, again, going back to the question of learning the structure of the different components of the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3541.668,
    "end": 3553.157,
    "text": "In your paper, you mentioned using deep neural networks as general function approximators for learning the states-based representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3553.297,
    "end": 3554.117,
    "text": "And I'm wondering whether you...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3554.918,
    "end": 3563.903,
    "text": " have given some thought of into how neural networks might fit into this factor graph representation of the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3564.823,
    "end": 3573.307,
    "text": "And I guess I guess there are perhaps also two ways to look at learning the structure of these different components.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3573.427,
    "end": 3582.092,
    "text": "One is just the initial step of in your slide where you showed the kind of initialization of the model, getting the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3583.192,
    "end": 3604.706,
    "text": " a and b tensors the the prior the preferences and and um the prior beliefs kind of replacing that step with uh with deep neural networks to learn the representations but perhaps there's also another uh another side to um where you could dynamically change",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3605.586,
    "end": 3632.712,
    "text": " the dimensions of these different components as in perhaps the agent receives an observation that wasn't captured in the likelihood mapping of the a tensor or perhaps it's a multi-agent setting where one agent has affordances the other agent doesn't and a new transition mapping needs to be learned through observations uh so i'm uh wondering what your thoughts are on this and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3633.792,
    "end": 3659.521,
    "text": " how you think this might be compatible with branching time active inference okay so the deep learning um area is i think really interesting and should be enabling active inference to scale to a more complicated task and more recently so this paper is not yet out but i'm working on a deep learning version of active inference so for now there is no branching time inside the picture so there is no multi-carat research",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3660.859,
    "end": 3666.464,
    "text": " And the reason is because it's already surprisingly difficult to make it work just for active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3667.452,
    "end": 3676.541,
    "text": " And basically, I've been reviewing some of the paper in the literature, and then I provide my own implementation of deep active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3677.221,
    "end": 3690.233,
    "text": "But for example, I spoke about this prior dataset, and I was not able to make deep active inference work on these approaches, on these environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3691.58,
    "end": 3718.213,
    "text": " so yeah and i've been doing a presentation as a fear about this uh but basically some of the implementation of the internets contain mistakes um and yeah some of the paper also contains some like i mean i'm not sure if for the paper it's like mistake but that's that i don't understand and um for now the authors have not been able to to answer my questions um so basically what i'm trying to say that i've been trying to implement deep active inference and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.446,
    "end": 3734.605,
    "text": " surprisingly it's quite difficult to make it work at least on the despite environment so there will be a first paper about and that is analyzing what the deep neural networks are actually learning and why it is failing on these environments",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3735.715,
    "end": 3758.571,
    "text": " And then what I wanted to do is to try to apply this implementation that I hope is correct to different tasks, more especially like the target games and stuff like this, and try to find out whether there are some tasks for which the expected free energy and this implementation of deep active inference can actually solve the task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3759.312,
    "end": 3762.094,
    "text": "And the preliminary result that I have on this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3764.375,
    "end": 3788.795,
    "text": " is that there seems to be some task of which uh deep active inference um is actually performing better than for example dqn which is a benchmark from the reinforcement learning literature and uh yeah but it's not as um as straightforward basically uh as it seems um for now it's quite challenging to implement that so that was more for like the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3790.422,
    "end": 3817.574,
    "text": " deep learning aspects i think we still need to work quite a lot before to to make something very robust and that can beat more standard reinforcement learning for like benchmarks and yeah the other approaches to structural learning i have not been able like i have not researched it for now so we need more time to to think about a more robust answer to your question that's yeah that's basically what i had to say",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3819.571,
    "end": 3820.212,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3822.073,
    "end": 3828.419,
    "text": "One really striking aspect of the presentation was the analysis of the computational complexity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3829.18,
    "end": 3835.346,
    "text": "So maybe we could return to this because it's something that we've wondered about and discussed on a few occasions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3836.932,
    "end": 3851.717,
    "text": " You presented the theoretical complexity classes with a big O notation and then also discussed some of the practical aspects of the actual clock time on a given hardware.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3851.897,
    "end": 3862.16,
    "text": "Wasn't exactly sure what language or hardware you ran it on, but provided the theoretical complexity class as well as some runtime provisioning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3862.72,
    "end": 3865.201,
    "text": "So I was curious to hear some...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3866.803,
    "end": 3886.617,
    "text": " Thoughts on how does this big O computational complexity analysis shine light on different variants of active inference as well as branching time active inference and what real computational resources were taxed",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3887.618,
    "end": 3910.23,
    "text": " in the analysis was this a ram overflow that caused the crash that you referenced earlier is it a cpu throttling is it paralyzable does it require temp files like what in theory is happening with the computational complexity and the exponential blow up and then what in practice is going to facilitate this kind of analysis to scale",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3911.909,
    "end": 3923.316,
    "text": " Okay, so first thing, this complexity analysis was done in terms of the space which is required to store all the parameters of the distribution of a state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3923.996,
    "end": 3933.002,
    "text": "Okay, so here we are really interested in how much space do I need in order to store all the distribution of a state, like all the posterior distribution of a state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3934.358,
    "end": 3955.999,
    "text": " and that if what happens in standard active inference is that the number of policies that will be available to the agent so let's suppose we have two actions we have one here one here okay action zero action one here at the first time step there are two actions at the second time step there will be four of them like four policies basically that the agent can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3958.052,
    "end": 3959.193,
    "text": " can actually perform.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3959.553,
    "end": 3963.235,
    "text": "It can go for 00, 01, 10, and 11.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3965.396,
    "end": 3971.94,
    "text": "And this number of policies will basically be multiplied by two each time step further down the road, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.381,
    "end": 3977.103,
    "text": "Because each time we can now pick each of the action again for each of the previous policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3978.364,
    "end": 3985.429,
    "text": "And this exponential growth is quite problematic for, for example, the prior of a policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.449,
    "end": 3986.109,
    "text": "So if you remember,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.245,
    "end": 3992.166,
    "text": " this definition for the prior of the policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3992.727,
    "end": 3999.551,
    "text": "We see that in order to define the prior over the policy, we need to compute the expected free energy for each of those policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4000.711,
    "end": 4006.635,
    "text": "But we need to do that for an exponential number of them as the time horizon of planning increases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4007.455,
    "end": 4008.396,
    "text": "So this is the first problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4008.416,
    "end": 4009.476,
    "text": "Also,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4012.794,
    "end": 4041.48,
    "text": " this exponentially exponential explosion is not limited to the number of policy because we still remember okay so maybe for this one i need to go and look at the variational distribution which is used in variational inference but we see that the number like the variational posterior of a state depends on the policy so for each of the policy we need to store a distribution of a state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4042.958,
    "end": 4053.523,
    "text": " And this is, once again, a problem because there is an exponential number of policy, which means that there is an exponential number of of a that we need to store.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4055.604,
    "end": 4061.126,
    "text": "So this is the kind of problem that happens within standard active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4061.827,
    "end": 4064.668,
    "text": "The number of policy is growing exponentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4065.889,
    "end": 4071.051,
    "text": "And we also need to store the distribution of a state for each time step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4073.567,
    "end": 4090.188,
    "text": " now where branching time active inference becomes useful is that it uses a structure like the graph structure to avoid to have to store every single single possible combination of uh you know time step versus policy and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4091.892,
    "end": 4101.18,
    "text": " this, those two, we see that it's growing linearly because we just keep in memory one distribution for each state in the past and present.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4102.16,
    "end": 4108.205,
    "text": "And only when it comes to the current time step do we start imagining what's going to happen in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4109.206,
    "end": 4111.728,
    "text": "And this growth is still exponential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4112.008,
    "end": 4118.854,
    "text": "Like if we had to explore every single possible policy in the future, we will still have an exponential growth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4119.901,
    "end": 4148.443,
    "text": " but because we are using multi-carriage research basically we are going to only explore a small amount of the tree and this is where the complexity move from exponential to linear into the with respect to the number of expansion of the model so each time we expand a new branch in this model we need to store one more categorical for this uh future time step basically and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4148.792,
    "end": 4161.4,
    "text": " So this is how we can move from an exponential complexity class into a linear one with respect to the number of expansion of the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4163.281,
    "end": 4164.962,
    "text": "So that was for the complexity class.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4166.963,
    "end": 4169.745,
    "text": "In terms of hardware, it was basically just on my own computer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4170.405,
    "end": 4176.089,
    "text": "So no graphical GPU used, nothing like this, just CPU, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4179.244,
    "end": 4184.711,
    "text": " Very interesting and on the hardware or on the implementation side, where do you see",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4186.325,
    "end": 4194.509,
    "text": " packages in Python or Julia like Forney Lab and the reactive message passing paradigm being developed?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4195.169,
    "end": 4197.93,
    "text": "Or do you see GPUs as being relevant?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4198.29,
    "end": 4200.691,
    "text": "Like this is the storage consideration.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4201.272,
    "end": 4210.576,
    "text": "What kinds of scaling relationships or in theory and practice, how are the operational aspects of the computing rather than the space requirements computed?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4211.949,
    "end": 4220.834,
    "text": " So, first thing to say is that the space complexity is also linked to the time and computational complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4221.734,
    "end": 4224.776,
    "text": "Because, for example, as I said when I was speaking about the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4228.28,
    "end": 4250.784,
    "text": " the prior of our policy if we have an exponential number of policy we need to compute an exponential number of expected free energy for each of those policies so and same thing for when it comes to the posterior when we have to store the variational posterior and that there is an exponential number of them then we also need to compute them so this will also become intractable in the long term",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4252.421,
    "end": 4259.505,
    "text": " And in terms of implementation, I know that some people have been developing like Phonelab in Julia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4260.265,
    "end": 4262.266,
    "text": "I've been providing my own implementation in Python.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4263.627,
    "end": 4265.528,
    "text": "So yeah, those are possibilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4266.148,
    "end": 4279.335,
    "text": "In terms of GPUs, I guess their usage will be really useful only if the graphical model allows for parallelization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4280.68,
    "end": 4307.004,
    "text": " example one case where the gpus are very useful is for images because each position in the image can generally be processed in parallel so if we had like a generative model where we had i don't know likelihood mapping purchase four pixel next to each others like a patch in the image and we had to compute the all the posterior for all the image then there is a very large potential for parallelization",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4308.427,
    "end": 4319.815,
    "text": " But if, for example, a message has a dependency on a previous message, then there will be just a part of the GPU which is just waiting for the input message to arrive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4320.575,
    "end": 4329.321,
    "text": "So there is also a particular limitation on that, because some of the analytical solutions require some other messages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.341,
    "end": 4335.325,
    "text": "So there are some dependencies throughout the dependency, like the graphical model, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4336.385,
    "end": 4344.568,
    "text": " So using GPU, yes, but probably in specific generative model for which it's useful, such as image-based generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4346.108,
    "end": 4347.269,
    "text": "So yeah, this kind of generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4347.329,
    "end": 4354.951,
    "text": "If we have something which is very simple, then I think it's not going to benefit a lot from GPU's computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.852,
    "end": 4358.212,
    "text": "Excellent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4359.293,
    "end": 4359.673,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4362.494,
    "end": 4365.895,
    "text": "Ali again, or Jakob, if you'd like another question, or I can ask one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4369.944,
    "end": 4378.055,
    "text": " Yeah, I also wanted to ask about the different possible future implementations of branching time active inference because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.45,
    "end": 4384.974,
    "text": " Daniel and Jakob know that I'm a big Julia fan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.915,
    "end": 4399.825,
    "text": "So I wanted to know if there's a plan to have a Julia implementation of branching time active inference, because I think we already have C++ and Python, if I'm correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4399.866,
    "end": 4402.488,
    "text": "The first branching time active inference was implemented in C++.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.809,
    "end": 4406.951,
    "text": " the multimodal one in Python.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.671,
    "end": 4415.637,
    "text": "So what are the future plans for the other forms of implementation of BTAI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.815,
    "end": 4420.377,
    "text": " So for now, I was just planning to just use Python.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4420.977,
    "end": 4424.819,
    "text": "But I guess it should not be too hard to port it in Julia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4424.839,
    "end": 4426.56,
    "text": "It's just for now I don't have the usage for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4429.001,
    "end": 4440.427,
    "text": "But yeah, and also for future possibility when it comes to branching time active inference, I've been starting to work on trying to implement a SLAM algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4441.347,
    "end": 4456.363,
    "text": " um so this uh is a simultaneously location and mapping so that if we create a map of the environment as we navigate for it so this is also like a possibility but within this context",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4457.628,
    "end": 4484.343,
    "text": " basically was going to grow exponentially that we can have observation that depends on a very large number of states and therefore what we need to have is more like a conditional probability table which is stored as a tree so it's basically you can encode rules within the conditional probability table for example you have let's put that you have okay probability of c given a and b",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4485.543,
    "end": 4493.292,
    "text": " then maybe if A is equal to one, you want to have a branching on B, and then we have zero one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4494.113,
    "end": 4497.437,
    "text": "And maybe this is the whole point, okay, nine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4498.959,
    "end": 4510.528,
    "text": " Okay, so what this means is that if A is equal to 1 and B is equal to 0, then the probability distribution of a C is going to be 0.1 for the first value and 0.9 for the second value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4511.228,
    "end": 4522.337,
    "text": "And so basically the idea is to try to not represent the entire table, but choose a tree structure to encode rules about the dynamic of the world and the likelihood function as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4523.74,
    "end": 4531.389,
    "text": " And then the challenge is to be able to perform forward prediction from this tree and inference also from this tree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4532.11,
    "end": 4537.076,
    "text": "So this is another feature which may be integrated inside BTEI in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4539.841,
    "end": 4559.585,
    "text": " Definitely a theme that runs through a lot of these discussions is representing objects as trees and then taking the tree turn or the forest turn seriously because the tree structure allows us to avoid redundancies and enable some new types of analyses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4560.325,
    "end": 4562.265,
    "text": "Jakob, do you have a question or I can ask one?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4563.505,
    "end": 4564.966,
    "text": "Yeah, maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4566.772,
    "end": 4593.744,
    "text": " Continuing on the SLAM thread, I'm wondering whether you're considering the application of SLAM to the image classification problem, and perhaps how the image classification problem needs to be reframed to even fit this, well, first of all, branching time active inference scheme, but overall active inference scheme, because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4596.041,
    "end": 4615.97,
    "text": " It seems that active inference overall is much better suited to these kind of continuously evolving problems where the generative process changes whenever the agent takes actions, whereas an image classification problem",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4617.15,
    "end": 4633.042,
    "text": " seems to be way more static, which at least in the machine learning scheme, it's just input and output, and then perhaps some error that gets back-propagated through the network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4634.724,
    "end": 4646.132,
    "text": "So I'm wondering how you are thinking about image classification with active inference, and overall, just how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4647.273,
    "end": 4673.472,
    "text": " images can act um as input in in um dynamical environments so yeah thank you for the question once again um this is so basically the thing with like image classification is that we don't have this temporal structure like you just mentioned which makes it quite difficult for an active inference agent to be applied to this in some sense it's a bit like the transition mapping is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4674.525,
    "end": 4676.767,
    "text": " is like an identity function in some sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4677.327,
    "end": 4681.47,
    "text": "So it's difficult to think about how you can bring it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4681.55,
    "end": 4685.834,
    "text": "But yeah, because each timestamp could be one image, for example, in the classification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4687.415,
    "end": 4693.099,
    "text": "But I think active inference is just not really well suited to something like this for classification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4693.62,
    "end": 4699.444,
    "text": "I think there are just classification models, like whatever, ResNet or whatever, which are much better suited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4702.093,
    "end": 4713.276,
    "text": " Basically, if you had to apply active inference, you would have to change the structure of the model to remove the temporal transition and just to have observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4714.916,
    "end": 4724.118,
    "text": "Otherwise, you will need some kind of dynamic environments, like the Atari games, Pac-Man, or this kind of thing, or the display environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4724.639,
    "end": 4730.42,
    "text": "And in this case, you can model the temporal dynamic of the environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4730.78,
    "end": 4755.051,
    "text": " and so here active inference really helps because you can you know think about action and how they impact the transition and you can have so basically an encoder that will compress the image so you will have technically an image here you will have an encoder networks a bit like in a variation autoencoder that will produce a parameter so the mean and the variance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4755.891,
    "end": 4778.389,
    "text": " of a distribution of a state and then we will have the decoder over there which produce another image from the latent variable basically and then we will have here like a transition networks which is also a deep neural networks which outputs as a minimum variance of a distribution over the state at the next time step",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4779.406,
    "end": 4798.796,
    "text": " and yeah and then here you will have another encoder for the future image and another decoder for the future image as well and these transition networks will have to take into account basically the action as well as the states to predict the next state so that's the kind of architecture you will need to create a deep active inference agent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4800.433,
    "end": 4806.016,
    "text": " And I think it's better suited to dynamic environments, like a target game, than it is for static environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4807.316,
    "end": 4809.517,
    "text": "This is indeed a lot more complicated to apply it to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4811.638,
    "end": 4814.12,
    "text": "If I could give a few thoughts on ImageSlam.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4815.3,
    "end": 4821.963,
    "text": "Very fascinating point about static analyses and dynamic analyses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4822.584,
    "end": 4822.944,
    "text": "And so,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4824.278,
    "end": 4830.919,
    "text": " what are some ways that we could pseudo-dynamicize the image classification task?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4831.119,
    "end": 4832.06,
    "text": "So a few options.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4832.5,
    "end": 4837.461,
    "text": "One of them is navigation amongst large databases of images.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4838.161,
    "end": 4851.724,
    "text": "So potentially choosing informative examples for training in large empirical image databases or frames from video, or in a dynamic feedback with prompt engineering for AI generated images.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4852.384,
    "end": 4870.667,
    "text": " so then it makes it into a dynamic question response task that would be using dynamics at the level across images but still taking in the whole image and one other approach could be building on some of the oculomotor active inference models of attention",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4871.926,
    "end": 4890.074,
    "text": " only taking in a small amount of the image, potentially reducing the state space or the computational complexity vastly, and then making the dynamics of some lower level entity related to policy selections on eye movements or attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4890.954,
    "end": 4919.4,
    "text": " and then treat that as like the lower level of the slam and the classification what kind of image am i looking at as a higher level of a slam but the policy is being enacted at the level of which parts of the image are being scanned yeah that's indeed a very nice setting of ideas which require modification of the task uh but is indeed pretty much more like much better suited to active inference um so very interesting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4921.294,
    "end": 4935.578,
    "text": " I wanted to also ask about two modules or functions that various other active proposals have had, which are hierarchical nesting of models and learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4936.679,
    "end": 4944.021,
    "text": "So how do nesting and learning influence the theoretical and the realized computational complexity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4945.419,
    "end": 4953.948,
    "text": " So I think having a hierarchy can really help reduce the computational complexity of an active inference agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4955.129,
    "end": 4959.614,
    "text": "For example, one idea would be to... So I was speaking about generative model over images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4961.557,
    "end": 4975.248,
    "text": " imagine you had like an image and then so an image can be like it's millions of possible combination rights like not even more than that but probably more than atoms in the universe but what you could do is like a bit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.389,
    "end": 4979.951,
    "text": " by imitating the structure of a convolutional neural networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4980.351,
    "end": 4987.795,
    "text": "Maybe you can create, over a patch of pixels, a generative world that will extract, for example, different line patterns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4987.815,
    "end": 4992.938,
    "text": "So maybe diagonal lines or horizontal lines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4993.358,
    "end": 4997.701,
    "text": "And so you will have a first level of the hierarchy, which will extract those informations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4998.101,
    "end": 5001.202,
    "text": "And then you will have pattern of patterns and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5001.583,
    "end": 5002.623,
    "text": "I think you can create this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5004.224,
    "end": 5020.214,
    "text": " know as a category called distribution but in a year model basically at the very beginning you have pixels and then you have uh small edges and stuff like this and combination of pages and all the way up basically to to having objects um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5021.135,
    "end": 5035.562,
    "text": " but this is very complicated like um in terms of implementation we will require to like probably use gpu for the inference process because there will be a very large number of patches uh so we will need to speed up the training",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5037.15,
    "end": 5043.015,
    "text": " But still, I think this is a very good way to reduce the state space of the agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5043.675,
    "end": 5056.245,
    "text": "Because if you try to basically put an image as input of a standard active inference agent, you will have to have more possible images on the board of atoms in the universe, even for relatively small images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5057.386,
    "end": 5059.208,
    "text": "So the hierarchy can really help on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5062.073,
    "end": 5065.275,
    "text": " So you had another question, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5065.415,
    "end": 5067.336,
    "text": "The second aspect was about learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5067.536,
    "end": 5081.166,
    "text": "For example, what if we update our priors as the tree continues, or we want to consider policies on priors or other types of updating of our different parameters that might be fixed in other settings?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5082.406,
    "end": 5087.41,
    "text": "Yeah, so one thing to say about having learnable priors is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5089.079,
    "end": 5116.677,
    "text": " some cases this could go very wrong so if you don't like okay imagine you have observations and you have states so those are the observations uh or sorry this is the states and this would be the observations so three possible states two possible observations and if you start with the gvhk prior which is just fully uniform so maybe the parameters are all one everywhere",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5117.95,
    "end": 5130.532,
    "text": " Well, what's going to happen is that if you make one of the observations, it's just going to give you as much as the inference process within a uniform distribution of the states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5131.913,
    "end": 5135.873,
    "text": "Because the weights within the matrix are basically all one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5136.133,
    "end": 5143.615,
    "text": "So for each observation, there is no real state which will be more likely to basically generate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5144.721,
    "end": 5168.85,
    "text": " mean that the inference process will have a uniform distribution of a state and basically this is a problem because what you will end up having is like a matrix where maybe some states are more likely but each state is not more likely to generate different observations and so basically there is a failure of learning because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5170.43,
    "end": 5182.64,
    "text": " it's just not able to... So if you remember the way we update the parameters of the Dirichlet, it's just by counting the number of state observation pairs that we have been observing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5183.401,
    "end": 5189.526,
    "text": "And if the state which is observed is always like one point, like one third, for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5190.612,
    "end": 5197.135,
    "text": " like if it's a uniform distribution, then it's going to count one third of the observation for all the states at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5197.836,
    "end": 5206.98,
    "text": "And we are not able to identify which state has been able to generate this observation because they are all as likely to generate these observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5207.701,
    "end": 5219.787,
    "text": "And so what is going to happen is that you obviously just cannot learn which states generate which observations just counting the number of times a state has appeared, but not with respect to observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5220.956,
    "end": 5233.575,
    "text": " So this is a degenerate case, which shows that having matrices, for example, with Dirichlet priors and stuff like this, can fail to ruin the dynamic of the environment and the likelihood of the environment as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5235.12,
    "end": 5264.387,
    "text": " so maybe having deep neural networks can you know avoid this problem uh but yeah it seems that's a real challenge like learning the parameters within an active inference model seems to require like a human to first give it a first draft where the likelihood like like the prior is not uniform when it comes to the Jewish layer if the model is to be able to learn",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5265.762,
    "end": 5269.203,
    "text": " So this is one of the challenges for learning in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5273.724,
    "end": 5280.386,
    "text": "It's something we've come across in specifying the state space and what policies are possible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5281.347,
    "end": 5289.409,
    "text": "And it's an interesting conversation because it brings us as modelers into engagement with the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5290.746,
    "end": 5305.827,
    "text": " and helps clarify where are we setting scaffolds and constraints what information are we what manifolds are we placing that agent into that set it up oh it's rolling downhill",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5306.488,
    "end": 5318.294,
    "text": " within some super local context, even if that local context is still enormous in its state space, it may still be just the tip of the iceberg in terms of the total model structures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5318.874,
    "end": 5335.162,
    "text": "And that's not even to say we need to explore the total model structure in practice, but in theory, it's quite important, or we might just be looking where the light is and putting the rabbit in the hat, making these models that play out a certain way, maybe even deterministically,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5335.982,
    "end": 5340.087,
    "text": " because they've been kind of told a secret in the beginning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5340.107,
    "end": 5348.096,
    "text": "I have one more question, and then I'll leave it to Jakob.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5351.058,
    "end": 5361.98,
    "text": " You juxtaposed and contrasted three different approaches, which were variational message passing, Bayesian filtering, and belief propagation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5363.02,
    "end": 5378.203,
    "text": "And whether for didactic or pragmatic use, where do you see these different approaches as being useful or specialized?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5379.324,
    "end": 5405.119,
    "text": " where are they better or where is one a generalization or a special case of another so for example by national message testing so the way we structured the model in via massage passing that we keep track of the past and each time we get new observation into inside into the future so let me maybe just go here um oh no",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5405.939,
    "end": 5422.512,
    "text": " yeah so okay so in variational message passing for example we keep the past and this is quite interesting because when you have variational message passing you can also have backward messages between that as you get a new observation you will have an echo like the state associated to it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5423.735,
    "end": 5429.882,
    "text": " And what is going to happen is that you will have a message like this, and you will also have messages that go backward in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5430.643,
    "end": 5437.09,
    "text": "And those messages will enable you to refine your understanding of what happened in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5438.234,
    "end": 5457.43,
    "text": " So this ability to revisit or update your understanding about the past is something which is quite specific to the Weierstein message passing algorithm and does not appear, for example, in Bayesian filtering, in the Bayesian filtering setting, because we only keep a belief state",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5458.331,
    "end": 5484.242,
    "text": " of uh over the current random viable and when we expand like when we get a new observation um and a new state associated to it we are just going to perform prediction uh to get the posterior and then we are going to get rid of that so we cannot have those backboard messages um to get posterior beliefs over past states so we can't really have this kind of counterfactual abilities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5486.181,
    "end": 5495.987,
    "text": " Now with the belief propagation algorithm, basically it's very similar in ID to what is done in the belief propagation settings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5496.647,
    "end": 5514.078,
    "text": "It is just a more scalable approach, which enables one to have different item states and different observation, because this BTIBF approach was only restricted to one observation and one state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5514.878,
    "end": 5528.318,
    "text": " And if you have, for example, the X position, the position of the text as a disparate environment, then you will need to create one random variable that corresponds to all the combinations of those X and Y positions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5528.718,
    "end": 5529.419,
    "text": "So maybe it will be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5530.16,
    "end": 5544.666,
    "text": " random variable describing the position and if we had two value for each of other you know for the x position and the y position then all the combination will be like four uh each of the value for one uh times all the other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5546.147,
    "end": 5567.862,
    "text": " and and this goes exponentially with the number of variables so let's suppose we have now a scale variable available and that this kind of variable can take two additional values then the total number of combinations of those three random variables will be like eight eight possible combinations basically all the x and y position for each of the two scale a possibility maybe scale one and scale two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5569.187,
    "end": 5581.533,
    "text": " And this exponential growth becomes problematic if you don't have this ability to have several observations and several states, because you will have an exponential growth in the number of states and observations you try to model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5582.434,
    "end": 5594.94,
    "text": "And this is where the other approach, multi-factor and multi-modality, is really useful to scale to a more complicated approach with more states and observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5597.068,
    "end": 5597.408,
    "text": " Excellent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5597.969,
    "end": 5601.832,
    "text": "Ali or Jakob, any closing questions or thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5607.077,
    "end": 5619.008,
    "text": "Well, you see, I came across your work a few months ago, and it got me truly excited so much that I read all five of your papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5620.75,
    "end": 5622.231,
    "text": "Is the number five right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5622.492,
    "end": 5622.712,
    "text": "I mean,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.688,
    "end": 5629.473,
    "text": " You've published five papers up to now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.714,
    "end": 5646.348,
    "text": "Because you see, more often than not, people see active inference and the free energy principle as basically speculative thinking and endeavor without so much pragmatic value in the real applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.928,
    "end": 5650.011,
    "text": "So in my opinion, your work,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.7,
    "end": 5658.543,
    "text": " As I mentioned, there's a very welcome addition to this nascent yet exponentially growing field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5659.363,
    "end": 5673.629,
    "text": "And I hope to see more exciting developments in the future for branching time active inference or possibly the other variants you might come up with in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5675.03,
    "end": 5678.711,
    "text": "And I'll definitely keep following your work from now on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5679.591,
    "end": 5682.814,
    "text": " So thanks so much for your joining us today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.276,
    "end": 5684.756,
    "text": "No problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5684.817,
    "end": 5686.058,
    "text": "And thank you for inviting me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5686.438,
    "end": 5688.3,
    "text": "I'm really glad I could present here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5688.32,
    "end": 5690.022,
    "text": "So thank you for the invitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5691.904,
    "end": 5693.105,
    "text": "Jakob, any final thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5695.107,
    "end": 5695.788,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5695.868,
    "end": 5701.274,
    "text": "Well, this has been a really great presentation and discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5703.169,
    "end": 5711.48,
    "text": " Ali also linked your work a couple of months ago and also got me very excited for the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5715.285,
    "end": 5717.546,
    "text": " future of active inference modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5718.086,
    "end": 5725.49,
    "text": "And it's a topic that we're discussing quite a lot in the Institute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5726.291,
    "end": 5744.7,
    "text": "And I think that this approach to reducing the computational cost of performing active inference in more and more complex state spaces is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5746.305,
    "end": 5756.561,
    "text": " probably the best way to go to really reach adoption of these models in different domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5757.242,
    "end": 5760.087,
    "text": "So yeah, thank you very much for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5761.485,
    "end": 5785.948,
    "text": " joining today and uh i look forward to reading that paper on on the deep active inference deep branching time active inference sure thank you well you're welcome back anytime and we will um certainly be observing thank you sure thank you bye bye thanks bye",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5794.195,
    "end": 5794.576,
    "text": " Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.822,
    "end": 5797.463,
    "text": "Yeah, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5798.365,
    "end": 5798.806,
    "text": "Brilliant.",
    "speaker": "SPEAKER_01"
  }
]