[
  {
    "start": 4.189,
    "end": 8.272,
    "text": " Hello, everybody, and welcome back to the seventh episode of Active Inference Insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.892,
    "end": 14.016,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I have, for the first time, two guests to bring you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.616,
    "end": 21.821,
    "text": "Vicente Raja is a research fellow at the University of Mercia and affiliate faculty of the Rotman Institute of Philosophy at Western University in Canada.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.401,
    "end": 28.025,
    "text": "His research lies at the intersection of philosophy, cognitive science, neuroscience, and the history of the sciences of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.685,
    "end": 32.608,
    "text": "In 2021, he was the first author of the paper, The Markov Blanket Trick,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.089,
    "end": 45.071,
    "text": " on the scope of the free energy principle and active inference, which argues that, quote, the FEP is not the general principle it is claimed to be, and the active inference is not the all-encompassing process theory it is purported to be either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.848,
    "end": 46.809,
    "text": " We also have Jeff Beck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.269,
    "end": 51.791,
    "text": "Jeff is a computational neuroscientist studying probabilistic reasoning in humans and animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.372,
    "end": 64.058,
    "text": "He is also the senior machine learning research leader versus and is a critical contributor to the active inference field, writing, among others, the paper Markov Blankets and Bayesian Territories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.858,
    "end": 67.46,
    "text": " Guys, thank you so much for joining me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.52,
    "end": 68.56,
    "text": "It's an absolute pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.341,
    "end": 70.561,
    "text": "You know, we're talking off camera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.162,
    "end": 76.585,
    "text": "There may well be some points of divergence, but we are four days away from Christmas at the time of recording.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.165,
    "end": 82.248,
    "text": "And I think the baby Jesus would want us to find some conciliation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.568,
    "end": 91.253,
    "text": "We will do the most we can to strike at differences and elucidate differences, but all in the spirit of hopefully collaborative science and collaborative thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.194,
    "end": 93.735,
    "text": "So with that in mind,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.758,
    "end": 98.939,
    "text": " I think where we could start is actually where we have no issues with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.459,
    "end": 106.641,
    "text": "So looking at that paper, where are the kind of points of just neutral, placid, this is like a good starting point?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.242,
    "end": 121.145,
    "text": "Vicente, I don't know whether you want to start, given that you wrote the paper, but where do you see where Jeff's work or the other key contributors to Active Influence, where do you see that some of the stuff they say is actually pretty uncontroversial?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.561,
    "end": 125.042,
    "text": " Good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.202,
    "end": 131.265,
    "text": "First of all, thank you for having me here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 131.825,
    "end": 141.711,
    "text": "I think I could start with a very brief detour on why I wrote this paper, or why we wrote this paper, or even...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.45,
    "end": 144.771,
    "text": " why the paper is the way it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.512,
    "end": 155.838,
    "text": "First of all, I wrote, I started writing it to actually to make sense of the FEP and active inference for myself, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 156.358,
    "end": 165.063,
    "text": "To try to see how it was derived, the steps, and actually section two of the paper remains there just as that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.203,
    "end": 170.206,
    "text": "As starting with a random dynamical system and just trying to go step by step there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 171.747,
    "end": 189.225,
    "text": " This is, I think, one of the points in which we converge is, at least from my point of view as a person who works in the philosophy of the cognitive science and the cognitive science themselves, that dynamical systems is a good way to look at cognitive systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 189.386,
    "end": 192.369,
    "text": "So that's, I think, we are in kind of the same camp.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.706,
    "end": 211.81,
    "text": " maybe the modeling strategy that people like me get that comes from radical and body cognitive science and ecological psychology to model dynamical systems and the Bayesian twist of it that you find in active inference are slightly different, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.25,
    "end": 220.431,
    "text": "But you know, this first step, this first point, I think is a point of convergence too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.312,
    "end": 222.652,
    "text": "But then,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 224.051,
    "end": 240.976,
    "text": " After we made sense, we think, of the free energy principle and active inference, our point was, okay, let's accept all this formalism is good, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.236,
    "end": 242.176,
    "text": "We don't challenge it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 242.216,
    "end": 244.237,
    "text": "We just accept, like, this is right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.953,
    "end": 265.877,
    "text": " But even accepting that we have some questions about it, that those questions have to do more on how different bits of the formalism relate to different aspects of cognitive systems and their relationship with the environment, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.117,
    "end": 270.777,
    "text": "And I think this is where the divergence is stronger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.237,
    "end": 273.498,
    "text": "So I think the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 274.926,
    "end": 277.648,
    "text": " convergence has to do with the primacy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 277.848,
    "end": 295.682,
    "text": "I don't know if the primacy is the word, but, you know, the attributing importance to a dynamical systems take on all these issues and the good spirit of trying to find formal methods to study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 296.663,
    "end": 300.046,
    "text": "And our divergence, I think, has more to do with some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.261,
    "end": 313.205,
    "text": " conceptions on how to best address dynamical systems or cognitive systems in dynamical terms and all that stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 314.265,
    "end": 314.605,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.665,
    "end": 315.766,
    "text": "Okay, that's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.786,
    "end": 316.466,
    "text": "That's a great start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.706,
    "end": 318.787,
    "text": "Jeff, let's go to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.753,
    "end": 323.075,
    "text": " Let's imagine that you're reading the Markov blanket trick for the first time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.175,
    "end": 324.556,
    "text": "We will come to the divergences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.676,
    "end": 325.877,
    "text": "I promise you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.557,
    "end": 329.539,
    "text": "I can tell a story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.659,
    "end": 343.668,
    "text": "In the spirit of this, I'll start off with the point of agreement that I had with the paper, which was there are two sort of often discussed problems with the FEP literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.211,
    "end": 351.098,
    "text": " One is that it uses idiosyncratic notation and can be very difficult to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.68,
    "end": 365.574,
    "text": "The other one is the thing that apparently causes a lot of ire, particularly from philosophers, and I agree that this is a bit of a problem, which is there's a penchant for rhetorical excess",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.9,
    "end": 388.045,
    "text": " If I could say such a thing, which is that I don't think that there's many, many problems with the FEP as a whole, but I think that it could be presented in a more compact and concise way that avoids some of the more philosophical claims that are often sprinkled throughout these manuscripts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.04,
    "end": 396.443,
    "text": " And I do think that that would create both, you know, and that this is something that would create both a bit more clarity and it's something that like, you know, people should poke back to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.523,
    "end": 402.946,
    "text": "Like when you say like, if you find yourself and this is my personal view, this is not like everyone's everyone who does this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.466,
    "end": 408.929,
    "text": "If you find yourself putting the word thing in scare quotes, you might want to think maybe you're doing something wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.089,
    "end": 409.429,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.609,
    "end": 411.67,
    "text": "It's just sort of like my knee jerk response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.951,
    "end": 422.382,
    "text": " And so, you know, that's that I think is certainly a point where there's definitely going to be some agreement, which is that, you know, for me, mathematician, simplify things, be explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.402,
    "end": 423.364,
    "text": "That's the beauty of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.004,
    "end": 426.768,
    "text": "Don't add things to the equations that aren't necessarily there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.448,
    "end": 431.009,
    "text": " Um, but of course everyone, every scientist does this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.049,
    "end": 432.33,
    "text": "We all want to sell our ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.35,
    "end": 434.831,
    "text": "We want to make, we want to make them as big as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.871,
    "end": 435.931,
    "text": "And so there is some of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 435.951,
    "end": 441.913,
    "text": "And I think that in particular, because the math is so difficult to understand and follow, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 442.234,
    "end": 446.935,
    "text": "Ha you know, has, um, that those sorts of exercises have become the focus, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.975,
    "end": 450.056,
    "text": "That's easier to sort of like say, oh, that's, you know, this is a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 450.097,
    "end": 450.717,
    "text": "This is a problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.457,
    "end": 453.838,
    "text": "Um, and so, yeah, that's, that would be the point of agreement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 454.914,
    "end": 463.236,
    "text": " If I were to quickly and compactly summarize the point of disagreement, I will do so by telling the following story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.256,
    "end": 467.697,
    "text": "So when I first came across Carl Friston, I was at the Gatsby at the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.937,
    "end": 473.318,
    "text": "And so Carl Friston was like literally in the building next door.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.958,
    "end": 478.719,
    "text": "And that's when I first came across him and I saw him present his stuff and I read a couple of his papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.419,
    "end": 480.9,
    "text": "And for me,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 482.188,
    "end": 484.949,
    "text": " there were many things that I was like concerned about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.089,
    "end": 485.87,
    "text": "Let's just leave it at that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 485.91,
    "end": 486.77,
    "text": "Let's say concerned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.23,
    "end": 488.29,
    "text": "We can get into it more later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.591,
    "end": 494.433,
    "text": "But the one thing that wasn't controversial at all, in my opinion, was the Markov blanket part of the story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.273,
    "end": 508.799,
    "text": "And that I, and I, and my hope is, is that, you know, is that as this conversation proceeds, we'll be able to like, I'll be able to explain what I mean by that and maybe come to some sort of consensus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.259,
    "end": 511.68,
    "text": "So I'm happy to do that now, but I feel like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.172,
    "end": 515.474,
    "text": " Yeah, we will unpick stuff gradually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.574,
    "end": 517.396,
    "text": "That's quite a good irony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.397,
    "end": 521.9,
    "text": "The Markov blanket was kind of the point of, ah, this one, this bit works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.56,
    "end": 531.148,
    "text": "Yeah, I mean, I take your point that the maths ought to be elegant, parsimonious as much as possible, but unfortunately or fortunately...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.028,
    "end": 537.81,
    "text": " any grand unifying theory comes with it, the philosophy, the cognitive science, the neuroscience, the theoretical biology, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.57,
    "end": 543.451,
    "text": "And so I think it's an inevitable consequence that we get wrapped into epistemological and ontological questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.831,
    "end": 549.653,
    "text": "But we will do our hardest to unpick them with simplicity, because I think that's actually all that we're aiming for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.373,
    "end": 556.215,
    "text": "So I read the paper, obviously, I read it multiple times, and I read the commentaries and your response to the commentaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.935,
    "end": 557.835,
    "text": "And for me, there were",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.78,
    "end": 565.043,
    "text": " about two or three distinct critiques of the free energy principle and active inference that I think we could have a good conversation about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.984,
    "end": 572.067,
    "text": "The first is that Markov blankets fail to capture all possible types of conditional independencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.587,
    "end": 586.874,
    "text": "So for example, candles, candle relationship to the external environment or groups of people, cultures, societies, their relationship to whatever those external dynamics are that they're shielded from by the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.611,
    "end": 598.816,
    "text": " And then linked to that, and then I'll leave it there, is that these things to use Jeff's quote marks have properties, certain things have properties that cannot be captured by the Markov blanket formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.656,
    "end": 605.119,
    "text": "And Vicente, you mentioned relational properties and constitutive self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.879,
    "end": 608.08,
    "text": "So I don't know whether you want to take those as two separate things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.3,
    "end": 614.263,
    "text": "One being the incapacity of the Markov blanket to capture all types of conditional independencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.944,
    "end": 618.986,
    "text": " Um, and then those two strands, the constituent of self-organization and the relational properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.066,
    "end": 622.869,
    "text": "I don't know whether you want to take them separately or whether you think they fall under the same blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.909,
    "end": 623.669,
    "text": "If you pardon the pun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.709,
    "end": 623.869,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.889,
    "end": 624.509,
    "text": "We'll do it separately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.81,
    "end": 641.399,
    "text": "Jeff has just pointed me with the incapacity, as I said, for the market blanket to capture all conditional independencies and let's use for sake of simplicity, this, uh, Object by selected before the candle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.806,
    "end": 644.854,
    "text": " What does the candle tell us about the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.395,
    "end": 645.996,
    "text": "Vicente, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.486,
    "end": 654.37,
    "text": " Actually, we use candle flames because it is an example that was in the literature, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.131,
    "end": 665.257,
    "text": "It seems, if I remember well, I haven't reread the paper, so I might be not fully accurate about what we claim there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 665.857,
    "end": 675.403,
    "text": "But if I remember well, the issue with the Markov blanket is that what we can take as blanket states are changing too fast in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 677.624,
    "end": 688.229,
    "text": " So there's no way to find them and to measure them over time in the way that is required by the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.69,
    "end": 690.25,
    "text": " formalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.851,
    "end": 699.555,
    "text": "And if I remember well, Thomas Parr talks about it in his commentary to the Marco Blanco treat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.136,
    "end": 708.62,
    "text": "It's actually the only commentary that concedes that we might be right in something, which is an interesting thing, but it's okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 709.181,
    "end": 712.162,
    "text": "And he claims that it could be solved if",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 714.364,
    "end": 731.36,
    "text": " in this kind of systems or in this kind of things, quotes, we look to, instead of looking to states themselves, we can look to densities of states, you know, we can try to model those states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 731.701,
    "end": 736.725,
    "text": "And I think this is an interesting move",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.691,
    "end": 755.777,
    "text": " that points out why we think that there is more about the Markov blanket than just to say, oh, no, it's just the simple answer to how to differentiate these internal and the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.817,
    "end": 763.279,
    "text": "The free energy principle and active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 764.212,
    "end": 771.137,
    "text": " doesn't really tell you whether you have to choose states or densities of states as the blanket, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 771.778,
    "end": 778.042,
    "text": "So you are putting extra assumptions there on how you choose to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.683,
    "end": 783.826,
    "text": "And this is kind of the overall thread of the critique.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.007,
    "end": 789.891,
    "text": "When we claim the free energy principle is not the principle it claims to be,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 790.555,
    "end": 799.439,
    "text": " We are not claiming that it cannot be used as the principle of least action to write down some equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.459,
    "end": 812.504,
    "text": "But it seems like just from this principle and from answering two simple questions, what is to be a thing and how to differentiate it from the environment, you have everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.264,
    "end": 818.046,
    "text": "And we try to posit examples in which you always need an extra step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 818.086,
    "end": 819.367,
    "text": "You always need extra...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 820.387,
    "end": 826.73,
    "text": " assumptions that are not always clear when you only appeal to the formalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.49,
    "end": 840.637,
    "text": "So this is the role of why we think that the fact that candle flames, as an example that was in the literature, why candle flames are important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 840.657,
    "end": 848.721,
    "text": "I think they point out that you always need extra assumptions that are not always clear when you only appeal to the formalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.481,
    "end": 849.681,
    "text": "Correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.194,
    "end": 851.315,
    "text": " Um, perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.355,
    "end": 855.097,
    "text": "That's a really nice exposition of, of the claim that you're making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.397,
    "end": 857.018,
    "text": "Uh, Jeff, I'll jump to you then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.398,
    "end": 860.639,
    "text": "Um, it would be, you know, uh, we're taught to that would be wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.679,
    "end": 875.907,
    "text": "And I think actually with specific mention, if possible of this dichotomy that Vicente mentioned, which is, are we talking about states, some kind of ontological thing again, or are we talking about probability densities and where does that line become?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.786,
    "end": 878.467,
    "text": " blurry, what actually is that difference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.568,
    "end": 882.03,
    "text": "Or is it just, are we just making a kind of false identity claim?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.051,
    "end": 884.413,
    "text": "What was the sort of what's really going on here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.454,
    "end": 897.524,
    "text": "Um, so I think that the best way, the best way to respond would be the short, the short, pithy and dismissive answer is to say, I solved the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.564,
    "end": 898.545,
    "text": "I solved the flame problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.565,
    "end": 899.726,
    "text": "I wish I could share my screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.766,
    "end": 902.488,
    "text": "I have some really cool, like I realized some really cool graphics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.796,
    "end": 916.169,
    "text": " So one of the other problems that when conveying the free energy principle that its proponents have faced is the fact, and I sort of said this, the math is really hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.789,
    "end": 925.218,
    "text": "And in order to make it tractable, a lot of additional assumptions get put in along the way just to make the math easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.434,
    "end": 926.674,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.134,
    "end": 936.578,
    "text": "And some of those assumptions are necessary to make, you know, many of those assumptions are not actually part of the free energy principle by itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.298,
    "end": 937.458,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.538,
    "end": 939.919,
    "text": "Or part of the Markov blanket story on its own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.499,
    "end": 940.679,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.719,
    "end": 942.64,
    "text": "But are done to make the math easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.7,
    "end": 948.022,
    "text": "Like when I first came across the FEP, I thought there was no difference between active inference and KL control theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.298,
    "end": 949.518,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.839,
    "end": 959.329,
    "text": "And the reason why was because when they go to actually solve the equations, they make some additional assumptions to make the math easier so that it ends up being equivalent to KL control theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.75,
    "end": 967.859,
    "text": "But if you go in and sort of say, well, what actually is the principle itself as derived either as Carl does it from, uh, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.057,
    "end": 974.762,
    "text": " statistical physics or the way I prefer to do it, which is directly from information theory, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.922,
    "end": 976.264,
    "text": "That's not the case, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.284,
    "end": 980.949,
    "text": "The actual like objective function of active inference involves solving these like complicated path integrals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.607,
    "end": 987.831,
    "text": " and things like that, but to make the problem easier, to make the math easier, to make it more solvable, additional like factorial assumptions are built in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.231,
    "end": 995.715,
    "text": "And a lot of people jump on the fact that like, oh, it's like you have all these additional assumptions that kind of like, but those are done often for like computational reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.755,
    "end": 997.656,
    "text": "They're not necessarily part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.957,
    "end": 1003.56,
    "text": "We like to joke that, you know, you know, everybody talks about the generality of the path integral formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.857,
    "end": 1008.921,
    "text": " and Jane's Maxent and how it's mappable on statistical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.141,
    "end": 1015.507,
    "text": "What people often forget is the problem with the path integral formulation is you actually have to solve path integrals, which is a serious pain in the butt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.188,
    "end": 1018.63,
    "text": "And so this is sort of like my summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.731,
    "end": 1028.48,
    "text": "One of the things that has contributed to a lot of confusion has been these additional mathematical simplifications that are then taken to be part of the theory when they are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.817,
    "end": 1036.442,
    "text": " In regards to the flame story, because I know I gave like a pithy and dismissive answer and I'd like I don't you know, that was just.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.984,
    "end": 1040.325,
    "text": "I will fix that now in the interest of politeness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.447,
    "end": 1049.953,
    "text": "The reason that I didn't think that the Markov blanket story was like at all controversial was because of its link to systems identification theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.074,
    "end": 1052.475,
    "text": "The Markov blanket itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.8,
    "end": 1060.494,
    "text": " basically just specifies the domain in which systems identification theory can apply, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.955,
    "end": 1065.144,
    "text": "So the idea is, so how does it, so when you, I don't have, you know, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.876,
    "end": 1069.978,
    "text": " System, environment, inputs, outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.478,
    "end": 1074.68,
    "text": "If you're doing systems identification theory, you're basically saying, well, what is the system doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1074.76,
    "end": 1075.92,
    "text": "What is its input-output?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.96,
    "end": 1077.341,
    "text": "This is very colloquial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.361,
    "end": 1078.161,
    "text": "We can make this more specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.201,
    "end": 1079.822,
    "text": "What is its input-output relationship?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1080.262,
    "end": 1084.904,
    "text": "In order to do systems identification theory, you need to know what that input-output relationship is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.924,
    "end": 1087.125,
    "text": "That's the goal, to figure out what that input-output relationship is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.365,
    "end": 1091.147,
    "text": "And if you see a particular input-output relationship, that gives you the label for that kind of system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.967,
    "end": 1095.569,
    "text": "It's a system of type X because it has this input-output relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.775,
    "end": 1105.039,
    "text": " The Markov blanket is basically just specifies the domain in which you are going to do a statistical version of systems identification theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.299,
    "end": 1105.499,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.539,
    "end": 1107.28,
    "text": "It's the domain of the inputs and outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.62,
    "end": 1113.883,
    "text": "So when somebody says, I have a big system and there's lots of stuff in it and I'm going to segregate out a little system from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.983,
    "end": 1121.786,
    "text": "The mere fact that you can do that when you say like this is a subsystem, you have already said that there's a Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.78,
    "end": 1124.48,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.5,
    "end": 1124.66,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.821,
    "end": 1127.762,
    "text": "All subsystems have blankets, like by definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1129.143,
    "end": 1130.523,
    "text": "It's sort of implicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.563,
    "end": 1133.485,
    "text": "And that's why I never thought that it was controversial, because what do we do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.505,
    "end": 1134.766,
    "text": "We would say, well, that's a subsystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.786,
    "end": 1135.586,
    "text": "That's an important thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.646,
    "end": 1136.487,
    "text": "It gets its own label.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.327,
    "end": 1138.648,
    "text": "And so it has a blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.828,
    "end": 1144.531,
    "text": "It's like it's it's it's just it's the way we do systems identification theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.851,
    "end": 1144.971,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.582,
    "end": 1151.308,
    "text": " I want to see if Vincente has a response before I move on to the flame in particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.209,
    "end": 1161.901,
    "text": "That's kind of... That's what I read when I was reading the literature more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1162.362,
    "end": 1162.782,
    "text": "It's kind of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1164.87,
    "end": 1171.332,
    "text": " It's non-controversial for the people who work on it in that sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.392,
    "end": 1180.094,
    "text": "You identify a system, therefore there's a blanket and there's an external state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.254,
    "end": 1189.556,
    "text": "I think part of the Markov blanket trick is to see different issues we find with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.856,
    "end": 1193.437,
    "text": "For many systems we are interested in, we don't see it to be so straight forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.102,
    "end": 1217.257,
    "text": " Like when we model with dynamical systems, for instance, with the HKB model, the behavior of two-couple oscillator, where the collective variable is relative phase, our system is the couple oscillators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.058,
    "end": 1220.259,
    "text": "So you can put a blanket around it, I guess.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1221.4,
    "end": 1223.502,
    "text": "But then what's the environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1226.294,
    "end": 1237.823,
    "text": " it's the blanket put on the face space of the relative face, which is not a property of any of the two things there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1238.003,
    "end": 1246.35,
    "text": "So, I mean, I kind of understand the abstract sense, but then I don't exactly see how this applies to the kind of systems that we are interested in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1247.173,
    "end": 1247.453,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.574,
    "end": 1249.716,
    "text": "So I'll just quickly respond.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.257,
    "end": 1256.424,
    "text": "So the problem with the whole Markov blanket part of the story is that there's just two goddamn mini Markov blankets, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.444,
    "end": 1258.165,
    "text": "You have this big, complicated system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.271,
    "end": 1274.921,
    "text": " And even if you're going to limit yourself, as they often do in the FEP order, to static Markov blankets, where once a particle or a constituent component or whatever has been assigned to either environment, blanket, or object, it's always there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.501,
    "end": 1282.465,
    "text": "So this is a situation where there's no such thing as matter transfer, which is why the flame case, by the way, doesn't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.106,
    "end": 1285.247,
    "text": "The flames have Markov blankets, but they're not static.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.136,
    "end": 1293.68,
    "text": " Because as the matter, as it burns and moves in and fuel comes in and exhaust goes out, the matter is constantly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1293.78,
    "end": 1297.382,
    "text": "So if your definition of a blanket is that it's tied to matter, then yeah, you're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1297.862,
    "end": 1299.823,
    "text": "You can't do a flame at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1300.764,
    "end": 1304.566,
    "text": "But putting that issue aside, the problem with markup blankets is that they're everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.586,
    "end": 1309.208,
    "text": "You have a glass of water, every single fluid element in the glass of water.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.248,
    "end": 1310.249,
    "text": "So what's a fluid element, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1310.269,
    "end": 1311.87,
    "text": "You take a glass of water, you draw a little circle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.09,
    "end": 1313.791,
    "text": "I mean, obviously it's not, it's 3D, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.211,
    "end": 1314.311,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.73,
    "end": 1319.052,
    "text": " An arbitrary fluid volume has a blanket, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1319.232,
    "end": 1329.016,
    "text": "And we know this, like when we do finite element methods for simulating them, we take our glass of water and we make it into lots of little cubes and all the cubes are connected and the boundaries between the cubes form the blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.656,
    "end": 1331.117,
    "text": "There's too many blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.937,
    "end": 1334.678,
    "text": "Blankets are absolutely everywhere, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.758,
    "end": 1339.82,
    "text": "And their boundaries are often completely, like where you're going to put your blanket is the hardest problem to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.301,
    "end": 1353.35,
    "text": " And I think that the free energy literature has not worried too much about the problem of where you're drawing the blanket because the idea was if you've got a blanket, then subsystems have blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.63,
    "end": 1354.971,
    "text": "We're interested in subsystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.552,
    "end": 1357.613,
    "text": "And so now we can just put that problem aside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.034,
    "end": 1364.198,
    "text": "But it's a really difficult problem to say, well, what is the principle that tells me that this gets a blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.539,
    "end": 1367.861,
    "text": "Why is a blanket that's around a bubble",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.594,
    "end": 1376.959,
    "text": " rising through my glass of water, the right blanket, as opposed to an arbitrary blanket around a fluid element that has no bubbles, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.64,
    "end": 1393.55,
    "text": "And I don't think that that question has not been adequately addressed in my opinion, but I believe that there is a notion that is sort of implicit in the FEP approach that handles that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.711,
    "end": 1397.033,
    "text": "And so when I sat down and tried to solve the flame problem,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.28,
    "end": 1400.362,
    "text": " I asked myself, well, what additional principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1400.382,
    "end": 1402.063,
    "text": "And this might make Vincente happy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.083,
    "end": 1403.465,
    "text": "There is an additional principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.865,
    "end": 1405.006,
    "text": "He was absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.586,
    "end": 1407.088,
    "text": "I think the principle was implicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.868,
    "end": 1410.21,
    "text": "But the additional principle is like, how do you choose your blankets?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.23,
    "end": 1412.753,
    "text": "Well, you choose them for parsimony and simplicity, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1413.133,
    "end": 1415.095,
    "text": "In other words, we use the scientific method.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.695,
    "end": 1415.935,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.877,
    "end": 1420.341,
    "text": "You take all the ways that you have this complicated interacting system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.361,
    "end": 1423.404,
    "text": "You take all the ways that you can draw the boundaries in them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.484,
    "end": 1425.587,
    "text": "And there's like an account, you know, not accountable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.647,
    "end": 1429.351,
    "text": "There's a really large number of different ways that you could draw your blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.852,
    "end": 1435.539,
    "text": "And the way you pick the one that's important is the one that results in the greatest simplification of the resulting dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.024,
    "end": 1440.767,
    "text": " This is basically like, you can think of this as mean fielding or coarse graining if you're a physicist, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.787,
    "end": 1448.651,
    "text": "That's what coarse graining is, is that you segregate your system into macroscopic variables or macroscopic components if it's a mechanical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.011,
    "end": 1454.174,
    "text": "And the choice that you make as to how you're going to do that is to basically make the system as simple as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.774,
    "end": 1462.838,
    "text": " If you take that approach and apply it to the flame situation in particular, that's exactly what you discover.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.858,
    "end": 1471.162,
    "text": "You discover that the blanket of a flame is just outside the reaction zone where all of the exothermic reactions are going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.882,
    "end": 1472.863,
    "text": "Okay, excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.083,
    "end": 1474.624,
    "text": "No, I think we're agreeing too much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.325,
    "end": 1478.246,
    "text": "I think that's going very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.266,
    "end": 1478.926,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.123,
    "end": 1481.924,
    "text": " I love the flame problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.304,
    "end": 1482.764,
    "text": "I like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.964,
    "end": 1484.165,
    "text": "Yeah, gorgeous.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1484.885,
    "end": 1491.569,
    "text": "I really wish I could share my screen because I queued up some videos and had some figures that I was like, just in case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.189,
    "end": 1493.75,
    "text": "The flame case really is cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.77,
    "end": 1495.13,
    "text": "I'm going to publish that soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.19,
    "end": 1498.532,
    "text": "I'm just working on... I'm trying to get a whole... I'm working on a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.966,
    "end": 1505.469,
    "text": " I took some data from, do you guys know what particle linear is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.509,
    "end": 1507.29,
    "text": "Everyone knows what Conway's Game of Life is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.351,
    "end": 1510.073,
    "text": "So this is Conway's Game of Life, but for interacting particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.044,
    "end": 1512.985,
    "text": " And so they get these particles to do cool things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.045,
    "end": 1519.146,
    "text": "And so you can put in a random bunch of particles and they form a cell membrane and the cell membrane grows stuff like flagella.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.747,
    "end": 1522.327,
    "text": "And so we applied it to that situation as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.487,
    "end": 1525.568,
    "text": "And what you find is that the blankets are changing over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.608,
    "end": 1530.63,
    "text": "And as they change, the identity of the object also changes, which is exactly what you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.09,
    "end": 1531.23,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.35,
    "end": 1534.871,
    "text": "And the reason for this is because the blanket itself, the blanket alone is meaningless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.571,
    "end": 1541.374,
    "text": " It just specifies the domain in which you're going to do your system identification or dimensionality reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.074,
    "end": 1547.496,
    "text": "What really defines an object's type is the statistics of the domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.596,
    "end": 1550.358,
    "text": "And so as a result, you can watch these cells evolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.418,
    "end": 1560.882,
    "text": "And as the statistics of the various boundaries in the system, because there's more than one, change, so does the identity of the associated object, which is really what I want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1560.902,
    "end": 1562.723,
    "text": "This is really all about labeling stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.119,
    "end": 1567.1,
    "text": " And in order to label stuff by type, you need a blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.26,
    "end": 1570.461,
    "text": "And the way that you identify a type is by the statistics of the blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.082,
    "end": 1572.022,
    "text": "Okay, this is really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.902,
    "end": 1584.266,
    "text": "Because yeah, I think we found agreement with the idea that the FEP needs to integrate some historicity, some dynamics, and perhaps even changing identities, as you've just outlined there, Jeff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.98,
    "end": 1590.703,
    "text": " I think the critical thing is recognizing, and this is implicit in everything that Carl writes, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.084,
    "end": 1593.565,
    "text": "It just needs to be made more explicit, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.585,
    "end": 1595.486,
    "text": "He says the blanket defines the phenotype.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.026,
    "end": 1597.967,
    "text": "That is a misleading statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.068,
    "end": 1600.009,
    "text": "It's true, but it's misleading, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.369,
    "end": 1606.512,
    "text": "The correct statement is the statistics of the blanket define the phenotype, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.833,
    "end": 1608.514,
    "text": "It's not just the blanket itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.754,
    "end": 1611.315,
    "text": "The blanket itself is just a domain, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.355,
    "end": 1612.796,
    "text": "It's just where, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.216,
    "end": 1613.977,
    "text": "Well, I think this is a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.114,
    "end": 1619.677,
    "text": " this problem I think has started to be remedied within the active inference literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.977,
    "end": 1633.026,
    "text": "Um, because I don't know if you guys have noticed this as well, but there's been a move to turn the internal generative model to a generative model that actually both encompasses across the Markov blanket, the external or the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.506,
    "end": 1640.871,
    "text": "So this is something that Maxwell Ramstein makes very clear in his, um, in this year's paper, um, physics of belief to put it roughly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.532,
    "end": 1641.632,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.142,
    "end": 1647.606,
    "text": " But I think there is still a slight point of difference here, and I wonder whether it's just a semantic one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.767,
    "end": 1658.154,
    "text": "Jeff, you still talk about internal states or the particle, the thing, the system, and the environment, whereas Vicente is talking about coupled oscillators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.035,
    "end": 1668.062,
    "text": "And the way that I think about this is we can either have an intrinsic or an extrinsic relation between, let's say, external dynamics and internal dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.122,
    "end": 1668.723,
    "text": "Now, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.083,
    "end": 1670.284,
    "text": "Well, an external relation...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.865,
    "end": 1673.026,
    "text": " would be something like a causal relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.786,
    "end": 1678.568,
    "text": "So the A and B retain their identity despite the fact that they're causally related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.208,
    "end": 1681.709,
    "text": "An intrinsic relation is something more like a familial relation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.41,
    "end": 1688.151,
    "text": "My mother is defined as my mother because of the relationship that she has with me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.011,
    "end": 1694.793,
    "text": "So in many ways, I find that this distinction that you guys are carving here might be neatly mapped onto that distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.333,
    "end": 1696.374,
    "text": "Vicente, I'm going to start with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.247,
    "end": 1704.309,
    "text": " Do you think that a mistake that the FEP makes might be to try and carve out an external relation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.389,
    "end": 1725.554,
    "text": "So we've got A enacting, changing B, which changes A, when really the focus should be on the dynamics of the entire system as a whole, in the way that sort of Evan Thompson and those who followed spoke about these kind of coupled dynamic systems where the identity is in the mutual coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.568,
    "end": 1728.189,
    "text": " Good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1728.47,
    "end": 1732.96,
    "text": "I mean, I would like to just point out, I think Jeff has pointed out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.56,
    "end": 1738.541,
    "text": " what our issue is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.361,
    "end": 1748.648,
    "text": "And I agree with pretty much everything he has said in that regard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.108,
    "end": 1757.494,
    "text": "Our issue basically was that we have nothing against Markov blankets as a methodological tool, as a mathematical tool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.414,
    "end": 1762.295,
    "text": " But we would like to know more about how you select the blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1762.775,
    "end": 1771.877,
    "text": "Because we think that depending on how you select the blanket you are interested in, you might be doing two different things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.618,
    "end": 1785.821,
    "text": "And that it's other fundamental parts of your theory what makes you to select a blanket, let's say, for the organism,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1788.001,
    "end": 1793.529,
    "text": " And then the organism has internal states and the environment is the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1794.171,
    "end": 1799.299,
    "text": "Or if you are an ecological psychologist like me, you want a blanket for the organism environment system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.345,
    "end": 1806.653,
    "text": " And then everything is internal states and it's not clear what the external state would be there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1806.953,
    "end": 1811.479,
    "text": "You can also choose a blanket on the organism environment system and a nested one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1811.559,
    "end": 1812.74,
    "text": "And another blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.762,
    "end": 1815.484,
    "text": "It's blankets all the way down, man.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.904,
    "end": 1816.906,
    "text": "All the way to protons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.166,
    "end": 1817.987,
    "text": "They got blankets too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.088,
    "end": 1823.913,
    "text": " So as a mathematical tool, so to speak, there are too many blankets, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1824.894,
    "end": 1831.881,
    "text": "But how you choose them reflects what kind of fundamental theory you have in mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.923,
    "end": 1837.587,
    "text": "And when I say fundamental theory, I think about psychology, cognitive science, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1837.667,
    "end": 1837.808,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1841.169,
    "end": 1861.178,
    "text": " If you, for instance, think that the organism has this input-output mapping and all the relevant computations happen inside, so all the control of behavior, all the perceptual inference is depending on the internal states, you are likely a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1865.643,
    "end": 1868.105,
    "text": " cognitive scientists of the mainstream, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1868.805,
    "end": 1877.611,
    "text": "And you want the blanket in the organism and the external states are basically input, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1878.972,
    "end": 1889.98,
    "text": "While if you are an ecological psychologist and you think that to understand the perception, for instance, the first step is to see these structures in the environment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.158,
    "end": 1901.526,
    "text": " those structures are relevant in themselves and contribute to perception as much as the internal states of the organism there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1901.966,
    "end": 1906.71,
    "text": "So then you probably don't take those structures to be just input, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1907.13,
    "end": 1919.92,
    "text": "So my point being here that I totally agree that there are too many blankets and that this selection process depends on deeper theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1921.041,
    "end": 1924.023,
    "text": " that go maybe beyond the free energy principle as such.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1924.283,
    "end": 1931.828,
    "text": "And then you can use the free energy principle as a method to develop those theories, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1932.329,
    "end": 1938.753,
    "text": "Yeah, so this is the... I mean, my take on this is I completely agree, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.614,
    "end": 1942.215,
    "text": "There is a sort of hidden additional principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.516,
    "end": 1947.019,
    "text": "But I think that one of the reasons this got neglected in the free energy literature is because the whole point was...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1948.666,
    "end": 1949.966,
    "text": " we're always drawing blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.026,
    "end": 1951.027,
    "text": "You can draw it anywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.207,
    "end": 1954.088,
    "text": "And this theory still applies, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1954.108,
    "end": 1956.869,
    "text": "It doesn't matter where you put your blanket, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.029,
    "end": 1961.871,
    "text": "I can still, I can still treat the system as if it is doing inference over its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.011,
    "end": 1974.695,
    "text": "It doesn't, you know, exactly, you know, that, that, that was sort of like the, I think the reason why the, the, the sort of additional, like how do you select your blanket problem was neglected was because they were trying to show the principle always works, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.596,
    "end": 1985.501,
    "text": " That's sort of my defense of Carl Friston's world is that there's a reason they skipped the problem because it wasn't the important problem, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.521,
    "end": 1992.284,
    "text": "The important problem was it doesn't matter how you draw your blankets, you still can apply the rest of the principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.645,
    "end": 1995.446,
    "text": "So if you decide that your system is a cell, that's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.486,
    "end": 1999.408,
    "text": "If it's a collection of cells, that still works and so on, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.092,
    "end": 2006.673,
    "text": " So our question was then, I think this question was in the Marco Blanket Trick too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2007.193,
    "end": 2010.534,
    "text": "What if your blanket is the organism environment system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.734,
    "end": 2016.215,
    "text": "What are the external states to that system that the system infers?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2016.555,
    "end": 2023.637,
    "text": "So if your blanket is like the whole universe, I'm going to go with it's Christmas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.657,
    "end": 2024.777,
    "text": "I'm going to go with baby Jesus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.753,
    "end": 2031.396,
    "text": " Okay, very good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.136,
    "end": 2037.94,
    "text": "I think that that's counter to the reason why we want to define blankets in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.521,
    "end": 2040.442,
    "text": "And the reason is because we want to label things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.133,
    "end": 2042.333,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.554,
    "end": 2048.38,
    "text": "And the reason we want to label things is, you know, is because, well, it it simplifies our lives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.48,
    "end": 2048.62,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.64,
    "end": 2051.043,
    "text": "If I can look and say that's a cat, that's another kind of cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.384,
    "end": 2051.584,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.644,
    "end": 2058.151,
    "text": "Then, you know, I can sort of use, you know, use those labels because they make my my life easier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.211,
    "end": 2058.331,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.351,
    "end": 2060.634,
    "text": "They make prediction easier about what's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.165,
    "end": 2062.365,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.405,
    "end": 2064.505,
    "text": "That's the reason why we want to have labels in the market.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.545,
    "end": 2066.746,
    "text": "I'm going to just sort of say, well, you know, this is a potential place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.086,
    "end": 2078.188,
    "text": "So that, and the reason I made this article, I do think that implicit in the whole approach, while not necessarily as explicitly made in the literature as it should have been, is that the goal is to label things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.248,
    "end": 2079.949,
    "text": "The goal is to come up with phenotypes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.549,
    "end": 2085.85,
    "text": "And since the goal is to come up with phenotypes, you can ask the question, well, why would we want to do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.15,
    "end": 2087.99,
    "text": "And the answer is parsimon, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.03,
    "end": 2091.231,
    "text": "We want a simple, compact representation of our world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.148,
    "end": 2100.251,
    "text": " And the way we do it is by taking big complicated things made of lots of little parts and giving them a single label that describes a lot of their general properties and features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.551,
    "end": 2104.612,
    "text": "And that is exactly what the Markov blanket does or is capable of doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.273,
    "end": 2109.014,
    "text": "And so that also tells you, which is why like in my world, right, that's the additional prints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.034,
    "end": 2109.694,
    "text": "It was implicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.274,
    "end": 2116.977,
    "text": "I want to make it explicit that the way that we choose which blankets to focus on is like the way we do science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.057,
    "end": 2120.398,
    "text": "It's based on simplifying dynamics for the purposes of prediction and data compression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.86,
    "end": 2125.661,
    "text": " Geoff, I may jump in here and perhaps speak on Vincente's behalf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.721,
    "end": 2129.002,
    "text": "I'm very happy for him to jump over me and clarify this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.062,
    "end": 2139.324,
    "text": "But I think a question comes up here, which is, so we're interested in labelling, we're interested in describing coupled systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.865,
    "end": 2150.807,
    "text": "So how come when in the FEP literature we draw blankets, they so coincidentally happen to fall elegantly on what we intuitively believe to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.696,
    "end": 2153.537,
    "text": " things and their blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.577,
    "end": 2162.739,
    "text": "So for example, yes, you say, okay, it's because, well, we see cats and glasses and humans and planets and like, why wouldn't we carve blankets around them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.039,
    "end": 2173.643,
    "text": "But why in a sense, does it work to carve blankets around them if we're dealing more in information exchange than how the object appears to our sensorium?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.443,
    "end": 2181.225,
    "text": "And given that as a mathematician or a physicist, what does that say about the mapping between kind of our perception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.815,
    "end": 2185.277,
    "text": " and the information transfer that we're being able to describe via the Markov Blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.24,
    "end": 2192.001,
    "text": "I think very hard about that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.043,
    "end": 2205.269,
    "text": "Because my knee-jerk response is to launch into my, like, what is science for discussion, which is probably not going to directly address what it is that you want me to address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.1,
    "end": 2226.106,
    "text": " When the issue is still, if the issue is still like, let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2226.766,
    "end": 2229.168,
    "text": "So there are two things going on here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.348,
    "end": 2232.13,
    "text": "One is what do we do with the information that the universe gives us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.17,
    "end": 2235.613,
    "text": "How do we categorize it, label it, and make it simple and easy to understand?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2235.953,
    "end": 2239.335,
    "text": "And then the other issue is, well, what is any subsystem necessarily doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.608,
    "end": 2242.788,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.828,
    "end": 2244.509,
    "text": "And those are very different issues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.409,
    "end": 2245.629,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.189,
    "end": 2250.31,
    "text": "When we talk about the when we ask the question, though, why do we call this a subsystem?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.45,
    "end": 2256.132,
    "text": "And then, you know, and then like I'm trying to cut it in half and like this not and this not a subsystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.952,
    "end": 2258.253,
    "text": "And that choice is arbitrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2258.773,
    "end": 2259.013,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.133,
    "end": 2264.194,
    "text": "That's one of the lessons that I'm trying to drive home here is, is that like you can draw a blanket around anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.215,
    "end": 2266.515,
    "text": "The question is, why would you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.881,
    "end": 2268.041,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.301,
    "end": 2272.383,
    "text": "Having drawn a blanket, all of the free energy mechanics, the Bayesian mechanics all apply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.783,
    "end": 2272.963,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.043,
    "end": 2274.983,
    "text": "But why would I draw a particular blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.003,
    "end": 2277.084,
    "text": "And it really is because it's useful to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2277.384,
    "end": 2277.544,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2277.824,
    "end": 2281.406,
    "text": "If we could just like have a computer that simulated absolutely everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.126,
    "end": 2282.346,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.426,
    "end": 2282.926,
    "text": "And that didn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.966,
    "end": 2285.087,
    "text": "And it was like, I don't know, it costs like five cents to run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.167,
    "end": 2286.047,
    "text": "We would totally do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.368,
    "end": 2289.688,
    "text": "And we would be happy and we wouldn't care about labels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.928,
    "end": 2290.169,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.869,
    "end": 2292.489,
    "text": "But we don't have that ability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.549,
    "end": 2292.729,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.769,
    "end": 2295.93,
    "text": "We are trying to construct these things that we can wrap our brains around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.97,
    "end": 2297.251,
    "text": "We're trying to simplify things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.395,
    "end": 2300.536,
    "text": " to make them parsable and understandable to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.557,
    "end": 2304.118,
    "text": "And so that's why we would choose a particular set of blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.538,
    "end": 2314.362,
    "text": "Now, but again, the point though is, and the reason why I think that there wasn't enough emphasis in the free energy literature is that once you have established that there's a blanket, which you can always do, the rest of it just falls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.922,
    "end": 2316.122,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.482,
    "end": 2322.426,
    "text": "All the stuff about, you know, is it effectively doing, is it behaving as if it's performing an inference on its environment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.466,
    "end": 2322.766,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.406,
    "end": 2323.586,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.907,
    "end": 2336.454,
    "text": "I think the more interesting question that Vincenti brings up in the paper, which, which, which I read yesterday that I thought was a really great question, um, was had to do with, with, well, which is the environment and which is the object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.295,
    "end": 2338.475,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.465,
    "end": 2342.707,
    "text": " Because even this parsimony principle that I just established, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.747,
    "end": 2343.608,
    "text": "Doesn't help with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.928,
    "end": 2346.249,
    "text": "Cause I just said, simplify the global dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.03,
    "end": 2354.675,
    "text": "Like what, what, you know, what, what, um, macroscopic theory does the best that happens to have this partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.415,
    "end": 2360.518,
    "text": "Um, and that doesn't tell you which is the, but this is, but this is where I think you now need to move back into physics land.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.719,
    "end": 2361.939,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.999,
    "end": 2364.721,
    "text": "So people like, I really liked the work of Jeremy England.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.704,
    "end": 2372.485,
    "text": " Um, and, uh, and everyone loves like Schrodinger's little, I, I, is it, what is life?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2372.685,
    "end": 2373.605,
    "text": "Is that the title of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2373.726,
    "end": 2373.966,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.786,
    "end": 2387.188,
    "text": "Um, where there is, you know, uh, in, in, in that work, there is like a, a definition of how you, there is a notion of how you tell which is the agent in which, or which is the object and which is the environment, which is the agent and which is the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.548,
    "end": 2389.328,
    "text": "And it basically has to do with energy flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.529,
    "end": 2390.749,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.989,
    "end": 2392.949,
    "text": "So you could sort of say, oh, well, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.649,
    "end": 2398.611,
    "text": " The organism is the thing that takes in energy and produces energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.731,
    "end": 2409.115,
    "text": "Once you've done that, if you're talking about a physical system, then now you have something that does, in fact, uniquely identify which is which, which you don't get out of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.175,
    "end": 2409.915,
    "text": "This is my point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.935,
    "end": 2414.357,
    "text": "You don't get that out of a simplicity, parsimony-type principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.838,
    "end": 2418.699,
    "text": "I'm not sure whether you want to... Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.295,
    "end": 2434.456,
    "text": " Go to that second point or whether you want to loop back to my first point about the mapping between the supposedly arbitrary epistemological tool-based approach of the Markov blanket and actually maybe how that maps onto logically at least what we perceive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.676,
    "end": 2435.978,
    "text": "I don't know which one you want to start with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.536,
    "end": 2454.947,
    "text": " Yeah, I think that the last thing, or this last intervention by Jeff, I think he states, and I think we are going to agree here, he literally states the Marco Blanca trick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2456.678,
    "end": 2469.83,
    "text": " That as soon as you put the blanket on top of a system, or whatever you choose with all this pragmatic stuff, then you can do Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2470.81,
    "end": 2479.238,
    "text": "As you put the blanket, you have now, so to speak, the data structure with latent variables, observables, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.532,
    "end": 2481.633,
    "text": " internal ones to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2482.673,
    "end": 2492.58,
    "text": "And I think we agree that, or we could agree that this is the Markov blanket trick, while Jeff thinks this is good, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.561,
    "end": 2493.881,
    "text": "It's good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.042,
    "end": 2496.803,
    "text": "We think it's so-so, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2497.063,
    "end": 2501.986,
    "text": "But that can't be the point, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2502.086,
    "end": 2505.789,
    "text": "So I think the Markov blanket trick is good,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.498,
    "end": 2519.231,
    "text": " If you are already convinced, for instance, that perception is a kind of inference, and then it gives you very precise mathematical tools to model that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.732,
    "end": 2529.001,
    "text": "Now, if you think like some crazy people like me, right, that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.462,
    "end": 2545.95,
    "text": " Perception is not something that the internal states of an organism do in order to know the external states, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.87,
    "end": 2549.552,
    "text": "But it's a property of the organism environment system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.976,
    "end": 2556.521,
    "text": " then this data structure doesn't really map very well with what we want to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.002,
    "end": 2559.003,
    "text": "Or maybe it does, but we don't see how.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.504,
    "end": 2568.572,
    "text": "And part of our paper is to try to express, to state these doubts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2569.313,
    "end": 2572.376,
    "text": "Okay, how could I apply this if I think this sort of thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2573.997,
    "end": 2574.578,
    "text": "And then...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2576.727,
    "end": 2584.734,
    "text": " Second part, which is why the blanket falls exactly where it needs to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.975,
    "end": 2587.877,
    "text": "I think this is a part of, first, this is a part of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2589.025,
    "end": 2618.039,
    "text": " conversation i've had like dozens of time with much well right he he's he's the person i've talked more about this so we've talked about this and actually in in their commentary to the marco blanket trick they talk about this uh paper he has with uh dalton the weak marco blankets right that they prove that there are a lot of them right like like as soon as you have dimensions you know and and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2619.272,
    "end": 2625.037,
    "text": " Our question in our response was, yes, I mean, but the point is not that you have a lot of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2625.077,
    "end": 2626.478,
    "text": "It's how you choose the right one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2626.518,
    "end": 2635.386,
    "text": "So how you choose for, let's say, for the visual system, how you choose the blanket in the sensory receptors, so to speak, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2635.687,
    "end": 2646.416,
    "text": "And I think Jeff has been touching upon that, right, in some of the things he has been saying today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.008,
    "end": 2669.357,
    "text": " before i move back to jeff could you just maybe for the audience expound upon what you meant by this sort of distinction um makes sense when we take for granted perception as inference i think that would be quite an interesting avenue just to unpick a little bit further just so the audience knows exactly what you mean by that yeah so uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.841,
    "end": 2687.718,
    "text": " Long story short, the common theory of perception, at least since Helmholtz, but most likely since Descartes or even beyond that, is that perception is a form of inference, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.118,
    "end": 2691.221,
    "text": "So our mind, brain is in...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.478,
    "end": 2700.144,
    "text": " the business of inferring the real environment, so to speak, from impoverished stimulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.404,
    "end": 2705.708,
    "text": "So what we get in our sensory systems is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.027,
    "end": 2723.579,
    "text": " usually ambiguous, not very informative or not completely informative and generally insufficient as to know what is the exact cost of that input, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.699,
    "end": 2734.987,
    "text": "Like the typical example is that, you know, a small closed object can give you the same input than a larger object",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2735.587,
    "end": 2749.279,
    "text": " object that is farther away right they can occupy the same angle in your in your retina blah blah so the mainstream theory is that the brain is in the business of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.993,
    "end": 2756.859,
    "text": " inferring the real properties of the environment from this input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2757.379,
    "end": 2766.868,
    "text": "And that's so because it can use prior knowledge, memory experience, you know, to build up a good model of the real environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2768.228,
    "end": 2786.851,
    "text": " Ecological psychologists think, along with many other people that come at least from William James, William James explicitly claims that this kind of approach, this inferential approach to perception, is pure mythology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2787.762,
    "end": 2792.203,
    "text": " I mean, it's kind of the way they wrote in the 19th century.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.223,
    "end": 2805.368,
    "text": "But the point being is that for ecological psychologists, the kind of prior knowledge you need in order for the inference to work is very difficult to justify.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2807.849,
    "end": 2809.049,
    "text": "So they think that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2811.328,
    "end": 2820.91,
    "text": " Perception is more of a relation of rich information that comes from the environment and the internal dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.21,
    "end": 2825.431,
    "text": "And the relation itself is what perception is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2825.791,
    "end": 2832.773,
    "text": "But we don't need an inference because we don't need to go from impoverished stimulation to the real environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.413,
    "end": 2838.114,
    "text": "But there's a way to understand perceptual information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.918,
    "end": 2862.252,
    "text": " information that gives you all you need without the need of prior knowledge in order to get grips so to speak with the real environment so it's kind of a direct and direct stuff or perception as an inference or perception as an as information detection now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2863.089,
    "end": 2876.902,
    "text": " I have to put, again, because I've talked with Maxwell a lot about this, so I just want to put that sort of asterisk here, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2877.723,
    "end": 2883.969,
    "text": "You can still see how the internal dynamics change in order to couple with this and reach",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2888.382,
    "end": 2900.296,
    "text": " information in terms of some form of Bayesian inference, because Bayesian inference is just, you know, you can describe the path of a dynamical system towards an attractor in terms of a probability density of the state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.416,
    "end": 2904.1,
    "text": "So there's a form to, maybe there's a form to use inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2904.921,
    "end": 2915.007,
    "text": " that this is the Bayesian inference way in which you can capture both of them, I'm still in an ongoing discussion with Maxwell about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.187,
    "end": 2920.13,
    "text": "Yeah, this is the as-if part of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.37,
    "end": 2927.754,
    "text": "The math tells us that everything behaves as if it is performing Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.814,
    "end": 2931.236,
    "text": "It doesn't tell us two additional things, like how shitty that inference is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.713,
    "end": 2934.574,
    "text": " It could be real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.794,
    "end": 2936.755,
    "text": "Like a rock is performing Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2936.815,
    "end": 2938.536,
    "text": "It's just not doing a very good job.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.697,
    "end": 2946.921,
    "text": "Um, and, uh, you know, but it, but that's, but that's, that, that just falls, that just falls entirely from the mathematics of right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.981,
    "end": 2950.543,
    "text": "Is, is that, is that it is an as if description, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.904,
    "end": 2960.049,
    "text": "The description of anything, you know, it is always an available description of this phenomenon that it is, that it functions as if it's performing inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.389,
    "end": 2960.569,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.31,
    "end": 2961.43,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.0,
    "end": 2971.249,
    "text": " Whether it's actually performing inference or doing like solving the right inference problem or or however you want to put that is not is not explicitly addressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.729,
    "end": 2984.682,
    "text": "And I think a really interesting question is, you know, so, for example, when you know, when one applies the free energy principle in practice, there's always this implicit assumption that whatever the thing is doing is it's actually doing inference correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.393,
    "end": 2985.633,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.653,
    "end": 2988.677,
    "text": "There's an optimal inference engine sort of like hidden inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.117,
    "end": 2990.458,
    "text": "Now they can get away with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.519,
    "end": 2990.659,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.679,
    "end": 2992.841,
    "text": "Because what goes on on the inside doesn't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.722,
    "end": 2994.002,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.683,
    "end": 2999.568,
    "text": "And what defines the object is what defines the thing is the statistics of its boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.169,
    "end": 3004.273,
    "text": "And so if you have like a really boring boundary statistics like you're a rock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3005.188,
    "end": 3005.348,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3005.368,
    "end": 3015.913,
    "text": "Then you don't need a very sophisticated like the inference engine that you would actually use to sort of say, well, what is the you know, what does this rock have to infer about the external world in order to be a rock?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.953,
    "end": 3017.134,
    "text": "And the answer is very little.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.355,
    "end": 3022.657,
    "text": "So you kind of get a lot of these things for free, but it is an as if description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.017,
    "end": 3023.277,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.577,
    "end": 3030.941,
    "text": "It's not like, you know, it's it's just, you know, like this is another way to get to the free energy principles from a purely information theoretic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3031.423,
    "end": 3032.063,
    "text": " approach, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3032.083,
    "end": 3036.124,
    "text": "And I prefer that approach because all of this stuff makes a little bit more sense, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.164,
    "end": 3038.385,
    "text": "You're not sort of saying like the rock is doing inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.405,
    "end": 3045.687,
    "text": "You're saying, you know, the rock is behaving as it becomes more clear that this is sort of an as if argument, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.807,
    "end": 3053.709,
    "text": "As opposed to it's, there's literally an internal state in the rock that is computing, you know, the probability that the, that the water in the stream is about to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.789,
    "end": 3054.289,
    "text": "No, it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.489,
    "end": 3055.649,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.809,
    "end": 3056.229,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.389,
    "end": 3057.609,
    "text": "I had to have to be a rock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.0,
    "end": 3089.172,
    "text": " yeah yeah yeah i um i was did a quite a good podcast with adam saffron uh a couple of days ago and i said my favorite two words in the free energy principle are looks like um but as as if as if as if is the one that i like to pick yeah as it looks like uh no i think that's i think that's useful clarification um unless you're a panpsychist and then they might be coming for you um what's wrong with panpsychism i don't understand why everyone's down on hey i i actually don't mind that i'm kind of into the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.699,
    "end": 3103.183,
    "text": " spookier versions, but I think well, they might they might be keen to perhaps I can't speak for Philip Goff and everyone else, but they might be keen to bring into question the validity of that as if or looks like but we need not go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3103.763,
    "end": 3107.684,
    "text": "I wanted to sort of I do want to this was one of the critiques I kind of identified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.704,
    "end": 3109.605,
    "text": "So I do want to just get some clarity on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.985,
    "end": 3113.106,
    "text": "And I'll actually quote Vicente here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.266,
    "end": 3115.527,
    "text": "So this is Vicente's response to the commentaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.094,
    "end": 3123.757,
    "text": " The extent to which something counts as a thing depends on the choice of Markov blanket partition, which can be adjusted according to the needs of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.357,
    "end": 3125.598,
    "text": "There is an ambiguity here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.178,
    "end": 3133.401,
    "text": "On the one hand, it is claimed that things are what they are by definition, even if boundaries do not really align with the intuitive ones for ordinary things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.161,
    "end": 3143.825,
    "text": "On the other hand, when the FEP presents possible examples of things, like brains or cells, the Markov blanket always falls in the right place from the intuitive point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.983,
    "end": 3147.845,
    "text": " That probably puts more elegantly the point I was trying to make earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.945,
    "end": 3152.127,
    "text": "Does that shed any clarity on where I was going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.167,
    "end": 3155.209,
    "text": "And Jeff, do you think you have a kind of riposte to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.57,
    "end": 3158.371,
    "text": "I almost hate to do what I'm about to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.531,
    "end": 3160.972,
    "text": "Can you give me the quote one more time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.992,
    "end": 3163.654,
    "text": "I'll give you the lengthy quote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.834,
    "end": 3168.817,
    "text": "I'm going to need to hear it one more time to fully absorb and appreciate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.037,
    "end": 3171.999,
    "text": "I'll do a sort of amended version, a shortened version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.321,
    "end": 3180.888,
    "text": " On the one hand, it is claimed that things are what they are by definition, even if the boundaries do not really align with the intuitive ones for ordinary things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.668,
    "end": 3191.355,
    "text": "On the other hand, when the FEP presents possible examples of things like brains or cells, the mark of blanket always falls in the right place from the intuitive point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.616,
    "end": 3194.298,
    "text": "Okay, so I do have a response to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.478,
    "end": 3201.183,
    "text": "And this goes back to the notion that what defines a thing where you get this sort of notion of phenotype is the statistics of the blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.611,
    "end": 3209.857,
    "text": " And so that gives you the ability to sort of say, oh, this is like, you know, like right now I'm concerned with brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.557,
    "end": 3212.999,
    "text": "So all I have to do is ask, what is the statistics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.039,
    "end": 3217.583,
    "text": "You know, what is the statistics of the of the brain blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.383,
    "end": 3218.543,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.583,
    "end": 3220.625,
    "text": "And then that's the thing I'm currently going to investigate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3221.604,
    "end": 3221.764,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.164,
    "end": 3229.049,
    "text": "And so, you know, but I do think that this does illustrate, you know, one of the issues which we've been talking about, which is that like there is this sort of fundament.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.309,
    "end": 3233.232,
    "text": "You know, if you were going to like de novo start just putting blankets on everything in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.053,
    "end": 3234.293,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.273,
    "end": 3239.316,
    "text": "There isn't an explicit principle present in the FEP that tells you how to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.137,
    "end": 3240.337,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.697,
    "end": 3250.744,
    "text": "There's this additional principle, which is like, you know, that that that I that that led to the, you know, the algorithm that I use to discover the blankets of flames, which is like parsimony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.819,
    "end": 3261.725,
    "text": " Now, the reason why they don't worry about that is because the implicit in every single thing in the FEP literature is the notion that we are labeling stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.866,
    "end": 3264.987,
    "text": "I have the freedom to label what I'm interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.668,
    "end": 3269.971,
    "text": "And having done that, that sort of tells me what the blanket statistics are going to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.957,
    "end": 3271.918,
    "text": " I'll just add one other thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.958,
    "end": 3284.348,
    "text": "The reason I prefer like the information theoretic derivation of the FEP is because is, is because the way that works is you start out with a probability distribution over blankets, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.368,
    "end": 3290.753,
    "text": "It's like, this is like, is, and you take, it's a, it's a, it's a, it's a Jane's max cow or max ends kind of approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.274,
    "end": 3292.295,
    "text": "And you sort of say like, Hey,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.035,
    "end": 3296.237,
    "text": " Like I have some laws that tell me how the universe works and those are some constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.397,
    "end": 3296.597,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.637,
    "end": 3302.581,
    "text": "And then I also have I want to find I want to find some subset of my system that has these statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.961,
    "end": 3304.702,
    "text": "Those statistics are then definitional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.782,
    "end": 3308.704,
    "text": "This leads to, you know, sort of Langevin equation type things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.065,
    "end": 3309.205,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.225,
    "end": 3318.85,
    "text": "That you can then solve, which tells you how the world has to be, how the individual particles in the system have to behave if you're doing it in particle space in order for that thing to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.811,
    "end": 3319.951,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.475,
    "end": 3328.138,
    "text": " And it has to exist because you imposed it as a constraint when you did your sort of max-end-y thing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.258,
    "end": 3340.263,
    "text": "If you have that in mind, what you're really asking when you sort of, when you take this sort of FEP, you know, when you sort of, if you take this sort of, can I use the phrase ontological potential?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.703,
    "end": 3342.204,
    "text": "Or is that going to make people upset?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.204,
    "end": 3343.384,
    "text": "Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3343.664,
    "end": 3350.327,
    "text": "One of the things that comes out, if you take this sort of approach, you're basically like, look, these statistics define an object type.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.096,
    "end": 3352.336,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.957,
    "end": 3358.601,
    "text": "And now what I want to know is I want to know like, well, what's inside, what's outside, like what kind of environment it can live in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.661,
    "end": 3361.684,
    "text": "Like what kind of, you know, what does it have to be made of?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.444,
    "end": 3362.604,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.644,
    "end": 3373.253,
    "text": "You can just apply that, those statistics as part of a constraint, do max nth and get all of the equations that tell you how, what kind of environment this sort of thing can live in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3373.953,
    "end": 3374.073,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.093,
    "end": 3377.356,
    "text": "But the starting point was like, I'm interested in like this kind of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.097,
    "end": 3378.337,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3378.537,
    "end": 3378.617,
    "text": "And,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.091,
    "end": 3389.777,
    "text": " The reason why we call it an ontological potential is because you sort of said, like, you've started by saying, this is my definition of something, and free energy is literally a potential function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.738,
    "end": 3393.519,
    "text": "Like when you do it in this Max Entity way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.819,
    "end": 3397.28,
    "text": "It's literally a potential function, so free energy is an ontological potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3397.741,
    "end": 3401.242,
    "text": "But it does start by saying, this is the thing I'm interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3401.323,
    "end": 3405.285,
    "text": "It starts by specifying those statistics, the statistics of a given object type.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.146,
    "end": 3407.886,
    "text": "Vicente, do you want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.502,
    "end": 3409.303,
    "text": " add anything to that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.363,
    "end": 3421.01,
    "text": "I mean, I'm wondering whether from a philosophical, if you're putting a philosophical hat on, what presuppositions, just that kind of, as Jeff said, like, we're starting from like, this is a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.73,
    "end": 3425.953,
    "text": "What philosophical presuppositions does that entail?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.894,
    "end": 3432.337,
    "text": "Yeah, I mean, I'm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3434.582,
    "end": 3436.183,
    "text": " I'm kind of happy with that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3436.523,
    "end": 3441.807,
    "text": "You choose your thing and you apply the methods you want to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3441.827,
    "end": 3461.041,
    "text": "So we really don't have anything, when I say with the authors of the paper, of course, but myself also, we really don't have any criticism to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3462.963,
    "end": 3463.223,
    "text": "Our...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3465.752,
    "end": 3473.059,
    "text": " criticism, and actually it was, that paper was published along with a few more that were talking about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3473.079,
    "end": 3475.962,
    "text": "There's this one by Jele Brunneberg et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.062,
    "end": 3481.928,
    "text": "on the Emperor's Blanket, and Miguel Aguilera and Chris Buckley had another one there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3481.948,
    "end": 3482.589,
    "text": "So,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3487.262,
    "end": 3499.672,
    "text": " so to speak, if you are upfront with, look, this is what I took to be, what I take to be a thing, or this is my thing of interest for these reasons, and then I'm going to apply the Markov blanket here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.573,
    "end": 3503.555,
    "text": "If the methods work, go, you know, like, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3505.096,
    "end": 3512.883,
    "text": "The thing is that sometimes in the literature, these extra steps or these parts are, as Jeff just has said, not explicit enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3513.786,
    "end": 3523.35,
    "text": " So it seems that everything falls from, you ask what is to be a thing, and then you have a full theory of cognitive neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.73,
    "end": 3525.49,
    "text": "And we are like, we don't think so, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3525.83,
    "end": 3531.032,
    "text": "There are other deep ideas at work there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.913,
    "end": 3535.434,
    "text": "But if we go back to that quote,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3539.355,
    "end": 3549.058,
    "text": " It's also not about the general possibilities of the free energy principle and active inference and the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3551.567,
    "end": 3555.61,
    "text": " formalism, but more about how it is presented in the literature sometimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3556.55,
    "end": 3565.236,
    "text": "So sometimes it is clear that you put the blanket, so to speak, in the face space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3565.876,
    "end": 3572.7,
    "text": "Not in the real space, but you select some states, and then you put the blanket there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3573.341,
    "end": 3576.323,
    "text": "And this is clear, for instance, in one paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3577.023,
    "end": 3584.047,
    "text": " I think it's Michael Kirchhoff, Julian Kiberstein, Carl Friston, and I don't know if I forget someone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3584.087,
    "end": 3589.229,
    "text": "But they actually modeled coupled pendulums, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3590.25,
    "end": 3599.974,
    "text": "And the blanket states there were something, I'm not completely sure, but were something like velocity and duration or position and sedation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.295,
    "end": 3602.916,
    "text": "These are not the intuitive ones, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3603.939,
    "end": 3610.2,
    "text": " This is not the surface of the pendulum, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.441,
    "end": 3622.063,
    "text": "But then when you go to any figure in the literature, you see the blanket that is in the sensory receptors or in the membrane of the cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.283,
    "end": 3629.565,
    "text": "Well, you expect the blanket will be from an intuitive point of view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3629.965,
    "end": 3633.066,
    "text": "So our point is that these two claims seem to be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3634.165,
    "end": 3636.387,
    "text": " not very well aligned, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.507,
    "end": 3653.1,
    "text": "Either you find the blanket in an abstract state of space or in a space of states or in an n-dimensional state of space and then the blanket can be velocity, acceleration, jerk, whatever you want, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3653.58,
    "end": 3662.407,
    "text": "Or you go to the more intuitive way in which, you know, the blanket of the cat is, you know, I guess the hair or something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3663.888,
    "end": 3668.851,
    "text": " Or you find a way, which I guess is the ultimate aim, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3669.691,
    "end": 3671.212,
    "text": "You find a way to align these two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3672.433,
    "end": 3674.854,
    "text": "Maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3675.114,
    "end": 3687.32,
    "text": "I think the reason that this happens, though, is because the principle is uniformly applicable to all systems and all subsystems and all subsystems of subsystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.918,
    "end": 3690.14,
    "text": " they kind of like glossed over that problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3690.16,
    "end": 3692.323,
    "text": "It's like, it doesn't matter what system you're interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3692.563,
    "end": 3693.544,
    "text": "This theory applies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.225,
    "end": 3694.425,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.725,
    "end": 3699.731,
    "text": "And I think that's one of the reasons why like the issue that Vincent brings up was basically glossed over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.952,
    "end": 3701.152,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3701.392,
    "end": 3707.419,
    "text": "It's because it, it was, it wasn't the, you know, the, the, the, the two interesting questions from my perspective is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.069,
    "end": 3719.294,
    "text": " that got glossed over are how do blankets form in the first, you know, how do the blankets that we would like to call blankets, because there are blankets everywhere, but how do interesting blankets form, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.354,
    "end": 3722.315,
    "text": "What are the mechanics that lead to that process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.815,
    "end": 3731.999,
    "text": "And then why do we say this is an interesting blanket and that is just a drop of water or just a fluid volume?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.82,
    "end": 3734.1,
    "text": "Blanking on the easy stuff now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.521,
    "end": 3735.401,
    "text": "Why is that just a fluid?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.421,
    "end": 3736.662,
    "text": "Why is that an uninteresting blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.852,
    "end": 3741.614,
    "text": " And this is where the whole like parsimony thing comes in, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.714,
    "end": 3744.756,
    "text": "Interesting blankets have interesting properties, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.417,
    "end": 3747.418,
    "text": "And they simplify the overall dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.039,
    "end": 3759.267,
    "text": "But if you start out your paper by writing that like, oh, well, I'm going to have this other principle and it's going to say this is a blanket and this is the preferred blanket, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.347,
    "end": 3767.133,
    "text": "Then you sort of, it kind of tarnishes your ability to say that your theory is uniformly applicable to all systems and subsystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.83,
    "end": 3779.499,
    "text": " And I think that that is ultimately the cause of this particular confusion, which is why when I saw this stuff, my knee-jerk response was, why are they saying a flame doesn't have a blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.76,
    "end": 3790.327,
    "text": "I should mention the title of my PhD thesis was Complex Dynamics and Solid Flame Microstructure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.796,
    "end": 3792.177,
    "text": " They're actually burning stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.818,
    "end": 3799.36,
    "text": "And the way that we model flames is explicitly with a blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3800.04,
    "end": 3803.241,
    "text": "The blanket, you know, is the flame.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.502,
    "end": 3804.982,
    "text": "It's burning this way down a fuse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3805.222,
    "end": 3806.923,
    "text": "I think Acme bomb, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3806.963,
    "end": 3807.643,
    "text": "It's going like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.683,
    "end": 3808.584,
    "text": "It's going down a fuse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.084,
    "end": 3810.265,
    "text": "And there's a blanket, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.425,
    "end": 3813.326,
    "text": "The blanket is basically just outside the reaction zone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.045,
    "end": 3814.305,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.946,
    "end": 3824.932,
    "text": "In the same way that like, you know, fluid flowing or air going by like an airplane wing forms a little boundary, which we call curiously enough, the boundary layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.952,
    "end": 3825.672,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.273,
    "end": 3828.154,
    "text": "And, you know, and that's a blanket, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3828.554,
    "end": 3832.436,
    "text": "We are constantly using blankets because they simplify dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.456,
    "end": 3834.077,
    "text": "And that was exactly how I got to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.398,
    "end": 3839.661,
    "text": "You know, that's exactly why to me that there was this implicit parsimony principle that solved that particular problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3840.689,
    "end": 3842.049,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3842.289,
    "end": 3843.25,
    "text": "But I certainly agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.33,
    "end": 3846.45,
    "text": "Like, you know, it was a rhetorical choice, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.55,
    "end": 3848.591,
    "text": "You want to show that it always applies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.151,
    "end": 3853.072,
    "text": "So, of course, I'm just going to randomly draw blankets, you know, as need be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.092,
    "end": 3855.513,
    "text": "Because it always works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.393,
    "end": 3859.594,
    "text": "I like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3859.694,
    "end": 3859.874,
    "text": "In the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.39,
    "end": 3872.265,
    "text": " I mean, in the spirit of generality, they kind of gloss over these tiny details that there are some systems that might be tricky, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3872.525,
    "end": 3874.448,
    "text": "But I think there's kind of another...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3875.896,
    "end": 3877.176,
    "text": " reason for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3877.356,
    "end": 3880.097,
    "text": "I don't think it's an opposite one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3880.317,
    "end": 3881.497,
    "text": "It's a complementary one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3881.997,
    "end": 3889.599,
    "text": "And it's a reason that I think applies mostly to psychology and neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3890.739,
    "end": 3901.802,
    "text": "Like Jeff, I'm not a super fan of what they call the high road to the freedom of the people, the random dynamic system plus that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3902.302,
    "end": 3908.524,
    "text": " I like better the one that comes from predictive processing and builds up, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3909.044,
    "end": 3915.825,
    "text": "First, because I think it is what happened historically, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3915.865,
    "end": 3922.687,
    "text": "With the 1990s paper on autoencoders to, you know, and you can see that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3922.807,
    "end": 3925.608,
    "text": "And then, because it,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3927.637,
    "end": 3955.705,
    "text": " makes explicit how the free energy principle within psychology and neuroscience grows within a theory within an overall theory in which this separation is already taken for granted right you see there are the internal states of of which are the brain that are making the inference there are some blanket states right which are receptors and there's some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.829,
    "end": 3958.13,
    "text": " environment there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3958.491,
    "end": 3975.007,
    "text": "So this kind of blanket formalism perfectly fit the overall idea that we have internal states that have to infer the external ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3975.067,
    "end": 3976.389,
    "text": "So it was not an issue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3977.406,
    "end": 3981.468,
    "text": " for kind of, say, the mainstream psychology, neuroscience, to think in that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3982.429,
    "end": 3986.811,
    "text": "It was like taking for granted, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3987.071,
    "end": 3993.314,
    "text": "But then there's this weird people called ecological psychologists that have issues with that thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3994.395,
    "end": 3999.278,
    "text": "And of course, that's the place from where our paper comes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3999.918,
    "end": 4002.199,
    "text": "We see issues in some systems in that direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4006.545,
    "end": 4010.127,
    "text": " I'm going to propose the happy middle ground here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4012.408,
    "end": 4025.954,
    "text": "The statement that all things behave as if they are performing inference is kind of hard to get around because it literally follows from whether you take statistical physics or information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.454,
    "end": 4032.899,
    "text": " It's sort of a statement about like, but what it doesn't tell you is the thing that is what it doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4033.159,
    "end": 4037.382,
    "text": "And so now you say, well, I don't think the brain is doing inference or I don't think perception is inference or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4037.783,
    "end": 4042.326,
    "text": "It turns out that's not incompatible with what the free energy principle states either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4043.027,
    "end": 4048.311,
    "text": "And the reason for this is because the free energy principle says that all things behave as if they are performing inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4048.691,
    "end": 4051.213,
    "text": "It says nothing about the quality of that inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.765,
    "end": 4054.467,
    "text": " it could be really shitty inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.527,
    "end": 4063.295,
    "text": "It has to be good enough so that the thing can maintain its boundary statistics, the statistics that define it as like that type of a thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.955,
    "end": 4070.321,
    "text": "But it could in fact be really bad compared to what a normative model of inference would be performing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.602,
    "end": 4078.489,
    "text": "And I think this step has also been, or this little bit has also sort of been missed, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.788,
    "end": 4088.531,
    "text": " In a lot of applications, especially what I do nowadays, which is AI applications, you don't want to find systems that do shitty inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4089.071,
    "end": 4093.472,
    "text": "You want to find systems that do optimal inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.293,
    "end": 4099.014,
    "text": "But in practice, that becomes the new question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.074,
    "end": 4100.955,
    "text": "They've shown that it's always doing inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.035,
    "end": 4103.395,
    "text": "I'll just accept that, but I don't care.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4103.595,
    "end": 4108.777,
    "text": "I don't care because I'm interested in the kinds of inference mistakes that it's making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.676,
    "end": 4109.876,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.196,
    "end": 4112.218,
    "text": "It's kind of like saying like when we're in the lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.738,
    "end": 4112.838,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.878,
    "end": 4116.04,
    "text": "So I've worked with a lot of behavioral scientists over the years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.08,
    "end": 4118.902,
    "text": "And when they're in the lab, they always sit the monkey down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4119.082,
    "end": 4120.103,
    "text": "OK, let's not do monkeys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.363,
    "end": 4124.305,
    "text": "There's a mouse and the mouse is doing some tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4124.365,
    "end": 4129.128,
    "text": "And we always want to ask questions like, well, how well is the mouse doing this sort of like this task?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.589,
    "end": 4133.671,
    "text": "And we can solve that problem because we designed the task and we set the mouse to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.452,
    "end": 4134.632,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.632,
    "end": 4151.157,
    "text": " And so we can sort of say, oh, well, he's getting like 95% correct, or let's say he's doing 90% correct, but the maximum he could, given the task difficulty, the best he could possibly do is like 98% or 96% correct like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4151.178,
    "end": 4154.439,
    "text": "So that's comparing the animal's behavior to optimal behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4155.339,
    "end": 4156.519,
    "text": "And we do that a lot in the lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.9,
    "end": 4159.26,
    "text": "But when it comes to really complicated things, we lose that ability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4161.741,
    "end": 4164.102,
    "text": " And this is where cognitive psychology comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4164.782,
    "end": 4172.405,
    "text": "Cognitive psychology is like, okay, there's no way in hell a human is going to solve this really complicated social dynamics problem optimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.685,
    "end": 4177.286,
    "text": "In fact, we don't even know how to write down the solution to this really complicated social dynamics problem properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.906,
    "end": 4187.63,
    "text": "Now, you might be able to say from this free energy perspective that the person is behaving as if they are solving it probabilistically or as if they are doing inference, but it's not optimal inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.83,
    "end": 4191.171,
    "text": "And so now what becomes the interesting area of investigation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.667,
    "end": 4194.429,
    "text": " The engineering investigation is what are the mistakes that someone is making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.849,
    "end": 4196.149,
    "text": "How do we characterize those?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4196.53,
    "end": 4198.911,
    "text": "Like, how do we just characterize their behavior, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.051,
    "end": 4205.214,
    "text": "We don't have to, you know, if you're a psychologist, you don't have to commit to this as inference problem, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4205.294,
    "end": 4208.576,
    "text": "Because the question that you want to answer is not, is it doing inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.616,
    "end": 4212.118,
    "text": "But it's what sort of, you know, what sort of mistakes are you making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4212.558,
    "end": 4214.94,
    "text": "What sort of assumptions are you making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4215.36,
    "end": 4218.882,
    "text": "Not, which is a statement about the quality of your inference algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.568,
    "end": 4222.328,
    "text": " which is much more interesting than whether or not you're doing inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4224.529,
    "end": 4227.069,
    "text": "That was way more long-winded, so I apologize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.109,
    "end": 4229.35,
    "text": "I meant that to be compact and concise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4229.51,
    "end": 4232.09,
    "text": "No, it's a really useful addition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.271,
    "end": 4236.031,
    "text": "Backtracking 15 minutes, just for the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.071,
    "end": 4244.672,
    "text": "The paper that Vicente mentioned is, I believe, Kirchhoff and colleagues, 2018, The Markov Blankets of Life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4244.852,
    "end": 4247.633,
    "text": "I like just clarifying that in case people want to backtrack and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.012,
    "end": 4251.994,
    "text": " I believe that's the, that's the blankets of blankets one, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.434,
    "end": 4252.634,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.674,
    "end": 4253.735,
    "text": "That's the one with the pendulums.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.076,
    "end": 4255.476,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.556,
    "end": 4256.717,
    "text": "To clarify that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.358,
    "end": 4257.538,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.918,
    "end": 4258.639,
    "text": "No, this is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.659,
    "end": 4262.281,
    "text": "I mean, again, we're getting on far too well, but no, we're doing well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.301,
    "end": 4262.681,
    "text": "We're doing well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.741,
    "end": 4264.463,
    "text": "No, no one's shouting at each other yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.223,
    "end": 4265.784,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.824,
    "end": 4266.804,
    "text": "No, this is, this is super.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.884,
    "end": 4277.252,
    "text": "So, so as you said, Jeff, we kind of need to do approximate bays sufficiently well that we don't dissipate into the heat bath, or it looks like we're doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.09,
    "end": 4292.969,
    "text": " And that's, I feel like some of the ways that issue got skirted is that we would encode a higher order, if we're talking about humans, a higher order prior preference that we believe that we should be or we are minimizing variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.316,
    "end": 4296.258,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.618,
    "end": 4299.7,
    "text": "Is that kind of... Go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.74,
    "end": 4301.122,
    "text": "I'm just curious about your point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.182,
    "end": 4303.784,
    "text": "We don't have to believe anything about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.804,
    "end": 4307.026,
    "text": "A cell doesn't have to believe in the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4307.066,
    "end": 4309.408,
    "text": "The point is that it's a mathematical inevitability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.828,
    "end": 4310.108,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4310.368,
    "end": 4316.011,
    "text": "It's, you know, so, you know, so I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.091,
    "end": 4317.292,
    "text": "OK, so let me let me go back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.332,
    "end": 4319.753,
    "text": "There are two ways to think about the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4319.773,
    "end": 4322.614,
    "text": "And one of them has to do with like like self-organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.935,
    "end": 4324.175,
    "text": "So what is self-organization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4324.255,
    "end": 4328.317,
    "text": "It's sort of like it sounds as if you're sort of saying that, like, oh, I have a notion of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.258,
    "end": 4330.478,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.658,
    "end": 4338.122,
    "text": "That that I act so as so that I act that, you know, I take action so that my notion of self is coherent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.69,
    "end": 4340.731,
    "text": " I don't like any of that stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.412,
    "end": 4347.459,
    "text": "I know that a lot of other people do, but I like it because the whole point is, is that you don't even need a notion of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4348.2,
    "end": 4348.4,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4348.5,
    "end": 4353.326,
    "text": "You know, in order to behave as if you have a notion of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.147,
    "end": 4354.327,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4355.067,
    "end": 4358.049,
    "text": "The way it's constructed, it's sort of like, oh, OK, it has a boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.089,
    "end": 4359.229,
    "text": "The boundary has these statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.269,
    "end": 4361.49,
    "text": "What simply has to happen to maintain those statistics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.97,
    "end": 4366.772,
    "text": "Those statistics give us a notion of object type, which you could call self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.473,
    "end": 4373.055,
    "text": "And you could sort of say, well, OK, for now, you know, then you can sort of ask the question, like inside, does it also have this notion of self?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.115,
    "end": 4374.416,
    "text": "I don't think it's a meaningful question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.416,
    "end": 4375.676,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.836,
    "end": 4376.076,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4376.577,
    "end": 4377.297,
    "text": "You know, it's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.323,
    "end": 4391.694,
    "text": " Yeah, it's sort of like, well, we've said this is the object type, this is its definition, and we're really asking a question, how do internal and external states collaborate in order to maintain the boundary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.834,
    "end": 4398.019,
    "text": "And if you take the max-enti version of the derivation, that becomes explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.619,
    "end": 4403.764,
    "text": "What you're really asking is, how do internal and external states collaborate to maintain boundary statistics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.045,
    "end": 4405.745,
    "text": "And there's no notion of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.351,
    "end": 4411.053,
    "text": " Yes, I know, I'm completely on board that I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.873,
    "end": 4420.798,
    "text": "Some of the work that I like to focus on is actually about self modeling self construction, which completely is opposed to the Cartesian ego picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.138,
    "end": 4428.642,
    "text": "And I think actually, a lot of the conceptual problems come from a retention of the Cartesian ego that people just feel very, it's very difficult to abandon that picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.262,
    "end": 4432.164,
    "text": "Now, I was only adding this because, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.694,
    "end": 4437.779,
    "text": " what you said is very much in line with what Carl said when he came on, which is that there is no real existential imperative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.899,
    "end": 4448.468,
    "text": "It's just if you can see object x at time here and object x at the same supposed object at t plus one, they've had to have done something that looks like a Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4449.089,
    "end": 4456.896,
    "text": "So it's an existential imperative only in the sense that we can kind of say that things persist through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.877,
    "end": 4458.017,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.439,
    "end": 4461.22,
    "text": " there are these sort of added bells and whistles, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.26,
    "end": 4484.331,
    "text": "So, you know, I'm pretty sure there are papers, now maybe these are earlier papers, which say something like, there is, I've read it today, there's an a priori belief, now, whether this is a propositional or sub-personal belief, I think is somewhat trivial, that I am, again, I'm saying this to make sense, I am the type of thing that will minimize variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.492,
    "end": 4487.573,
    "text": "So, given that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.217,
    "end": 4498.445,
    "text": " But given your point that we can do quite shitty variational Bayesian inference, perceptual inference, for one, and RKL... Yeah, relative to optimal, but yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.625,
    "end": 4503.408,
    "text": "Right, RKL divergences can be quite big.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.649,
    "end": 4517.499,
    "text": "Vicente, do you see a way of accounting for the persistence of the organism beyond just this slow optimization problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.931,
    "end": 4529.114,
    "text": " which, as I said, kind of historically at least invoked this higher order prior that I am the type of thing that will do descents down free energy gradients.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.815,
    "end": 4532.135,
    "text": "A way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4532.516,
    "end": 4542.479,
    "text": "Well, I mean, I guess this is a question on how things persist in time or how we call things persist in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4542.759,
    "end": 4546.68,
    "text": "So one thing is that I don't have any issue with the mathematical theory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4547.955,
    "end": 4552.096,
    "text": " imperative part of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4553.257,
    "end": 4567.501,
    "text": "I can say something like, given these constraints, the dynamical system with an attractor will tend to that attractor, and that's a mathematical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4570.652,
    "end": 4594.925,
    "text": " imperative to right if you have an attractor and with the constraints they be the system will tell that and actually you can re-describe that tending towards the the the attractor in terms of base and inference in terms of self self-information minimization whatever or maximization and free energy right so i don't have anything about that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4596.96,
    "end": 4617.759,
    "text": " The thing is that the way the permanence of things or the self-organization of things without the belief of it has been studied in time is the kind of thing that touches on homeostasis, allostasis, or even autopoiesis, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4618.559,
    "end": 4644.082,
    "text": " um an activist thing that the thing what the thing does is to is to self not not only to self-organize but to self uh produce itself right the the the in so to speak the internal state of the systems are engaged in maintaining the boundary right that's what they what they what they do there and i don't think they",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4645.453,
    "end": 4651.878,
    "text": " they they picture that in terms of having to believe that they basically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4653.527,
    "end": 4660.749,
    "text": " picture that in terms of catalytic or even physiological ways to maintain that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4661.91,
    "end": 4675.354,
    "text": "And I guess that's an account of homeostasis too, of allostasis when you include the dynamical relationship with the environment, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4676.266,
    "end": 4698.724,
    "text": " So now I guess the question is that to what extent or the question we at least we were interested in is to what extent this physical imperative of the minimization of free energy or the performing as if making Bayesian inference is able to capture autopoiesis, for instance, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4699.204,
    "end": 4704.188,
    "text": "And not only autopoiesis, not only the self-organization part, but the self-production part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4707.888,
    "end": 4711.129,
    "text": " And that's another question we have in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4711.329,
    "end": 4713.269,
    "text": "Yeah, so I have two answers, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4713.829,
    "end": 4717.711,
    "text": "The first is that when it comes to maintenance, maintenance is baked in, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4718.251,
    "end": 4727.233,
    "text": "If you say my definition of a thing is that it has these boundary statistics and they're stationary statistics, it's baked in, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.873,
    "end": 4728.774,
    "text": "Which is totally fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4728.814,
    "end": 4730.654,
    "text": "That's your definition of that object type.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.754,
    "end": 4732.435,
    "text": "It is stable, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.795,
    "end": 4733.695,
    "text": "And that, you know, which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4736.856,
    "end": 4746.986,
    "text": " that has gone largely unaddressed in the FEP literature is how do these things form in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4750.55,
    "end": 4756.636,
    "text": "The focus has always been on homeostasis, which has nothing to do with starting from a glob of goop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4758.041,
    "end": 4758.321,
    "text": " right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.361,
    "end": 4762.703,
    "text": "And getting something that is stable, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.723,
    "end": 4763.683,
    "text": "It doesn't have anything to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.703,
    "end": 4766.184,
    "text": "Now, there's self repairs in there, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4766.724,
    "end": 4769.725,
    "text": "And there is like finding, you know, homeostasis and balance with your environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4770.005,
    "end": 4774.587,
    "text": "But there's nothing that is how do I get from, you know, a chemical soup to a cell?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4776.207,
    "end": 4784.03,
    "text": "That is the FEP has historically, you know, been completely agnostic on that topic, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.05,
    "end": 4787.491,
    "text": "And that's one of the reasons why I don't use words like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4787.967,
    "end": 4789.25,
    "text": " you know, aliostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.351,
    "end": 4793.641,
    "text": "I also forget what they mean because it's a big word, a really big word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4795.924,
    "end": 4802.548,
    "text": " But that said, there are, in fact, people working on that particular problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4802.568,
    "end": 4805.55,
    "text": "That's why I like to cite, like, so I've mentioned Jeremy Englund like twice now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4805.73,
    "end": 4807.031,
    "text": "He gets a third mention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4807.071,
    "end": 4808.112,
    "text": "That's how cool I think it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4808.352,
    "end": 4810.573,
    "text": "I also just read his book, which was a lot of fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.254,
    "end": 4813.055,
    "text": "And that's probably why it's on my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.555,
    "end": 4817.938,
    "text": "So the approach that he's taking is, well, okay, so that's the goal, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.958,
    "end": 4824.883,
    "text": "The goal is to say, well, what, you know, what actually, you know, why is it that these complicated things form apparently out of nothing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4825.993,
    "end": 4829.797,
    "text": " And the math that he uses is, in fact, the mathematics of statistical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4830.358,
    "end": 4837.965,
    "text": "And the mathematical object that seems to motivate this is constructing free energy minimizing flows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.388,
    "end": 4854.07,
    "text": " He even has a love, I think it's chapter seven in his book where he then goes on to say, and by the way, you could think of these free energy minimizing flows as doing a kind of computation about their environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4854.73,
    "end": 4862.691,
    "text": "But he doesn't actually say as if, I actually read through it twice just to see if he used the phrase as if, and it turns out he doesn't, which is unfortunate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.572,
    "end": 4866.032,
    "text": "But he makes a very similar argument, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.272,
    "end": 4871.693,
    "text": "Is that this free energy minimization principle can in fact also lead to the formation of these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.544,
    "end": 4876.765,
    "text": " The math is a lot more complicated, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4876.885,
    "end": 4880.626,
    "text": "And certainly static blankets don't apply in this scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4880.986,
    "end": 4884.728,
    "text": "Like a static Markov blanket doesn't apply, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4886.168,
    "end": 4893.67,
    "text": "Because the whole point is that over time, it's actually forming the blanket is constantly changing and morphing into a much more interesting set of statistical role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4893.911,
    "end": 4896.751,
    "text": "So the statistics of the blanket are no longer stationary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.852,
    "end": 4899.412,
    "text": "So a stationary blanket doesn't apply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.752,
    "end": 4901.493,
    "text": "But the same free energy principle applies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.84,
    "end": 4909.962,
    "text": " The same free energy principle that Schrodinger called negative entropy or that was sometimes referred to as negative entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4911.222,
    "end": 4915.183,
    "text": "And the reason for this is because it all falls out ultimately from like statistical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.904,
    "end": 4916.904,
    "text": "Okay, fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.024,
    "end": 4918.064,
    "text": "Well, yeah, but you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4918.424,
    "end": 4920.465,
    "text": "That has not really been, I mean, I just wanted to reiterate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4920.705,
    "end": 4922.405,
    "text": "I did have a point when I started the tirade.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4922.425,
    "end": 4923.325,
    "text": "I just want to get back to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4924.766,
    "end": 4929.567,
    "text": "You know, it is true that that hasn't been addressed, like how these blankets actually form in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.922,
    "end": 4934.203,
    "text": " is the free energy principle in its current form has been largely agnostic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4934.223,
    "end": 4937.544,
    "text": "And that's why we say, well, take a look what Jeremy England's doing is basically free energy too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4938.145,
    "end": 4945.767,
    "text": "Okay, I'd like to get to that maybe as our sort of closing remark, because I don't think there's going to be too much antagonism or discord there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4946.268,
    "end": 4952.83,
    "text": "I will raise one more criticism that was mentioned in Ezequiel de Paulo's commentaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4953.257,
    "end": 4955.017,
    "text": " So this is his criticism of the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.257,
    "end": 4962.279,
    "text": "And then we can move on to the fluffy philosophy or statistical mechanics or whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4963.339,
    "end": 4972.081,
    "text": "So Ezekiel de Palo has two critiques in a way of the FEP formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.821,
    "end": 4978.042,
    "text": "The first is exactly what we've spoken about, which is that we have to make a choice about where to carve up the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.222,
    "end": 4981.723,
    "text": "And we've covered that until the cows come home, although I'd be always happy to return to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.903,
    "end": 4982.123,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.95,
    "end": 5002.845,
    "text": " His second point is, and I will quote, Markov blankets are too strong to account for the way the internal states of an organism are often directly affected by external states without any statistical mediation or loss of integrity, as anyone who's ever been tipsy after a few beers or felt dizzy from heat exhaustion can verify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.625,
    "end": 5011.191,
    "text": "So now we've gone to a completely different formulation, which is just no vicarious blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5012.073,
    "end": 5014.835,
    "text": " Okay, we're having direct effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.296,
    "end": 5022.081,
    "text": "Jeff, I'm going to start with you because your face is telling me that you don't like that so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.962,
    "end": 5027.326,
    "text": "How does that sound to your ears?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.346,
    "end": 5029.127,
    "text": "I have no idea what is meant by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.069,
    "end": 5037.574,
    "text": "It's sort of like, I mean, and certainly the analogy that was provided, I do not understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5038.852,
    "end": 5046.116,
    "text": " I suspect that either, I mean, I'm probably being obtuse or maybe I haven't, I'm not tipsy enough given the analogy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5046.176,
    "end": 5048.657,
    "text": "But I don't understand how anything can have a direct effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5049.118,
    "end": 5058.143,
    "text": "I mean, you know, I can think of another scenario that one might appeal to to make a similar argument, which is like, and now let's talk about like protons and electrons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5058.343,
    "end": 5060.284,
    "text": "They have electric fields, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.364,
    "end": 5064.826,
    "text": "And those fields have, you know, an effect, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5064.926,
    "end": 5067.968,
    "text": "But to my mind, that just means, you know, your blanket is the field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5069.932,
    "end": 5070.272,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5070.533,
    "end": 5070.733,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5072.234,
    "end": 5077.839,
    "text": "Vicente, do you have any thoughts on this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5079.6,
    "end": 5085.285,
    "text": "I was imagining that Jeff was not going to like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5085.645,
    "end": 5087.267,
    "text": "And I do understand why, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5087.387,
    "end": 5088.548,
    "text": "I mean, it's kind of in the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5091.477,
    "end": 5103.751,
    "text": " in the very definition of a Markov blanket, is those sets of states that are always there, kind of mediating between the internal and the external.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5104.532,
    "end": 5111.219,
    "text": "I guess that what Ezekiel was trying to point out there, it's something like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5112.819,
    "end": 5117.565,
    "text": " it is possible for those blankets to be leaky sometimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5118.185,
    "end": 5126.495,
    "text": "I think this is an idea that you find in the Guigui-Marcovo blankets paper too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5126.515,
    "end": 5130.16,
    "text": "Oh no, that there's no absolute",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5134.704,
    "end": 5139.869,
    "text": " fusion, so to speak, between the internal and the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5141.27,
    "end": 5142.872,
    "text": "And that's why they are weak, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5143.332,
    "end": 5146.054,
    "text": "There's not a full encapsulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5148.577,
    "end": 5154.863,
    "text": "This is just a speculation on what's a single point there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5154.883,
    "end": 5158.146,
    "text": "That those blankets maybe can be leaking in some way sometimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5159.841,
    "end": 5168.303,
    "text": " Yeah, maybe this is an issue that I have difficulty understanding because I've already moved on beyond, in my thinking, like blankets don't have to be static.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5169.703,
    "end": 5169.863,
    "text": "Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5169.963,
    "end": 5183.285,
    "text": "Because the best criticism of the original set of Markov blanket stories was your basic, your definition of a blanket, or at least the way you are using a blanket, prohibits matter transfer between object and environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5183.385,
    "end": 5185.726,
    "text": "So like, good luck describing something that eats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5186.246,
    "end": 5186.586,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5191.34,
    "end": 5200.127,
    "text": " So fortunately, the way around that originally was to just sort of say, oh, we could have made the blanket operate on fluxes instead of particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5200.227,
    "end": 5201.468,
    "text": "And I never really liked that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5202.288,
    "end": 5207.832,
    "text": "But now that we've gotten this issue where we've basically said, oh, no, look, dynamic blankets, it all still works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5207.872,
    "end": 5210.695,
    "text": "All the math still works out just fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5211.355,
    "end": 5213.637,
    "text": "Even when there's matter transfer, it works on flames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5214.164,
    "end": 5222.234,
    "text": " And so to my, if that was the ultimate issue, then I would say that issue has been resolved, but I would understand why someone would have drawn that conclusion from the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5224.397,
    "end": 5233.148,
    "text": "Because the literature focused on problems that were a lot more solvable, like the dynamic, you know, identifying dynamic Markov blankets is a really mathematically challenging problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5234.775,
    "end": 5238.658,
    "text": " Whereas specifying a static one makes your life really easy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5238.998,
    "end": 5249.907,
    "text": "You should never be overly critical of people, in my view, for mathematical simplifications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5250.587,
    "end": 5255.751,
    "text": "You should always be generous and say, oh, I understand that that's not part of the principle per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.791,
    "end": 5258.654,
    "text": "That's just the particular use of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5258.734,
    "end": 5261.576,
    "text": "My favorite example of this is general relativity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5262.401,
    "end": 5264.983,
    "text": " You know, the equation of general relativity has like three terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.003,
    "end": 5275.452,
    "text": "It's like big G, little g, and t. What they don't tell you is that hidden behind those three terms is a shit ton of math, which is why there's only like one solution to that problem, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5276.933,
    "end": 5279.475,
    "text": "And the same sort of goes for the free energy principle, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5279.535,
    "end": 5284.579,
    "text": "If you actually write down what the objective function for active inference is, it's really hard to compute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5284.92,
    "end": 5285.08,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5285.68,
    "end": 5291.425,
    "text": "And so they've made a lot of assumptions to simplify the math and to make the computation easier, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5292.392,
    "end": 5302.317,
    "text": " And so you should always be, I always encourage people to be generous with evaluating things in which there's, there are equations and then there's simplifications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5303.257,
    "end": 5307.119,
    "text": "You got to, if you're evaluating the theory, you got to evaluate the original equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5307.78,
    "end": 5308.02,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5308.52,
    "end": 5310.401,
    "text": "And not criticize the simplifications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.341,
    "end": 5312.142,
    "text": "Very Christmassy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5312.782,
    "end": 5319.265,
    "text": "Um, maybe this will help or, uh, or not, or maybe it might muddy the waters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5320.006,
    "end": 5320.306,
    "text": "Another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5321.198,
    "end": 5323.359,
    "text": " quote now from the Markov blanket trick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.079,
    "end": 5336.102,
    "text": "Without the Markov blanket formalism, the dual information geometry would be reduced to its intrinsic component, which is the only one needed for standard thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5336.642,
    "end": 5337.963,
    "text": "And I've written next to that on my notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5338.343,
    "end": 5339.743,
    "text": "Why don't we just use this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.224,
    "end": 5342.804,
    "text": "Jeff, why don't we just use this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5344.484,
    "end": 5349.746,
    "text": "Because we want, I really do think because like at the heart of a lot of this is like phenotyping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5351.815,
    "end": 5359.378,
    "text": " It's sort of like the goal is actually to segment the universe into smaller understandable pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5360.159,
    "end": 5368.803,
    "text": "And since if that's the goal, I feel like I addressed this before when I said, if we could model the whole universe, no problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.843,
    "end": 5372.624,
    "text": "Why would we bother to chop it up into little pieces and sort of say, oh, no, this is a car.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.644,
    "end": 5374.125,
    "text": "I'm going to summarize car dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5374.145,
    "end": 5377.827,
    "text": "I'm going to worry about the little bits and pieces inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5377.887,
    "end": 5380.428,
    "text": "Why would you do that if you could just simulate the whole thing and it was no problem?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.128,
    "end": 5384.574,
    "text": " So there's sort of an empirical question here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5384.854,
    "end": 5393.888,
    "text": "The reason we divide things up, the reason we draw blankets around things is to make our lives, is to make our ability to understand the universe more tractable, is to make it easier to get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.756,
    "end": 5400.459,
    "text": " You could always simulate everything if you could, but you really can't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5400.499,
    "end": 5403.122,
    "text": "If you could, you would, but you can't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5403.642,
    "end": 5407.926,
    "text": "You're looking for cognitive shortcuts if you're a cognitive scientist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.146,
    "end": 5413.031,
    "text": "If you're a scientist, you're looking for simplifications of complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5413.131,
    "end": 5415.012,
    "text": "You're looking for macroscopic variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5415.853,
    "end": 5419.036,
    "text": "It's sort of like there's an empirical reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5420.441,
    "end": 5421.802,
    "text": " Vicente, have you got anything to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5421.942,
    "end": 5431.671,
    "text": "And maybe I should have asked exactly what this claim entails, what the reduction to an intrinsic component actually looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.873,
    "end": 5438.557,
    "text": "Actually, that was... I wouldn't say a quote, but that was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5441.86,
    "end": 5448.815,
    "text": " verbatim almost from the dual geometry papers, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5449.296,
    "end": 5451.039,
    "text": "So it was more than saying,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5453.24,
    "end": 5455.901,
    "text": " more than focusing in the reduction you could do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5455.921,
    "end": 5471.766,
    "text": "I think what the free energy principle proponents are saying, they're like, look, this is just thermodynamics extended a little bit because we have this blanket that they allow us to do this other thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5472.446,
    "end": 5473.487,
    "text": "So that's one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5473.847,
    "end": 5479.028,
    "text": "And actually, I'm going to one more time agree with Jeff in many things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5482.711,
    "end": 5497.514,
    "text": " And I think that, again, that was kind of the spirit of the Markov Blanket trick to try to go ourselves through other things that you need for the whole building to be built, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5497.834,
    "end": 5504.02,
    "text": " And of course, you need to choose the thing you are interested in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5504.14,
    "end": 5509.065,
    "text": "You need to make assumptions on, okay, these are the variables I'm going to be working with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5509.366,
    "end": 5519.055,
    "text": "And with that, I mean, ecological psychologists are pretty much the first people that during the 80s started using dynamical systems theory to model dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5520.951,
    "end": 5521.391,
    "text": " behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5521.651,
    "end": 5536.679,
    "text": "Actually, there's a 1987 book by Peter Cogler and Michael Tarvey called Information, Natural Law and Rhythmical Behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5536.919,
    "end": 5550.165,
    "text": "If you go there and read how they gather from statistical physics and all that stuff, you'll see many similar points than you see now in the free energy principle, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5550.66,
    "end": 5568.292,
    "text": " But the point being, when I say, okay, we model, or we, you know, that within this kind of dynamic cognitive science, there's a very famous model, the HKV model of couple oscillators in which the main variable is relative phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5569.173,
    "end": 5570.794,
    "text": "Why is it relative phase?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5570.874,
    "end": 5577.158,
    "text": "Well, it's a variable very easy to track, and when you track it and you model it, you have a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5578.032,
    "end": 5584.793,
    "text": " very cool two attractors for these parameters and you change and you see how the two attractors go to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5585.073,
    "end": 5595.535,
    "text": "So you can express the qualitative changes of the coupling of the two oscillators in a very simple way with just one variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5596.735,
    "end": 5597.936,
    "text": "But why you pick that one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5597.976,
    "end": 5605.057,
    "text": "Well, because it's easy and it models it well, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5605.457,
    "end": 5605.617,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5607.168,
    "end": 5608.012,
    "text": " So, I mean, I",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5609.693,
    "end": 5612.254,
    "text": " obviously agree with Jeff on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5612.774,
    "end": 5618.416,
    "text": "The point was, yes, in the literature, these simplifications sometimes are not clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5619.596,
    "end": 5619.876,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5620.316,
    "end": 5631.28,
    "text": "It's good to... I think they... And I also understand, Jeff, they are not clear because the aim was generality, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5632.12,
    "end": 5634.581,
    "text": "We want this to apply to everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5634.841,
    "end": 5637.702,
    "text": "So when the couple...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5638.737,
    "end": 5641.399,
    "text": " oscillators guy come, but no, but talk about my thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5641.8,
    "end": 5642.24,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5642.86,
    "end": 5644.482,
    "text": "That's right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5644.682,
    "end": 5644.902,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5645.262,
    "end": 5647.864,
    "text": "We need to prove all these other things as to make it more right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5647.904,
    "end": 5648.905,
    "text": "So yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5649.386,
    "end": 5649.566,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5649.586,
    "end": 5651.948,
    "text": "And that's one of the reasons why I really got to get this paper out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5652.028,
    "end": 5665.539,
    "text": "So basically it's, it's, you know, if you, another way to think about what, you know, the Markov blanket story is, is that it's, it's an integral component, not just of systems identification theory, but also like macroscopic physics discovery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5666.604,
    "end": 5666.764,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5666.784,
    "end": 5668.705,
    "text": "So why did you pick the phase difference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.745,
    "end": 5669.926,
    "text": "It was a convenient variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5669.986,
    "end": 5671.787,
    "text": "It encapsulated all of the dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5672.547,
    "end": 5672.667,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5672.707,
    "end": 5679.13,
    "text": "What if your problem was I just have a complex system and I don't know what and I need to discover what the phase variables should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5680.771,
    "end": 5681.031,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5681.631,
    "end": 5684.613,
    "text": "And the Markov blanket story is one way to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.793,
    "end": 5685.033,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5685.073,
    "end": 5689.655,
    "text": "It's sort of like I want to segment my complex system into different subsystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5689.936,
    "end": 5690.476,
    "text": "And if you have a.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5691.371,
    "end": 5693.492,
    "text": " Markov blanket discovery algorithm, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5693.572,
    "end": 5694.792,
    "text": "And it sort of does that for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5694.812,
    "end": 5698.534,
    "text": "It does macroscopic physics discovery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5698.814,
    "end": 5701.595,
    "text": "It identifies that that was the simplest variable to use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5702.296,
    "end": 5706.537,
    "text": "That makes me wonder out of the blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5706.557,
    "end": 5708.358,
    "text": "So I don't have an answer to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5708.538,
    "end": 5710.519,
    "text": "This is a pure question that might not have an answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5711.139,
    "end": 5720.343,
    "text": "When people who work with dynamical systems or at least part of them to model motor control, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5721.013,
    "end": 5728.219,
    "text": " They gather a lot of ideas from Bernstein and from Haken and the idea of synergy, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5728.439,
    "end": 5740.328,
    "text": "Like the brain is able to control the arm as a synergy because it's already coordinated as a whole unit there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5740.568,
    "end": 5745.252,
    "text": "Could you put a Markov blanket on a synergy, so to speak?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5746.681,
    "end": 5757.633,
    "text": " So to some extent, and I'm going to just say this is a gross generalization of what the blanket discovery algorithm does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5758.274,
    "end": 5764.641,
    "text": "But in a very real way, it's doing dimensionality reduction, which is basically synergy identification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5765.222,
    "end": 5765.382,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5765.422,
    "end": 5770.984,
    "text": "So why is it that like, you know, I can model, I can just sort of look, look at all this complicated stuff I can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5771.024,
    "end": 5771.864,
    "text": "Well, it turns out, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5771.884,
    "end": 5777.766,
    "text": "There's really only like a very small number of variables I have to track because, you know, they're all correlated, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5777.806,
    "end": 5780.027,
    "text": "There are restrictions or they're constrained, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5780.047,
    "end": 5783.108,
    "text": "My wrist is the same distance from my elbow, like, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5783.888,
    "end": 5785.529,
    "text": "And so that's another way of carrying it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5785.549,
    "end": 5787.21,
    "text": "Well, that means they're correlated, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5787.55,
    "end": 5791.331,
    "text": "And synergy and correlations are very, are sort of, you know, are related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5792.15,
    "end": 5798.732,
    "text": " And so to some extent, what the algorithm actually does, or when you're doing Markov blanket discovery, what you're basically saying is what's correlated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5799.512,
    "end": 5806.374,
    "text": "What aspects of the dynamical system are sufficiently strongly related that I can reduce them to a single variable, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5806.394,
    "end": 5808.295,
    "text": "So for example, for rigid body, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5809.095,
    "end": 5811.516,
    "text": "I can describe this whole thing by two points, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5811.836,
    "end": 5816.157,
    "text": "I, you know, because, you know, I don't have to model every single molecule in my arm, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5816.177,
    "end": 5817.598,
    "text": "I can reduce it to a single variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5818.338,
    "end": 5821.959,
    "text": "And that's another way of thinking about like, again, macroscopic physics discovery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5825.668,
    "end": 5831.609,
    "text": " But I also think that's one of the reasons why the FEP, as it's formulated, is strongly tied to just empiricism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5832.849,
    "end": 5835.47,
    "text": "It has a lot to do with just how we do science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5835.77,
    "end": 5840.811,
    "text": "We're doing dimensionality reduction and looking for principles that uniformly apply.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5842.812,
    "end": 5846.393,
    "text": "And I think that the focus of the literature has been on the uniformly apply thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5847.859,
    "end": 5852.864,
    "text": " And now we need to bring it into the real world of empirical inference where it's the dimensionality reduction thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5853.225,
    "end": 5854.987,
    "text": "But they are, in fact, completely compatible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5856.429,
    "end": 5856.789,
    "text": "Amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.81,
    "end": 5861.535,
    "text": "Just, again, to loop around to what I had said so that people know where to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5861.555,
    "end": 5866.661,
    "text": "The quote that I chose is footnote 12 of the Markov-Lanker check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.701,
    "end": 5867.662,
    "text": "I told you I read the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.668,
    "end": 5892.044,
    "text": " um and i think it pertains to this two complementary ways of describing the density dynamics of internal states one being this intrinsic uh change over time towards uh the attractor state and then the other one is this extrinsic um tracking of external states and i'm not a mathematician but it appears to me that the maths seems equivalent um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.314,
    "end": 5897.537,
    "text": " And we can actually make a kind of formal equivalence between those things, which is quite beautiful, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5897.857,
    "end": 5900.059,
    "text": "It's almost as if they're equivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5901.24,
    "end": 5902.2,
    "text": "I'm not a mathematician.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5902.22,
    "end": 5902.781,
    "text": "Give me a break.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5904.202,
    "end": 5904.922,
    "text": "No, no, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5904.942,
    "end": 5905.163,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5905.183,
    "end": 5906.724,
    "text": "That was not a criticism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5906.744,
    "end": 5907.744,
    "text": "That was a terrible joke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.365,
    "end": 5908.905,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.306,
    "end": 5909.666,
    "text": "Fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5910.126,
    "end": 5910.607,
    "text": "Oh, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5910.627,
    "end": 5910.867,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5911.287,
    "end": 5911.487,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5911.527,
    "end": 5911.947,
    "text": "Very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5912.448,
    "end": 5912.888,
    "text": "Very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5912.908,
    "end": 5914.049,
    "text": "It looks like they're the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5916.231,
    "end": 5916.491,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5916.671,
    "end": 5917.051,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5917.131,
    "end": 5922.195,
    "text": "So I will finish with what I promised we'd finish with, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5922.797,
    "end": 5930.144,
    "text": " kind of bigger potentially philosophical question that expands beyond the scope of the free energy principle as is right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5931.485,
    "end": 5935.268,
    "text": "And this is an issue that actually really matters to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5935.628,
    "end": 5945.257,
    "text": "When I first discovered active inference, I remember tweeting two things, one of which was the presence of Markov blankets upon Markov blankets is the best argument from creation that's ever been.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5946.209,
    "end": 5955.253,
    "text": " And the second one was, I think that the apparent distinctions of internal and external states mediated for a Markov blanket might itself be an illusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5956.093,
    "end": 5959.035,
    "text": "And there may just be some sort of singular reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5959.055,
    "end": 5961.596,
    "text": "I'm paraphrasing my silly tweets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5962.076,
    "end": 5966.418,
    "text": "But it was more just philosophical, ethereal thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5967.258,
    "end": 5969.019,
    "text": "And we mentioned panpsychism earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5971.44,
    "end": 5973.881,
    "text": "And again, I don't want to get too into the weeds on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5974.381,
    "end": 5975.642,
    "text": "But Jeff, maybe we could start with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5976.661,
    "end": 5985.265,
    "text": " Where do you think this all comes from, these distinctions that we can carve for instrumental reasons, which do work mathematically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5986.045,
    "end": 5990.727,
    "text": "And what are your hunches about what might lie underneath them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5993.188,
    "end": 5995.589,
    "text": "I love questions like this, and I have the perfect answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5995.609,
    "end": 5997.57,
    "text": "So what lies underneath nothing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5997.59,
    "end": 6002.792,
    "text": "Oh, that was my serious face.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6002.812,
    "end": 6003.432,
    "text": "That doesn't help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6004.506,
    "end": 6008.327,
    "text": " No, so I remember one time I got asked a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6008.547,
    "end": 6014.168,
    "text": "So we're talking about P's and Q's because that's what you're doing when you're doing probabilistic reasoning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6014.208,
    "end": 6015.088,
    "text": "And somebody raised their hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6015.108,
    "end": 6016.248,
    "text": "It's like, is there a true P?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6017.329,
    "end": 6018.069,
    "text": "The answer is no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.609,
    "end": 6019.369,
    "text": "No, there's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6019.969,
    "end": 6024.05,
    "text": "And it's not because there isn't a true P. It's just I don't understand the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6024.21,
    "end": 6025.75,
    "text": "It's sort of a jerky thing to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6026.431,
    "end": 6032.112,
    "text": "I often describe when I get... So as you might imagine, given what I do for a living, I get asked questions like that all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6032.152,
    "end": 6033.272,
    "text": "And I usually refuse to answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6034.11,
    "end": 6036.692,
    "text": " And the reason I refuse to answer is because I got up to work today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6036.712,
    "end": 6039.555,
    "text": "I put on my coat and tie and I put on my work pants, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6039.775,
    "end": 6041.997,
    "text": "My work pants are my harsh instrumentalist pants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6043.138,
    "end": 6048.662,
    "text": "And if you want me to answer like philosophical or religious questions, it's like, well, I have to put on a different pair of pants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6049.883,
    "end": 6050.163,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6050.484,
    "end": 6060.892,
    "text": "You know, when, you know, when functioning in this, in this environment, like, you know, it's, it, it, you know, I, I take a very, very instrumentalist view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6061.393,
    "end": 6061.553,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6062.042,
    "end": 6067.383,
    "text": " And I think the, you know, so you asked like, oh, do we carve, you know, is there some, is it all just one thing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6067.523,
    "end": 6071.724,
    "text": "Are these artificial carvings, the artificial carvings are artificial, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6071.764,
    "end": 6075.044,
    "text": "We carve up the world because it's convenient, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6075.104,
    "end": 6077.605,
    "text": "Because it simplifies the problems we have to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6077.685,
    "end": 6081.145,
    "text": "It has empirical, it has predictive power and empirical utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6081.745,
    "end": 6083.546,
    "text": "I like to say that science is not about truth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6083.626,
    "end": 6088.287,
    "text": "It is about prediction and data compression and nothing else, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6088.307,
    "end": 6090.347,
    "text": "So when functioning as a scientist, that's what I focus on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6091.328,
    "end": 6093.829,
    "text": " which is my way of saying that's my answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6093.909,
    "end": 6095.05,
    "text": "Harsh instrumentalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6095.89,
    "end": 6098.411,
    "text": "Harsh instrumentalism means you don't have to worry about what's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6098.431,
    "end": 6102.252,
    "text": "I can't wait for the philosophers to be shouting at you virtually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6103.713,
    "end": 6106.334,
    "text": "Vicente, what are your thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6108.115,
    "end": 6120.1,
    "text": "I was expecting this answer from Jeff because my preparation to this podcast was not to reread my own paper, but to watch another podcast on the machine learning street talk, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6122.988,
    "end": 6126.569,
    "text": " He was saying, electron is just the name for an equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6129.23,
    "end": 6132.811,
    "text": "So I was expecting harsh instrumentalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6133.511,
    "end": 6140.373,
    "text": "I'm kind of an instrumentalist, too, in some ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6142.414,
    "end": 6144.235,
    "text": "But at the same time, I'm a realist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6144.935,
    "end": 6147.156,
    "text": "So how can that be the case, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6149.06,
    "end": 6178.152,
    "text": " I get it comes overall comes all to a form of pragmatism in the end in which you can be realist about the kind of things you do and if they are successful you are dealing with the real world and you do so by using instruments and I",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6179.254,
    "end": 6182.536,
    "text": " I'm in favor of a plurality of instruments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6184.397,
    "end": 6191.081,
    "text": "Markov blankets are one of them that I don't personally use in my own research, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6191.101,
    "end": 6192.002,
    "text": "But you can use it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6193.422,
    "end": 6207.911,
    "text": "But I wouldn't try to find a final foundation like, oh, there's only one thing or everything is such or everything is such, all of them, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6208.979,
    "end": 6222.145,
    "text": " It's more like we act around and reality is somehow the way where all our actions converge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6222.745,
    "end": 6223.625,
    "text": "And not, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6223.685,
    "end": 6225.206,
    "text": "Sometimes do, sometimes don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6225.726,
    "end": 6228.408,
    "text": "And we carry reality in that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6229.768,
    "end": 6236.293,
    "text": " All we have is our concepts that are instruments and are not foundational in any way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6236.793,
    "end": 6241.737,
    "text": "Tools, Markov blankets, other tools, and we go like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6241.977,
    "end": 6253.325,
    "text": "But I mean, I don't think there's some form of matter of fact or fact of the matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6254.866,
    "end": 6255.887,
    "text": "So there's something that we...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6259.801,
    "end": 6274.167,
    "text": " some reality that we build up together through action and is there it's just it can change so it's not the final thing it's it's it's it's not the um and all the philosopher you know an ancient philosopher",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6274.94,
    "end": 6277.861,
    "text": " I would say something like the Arche, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6277.961,
    "end": 6279.401,
    "text": "This final original thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6279.641,
    "end": 6282.742,
    "text": "There's no... But there's a thing we do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6282.982,
    "end": 6283.922,
    "text": "There's a matter of fact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6284.562,
    "end": 6291.444,
    "text": "And the variety of tools and their superposition and their obituos... Obituos?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6291.724,
    "end": 6294.324,
    "text": "I don't know that word in English.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6294.364,
    "end": 6301.766,
    "text": "But even the things that they don't match well, tell us about what kind of thing we can do and we can don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6303.317,
    "end": 6304.578,
    "text": " Oh, where are my Buddhist friends?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6304.958,
    "end": 6306.099,
    "text": "Where am I?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6306.359,
    "end": 6308.381,
    "text": "Well, so that's, that's the funny thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6308.401,
    "end": 6309.581,
    "text": "You asked the wrong question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6309.802,
    "end": 6313.304,
    "text": "If you wanted me to put my, put on my Quaker Buddhist pants, I can do that too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6314.104,
    "end": 6316.026,
    "text": "I just generally refuse to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6316.386,
    "end": 6318.888,
    "text": "Maybe on Christmas day, I'll ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6319.168,
    "end": 6330.296,
    "text": "It's one of those, it's like, I remember one of my, my, one of my, one of the faculty in my department, I was getting my PhD once said that, uh, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6331.189,
    "end": 6336.25,
    "text": " philosophy is a lot like algebra or going to the bathroom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6336.37,
    "end": 6338.211,
    "text": "It's just not something you should do in public.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6343.372,
    "end": 6345.932,
    "text": "I don't agree with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6347.793,
    "end": 6351.934,
    "text": "It indicates like why it is I hesitate to answer these questions because I don't really have good answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6351.974,
    "end": 6352.954,
    "text": "I have my answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6353.374,
    "end": 6357.095,
    "text": "And defaulting to instrumentalism is like just the easy way out, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6357.115,
    "end": 6357.195,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6358.01,
    "end": 6361.051,
    "text": " Well, yeah, they're purposefully quite provocative and probing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6361.852,
    "end": 6363.112,
    "text": "But people seem to like answering them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6364.073,
    "end": 6366.774,
    "text": "Chaps, that was tremendously fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6368.335,
    "end": 6375.318,
    "text": "Maybe we could have just a couple minutes for closing remarks, given we've reached such a beautiful point of conciliation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6375.958,
    "end": 6387.123,
    "text": "Vicente, maybe in addition to closing remarks, you could also let people know what you're working on and where they could reach out to you if they wanted to know more about your topics of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6388.399,
    "end": 6397.218,
    "text": " Okay, so I'm going to start by talking one last time about the Markov blanket trick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6398.365,
    "end": 6400.826,
    "text": " the paper kind of grew on its own.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6401.146,
    "end": 6401.706,
    "text": "It's way long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6401.806,
    "end": 6403.486,
    "text": "I think it's 24,000 words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6403.506,
    "end": 6407.467,
    "text": "So it's way longer than I was expecting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6409.387,
    "end": 6415.209,
    "text": "Because actually, most of it is just me asking a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6415.229,
    "end": 6416.689,
    "text": "Not me, all of us, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6416.729,
    "end": 6419.069,
    "text": "But asking the questions we have, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6419.47,
    "end": 6422.85,
    "text": "Oh, but if the formalism work, why this and why that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6422.89,
    "end": 6423.75,
    "text": "And why candle flames?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6423.79,
    "end": 6425.271,
    "text": "And why, you know, that kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6425.891,
    "end": 6426.011,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6426.983,
    "end": 6430.984,
    "text": " I really don't have a strong position on those things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6431.704,
    "end": 6436.725,
    "text": "I just would like to know, OK, how would you apply this to a model with a relative face?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6437.325,
    "end": 6439.545,
    "text": "And that seems to include the whole system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6440.205,
    "end": 6453.548,
    "text": "I only have a strong opinion with one thing, which is the fact that for perception, you need or not need prior knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6454.639,
    "end": 6455.92,
    "text": " Right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6456.24,
    "end": 6461.462,
    "text": "That's actually my real stake there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6461.663,
    "end": 6480.892,
    "text": "I think every time you endorse the system with some prior knowledge in order to make sense, to go, as we talked, from the impoverished input to the real world, so to speak, you have no way to justify that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6483.817,
    "end": 6486.438,
    "text": " knowledge or to explain why it is there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6486.998,
    "end": 6490.379,
    "text": "The typical way nobody says, no, it's evolution, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6491.059,
    "end": 6493.94,
    "text": "But it's kind of unsatisfactory for many things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6494.2,
    "end": 6496.521,
    "text": "I don't want to go to this thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6496.541,
    "end": 6502.603,
    "text": "But this is actually my only kind of my ideal breaker.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6502.723,
    "end": 6510.505,
    "text": "I think theories of perception shouldn't appeal to prior knowledge to explain it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6511.494,
    "end": 6516.34,
    "text": " And I think one theory that does that is ecological psychology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6516.8,
    "end": 6528.574,
    "text": "By virtue of the lawful relationship between the patterns of light and the environment you have in those patterns of light, information enough as to know exactly what the... To a good degree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6532.173,
    "end": 6539.439,
    "text": " what the real environment is without the need of pulling other kind of knowledge into the equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6539.68,
    "end": 6540.58,
    "text": "And I work on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6541.681,
    "end": 6552.151,
    "text": "So part of my work is trying to make sense of cognitive neuroscience that starts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6552.831,
    "end": 6579.234,
    "text": " with ecological psychology for instance if the brain is not in the business of inferring the real causes of impoverished stimulation or of enriching impoverished stimulation with all their knowledge has to build a model of the environment what the hell is the is is the brain doing right so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6580.242,
    "end": 6583.804,
    "text": " Within the ecological approach, the word uses resonance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6584.484,
    "end": 6590.226,
    "text": "The brain resonates to this richer information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6590.686,
    "end": 6599.93,
    "text": "And part of my theoretical work is to try to operationalize the resonance metaphors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6599.97,
    "end": 6603.332,
    "text": "So how can we have a concept that we can actually test?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6604.341,
    "end": 6614.111,
    "text": " And part of my empirical work, I'm kind of maybe 70% a philosopher, 30% a cognitive neuroscientist, is to try to test that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6614.671,
    "end": 6622.659,
    "text": "So this year I've been in the B-Mobile lab, which is at the Technical University of Berlin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6623.02,
    "end": 6623.38,
    "text": "And they...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6625.757,
    "end": 6627.398,
    "text": " specializing mobile EEG.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6628.599,
    "end": 6640.306,
    "text": "And so I've been gathering some multimodal data that has eye tracking, motion capture, and EEG to try to find what kind of patterns of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6643.191,
    "end": 6645.492,
    "text": " information our brain can be resonating to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6645.832,
    "end": 6655.136,
    "text": "So how the brain dynamics can be constrained by these specific structures and not just by simple input and that kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6655.676,
    "end": 6659.878,
    "text": "So I'm trying to... Last sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6660.478,
    "end": 6671.863,
    "text": "I'm trying to do something like ecological neuroscience, both in the theoretical realm and the experimental realm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6673.168,
    "end": 6673.628,
    "text": " Very cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6674.029,
    "end": 6674.469,
    "text": "Very cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6675.15,
    "end": 6679.274,
    "text": "Jeff, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6680.675,
    "end": 6683.678,
    "text": "So I'm taking the exact opposite approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6683.738,
    "end": 6686.26,
    "text": "I'm trying to see how far we can push this whole prior thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6689.923,
    "end": 6694.628,
    "text": "I like to joke that the difference between a Bayesian and a non-Bayesian is honesty, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6694.948,
    "end": 6695.829,
    "text": "You have priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6696.733,
    "end": 6697.954,
    "text": " I don't know where they come from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6698.014,
    "end": 6699.956,
    "text": "I don't know that they're normative, but they're there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6700.616,
    "end": 6701.617,
    "text": "You're kind of stuck with them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6701.777,
    "end": 6703.238,
    "text": "All knowledge is like Laplace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6703.298,
    "end": 6708.122,
    "text": "All knowledge is probabilistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6708.142,
    "end": 6709.483,
    "text": "It's always based on assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6709.543,
    "end": 6711.765,
    "text": "There are two sets of assumptions that are critical to worry about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6712.025,
    "end": 6714.187,
    "text": "One is, I'm going to get to what I'm doing in a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6715.087,
    "end": 6716.448,
    "text": "One is the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6717.149,
    "end": 6719.691,
    "text": "Any conclusions you draw is conditioned on your observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6720.575,
    "end": 6727.478,
    "text": " But there's another important thing that we often forget about, right, is that all of the conclusions that are also conditioned on your models for the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6727.518,
    "end": 6728.759,
    "text": "And I say models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6729.219,
    "end": 6729.979,
    "text": "This is just my view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6730.319,
    "end": 6731.96,
    "text": "I can see the sentence going, oh, my God.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6733.261,
    "end": 6740.584,
    "text": "When I say models, I actually think the most critical thing that we often neglect when we talk about the Bayesian brain is that there's not one model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6742.505,
    "end": 6743.605,
    "text": "There's a lot of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6744.646,
    "end": 6747.707,
    "text": "And you don't just use one at a time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6749.672,
    "end": 6752.615,
    "text": " You use lots of, you could even think, and this is very coarse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6753.555,
    "end": 6755.337,
    "text": "I literally am going to get to what I'm doing in a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6755.637,
    "end": 6760.761,
    "text": "It's very coarse, but you could think of a Bayesian brain as having brain regions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6761.061,
    "end": 6763.283,
    "text": "And don't over-parse this because I know people will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6764.144,
    "end": 6765.765,
    "text": "And each region is a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6768.044,
    "end": 6771.287,
    "text": " Each region describes is a statistical model of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6771.888,
    "end": 6774.15,
    "text": "And when you get a new task, what do you do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6774.39,
    "end": 6783.18,
    "text": "Well, you have to figure out which collection of models and how they're connected are the ones that solve your problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6785.785,
    "end": 6797.85,
    "text": " or model the data or describe the data or compactly summarize this, like the data compression, but compactly summarize the information that you've received or give you the predictions about the things you care about or however you want to phrase it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6798.671,
    "end": 6807.155,
    "text": "And so what we're trying to do right now is we're exploring, sorry, we're exploring the extent to which we can get this to work at scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6808.956,
    "end": 6812.503,
    "text": " So we want to construct a brain that's not like some fast feed forward neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6813.124,
    "end": 6813.345,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6813.425,
    "end": 6816.692,
    "text": "But one that is more brain like, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6817.202,
    "end": 6842.362,
    "text": " by summarizing what by saying that no no brain has lots of there's lots and lots and lots of models and the way that the brain actually attacks problems is by reasoning by analogy this model explains this part of what's going on this model explains this part of what's going on and the trick is how do you figure out how to connect them and so this is a massive model comparison slash bayesian graph neural networking type problem which is like computationally intensive like that's a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6844.187,
    "end": 6847.589,
    "text": " I'd put that in quotes, like, but it would like, it would be like several sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6847.729,
    "end": 6849.049,
    "text": "That's, that's how much scared it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6849.65,
    "end": 6850.95,
    "text": "Um, that's what we're working, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6850.97,
    "end": 6860.194,
    "text": "We're working on pushing, you know, seeing how far we can really push this Bayesian brain hypothesis, but not just for saying there's a prior by saying there's lots of them and they interact in interesting ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6860.474,
    "end": 6865.536,
    "text": "And at that point, is it still a prior Vicente or has it become something else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6866.337,
    "end": 6866.617,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6866.957,
    "end": 6869.258,
    "text": "I mean, uh, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6870.339,
    "end": 6878.343,
    "text": " This is kind of the agreement I reached with Maxwell, for instance, but with other people there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6878.624,
    "end": 6880.485,
    "text": "Yeah, I mean, I think it is good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6881.285,
    "end": 6889.289,
    "text": "I don't like the idea of prior knowledge or one prior or many of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6889.349,
    "end": 6890.29,
    "text": "I think there are other ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6890.77,
    "end": 6896.994,
    "text": "We like to talk about ecological constraints that are not inside here, out there, blah, blah, blah, blah, blah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6897.314,
    "end": 6897.434,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6899.079,
    "end": 6905.225,
    "text": " What I try to do is no priors, let's see how far I can go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6905.786,
    "end": 6913.653,
    "text": "And it's fair that you guys do, okay, this set of priors, let's see how far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6913.853,
    "end": 6915.135,
    "text": "And that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6915.475,
    "end": 6917.057,
    "text": "I think that's good for science, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6918.858,
    "end": 6920.039,
    "text": "No, that's the whole point, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6920.059,
    "end": 6922.722,
    "text": "Because eventually what we want to do is Bayesian model comparisons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6923.988,
    "end": 6925.389,
    "text": " between your approach and mine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6925.409,
    "end": 6927.37,
    "text": "Cause you know, Bayesian is the only way to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6931.113,
    "end": 6933.434,
    "text": "I think you guys are going to be an absolute pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6933.935,
    "end": 6935.656,
    "text": "Absolute pleasure chatting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6936.397,
    "end": 6938.458,
    "text": "Well, it's no, it's been an absolute pleasure to witness it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6939.218,
    "end": 6942.341,
    "text": "Um, thank you guys for coming on the podcast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6942.781,
    "end": 6950.446,
    "text": "And, uh, I'm sure there are some people out there, devilish people who expected pots and pans to be thrown across webcams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6951.067,
    "end": 6951.447,
    "text": "But, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6952.911,
    "end": 6981.211,
    "text": " you know this is what science is about at the end of the day finding convergent paths and trying to get closer to some approximation of truth so hopefully we've contributed sorry no and you both leaned back simultaneously when I said that word okay something that helps us predict and data compare there you go Jeff but thank you guys again from me and the Institute and yeah everyone listening definitely check out Jeff and Vicente's work so thank you again",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6982.278,
    "end": 6982.509,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  }
]