[
  {
    "start": 31.38,
    "end": 37.307,
    "text": " all right hello everyone welcome to actinflab live stream number 33.1 it's november 23rd 2021 welcome to the actinflab",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 43.991,
    "end": 47.492,
    "text": " first-time participants and returning participants and listeners.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 48.312,
    "end": 53.853,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 54.313,
    "end": 56.453,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 57.694,
    "end": 63.515,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 64.595,
    "end": 70.496,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 72.386,
    "end": 79.973,
    "text": " We are in the final two weeks of November 21 discussing thinking like a state paper of choice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 80.813,
    "end": 90.422,
    "text": "And we have some tentative paper selections for number 34 and likely we'll take a break and start with 35 in the beginning of January 22.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 92.062,
    "end": 95.568,
    "text": " but we're really looking forward to an exciting 2022.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 95.949,
    "end": 102.24,
    "text": "So if you have any ideas for people to invite for other streams, or if you yourself would like to join, then just let us know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 104.141,
    "end": 118.514,
    "text": " Today in ActiveStream number 33.1, we're going to be learning and discussing this very cool paper, Thinking Like a State, Embodied Intelligence in the Deep History of Our Collective Minds, by Avel, aka Serval, Gwen, and Karlu.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 119.335,
    "end": 125.04,
    "text": "And it's just a discussion video, even though we have the author on the stream, which is awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 126.001,
    "end": 128.203,
    "text": "We're pretty much in the dot one, going to...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 129.304,
    "end": 152.365,
    "text": " go over anything that we want to we can return to some keywords and bigger questions that we raised in the dot zero we can add notes for next steps for questions to think about over the coming week to touch on again in the dot two or possible ways somebody could continue this avenue of research and we will be discussing this paper in next week 33.2",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 155.242,
    "end": 160.184,
    "text": " Okay, we'll go around and introduce our panel today.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 160.485,
    "end": 163.486,
    "text": "Everyone can give just a short check-in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 163.866,
    "end": 173.151,
    "text": "They can say hello and something that they remembered from the paper or something that they were excited about to discuss and then pass it to someone who hasn't spoken and then we'll",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 173.891,
    "end": 175.392,
    "text": " conclude with the author.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 175.712,
    "end": 176.933,
    "text": "So I'll start.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 177.533,
    "end": 177.994,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 178.614,
    "end": 180.095,
    "text": "I'm in California.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 180.615,
    "end": 191.241,
    "text": "And just as we were discussing right before we started, I want to explore this aspect of states as anticipatory cognizers, not just reactive cognizers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 191.942,
    "end": 192.983,
    "text": "And I'll pass it to Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 195.979,
    "end": 196.639,
    "text": " Hi, I'm Dean.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 197.2,
    "end": 203.743,
    "text": "I'm in British Columbia and ensconced in a cedar box today out in my cabin.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 204.843,
    "end": 218.37,
    "text": "And I like the paper because I want to see whether or not there are parallels between what happens on an individual level and what happens on more organized levels of individuals.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 218.81,
    "end": 219.791,
    "text": "And I'll pass it over to Blue.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 223.373,
    "end": 226.915,
    "text": " Good morning, or good whatever time of day it is in your world, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.215,
    "end": 227.815,
    "text": "I'm Blue Knight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.875,
    "end": 231.296,
    "text": "I'm an independent research consultant in New Mexico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 231.997,
    "end": 239.2,
    "text": "And I like this paper for many reasons, but my favorite reason is the scale-free aspect of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.74,
    "end": 240.44,
    "text": " self-assembly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 240.92,
    "end": 244.101,
    "text": "So it's self-assembly at a much larger scale than I'm used to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 244.361,
    "end": 247.702,
    "text": "I normally study cells and subcellular organizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 247.762,
    "end": 255.844,
    "text": "So I like how active inference unites the things that I like to study with statehood and larger scale organizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.604,
    "end": 259.505,
    "text": "And I will pass it over to first-time participant Andy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 261.345,
    "end": 261.906,
    "text": "Hello, everybody.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 262.546,
    "end": 263.266,
    "text": "My name is Andy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 263.906,
    "end": 265.666,
    "text": "I'm in Richmond, Virginia.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 266.307,
    "end": 267.567,
    "text": "I'm very interested in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 268.086,
    "end": 272.307,
    "text": " looking at the mechanics of how intelligence works through a collective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 274.248,
    "end": 286.853,
    "text": "Are there universal things that we can just the movement of information through relatively closed systems and how to modify that, the cognition that goes along with it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 287.773,
    "end": 289.333,
    "text": "Now we'll pass it along to Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 292.235,
    "end": 294.255,
    "text": "Hello and good morning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.315,
    "end": 295.476,
    "text": "Stephen here in Toronto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.145,
    "end": 326.275,
    "text": " Yeah, I'm interested in this paper in terms of the scale, the social impact of looking at states and how active inference scales up and also maybe a little bit provocation in terms of like how much are we looking at the dynamic states of organisms or macro organisms and how much are we looking at the state of a dead set of artefacts that helps us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.775,
    "end": 338.427,
    "text": " work with our niche and the scale of working with macro artifacts in a niche as much as macro cognitive agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.788,
    "end": 340.169,
    "text": "So I'd be interested about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.189,
    "end": 345.937,
    "text": "And I'll pass it, I believe, to Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.751,
    "end": 372.988,
    "text": " you steven um i think we've all we non-authors have gone so serval would be awesome just to kind of recap uh hello and what brought you to writing this paper as we kick off the discussion so hello my name is uh i'm training physics epistemology uh weird things and uh what interested",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 373.459,
    "end": 387.852,
    "text": " with this paper is to show that if we accept a naturalist understanding of cognition, which is saying that it is based on actual systems, actual dynamics, then we can't resist the conclusion that social systems are organized in a way that is cognitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.913,
    "end": 399.963,
    "text": "And I found this basic consideration pretty important because then there are no limits, like systems that are cognitive work in the way they are structured to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.632,
    "end": 410.038,
    "text": " and we can change things and we can understand how change will affect how things behave, which is pretty urgent because I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.939,
    "end": 421.725,
    "text": " it's pretty likely that the nation-state systems that is dominant today, nation-state capitalism system, is dying and is basically bringing us with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.345,
    "end": 427.148,
    "text": "So we have to explore the state of alternatives pretty quickly and efficiently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.648,
    "end": 433.552,
    "text": "And this needs a reflective understanding on what the state space is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.813,
    "end": 437.033,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 437.113,
    "end": 437.874,
    "text": "And I think it's a...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 440.126,
    "end": 456.216,
    "text": " a pun or homonym that will return many times what are the states because we talk about partitionings of states a lot in active inference internal blanket external nested systems and now we're talking about the nation states so um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 457.771,
    "end": 459.993,
    "text": " how are social systems cognitive?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 460.233,
    "end": 468.14,
    "text": "We use that state-based partitioning to talk about other cognitive systems, ones that are designed or evolved.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 468.921,
    "end": 475.966,
    "text": "And so we're applying active inference to study the cognitive properties of states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 478.268,
    "end": 484.994,
    "text": "Stephen, and then anyone else, and I'll just keep on adding notes or questions and people can look at it or suggest things in live chat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 485.054,
    "end": 485.595,
    "text": "Go ahead, Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 485.635,
    "end": 485.875,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 487.059,
    "end": 511.585,
    "text": " Yeah, I think it's also cool with active inference is that kind of ontological challenge whereby we're dealing with non-equilibrium dynamical states in a non-linear system which gives rise to pullback attractors which have this non-equilibrium steady state quality where however often states are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.904,
    "end": 521.026,
    "text": " or say we think in quantum theory or something, you know, they're like, it goes from this particular state to that particular state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.266,
    "end": 521.686,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.866,
    "end": 533.949,
    "text": "And so, um, there's, there's also that, um, interpretation of what can be done with states when you start to have nonlinear dynamics at play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.969,
    "end": 537.73,
    "text": "Thanks blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.279,
    "end": 549.307,
    "text": " So something that I've mentioned in the .Zero video that I'm interested in maybe exploring a little bit deeper is like, what do states aggregate into?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 549.807,
    "end": 557.553,
    "text": "So what is like the grander scale if we're all just self-assembling into something and the quantity of states that are produced?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 558.194,
    "end": 565.06,
    "text": "I can't remember who said it, maybe it was Avelle, that states like arise as a result of war.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 565.88,
    "end": 595.515,
    "text": " and um faction and division and so as we are progressing forward in time there's an increased amount of faction and division and like it doesn't matter how homogeneous a population is they will find something to divide about and so like this creates more city states within city states within city states so is there some kind of equilibrium like a tractor space for like the optimal number of states or is it all going to be like unified or is it all going to be dissolved at some point",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 598.646,
    "end": 599.266,
    "text": " Thanks, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.888,
    "end": 602.649,
    "text": "That's actually a good point there, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.729,
    "end": 605.03,
    "text": "There's also something interesting about democracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.07,
    "end": 617.639,
    "text": "They say that for democracy to work, it almost has to be a split of around 45 to 50 between different opinioned parties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.299,
    "end": 622.042,
    "text": "Otherwise, if basically one party is supported by 65, 70% of the people,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.454,
    "end": 631.321,
    "text": " Generally speaking, it doesn't work very well because then there's no dynamic, I suppose, to move backwards and forwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.783,
    "end": 634.865,
    "text": "So I think that's quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.17,
    "end": 646.577,
    "text": "So when we talk about the minimum number of states or entities to exist for democracy to function opinions,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 648.739,
    "end": 658.309,
    "text": " It's interesting, you know, in the system that Mike Levin works with back from our July live stream, the computational boundary of a self, he works in planaria, which are regenerating organisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 658.769,
    "end": 664.435,
    "text": "But you have to have a minimum number of cells and particularly like a minimum number of stem cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.775,
    "end": 671.022,
    "text": "So I think it's like a thousand cells at base and like 120 planarian stem cells or you don't get regeneration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 671.502,
    "end": 687.509,
    "text": " And so like what kind of dynamic is required or how many people, and even for like, you talk about hunter-gatherer organizations, like 50 to 500 people they think made like an optimal hunter-gatherer colony, like less than 50 and you're gonna be eaten by coyotes or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.949,
    "end": 691.69,
    "text": "So where is that optimal number in statehood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.73,
    "end": 692.611,
    "text": "What does that look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 693.471,
    "end": 700.234,
    "text": "Yeah, what aspects of the system are necessary, sufficient, incompatible, at odds with?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 701.32,
    "end": 704.481,
    "text": " certain kinds of regimes of state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 705.182,
    "end": 708.343,
    "text": "And it is really funny how we talk about policy selection.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 708.943,
    "end": 714.806,
    "text": "Policy sounds like it'd be more from international policy than it would be from reaching for your cup of water.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 716.406,
    "end": 719.287,
    "text": "And then we talk about regimes of attention.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 719.488,
    "end": 724.69,
    "text": "Usually people hear regime, they're thinking some historical regime of a state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 725.782,
    "end": 728.903,
    "text": " Whereas regime of attention doesn't necessarily carry that connotation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 729.744,
    "end": 732.845,
    "text": "So linguistically, there's a lot of contact points.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 733.605,
    "end": 743.069,
    "text": "And that's why I think it was an awesome contribution by Serval was to just draw those out, ground it in the physics of critical systems and of cognitive systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 743.729,
    "end": 750.492,
    "text": "And that's what is contributing to hopefully some of the ways we'll explore it's going to be used going forward.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 751.052,
    "end": 752.733,
    "text": "So Dean and then Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 755.854,
    "end": 770.161,
    "text": " Yeah, this might sound like pushback or challenge or whatever, but it's just I have a personal issue with the entire idea of scale-free, like that there's some sort of invariance across scales.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 770.521,
    "end": 779.325,
    "text": "And I think that like when we see, for example, a lowercase a morph into an uppercase A,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 781.046,
    "end": 804.991,
    "text": " even though they are of the same categorical type and fit in the same place in the alphabet, there is a change that goes on and so there is a scale variance aspect to this that I think... So again, this is my sense of it as opposed to sort of the agreed sense that there's a scale-free process in play.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 805.731,
    "end": 809.852,
    "text": "The other thing I would wonder a little bit about is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 811.582,
    "end": 826.556,
    "text": " When we take a constructivist view, a city as built, I'm not sure what happens to the bidirectionality that Active Inference affords.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 828.077,
    "end": 846.21,
    "text": " So, again, I'm not saying that we can't find qualities in both, but I'm not sure that a city as a reflection of something constructivist is necessarily how living things reflect and predict.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 846.55,
    "end": 849.412,
    "text": "But again, I'm open to having my mind changed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 849.432,
    "end": 851.374,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 851.714,
    "end": 854.396,
    "text": "Stephen, and then I'll have a comment on the constructivism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 856.741,
    "end": 881.238,
    "text": " I was just also think it's a good point we blew about the Mike Levin's work and the question of how things are scaling up and of course the big thing that Mike Levin did mention that you know they've got these quite a lot of ideas around how things grow multiply and relate but no idea how they stop and that's kind of also interesting in terms of you know when we think about scale it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.301,
    "end": 887.846,
    "text": " Has the organism reached its point because the top scale, the maximum scale, has kind of been reached?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.466,
    "end": 895.473,
    "text": "Or is there some sort of, is it that it's the dynamics at a mid-scale, which is like an action scale?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.313,
    "end": 902.299,
    "text": "So it's not that it's ever arrived at its thing, it's just arrived at its meso-action policy landscape,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.819,
    "end": 917.834,
    "text": " which is available and you know is that availability then understood from what's inside or is it something that's checked to something external in the environment so that that i think is an interesting question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.145,
    "end": 934.211,
    "text": " thank you um capitalizations yeah you have to the state capital capital punishment there's so many um other funny word plays but to the constructivist comment so um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 935.666,
    "end": 956.237,
    "text": " one sort of simple constructivism would be like i mean there weren't bricks there and now there are so the city was constructed and now it's the scaffold for us to interact in so you asked dean where's that bi-directionality so i think there's a few ways to talk about the bi-directionality so first is niche construction",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 957.601,
    "end": 978.178,
    "text": " be a symmetric relationship we talk about the agent modifying the niche and the niche is modifying the agent and so it's like you have the blanket as the interface and then there are action and inference on both sides of the blanket being used as an as an interface and so it's more like a co-constructionism",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 978.979,
    "end": 990.342,
    "text": " But if, you know, Lego set A is building B while B is building A, that starts looking more like interactionism because it's not just instructions, put the brick here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 991.143,
    "end": 994.764,
    "text": "It's a specification of a protocol and an interface for interaction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 995.304,
    "end": 1003.086,
    "text": "And that's what opens the door to improvisation and to other kinds of dynamics that aren't just simply like assembly of the 3D printer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1003.766,
    "end": 1008.108,
    "text": "And then the other point, and then Dean, is it reminds me of Dennett's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1009.926,
    "end": 1022.701,
    "text": " 1995 book, Darwin's Dangerous Idea, where he talks about basically two ways that you can talk about the appearance of design in natural systems, which are cranes and sky hooks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1023.222,
    "end": 1026.666,
    "text": "And so if you look at a skyscraper, you think, how could that have appeared?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1027.086,
    "end": 1030.347,
    "text": " One approach is they built a crane to put that last top piece on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1030.667,
    "end": 1034.229,
    "text": "And if that crane was too big to construct, then a smaller crane built that crane.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1034.449,
    "end": 1044.073,
    "text": "So you can have a cranes all the way down, like small things were built and scaffolds were in place that were removed later to result in this skyscraper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1044.993,
    "end": 1051.236,
    "text": " Or you can just cut the knot and just say, well, maybe there was a skyhook and they just latched it to the sky and then built it down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1051.696,
    "end": 1064.021,
    "text": "So that's like top-down constructivism appeals to skyhook technology, whereas bottom-up emergent process-based co-constructivism appeals",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1064.281,
    "end": 1085.571,
    "text": " is more of a crane based approach so i think that's a very good point how even with constructivism we can still retain a lot of the important aspects of constructivism like physical construction but we don't need to fall into a uni-directional um or a top-down trap so dean what do you think about that and then stephen or anyone else",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1090.829,
    "end": 1100.552,
    "text": " I think the important point, Daniel, is what you just mentioned, which is the trap of prematurely collapsing to the top-down privilege.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1102.372,
    "end": 1119.737,
    "text": "For example, if you go just outside of Denver, you end up in a place called Red Rocks, and then the question becomes, did somebody enact Red Rocks because they put a stage at the base of an amphitheater, or did Red Rocks enact",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1121.388,
    "end": 1141.942,
    "text": " everybody who was attracted to that place and so all i'm basically suggesting is is is when we look at how things are constructed we don't want to lose sight of the fact that sometimes things construct us as well so the skyhooks aspect of it thank you dean stephen",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1144.418,
    "end": 1150.267,
    "text": " And also, I mean, cranes and sky hooks, it gives that idea of how it links in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.287,
    "end": 1152.85,
    "text": "They're also dead items, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.87,
    "end": 1155.294,
    "text": "So they're both tools or they're both objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.415,
    "end": 1169.085,
    "text": " And we can bring in sky hooks, which might be informational instructions, or cranes, which are places to carry the bricks that are going to build things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.665,
    "end": 1174.269,
    "text": "But I think that when we talk about that Markov blanket and what goes both ways is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.709,
    "end": 1205.005,
    "text": " yes i think when we're dealing particularly with dead things like bricks and that we construct an environment now it's a bit more complicated when we impact an environment that also grows and changes and is alive however when something comes back the other way from the environment is it constructing us or is it scarring us or is it giving us lots of little punches in the gut in which we heal so i'm wondering whether the other direction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.556,
    "end": 1212.458,
    "text": " It can't construct us, but what don't kill us makes us stronger type of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.698,
    "end": 1215.238,
    "text": "Thanks, Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.079,
    "end": 1217.159,
    "text": "Um, Andy, please.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1217.919,
    "end": 1227.982,
    "text": "Dean, I think in the context of cognition and the state, the specific, um, the element that's missing, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1228.082,
    "end": 1231.263,
    "text": "Is what's the relationship between the nation and the state, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1231.96,
    "end": 1237.862,
    "text": " So the nation would be the bottom up information or the bottom up cognition and the state could be theorized now as the top down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1238.502,
    "end": 1240.163,
    "text": "And then broadly speaking, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1240.303,
    "end": 1245.524,
    "text": "The nation creates the state, the state, the existence of the state changes to circumstance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1245.764,
    "end": 1254.927,
    "text": "The changes in circumstance forces the nation, the nation, the people to rethink how they're operating in the world around them because their circumstances have been modified.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1255.468,
    "end": 1259.769,
    "text": "And now you have this constant bi-directional relationship between bottom up and top down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1260.273,
    "end": 1264.515,
    "text": " in the context of state versus nation and modifying circumstance over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1266.655,
    "end": 1267.016,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1267.616,
    "end": 1267.876,
    "text": "Luke?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1268.756,
    "end": 1269.316,
    "text": "Dean, go ahead.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1269.717,
    "end": 1270.057,
    "text": "Yeah, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1271.157,
    "end": 1278.08,
    "text": "Yeah, Andy, I like what you're saying, except it's already collapsed to an A to B relationship.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1279.224,
    "end": 1285.126,
    "text": " And I think what active inference allows for is to keep things up on a generalized, abstracted level.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1285.206,
    "end": 1297.109,
    "text": "It doesn't have to be, here's the nation A and here's the people B. That's the difference, essentially, is if you want it to be an A and B thing, go ahead.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1297.169,
    "end": 1300.09,
    "text": "That's good for argument's sake.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1300.17,
    "end": 1305.312,
    "text": "But in fact, what active inference does is it keeps one side of this open.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1306.172,
    "end": 1330.828,
    "text": " and not necessarily specific it keeps it in order to be predictable it asks the counterfactual what if as opposed to having that pre-presented as the relationship and it's new it's a new type of relationship that's arising and i think that's right explored in the paper in the deep history",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1332.054,
    "end": 1348.634,
    "text": " section there's really the specifics there's the minute particulars of the specific states that we have and typified by West Falia and a bunch of other historical events that the specifics matter we're in a complex system the trajectory really does matter blue",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1351.212,
    "end": 1352.813,
    "text": " So I totally forgot what I was going to say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1353.993,
    "end": 1355.994,
    "text": "But I would like to maybe challenge Andy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.174,
    "end": 1360.076,
    "text": "What is the difference between the nation and the state?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1360.497,
    "end": 1366.219,
    "text": "Is the nation the people that make up the state, and then the state is the collective of the people?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.42,
    "end": 1373.883,
    "text": "Is it like a part-whole concept, or are they two separate larger entities, and people make up both?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.185,
    "end": 1379.186,
    "text": "So words",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1380.828,
    "end": 1383.329,
    "text": " depending on which definitions you go with, it gets a little bit squishy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1383.409,
    "end": 1387.591,
    "text": "In the context that I use them, state is a construct.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1389.172,
    "end": 1398.096,
    "text": "The political organization of a people is downstream of the shared identity of the people, of a people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1398.576,
    "end": 1410.562,
    "text": "So the nation would be broadly the largest sense of shared self distributed among a relatively closed system in this regard, and the state being the construct by which these people organize their affairs inside of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1411.072,
    "end": 1411.752,
    "text": " their nation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1412.853,
    "end": 1414.734,
    "text": "That's a relatively new idea, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1414.914,
    "end": 1419.977,
    "text": "The idea of a nation and the nation-state is relatively new as far as an overt construction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1421.218,
    "end": 1427.281,
    "text": "Beforehand, in the age of absolute monarchy, there was no separation between the state and the people, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1427.341,
    "end": 1429.983,
    "text": "It was all embodied in the person of the sovereign.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1431.383,
    "end": 1439.448,
    "text": "So, different historical contexts, different periods of time, different cultural contexts now, you might get different definitions, but in the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1439.861,
    "end": 1448.344,
    "text": " The way in which I was using it, the state would be a policy requirement of the culture in which it was born, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1448.744,
    "end": 1455.486,
    "text": "It's why American democracy functions significantly better than South Sudanese democracy, even though they have literally the exact same institutions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1458.227,
    "end": 1461.888,
    "text": "So Daniel, maybe you want to flip to slide 33, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.167,
    "end": 1471.53,
    "text": " Like, where we, like, kind of show in the paper all of the, like, things that go into, like, the production of a state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.59,
    "end": 1475.892,
    "text": "And so, like, I'm curious as to, like, where nation fits into this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.612,
    "end": 1478.493,
    "text": "Is it, like, in the collective identity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.633,
    "end": 1483.715,
    "text": "Or is it, like, a relationship between, like, nation and collective identity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.815,
    "end": 1485.255,
    "text": "Or just what your thoughts are on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1487.276,
    "end": 1487.936,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1487.956,
    "end": 1490.677,
    "text": "Collective identity to me would be the definition of a nation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1490.697,
    "end": 1492.338,
    "text": "Shared sense of self.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1493.044,
    "end": 1499.611,
    "text": " Everything else are things that you may or may not need a state to accomplish that may or may not be more efficiently conducted in the auspices of a state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1501.674,
    "end": 1509.583,
    "text": "Control the monetary flow, you probably need something as sophisticated as a state, but to transfer resources back and forth, you don't.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1509.623,
    "end": 1512.326,
    "text": "You can grow grain and you can trade it for meat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1513.647,
    "end": 1514.308,
    "text": "Go ahead.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1515.575,
    "end": 1522.981,
    "text": " Just the collective identity I'm just thinking about in organism and the liver and the bone cell.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1523.081,
    "end": 1527.245,
    "text": "It's like collective identity doesn't mean identical phenotype.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1528.226,
    "end": 1535.332,
    "text": "And so it makes me think of a cultural memory where each person, maybe there's a few touchstones that 80% of people know about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1537.213,
    "end": 1542.257,
    "text": "Increasingly though, there's less and less shared information amidst",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1543.206,
    "end": 1544.887,
    "text": " the informational changes that are happening.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1545.427,
    "end": 1558.054,
    "text": "So what does that mean when everyone's only gonna have a little partial facet of the collective memory on board, but maybe they can enact broader processes that are truly collective?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1558.575,
    "end": 1565.279,
    "text": "So how do we respect differences and shared aspects across multiple levels?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1566.539,
    "end": 1571.162,
    "text": "So Blue and Dean, and then Serval, I wanna hear what you're thinking about this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1573.148,
    "end": 1589.815,
    "text": " So just like Daniel, how you were talking about like the bone and the liver cells, like making up an organism, you know, I think that that speaks here to what's the specialized roles and like the density of settlements enables that like functional specialization and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1590.799,
    "end": 1597.842,
    "text": " like you can have a blacksmith and a shoemaker and a farmer and everybody takes on their own little role and then goods can be redistributed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.962,
    "end": 1603.564,
    "text": "So it just like reminded me of that and like that functional specialization and the importance of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1604.825,
    "end": 1605.385,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1605.725,
    "end": 1608.586,
    "text": "Dean, and then Serval or Pass.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1611.047,
    "end": 1616.31,
    "text": "Yeah, when I was watching the 33.0 and I saw this slide, thank you, Blue, for asking for it to be...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1617.847,
    "end": 1619.348,
    "text": " brought back again here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1619.928,
    "end": 1625.37,
    "text": "This is again, a specific to a specific, because it's historical and it's reflective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1626.31,
    "end": 1633.212,
    "text": "And the fact that we can look at things and say, this is what happened, we can look back on them.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1633.693,
    "end": 1639.875,
    "text": "I'm not sure we want to necessarily conflate that with active inference, which is about the recursion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1640.895,
    "end": 1642.797,
    "text": " So, this is what happened.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1643.318,
    "end": 1650.826,
    "text": "We can see how things moved across a timeline from point A to point B, a city-state evolved.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1651.246,
    "end": 1656.832,
    "text": "But is that recursion, which is what active entrance is about, which is variation upon variation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1657.893,
    "end": 1660.716,
    "text": "I'm not, again, I ask, is that recursion?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1662.253,
    "end": 1676.46,
    "text": " I know how we can diagram it and represent it, but is that representative of what actually occurs in recursion when certain thresholds appear and then just as quickly disappear?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1681.122,
    "end": 1681.603,
    "text": "Interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1681.843,
    "end": 1686.245,
    "text": "So, Serval, if you'd like to add anything, and then Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1688.055,
    "end": 1717.687,
    "text": " so there are a lot of threads that were opened what are you asking my opinion about um i think part would be just uh on nation and state similarities differences um what is and what if and then more on this sort of integration slide where does active inference come into this tying of the knot how does active in france uh about nation i don't think it does",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1719.305,
    "end": 1723.867,
    "text": " A nation is simply a collective identity that is related to a political entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.887,
    "end": 1734.271,
    "text": "It's a community of peers that happen to have some stakes and power over the behaviour of an institution, that is a state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.231,
    "end": 1738.773,
    "text": "And the fact is that nations are not universal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.793,
    "end": 1743.095,
    "text": "You have a lot of states that are not nation-states, that are not related to a community of peers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.135,
    "end": 1743.595,
    "text": "For example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.585,
    "end": 1746.546,
    "text": " the Roman Empire.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.846,
    "end": 1759.852,
    "text": "It was an empire, which means that you have people who get the power that form a group that is the Roman, and you have all the rest of the people that exist in there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.972,
    "end": 1766.095,
    "text": " that also are ruled by the empire that is dominated by the Romans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.696,
    "end": 1772.92,
    "text": "So you do not have a community of interests that is related to a state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1773.12,
    "end": 1776.902,
    "text": "You have an ethnic group that dominates other ethnic groups through a state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.643,
    "end": 1785.167,
    "text": "Nations are not... They are not invariant aspects of what a state is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1786.088,
    "end": 1787.048,
    "text": "However, they are...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.896,
    "end": 1800.463,
    "text": " collective identity, or at least ways to build boundaries between an in-group and an out-group, they seem to be an invariance of efficient human collective action according to Ostrom's principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.504,
    "end": 1815.392,
    "text": "So, there may be more tendency to build nations, to build nation-states, when you have more important between-group selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.293,
    "end": 1816.433,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.805,
    "end": 1830.191,
    "text": " It is said that, I don't know of any computational quantitative work that suggests it, but it is said that modern Europe is pretty extreme in terms of between-group conflicts of war.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.792,
    "end": 1845.158,
    "text": "Because the diamond agreement is that the geography basically enables trade at great scales, but prevents the constitution of an empire in Europe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.393,
    "end": 1867.328,
    "text": " Historically, there were a lot of states in Europe as compared as, say, in China, where you have a big state that is, I don't know, in terms of surfaces, maybe two or three times like Western Europe is, and more integrated than what you can have in South America because of the mountains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1869.633,
    "end": 1880.359,
    "text": " So you have a pretty ideal regime to get a lot of intergroup conflicts and to get a selection regime that favors nations, organic nations that somehow collate with states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.94,
    "end": 1885.843,
    "text": "And that's what happened to be instituted through, I don't know, Westphalia, the French Revolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1886.483,
    "end": 1887.724,
    "text": "I don't know the story of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.924,
    "end": 1890.206,
    "text": "There are a lot of pathways in Europe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.246,
    "end": 1905.911,
    "text": " but in Europe you've got national states that originated, you've got pretty aggressive kinds of imperialism that originated, and both can be traced, I think, to an intense regime of selection of war.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.671,
    "end": 1918.355,
    "text": "And you have reasons that tend to say that war explains, in the sense, predicts more political complexity, which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.79,
    "end": 1929.585,
    "text": " uh a debatable construct that basically maps this kind of integration of a society so the uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.407,
    "end": 1945.66,
    "text": " History of Europe, of modern Europe specifically, and medieval Europe and everything past the Roman Empire, would have selected for both nations and aggressive kinds of imperialism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.341,
    "end": 1949.524,
    "text": "And this is the kind of organization we get to live in now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.025,
    "end": 1953.568,
    "text": " Thank you, Serval.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1954.129,
    "end": 1962.042,
    "text": "Just like the ecological regularities through evolutionary time scaffold the evolution of an organism's cognition,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1962.708,
    "end": 1977.176,
    "text": " This is a transposition of that argument to the biogeographical and contextual and ecological factors that give rise to and scaffold the development of states as things, as cognitive entities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1977.797,
    "end": 1978.757,
    "text": "There are some parallels there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1979.278,
    "end": 1980.418,
    "text": "So it's an awesome point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1980.498,
    "end": 1980.819,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1981.379,
    "end": 1982.6,
    "text": "Blue, and then Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1985.741,
    "end": 1992.903,
    "text": " There is a pretty important thing to say, that is, a state does not actually correspond to a nation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.343,
    "end": 2001.005,
    "text": "Maybe states have original nations, maybe they are associated to nations now, but a state need not entail a nation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.105,
    "end": 2010.028,
    "text": "You can have a state of a specialist in the cultural population, you can have a state, well, that's kind of the usual deal, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.392,
    "end": 2017.514,
    "text": " A nation is a collective identity in a community of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.795,
    "end": 2033.821,
    "text": "A state is a control system built from administration and it can be and often is captured by an elite that is ethnically, socially and in terms of cultural norms, pretty distinct from the people it controls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.819,
    "end": 2036.58,
    "text": " Chicken and the egg.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2037.42,
    "end": 2039.821,
    "text": "Egg as the secreted state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2040.642,
    "end": 2042.503,
    "text": "Chicken as the life form.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2042.963,
    "end": 2044.104,
    "text": "But then there's a co-evolution.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2044.464,
    "end": 2046.786,
    "text": "So that paradox stands there too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2047.286,
    "end": 2048.987,
    "text": "Blue, Stephen, and Andy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2050.088,
    "end": 2052.629,
    "text": "I'm going to defer and come back around to my idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2053.09,
    "end": 2054.571,
    "text": "So Stephen, and then Andy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.932,
    "end": 2061.615,
    "text": "I think the whole scale question is very interesting here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.723,
    "end": 2072.329,
    "text": " where it sort of, so often, I mean, in the European Union, you've got the European Union, it's kind of a reunion of pluralistic partners is the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.67,
    "end": 2077.553,
    "text": "And you've got this tension where one side is basically saying, no, you're not, you're a state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.554,
    "end": 2081.676,
    "text": "And we want to be a nation, an independent nation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.696,
    "end": 2082.817,
    "text": "There's this tension, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.837,
    "end": 2084.759,
    "text": "Between, no, we're a union, we're a union.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.139,
    "end": 2089.726,
    "text": " And when actions are working, that works, the union, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.806,
    "end": 2094.654,
    "text": "And so I think that there's a scale where people try and work at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.914,
    "end": 2098.901,
    "text": "And the rate at which people work at, what's the dynamics of people...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.117,
    "end": 2105.48,
    "text": " In the same way that when you have, politics seems to have a very slow trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.0,
    "end": 2110.203,
    "text": "You know, things shift, you have the state, you have your identity of your party.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.723,
    "end": 2117.867,
    "text": "However, nearer an election, a week, this phrase is a week is a long time in politics, and it is near an election.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.728,
    "end": 2120.529,
    "text": "The dynamics start to become much faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.391,
    "end": 2122.832,
    "text": " things can change much quicker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.472,
    "end": 2128.894,
    "text": "So this scale question, again, comes in is what is a unit of identity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.335,
    "end": 2131.175,
    "text": "How does it manifest at different rates?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.256,
    "end": 2141.96,
    "text": "And just one other thing in terms of identity is in participatory community-based action research,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.127,
    "end": 2147.709,
    "text": " They talk about community as actually a unit of identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.249,
    "end": 2159.373,
    "text": "It's almost like there's so many different types of fluidity at the community level and overlaps between communities that it becomes a unit of identity to actually work with in measuring stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.134,
    "end": 2162.735,
    "text": "We tend not to do that at the higher level of the nation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.775,
    "end": 2164.936,
    "text": "It's just the flag is a unit of identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2165.845,
    "end": 2168.286,
    "text": " It's a very, which hasn't maybe changed in a hundred years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.386,
    "end": 2178.909,
    "text": "So it's an interesting, um, as well as the, you know, what, how much can things change and how much of the ability things to change caught up in the artifacts that embody them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.01,
    "end": 2185.591,
    "text": "The artifacts that constitute them in some case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2187.092,
    "end": 2189.933,
    "text": "So Andy, any comments or to blue?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2191.473,
    "end": 2191.653,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2191.833,
    "end": 2192.173,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2192.193,
    "end": 2193.594,
    "text": "Um, so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2194.75,
    "end": 2197.772,
    "text": " I was going to, well, let's go with what you just said, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2198.973,
    "end": 2202.936,
    "text": "Smallest element of action in this context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2204.357,
    "end": 2208.359,
    "text": "Identity is the smallest element of action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2209.08,
    "end": 2213.243,
    "text": "However, it is guided or bounded, right, by its ability to affect change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2213.863,
    "end": 2220.848,
    "text": "So if you deeply identify with one other person in this world, the two of you are the small that you have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2221.748,
    "end": 2223.99,
    "text": "Identity becomes basically shorthand for interest.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2224.284,
    "end": 2230.348,
    "text": " We two people, by calling ourselves a group, have a certain worldview and a certain desire to see our interests achieved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2230.829,
    "end": 2233.17,
    "text": "We have the capacity of two people to accomplish that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2233.871,
    "end": 2236.533,
    "text": "So what is our ability to affect change at that scale?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2237.033,
    "end": 2241.676,
    "text": "Relatively small once you're talking about anything larger than interpersonal relationships, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2243.457,
    "end": 2252.924,
    "text": "But it doesn't change the fact that your identity is shorthand for your interests and that we all, at whatever level or scale we're operating at, are pursuing our interests to the best of our abilities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2253.325,
    "end": 2254.506,
    "text": " bounded by relative power.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2257.007,
    "end": 2261.53,
    "text": "But this idea of nation versus statehood, Serval, you're absolutely right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2261.73,
    "end": 2263.731,
    "text": "The state is a thing independent of a nation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2263.811,
    "end": 2270.315,
    "text": "Sometimes they correspond, and typically we say that that's a good fit, because otherwise it's an empire.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2271.176,
    "end": 2282.082,
    "text": "Otherwise it is somebody else's ideas of what constitutes right or wrong in terms of projected values or institutionalized values.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2282.605,
    "end": 2288.488,
    "text": " that are now imposed on you because the state is not representative of your cultural worldview or your shared identity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2288.848,
    "end": 2291.989,
    "text": "It is something provided to you by somebody else's in the form of empire.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2292.77,
    "end": 2303.995,
    "text": "But the question that I had, right, going through the slides, there was this idea that the state as a top-down hierarchical control system, what is then nation or what is then identity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2304.715,
    "end": 2309.277,
    "text": "How does that function in the sharing of information and cognition relative to the state?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2312.179,
    "end": 2314.741,
    "text": " Thanks for the text-driven question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2314.941,
    "end": 2322.045,
    "text": "It was a core argument of the article, just to quote, that states can be and should be understood as hierarchical control systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2322.846,
    "end": 2327.809,
    "text": "So, Avel, if you want to give a direct response, otherwise, Dean in blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2330.163,
    "end": 2337.866,
    "text": " So there is a great response, which is that to talk of hierarchical control system is basically to talk of top-down control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.906,
    "end": 2345.49,
    "text": "This is, I think I've reframed the same point, the same thing, in saying those both words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.51,
    "end": 2349.952,
    "text": "And of course, there is no cognitive system that is pure top-down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.412,
    "end": 2352.072,
    "text": "Well, there are, they do not work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.533,
    "end": 2354.814,
    "text": "They live in labs and they are not useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.094,
    "end": 2383.646,
    "text": " uh so basically uh the organic uh organization of whoever happens to have a say in what the state is is the at least the ascending dynamics in the collective brain they are what affects uh in bias in terms what uh change the priors and the policies etc etc so in the case where you have a defined nation a defined entry group",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.298,
    "end": 2389.765,
    "text": " that happens to control the state, which I'd say is exceptional from what I've read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.026,
    "end": 2398.114,
    "text": "You can't say that there is a meaningful nation-state fit and the nation is basically the brain and body of the state in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.312,
    "end": 2406.234,
    "text": " well, the ascending dynamics that influence what the control systems does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.394,
    "end": 2417.938,
    "text": "In most cases, you will have, I'd say, a pretty much stronger decoupling because basically only elites would get a say in what the state does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.298,
    "end": 2424.8,
    "text": "And in societies where, in most societies, the elite is not a defined ethnic group,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.416,
    "end": 2443.964,
    "text": " In that case, you will not have a clear fit between a nation and a state, although, of course, the committee of power that defines the state, if you conceive it as a nation, will define what the state's priorities are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.425,
    "end": 2448.627,
    "text": "Well, participate to define, because, of course, they are the tool that's there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.188,
    "end": 2450.528,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2450.808,
    "end": 2451.588,
    "text": "So awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2451.608,
    "end": 2452.329,
    "text": "A lot of hands.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2452.389,
    "end": 2454.59,
    "text": "So Dean, then Blue, Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2457.289,
    "end": 2460.531,
    "text": " So I want to just circle back to what Andy just said.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2461.092,
    "end": 2474.701,
    "text": "Andy, if you go and look at this live stream three hours from now, even when you see a perfect reflection, we'll assume that this YouTube video comes out exactly as it intended.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2474.721,
    "end": 2482.486,
    "text": "I think what you just said proves that we're not talking about scale-free, we're talking about scale-friendly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2483.246,
    "end": 2487.27,
    "text": " because what you will see is not what you just did.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2488.551,
    "end": 2494.236,
    "text": "And so I think that that has a huge bearing on this idea of what we're talking about here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2494.696,
    "end": 2506.387,
    "text": "We can shape-shift into what Stephen Silet has pointed out here, is that that fact that we can fill between these two levels of scale,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2507.608,
    "end": 2510.69,
    "text": " doesn't mean that it's one size fits all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2511.311,
    "end": 2516.194,
    "text": "It quite literally means is that we can fill, we can change, we can modify.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2516.214,
    "end": 2534.066,
    "text": "And I think that's recursion in its essence, as opposed to taking a reflection and knowing that the next time we look at that, it's going to be different because there's some elapsed time between the moment we said it and then the moment we heard ourselves say it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2535.76,
    "end": 2539.963,
    "text": " Dean, I think that's an awesome point with scale-free and scale-friendly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2540.523,
    "end": 2548.489,
    "text": "Scale-free, people usually mean to say that the mathematics or the formalism doesn't have an a priori system of interest or scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2548.549,
    "end": 2552.011,
    "text": "Like this is a centimeter theory or this is a kilometer theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2552.311,
    "end": 2556.354,
    "text": "So it's scale-free because it doesn't have that a priori reference scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2556.754,
    "end": 2564.159,
    "text": "But then scale-friendly, it's almost like, how about you tell me what scales you've identified and let's make them friends.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2565.04,
    "end": 2567.461,
    "text": " through interaction and iterated modeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2567.801,
    "end": 2574.324,
    "text": "And so we're friendly to scale and scaling, but that doesn't necessarily mean it's free.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2574.764,
    "end": 2583.508,
    "text": "Although from the other side, it's also fair to say that it's a scale-free framework in the way that a Bayesian computational framework or even a linear model is scale-free.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2583.828,
    "end": 2588.67,
    "text": "It doesn't a priori say that kilometer is the default unit for linear regression either.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2589.41,
    "end": 2590.551,
    "text": "Blue, and then Steven.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2593.675,
    "end": 2598.499,
    "text": " So I think what I'm going to say is going to touch on the comments that were made by both Andy and Serval.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.039,
    "end": 2613.611,
    "text": "First of all, in terms of this relationship, like the mutual interest being the fundamental unit of identity and like collective identity, this really goes back to expansion of your cognitive boundary beyond yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.991,
    "end": 2618.275,
    "text": "And like when we were talking about the computational boundary of a self, again, I'm going to like always refer to that live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2618.775,
    "end": 2623.86,
    "text": " But there's an informational sharing when there's an identity sharing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.22,
    "end": 2636.631,
    "text": "So when you expand your cognitive boundary to include more than just yourself, like if you have like a really deep connection, a really deep relationship with one person, you have like a great degree of mutual information between you and that one person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2637.012,
    "end": 2640.395,
    "text": "And then so say you have like a family unit or like a network of close friends.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.695,
    "end": 2643.718,
    "text": "There's a large degree of informational sharing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.538,
    "end": 2652.781,
    "text": " And so in this sense of building a nation, like the fundamental unit of identity then maybe is actually informational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2653.142,
    "end": 2662.725,
    "text": "So it goes back to like Bayesian principles where there's this informational sharing that then allows you to update your generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2663.706,
    "end": 2665.066,
    "text": "So just to kind of speak to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2665.126,
    "end": 2669.208,
    "text": "And then also maybe to just like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2669.728,
    "end": 2685.003,
    "text": " maybe help Andy make the link between downward causation imposed by a government or a hierarchical control institution and the emergence that happens when people come together and share information in a collective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2685.343,
    "end": 2690.608,
    "text": "There's a super cool paper by David Krakauer called The Information Theory of Individuality,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2691.108,
    "end": 2704.999,
    "text": " And it talks about, like, in order to become an individual, and there are many different kinds of individuals, but in order to become an individual, there has to be, like, a bidirectional information flow that's both emergent, starting with, like, the fundamental units, like the people sharing information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2705.019,
    "end": 2707.06,
    "text": "There's an emergent and then a top-down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.12,
    "end": 2708.441,
    "text": "So bottom-up and top-down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.501,
    "end": 2719.73,
    "text": "And, like, when you have this bidirectional information flow, that's, like, what allows you to form a boundary, I guess, around your collective, something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2721.089,
    "end": 2721.549,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2721.889,
    "end": 2724.63,
    "text": "Blue, Stephen, and then anyone else?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2727.632,
    "end": 2744.719,
    "text": "Yeah, so picking up what Dean said there, and so, yeah, there's, and actually Blue and everyone else is, the formulism is scale free at the free energy principle, and then you get into applied active, so then you get into active inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.31,
    "end": 2748.334,
    "text": " which has a sort of a scale free quality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.374,
    "end": 2750.779,
    "text": "And then you get into adaptive active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.874,
    "end": 2758.479,
    "text": " And then you get into, you know, inaction of adaptive active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2758.559,
    "end": 2762.262,
    "text": "And then you get organisms like us that want to apply active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.822,
    "end": 2768.346,
    "text": "And I think it does like really start to go scale friendly once you start to go up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.106,
    "end": 2776.312,
    "text": "And one thing that I find interesting, I've been, this actually is nicely, it ties into this infusion space work that I do, but I look at the face",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.782,
    "end": 2804.662,
    "text": " the body so at the there's a particular scale at which my mind is embodied and you can see it and the bit that you see is the bit that we show on this screen you're not looking at my foot or my shoulder or my hands you're looking at the face the face is the embodiment of my mind as an identity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.776,
    "end": 2805.976,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.996,
    "end": 2809.398,
    "text": "This is my projective identity and it becomes very useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.018,
    "end": 2819.883,
    "text": "So it's, it's scale friendly at that scale, but you know, until the other scales of my body aren't, you know, my liver doesn't do a great job of my identity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2819.903,
    "end": 2820.243,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.663,
    "end": 2823.105,
    "text": "And then we got, okay, what scale do I have to get to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.165,
    "end": 2823.865,
    "text": "I'm talking around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.265,
    "end": 2828.988,
    "text": "If I'm just talking one-on-one, I don't sit here waving a Canadian flag or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.008,
    "end": 2831.449,
    "text": "Right now, if I'm a crowd of a thousand,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.765,
    "end": 2835.547,
    "text": " Now maybe we need to have a big flag on a stick, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.888,
    "end": 2838.53,
    "text": "And that becomes my face, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.57,
    "end": 2840.111,
    "text": "That becomes my projection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.752,
    "end": 2847.878,
    "text": "But that's a scale friendly because now I've, again, it's kind of gone in and recapitulated in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.679,
    "end": 2849.82,
    "text": "So that's kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.001,
    "end": 2851.321,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.002,
    "end": 2852.822,
    "text": "Thank you, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.263,
    "end": 2853.563,
    "text": "Sir Valk?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.097,
    "end": 2871.925,
    "text": " I don't really get the debate about a scale-free, scale-friendly thing, because what a scale-free theory is, is a theory that is, in principle, a formalism that's in principle, it's not a really different scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.006,
    "end": 2873.206,
    "text": "For example, I have a position to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.828,
    "end": 2886.539,
    "text": " the weak and strong forces that only have a measurable effect at very small spatial scales, gravitation and electromagnetism that can influence things that are pretty much afar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.939,
    "end": 2899.811,
    "text": "Well, not electromagnetism because you have the mutual concerning of plus and minus charges, but in principle it could affect things at distance because of the air square.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.349,
    "end": 2911.91,
    "text": " And the fact that you have a theory that is scale-free does not entail that every system where you express the theory is scale-free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.93,
    "end": 2924.393,
    "text": "For example, you have the gravitation theory that is scale-free, but if you study the solar systems, it has a scale, which is about the distance from the Sun and the further thing apart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.453,
    "end": 2927.334,
    "text": "If you study electromagnetic motor,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2927.975,
    "end": 2930.817,
    "text": " it has a scale which is, well, the size of the matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.658,
    "end": 2938.883,
    "text": "And if you study a biological organism with a scale pre-formalism, it has a scale which is whatever scale at which the organism happens to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.744,
    "end": 2945.508,
    "text": "So I don't get what the debate is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2947.63,
    "end": 2950.492,
    "text": "Dean, how about you give a thought on that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2951.767,
    "end": 2952.788,
    "text": " Yeah, I got a thought on that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2952.888,
    "end": 2955.889,
    "text": "So I think we can see what a reflection is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2955.949,
    "end": 2957.41,
    "text": "We can see what a triangle is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2957.87,
    "end": 2961.492,
    "text": "We can see a very small triangle and we can see a very large one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2961.532,
    "end": 2963.973,
    "text": "Those are reflections, but that is not recursion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2964.673,
    "end": 2971.036,
    "text": "And as soon as you get into variability upon variability, you're going to have to come up with something more than a reflection.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2971.917,
    "end": 2976.359,
    "text": "And I think that's why you have to come up with something more than scale-free.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2977.559,
    "end": 2989.325,
    "text": " I mean, we can see scale-free, and nobody's arguing against that, but I guess what I'm pointing out is that if we limit ourselves to that, we're not going to see the entire picture.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2992.045,
    "end": 2994.526,
    "text": " all kind of intermediate, I think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2994.727,
    "end": 2997.088,
    "text": "They're both very valuable views.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2997.308,
    "end": 3006.213,
    "text": "Scale-free is certainly more aligned with the way that people do talk about formal models, whereas scale-friendly is a little more of a deanism, which is always fun.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3007.714,
    "end": 3015.918,
    "text": " I see scale-friendly as emphasizing the active role of the modeler in connecting the levels.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3016.339,
    "end": 3021.441,
    "text": "So it's not enough to just say like, I have a stretchy ruler that could apply to different scales.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3021.681,
    "end": 3023.482,
    "text": "It's not an a priori scaled ruler.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3024.243,
    "end": 3031.747,
    "text": "And then making it more of this process of approaching the mechanisms and the processes that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3033.024,
    "end": 3044.614,
    "text": " are interacting amongst scales, rather than just thinking, well, we'll put the linear regression on a little thing, we'll put the linear regression on the big thing, and then we'll have a scale-free applied theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3045.175,
    "end": 3055.504,
    "text": "This is more like, let's take that system as a indivisible unit of function, and then like interact with it in a little bit more of an act-inf way,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3056.758,
    "end": 3061.119,
    "text": " And it can still be scale-free for those who like that way of talking about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3062.519,
    "end": 3066.9,
    "text": "But for those who want to get to know it, maybe scale-friendly is approachable as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3067.8,
    "end": 3068.08,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3071.041,
    "end": 3081.323,
    "text": "Yeah, I think there's also active inference and adaptive active inference and inactive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.703,
    "end": 3083.423,
    "text": "So I think like Daniel made a good point there is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.966,
    "end": 3088.519,
    "text": " keeping the active influence flow through and helping that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.594,
    "end": 3090.835,
    "text": " is really useful, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.895,
    "end": 3094.057,
    "text": "So that we don't lose the formalism side, because that's the danger, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.098,
    "end": 3097.28,
    "text": "We clip off the... But there is something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.3,
    "end": 3100.843,
    "text": "For instance, at what point is adaptive active inference possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.283,
    "end": 3114.453,
    "text": "Like, is that the point when you need to have the brain within a reason, or there needs to be some generative process that's regulating active inference for it to then adapt at different temporal scales?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.654,
    "end": 3118.777,
    "text": "Now, that raises some other questions about exactly where, but there's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.457,
    "end": 3132.528,
    "text": " that even the idea of what adaptive active inference, inactive active inference, or adaptive inactive potentially is, starts to then tie in well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.988,
    "end": 3139.894,
    "text": "And if I can only do certain adaptive active inference with the brain, then it has to be the scale of an organism that has a brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.694,
    "end": 3142.836,
    "text": "And below that scale, it can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.156,
    "end": 3148.921,
    "text": "So there's something that becomes transitionary or contextual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.323,
    "end": 3155.106,
    "text": " Dean, on this point, and then to serve all for a combined response.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3157.068,
    "end": 3166.837,
    "text": "Yeah, so again, I think knowing that a triangle is a triangle regardless of the volume of its footprint is important.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3166.997,
    "end": 3171.06,
    "text": "I think when we include updating, when we include time,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3172.119,
    "end": 3174.862,
    "text": " then we should include scale-friendly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3175.202,
    "end": 3192.198,
    "text": "So I'm not discounting scale-free, but I'm saying that the updating process, whether you want to call that adaptation or inaction, the change aspect of it doesn't get resolved simply because a triangle is a triangle, if that makes sense.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3194.465,
    "end": 3197.968,
    "text": " Bucky Fuller said angle is metaphysical and general.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3198.388,
    "end": 3202.171,
    "text": "It doesn't refer to any specific substrate to say that something is a 60 degree angle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3202.652,
    "end": 3206.455,
    "text": "And frequency is always bound up in space and time and the specifics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3207.195,
    "end": 3211.739,
    "text": "So any realized system is going to be both.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3213.12,
    "end": 3213.521,
    "text": "Serval?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3217.924,
    "end": 3218.945,
    "text": "So, um...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.532,
    "end": 3223.274,
    "text": " Stephen, I think, talked about adaptive active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3223.815,
    "end": 3234.624,
    "text": "Adaptive active inference is something that Keshav introduced in 2018, I think, something like that, tries to reproduce adaptive notions of cognition from active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.644,
    "end": 3243.071,
    "text": "What it says is that you have agency when you have hierarchical modulation of active inference system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3243.091,
    "end": 3247.115,
    "text": "You have higher level of active inference that modulates lower levels of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.806,
    "end": 3257.835,
    "text": " The question at rise is basically a question that is not solved and I don't even know what's my opinion on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.8,
    "end": 3267.687,
    "text": " in the ontology of science and naturalism, which is, do we have different levels of existence, or do we have only scales?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3268.527,
    "end": 3278.134,
    "text": "And even at this level, when we admit that we have things within things within things within things, and that's what equality is, it's complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.615,
    "end": 3286.741,
    "text": "The thing is that, to circle back to a question that has been raised initially about how acting in France relates to other areas of cognition,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.321,
    "end": 3301.828,
    "text": " The way Kirchhoff tries to formalize inactive concepts of cognition is entirely wrong, because inactivists do not say that organisms are hierarchically modulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.334,
    "end": 3309.939,
    "text": " Active influence theorists say that the brain is modulated and they projected it on activists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3310.439,
    "end": 3323.728,
    "text": "Activists say that a system that is cognitive must be operationally closed, which is it has a set of, it has a structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.697,
    "end": 3337.927,
    "text": " or an organization, I don't know which, because of the American distinction, that basically reproduce its own existence without any clear support, without, autonomously from its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.007,
    "end": 3341.149,
    "text": "That's not how they say it, but whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.849,
    "end": 3348.974,
    "text": "And you have a specific formulation that is computational, it was formulated by people from the Basque Center of Life Sciences, I think the name is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.415,
    "end": 3352.157,
    "text": " which is constraint closure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.177,
    "end": 3360.202,
    "text": "So you have constraints that are slow processes that shape how faster processes behave, and you have a lot of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.822,
    "end": 3366.085,
    "text": "And collectively, these lots of constraints shape faster processes so as to maintain themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.566,
    "end": 3379.334,
    "text": "That is constraint closure, and that is what the latest version of, on the inactive, not agency, but autonomy notion is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.123,
    "end": 3389.324,
    "text": " And this entails not hierarchical modulation, but a meshed net of processes that make something else exist",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.459,
    "end": 3410.86,
    "text": " at in-between scales and the notion of what is the ontic status to give this is pretty complicated i don't know i know people that think that level is just an epistemic construct that is built by scientists and this is pretty consistent with a graphical approach with a matched approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.091,
    "end": 3421.65,
    "text": " this everything becomes ambiguous the meaning of every single terms uh become ambiguous so i have um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.49,
    "end": 3448.588,
    "text": " no idea what will be a correct way to refer to this uh scale free says what it says that it is not interested in specific scales of behavior and it also says implicitly when we are in the context factor in france that it is not interested in a specific antique level what applies for cells applies for a mutual organism which applies for societies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.088,
    "end": 3455.133,
    "text": " and which, in the case of Vanillat in France, also applies for dust, vortex, flames, and whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.075,
    "end": 3466.041,
    "text": "So, I'm not sure... I'm still not sure what the National Skeleton is supposed to do and how it relates to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.694,
    "end": 3481.68,
    "text": " the question of whether states are properly cognitive because we don't need a proper version, a proper notion of scales and proper anti-distinction, epistemic distinction between what is recursive and what is only a scale invariant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.241,
    "end": 3495.767,
    "text": "We only need to state what being cognitive is and to check whether states are, and of course, what this means for the broader epistemic constructs we've built around this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.895,
    "end": 3498.96,
    "text": " Thank you, Serval.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3499.181,
    "end": 3500.226,
    "text": "Blue, then Steven.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3504.531,
    "end": 3513.097,
    "text": " So I have to like go back to the active inference live stream number 30, when we talked about how to count biological minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3513.937,
    "end": 3529.668,
    "text": "And really this like raises, so when you're talking about the distinction between adaptive active inference and like mere active inference, and in this theory about how to count biological minds, is everything that's biological, do all things then have a mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3530.348,
    "end": 3533.33,
    "text": "Like even down to like the, you know, single cell organisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.911,
    "end": 3544.037,
    "text": " In this paper, there are a lot of people who have this mind-life continuity hypothesis, and a lot of people really ascribe to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3545.358,
    "end": 3549.601,
    "text": "In this adaptive active inference versus mere active inference, I couldn't find the line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3549.701,
    "end": 3553.623,
    "text": "I really pressed on Matt Sims about this, and he responded beautifully.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.284,
    "end": 3555.585,
    "text": "He also couldn't find the line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3556.305,
    "end": 3562.229,
    "text": "At what scale or what level does adaptive active inference transition to mere active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3563.189,
    "end": 3576.657,
    "text": " And what I'm fundamentally getting at is like, okay, so are you doing mere active inference if you're a single cell and you just move forward and back like towards a repulsant or an attractor, like is this mere active inference or is this adaptive also?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3577.117,
    "end": 3588.544,
    "text": "And so like adaptation to the niche, like to me, I think that happens at all levels, but there was this distinction made in that paper that like adaptive active inference happens when the collective",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3589.364,
    "end": 3595.429,
    "text": " forms some emergent behavior that makes it more fitted to the niche environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3596.029,
    "end": 3599.592,
    "text": "And so where is the state then, a biological mind?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3600.232,
    "end": 3610.22,
    "text": "Does the state make a set of organisms more fitted to its niche through this collective, adaptive behavior?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.24,
    "end": 3612.461,
    "text": "Or is it maybe maladaptive?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3613.442,
    "end": 3618.065,
    "text": "Because overall, as a species, the more divides we have, the more war we'll have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.266,
    "end": 3618.546,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3621.209,
    "end": 3621.629,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3621.649,
    "end": 3621.949,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3624.691,
    "end": 3628.152,
    "text": "Yeah, thanks for this mesh nets idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.172,
    "end": 3630.073,
    "text": "I think that's definitely true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.773,
    "end": 3636.036,
    "text": "And let's kind of fix in with the kind of meshed architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.056,
    "end": 3644.58,
    "text": "I wonder if, like Blue was mentioning about this different scales of active inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3646.99,
    "end": 3674.557,
    "text": " identity is quite important here and the nation state is a kind of is maybe identity driven and I kind of wonder if we're to scale that down I was thinking scale down I was talking about the face there earlier but for instance the baby in the womb okay is the the release during childbirth of the hormones which triggers the woman to break her waters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.799,
    "end": 3681.566,
    "text": " basically like a broadcast from the identity of the womb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.006,
    "end": 3683.988,
    "text": "So, okay, body, I'm here now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.229,
    "end": 3685.69,
    "text": "I'm a childbearing womb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.567,
    "end": 3696.195,
    "text": " I'm declaring myself in the same way that maybe the pituitary gland, but it does it all the time, declares itself certain times to create insulin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.676,
    "end": 3701.82,
    "text": "So could we see that this meshed architecture comes at a scale where it's possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.9,
    "end": 3714.431,
    "text": "And in the same way, then, the nation state, maybe as we go up in scale, the expression of signifiers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.697,
    "end": 3721.138,
    "text": " to broadcast out becomes greater and greater, you know, becomes a bigger and bigger part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.238,
    "end": 3729.319,
    "text": "And maybe the biological processes become less a part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.84,
    "end": 3740.181,
    "text": "Well, definitely it's the question of realism and instrumentalism, whether it quote is a broadcast or whether we'll just choose to model it as.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3741.021,
    "end": 3743.422,
    "text": "So one of those is definitely safe territory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3743.462,
    "end": 3744.082,
    "text": "And the other one is,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3745.984,
    "end": 3751.729,
    "text": " A little bit harder to make claims about what the territory is versus the map that we choose to draw around the territory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3751.749,
    "end": 3755.452,
    "text": "Um, but very interesting points, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3759.838,
    "end": 3760.419,
    "text": " Okay, I'm on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3760.719,
    "end": 3765.623,
    "text": "I just want to make sure that... I'll get feedback from people on this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3766.083,
    "end": 3778.593,
    "text": "So to me, adaptation, okay, adaptation around what is, which can be scale-free, or if we're talking about active inference, do we also include the counterfactual what if?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3779.354,
    "end": 3786.5,
    "text": "And I think if we include the what if, then I'm not sure that adaptation",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3788.035,
    "end": 3814.572,
    "text": " looks the same it's not reflective so i'm not pushing back on serval as much as i'm asking are we are we overfitting are we saying that recursion doesn't matter and are we saying that scale friendly doesn't matter because we only want to concentrate on what is that's my question dean i'll give a thought then stephen and then anyone else",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3816.949,
    "end": 3822.83,
    "text": " active inference agents that are capable of doing adaptive active inference as a title.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3823.111,
    "end": 3826.091,
    "text": "So just a recently proposed word as Serval brought up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3826.731,
    "end": 3834.713,
    "text": "Their internal generative model includes a model of perception and action as well as of cognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3835.174,
    "end": 3836.514,
    "text": "So that's metacognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3837.887,
    "end": 3843.852,
    "text": " The what-is of metacognition at one level can be a what-if at another level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3844.633,
    "end": 3852.74,
    "text": "What-is is the agent can actually be imagining a counterfactual with respect to perception and action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3853.321,
    "end": 3857.024,
    "text": "So cognition is that friendly scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3858.005,
    "end": 3859.646,
    "text": "It helps us bridge...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3860.799,
    "end": 3862.121,
    "text": " the what if and the what is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3862.982,
    "end": 3866.065,
    "text": "Because there's so many other angles.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3866.085,
    "end": 3877.118,
    "text": "One other path to walk through that would be like in Anil Seth's book, Being You, there's a great discussion about how counterfactuals actually are like the basis of cognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3877.538,
    "end": 3877.658,
    "text": "Like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3878.419,
    "end": 3884.822,
    "text": " how do we know that we're looking at a real mouse, like on my computer table versus like a picture of one at the same resolution?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3885.542,
    "end": 3887.683,
    "text": "Because actually there is an implicit counterfactual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3887.783,
    "end": 3896.888,
    "text": "I could move at a different angle and see something different at the physical object, but I wouldn't expect the shadows to move on this JPEG.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3897.668,
    "end": 3912.437,
    "text": " And so actually, the difference in our perception between two things that visually can look identical relates to deep situational awareness that actually blur or at least reimagine the relationship between what is and what if.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3913.518,
    "end": 3914.658,
    "text": "Stephen, and then Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3916.039,
    "end": 3916.339,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.96,
    "end": 3922.923,
    "text": "Actually, this paper's serving as quite a useful bridging provocation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.943,
    "end": 3925.105,
    "text": "Because as you just mentioned there, Daniel, with...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.219,
    "end": 3930.622,
    "text": " Okay, so what if, you know, a way of what if and counterfactuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.242,
    "end": 3943.872,
    "text": "So there's the cognition, which is a particular scale of perspectival, or even implicit, what if the counterfactual, but what if this and that happened in the future?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.912,
    "end": 3946.915,
    "text": "Well, the other question is, what am I becoming?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.875,
    "end": 3950.097,
    "text": "And actually, if we want to look at scale three, if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.003,
    "end": 3979.061,
    "text": " active influence is based on free energy principles and free energy principle was pretty much the only form of non-linear dynamical system out there but now we've got some of this stochastic chaos work also like if you go right back to non-linear dynamical systems and a lot of discussion around non-linear dynamical systems people are talking about thinking about that as a process of becoming so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.977,
    "end": 3986.468,
    "text": " how it gives you a way, what dimensionality can you use, what the process of becoming starts to tie into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3987.63,
    "end": 3992.739,
    "text": "And cognition as we see it doesn't, maybe the process of being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3994.051,
    "end": 3995.371,
    "text": " is more a process of becoming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.532,
    "end": 4009.616,
    "text": "But the process of what I broadcast, using that term very crudely, what my identity conveys is a much more steady, much more of an artifactual state, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.977,
    "end": 4013.738,
    "text": "Especially if I take a photo of it and put it up on my profile on Facebook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.896,
    "end": 4016.296,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4017.136,
    "end": 4029.281,
    "text": "Here's an article on being and becoming, and that distinction, as well as I'm sure a panoply of German words, has been discussed for a long time about the relationship between being and becoming.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4029.401,
    "end": 4035.863,
    "text": "And just to give one thought before Blue, that generative model of the Act-Inf agent",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4036.363,
    "end": 4059.255,
    "text": " includes what kind of agent am i what are my expectations preferences affordances etc so we get in the deep active inference framework built in what if and then what and then who would i be and how would others see me and what would they think if i were to do this and then this were to change that's all part of the state space of what's possible",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4060.359,
    "end": 4073.445,
    "text": " These are like the grammar in terms of the very austere outline of perception, cognition, action, and external dynamics that allow composition and new design motifs for those kinds of questions to be asked.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4074.065,
    "end": 4074.305,
    "text": "Blue?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4076.807,
    "end": 4080.128,
    "text": "So if you wouldn't mind flipping back to the twisty slide, I think it's 33.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4082.259,
    "end": 4089.728,
    "text": " And when you're thinking about like, are we talking about what is, or are we also including the what ifs in the model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4089.788,
    "end": 4097.656,
    "text": "Like when we talk about what it's like to build a state, so this is like how states have been built before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4098.829,
    "end": 4117.083,
    "text": " But how can we take this, and as Daniel was referring to at the beginning of the talk, how can we take the what has been and incorporate what if via active inference to predict how to optimally form states in the future?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4117.663,
    "end": 4120.805,
    "text": " So is active inference incorporating the counterfactuals?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4120.885,
    "end": 4122.185,
    "text": "Are we going into what ifs?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4122.665,
    "end": 4125.127,
    "text": "Or what about what's next?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4125.167,
    "end": 4134.371,
    "text": "Not just what if, but what's next to predict the cognition, essentially, of a state and how it's going to think going forward?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4136.192,
    "end": 4137.493,
    "text": "Great question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4137.673,
    "end": 4138.473,
    "text": "And what's next?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4139.073,
    "end": 4140.494,
    "text": "We can have our expectations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4140.834,
    "end": 4141.975,
    "text": "We can have our preferences.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4142.915,
    "end": 4144.416,
    "text": "They can interact in a different way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4144.996,
    "end": 4146.737,
    "text": "So Dean, then Andy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4148.959,
    "end": 4154.221,
    "text": " Yeah, Blue, I think that ties in with the point twos that we tend to do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4154.381,
    "end": 4176.388,
    "text": "All I would add to what's been said is that if we're looking at as, as is, we're looking at this reflection, and can we ask off of that, of what are we becoming, of becoming, which is a function, sometimes of scale, many times of variation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4177.188,
    "end": 4186.075,
    "text": " So I know I keep beating this horse because I want to include the variation and the fact that time changes our picture.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4187.576,
    "end": 4189.137,
    "text": "That's all I want included in this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4189.938,
    "end": 4195.943,
    "text": "And I don't think that that as is a perfect copy as we update.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4197.552,
    "end": 4227.132,
    "text": " so i maybe i'm maybe i'm explaining this wrong but i think as change occurs that perfect reflection that perfect copy doesn't move forward without variation concentration sometimes sometimes we just toss it out the window andy that's the what if sorry thank you dean andy and then i'll give a thought on the as change occurs so uh in my travels i've run across this idea that somebody tried to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4227.762,
    "end": 4232.385,
    "text": " quantify functions of a state that are universal, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4232.445,
    "end": 4235.448,
    "text": "What are the things like, how do you maintain healthcare?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4235.508,
    "end": 4246.015,
    "text": "Not necessarily which way is better, but distribution of resources, education, healthcare, things that we associate with the state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4246.115,
    "end": 4250.999,
    "text": "Maybe not every one of them, every state exists or every nation exists, or let's stick with state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4251.399,
    "end": 4252.98,
    "text": "Maybe not every state does every one of them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4253.02,
    "end": 4254.121,
    "text": "Certainly not all of them do it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4254.755,
    "end": 4256.256,
    "text": " to the same degree of competency.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4256.396,
    "end": 4264.279,
    "text": "And they are all bound within the expectations of the people who comprise that polity or that entity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4265.18,
    "end": 4270.982,
    "text": "But to get after your question, Blue, if we want to get to what if, how is this different?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4271.002,
    "end": 4271.963,
    "text": "How do states form differently?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4272.003,
    "end": 4273.103,
    "text": "What is the optimal thing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4273.763,
    "end": 4284.268,
    "text": "Then I think you've got to get down to a core set of variables for which states are supposed to provide solutions to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4284.955,
    "end": 4285.635,
    "text": " or address.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4287.836,
    "end": 4290.376,
    "text": "And then from there, we can see, well, what if they did it this way?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4290.396,
    "end": 4292.637,
    "text": "What if they prioritized this and not that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4292.757,
    "end": 4296.298,
    "text": "What if they prioritized this function over that function, and why would they?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4296.878,
    "end": 4297.858,
    "text": "What are they responding to?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4297.878,
    "end": 4304.66,
    "text": "I don't think that they're responding to necessarily uniquely physical or material requirements.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4305.2,
    "end": 4314.402,
    "text": "I think there's some interplay between intellectual or values-based requirements, as well as material requirements, all mixed up in time and space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4315.151,
    "end": 4319.594,
    "text": " given which parts of history we choose to preference in a particular moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4320.995,
    "end": 4321.315,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4322.276,
    "end": 4324.597,
    "text": "So one note on the as change occurs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4326.786,
    "end": 4346.052,
    "text": " Here's a very influential book with a broad follow-up lineage on the geometry of biological time by Winfrey, and it brings us back to the discussion of Kairos and how change occurring in Kronos, we become like Procrustes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4346.672,
    "end": 4349.633,
    "text": "We have to stretch and pull and change",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4350.413,
    "end": 4355.375,
    "text": " the sequence of action to fit onto the scale as defined.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4355.996,
    "end": 4371.723,
    "text": "Whereas thinking about the space of action, the geometry of biological time is defined more by action, like embryological events, rather than how many seconds have ticked on some atomic clock in some bunker.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4372.363,
    "end": 4375.345,
    "text": "So that as change occurs,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4377.079,
    "end": 4382.939,
    "text": " can be through time, but it may not be the kind of time that gets ticked out on a clock.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4383.757,
    "end": 4392.56,
    "text": " And that's just a very different way to talk about actions and inference because it's dynamic, but it's not just like, okay, the clock's running and things are changing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4393.08,
    "end": 4395.341,
    "text": "It's like, there's actually a timeliness to action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4395.821,
    "end": 4399.422,
    "text": "And so we're talking about the dynamics of the context and the timeliness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4400.223,
    "end": 4407.225,
    "text": "And then maybe there's ways to map Kronos and Kairos, or maybe one time we play more into one or the other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4408.085,
    "end": 4409.826,
    "text": "So Dean, and then anyone else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4412.082,
    "end": 4412.802,
    "text": " Yeah, just real quick.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4412.842,
    "end": 4421.067,
    "text": "Thank you, Andy, because I think what you did is you applied a partition to preference and priority, and you made sure that we didn't say that they were one and the same.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4421.968,
    "end": 4428.191,
    "text": "So in real time, we see an evolution throughout the discourse.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4428.751,
    "end": 4433.074,
    "text": "So I think that's a real example of what kind of happens as we update.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4435.799,
    "end": 4443.365,
    "text": " So, one other random thought just from earlier, and then, of course, anyone just bring up a thought or anyone in the live chat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4443.426,
    "end": 4449.11,
    "text": "So, we were talking earlier about, like, capital with an O-L and capital with an A-L.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4449.771,
    "end": 4451.212,
    "text": "Okay, so this was pretty interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4451.733,
    "end": 4459.179,
    "text": "Capital with an O-L comes from Capitolium, the name of the Temple of Jupiter at Rome on the Capitoline Hill.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4460.12,
    "end": 4460.22,
    "text": "So...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4461.36,
    "end": 4463.142,
    "text": " Dating in English from the 14th century.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4463.943,
    "end": 4465.765,
    "text": "So that is referring to this building.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4465.785,
    "end": 4467.987,
    "text": "That's very much like City on a Hill.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4468.848,
    "end": 4475.896,
    "text": "And City on a Hill is used as a multi-scale allusion to the United States, at the very least.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4477.117,
    "end": 4480.22,
    "text": "Like Capitol Hill, but of course, broader notions of what...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4481.198,
    "end": 4482.739,
    "text": " the state stands for.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4483.32,
    "end": 4485.902,
    "text": "And then there's capital with A-L.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4486.362,
    "end": 4490.285,
    "text": "Capitel, on the other hand, has a far wider range of meanings and application.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4490.726,
    "end": 4493.908,
    "text": "The word comes from Latin as well, from caput, meaning head.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4495.449,
    "end": 4507.739,
    "text": "And then it has a lot of polysemous uses, like capital punishment, which we talked of being the seat of government, like Sacramento is the capital of government.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4508.783,
    "end": 4513.846,
    "text": " California, but then like venture capital, capitalization.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4514.687,
    "end": 4516.348,
    "text": "So that's just interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4517.689,
    "end": 4531.238,
    "text": "I hope it's not simple wordplay when there's a homonym, but it's very interesting that they both draw back to Rome, which was alluded to earlier when thinking about the seeds of what today's states are on the world stage.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4531.879,
    "end": 4533.5,
    "text": "So Andy, then Steven.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4536.762,
    "end": 4537.262,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4537.503,
    "end": 4538.023,
    "text": "So well, it,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4539.13,
    "end": 4550.213,
    "text": " Would institutions of the state, like Ministry of Foreign Affairs, be considered an example of embodied intelligence in the context of cognition for the state?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4553.073,
    "end": 4553.333,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4554.714,
    "end": 4563.556,
    "text": "Something that Blue said earlier is that people proposed collective agency to be based on the capability of a certain kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.642,
    "end": 4568.984,
    "text": " regime of behavior to influence individual fitness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.924,
    "end": 4572.625,
    "text": "What I would say is that this is wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.426,
    "end": 4583.89,
    "text": "The biological organization, it is by definition organization, but it is constraints that exist upon the collective behavioral system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.83,
    "end": 4604.218,
    "text": " if you look at say it's a steel beam it is a structure it is something that affects how the steel beam interacts with the world and this is something that is entirely invisible from the perspective of a single particle of steel which is the natural lower level lower scale",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.253,
    "end": 4606.534,
    "text": " perspective you can articulate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4607.454,
    "end": 4616.377,
    "text": "So the view that organization is entailed by things that affect the niche of their constituents is flawed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4617.078,
    "end": 4625.041,
    "text": "What organization is, is a constraint at a specific scale, on a specific behavior, on a specific dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4629.332,
    "end": 4649.523,
    "text": " the relation it has uh with the body the body uh which uh certain uh certain scale of cognition is about is uh the set of those constraints uh that collectively enact uh behavior that we say is cognitive so when a mystery of foreign affairs or something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.403,
    "end": 4652.325,
    "text": " is doing a thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4652.946,
    "end": 4668.543,
    "text": "It is embodied in the sense that it participates in a greater network of constraints which collectively build an organisation which entails the behaviour of each specific decision of the Ministry of Foreign Policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.983,
    "end": 4671.606,
    "text": "So, for example, if there is some kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.073,
    "end": 4693.692,
    "text": " collective moral panic against communism is likely, in the absence of any formal statement against communism, that decision be best against specific people and words and themes perturbed communists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.044,
    "end": 4708.008,
    "text": " This is not entailed by anything at the formal level, at the level of symbolic computation that could be construed as constituting the highest or most recognizable forms of state cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.408,
    "end": 4715.09,
    "text": "Yet, this participates in a collective behavior that is adapted from the border system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4715.11,
    "end": 4720.012,
    "text": "This is basically the nation-state distinction from earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.469,
    "end": 4733.412,
    "text": " the aggregated behavior of specific sets of precision constraints past processes will build the slower processes and basically entail the behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.492,
    "end": 4742.075,
    "text": "And this is not something that needs to be acknowledged from any higher level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4742.835,
    "end": 4745.276,
    "text": "And this yet is cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.416,
    "end": 4749.917,
    "text": "And these grounds of view of analytical cognition are something that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4751.128,
    "end": 4763.938,
    "text": " for the states as something that is grounded in not the body of any single individual, but in the body of the state as the set of its constituting constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4765.719,
    "end": 4766.24,
    "text": "Thanks, Serval.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4766.48,
    "end": 4771.523,
    "text": "I also put up a quote that people can pause the video and read from the Gulag Archipelago.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4772.503,
    "end": 4783.087,
    "text": " That specifically refers to organizations as organs of the state, which is a little bit of a almost sinister meat grinder way to describe the state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4783.747,
    "end": 4795.812,
    "text": "And it refers to this interplay between the awareness and the actions of individuals and the systems outcomes at the state level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4796.492,
    "end": 4796.732,
    "text": "Steven.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4799.864,
    "end": 4825.862,
    "text": " yeah i think as well as this this is really useful i think this embodiment and our intuitive ability to embody um does then recapitulate the inference process so as well as these terms uh the seat of government or whatever coming from say we see it coming from roman literature but over time it's been encoded and encoded and maybe abstracted out and we use words",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.462,
    "end": 4830.243,
    "text": " And sometimes you have to look up the etymology to sort of find out where they came from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.303,
    "end": 4832.723,
    "text": "But we do intuitively see a difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.783,
    "end": 4837.124,
    "text": "If someone says someone's going to take their seat at the Senate, well, you get a feel for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.164,
    "end": 4839.605,
    "text": "But you don't say they're going to take their seat at the palace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4840.465,
    "end": 4843.365,
    "text": "They're going to sit in the throne, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.266,
    "end": 4850.787,
    "text": "Because the whole point of the palace is that those seats are not everyday seats, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.447,
    "end": 4855.348,
    "text": "But you get that because of how you know space is treated around one of those seats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.218,
    "end": 4860.42,
    "text": " You don't put a load of seats around and roll up a load of thrones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.82,
    "end": 4861.881,
    "text": "You give space to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.982,
    "end": 4873.167,
    "text": "And there's actually a lot of interesting work in physical theatre where you literally can work with space to convey how much space you give someone will convey how much power they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.5,
    "end": 4877.061,
    "text": " That reminds me of the term meronym.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4877.522,
    "end": 4880.623,
    "text": "So that's like when you say there were 10 mouths to feed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4881.264,
    "end": 4887.147,
    "text": "It's referring to a system by referring to the sub part of the system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4887.727,
    "end": 4892.29,
    "text": "So it's kind of like merotypology is about the parts and holes and merology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4892.79,
    "end": 4899.114,
    "text": "And so the meronym is when revealed through our language, we say there were 20 seats on that committee.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4901.215,
    "end": 4909.18,
    "text": " And the fluidity at which that is semantically unpacked shows that there is a relationship.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4909.2,
    "end": 4911.601,
    "text": "Like when you say there was 20 mouths, you think there was 20 people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4912.621,
    "end": 4916.243,
    "text": "And that includes a lot of our assumptions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4916.484,
    "end": 4918.405,
    "text": "10 pairs of hands or 10 hands.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4919.325,
    "end": 4929.791,
    "text": "What does that say about our assumptions about ableism or about what the default is in our way of speaking like that, Stephen, and then anyone else?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4931.914,
    "end": 4956.757,
    "text": " yeah uh and well ableism definitely comes in then as these sub these codes as people start to look at ableism that that's a very good point and also there's that intuitive understanding that you know there's there's the idea that a team generally is really more between five and ten people to optimally be a team and then you've got this idea of a group so you have an intuit when you hit 20 you've gone past",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.251,
    "end": 4981.466,
    "text": " small group into a large group and there's a whole work around large group interventions and getting aspects of the system in the room which is about when you can no longer look at each person in the eye and hold it which is sort of after 15 16 people so again you hit this to some extent we don't need to be taught that these things evoke",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4983.704,
    "end": 5009.1,
    "text": " reality for us as this structured organism in space in place now it's probably different for a dog on four legs maybe they can only sniff around four dogs right and that's a big crowd for them so you know and is that about their mind or is that about their their morphology so it's definitely an interesting question thank you servo and then anyone else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.349,
    "end": 5030.49,
    "text": " I like the way you talk of the throne as something whose function is communicated through medically-embodied cues, because the cognitive activity of the state is embodied in constraints that are not human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.972,
    "end": 5041.28,
    "text": " those constraints need to somehow affect the behavior of humans because those faster dynamics are basically the dynamics of a human individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.88,
    "end": 5045.964,
    "text": "They need ways to constrain it and influence it to exist as constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5046.804,
    "end": 5052.689,
    "text": "And a major way they do so is by building the niche humans living.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.85,
    "end": 5057.994,
    "text": "So building the way humans embody their perceptions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.396,
    "end": 5078.608,
    "text": " relate to each other to each other take decisions etc etc and um to simply build a monumental architecture to convey that specific buildings have specific functions and are very important and that you have to understand that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5081.271,
    "end": 5104.246,
    "text": " The underlying philosophy to exist as a functional member of society, it's a way to do so and that's a way which the throne basically affects people to believe in the kind of exceptional qualities of the sovereign which are necessary for a state that has a sovereign to exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5106.846,
    "end": 5112.409,
    "text": " So the throne and the crown or any other kind of token there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5112.629,
    "end": 5114.37,
    "text": "So it's embodied.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5114.41,
    "end": 5117.852,
    "text": "It refers to a wearable or a bodily position.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5118.573,
    "end": 5123.376,
    "text": "It refers to, of course, an encultured and a semiotic context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5124.896,
    "end": 5125.597,
    "text": "It's enacted.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5126.377,
    "end": 5129.279,
    "text": "That relates to declarative speech acts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5130.36,
    "end": 5131.921,
    "text": "I pronounce you married.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5132.801,
    "end": 5134.062,
    "text": "The speech act is...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5136.355,
    "end": 5136.835,
    "text": " the action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5137.756,
    "end": 5143.222,
    "text": "And so when we're talking about writing and language driven systems,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5144.608,
    "end": 5151.251,
    "text": " which is a key part of, again, that deep histories section, declarative speech acts become very important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5151.712,
    "end": 5168.54,
    "text": "When you're served the subpoena or when something is ruled, then the hammer comes down on the table with like sort of like the finality of the act, like an onomatopoeia relative to the declaration that was uttered in a certain ritualized context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5170.301,
    "end": 5171.922,
    "text": "These are great examples about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5173.024,
    "end": 5175.985,
    "text": " how we can use like the 4E framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5176.625,
    "end": 5181.206,
    "text": "And also I was going to say it's extended because the crown and the throne, they're literally off of the body.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5181.546,
    "end": 5200.031,
    "text": "And then what's the story that's like the total, like, oh, king got owned, emperor's new clothes, where the extended cognitive apparatus that signals the cultural position of the king is revealed to be not what it is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5201.127,
    "end": 5206.769,
    "text": " And so it's like to strip the person of their role, it's just like stripping off their clothes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5207.71,
    "end": 5221.275,
    "text": "And these are just all kinds of very accessible phenomena that we can ask, how does this support a 4E or an active inference approach?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5222.415,
    "end": 5224.398,
    "text": " relative to some other approach.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5224.819,
    "end": 5236.637,
    "text": "Like signal processing, yeah, I'm sure you can make the neural network that recognizes a crown versus other images, but that is like a sub-component of visual perception",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5237.509,
    "end": 5239.731,
    "text": " within this broader picture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5240.411,
    "end": 5243.033,
    "text": "And then also it helps us ask, what if?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5243.813,
    "end": 5260.525,
    "text": "And how we could design embodied and cultured, enacted, extended, et cetera, systems that reflect the statistical regularities of who we are now and how we think things are and how we expect and prefer things to change.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5268.787,
    "end": 5272.199,
    "text": " Yeah, I think that's a very good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.259,
    "end": 5274.869,
    "text": "And maybe this is where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.684,
    "end": 5282.308,
    "text": " you know, Savar was talking about constraints there and also, I suppose, comes back to the idea of when to stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5282.568,
    "end": 5286.05,
    "text": "I talked about this a little bit with Dean yesterday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5287.131,
    "end": 5292.334,
    "text": "When do we know when to stop is one of the big challenges about, you know, ecological context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5293.115,
    "end": 5305.243,
    "text": "And I keep thinking, so, you know, you have the hammer comes down, you know, if you have a state, you know, the hammer comes down, you viscerally have an embodied understanding of what's being communicated by them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.933,
    "end": 5329.983,
    "text": " you know, that comes down, something's been hammered out, and in the Houses of Parliament in the UK they have this big mace, they call it the mace, it's an ornamental mace, but of course a mace, well I don't know if this is exactly true, but I think of a mace normally as something you club someone over the head with, right, in a battle, right, so it's there as maybe that big stick idea that's been brought in, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.264,
    "end": 5340.773,
    "text": " One thing that really came to mind when this was coming up was what happened during Nazi Germany when the new technology of sound systems came out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.793,
    "end": 5350.684,
    "text": "So the big thing that happened was these big rallies that completely overwhelmed people is no one had had, just like we didn't have with social media before, no one had had an embodied experience to calibrate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5351.906,
    "end": 5367.725,
    "text": " in some ways you maybe never can because it becomes slightly beyond the concepts of embodiment what it meant to be in this big arena where you heard sound coming from everywhere and it then the idea is that that was part of the reason where it become disruptive maybe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5368.486,
    "end": 5374.67,
    "text": " we weren't able to constrain and it just became a cancerous almost overwhelm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5375.111,
    "end": 5387.659,
    "text": "But there's something about new technologies and the ability to constrain and find a state that is to some extent sustainable and when it becomes out of control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.719,
    "end": 5391.822,
    "text": "And is there something about the embodiment that Daniel was talking about there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.143,
    "end": 5394.723,
    "text": "Thank you, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.344,
    "end": 5396.905,
    "text": "Serval, and then anyone else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5399.767,
    "end": 5412.459,
    "text": " I want to emphasize that, as in the formalism I'm calling out to, the notion of a constraint does not entail the notion of an interdiction, of a top-down order, or of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5415.484,
    "end": 5417.305,
    "text": " of a stop on a behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5417.505,
    "end": 5422.267,
    "text": "A constraint is a slow process that modulates a fast process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5423.268,
    "end": 5438.755,
    "text": "For example, if we agree on the sound of some word, say a lamp, so we have a relatively slow process that is our couple behavior that will constrain our relative faster processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5439.375,
    "end": 5445.941,
    "text": " In the sense that when one of us use the word lamp, the other will understand what it refers to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5446.001,
    "end": 5459.013,
    "text": "So it will basically allow the dimensionality of the possible behavior I have, because I will only pick behavior that are consistent with the fact that you said the word lamp, as I understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5461.295,
    "end": 5464.618,
    "text": "So the way that we culturally build our niches",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5466.419,
    "end": 5471.342,
    "text": " It's not something we understand as constraining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5471.962,
    "end": 5473.963,
    "text": "It's something we understand as creative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5474.683,
    "end": 5487.609,
    "text": "And yet it corresponds pretty naturally to the concept of constraint as would be used by a physicist or a stem biologist, which is the sense I use in that paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5490.43,
    "end": 5490.67,
    "text": "Thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5492.335,
    "end": 5498.84,
    "text": " It reminds me of a paper I could find it with like, it was like developmental constraints or opportunities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5500.001,
    "end": 5506.425,
    "text": "And it was just saying, you can think about like, okay, I guess there's some morphological creature that just extends in a blob.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5507.266,
    "end": 5513.451,
    "text": "But any other one that has facilitated enabled affordances to grow in one direction is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5514.622,
    "end": 5517.363,
    "text": " can be framed as the constraint from the other dimension.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5517.983,
    "end": 5523.845,
    "text": "And so there are two sides of the coin to talk about what is the constraint that enables.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5523.865,
    "end": 5524.885,
    "text": "It's like chess.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5524.905,
    "end": 5532.047,
    "text": "It's the enabling constraints on chess moves that allow brilliant chess games and a culture to actually arise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5532.627,
    "end": 5535.028,
    "text": "So just to follow with a direct response, then Steven and Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5536.687,
    "end": 5537.167,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5538.088,
    "end": 5541.069,
    "text": "I think Blue had her hand up first, I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5541.73,
    "end": 5551.515,
    "text": "But what I wanted to say is that to have something that exists as an input construct to have interacting behaviour, you need signature breakings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.555,
    "end": 5556.798,
    "text": "For example, you need a particle of gas to not be independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5557.699,
    "end": 5563.222,
    "text": "The default assumption of a physicist is that everything depends on nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5563.742,
    "end": 5566.284,
    "text": " Each particle evolves independently, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5567.004,
    "end": 5578.472,
    "text": "So this means that I need basically the mean and the variance of their individual trajectories to have all of the necessary information on my system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5579.092,
    "end": 5583.995,
    "text": "This corresponds to light pressure and temperature, depending on what the trajectory is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5587.188,
    "end": 5589.613,
    "text": " Well, there is no clear mapping, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5590.274,
    "end": 5590.595,
    "text": "Whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5592.539,
    "end": 5599.092,
    "text": "But if I somehow forbid... If I somehow build",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5600.627,
    "end": 5618.923,
    "text": " correlation between the behavior of those particles then there are new possible behavior pretty much you have new possible elements of this set space that exist you have a creation as far as a physicist that is concerned with behavior within certain set spaces",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5620.545,
    "end": 5623.306,
    "text": " is as far as I forgot my phrase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5623.406,
    "end": 5636.535,
    "text": "But the physicist sees creation because there are things that were not part of the set space he drew at the beginning of the existential system that become existence, something that was not and that now is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5638.096,
    "end": 5642.379,
    "text": "And what is interesting is this process of becoming, as we discussed earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5646.876,
    "end": 5666.208,
    "text": " because you have kinds of symmetries building and symmetries breaking that are constructive, and yet they need to be constraining, because if everything just arbitrarily adopts any kind of behavior in the state space that is accessible, that is possible in principle, you have just a full entropy, you have what noise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5666.648,
    "end": 5668.189,
    "text": "You have literally nothing there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.61,
    "end": 5672.312,
    "text": "You have just particles that blah blah blah blah blah blah blah blah blah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.28,
    "end": 5688.392,
    "text": " And the fact of existence that we have things to talk about, it entails the constraining of the possible set space to everything is equally likely to some of the things are more likely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5688.973,
    "end": 5694.998,
    "text": "And it entails a meaningful map between the possible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5696.371,
    "end": 5706.518,
    "text": " states at the macro level, at the lowest possible level description, and the states as we are interested in at a specific moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5707.819,
    "end": 5713.843,
    "text": "So that was providing on the way that constraints are not restrictive but creative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.244,
    "end": 5715.584,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5715.964,
    "end": 5724.37,
    "text": "The absence of restraints, statistically, constraints would just refer to an unconnected Bayesian graph just independently vibrating",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5725.39,
    "end": 5725.831,
    "text": " variables.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5726.492,
    "end": 5734.587,
    "text": "And so to have anything that's tracking or anticipating something else, we're discussing the imposition of constraints using that term.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5735.168,
    "end": 5736.25,
    "text": "Stephen, and then Andy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5739.301,
    "end": 5743.885,
    "text": " You mentioned, I see what Daniel, you put there, enabling systems slash constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5743.965,
    "end": 5746.928,
    "text": "So I think there is that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.088,
    "end": 5758.698,
    "text": "I totally get, and I think it's a very good point about, you know, you've got the statistics, stochastic chaos, and you've got the general dynamical processes, and there's gonna be some way of constraining that through different levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5759.578,
    "end": 5783.546,
    "text": " um there's also then uh you know if we take consciousness as being at the brain the brain stem and not in the frontal cortex you know and it's then sending stuff out you know i can see that biological dynamic but you also have this enabling system process of scale i suppose that in a way that i was just referring to and these things can start to be like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5784.306,
    "end": 5810.378,
    "text": " the ball rolling down the hill so to speak you know it starts to accumulate um its own because it's it doesn't need to extract information to make inferences to make things happen it's just happening through thermodynamics and dynamics um i wonder how we can think about the challenge of these macro systems then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5811.55,
    "end": 5817.693,
    "text": " the enabling system overriding the emergent dynamical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5819.454,
    "end": 5819.794,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5820.494,
    "end": 5820.735,
    "text": "Andy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5825.237,
    "end": 5835.642,
    "text": "Is there a fundamental difference between thinking like a state and thinking like a tribe, or is it just a level of sophistication with what specialties are enabled once you get a state level?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5837.304,
    "end": 5838.645,
    "text": " Thanks for the question, Serval.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5839.766,
    "end": 5841.247,
    "text": "A state has administrative systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.767,
    "end": 5842.527,
    "text": "A tribe does not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5843.968,
    "end": 5851.833,
    "text": "So, like you have a lot of ways societies can be organized that are somewhat in a continuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5852.734,
    "end": 5859.358,
    "text": "What I call a state is a specific control system that, well, is in a precipitary state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5859.799,
    "end": 5861.86,
    "text": "Either it exists or it does not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5863.581,
    "end": 5864.562,
    "text": "And in the case of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5865.714,
    "end": 5878.787,
    "text": " Perhaps I don't think most of what we call tribe have an integrated decision system, more like shared ethnic cultural norms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5880.328,
    "end": 5885.994,
    "text": "And if they have integrated decision systems, it's certainly nothing like administration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.109,
    "end": 5895.033,
    "text": " It's so fascinating because the tribe can be implicitly existing without a state, as Serval just noted.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5895.853,
    "end": 5904.858,
    "text": "And it makes me think about Web3 and DAOs, where it's almost like the states are being defined first, and then the people are rushing in to fill.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5905.499,
    "end": 5914.424,
    "text": "So instead of the historical emergence of specialization and elaboration and formalization on top of an implicit...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5915.95,
    "end": 5917.191,
    "text": " background of the people.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5917.992,
    "end": 5935.408,
    "text": "And then in a complex interplay, as we've been discussing, this is almost like a computational state that people are migrating to with a preset governance system, sometimes one that's incredibly constraining and people may not even know how constraining until they're there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5936.129,
    "end": 5937.971,
    "text": "So that's an inversion of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5939.855,
    "end": 5946.121,
    "text": " how we've seen the members of the state and the state's evolution engage.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5946.622,
    "end": 5950.466,
    "text": "So more things change, the more they stay the same, but it's a different river for sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5950.746,
    "end": 5952.568,
    "text": "So Dean, Blue, Steven.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5955.019,
    "end": 5967.147,
    "text": " I think I found something that I can say I can agree with Serval and maybe some of the people who really like genetics, because I think constraint really matters.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5967.507,
    "end": 5970.429,
    "text": "And I think the idea that ratio",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5971.289,
    "end": 5981.112,
    "text": " is not phenotypical drift through neutral mutations, even though mutations are a ratio of the non-mutations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5981.792,
    "end": 5986.513,
    "text": "I also think that ratios and randomness accommodations are not the same thing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5986.553,
    "end": 5992.275,
    "text": "So I think constraint allows us to be able to see the difference between those two things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5993.593,
    "end": 5999.239,
    "text": " One is when a triangle is a triangle and the other is when a variation plays upon a variation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5999.639,
    "end": 6000.98,
    "text": "And I think we can accept both.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6001.741,
    "end": 6006.225,
    "text": "That's where I think the constraint piece actually helps us pull the two things together.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6007.887,
    "end": 6008.528,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6009.088,
    "end": 6009.869,
    "text": "Blue, then Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6011.716,
    "end": 6024.35,
    "text": " So just to kind of go back to what Andy was saying about the difference between a tribe and a state, but also when do we know when to stop and processes that constrain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6024.85,
    "end": 6028.534,
    "text": "And when I think about this bi-directional information flow,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6029.355,
    "end": 6035.401,
    "text": " If the emergent energy is too strong, then it's out of control, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6035.421,
    "end": 6036.282,
    "text": "There's no constraint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6036.943,
    "end": 6044.37,
    "text": "But when the constraint is too strong, I think about even in mental action, the idea that your grip is too tight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6044.81,
    "end": 6048.374,
    "text": "And so whatever you're trying to control pops out of your grip, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6048.554,
    "end": 6050.276,
    "text": "So you can squeeze a balloon and then boom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6051.396,
    "end": 6053.718,
    "text": " And so there has to be like some balance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6053.778,
    "end": 6056.66,
    "text": "And I just wonder if that balance is like quantifiable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6056.74,
    "end": 6060.583,
    "text": "Like does downward information have to equal upward information flow?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6060.623,
    "end": 6072.571,
    "text": "Like is there like a balance between those two things that allows like a self-emergent or not a self-organizing entity to maintain in the state of an attractor?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6072.891,
    "end": 6080.696,
    "text": "Because of like the information flow is too much in one way or the other, the balance goes off and it'll steer away from that attractor space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6082.218,
    "end": 6084.141,
    "text": " Steven, and then I'll add a comment on that blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6086.57,
    "end": 6094.656,
    "text": " Yeah, I think that the ability to constrain is going to be at different levels in the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6095.356,
    "end": 6098.558,
    "text": "You've got certain things which are just like constitutional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.778,
    "end": 6101.42,
    "text": "We hear this in the states, there's constitutional rights, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6101.5,
    "end": 6102.781,
    "text": "They're fixed, they can't change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6102.821,
    "end": 6104.402,
    "text": "It's been there for 200 years or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6104.883,
    "end": 6107.104,
    "text": "And then you've got more negotiation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6107.224,
    "end": 6112.288,
    "text": "And in the UK, you've got the government has to go and talk to the Queen every couple of weeks or every week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6112.848,
    "end": 6139.936,
    "text": " so in theory the queen could constrain now again they don't just have to send the letter they have to go and meet in person and talk there has to be so then there's this intersubjective dynamical constraint and then of course then for scaling you've got the kind of we can't really do it as organisms so we put in an electoral system but the electoral system and the the democracy in north america comes a lot from the tribe that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6140.436,
    "end": 6143.977,
    "text": " the sort of scaled tribes of North America as much as it does from France.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.377,
    "end": 6145.217,
    "text": "It's quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6145.237,
    "end": 6148.878,
    "text": "And one thing they have in Toronto, we have the Treaty of the Dish of One Spoon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6149.478,
    "end": 6159.3,
    "text": "And the Treaty of the Dish of One Spoon is basically they sat round in a circle and they have a dish with one spoon and you only take enough for yourself and you leave enough for nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6159.82,
    "end": 6163.901,
    "text": "And it's passed round and that's the treaty of how to look after the Great Lakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6164.821,
    "end": 6174.565,
    "text": " And actually, it was a lot of that kind of slightly scaled version of tribal work, which then informed and said, OK, Europe, you're killing each other all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6174.625,
    "end": 6176.866,
    "text": "What about something a little bit like this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6177.626,
    "end": 6180.867,
    "text": "So actually, democracy in the US was partly from the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6182.788,
    "end": 6185.811,
    "text": " not really tribes anymore, but that kind of scaled piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6186.252,
    "end": 6201.907,
    "text": "So I think there's that need to sort of draw back into something which is more contextual, more dynamical, as well as the kind of, I don't know, the more kind of law-based approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6203.387,
    "end": 6203.707,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6204.028,
    "end": 6212.694,
    "text": "So people have been mentioning the getting a grip, which was of course from the paper about how states get a grip on their subjects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6212.895,
    "end": 6225.725,
    "text": "And that was drawn from the work of Yella and Rydvold talking about optimal grip and skilled performance and all these other cool inactive and ecological psychological ideas we've talked to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6226.225,
    "end": 6229.068,
    "text": "So it's like of all the trajectories that the golf club can take,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6230.08,
    "end": 6234.484,
    "text": " we're constraining that to some lower dimensional manifold, that's getting a grip.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6235.465,
    "end": 6237.087,
    "text": "And I totally agree.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6237.107,
    "end": 6247.476,
    "text": "I think a good example of an empirical system and about what kind of reciprocal interactions exist and what attractor states does that beget.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6248.737,
    "end": 6263.782,
    "text": " is the federalist, anti-federalist discussion at the end of the 1700s in the United States with people saying, if you have the affordance for a standing army at the federal scale, then we'll see this happen at the lower state level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6264.202,
    "end": 6272.485,
    "text": "Or if there's the ability to engage in foreign diplomacy or print debt at the federal level, then we'll see this happen or not at the state level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6273.045,
    "end": 6276.066,
    "text": "And so I think that's where we go from sort of the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6277.026,
    "end": 6292.494,
    "text": " what has been and what is to the future that we don't know about the what if where we are in that scale friendly level where we're talking about designing or modifying or preserving or intervening in",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6293.701,
    "end": 6315.778,
    "text": " those causal threads that do link and co-constrain the smaller subunits with the larger processes and how do we talk about the space of design there and integrate our preferences and expectations together with just sometimes the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6317.984,
    "end": 6337.627,
    "text": " dazzling and tragic and complex history of just everything we see on this map so we'll have just um a few minutes left let's from anyone who'd like to let's just hear like some last thoughts",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6338.68,
    "end": 6344.509,
    "text": " What's something cool from today or what's something that you're looking forward to discussing more next week?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6345.17,
    "end": 6347.133,
    "text": "Otherwise, it's been an awesome .1.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6347.614,
    "end": 6350.178,
    "text": "So, Stephen, and then we'll go around to anyone else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6353.864,
    "end": 6356.705,
    "text": " Following on what you were saying there, Daniel, and I'll use this as a sum up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6356.785,
    "end": 6369.831,
    "text": "It slightly opens up a new thing, which maybe we'll get to the next session, but how do we see what happens with the nature of tech companies and the huge affordances that that puts into our landscape?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6370.171,
    "end": 6373.693,
    "text": "Also, the constraints, if we take the McLuhan tech trad of how it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6374.232,
    "end": 6398.303,
    "text": " then changes the way we behave overall they're introducing rather than um a constraining or a sort of a wise constraining way it's it's putting out there what's out there and it's it's affording huge amounts of new novel interactions be it microsoft be it google be it facebook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6399.458,
    "end": 6406.06,
    "text": " And then they're getting hugely powerful just through permeation into society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6406.08,
    "end": 6415.802,
    "text": "So, you know, something that's interesting is then where does, you know, I think that may reflect one of the challenges we have at the moment with corporations getting so big.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6416.362,
    "end": 6416.962,
    "text": "So thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6417.182,
    "end": 6420.843,
    "text": "And this is a very, very good talk and lots of things are sparking off it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6420.863,
    "end": 6421.563,
    "text": "So I appreciate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6422.534,
    "end": 6448.181,
    "text": " thank you yeah like nation states used to be like states were the big players in town there was big ones and there were smaller ones but that was sort of like the ultimate level of analysis web 2 we saw websites stock tickers apple amazon etc become bigger than many states and intertwined and amongst them in a way that sometimes is even more advantageous though they don't",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6448.621,
    "end": 6454.704,
    "text": " have citizenships themselves, they have user identifiers, they have revenue flows, they have governance models.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6455.464,
    "end": 6458.006,
    "text": "And then now into web three we go.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6458.746,
    "end": 6462.488,
    "text": "And platforms and protocols, maybe even decentralized ways",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6463.721,
    "end": 6490.801,
    "text": " of accumulating governance and economic systems that will also be at least initially larger than smaller nation states and web 2 tech companies so there's going to be like legacy like web 0 1 2 3 4 all of these systems are going to be on the same territory but they're going to have different maps so they're going to be coordinating very differently",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6494.859,
    "end": 6497.961,
    "text": " Would anyone else like to give a closing thought?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6498.501,
    "end": 6517.955,
    "text": "I think there's a lot of stuff in the dot too that we'll be able to like jump off into, like Serval next week, I want to hear about where we go next, like what are your next personal research goals and what are other opportunities for individuals who want to like learn more or research or apply in this area or under this framework?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6518.136,
    "end": 6519.757,
    "text": "Blue, and then anyone else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6521.496,
    "end": 6530.218,
    "text": " So just a final thought, I'd like to like discuss more or maybe get more into like what is the state anticipating and how do they anticipate what's coming next?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6530.798,
    "end": 6531.818,
    "text": "Just predictive behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6535.279,
    "end": 6542.1,
    "text": "Yeah, and it will be fun also to like just connect some of these to the core terms in the active infantology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6542.26,
    "end": 6544.881,
    "text": "Just like what are the sense states of the states?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6545.101,
    "end": 6546.861,
    "text": "What are the action states of the states?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6548.141,
    "end": 6549.422,
    "text": "Let's, you know, what is attention?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6550.002,
    "end": 6551.102,
    "text": "Is that the most wanted list?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6552.588,
    "end": 6562.398,
    "text": " What are the ways that we can just take the terms that we already have and start to build up this table of mappings so that we can, and maybe it's going to fit on multiple levels.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6562.799,
    "end": 6571.387,
    "text": "So it's not going to be just the one and only map of maps, but it'll be a draft versionable participatory set of mappings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6571.447,
    "end": 6572.008,
    "text": "And that'll be fun.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6572.729,
    "end": 6572.889,
    "text": "Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6574.795,
    "end": 6582.057,
    "text": " Yeah, what I really appreciated about the paper was the ability to sort of look at things through the scale invariance lens.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6582.597,
    "end": 6590.139,
    "text": "And now I'm really curious to see what would happen if we got off the map and started moving around and then actually incorporated scale variance.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6590.639,
    "end": 6595.661,
    "text": "Because I think that's really the and then what happens piece that this paper affords.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6595.681,
    "end": 6596.781,
    "text": "It gives us a good grounding.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6597.361,
    "end": 6601.762,
    "text": "And now we can step off of that and think in the hypothetical space.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6602.223,
    "end": 6603.623,
    "text": "And I'm really curious to see where that goes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6605.447,
    "end": 6605.827,
    "text": " Excellent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6607.928,
    "end": 6609.628,
    "text": "Andy, if you have any last comments?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6611.449,
    "end": 6612.789,
    "text": "Well, thanks for letting me play.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6612.969,
    "end": 6614.93,
    "text": "I really enjoyed the conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6616.511,
    "end": 6618.191,
    "text": "And a lot of this was new to me, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6618.491,
    "end": 6625.454,
    "text": "I'm new to even the idea of active inference, but being able to discuss it in concepts of the state, incredibly interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6625.474,
    "end": 6626.834,
    "text": "So thanks for letting me participate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6627.671,
    "end": 6628.051,
    "text": " Excellent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6628.091,
    "end": 6631.513,
    "text": "Well, it's always a two or more way straight.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6631.613,
    "end": 6633.173,
    "text": "So we all had an awesome time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6633.373,
    "end": 6635.754,
    "text": "Thank you everybody for participating.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6635.935,
    "end": 6646.159,
    "text": "We hope to see you here and or participants through listening in another live stream, in the lab, working with us on projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6646.339,
    "end": 6647.72,
    "text": "So see you all later.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6648.06,
    "end": 6648.6,
    "text": "Talk to you next time.",
    "speaker": "SPEAKER_05"
  }
]