[
  {
    "start": 6.383,
    "end": 35.82,
    "text": " all right hello and welcome everyone it's december 7th 2022 this is active inference live stream number 31.1 we are here with brett kagan and we're going to be hearing a presentation and having a discussion on free energy principle and active inference in synthetic biological intelligence we'll have a presentation followed by a discussion so feel free to submit any questions if you would like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 36.5,
    "end": 38.52,
    "text": " Brett, thank you for joining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 38.72,
    "end": 41.681,
    "text": "Really looking forward to this presentation and discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 42.301,
    "end": 42.721,
    "text": "Off to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 44.361,
    "end": 45.462,
    "text": "Thanks so much, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.682,
    "end": 47.462,
    "text": "Thank you everyone joining us today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.522,
    "end": 49.022,
    "text": "Hopefully we've got some interesting stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.702,
    "end": 62.465,
    "text": "So what I want to talk to you about is the work that we've been doing in what we call synthetic biological intelligence and particularly the use we've made of principles from the free energy principle and active inference frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.445,
    "end": 63.625,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 66.32,
    "end": 73.806,
    "text": " If we jump to sort of the first question and we can kind of ask ourselves, because we work with neural systems, what is there that's unique about neural systems?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 73.846,
    "end": 82.173,
    "text": "And one of the obvious answers to that is that they display this unique ability to collate information and apply it in an adaptive behavior in multiple contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.653,
    "end": 85.135,
    "text": "And that could be a fitting definition for intelligence, if you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.998,
    "end": 97.103,
    "text": " But to actually be able to test this in actual cells in real time, what you have to do is be able to record the information from the cells and provide information back to the cells in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 98.044,
    "end": 99.744,
    "text": "So how did we go about setting this up?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.764,
    "end": 100.845,
    "text": "How did we get these cells?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 101.305,
    "end": 102.426,
    "text": "So we did it in two ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 103.573,
    "end": 107.798,
    "text": " Either we took what's called a human-induced pluripotent stem cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 107.838,
    "end": 111.362,
    "text": "That's the H-I-P-S-C there that you can see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.982,
    "end": 116.748,
    "text": "And what you can do is develop these from any donor blood, tissue, or skin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 116.768,
    "end": 120.111,
    "text": "And you can basically make a pluripotent stem cell line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.131,
    "end": 123.275,
    "text": "And then you can use a number of different methods to turn that into neurons of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 123.795,
    "end": 125.897,
    "text": " you know, quite a degree of specificity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.337,
    "end": 144.57,
    "text": "We used quite a broad one for most of our work, which is called a dual somatic inhibition, which follows like natural ontological development, or ontogeny development, I should say, to sort of create these predominantly cortical cultures in a dish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.071,
    "end": 150.535,
    "text": "But you can use other direct methods, such as what's called an NGN2 direct differentiation, which gives rise to a more excitatory culture,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.77,
    "end": 161.292,
    "text": " Then we also took primary cortical neural cultures from mouse and we grew them as a comparison because we wanted to make sure that we were using, at least in some sense, bonafide cortical neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 161.352,
    "end": 163.833,
    "text": "And the best way to do that is to take it from animals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 164.633,
    "end": 170.234,
    "text": "But fortunately, as you see, we will be able to move and we have moved away from that now in our current practice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.254,
    "end": 172.975,
    "text": "So we're completely animal testing free at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 174.174,
    "end": 179.299,
    "text": " And then what we did was we plated these onto what's called a high-density multi-electrode array.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 179.68,
    "end": 181.581,
    "text": "And essentially, I'll show you a bit more of this in a second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 181.982,
    "end": 186.826,
    "text": "This is essentially a CMOS chip, which is a type of chip that you might get in a digital camera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.827,
    "end": 195.014,
    "text": "But it also can be used in this purpose because what it can do is sense electrical signals, even very small ones, and actually be able to stimulate to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.051,
    "end": 201.113,
    "text": " And so just some evidence that we actually did do the work we said we did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 201.174,
    "end": 203.075,
    "text": "Here's some examples of some cultures that we've grown.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.635,
    "end": 211.7,
    "text": "And they show what we're able to do is use techniques to actually capture key markers of aspects of these cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 211.9,
    "end": 216.423,
    "text": "So for example, this blue over here, hopefully it's coming up all right on your screens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 217.183,
    "end": 221.146,
    "text": "This shows something called DAPI, which marks all the nucleus of any cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.326,
    "end": 224.308,
    "text": " If you want, you can look at something called NUEN here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 224.368,
    "end": 225.909,
    "text": "NUEN marks neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 226.29,
    "end": 232.514,
    "text": "So all the green dots, and you might be able to see it better in this picture, all the green dots show that this is actually a neuron.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 233.315,
    "end": 237.458,
    "text": "And then, of course, one of the things that we know neurons have is that they send out axons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.559,
    "end": 241.041,
    "text": "And that's what this thing called beta-3 tubulin marks in the red.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.602,
    "end": 243.363,
    "text": "And finally, we want to know, do they have dendrites?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 243.383,
    "end": 245.885,
    "text": "And you can see here in the purple, this is marking dendrites.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.945,
    "end": 248.868,
    "text": "Also a little bit of axons, but it also marks dendrites as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.019,
    "end": 257.727,
    "text": " And then more than that, we want to know is not just are they neurons, because most neurons will have those traits, but also are they cortical neurons?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 257.947,
    "end": 261.17,
    "text": "And BRN1 is actually a marker for cortical neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 261.19,
    "end": 266.896,
    "text": "You can see here, actually, not only are they neurons, but most of those neurons are cortical specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 267.116,
    "end": 269.118,
    "text": "There's, of course, going to be different cell types in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 269.939,
    "end": 273.682,
    "text": "For example, GFAP here marks supporting cell types such as glia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 274.423,
    "end": 276.144,
    "text": " And you can see here we have a number of glia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 276.505,
    "end": 283.33,
    "text": "You can also really obviously see that these glia, these in the bigger picture, have quite a different morphology than the neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.111,
    "end": 298.582,
    "text": "So it's nice that we have sort of this mixed population because it means that we're able to test something that has some degree of comparable characteristics to what you might see in the cortical, in an animal or in our cortical areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 300.002,
    "end": 303.724,
    "text": " Of course, it's much, much simpler magnitudes and magnitude simpler than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.305,
    "end": 310.128,
    "text": "But it is reassuring for the function to know that there are some similarities as a model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.829,
    "end": 318.893,
    "text": "And importantly, for anyone who has looked at sort of creating cells out of stem cells, one of the big problems is that not all of those cells might be fully differentiated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 318.953,
    "end": 322.876,
    "text": "And if you do have cells that aren't differentiated and still pluripotent when you put them in a dish,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.636,
    "end": 345.502,
    "text": " uh they can turn into anything and of course most of the time what they turn into something uh invasive and potentially cancerous depending what it is fortunately this kr67 marks dividing cells so this would sort of mark any cell that wasn't uh fully differentiated and we had uh this is a case where we had none of them and that was common but generally we had none to very very few and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 346.062,
    "end": 351.884,
    "text": " Because of that, we're actually able to have these cultures growing for extended periods of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 351.904,
    "end": 355.806,
    "text": "And this is what's a cryo scanning electron microscopy image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.846,
    "end": 357.586,
    "text": "So these are real biological neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 358.046,
    "end": 364.969,
    "text": "They're a little cracked because when you do the cryo aspect of the scanning and you freeze them for the necessary preparation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 366.054,
    "end": 371.659,
    "text": " They do tend to crack a bit, but you can still mostly see that there are a lot of intact neurons, a lot of connections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 371.719,
    "end": 374.562,
    "text": "And then behind that, you can actually see all the electrodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.602,
    "end": 376.844,
    "text": "And you can also see the density and the complexity of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 376.904,
    "end": 387.574,
    "text": "And this is actually an area of the chip that is less dense and interconnected than some of the other areas, because if you look at the ones that are highly dense and interconnected, you can't see the chip behind it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.594,
    "end": 389.956,
    "text": "We kind of wanted to show the fact that there's a chip behind this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 391.437,
    "end": 398.202,
    "text": " And I think like one of the key things to take away from this simply is the degree of complexity you get here compared to something like an artificial neural network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 398.702,
    "end": 402.664,
    "text": "A lot of the time people look at models and they're quite nice and neat and symmetrical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 403.245,
    "end": 405.026,
    "text": "And that's just not what happens in biology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 405.926,
    "end": 416.373,
    "text": "And as we'll discuss later, there's probably some interesting features that arise out of this degree and this extent of random or pseudo random connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.498,
    "end": 420.76,
    "text": " And so what we could then do with this technology is map out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.78,
    "end": 422.842,
    "text": "This is an example of like the chip surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 423.362,
    "end": 426.944,
    "text": "And then the firing rate in hertz can be seen here as a color scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.545,
    "end": 435.991,
    "text": "And we can see over time with different cell types, we can get their activity and different cell types sort of turn on or begin to become active at different times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.071,
    "end": 441.915,
    "text": "But importantly, what we can do is get a fairly even distribution of active cells over the surface area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.575,
    "end": 451.885,
    "text": " fairly consistently again anyone who works in this area knows there's a fair bit of variation inherently and that's stuff we're working on now for the future but we are able to get this degree of um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 453.519,
    "end": 454.76,
    "text": " of activity over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 454.78,
    "end": 456.801,
    "text": "And that gives us some useful cell cultures to test.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.601,
    "end": 461.023,
    "text": "Of course, how do we go about testing that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 461.143,
    "end": 462.204,
    "text": "Which is the big question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.244,
    "end": 471.549,
    "text": "And we know that as a living organism, you, me, mice, cats, whatever, we need to have the closed loop feedback to operate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 471.569,
    "end": 472.669,
    "text": "And what does that mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 472.709,
    "end": 474.23,
    "text": "Essentially, it means that we're able to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 476.071,
    "end": 480.293,
    "text": " receive information about the outcomes of our actions and modify our actions as a result of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.313,
    "end": 488.155,
    "text": "So if I reach over for a cell phone, I immediately get sensory feedback in a number of modalities as I do that action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 488.195,
    "end": 490.216,
    "text": "And as I pick it up, I'm aware of the success of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 490.516,
    "end": 491.837,
    "text": "If I fail, I'm aware of that too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.997,
    "end": 511.549,
    "text": " uh and this is actually this little mouse with a vr headset on is uh from this uh atinger study which is one of my favorite studies that's been done in recent times where they actually attached their virtual reality to mice and i found that if they disconnected the mouse's movement as it was developing from the actual visual information it got it led to quite catastrophic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 514.152,
    "end": 515.934,
    "text": " functional developmental impairments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.935,
    "end": 527.949,
    "text": "And it just really shows, it shouldn't be surprising so much, but it does show us that this link with our environment is incredibly important for us as organisms to develop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.67,
    "end": 540.232,
    "text": " And so if you're looking at cells in a dish and you want to try and elicit intelligence, you can immediately say, well, you need to have some sort of linkage, some embodiment, which is achieved through this closed loop system to be set up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.332,
    "end": 546.594,
    "text": "And so like one of the better ways to sort of do this is to contrast it with an open feedback system, because that's what people generally do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.734,
    "end": 553.615,
    "text": "So just to emphasize this closed loop means that we stimulate some sort of sensation and that can be done with electrical stimulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 554.496,
    "end": 568.977,
    "text": " and we can provide then sensory feedback again through electrical stimulation on how that response alters the world and it's actually been demonstrated before in a few studies for example in this vacuum paper that this closed loop stimulation does result in increased plasticity um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 571.288,
    "end": 578.794,
    "text": " But we wanted to try and take it a little further and actually see if we could elicit a very clear goal directed behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 578.895,
    "end": 582.117,
    "text": "And so we set up, this is a little schematic of the dish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.538,
    "end": 592.026,
    "text": "And what we did was we almost arbitrarily defined, I shouldn't say it's arbitrary because there was a lot of planning and strategy behind it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.426,
    "end": 593.908,
    "text": "But what I mean by this is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.588,
    "end": 616.866,
    "text": " uh within a given framework for example here what we did was we designated a sensory region where we put information into electrodes using a combination of rate and place coding and then we read it out in this sort of counterbalanced region here so activity in these two regions would make the paddle move up activity in these two regions would make the paddle move down but the reason i say it's arbitrary was that we were able to uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.377,
    "end": 621.558,
    "text": " basically change this configuration to a number of ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 621.598,
    "end": 627.699,
    "text": "And for the most part, although there were some differences, get a degree of statistically significant performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 627.759,
    "end": 638.922,
    "text": "And that, of course, just shows the fact that neurons, as again, shouldn't be a surprise to anybody, are incredibly plastic and able to adapt and change how they respond otherwise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.022,
    "end": 641.723,
    "text": "And I think that's a really interesting thing because, of course, starting out here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.423,
    "end": 649.889,
    "text": " There is no real reason why neurons should behave in any particular way unless they're doing it to accord to some fundamental imperative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.97,
    "end": 653.672,
    "text": "And this is just an example of the visualization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.732,
    "end": 654.672,
    "text": "You're actually able to go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.994,
    "end": 677.098,
    "text": " uh there's a there's a site if you jump to our website i'll show that later it's called spike stream and you can go and play around with this yourself it's available so this is an example of the electrode uh multi-electrode ray each little dot is a potential electrode we can route the blue ones are the ones we're routing at the moment each little bar is a activity and you can see we put activity in the top",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 677.838,
    "end": 681.38,
    "text": " And then we read it out at the bottom and it moves these paddle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.58,
    "end": 683.801,
    "text": "And over time, as I'll show you, it gets better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.421,
    "end": 686.983,
    "text": "Feel free to go to the spike stream and have a look at that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.123,
    "end": 693.706,
    "text": "But right now, what I want to discuss is, yes, it's all well and good that a system may be able to organize its behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 695.326,
    "end": 696.367,
    "text": " in a changing environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.387,
    "end": 701.629,
    "text": "And this is actually an example of a very successful, so these are actual neurons driving this paddle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 701.989,
    "end": 707.531,
    "text": "So it's an example of one of our more successful cultures, but by no means is it a weird exception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 707.571,
    "end": 710.873,
    "text": "We do see this sort of better performance fairly often, again,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 711.693,
    "end": 712.973,
    "text": " there is variation, of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 714.474,
    "end": 722.677,
    "text": "And one of the ways that we wanted to investigate this initially was this idea of the free energy principle, which I'm sure many of you are familiar with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.717,
    "end": 728.699,
    "text": "So I'm not going to go into it in a great amount of detail, but I will provide kind of like a higher level summary of it here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.239,
    "end": 737.202,
    "text": "And the key things that we can sort of boil it down to in a very oversimplified sense, essentially, it means that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.822,
    "end": 761.257,
    "text": " what we want to do with the free energy principle it suggests that there is an innate imperative for a system to actually match a prediction that it makes to incoming sensation and it's going to be phrased in Bayesian terms and there's a lot of implications one can take from that and you know I love this picture that um Carl Carfriston wrote up in his uh developed as part of his nature neuroscience reviews uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.197,
    "end": 783.75,
    "text": " article if you haven't seen read it it's a great article it covers a lot of good stuff uh but simply between the linkages between the different levels of the system and of course like it is and like one of the strong arguments for it is that being able to predict and act in your environment is theoretically necessary so and the other like implication of course is that there needs to be a statistical boundary between the internal and the external",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.39,
    "end": 787.112,
    "text": " which is called a Markov blanket, and we're going to touch on that a bit more later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 788.193,
    "end": 798.401,
    "text": "Diving into the notion of active inference via the free energy principle, formally it's sort of been stated that this is the process of minimizing variational free energy through action and perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.282,
    "end": 806.887,
    "text": "And essentially what it's saying here is that a living organism is going to actively generate this internal model of the external world and then align those models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.967,
    "end": 807.027,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.263,
    "end": 811.386,
    "text": " Broadly speaking, there's two ways we can do that, either perception or action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.806,
    "end": 823.435,
    "text": "So if I use my cell phone as an example before, if I reach over, pick it up, what I've done is I've created a model in my head based on the visual information I've received, where the cell phone is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 824.296,
    "end": 825.717,
    "text": "I've reached over, I've picked it up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.398,
    "end": 826.878,
    "text": "Very good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.279,
    "end": 829.34,
    "text": "My perception matched my reality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 829.661,
    "end": 832.683,
    "text": "Let's say, though, that I didn't and I dropped it as I tried to pick it up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.183,
    "end": 833.904,
    "text": "Well, what could I do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.984,
    "end": 835.005,
    "text": "Either I could get better at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 836.722,
    "end": 843.054,
    "text": " predicting the world and say, look, when I reach, when I reach, I will always drop my cell phone or, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.809,
    "end": 845.811,
    "text": " I could get better at defining where it is in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 846.472,
    "end": 849.094,
    "text": "Or what I could do is get better at the actual reaching action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.615,
    "end": 857.822,
    "text": "And really, when you boil down to it, these are the only two ways that a system can get better at predicting its environment, either through getting better prediction or getting better at controlling the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.343,
    "end": 862.907,
    "text": "And so for our cell cultures, what we wanted to do was simply remove one of these options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.428,
    "end": 868.352,
    "text": "So it's a very simple implication from a very nuanced theory, but...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 869.437,
    "end": 887.254,
    "text": " following that we sort of said if the world became truly random something that like we as people like you can't anthropomorphize this too much because like we as people can't really experience something that's truly random um but in a dish with random random noise you you could at least approximate it um and so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.368,
    "end": 888.989,
    "text": " That's what we did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 889.169,
    "end": 890.211,
    "text": "And so we had these two options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.231,
    "end": 891.914,
    "text": "So what we then said is that this is true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.954,
    "end": 901.948,
    "text": "What the cells will do is actually change their actions to make it accord with the internal model of the world that they have to decide and derive from the sensory stimulation we feed them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.918,
    "end": 917.15,
    "text": " So under this model here, that's sort of represented in this picture that you can see, what we propose is that the neural cells or the system will try to minimize the difference between the internal and the external world to minimize the free energy of the system, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.21,
    "end": 918.291,
    "text": "minimize their surprisal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.77,
    "end": 922.791,
    "text": " We kind of predicted whether aversive is the right word or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.752,
    "end": 928.414,
    "text": "It would certainly, we would say that non-predictable random stimulation should be something that the cells would try to avoid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 929.134,
    "end": 934.856,
    "text": "While on the flip side, if we gave them a predictable stimulus when they did something they liked, that might be reinforcing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.896,
    "end": 941.039,
    "text": "And again, I put these words in quotes because there's a whole language question, no question around what is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 941.079,
    "end": 941.999,
    "text": "Is it truly aversive?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 942.039,
    "end": 942.619,
    "text": "Is it driving?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 942.659,
    "end": 943.62,
    "text": "Is it whatever?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.68,
    "end": 946.021,
    "text": "But for the sake of communication, we have to pick words right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.081,
    "end": 949.062,
    "text": "So hopefully you understand the context in which they're used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.222,
    "end": 954.384,
    "text": " And so what we propose then is that the cells should modify their activity to avoid adopting a state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.524,
    "end": 958.285,
    "text": "In this case, that's a pattern of activity that would lead to an increase in surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 959.385,
    "end": 964.767,
    "text": "And so what we could see here, we set up some experimental tests and we compared a number of different methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 964.807,
    "end": 966.207,
    "text": "So we compared this control group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 966.387,
    "end": 970.729,
    "text": "This was simply media in a dish that had the stimulations and feedback applied to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.289,
    "end": 984.447,
    "text": " media in a dish should not be able to learn without any cells we had an in silico model that would drive the pattern with random noise and essentially this was to test the control group you can think the media only control group I should say uh you can think of it as testing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 985.305,
    "end": 1002.578,
    "text": " were we able to get activity simply through our stimulation the in silico was saying could we get performance simply through something in the system itself you know making sure that the system isn't biased in any obvious way then we had a rest control group where this there were cells in a dish but no stimulation and this is asking the question",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1003.431,
    "end": 1012.596,
    "text": " Left alone will the spontaneous activity of neurons, because neurons always have activity regardless of whether you're stimulating them or not, will that lead to better performance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1012.656,
    "end": 1016.758,
    "text": "Again, there's no reason it should if our system is set up properly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.139,
    "end": 1020.621,
    "text": "Of course, if there's a bias, it would, but that's what we're testing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.101,
    "end": 1027.744,
    "text": "And then finally, we had both mouse and human cells that were given the information where the ball was, were given feedback, and were able to play the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1027.784,
    "end": 1029.285,
    "text": "And what you can see is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.172,
    "end": 1035.336,
    "text": " Basically, this is a little hard to interpret this graph if you don't stare at heat maps all day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1035.676,
    "end": 1046.906,
    "text": "But if you compare, say, just the top right, which is the number of hits that are occurring in any given minute by the minute on the x-axis, you can see that it doesn't really change too much over time for the control group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1046.926,
    "end": 1051.59,
    "text": "But compare it, and obviously the other, the in silico and the resting controls are kind of the same as that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.07,
    "end": 1056.514,
    "text": "If you compare it to the mouse and say the human cultures, you can see quite a clear difference here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1057.455,
    "end": 1062.838,
    "text": " And if you want more asterisks for significance, because who doesn't love asterisks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1064.218,
    "end": 1068.981,
    "text": "At least all scientists love asterisks or other symbols of significance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1069.061,
    "end": 1077.465,
    "text": "What we can do is you can see over time this control groups, the media control, the silico control, the rest control, they don't show any difference over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.985,
    "end": 1081.567,
    "text": "A bit of variation, but ultimately no real significant difference over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1082.147,
    "end": 1084.088,
    "text": "In contrast, the mouse and the human cells",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.329,
    "end": 1093.514,
    "text": " Both showed learning over time, and by the second time point, they outperformed all the other cultures, all the other conditions, I should say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1094.294,
    "end": 1099.097,
    "text": "Interestingly, the human cells even ended up slightly outperforming the mouse cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1099.137,
    "end": 1107.843,
    "text": "And although I would be careful not to overinterpret this, it was interesting to note that we've run this experiment a number of times, and this is a very consistent difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.703,
    "end": 1117.35,
    "text": " And so it could be an interesting way to start to investigate differences in the future between species if one wanted to set up a study more rigorously to actually test this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.671,
    "end": 1120.573,
    "text": "And these results were replicated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.613,
    "end": 1124.956,
    "text": "It wasn't like we found one measure that suddenly looked like performance and we ignored the rest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1125.797,
    "end": 1126.898,
    "text": "We looked at a number of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.558,
    "end": 1134.384,
    "text": "Some of the other interesting ones are stuff like the percentage of long rallies, where it's hit the ball more than three times in a row, so 4.4 plus in a row.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1136.733,
    "end": 1157.667,
    "text": " and you can see here again significantly did you know changes over the time for the mouse and human cells nothing for the others likewise the aces which is like tennis where they miss the ball without even hitting it once this decreases uh statistically significantly over time for the mouse and human cortical cells not for the others so much",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1158.867,
    "end": 1169.794,
    "text": " uh so that's interesting but you know we sort of say like well it's interesting it shouldn't be surprising because we know that neural cells are adaptive uh and the fact you can see it in a dish is cool but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1170.879,
    "end": 1172.119,
    "text": " What are the implications?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1172.159,
    "end": 1175.801,
    "text": "What can this actually teach us about how these cells are behaving?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.941,
    "end": 1182.363,
    "text": "And one of the things people have looked at in detail previously is functional plasticity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.443,
    "end": 1193.367,
    "text": "So what we looked at here is, of course, we also assessed functional plasticity and saw that there was a massive difference between the resting state functional plasticity and the gameplay functional plasticity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1194.907,
    "end": 1196.968,
    "text": " But what does that actually mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1196.988,
    "end": 1200.869,
    "text": "What does that actually look like, going beyond just the fact that there's plasticity occurring in the culture?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.59,
    "end": 1210.373,
    "text": "So what you can do is you can look here at just the correlation and the activity between the cells in the motor regions that I was showing you before and the sensory regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.213,
    "end": 1218.215,
    "text": "And it's not too surprising that whether or not they're playing the game, you have quite a high degree of correlation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.235,
    "end": 1222.457,
    "text": "In fact, the correlations at rest are slightly stronger than the correlations at gameplay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.359,
    "end": 1245.26,
    "text": " But what is interesting, actually, is if you take the average correlation, not just what is the overall correlation, but you actually break down the average correlation per culture and session, what you do is you actually get a far higher average correlation between the sensory and motor regions when they're playing the game than when they're at rest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.181,
    "end": 1270.121,
    "text": " this makes sense if you need to coordinate your action with incoming stimulation you need to have a degree of correlation between where you receive that action and the activity there and where you're at your activity outputs going out but conversely if you have in this case basically you can think of it as two buttons even though they're spread over four regions what you would actually need to have is a negative correlation or reduced correlation between these regions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1271.102,
    "end": 1291.369,
    "text": " uh and if you look at the percentage of exclusive motor region activity in this graph which is where you have activity in either the up or the down region and bear in mind again these are counterbalanced so this result is actually pretty interesting to see uh what you see here is that during rest versus gameplay you actually have a higher degree of uh exclusive motor region activity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1292.169,
    "end": 1316.294,
    "text": " uh which would of course be necessary for discrete control in one direction versus the other and that was this was quite an exciting result because it was really supportive sort of that there is something quite dynamic and interesting going on uh in in the way that these cultures are reorganizing their activity and likewise this actually just shows the degree that this correlation decreases over time uh with two linear regressions and you get two very different linear regressions over",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1317.114,
    "end": 1340.101,
    "text": " the first five minutes and the last 15 and we arbitrarily just based on some early work decided to and again not super arbitrarily but based on some early work i should say we uh decided to sort of split the games up into the first and stabilize and so that was quite supportive to suggest like what we're seeing here is really the tapping in of some of the key uh adaptive properties of the neural cultures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1341.55,
    "end": 1352.684,
    "text": " And to take it further, a bit more of a focus on the sort of free energy implications here, we can, of course, reframe surprise that has a link with information entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1353.849,
    "end": 1362.753,
    "text": " And as for those of you familiar with this, this can also be captured as a tail divergence between the two distributions of what might be occurring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1363.453,
    "end": 1367.674,
    "text": "And so we wanted to actually calculate here the information entropy of the actual cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1367.694,
    "end": 1370.896,
    "text": "And now it's important to note here, this is internal to the cultures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.896,
    "end": 1395.735,
    "text": " uh both at gameplay and at rest and if we didn't normalize it there's there's quite a lot of variation going on in any given culture but it becomes much clearer once you do normalize it uh simply to to baselines uh and you can see here that when you give them random feedback so one one thing i'll say firstly is that the gameplay normally actually has much lower information entropy than when they're at rest",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1396.874,
    "end": 1410.955,
    "text": " Two, when you give them random feedback, their information entropy increases massively, thereby suggesting that these cells indeed should be, under the free energy principle, should be predisposed to avoid this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1412.73,
    "end": 1414.112,
    "text": " And that's actually what we saw.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.272,
    "end": 1418.578,
    "text": "But what we're interested in is to say, well, what if we tried different types of feedback?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.618,
    "end": 1426.108,
    "text": "Like, how do we know, like, this is all well and good, but how do we know that this type of feedback is actually what's leading to these results?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1426.128,
    "end": 1426.869,
    "text": "Because it could be anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.33,
    "end": 1431.613,
    "text": " And so we set out and we introduced a few other control conditions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.213,
    "end": 1434.615,
    "text": "So this is our regular one that I've sort of was showing you before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1434.635,
    "end": 1437.177,
    "text": "If it was a bit unclear, hopefully this helps to clear it up a bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1437.877,
    "end": 1441.78,
    "text": "When they played the game, they missed the ball, they get random unpredictable sensory feedback.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1442.1,
    "end": 1443.581,
    "text": "When they hit the ball, they get predictable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1443.961,
    "end": 1450.886,
    "text": "We then added something we called the silent condition, which is when they missed the ball, they basically had all their feedback removed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1452.127,
    "end": 1454.909,
    "text": "And yet when they hit the ball, nothing, they didn't get any additional feedback.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1454.929,
    "end": 1455.81,
    "text": "The game just continued.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1456.545,
    "end": 1461.889,
    "text": " Now, it is important to note, of course, that when the game restarts after a miss, the direction of the ball is random.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.909,
    "end": 1470.235,
    "text": "So there is still some randomness in this game, but presumably less so than in the normal stim condition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.836,
    "end": 1474.759,
    "text": "And this can be contrasted with this open loop or no feedback condition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1475.499,
    "end": 1489.501,
    "text": " um their synonyms in this case basically where the game is played information about where the ball is is presented to the uh cells or the system cells or controls whatever the case is uh and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1491.04,
    "end": 1507.347,
    "text": " uh but if they miss they don't get anything changed if they hit they don't get anything changed and so really it's asking the question like will a culture just play the game for the sake of playing the game like there's no reason it should but maybe they like maybe they do so we wanted to test that and then the final condition we we included here of course is a rest condition",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.227,
    "end": 1512.829,
    "text": " And if this helps to make it clear, if you're more graphical, this can give you an example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1512.869,
    "end": 1517.612,
    "text": "So here you can see the ball going up, it hits it, and then you get like a predictable stimulation here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.652,
    "end": 1523.374,
    "text": "The ball goes, it continues, and it gets hit again, and then it misses and it gets a random feedback, and then the game continues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.995,
    "end": 1530.198,
    "text": "Silent in contrast, you can see that this random feedback here at the same time point is removed for the silent condition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1530.398,
    "end": 1533.139,
    "text": "Likewise, there's no predictable stimulation across the culture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.88,
    "end": 1538.823,
    "text": " And then the no feedback, it's just the ball becomes completely predictable from the very first serve.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1538.863,
    "end": 1541.304,
    "text": "There is no unpredictability in it at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.005,
    "end": 1551.63,
    "text": "And so when we look at the results here, and obviously, if you're interested, you can go look at the paper because we dive into this in similar detail as before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1551.73,
    "end": 1558.033,
    "text": "But just in brief, what I'll show you is that here, what we've done is just compared it to rest because it helps control the variability a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.114,
    "end": 1560.334,
    "text": "And it makes it look a little neater.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.975,
    "end": 1568.819,
    "text": " But essentially, the stimulus condition, they outperform rest, they outperform their starting position over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1568.859,
    "end": 1571.04,
    "text": "It replicates what we saw in the first study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1571.721,
    "end": 1574.702,
    "text": "And the silent one, there is a very slight increase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1574.762,
    "end": 1584.328,
    "text": "It doesn't reach statistical significance, but they do end up also statistically slightly better than the no feedback condition, which shows pretty much no learning compared to rest at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.268,
    "end": 1612.143,
    "text": " so that matches up pretty much with what we expect to see like around the free energy principle you know a condition that gets a small amount of randomness shows a small amount of learning if you want to do that but not a lot uh something that gets a lot of random information as a result of a an action that we we deem undesirable shows a greater tendency to avoid that action and something that has no incentive to behave in a particular way doesn't behave in a particular way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1613.271,
    "end": 1631.583,
    "text": " But what was really interesting and exciting for us also, although I'll be honest, it made us stop for a few minutes to actually think about why this has happened, was that when you look at this normalized information entropy, again, we got a replication that when you gave them random feedback, the actual internal information entropy goes up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1632.204,
    "end": 1635.586,
    "text": "With the silent condition, the information entropy also went up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1635.986,
    "end": 1637.067,
    "text": "And in fact, even more so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.107,
    "end": 1639.289,
    "text": "And we went, why would this be the case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1639.989,
    "end": 1646.175,
    "text": " And of course, what we realized quite quickly was, well, neurons left alone do fire spontaneously.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.195,
    "end": 1655.085,
    "text": "And when you take a neuron from a stimulated condition to an unstimulated condition, they do tend to re-engage with the random spontaneous activity quite vigorously straight away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1655.125,
    "end": 1659.709,
    "text": "And so we went, and yet it didn't show the same degree of learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.663,
    "end": 1665.766,
    "text": " So of course, like I will say, this is one finding that absolutely needs to be followed up more in the future, and we are doing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1665.967,
    "end": 1670.129,
    "text": "But it does have an interesting implication in terms of Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.53,
    "end": 1674.953,
    "text": "So I mentioned this before, I flagged it before, and this is why, because I think this is one of the really interesting results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1676.113,
    "end": 1684.579,
    "text": "So to go into more detail, what a Markov blanket is, is it's a statistical boundary that can distinguish an internal state from an external state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.999,
    "end": 1686.72,
    "text": "And this can be at any level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.76,
    "end": 1689.903,
    "text": "So it could be at an individual neuron, a cluster of neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1690.643,
    "end": 1697.711,
    "text": " a nuclear distinct functional region of the brain, the whole brain, the body, in relation to the rest of the world or what's outside it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.775,
    "end": 1719.49,
    "text": " And so the fact that, as I was saying, that we see that the silent condition even shows more randomness or information entropy than when we're actually providing external random information into the system is actually very, very consistent with what we know about the stochasticity of spontaneous activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.11,
    "end": 1726.975,
    "text": "But what it does also suggest is that cells will respond differently to randomness inside a system versus outside a system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1728.442,
    "end": 1730.656,
    "text": " And that was a really exciting result to sort of find like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.539,
    "end": 1735.501,
    "text": " I miss physical evidence that perhaps this marker blanket really exists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.541,
    "end": 1737.341,
    "text": "Of course, it makes sense it exists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.501,
    "end": 1738.762,
    "text": "Theoretically, there's a lot of reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.782,
    "end": 1744.064,
    "text": "I mean, even just the simplest notion that we can separate what our internal thoughts are from someone's external thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.205,
    "end": 1746.745,
    "text": "Sorry, not external thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1746.765,
    "end": 1757.409,
    "text": "Someone's external voice to us, I should say, suggests that we need to have some sort of barrier to distinguish these types of structured information, one internally, one external.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.47,
    "end": 1760.591,
    "text": "But seeing it was very, very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1761.691,
    "end": 1781.277,
    "text": " uh and so we also wanted to of course extend beyond this and sort of not just stop here and look at what other interesting things might be happening and you know one of the other interesting findings that we've we've recently completed and there's a pre-print of this up now is this idea of neural criticality and so what is criticality for those who aren't very familiar with it in brief",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.159,
    "end": 1789.301,
    "text": " it is this state where a population's activity is coordinated basically between two other states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1789.881,
    "end": 1796.583,
    "text": "So physically, you could think of it at that point between where water becomes ice and there's a point just in between, which is a transition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1797.043,
    "end": 1808.487,
    "text": "To bring it back to the brain, you can think of it as a brain that firing rate could be either highly coordinated, rhythmic oscillatory, much as like when we sleep or in catatonia, or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1809.767,
    "end": 1812.848,
    "text": " It could be completely disorganized, like in some cases of epilepsy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1813.288,
    "end": 1814.829,
    "text": "And then there's a middle ground.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.069,
    "end": 1817.089,
    "text": "And there's obviously quite a, you know, it's a spectrum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1817.49,
    "end": 1818.95,
    "text": "So there's quite a lot of middle ground.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.27,
    "end": 1823.512,
    "text": "But the closer you get to this sort of critical transition point, this is called criticality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1823.572,
    "end": 1829.974,
    "text": "And theoretically, it's been proposed to maximize, excuse me, there's my timer telling me to take a break.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1831.599,
    "end": 1838.908,
    "text": " It's theoretically has been proposed to act as a key criteria to maximize information transmission and capacity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.969,
    "end": 1845.417,
    "text": "And what's also really interesting is that it's been linked to a number of different cognitive behaviors, although the field is certainly a bit unclear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1846.445,
    "end": 1869.308,
    "text": " about what that is so uh it's been linked for example to responses to drugs working memory attention one of my particular favorites is scores of fluid intelligence uh but these studies have some some concerns with how how they investigate it and ultimately one of the biggest concerns is that they're doing these you know for these these ones at least in uh humans",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.989,
    "end": 1871.77,
    "text": " We have lots of compensatory mechanisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1872.31,
    "end": 1878.453,
    "text": "You have to use FMRI or similar, mostly FMRI measures to actually investigate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1878.894,
    "end": 1881.255,
    "text": "So there's a lot of barriers in actually concluding this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.755,
    "end": 1891.32,
    "text": "So we set up a study to actually investigate this and essentially, again, to not go into too much detail about the nuances, we looked at three key different metrics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.96,
    "end": 1895.462,
    "text": "There's been a bit of criticism in the field where people focus predominantly on power laws.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.042,
    "end": 1923.304,
    "text": " power laws can arise from noise alone so we wanted to avoid that shortfall and look at three different measures uh and so this is this is sort of the setup we had we took them we compared them either playing the game or at rest which i described to you before and then we looked at these things called the the dcc the branching ratio or the shape collapse error and we wanted to see how we could group them sorry my slides have frozen",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.695,
    "end": 1936.743,
    "text": " me try to jump to the next one all righty so hopefully that's back for everyone now let me just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.459,
    "end": 1939.159,
    "text": " There we go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1939.659,
    "end": 1940.04,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.58,
    "end": 1949.203,
    "text": "So what we saw here really surprisingly was a very stark difference in criticality across a number of measures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1949.223,
    "end": 1956.466,
    "text": "So you can just see here, basically the prediction between the rest and the active is quite a, just noticeably by eye, very different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1956.486,
    "end": 1958.967,
    "text": "And of course that's statistically significant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1959.447,
    "end": 1966.05,
    "text": "Diving into more detail, we could look at these different measures and this is just some quick overview of what those different measures look like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.43,
    "end": 1970.151,
    "text": " So the DCC, the branching ratio.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.171,
    "end": 1979.675,
    "text": "So for example, with branching ratio, critical systems sort of maintain the number of sort of threads of activity that might happen in a subcritical system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.855,
    "end": 1982.597,
    "text": "That variation will die off over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.657,
    "end": 1986.558,
    "text": "In a supercritical system, it's going to continue to expand up to a point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1987.298,
    "end": 1995.322,
    "text": "And then there's a shape collapse error, of course, which is looking to see how you can collapse different avalanche shapes across a given spectrum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.162,
    "end": 2007.251,
    "text": " And then looking across all of these, we get quite strong statistical differences showing quite clearly that when you have the system embodied in an environment, it's showing this measure of criticality, which is very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.712,
    "end": 2017.518,
    "text": "And one of the interesting things for this actually is that it shows that this criticality is very fundamental and that information input seems to drive it very strongly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2017.959,
    "end": 2024.284,
    "text": "And to us, this does seem like a challenge, suggesting that it is in itself inherently a marker of some sort of higher order",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.164,
    "end": 2053.414,
    "text": " uh system uh but of course i think the most interesting thing is simply that we can identify this and then what it does is open up the possibility to further investigate it with more nuanced tests that were explicitly designed to investigate criticality um but what was nice also to see like i guess some suggestion that it does have a role in some sort of information processing in some degree uh is the fact that uh here's also just showing you these results in a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2054.134,
    "end": 2077.558,
    "text": " slightly different measure but looking at the correlations there were some statistically significant correlations between the different measures of criticality and the gameplay performance showing that cultures that showed higher degrees of criticality across all three markers also had better gameplay performance in this hit miss ratio where they hit the ball more often than they missed it which was of course interesting to see and does suggest that although",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2079.008,
    "end": 2098.313,
    "text": " we think that because this is arising in such a simple system, with such simple input, that it's unlikely to represent, or at least in of itself, be a criteria for intelligence per se, that there certainly is some link between processing information and criticality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2098.333,
    "end": 2102.514,
    "text": "And if you want a more nuanced discussion of this, please feel free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.534,
    "end": 2105.254,
    "text": "There's a pre-print up now while the paper's going through peer review.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2106.015,
    "end": 2107.375,
    "text": "We discuss it in more detail there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2108.516,
    "end": 2127.497,
    "text": " And finally, what I would say, though, is that just to sort of really hammer home the point that this is a very fundamental property of these cultures, and that is so drastically different when they're playing the game versus rest, that when we wanted to classify the cells based on criticality metrics and performance as either playing the game or rest,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2128.322,
    "end": 2133.344,
    "text": " We were able to do this with a 98% success rate if you took it to performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2133.444,
    "end": 2143.087,
    "text": "And even if you just ignored performance and you just looked at criticality, with Random Forest, we were able to do this with a 92% success rate of characterizing whether they're playing the game or at rest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2143.127,
    "end": 2148.689,
    "text": "And that obviously suggests that this is very fundamental, that once there's information input in these cells,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2150.748,
    "end": 2152.671,
    "text": " they drastically reorganize their activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.852,
    "end": 2153.953,
    "text": "And that's really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2154.795,
    "end": 2160.725,
    "text": "Of course, one of the questions that we also get asked a lot when we sort of put out this early work was a lot of people would say, oh, but who cares?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2161.206,
    "end": 2163.59,
    "text": "You know, we literally had someone write a comment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.367,
    "end": 2174.676,
    "text": " One of the peer reviewers actually at one of the points said to us, but this can't actually do anything better than reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2175.116,
    "end": 2179.301,
    "text": "So how can you conclude anything about biology, which was a surprising comment to get.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.042,
    "end": 2189.691,
    "text": " But what we wanted to do and said, fair enough, we think there's plenty you can learn about biology, whether or not it does better or worse than reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2190.191,
    "end": 2191.152,
    "text": "But it's a fair question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.292,
    "end": 2195.216,
    "text": "Does this do, performance-wise, can it do anything interesting compared to reinforcement learning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.256,
    "end": 2201.242,
    "text": "We know that if you run reinforcement learning enough, you will get superhuman performance with the game of Pong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2201.282,
    "end": 2201.963,
    "text": "They will solve it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2201.983,
    "end": 2202.684,
    "text": "They'll beat humans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2202.724,
    "end": 2203.124,
    "text": "That's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2203.425,
    "end": 2204.305,
    "text": "They can do the same with...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2205.396,
    "end": 2208.357,
    "text": " protein foldings, chess, go, that's all well and good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.037,
    "end": 2214.519,
    "text": "But does that mean that there is no room for a biological system when it comes to this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2215.059,
    "end": 2222.681,
    "text": "So what we wanted to do was actually compare it for sample efficiency, because that is, of course, something that reinforcement learning struggles with greatly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.081,
    "end": 2228.363,
    "text": "So what we did was we compared three different deep learning algorithms, DQN, A2C, and PPO,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2229.123,
    "end": 2234.45,
    "text": " with three different types of information input and against our biological cultures to see how they performed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.49,
    "end": 2243.722,
    "text": "And so just showing you here some results where we took the image vector, which had a CNN to run and process it and then feed it into the deep RL algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2244.323,
    "end": 2245.825,
    "text": "What we're able to see actually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2247.206,
    "end": 2253.813,
    "text": " was that our mouse and human cells, which are here in blue and orange, significantly outperformed and outlearned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2255.034,
    "end": 2259.118,
    "text": "DQN was pretty much always the lowest performer, which is fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.158,
    "end": 2260.78,
    "text": "We know that it's very sample inefficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2261.381,
    "end": 2270.49,
    "text": "But even more sample efficient algorithms like A2C and PPO also failed to show the same degree of performance, even though they started higher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2271.27,
    "end": 2276.652,
    "text": " for whatever reason we could never quite figure out, just some quirk of the algorithm, they never showed the same degree of learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.712,
    "end": 2279.933,
    "text": "And this was, again, mimicked across multiple comparisons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.813,
    "end": 2285.795,
    "text": "But what was brought up to us was this idea of saying, well, there is, of course, a curse of dimensionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2285.835,
    "end": 2293.077,
    "text": "So what you're doing is you're feeding in a, I think it was a 40 by 40 image vector to these deep reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.138,
    "end": 2296.178,
    "text": "And of course, it's going to take them longer to converge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.218,
    "end": 2297.839,
    "text": "They have to deal with more information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2298.539,
    "end": 2300.26,
    "text": " And we went, you know what, that's a fair point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2300.7,
    "end": 2302.602,
    "text": "So what we did was run it even simpler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.682,
    "end": 2312.247,
    "text": "And we came out and we said, all right, what we'll do is we'll feed them vectors of simply, you know, four vector matrix of where the paddle is and where the ball is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2312.568,
    "end": 2314.909,
    "text": "And that will be much simpler and closer to the game plane.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.969,
    "end": 2316.69,
    "text": "So we fed that into them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2316.83,
    "end": 2321.233,
    "text": "And what we saw was actually they formed us with less information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2322.84,
    "end": 2340.213,
    "text": " and of course these are the the mouse and human image time because we can't alter the information put in this way it was a post-hoc study the actual mouse and human cortical cells but yeah they did even worse across all metrics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.962,
    "end": 2364.927,
    "text": " and we found again they're outperforming it a little more information than what the uh people are getting because the cells are really only just receiving the ball position we don't we're not yet able to encode proprioception because the dish brain system is very simple and you know although we would argue again like this sparsity of information should truly make it harder not easier with less information and certainly with our initial pilot testing we found that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2365.467,
    "end": 2367.588,
    "text": " the more information you gave them, the better they could do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2368.048,
    "end": 2369.768,
    "text": "We again said, fair enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.048,
    "end": 2383.371,
    "text": "Let's change the information input to the reinforcement learning algorithms, give them the simplest possible information that matches as close as we could possibly do to what the cells are getting and see how they performed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2383.851,
    "end": 2389.573,
    "text": "And again, they performed even worse, suggesting that, in fact, more information is probably helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.873,
    "end": 2398.815,
    "text": " And so I think what we could show here is that, like, yes, there is certainly something interesting going on in neural cells and the way they're able to process information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2398.855,
    "end": 2411.579,
    "text": "And it comes back to this quote that I love so much, which is to say that, like, if the human brain or in this case, even a simple collection of neurons in a dish was so simple that we could understand it, we might be so simple that we couldn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2412.499,
    "end": 2423.089,
    "text": " uh and you know we like to think that the tools we're building such as this is going to help us to actually simplify it enough that we'll be able to unpick and start to understand the nuances behind this but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.065,
    "end": 2441.014,
    "text": " One of the nice things that we're able to show is that even without fully understanding all the nuances of what's going on inside a dish like this, we can see that it does have some distinct traits in terms of intelligence that have promising advantages for information processing above and beyond what's going on in reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.574,
    "end": 2446.657,
    "text": "We really think this hammers home that this is going to be a powerful tool to investigate these features in more detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2448.504,
    "end": 2467.884,
    "text": " So as sort of a summed up conclusion, what we're able to do with the system essentially is have a system of real biological neural cultures that can exhibit a very rudimentary form of natural intelligence through their inherent adaptive traits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.964,
    "end": 2469.305,
    "text": "And these adaptive traits",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2470.727,
    "end": 2475.431,
    "text": " like frankly, quite amazing to the extent and variety and diversity of what they're shown.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2475.471,
    "end": 2482.897,
    "text": "And even with the data that we've already generated, we're only just scratching the surface, but there's a lot of potential that they have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2483.058,
    "end": 2496.85,
    "text": "And so simply by having this closed loop system of electrophysiological stimulation recording via these multi-electrode arrays, we could embed them into a, or embody them into a simulated world, depending which term you prefer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2497.831,
    "end": 2511.115,
    "text": " and they could get better at playing it and moving the paddle to actually be able to perform the game with quite a consistent degree of coordination and with a faster learning rate than multiple reinforcement learning algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2512.055,
    "end": 2516.196,
    "text": "And of course, this is, as I said, it's a lot of work, and we're only just scratching the surface.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2516.236,
    "end": 2525.359,
    "text": "And so one of the things we're excited to do, because we're actually not an academic lab, we're a small startup based in Melbourne, Australia, is we want to open this platform up to everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.979,
    "end": 2549.361,
    "text": " so if you have a question or you think everything i've just told you is completely wrong and that neurons work in a totally different way that's fine you know reach out we will in next year um be opening up for alpha testing and so the most exciting projects will be supporting to have an early access to this if you want to investigate the properties of these neurons and you have basic python or java coding skills",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.543,
    "end": 2562.789,
    "text": " You can access them virtually and code them as an environment and see how they respond and test it and go away and write a paper sort of showing how you think that it should all work based on actual data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.53,
    "end": 2569.813,
    "text": "And this is because we acknowledge this is a whole industry like this or whole field of research, of course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2570.373,
    "end": 2573.235,
    "text": "And so we want to try and make these tools available for as many people as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2573.915,
    "end": 2576.236,
    "text": "And we're going to make it as easy for you as possible as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2576.277,
    "end": 2578.678,
    "text": "And it's going to be fairly affordable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2579.744,
    "end": 2582.287,
    "text": " So that's the end of the talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.808,
    "end": 2587.113,
    "text": "And of course, it's not just me working on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2587.273,
    "end": 2590.838,
    "text": "There's a whole team and a number of collaborators that we work with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2590.878,
    "end": 2593.361,
    "text": "These are just the collaborators that sort of touch on this work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2593.721,
    "end": 2597.066,
    "text": "There are many other very valuable people we work with and are expanding in other areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2597.726,
    "end": 2606.814,
    "text": " And so, and actually we're fortunate enough that Professor Adil Razi, who's one of our closest collaborators, has actually been able to join us today for the discussion part of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2607.894,
    "end": 2610.877,
    "text": "And so if there are any discussions, really happy to take questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.959,
    "end": 2614.3,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2615.801,
    "end": 2615.941,
    "text": "Wow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2617.113,
    "end": 2622.098,
    "text": " Well, thank you very much for that excellent presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2622.158,
    "end": 2625.001,
    "text": "It gives us a lot to jump into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2625.802,
    "end": 2635.832,
    "text": "So perhaps Adil, feel free to say hello, introduce yourself and add any general remarks so that we can jump into some more questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2637.304,
    "end": 2638.745,
    "text": " Yeah, thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.166,
    "end": 2640.868,
    "text": "Great talk, Brett.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.088,
    "end": 2648.435,
    "text": "And as always, you did, it was a tour de force through so many projects that you love.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.775,
    "end": 2651.498,
    "text": "It is really doing amazing work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.538,
    "end": 2656.063,
    "text": "So I'm based at Monash University.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.523,
    "end": 2663.745,
    "text": " We're not that far from where Cortical Labs is in the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.765,
    "end": 2674.947,
    "text": "We are a bit suburban at the main campus, Monash University, where we have this computational systems neuroscience lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.487,
    "end": 2682.449,
    "text": "And our lab is using brain imaging and computational models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.308,
    "end": 2694.834,
    "text": " especially dynamic, causal modeling, uh, and active infants, uh, as frameworks to look into the brain and try to understand what's up, you know, um, uh, yeah, how,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.695,
    "end": 2704.057,
    "text": " how one can look at the mechanisms of, for example, how the brain implements coordination, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.857,
    "end": 2714.66,
    "text": "For this, we use, as I said, mathematical framework of divinference and also dynamic causal modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.58,
    "end": 2722.141,
    "text": "So that's basically what we are doing and happy to contribute to this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.521,
    "end": 2724.222,
    "text": "It spreads, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.775,
    "end": 2740.354,
    "text": " you know there and it should be uh the one who should be talking well and i would be gladly just sitting here and listen to wonderful uh interaction we already are having awesome well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.397,
    "end": 2749.045,
    "text": " My first question, just for context, was how did active inference come together with this line of research?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.365,
    "end": 2754.51,
    "text": "Were you studying active inference and then looking for an embodied system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2755.391,
    "end": 2763.239,
    "text": "Or was it something like you were studying this very interesting system and looking for some type of framework to help you model it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2765.129,
    "end": 2765.609,
    "text": " Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.629,
    "end": 2766.63,
    "text": "It's a great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2766.651,
    "end": 2769.314,
    "text": "And it goes back historically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.414,
    "end": 2777.923,
    "text": "So Andy Kitchen, actually, and Hon, who's one of the founders of the company,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2779.565,
    "end": 2783.148,
    "text": " they were interested and they were looking for ways to explore it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2783.308,
    "end": 2791.995,
    "text": "And actually, Adeel, you ended up having a conversation with them, I believe, and they were basically looking for a method of like, how could we talk to the cells?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.055,
    "end": 2794.177,
    "text": "And they came across Active Inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2795.038,
    "end": 2796.799,
    "text": "Or did you introduce them to Active Inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2798.841,
    "end": 2804.966,
    "text": "I would say that Andy and Hon at that time, that we are talking about late 2018, early 2019,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.292,
    "end": 2836.858,
    "text": " um and they were already interested in free energy principle um and but then i just moved to melbourne from from london in mid-2018 and i ended up giving a talk at alfred where cortical lab is being incubated at the time um and i was discussing these uh these ideas and so it was kind of uh you know um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.728,
    "end": 2854.615,
    "text": " interaction which just happened and then we thought yeah well okay there's lots of synergy and there we go uh we had uh we workshopped some of the early ideas uh at that time um and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.131,
    "end": 2879.43,
    "text": " thought about you know on and and Andy were really thinking about how to actually what could be the first thing that we should do which would then um really uh showcase the power of the dish brain of course the dish brain exact name came later on yeah yeah probably his brain child no no actually this frame this frame is a name",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.81,
    "end": 2890.986,
    "text": " definitely goes goes to andy as well um okay i would have given it some some sort of uh esoteric uh name that that everyone would have gone what the hell is that so no good call by andy to do that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2891.912,
    "end": 2900.516,
    "text": " Yeah, but of course, like it does have a lot of really useful features, the whole active inference framework that make it quite an ideal thing to test.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.896,
    "end": 2915.023,
    "text": "You know, the whole action perception cycle, the fact that there are like implications that you can simply take and be able to test the biological plausibility of it or make it very useful as a system for us to adopt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.863,
    "end": 2941.93,
    "text": " um having said that though and like you know deal can attest to this like we also well i think that it was uh i think as a neil seth calls it uh maybe other people call it that too it was a bit of an adversarial uh collaboration in some aspects as well because we were interested in the idea but we had no stake in proving or disproving it we were simply testing it and so we had a number of discussions as we went through you know what if we see x y and z",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2943.931,
    "end": 2969.142,
    "text": " uh what would be the states just kind of challenge it not just support it and so i think that was one of the things that made it a really exciting collaboration in that there was a high degree of skepticism amongst the team about pretty much everything we did um and i think that's what came together in making quite a nice paper because we were like as everyone should be in science but let's be realistic seldom are we were trying to be our own worst critics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.046,
    "end": 2973.048,
    "text": " because we were trying to figure out what else could be explaining it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.809,
    "end": 2984.515,
    "text": "And I think there are interesting future directions we can explore, but certainly the results, as they are, did find support that this certainly is a key characteristic of how cells respond.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.081,
    "end": 2988.422,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2989.022,
    "end": 2995.551,
    "text": "So one preemptive question about learning and then we'll drive back towards active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.031,
    "end": 3003.881,
    "text": "So what kinds of mechanisms do the neurons use to engage game mode and also to learn?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.742,
    "end": 3009.205,
    "text": " Are they changing their topology in terms of their connectivity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.845,
    "end": 3012.206,
    "text": "Are they changing what happens at synapses?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3012.346,
    "end": 3014.628,
    "text": "Are there changes happening inside of cells?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.028,
    "end": 3021.652,
    "text": "What happens when the game mode turns on and how does it actually improve throughout the course of that experiment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3024.108,
    "end": 3025.331,
    "text": " Look, that's a great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3025.631,
    "end": 3028.638,
    "text": "And the reality is we don't have the full answer for that yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3030.061,
    "end": 3034.81,
    "text": "Most likely, it's going to be a combination of the latter two you mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3035.6,
    "end": 3039.223,
    "text": " changes that are happening potentially inside cells or inside synapses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.263,
    "end": 3042.686,
    "text": "I mean, it's not necessarily too useful to try and break those apart.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.327,
    "end": 3053.915,
    "text": "The idea of like larger scale morphological changes are less likely simply due to the time scale that we see and the fact that we don't typically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.022,
    "end": 3060.484,
    "text": " Although there will be some future work showing some other things as we've moved on and advanced with our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.124,
    "end": 3065.025,
    "text": "We typically, in this study at least, didn't see learning across days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.225,
    "end": 3068.946,
    "text": "So it's unlikely there are massive changes in connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.287,
    "end": 3073.248,
    "text": "It's more likely that it's functional changes in plasticity and how they respond to information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3074.548,
    "end": 3085.113,
    "text": " And it could be a number of things like it could be, you know, of course, it's probably some sort of relationship and balance between heavy and homeostatic plasticity, long term potentiation to long term depression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.833,
    "end": 3091.396,
    "text": "And then there's so many mechanisms that you can break down to look at how that is, you know, from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3092.156,
    "end": 3105.942,
    "text": " you know like one interesting candidate could be looking at like phosphorylation of coughlin which interestingly takes i think about five minutes uh to to uh translocate from from inside to outside uh synapses and then is known to alter long-term potentiation uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3108.001,
    "end": 3109.302,
    "text": " which would roughly accord with that time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3109.342,
    "end": 3112.203,
    "text": "But this is something we need to investigate more in the future.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3113.724,
    "end": 3124.23,
    "text": "Higher level to that, I mean, Adil might have some ideas to sort of discuss higher level than this, you know, less reductive and more high level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.75,
    "end": 3127.532,
    "text": "Yeah, more computational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3128.092,
    "end": 3131.094,
    "text": "So, yeah, I mean, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.008,
    "end": 3148.812,
    "text": " We are really interested in learning mechanisms, and especially from active, in terms of what are the learning mechanisms in artificial, that we can mimic in artificial neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.952,
    "end": 3156.914,
    "text": "So one of the, while we have the biological chip, which can learn, can we actually now understand how it's doing this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.274,
    "end": 3159.555,
    "text": "And can we, in the short term, have,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.419,
    "end": 3164.12,
    "text": " better artificial neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.601,
    "end": 3171.025,
    "text": "Of course, where Brett and his team is taking to us that we actually don't need the artificial neural networks anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.725,
    "end": 3174.487,
    "text": "We'll just have the biological chips, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.487,
    "end": 3177.529,
    "text": "So that's exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.489,
    "end": 3189.516,
    "text": "So we have been looking at certain things, some of the more unresolved problems in deep learning and in machine learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.974,
    "end": 3195.176,
    "text": " For example, lifelong learning and continual learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.476,
    "end": 3205.559,
    "text": "We know that artificial neural networks, they break down in tasks where you have to do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.5,
    "end": 3230.901,
    "text": " multiple tasks in series and they could do very good human-like performances on a single task, but then you train them on the second one and then they forget what they learned in the first one, unlike humans who could run, swim, speak without forgetting what, otherwise it will be catastrophic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.817,
    "end": 3232.678,
    "text": " So that's one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.758,
    "end": 3237.422,
    "text": "Another thing, you know, credit assignments, one of the bigger problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.842,
    "end": 3246.589,
    "text": "How do you actually solve the credit assignment problem, which is, again, an unsolved, long-standing problem in deep learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.21,
    "end": 3256.997,
    "text": "So what sort of choices we make that result in rewards in future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3257.017,
    "end": 3257.798,
    "text": "So what are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.944,
    "end": 3261.789,
    "text": " And many a times what happens, there's a delay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.631,
    "end": 3267.96,
    "text": "There's a delay in recording what behaviors resulted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.579,
    "end": 3296.804,
    "text": " in the in the in the world for example uh so so looking at what elements and what choices that we made that resulted in a long-term gain is another problem that that i we really don't know right now how do we actually going to but these are bigger very big problems which are unsolved and i think it just shows you the the power of the display system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.384,
    "end": 3310.494,
    "text": " that it can actually help us to you know i think there's a real um real opportunity here for us to actually attack those problems as well at the power level yeah as brett was saying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.321,
    "end": 3315.562,
    "text": " And I think it comes down to also being the right tool for the right job.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3316.363,
    "end": 3330.209,
    "text": "So reinforcement learning CNNs can do amazing things if you've got the data to train them, if you've got the rest of the setup that you need and you want to use it for the right purpose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3331.488,
    "end": 3336.514,
    "text": " Are they very good for doing stuff in dynamic real time with limited data, fuzzy information?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.696,
    "end": 3338.477,
    "text": "So far, no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3338.497,
    "end": 3341.961,
    "text": "And so maybe there will be a case where we can take",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3342.995,
    "end": 3370.254,
    "text": " some of the findings from how neurons work and apply it in an algorithm in itself uh you know i know and i did a deal and his his team are doing some amazing work with uh you know building up active inference models uh and i think those results are really gonna you know i think excite a lot of people just as just as just as some flagging of some of the work you're doing a deal i won't mention anything else but it's going to be really exciting i think for people to see what's what's happening um and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.688,
    "end": 3379.032,
    "text": " But likewise, I do think that there will be things that biology maintains superiority over the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3379.152,
    "end": 3389.877,
    "text": "And the nice thing about biology, of course, when you talk about generalized intelligence, is we have no proof of principle that generalized intelligence can arise out of silicon hardware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.842,
    "end": 3393.003,
    "text": " or quantum-based hardware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3393.744,
    "end": 3398.706,
    "text": "We do have proof of principle that it can arise out of biological wetware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.507,
    "end": 3406.931,
    "text": "Our brains, and brains of flies, of cats, of rats, whatever, show general intelligence to differing degrees.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3407.831,
    "end": 3413.296,
    "text": " And so to us, it's like not a question of can biology show generalized intelligence, but how do you get there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3414.056,
    "end": 3418.66,
    "text": "And that's a less speculative question, not necessarily an easier question to answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3418.68,
    "end": 3421.262,
    "text": "It's not easier necessarily, but it does give you that ground truth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3421.522,
    "end": 3423.844,
    "text": "It's the thing in and of itself sort of answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3427.93,
    "end": 3429.171,
    "text": " Wow, so much there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3429.912,
    "end": 3437.798,
    "text": "In silico and in principle systems can display open-ended symbolic learning going back to the Turing machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3438.578,
    "end": 3456.051,
    "text": "But for the kind of open-ended enacted intelligence that we might be interested in, in settings like you described, which are real-time, fuzzy, and with small data, and we could also add with a high risk or survival threat, those kinds of settings",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3456.812,
    "end": 3477.314,
    "text": " we have empirical evidence across the surface of the planet that biological systems can make that happen and we have zero empirical examples of silicon chips making that kind of a functionality arise so that's a very interesting point um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3478.527,
    "end": 3497.49,
    "text": " That kind of brings to this question about the similarities and the differences between the artificial neural networks and the biological structure, and also between the reinforcement learning paradigm and the active inference paradigm in which rather than maximizing a reward function,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3498.371,
    "end": 3504.962,
    "text": " we are minimizing an expected free energy or a variational free energy by way of bounding surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3505.583,
    "end": 3508.608,
    "text": "So in describing the experimental setup,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3509.631,
    "end": 3532.812,
    "text": " the reward or rather the consequence of succeeding or failing was you adjusting the regularity of the input and in a reinforcement learning paradigm that's a little bit of an unconventional manipulation one might expect oh we'll add sugar or we'll add a dopamine agonist or an antagonist to the dish",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3533.666,
    "end": 3554.86,
    "text": " to signal the positive or the negative valence directly kind of by putting our our finger on the scale of the reward function but rather you were able to train and learn by changing the patterns of regularity of feedback so how does active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3555.78,
    "end": 3566.991,
    "text": " have similarity and difference with reinforcement learning in terms of the way that we can use patterns of regularity, not just valence of interventions in learning?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3569.314,
    "end": 3575.86,
    "text": "I'll give an answer that I'm going to pass over to Adil who can dive a lot more into the computational side of it than what I could.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3578.5,
    "end": 3580.481,
    "text": " What I would say, though, is that there's a few things as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3580.521,
    "end": 3586.404,
    "text": "Like one of them, of course, is can you even adopt a reinforcement learning paradigm in a dish?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3587.705,
    "end": 3597.731,
    "text": "It's not like there was a choice between the two, because we don't have access to a privileged reward network inside the dish to be able to say, you know, good sales, bad sales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.351,
    "end": 3603.714,
    "text": "You could, like in theory, squirt dopamine in, but you can't continually squirt dopamine in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3603.754,
    "end": 3605.935,
    "text": "You can't do it in a spatial or temporal way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3606.653,
    "end": 3608.998,
    "text": " resolution that's accurate enough, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3609.038,
    "end": 3610.56,
    "text": "It diffuses slowly across media.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.582,
    "end": 3612.524,
    "text": "We can't do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3614.427,
    "end": 3617.493,
    "text": "So for us, we needed to find something that was more fundamental.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3618.619,
    "end": 3636.976,
    "text": " and i think that's an important point and i think it's also interesting to note like that there are studies that look at the fact that you can mimic changes that you see with uh electrical information that you can also achieve through like the application of small molecules such as such as dopamine or whatever neurotransmitters",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3638.869,
    "end": 3643.794,
    "text": " And the right stimulation can increase long-term potentiation much in the same way that say dopamine would.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.575,
    "end": 3648.498,
    "text": "And so dopamine seems likely to be a tool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.139,
    "end": 3655.104,
    "text": "This is speculative, of course, but it seems likely to be a tool that shortcuts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3655.985,
    "end": 3677.517,
    "text": " uh the the way that these systems work in line with some broader imperatives such as free energy minimization more so than uh being something unique and special it is unique and special in its own right like in the way that it works but it must be serving a more fundamental function um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3678.365,
    "end": 3703.806,
    "text": " yeah i think that that's probably like a good way then to sort of lead into the differences between let's say an active frame inference framework and a reinforcement learning framework which which i think a deal would be best to best to discuss yeah um great question daniel uh first we started with the differences in uh in silico models or artificial neural networks and the biological neural networks so uh first of all as we see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.767,
    "end": 3716.902,
    "text": " uh the artificial neural network is a um is a caricature of an actual biological neuron um it just mimics that you know it takes an input uh you know and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.694,
    "end": 3718.674,
    "text": " gives you an output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.774,
    "end": 3721.215,
    "text": "There's a nonlinear function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.395,
    "end": 3729.879,
    "text": "And then once you have many of them and stack them up and make layers, they can do amazing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.919,
    "end": 3735.06,
    "text": "So this is like artificial neural networks just using one of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.766,
    "end": 3759.967,
    "text": " know a cartoon or what a biological neural network do it would do it it has a lot more than that it has it is an extremely complex uh biological uh you know thing so imagine now that uh you know we can we use all of the power and all the uh you know you know um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.262,
    "end": 3770.226,
    "text": " when it comes to what it can in terms of information processing and then build systems, how powerful they will be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.926,
    "end": 3776.128,
    "text": "As we know, currently these huge",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.109,
    "end": 3793.436,
    "text": " what we call these large-scale language models, for example, LLMs, and all those fundamental models that we have been seeing with billions of parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.776,
    "end": 3796.177,
    "text": "To train them, it requires",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.796,
    "end": 3815.503,
    "text": " a gigawatts of power it's basically like a whole city can build up with once they train now a human brain is just using a you know a small fraction of energy and time and power to do much more than what they could do they still can't do so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.038,
    "end": 3837.132,
    "text": " causal learning and causal reasoning problems very basics of them uh and while biological neurons can do it you know very easily as we are doing it right now we are having a back and forth discussion and you know um that's a big is one of the you know most uh sophisticated sophisticated and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.592,
    "end": 3862.788,
    "text": " huge neural network would not be able to achieve uh even for a few few few minutes um so that's that's what we are looking at there's an enormous um you know uh opportunity that we have to actually harness this power and do amazing things um now coming back to so that's you know uh now coming back to active inference and reinforcement learning now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.348,
    "end": 3876.89,
    "text": " this has been the uh this has been asked many times and um there are papers that call has it nothing new side it has a paper on on where they look at um you know uh however um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.95,
    "end": 3882.952,
    "text": " So I think active inference is biologically plausible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.553,
    "end": 3892.897,
    "text": "So the main difference is that when you are an active inference system is optimizing a single quantity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.917,
    "end": 3895.798,
    "text": "It's what we call the free energy, evasion free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.358,
    "end": 3902.041,
    "text": "And that gives you a single optimization function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.608,
    "end": 3908.591,
    "text": " you are doing perception, planning and decision making in the same with the same quantity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.891,
    "end": 3922.237,
    "text": "So let me put this this way, you know, things that how things have happened over the past few decades that we it has been always been about how to optimize a function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.478,
    "end": 3927.44,
    "text": "So once you have, let's say, a value function or reward in reinforcement learning,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.839,
    "end": 3931.301,
    "text": " It's all about how best you can optimize this quantity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.701,
    "end": 3938.084,
    "text": "Well, what we are asking, we are saying that what is we are optimizing, not how we optimize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3938.424,
    "end": 3940.025,
    "text": "So what is that quantity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.145,
    "end": 3942.686,
    "text": "And that's the vision synergy that we are optimizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.006,
    "end": 3946.128,
    "text": "And it gives you all of that in a single year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.983,
    "end": 3953.571,
    "text": " compared to a reinforcement learning system that would require multiple objective functions to optimize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.891,
    "end": 3957.716,
    "text": "So I think it's not biologically attainable to have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.151,
    "end": 3965.874,
    "text": " So I don't think, and that's why the active inference is a unifying framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.134,
    "end": 3981.001,
    "text": "And it probably would rattle and offend few that we think that active inference subsumes all those computational frameworks like reinforcement learning,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.182,
    "end": 4000.665,
    "text": " you know, into dynamic programming and all those derivatives because it is basically what the brains are doing, you know, and they're doing it better than what, you know, framework that we have been using so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.565,
    "end": 4004.646,
    "text": "So I think there are differences, clear differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.646,
    "end": 4010.507,
    "text": "And however, having said that, I would really would like to see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.528,
    "end": 4027.391,
    "text": " uh in future and probably we probably will have a dig at it how you can actually uh mathematically which is then become unambiguously sure um provided a proof that where these uh you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.482,
    "end": 4030.684,
    "text": " why active inference is superior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.704,
    "end": 4032.646,
    "text": "So there's still a gap there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4032.946,
    "end": 4046.818,
    "text": "While we could develop insular co-active inference agents and we can show them that they are doing better than reinforcement learning agents, and we have quite a few, there's a whole...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4048.619,
    "end": 4062.276,
    "text": " sort of work that one of my PhD students, Ashwin Paul, is doing and the papers are coming, where we are comparing active influence agents with the state of the art, reinforcement learning and deep learning networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.999,
    "end": 4074.569,
    "text": " And we are showing, of course, the active inference is doing better, but the theoretical proofs are still missing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.629,
    "end": 4078.052,
    "text": "Similarly, like how active inference is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.322,
    "end": 4082.244,
    "text": " What are the similarities and differences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.264,
    "end": 4087.568,
    "text": "For example, I would be very interested to know how it's different from Tudorov's work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.048,
    "end": 4089.729,
    "text": "And again, Ashwin is looking at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.17,
    "end": 4097.916,
    "text": "I even know Tudorov's paper, P&A's paper in 2009, which looks at efficient computations, optimal action, which is far reaching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.116,
    "end": 4102.099,
    "text": "They show that you can both in discrete and continuous settings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.627,
    "end": 4115.17,
    "text": " They have shown that the algorithms can beat dynamic programming and learning-based algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.57,
    "end": 4116.431,
    "text": "What is this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.611,
    "end": 4121.512,
    "text": "What is how active inference is different from Tishpa's information bottleneck?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4124.053,
    "end": 4138.658,
    "text": " how how what are the links between universal prize of solomon off all those all those things i still you know it's it's really early days uh you know uh what are the similarities the differences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.354,
    "end": 4150.962,
    "text": " of active interest with all those big ideas, which are therefore, you know, in cybernetics and other literature for many, many, many years, for decades, what are the differences and in similarity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.002,
    "end": 4151.962,
    "text": "So it's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4152.243,
    "end": 4156.386,
    "text": "We don't have all the answers, but, you know, all the, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.986,
    "end": 4162.57,
    "text": "So it would be very exciting next few years, looking at all those big questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4165.236,
    "end": 4188.383,
    "text": " just wanted to echo one point you made and then ask a question from the chat so in reinforcement learning what you should optimize is almost treated as an obvious question you want to win the game you want more points that's the way to win you want to stay alive then you want to optimize survival so that's your reward function and what to optimize is kind of swept under the rug",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4188.923,
    "end": 4191.485,
    "text": " And then there's this big question of how to optimize it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4191.866,
    "end": 4203.855,
    "text": "And that's what has led to this enormous diversification of different approaches and heuristics for how to optimize and different gradient descent methods and so on in reinforcement learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4204.816,
    "end": 4226.279,
    "text": " in contrast in active inference what to optimize is actually known it's the variational or the expected free energy as exactly specified by the generative model and we know how to optimize it which is with a variety of locally plausible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4226.88,
    "end": 4254.002,
    "text": " biologically inspired update rules for example message passing and belief propagation so that's a very subtle but also paradigmatic difference which is that the structure of what we're going to optimize as our unified imperative for perception cognition and action the free energy functional has methods and software packages that will step by step convergently optimize it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4254.702,
    "end": 4277.319,
    "text": " and so the onus is actually to specify the generative model in a useful way rather than treating what should be optimized as just a bygone discussion and then go into all these questions about implementation which are the parts that actually differ the most across systems so i think that's very um insightful i wanted to ask a question from the chat from michael",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4278.82,
    "end": 4283.922,
    "text": " What would be the difference if you change the electrode array to stimulate differently?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4284.202,
    "end": 4290.065,
    "text": "For example, instead of just growing the neurons on top, what if the neurons synapsed with the electrodes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4290.665,
    "end": 4299.049,
    "text": "So what kinds of experimental setups are possible and which ones are interesting and how do you know and what do you choose to do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4301.3,
    "end": 4326.08,
    "text": " i think the the first thing to say about that uh good question and certainly as the technology develops we'll be able to ask these questions in better and more interesting ways like it's probably worth well you know i've made this comparison before but i'll make it again like the the work that we've done here is you know we we're excited by it but at the same time like it is probably equivalent to like the early transistors made by shockley",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4326.79,
    "end": 4339.803,
    "text": " know it's janky it's kind of ugly it does a job but not without not without limitations um and so you know what we're really excited in is as the community hopefully come together and work on this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4341.078,
    "end": 4362.833,
    "text": " five ten fifteen twenty years maybe longer uh you know 70 years of continuous development have led from a transistor being a large ugly thing to thousands of them you know within every device that i can see uh so that's like one thing i'll just say in terms of like i will point out like that the the neurons do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4363.974,
    "end": 4369.038,
    "text": " in as much as they probably ever can integrate with the electrodes as is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4369.358,
    "end": 4378.766,
    "text": "As you saw from that picture I showed at the start, they are deeply integrated into the electrode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4379.666,
    "end": 4384.63,
    "text": "We could not and let the neurons survive remove them in any meaningful way and keep that structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4384.65,
    "end": 4390.675,
    "text": "To get them, we'd have to completely disassociate that structure, and most neurons won't survive that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4392.643,
    "end": 4415.334,
    "text": " very long anyway uh so they are currently integrated like i mean synapses synapses work slightly differently uh yeah there's a whole there's a whole collection of traits like there is of course electrical activity is a shared language between neurons and and uh the hardware and that's what makes it possible to stimulate them with electricity because it can it can sort of mimic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4415.854,
    "end": 4422.239,
    "text": " the change in ions across the membrane to stimulate action potentials, which is how they then communicate with electricity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4422.259,
    "end": 4427.143,
    "text": "But then action potentials, of course, trigger the release of chemical signals and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4427.323,
    "end": 4429.204,
    "text": "And so there's a lot that's going on there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4429.364,
    "end": 4431.406,
    "text": "And I think it's about building the bridge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4431.886,
    "end": 4433.207,
    "text": "It's not necessarily about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4435.987,
    "end": 4445.953,
    "text": " I don't know quite the right way to phrase this, about completely recapturing everything that's unique to biology and the hardware or unique to the hardware in biology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4446.453,
    "end": 4450.036,
    "text": "It's about where's the useful bridge and synthesis",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4451.429,
    "end": 4472.578,
    "text": " uh between them to elicit the best of both worlds and and again it comes down that right tool for the right job but in this case it's like a different circumstance like what's the right tool to process the information uh is it is it a biological part is it the hardware part uh and so when we communicated then what we need to figure out and again this is an open question like i'm not sure where it will go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4473.283,
    "end": 4478.668,
    "text": " But what we need to figure out is what's the best way at the time with the technology we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4478.728,
    "end": 4489.857,
    "text": "Right now, it's not trying to replicate sort of hardware-based synapses to do sort of chemical communication, although maybe in the future it will be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4490.883,
    "end": 4492.304,
    "text": " But yeah, it's a very interesting question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4492.324,
    "end": 4495.525,
    "text": "And the base of the answer is we don't really know where it could go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4495.545,
    "end": 4497.565,
    "text": "And we don't know where it would do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4497.585,
    "end": 4501.286,
    "text": "As I mentioned in the talk, they are incredibly plastic neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4501.767,
    "end": 4503.227,
    "text": "We can change the configuration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4503.267,
    "end": 4504.467,
    "text": "We can change the type of neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4504.487,
    "end": 4506.028,
    "text": "We can move from 2D to 3D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4506.088,
    "end": 4508.289,
    "text": "And this is work that we have ongoing now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4510.049,
    "end": 4515.931,
    "text": "And I think that what we're going to see is just an explosion of results as we start to make inroads in this area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4519.309,
    "end": 4539.796,
    "text": " saying that the neurons might not survive the separation from their cyber physical digital substrate reminds me of the reality of some to all of us today if we were also stripped from our digital substrate many critical systems also would not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4540.236,
    "end": 4544.778,
    "text": " function and I think that speaks to some of the recent work of Friston et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4545.038,
    "end": 4564.825,
    "text": "at Versus with the idea of the ecosystems of shared intelligence where we're thinking about distributed cognitive processes that are mediated by interfaces and so some emitted data set is received by another cognitive entity on the other side of the blanket",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4565.465,
    "end": 4585.459,
    "text": " maybe it's person to person maybe it's computer to computer or something mixed or some augmented system but there's a really tractable and elegant way to talk about those heterogeneous systems so even if in the local context one algorithm or another outperforms another",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4586.26,
    "end": 4593.753,
    "text": " there's going to be an immense value for using active inference and FEP to just talk about how to compose these systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4594.254,
    "end": 4597.4,
    "text": "And so that's very important insight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4598.722,
    "end": 4601.804,
    "text": " 100%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4598.862,
    "end": 4601.804,
    "text": "That's a really good point, Daniel, like, very valuable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4601.884,
    "end": 4608.887,
    "text": "And I, yeah, it comes down, I think, like fully agree with you, it comes down to like, how do we phrase and think about these even and that's a challenge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4609.587,
    "end": 4615.85,
    "text": "Like even discussing what these systems are, and what they're showing is a challenge right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4615.91,
    "end": 4618.352,
    "text": "And we need to work on building up that language together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4618.392,
    "end": 4625.195,
    "text": "So we can can have those useful discussions and figure out how to how to leverage this distributed network that we're all I think it's inevitable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4627.163,
    "end": 4631.3,
    "text": " that you bring up that that's where we are and we're only going to go deeper down that direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4633.28,
    "end": 4633.64,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4633.76,
    "end": 4639.361,
    "text": "Just a little bit of some questions on information as we head towards the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4640.041,
    "end": 4652.304,
    "text": "It was a very striking finding about the changes in information dynamics when gameplay was activated versus rest, as well as during learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4652.724,
    "end": 4656.485,
    "text": "And also that's kind of analogized by, let's say, a person in an fMRI",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4657.825,
    "end": 4669.008,
    "text": " And they're mind wandering, they're engaging the default mode and then some task comes on and the information dynamics sharpen and we associate that with the mechanisms of attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.388,
    "end": 4679.931,
    "text": "So how did you measure or quantify the information or what do those informational measures mean in the context of neural firing patterns?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4683.123,
    "end": 4684.263,
    "text": " Yeah, that's a big question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4684.383,
    "end": 4690.745,
    "text": "And it's, again, it's something that we need to do more work at diving into to actually unpick about what it actually means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4691.485,
    "end": 4695.586,
    "text": "At this point, what we're limited to look, well, that's not entirely true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4695.886,
    "end": 4697.006,
    "text": "We're not limited to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4697.026,
    "end": 4702.847,
    "text": "What we did look at just for the sake of time and complexity were individual spikes in a given location.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4703.447,
    "end": 4705.948,
    "text": "And so you can arrange that spatially and temporally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4706.588,
    "end": 4711.349,
    "text": "And so what we've looked at, and we've dived into this more work with our recent work with organoids as well, trying to pick apart",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4712.133,
    "end": 4717.395,
    "text": " sort of the sub functional sub units of computation or intelligence or whatever word you want to use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4718.816,
    "end": 4726.96,
    "text": "But yes, essentially what it is, is it's the pattern of activity you're seeing across time and space for a given spike in a location versus the other ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4727.68,
    "end": 4730.861,
    "text": "And so there's a number of ways you can look at this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4730.881,
    "end": 4736.344,
    "text": "I think the really exciting stuff that's coming out is around sort of trying to break apart.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4737.084,
    "end": 4737.905,
    "text": "So people started",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4739.056,
    "end": 4744.6,
    "text": " Hodgkin-Huskley models, et cetera, they looked at neural spiking and they were like, how does a single neuron spike?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4744.62,
    "end": 4745.861,
    "text": "What makes a single neuron spike?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4745.881,
    "end": 4754.567,
    "text": "And they came up with some rules that are mostly true, but now we know are kind of still wrong because many neurons follow those rules and many do not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.707,
    "end": 4756.688,
    "text": "And some are circumstance dependent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4757.922,
    "end": 4764.864,
    "text": " And then people sort of extended that and they looked at how the given system changed its activity over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4765.184,
    "end": 4771.786,
    "text": "And then, of course, you can expand that out and look at like how do pairs of neurons and then trios of neurons and grow that up into a whole population.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4772.426,
    "end": 4777.387,
    "text": "And so what we've tried to do with this work that I've sort of shared with you today is look at that at a few different levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4777.907,
    "end": 4782.709,
    "text": "And so depending the level depends the exact answer to like what is information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4783.369,
    "end": 4783.609,
    "text": "But",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4785.757,
    "end": 4792.873,
    "text": " Essentially, the simplest answer is it's the spikes that we can see in this case going on and their relationships to other spikes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4794.448,
    "end": 4796.79,
    "text": " I don't know, Dil might have more to expand on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4797.651,
    "end": 4816.626,
    "text": "No, I think at some point, as you mentioned, we want to look at those functional subunits, using those mean field models, using those functional units.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.607,
    "end": 4844.263,
    "text": " as neural populations and then you know hopefully there emerges like you know a few functional subunits and then can we look at the connectivity patterns using for something like a neural mass models you know which have been used quite a lot um something like a gentleman with models but a bit more uh Dynamics in them um and uh yeah so that would be really interesting to see uh how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.063,
    "end": 4873.6,
    "text": " the patterns are emerging when neurons learn how the patterns are firing patterns and and and connections and and and and then uh you know uh how these are changing over time as more and more learning is happening and that would be something yeah we are all talking about lots of uh unknowns and lots of very interesting directions that one can take um which makes it all exciting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4875.049,
    "end": 4880.312,
    "text": " And I think like our thinking also, at least my thinking has changed over the course of looking at this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4881.333,
    "end": 4887.296,
    "text": "When I started out, I kind of thought, well, an individual neuron is the smallest functional unit, theoretically, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4887.336,
    "end": 4888.677,
    "text": "So that's probably what's going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4889.117,
    "end": 4890.358,
    "text": "And then they'll connect up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4891.298,
    "end": 4891.979,
    "text": "And then I realized, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4893.021,
    "end": 4918.302,
    "text": " think like yeah it is a single neurons a functional unit but so are two neurons and three neurons and and the collective you know uh you know exponential growth as you go out to a whole pattern at the end of the day when we look at actually at the levels we're looking at for example criticality if you if you go look at the preprint we broke it down into areas like sensory versus motor areas and we found that they all kind of behave more or less the same so does that mean that on the dish we have one functional unit or eight hundred thousand",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4919.153,
    "end": 4944.916,
    "text": " or everything in between and looking at looking at the organoid stuff that we've moved to that that we're not quite ready to share yet but like I think what we can sort of start to tentatively conclude from this work is that it's it is indeed that answer of like one to the combination of the the everything and I think that's what makes the biological systems and this is why I emphasize it in my talk look at the amount of connectivity and sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4945.723,
    "end": 4968.589,
    "text": " chaotic connectivity to some extent um that's occurring within these systems and that gives you something that we can't model with neuromorphic or with algorithms with any degree of um uh with the same traits at least i think i can say without being too controversial with the same traits we can't yet model that algorithmically yet and i think that makes it interesting as well",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4971.32,
    "end": 4971.66,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4972.1,
    "end": 4983.903,
    "text": "One just remark on that before kind of a closing discussion, the Hodgkin-Huxley models were on large single isolated neurons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4984.603,
    "end": 4990.905,
    "text": "And so a theme I heard you say multiple times was like the right tool or the right model in the right context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4991.565,
    "end": 4994.806,
    "text": "And so when studying sodium and potassium flows,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4995.606,
    "end": 5018.177,
    "text": " across the membrane of a single isolated neuron that is absolutely an appropriate model and something that provided immense insights and then as you pointed out especially if you're interested in properties of systems and connected neurons it's like a yes and like there are sodium flows",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5018.897,
    "end": 5044.69,
    "text": " but you could imagine contexts where learning happens and the informational pattern or the entropy of a given neuron does change or it might not change but the pairwise relationship might change or the pairwise relationship might not change but some higher order relationship does change and so that doesn't replace mechanistic or smaller subunit based models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5045.33,
    "end": 5073.635,
    "text": " but rather we can broaden the discussion to thinking even about the environment like of the dish or of our peripersonal space that these cognitive systems are embedded in and talk about distributed cognitive functions without privileging the ecological or the sort of atomic levels of explanation yeah absolutely and thank you for clarifying that if i if i sort of implied otherwise yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5074.699,
    "end": 5086.184,
    "text": " Awesome, no, just to highlight because despite the ring on the cover of the active inference textbook, there isn't a single model to rule them all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5086.344,
    "end": 5101.07,
    "text": "And I think like it's really by getting into the particulars of experiments and also by speaking with researchers and by talking about this kind of cutting edge research that we see how pluralism in the methodological and in the explanations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5102.23,
    "end": 5112.627,
    "text": " actually plays out and that's just very exciting um so i guess just a uh closing question and then we can just have any other remarks uh michael asks in the chat",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5113.823,
    "end": 5117.866,
    "text": " What should someone study or do to get more involved with this research?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5118.146,
    "end": 5124.03,
    "text": "I'm an undergraduate student interested in pursuing this field for my career, and I'd love to work with Cortical Labs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5126.752,
    "end": 5130.334,
    "text": "So I think it really depends the area you want to go down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5130.454,
    "end": 5132.395,
    "text": "We're always looking for good people to work with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5132.415,
    "end": 5139.48,
    "text": "And as I said before, this is going to be a whole industry and a whole field of research, we hope and believe anyway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5141.201,
    "end": 5146.864,
    "text": " So I guess you should pick what it is that interests you and what you're passionate about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5147.644,
    "end": 5149.325,
    "text": "There's so much stuff going on, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5149.365,
    "end": 5158.389,
    "text": "You could study electrical engineering, you could study physics, you could study software engineering, you could study neuroscience, you could study stem cell biology, anything in between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5160.45,
    "end": 5166.192,
    "text": "These are multidisciplinary, highly collaborative outputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5168.344,
    "end": 5172.268,
    "text": " I showed the team before we have people from all of those industries and others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5173.069,
    "end": 5183.319,
    "text": "And it's only the combination of these areas that give rise to the chance to actually make something that it's the Gestalt, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5183.359,
    "end": 5184.74,
    "text": "It's greater than the sum of its parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5185.34,
    "end": 5192.467,
    "text": "And I think honestly, that's one of the reasons why we've had some success coming from a sort of startup industry focus is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5193.328,
    "end": 5217.215,
    "text": " there's not that many of us and we don't have that much money but what we do have is like an amazing team of people to work with amazing collaborators like a deal to work with um and we can bring it all together in one spot and that's that's hard to do by its nature in academia like by its nature academia tends to silo and you have exceptions to that rule of course you have like very highly collaborative works that do come out of academia",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5218.203,
    "end": 5228.828,
    "text": " they're always they are always i've worked in academia um so they're always at a distance those collaborations they're not all under one roof with one one goal and one purpose so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5235.191,
    "end": 5237.093,
    "text": " Oh, no, just so yeah, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5237.373,
    "end": 5238.814,
    "text": "Any general comments?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5238.834,
    "end": 5239.995,
    "text": "Feel free to respond to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5240.095,
    "end": 5242.397,
    "text": "And also just any general thoughts you want to add.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5242.537,
    "end": 5247.101,
    "text": "I was I was I was to say I cannot recommend enough cortical labs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.281,
    "end": 5261.692,
    "text": "They are highly disciplinary, well, disciplinary team with expertise from cell biology to, you know, to software engineering, to real time interfacing, to computational models and machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.732,
    "end": 5262.773,
    "text": "So, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5264.054,
    "end": 5286.237,
    "text": " anything that you know your expertise and you you want to do there would be something that that that's there and really cutting edge and so um yeah I I think there's this whole project you know it just shows you know uh the whole breadth of things that we can do from uh from neurons to sentient behavior and I'm I'm patting my backs for saying sentient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5286.812,
    "end": 5314.186,
    "text": " sentence today which hasn't been said so um and and i should say brett is also leading a you know a project on on that site we which we didn't get chance to talk about about the about the nomenclature and all that that happens with the semantic of sentence and consciousness and emergency and all that um so um and and and and the whole ethics side of thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5314.693,
    "end": 5325.659,
    "text": " So there are big, big opportunities and questions, open challenges, and I think you... Actually, Adil, you make a good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.679,
    "end": 5328.441,
    "text": "I should use this opportunity, if I may, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5328.881,
    "end": 5331.903,
    "text": "At least a two-flag, yeah, we are engaging in a paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5333.043,
    "end": 5337.586,
    "text": "So if you are interested in the words that we use, whether you think that we use them correctly or incorrectly,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5338.326,
    "end": 5359.94,
    "text": " uh we would invite anyone you know we've made these offers before but it's a great place to say it again reach out um we are setting up and we will have a formal invitation uh somewhat soon i can't exactly say when because there's so much going on at the moment but fairly soon we'll have an invitation uh come join us let's work together and just like figure out what language we want to use as a community because uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5361.661,
    "end": 5366.212,
    "text": " then we can move towards actually building some stuff instead of just being caught up with like, what does this word mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5367.254,
    "end": 5368.356,
    "text": "And that's going to be necessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5368.417,
    "end": 5369.499,
    "text": "So yeah, please reach out to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5370.663,
    "end": 5395.364,
    "text": " Yeah, I'll just note one project at the Institute, which is the Active Inference Ontology, where we've been developing definitions and also translations across languages of core and supplemental terms, and we use that to annotate papers, we make natural language descriptions of mathematical formalizations, and we totally agree that ontology-based systems engineering",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5396.024,
    "end": 5420.944,
    "text": " for active inference cyber physical systems is how we're going to treat this with the respect and also bring in the discussions around ethics philosophy and so on so this isn't a linguistics debate that excludes other fields this is like laying down the dance floor so that we can actually have a discussion that's inclusive and meaningful going forward which is what is so important yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5421.636,
    "end": 5422.136,
    "text": " That's awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5422.457,
    "end": 5423.137,
    "text": "I got to look this up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5423.177,
    "end": 5424.558,
    "text": "I didn't know that you guys had one of those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5424.578,
    "end": 5425.539,
    "text": "I'm going to have a look up later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5426.639,
    "end": 5427.66,
    "text": "I'll send it to you in an email.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5428.0,
    "end": 5428.861,
    "text": "Well, thank you so much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5429.762,
    "end": 5436.786,
    "text": "What an awesome line of research and a December surprise or treat for us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5437.207,
    "end": 5438.888,
    "text": "So super exciting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5439.068,
    "end": 5444.151,
    "text": "And please always feel welcome to just reach out and join for any other time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5444.171,
    "end": 5445.892,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5446.032,
    "end": 5448.654,
    "text": "Thank you so much, Daniel, for having us and everyone watching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5450.425,
    "end": 5450.607,
    "text": " Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5450.891,
    "end": 5451.175,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  }
]