[
  {
    "start": 3.187,
    "end": 3.848,
    "text": " All right, welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4.789,
    "end": 6.01,
    "text": "Thank you everyone for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7.412,
    "end": 17.323,
    "text": "It is the first early session for cohort seven in this second phase of activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.724,
    "end": 26.393,
    "text": "So anybody who wants to sort of just check in with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.077,
    "end": 53.14,
    "text": " uh that i guess we could have done that before starting recording we just want to check in where are we at in this cohort as we head into the second half of this textbook in people's view or what would they like to do for this phase of activity for the kind of second half for this cohort and then we will turn to chapter six",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.465,
    "end": 61.672,
    "text": " Maybe Ali, and then anyone else who wants to raise their hand or just go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 67.178,
    "end": 74.766,
    "text": "Okay, so chapter six actually marks the beginning of the second part of the textbook.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 75.787,
    "end": 85.337,
    "text": "As we probably already know, the book organized into two different chapters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 85.317,
    "end": 86.139,
    "text": " parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 86.52,
    "end": 97.648,
    "text": "So part one is mainly theoretical, and part two basically deals with more practical applications of active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 99.252,
    "end": 99.833,
    "text": "So",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 101.18,
    "end": 110.615,
    "text": " As we saw in the first part of the textbook, the theoretical foundation of active inference is actually a work in progress.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 110.715,
    "end": 117.045,
    "text": "So it's not something that that has been",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 117.025,
    "end": 125.756,
    "text": " completed in order to be applied as a kind of comprehensive modeling tool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 126.196,
    "end": 143.438,
    "text": "But at the same time, the second part of the textbook provides a very promising roadmaps to and towards how we can apply even these tentative",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 143.418,
    "end": 156.174,
    "text": " foundational work in order to build some real world models of the intelligent agents or cognitive agents.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 157.095,
    "end": 171.332,
    "text": "So I think that's important to keep that in mind because in many textbook groups, I've seen people somehow raise this issue as to, well, it's not",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 171.312,
    "end": 176.178,
    "text": " as comprehensive as we thought as a modeling tool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 176.798,
    "end": 185.989,
    "text": "So since the publication of this book, obviously, active inference research has progressed a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 186.049,
    "end": 199.665,
    "text": "But even the theoretical foundations provided in the first part of the book, I believe, provides enough material to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 199.645,
    "end": 216.422,
    "text": " at least build some toy models that can capture some of the real world elements of real, real world agents, or at least cognitive agents.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 227.118,
    "end": 228.04,
    "text": " Thank you, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.06,
    "end": 228.4,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.222,
    "end": 238.099,
    "text": "Anyone else want to share where they're at as in this as we head into this part of the textbook?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.502,
    "end": 239.742,
    "text": "Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 239.802,
    "end": 246.595,
    "text": "So I think I would like to say that I missed the first half of this",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 247.486,
    "end": 271.907,
    "text": " uh group uh so i'm asking a question which belongs to chapter two i think or chapter three i don't know um and so my apologies for that and i don't want to hijack uh the discussion here uh and i've put my question also in the in the chat but basically comes down to um having understood the role of bias in",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 272.512,
    "end": 285.846,
    "text": " um active inference as having a dual role which is one kind of the intuitive role for me at least being vaguely familiar with patients inference is you know encoding prior beliefs",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 286.417,
    "end": 302.991,
    "text": " and also um having a kind of indicator rule of encoding preferences and i think this comes out of a discussion of oculomotor",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 302.971,
    "end": 323.106,
    "text": " behavior as well as other things and I was just wondering if you have discussed this at all and if I've yeah if a brief comment on this would be great but if you say well you should have you know attended the previous sessions and I'm fully happy with that as well and I will just tag along for the ride for now",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 327.305,
    "end": 327.686,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.773,
    "end": 339.947,
    "text": "There's a slide in this point raised in this paper that points to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 341.918,
    "end": 371.925,
    "text": " prior being used as a um preference to drive pragmatic behavior in lieu of for example what a reward function does for reinforcement learning because when things are framed in terms of likelihood directly rather than projecting onto a explicit reward or utility uh function only just working with a base joint distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.905,
    "end": 397.997,
    "text": " um then the prior it can be seen as preference constraint so it's like the preference for blood sugar has a different connotation and and um function and everything than one's felt psychological preference for something or revealed or stated preference but um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.04,
    "end": 413.893,
    "text": " at least um from a modeling perspective it's more similar than not okay so i'll i'll have a look at those resources thanks sorry okay jerry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.713,
    "end": 444.505,
    "text": " Yeah, I think as we're going into at least my area of interest and my questions are, you know, based in my field of work, which is marketing and communications and just how to apply this to, you know, consumer behavior, you know, to actually build some models that use these principles and these frameworks so that we can have replicable studies within this type of a field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 448.653,
    "end": 448.954,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.974,
    "end": 472.517,
    "text": "Well, chapter six is a great place for that because it is a recipe set of questions with more in common than with just general statistical experiment planning and systems engineering and systems modeling broadly with a connection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.497,
    "end": 479.288,
    "text": " In specific ways to get to the kind of generative models that are described in basically chapter four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.59,
    "end": 493.932,
    "text": "And there's a lot of distance between where the this current text from 2022 will get you and the code running in your hands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.329,
    "end": 525.15,
    "text": " uh but that's a ground that is also rapidly being more traversable too and uh and so building out examples so that they're specific uh just you know there's there's a big gap there but that is it represents um in in a sense just how many degrees of freedom there really are in probabilistic modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.028,
    "end": 530.013,
    "text": " Yep, that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.114,
    "end": 532.908,
    "text": "And so yeah, I'm excited to dig into it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.968,
    "end": 536.828,
    "text": "It definitely seems like it's an area that is ready to be explored.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 538.293,
    "end": 538.613,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.795,
    "end": 544.461,
    "text": "So I wanted to share this one little experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.042,
    "end": 547.084,
    "text": "This is from earlier today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.665,
    "end": 549.948,
    "text": "It's linked in the chapter six page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 551.309,
    "end": 565.988,
    "text": "So I took the text of chapter six, just plain text, put it into this plain text repo, used cursor IDE to restructure it and obsidian link it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.419,
    "end": 581.209,
    "text": " So now here it is with probably some light edits, but has these links out to all these other topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.472,
    "end": 595.312,
    "text": " also this repo, you can just put a new file and say, write a POMDP type model for this because it has this whole knowledge scaffold that we can also all contribute to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.053,
    "end": 603.484,
    "text": "So I think as the years and the application niche changes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.464,
    "end": 620.967,
    "text": " The textbook in chapter six, like Ali said, it will always be interesting to consider how it's like, oh, yeah, just these matrices alone are kind of like a good representation of modeling this or that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.533,
    "end": 643.748,
    "text": " all the way on through however that gets friction and a lot of degrees of freedom in application when there are a few standardized open source methods and it's unclear how to necessarily implement just an equation into an actual program",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.728,
    "end": 652.762,
    "text": " Or there can be multiple, it just like, oh, why is there not just one KL divergence function?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.822,
    "end": 655.526,
    "text": "Or like, why don't we just have a variational free energy function?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.766,
    "end": 666.883,
    "text": "Sometimes it gets very data format specific, computational environment specific, MATLAB, Julia, all these like things that come up in the application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.977,
    "end": 695.723,
    "text": " So I think that's one of the biggest changes between 2022, as some will remember in terms of like, we'll think, okay, before RxInfer, PyMDP, MATLAB, now better augmented coding and knowledge engineering tools, code generation tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 697.795,
    "end": 723.786,
    "text": " helping with some of that, especially if we can collaborate, I believe, and have some people working with these code and program synthesis approaches to the structure learning and kind of sketching out more of the tech tree of the spaces of generating different aspects of specific",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.15,
    "end": 750.702,
    "text": " generative modeling passages and then also people who are just like wanting to model or do inquiry into a specific like yeah do there have more squirrel crossing the bike path on tuesday those kinds of uh test experiments so um but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.622,
    "end": 770.749,
    "text": " this is the application part it's almost like the textbook coming back to domain uh even though that kind of happens in chapter five to an extent so i hope that in this phase for what we can uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 770.729,
    "end": 790.459,
    "text": " possibly return to some of the code questions that have come up over the years like having code examples for um you know chapter seven and chapter eight uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.553,
    "end": 797.782,
    "text": " Some of which we already have more advanced things open source.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.802,
    "end": 806.794,
    "text": "So it'd be a subsetting, not like a making, but also these things just from being specified can be made very quickly to a first pass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.397,
    "end": 817.189,
    "text": "So if we want to develop the code and also the questions around going through application,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.616,
    "end": 821.762,
    "text": " that would be really useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.121,
    "end": 861.787,
    "text": " Maybe I could share my project that I'm working on and then where it comes up relevant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 863.629,
    "end": 866.472,
    "text": "I'm Andrus from Lithuania, Andrus Kulikauskas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 872.117,
    "end": 876.841,
    "text": "Does anyone want to start with a specific question about chapter six or the book first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.342,
    "end": 882.867,
    "text": "And then let's do projects, but not...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.163,
    "end": 884.924,
    "text": " begin with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.944,
    "end": 908.28,
    "text": "Thank you, Edris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.284,
    "end": 945.338,
    "text": " what should we really do in synchronous and asynchronous for the textbook the 2022 textbook is a great artifact to understand and learn from i mean any section or any question can be useful um though really i am i just nice nice drawing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.465,
    "end": 961.885,
    "text": " Daniel, at least if we're just asking questions there, like the one up there about affordances is always of interest to me as well as, you know, maybe how like variational scripting might come into play if that's applicable as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.758,
    "end": 973.3,
    "text": "Yeah, what about it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.967,
    "end": 993.634,
    "text": " I mean, I think at least from my perspective, there was some stuff I'd read around creating fields of affordances, which I felt kind of tied from a consumerism perspective to how brands go out to market, for instance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.614,
    "end": 1007.539,
    "text": " And so maybe the question is more around like not just affordance generally, but that idea of like how do organisms in this model or how would we test",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1008.059,
    "end": 1031.603,
    "text": " how agents select between the field of importance is through those either i don't know if that's through policy selection there that's my assumption but um you know still newer to thinking through this from a like actual application perspective does anyone want to say something to that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.421,
    "end": 1041.697,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.328,
    "end": 1049.815,
    "text": " the first question in the four question recipe here is what system are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.556,
    "end": 1067.094,
    "text": "And then if we were thinking about an individual mouse in a T maze, like what's gonna come up in chapter seven in discrete time, it's like, okay, are we gonna model it with four locations starting left, right and down?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1068.295,
    "end": 1072.66,
    "text": "Or are we gonna model its footsteps?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.64,
    "end": 1087.953,
    "text": " So if you model footsteps, then there's going to be the explicit, you can have some data structure that represents the footsteps location, like data about it and or simulated distributions about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.135,
    "end": 1091.34,
    "text": "But if you're going to just say, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.08,
    "end": 1094.063,
    "text": " It's not a footstep modeling project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.483,
    "end": 1099.591,
    "text": "It's just a location for state, which is what's going to happen in Chapter 7.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.273,
    "end": 1107.322,
    "text": "So just from this sort of applied angle, which system are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.342,
    "end": 1118.458,
    "text": "And that kind of reflects the earlier comment about this having more in common, especially early in this process with systems modeling and systems engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.295,
    "end": 1137.983,
    "text": " it's just like okay the organism is a very complex locus person at a game machine or something but but um like the complexity of how hormones interact with uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.963,
    "end": 1141.428,
    "text": " you know, sound and all this or something or microbiome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.988,
    "end": 1145.994,
    "text": "Those are all part of the real environment slash situation slash system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.534,
    "end": 1163.937,
    "text": "But you might be able to get away with a three by three matrix for just three states of vigilance, low, medium, high because those kinds of modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.633,
    "end": 1174.59,
    "text": " That's just all models, map territory, all those kinds of topics that come back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.77,
    "end": 1177.737,
    "text": "It's a model of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.639,
    "end": 1179.821,
    "text": "It's an inferred parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.302,
    "end": 1187.157,
    "text": "It's a risk factor for X, or it's just a mutual information estimate percentile on this in our model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.385,
    "end": 1211.119,
    "text": " So that's why this whole process where chapter six actually gets one isn't necessarily some gestalt paradigm shift on their modeling view per se that you couldn't necessarily also have from doing a regular generalized linear modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.099,
    "end": 1219.634,
    "text": " Which can also be very sophisticated and deal with higher order variance and causal relations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.636,
    "end": 1231.875,
    "text": "It's kind of like generalized probabilistic modeling combined with cognitive systems approaches to systems engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.994,
    "end": 1235.375,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.595,
    "end": 1236.798,
    "text": "Yeah, that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1236.859,
    "end": 1244.056,
    "text": "And the footstep model, when you brought that up, I think that kind of resonates for me because we'll talk a lot about customer journeys.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1244.157,
    "end": 1251.214,
    "text": "And one thing I've been thinking about is just using the term consumerism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.194,
    "end": 1275.582,
    "text": " I don't know that we think about it the right way in my industry and so I've been looking to biology a little bit for a better analogy and so like predatory behavior for instance like the process of identifying and detecting and consuming and then processing something I think is an interesting corollary to what we probably ought to be doing when we talk about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.562,
    "end": 1279.07,
    "text": " you know, communication and purchase and stuff like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1279.19,
    "end": 1281.976,
    "text": "So that's, that's interesting and helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1282.518,
    "end": 1295.106,
    "text": "And maybe that's something I can dig a little bit more into is that idea of more modeling footsteps versus locations, which I think we tend to try to model the end the location when we ought to be modeling like the steps towards that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.942,
    "end": 1297.303,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.044,
    "end": 1314.58,
    "text": "So the hierarchical models, at least in principle, which is kind of where the second half of the textbook goes, is where you have slower inference models and then faster ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.56,
    "end": 1329.22,
    "text": " And then it's just a project or situation specific empirical question about how much compute and what kinds of specific models you're going to make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.403,
    "end": 1342.238,
    "text": "So let's continue on as people if they want to bring in their, you know, how they're seeing that or some other section of the of six, or we can go to the questions, but just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.218,
    "end": 1349.934,
    "text": " Again, this first question is like, okay, you're modeling everything about the biometrics of the person or just this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.815,
    "end": 1352.439,
    "text": "Those are such different questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.98,
    "end": 1360.615,
    "text": "But those are questions that are also just dealt with every day in animal behavior, cognitive modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.312,
    "end": 1380.274,
    "text": " Okay, but here's where we start getting more into some of the technical analytical details of the structure of these models that relate to making some more committed modeling decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.755,
    "end": 1391.749,
    "text": "Not just agreeing that, okay, we're just interested in this question about this system of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.729,
    "end": 1398.88,
    "text": " So the next three questions are the three practical challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.822,
    "end": 1401.164,
    "text": "These can be specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.204,
    "end": 1404.75,
    "text": "They go into more detail in chapter six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.891,
    "end": 1412.522,
    "text": "And there's more sort of links and guides and experiences people can share and just try and explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.502,
    "end": 1423.086,
    "text": " through, but basically it's like keeping in mind that the textbook here uses generative model to describe the agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.551,
    "end": 1452.077,
    "text": " type uh unit and the generative process to be the environment um whereas also generative model it can be used just to be the total um model specification basically the three areas of questions are how do you want to deal with time um model it discreetly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.766,
    "end": 1456.271,
    "text": " Or in continuous time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.534,
    "end": 1464.962,
    "text": "These are questions common to other time series modeling approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.506,
    "end": 1475.196,
    "text": "Even if you choose continuous time, how will time discretization, will that matter for your data or for your compute?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.56,
    "end": 1485.287,
    "text": " What is going to be the structure in hierarchy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.123,
    "end": 1514.447,
    "text": " laterality like just message passing is it just like are you modeling one abstract decision maker making one sequential response to one input data just as an intuition pump or is it doing like this data to here and wanting this output so that's just sort of the um getting to specifics about the model structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.427,
    "end": 1532.487,
    "text": " which can again just be either specified uh from simplicity like just be often the models are just a single uh pomdp partially observable markov decision process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.467,
    "end": 1557.377,
    "text": " and that that um can't necessarily be directly picked up to work on a large data set or something like that but for certain purposes it might be all the research question needs at that stage but um again that's kind of a separating like okay we know the systems have hierarchical depth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.357,
    "end": 1561.425,
    "text": " So which parts of multi-scale complexity are modeled?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.505,
    "end": 1563.709,
    "text": "So that's just a common modeling question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.871,
    "end": 1566.654,
    "text": "And then what is the time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.674,
    "end": 1573.948,
    "text": "How do these different agent or generative model specifications themselves deal with time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.223,
    "end": 1595.562,
    "text": " So just some things that come up, but these are more in common with, at this point, like statistical modeling, causal inference, machine learning, AI, also these kinds of questions would come up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.005,
    "end": 1606.112,
    "text": "Here is where it starts to get more into some of the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1609.501,
    "end": 1615.032,
    "text": " Bayesian degrees of freedom of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.874,
    "end": 1624.632,
    "text": "Like, are you going to model a parameter as just fixed, like a spike in the probability space, like not learnable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.133,
    "end": 1627.257,
    "text": "You know, how learnable, how variable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.587,
    "end": 1636.2,
    "text": " And what are you going to do with how you specify and update and fix how learnable and how variable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.121,
    "end": 1642.59,
    "text": "Are you just going to say from this previous study, we know the variance of this trait to be 10?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.171,
    "end": 1645.635,
    "text": "So we just fix the variance at 10 or we learned it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.336,
    "end": 1647.979,
    "text": "But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.959,
    "end": 1673.764,
    "text": " you know if everything is learnable there's just the looms a greater problem just like in uh uh reward learning when when they get into meta learning and all this how learning how fast to learn to learn that all this sort of things is um i mean the larger the state space and learnability of the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.959,
    "end": 1684.699,
    "text": " of the kind of target model, you make an optimization challenge by making it so open-ended by dealing with large data, by dealing with complex data,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.94,
    "end": 1707.801,
    "text": " maybe there are some structures of probabilistic models that have excellent computational performance on certain situations but that's a hope and a preference and uh is not the case that that that uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.574,
    "end": 1716.943,
    "text": " You know, any given probabilistic model would be performant in any given way on any given dataset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.424,
    "end": 1729.816,
    "text": "However, there might be some that are really, really effective or the huge families that are adequate for certain processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.877,
    "end": 1735.442,
    "text": "But we're getting into statistical modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.278,
    "end": 1743.238,
    "text": " So it's kind of from coming to this from an empirical perspective,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.788,
    "end": 1767.302,
    "text": " biology behavioral modeling perspective and seeing how mostly here we're just talking about how some this could be said and probably many parts are said across different cognitive and behavioral modeling work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.898,
    "end": 1788.635,
    "text": " But it's working within a specific probabilistic modeling framework that has connections to the free energy principle sort of path of least action approach coming from the high road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.156,
    "end": 1797.103,
    "text": "Chapter six sort of brings us back to the low road and building up the specific systems that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.012,
    "end": 1820.07,
    "text": " also have the extension into the implementation methods at least uh some as we sort of explored a little earlier but it um getting from the uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.788,
    "end": 1832.71,
    "text": " questions about the specific system to the probability distributions and families and models that meet up in the middle with the sort of high road approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.09,
    "end": 1835.953,
    "text": " is basically where chapter six is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.955,
    "end": 1845.808,
    "text": "But there's no it's like, these questions are all common to statistical modeling efforts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.77,
    "end": 1859.49,
    "text": "And there's other things I'm sure people here to could add of just the sort of heuristics and pitfalls and important questions for interpretation of complex systems modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.577,
    "end": 1910.757,
    "text": " Another sort of, I mean, another, uh, practical question is like, um, where, what is the, what, there's different ways to do projects and, and research and everything, but does someone want to just imagine a model where there's a 10 time horizon and a five of this, and it takes in this data, it's like, is it just being sketched as part of the thinking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.015,
    "end": 1924.459,
    "text": " process or is this wanting to be used for doing statistical modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.506,
    "end": 1950.463,
    "text": " Because the sometimes there's moves that are possible in just sort of drawing connections on paper that might be very there's that might be like hard within current implementation approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.384,
    "end": 1964.022,
    "text": " So in the examples of the code, we kind of are building out specific motifs that are useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.985,
    "end": 1974.058,
    "text": "But the way that people are thinking about systems is often very nuanced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.18,
    "end": 1980.248,
    "text": "And so I mean, I hope people can in the second",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.067,
    "end": 2010.167,
    "text": " uh phase here like let let uh figure out how to make it useful also just discuss what do we really want to do with these meetings with recorded and unrecorded part because we we can figure out other um other ways to have our shared attention and work i don't want to uh feel like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2011.987,
    "end": 2018.2,
    "text": " Returning to this and just rerecording, going back to the same, if that's not the most useful format.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.428,
    "end": 2050.938,
    "text": " Thank you."
  },
  {
    "start": 2071.403,
    "end": 2085.902,
    "text": " to kind of break to that to kind of break the silence here i'm not really sure because like what um what what do you usually do like what is your usual um mode of like navigating uh the second half of the book like the practical part of the book",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2086.49,
    "end": 2107.603,
    "text": " um like for instance someone uh like i think andreas was about to sorry i was about to talk about his project i think hearing about uh like the projects that people are working on like how they're implementing all this stuff that would definitely be sorry that would definitely be interesting for me um also for my own project like i don't",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.583,
    "end": 2125.069,
    "text": " have anything specific yet before the coming meetings i think it would definitely be interesting to um to discuss the specifics of that but i'm not sure what other things you you would yourself suggest daniel or like what has worked for uh previous previous meetings but that would be interesting for me",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2127.462,
    "end": 2147.732,
    "text": " thank you yes okay we can return that's a good suggestion for andreas um in terms of what has been useful people can look through the previous chapter six uh meetings but i i think what would be very useful is to uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.585,
    "end": 2171.775,
    "text": " connect specific questions and ideas that people have two segments of the text, if only as an exercise in anchoring and and scaffolding off of the 2022 text, maybe just as a jumping off point in moving to other resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.839,
    "end": 2175.34,
    "text": "Then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.159,
    "end": 2194.172,
    "text": " uh working through these questions and figuring out what other questions they asked along the way to get to where they wanted to go with a probabilistic model that that they um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.493,
    "end": 2208.891,
    "text": " could share back and connect to implementations tables that we have to the textbook examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.075,
    "end": 2210.777,
    "text": "So sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.073,
    "end": 2235.481,
    "text": " If we want to make models and given domains, let's make them over these coming months according to this recipe and or making our own, but at least taking this recipe seriously or even as a subset of things that we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.723,
    "end": 2240.689,
    "text": "Andreas, how about just go for your question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.709,
    "end": 2241.49,
    "text": "Let's see where it goes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.432,
    "end": 2242.813,
    "text": " Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2243.814,
    "end": 2249.202,
    "text": "So to introduce myself, I'm Andris Kulikowskas from Lithuania.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2249.402,
    "end": 2255.35,
    "text": "I learned about active inference a year ago from Daniel, and I've had many conversations with him.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2255.39,
    "end": 2261.419,
    "text": "I've read the first six chapters, and so I'm attending at this time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2261.399,
    "end": 2289.432,
    "text": " every week uh and so what i'm interested in modeling um i'll say generally and then specifically generally i have this uh i've been documenting my own experience uh as a conceptual language and so i'm uh one way that comes out is like i feel like i live my life through three minds there's an answering mind a questioning mind and investigating mind so like if i raise my hand",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2289.412,
    "end": 2291.938,
    "text": " there's me that knows what to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2292.038,
    "end": 2293.962,
    "text": "And I just tell myself to raise it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2294.905,
    "end": 2298.693,
    "text": "I don't have to think very much about how it's being raised or where it's being raised.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2299.656,
    "end": 2302.923,
    "text": "So and similarly, like there's all kinds of answers that come into my head.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2303.043,
    "end": 2306.531,
    "text": "So that's the unconscious, these answers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2307.393,
    "end": 2308.095,
    "text": "And then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2308.835,
    "end": 2316.585,
    "text": " I have another part of my mind that's this chattering language, words or concepts, but I think of them as questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2316.765,
    "end": 2322.993,
    "text": "So when I think of the word horse, it's really a placeholder for what the answering mind might tell me as a horse.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2323.674,
    "end": 2325.016,
    "text": "And so I have this conceptual language.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2325.677,
    "end": 2335.99,
    "text": "And then I have this fledged consciousness, which I call the investigating mind, willful, cognizant, deliberate, which basically tries to...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2335.97,
    "end": 2357.353,
    "text": " line up the other two because it's the same information in two different forms so the unconscious knows all these things the unconscious doesn't know them and so can have the information the two and then like with condiments okay",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2369.483,
    "end": 2385.417,
    "text": " i apologize can you hear me yeah continue on so i was talking about this investigatory mind which aligns the earth to what we know what we don't know and then like with daniel kahneman's thinking fast thinking slow",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2385.903,
    "end": 2389.427,
    "text": " it's able to decide, hey, here, I should just think fast.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2389.527,
    "end": 2394.853,
    "text": "And where he is here, I should think rationally, you know, so go with my intuition or should go rationally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2394.873,
    "end": 2395.634,
    "text": "I'm trying to model that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2395.654,
    "end": 2400.699,
    "text": "So specifically, how could I model, especially, and I think there's a language for each of those.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2400.98,
    "end": 2405.284,
    "text": "So there's a language of how things come to matter for the unconscious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2405.304,
    "end": 2409.669,
    "text": "There's a language of how meaning arises, like verbalization for the conscious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2409.709,
    "end": 2411.611,
    "text": "And there's a language for how.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2415.496,
    "end": 2415.876,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.51,
    "end": 2419.712,
    "text": " Not sure if his connection staple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.274,
    "end": 2435.927,
    "text": "Yeah, Danny, to the last part he was talking about, I think I have a question to maybe tack on to that about like when he's talking about system one system too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2436.768,
    "end": 2443.314,
    "text": "Does that in some way tie to like how we would try to model novelty versus habit?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2445.316,
    "end": 2446.437,
    "text": "In terms of like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2447.092,
    "end": 2448.836,
    "text": " You know, it's something I've been thinking about as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2448.896,
    "end": 2453.968,
    "text": "Like a lot of behavior that we notice in my field is habit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.249,
    "end": 2460.223,
    "text": "But we're trying to catch attention, I think, through novelty to train something new in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2460.558,
    "end": 2477.976,
    "text": " Yeah, like, to that, and also a little bit about between habit and deliberation, which Andrews, I hope, will start to get at some of these points that we can continue to work on and develop in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.58,
    "end": 2503.322,
    "text": " here in chapter five so not to go back but um chapter five reviews the some of the key model motifs from the mammalian neuroanatomy cognitive modeling literature um studying people's brains that being where friston and others have focused a lot of their work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.302,
    "end": 2531.942,
    "text": " um so as sort of like well this is sort of what it looks like to study a complex system uh like the brain on this so here are two different um extrema modes of how policy priors like how apt one is to do something before receiving the next observation and uh policy inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.922,
    "end": 2536.951,
    "text": " getting to a policy posterior which action is sampled from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2538.113,
    "end": 2547.349,
    "text": "So it's like the differencing of what was apt to happen before to what was apt to happen after for action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2547.329,
    "end": 2558.707,
    "text": " And these are the distributions that are calculated during policy inference, planning as inference, actually implementing planning agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.329,
    "end": 2563.414,
    "text": "You will have one or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.394,
    "end": 2572.754,
    "text": " Or a modulated blend of these, as it turns out to be for the brain, for policy inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2572.774,
    "end": 2583.917,
    "text": "On the left is a habit pass-through mode, which is like cached action preferences, which can be conditionally modified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.897,
    "end": 2584.478,
    "text": " set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.74,
    "end": 2595.095,
    "text": "On the right is the expected free energy calculation, which is discussed more in the first half of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.116,
    "end": 2605.091,
    "text": "And we can look at implementations in PMDP or in other implementations in this phase of activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.652,
    "end": 2610.259,
    "text": "But this is where specific counterfactual policies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.239,
    "end": 2622.214,
    "text": " of a given temporal horizon are rolled out like policy tree search and evaluated in terms of expected free energy or free energy, the expected future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.234,
    "end": 2637.293,
    "text": "So explicit policy rollout, reweighted energy based learning, consideration of epistemic plus pragmatic value of policies",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.842,
    "end": 2648.03,
    "text": " large computational blow-up just like any other tree-based policy search.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2648.971,
    "end": 2661.803,
    "text": "So that's where secondary heuristics like boundary searches and policy switching and things like that come into play for making these models large.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.843,
    "end": 2668.849,
    "text": "But often, again, it's only a simple one with four policies being considered or something or 16 policies being considered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2668.829,
    "end": 2682.6,
    "text": " But this has that sort of multi-computatoric computational complexity if explicit probabilistic, to the extent explicit probabilistic rollouts are used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.843,
    "end": 2688.373,
    "text": "And then on the left is like basically just a pass through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.349,
    "end": 2693.102,
    "text": " So broadly, that connects to the thinking fast and slow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.503,
    "end": 2699.022,
    "text": "I think some papers have made some points, but it's just sort of a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.55,
    "end": 2729.751,
    "text": " it's a functional stratification in cognitive systems that and then that is being here modeled by one switching parameter map in the territory all that it's like could there be two switching parameters but that's the whole experimental biology question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.119,
    "end": 2740.874,
    "text": " And I would jump in to say like with marketing, there's very much the opportunity like you can sell to somebody's reflexes or you can sell to somebody's rationality.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2741.555,
    "end": 2744.46,
    "text": "And if you're a buyer, you know, you kind of want to have both satisfied.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2744.52,
    "end": 2750.288,
    "text": "You want to feel good instinctively and you want to feel good in terms of, you know, the rational judgment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2751.567,
    "end": 2779.33,
    "text": " And so I apologize for my bad connection, but I wanted to say What I want to model specifically I think would be This language of how things come to have meaning which is relevant for the rational mind So because the mind that just works instinctively it just doesn't need to know all these things But once you introduce this second rational mind it needs to think both what you know has to kind of be aware of both ways and kind of do its best with this other mind and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2780.828,
    "end": 2786.636,
    "text": " So I thought, well, mathematics is something where things don't really matter, but the meaning arises all the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2786.676,
    "end": 2792.003,
    "text": "And I thought I would look in particular to a very narrow field, which would be triangle geometry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2792.063,
    "end": 2795.668,
    "text": "And it turns out in that field, there's an encyclopedia of triangle centers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2796.289,
    "end": 2801.456,
    "text": "And basically, like everything interesting about triangles is basically like a center of a circle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2801.816,
    "end": 2806.262,
    "text": "So you can build that center of a triangle, so to speak, in triangles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2806.242,
    "end": 2807.705,
    "text": " 60,000 different ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2808.567,
    "end": 2821.112,
    "text": "But to focus on the very simplest way, if you put a circle in a triangle, it doesn't matter what the shape of the triangle is, but if you expand it to the maximum size,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2821.312,
    "end": 2826.104,
    "text": " there will be three points that it intersects, that it touches on the triangle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2826.765,
    "end": 2837.551,
    "text": "And the property will be because the radius of the circle is fixed that from the center of the circle, it will be equally positioned, you know, distance wise to each of those three touching points.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2837.732,
    "end": 2839.135,
    "text": "So that's called the in circle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2840.009,
    "end": 2844.955,
    "text": " So one way is to try to imagine these two minds as communicating that problem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2844.995,
    "end": 2849.581,
    "text": "So the unconscious mind, I kind of imagine it places the circle in the triangle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2849.601,
    "end": 2852.344,
    "text": "You know, you're giving a random triangle and you're kind of like blind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2853.025,
    "end": 2862.557,
    "text": "So the unconscious mind places a circle in the triangle and it's allowed to expand the circle until it touches something and it has to stop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2863.077,
    "end": 2882.841,
    "text": " mathematically it'll only touch one side basically like probabilistically it's impossible to touch more than one side at a time and then the conscious mind will say okay I want you to move but let's say it can't it can give an instruction to move but the motion will be random in some random direction so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2883.614,
    "end": 2887.021,
    "text": " or I guess it has to move away from the line.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2887.142,
    "end": 2888.124,
    "text": "It only has one direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2888.605,
    "end": 2890.469,
    "text": "If it doesn't want to, it has to move away from the line.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2890.529,
    "end": 2895.379,
    "text": "So it just moves away from the line at a certain speed, let's say that's based on the radius, proportional to the radius.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2895.494,
    "end": 2920.506,
    "text": " and then it will the conscious mind tells it how far to move like how many radii to move or more like percentage of radio and then it can expand again it knows how to expand the unconscious mind and it'll bump into something else maybe the same side maybe another side and so through this iterative process at a certain point it will have less and less room to move it'll never know what side it's bumping into because it doesn't have that information",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2920.486,
    "end": 2938.174,
    "text": " but it'll just know that it's starting to bump in very often on you know which would presume that it's being closed in and so then the idea is that once you get within whatever accuracy you want because it never touches all three sides at once it only touches one side at a time um realistically but um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2938.154,
    "end": 2941.76,
    "text": " When you get within 1% or whatever you want, they say, okay, I'm happy, I'll stop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2942.201,
    "end": 2951.457,
    "text": "And so then you can ask, for example, well, what can you deduce about the shape of the triangle based on the interactions that you had blind like this?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2952.039,
    "end": 2957.248,
    "text": "You can also have like a learning process, you know, then you can maybe compare that with the original triangle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2958.109,
    "end": 2963.098,
    "text": "You can maybe also have a learning process where",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2963.078,
    "end": 2987.027,
    "text": " the conscious part that decides um how far to go like how to how far how far to move this um it can um different policies can yield different results so it can maybe try to learn that so i don't know if that was like my initial attempt to try to come up with a way of thinking about this language and seeing like how active inference could kind of help to apply it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2989.403,
    "end": 2992.559,
    "text": " Yeah, at least I think that's interesting what you were saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2992.6,
    "end": 2997.726,
    "text": "And there's some stuff I was reading by Michael Levin around like an axis of persuasion with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2998.398,
    "end": 3016.218,
    "text": " different nested levels of intelligence that's kind of interesting to me that I think touches on what you're saying about different, I guess, lower levels of the system learning something and sending a signal out globally when there's some sort of an error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3017.959,
    "end": 3024.827,
    "text": "But I've been thinking about that, those levels of persuasion, because I think it speaks to, from a communication perspective, the way that we communicate, we do it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3024.807,
    "end": 3029.695,
    "text": " Through unconscious associations, we do it more rationally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.795,
    "end": 3032.921,
    "text": "We do it emotively from a cultural perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3033.642,
    "end": 3041.415,
    "text": "But like, you know, I think when it's most effective, it's across all of those levels or that axis of persuasion that he's kind of talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.357,
    "end": 3072.853,
    "text": " so is there such a thing as one of these models that's so simple it could be coded from a blank sheet of paper in i guess five minutes yes that's what the textbook level focuses on the textbook version is just five matrices with it in chapter seven that's what this is what you build up to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.656,
    "end": 3084.671,
    "text": " It's just starting from dynamic perception models, partially observable models, observations coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.833,
    "end": 3087.836,
    "text": "This could be a single binary variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.896,
    "end": 3089.599,
    "text": "This could be a three-state variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.639,
    "end": 3091.081,
    "text": "This could be a continuous variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.522,
    "end": 3093.926,
    "text": "That's the work of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.707,
    "end": 3097.371,
    "text": "But then you have a hidden or latent state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.412,
    "end": 3102.098,
    "text": "Temperature in the room, temperature on the thermometer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.787,
    "end": 3108.778,
    "text": " mapping matrix, initial prior to kick the chain off, transition matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.761,
    "end": 3116.411,
    "text": "Then that's equivalent to a Kalman filter like modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.253,
    "end": 3122.382,
    "text": "Then you add in some element of policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.863,
    "end": 3143.323,
    "text": " is it just a binary uh with two fixed outcomes or do you want to model this or that uh conditionality or learning or or or uh affordance is state state space changing but you know those are sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3143.303,
    "end": 3160.867,
    "text": " Those are structures of models, families of models that you may on your intuition or fun or whatever, seek to just work within a given model family just because or not realize that you're within a given constraint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.929,
    "end": 3164.512,
    "text": "But it's just what is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.652,
    "end": 3169.719,
    "text": "Is it just being analytically just here's like the space of all possible policies of the organism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.46,
    "end": 3172.483,
    "text": "And I'm about to make a philosophical point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.463,
    "end": 3199.737,
    "text": " or we chose to just model the blood sugar not engaging with other biomarkers but this is these are the matrices and the variables that you get to a b c d well i i'd sort of like to see this implemented in code uh is that available",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3200.206,
    "end": 3229.622,
    "text": " yeah great question that's um again that's what chapter six gets to and I'll just link I I know it's in the textbook group um this is a table of of implementations if people want to add and curate more it would be awesome there's always uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.209,
    "end": 3236.514,
    "text": " a lot we can add with these repos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.138,
    "end": 3252.049,
    "text": "And if you get these are people who want to contribute open source resources, and or review them and annotate them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.029,
    "end": 3270.747,
    "text": " with um like what features they have like which ones have planning which ones use this or that uh which ones have this coffee I just want like a really really simple one that you can figure out what it's doing by inspection yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.983,
    "end": 3279.85,
    "text": " Doesn't doesn't appendix C mention like the T thing that you were talking about the teammates?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3280.851,
    "end": 3282.533,
    "text": "Is there a code for that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3284.135,
    "end": 3285.998,
    "text": "There is MATLAB code for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.238,
    "end": 3295.329,
    "text": "It's in the appendix C, but we haven't in a prior textbook group, ported it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.871,
    "end": 3300.295,
    "text": "If people would like to work on that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.844,
    "end": 3309.675,
    "text": " in the times between meetings and get it working or just share where they got to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.695,
    "end": 3312.359,
    "text": "That could be awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.379,
    "end": 3329.944,
    "text": "But making POMDP models and using expected free energy and variational free energy in the implementations and in this Subsidian repo, in the cognitive repo,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.827,
    "end": 3337.578,
    "text": " It's just POMDPs with VFE and EFE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.707,
    "end": 3346.718,
    "text": "Also, this is the slide from the three Ps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.254,
    "end": 3353.117,
    "text": " a distinct role for the distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.157,
    "end": 3357.745,
    "text": "This is the same underlying prior distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.747,
    "end": 3369.506,
    "text": "So if we were modeling like we're interested in the movement data of thermophilic bacteria, so we're modeling the distribution of their location with respect to some fixed wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.688,
    "end": 3373.853,
    "text": "So we're going to have some distribution for their location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.655,
    "end": 3383.369,
    "text": " It is, in the first frame, the probability of their existing at that location at that measured time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.609,
    "end": 3396.111,
    "text": "It's a latent distribution, smooth, analytically approximatable, et cetera, variational distribution, implementable with software tools for their location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.091,
    "end": 3418.555,
    "text": " It is also from the cognitive behavioral bacterial side as their preference, like our expected pragmatic homeostatic firstness and tendency of certain variables to return to attractor states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.535,
    "end": 3436.358,
    "text": " and it's the fitness in that it's the ecological sampling availability constituting differential persistence phenotypically or genotypically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.728,
    "end": 3453.276,
    "text": " But that just, it's just, that's one, it's like we're doing a Poisson distribution from the wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.204,
    "end": 3474.529,
    "text": "Any closing comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.107,
    "end": 3492.363,
    "text": " If people want to think about what will make this early time slot in its alternating next week at this earlier time slot, we will go to chapter two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.825,
    "end": 3501.175,
    "text": "So if people want to just stay at the same time, continuing in this way, we've done it or just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.285,
    "end": 3509.177,
    "text": " Do people have certain amounts of time they want to set aside or certain milestones they want to reach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3509.197,
    "end": 3513.584,
    "text": "But then, I mean, I want it to be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3513.604,
    "end": 3518.472,
    "text": "We can make generative guides and material",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.953,
    "end": 3542.637,
    "text": " absurdly with people's feedback and help if they want to make certain kinds of models so it'd be it would be awesome to work on that um but if people have some other uh preference for for what would be good",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3544.051,
    "end": 3547.857,
    "text": " Given that we all are here for this time, let's figure out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.197,
    "end": 3555.849,
    "text": "So just like email or at the next meeting, add a note or we'll discuss it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.251,
    "end": 3563.281,
    "text": "I'd just like to say I think some more like coding workshop type elements would be good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.868,
    "end": 3571.273,
    "text": "Yeah, I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.017,
    "end": 3576.64,
    "text": " I'll be trying to code what I'm doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3576.72,
    "end": 3579.986,
    "text": "So, and I'm interested to talk with others about, you know, how they code.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3580.968,
    "end": 3581.288,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3582.07,
    "end": 3586.718,
    "text": "It's like the low road is like the show me the code road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3586.758,
    "end": 3596.215,
    "text": "High road is like some is analytical, um, symbolic and analytical and axiomatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.427,
    "end": 3622.084,
    "text": " uh then sort of qualitative philosophical stances are included in that sort of combination and uh i think we can we can have some cool code models please just surface whichever uh desiderata you see and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.178,
    "end": 3623.899,
    "text": " Let's do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.999,
    "end": 3626.823,
    "text": "So I wanted to thank for the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3626.843,
    "end": 3628.626,
    "text": "I apologize for my connection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3628.646,
    "end": 3632.471,
    "text": "And just to say, like, what I learned was that like, what am I trying to predict?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3633.052,
    "end": 3636.116,
    "text": "I'm predicting where I think the center of the triangle is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3636.257,
    "end": 3642.165,
    "text": "And so when I move the circle from the edge, I have to make a prediction how far to move it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3642.145,
    "end": 3647.636,
    "text": " And that prediction could be wrong, you know, and I get feedback from the perimeter of the circle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3647.676,
    "end": 3654.029,
    "text": "So it's a conversation between the predictions for the center of the circle and then the feedback that you get from the boundary of the circle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3654.089,
    "end": 3656.113,
    "text": "That's getting closer to, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3657.195,
    "end": 3660.422,
    "text": "So, and I guess for active inference, you really need to understand, like, prediction error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3660.482,
    "end": 3661.504,
    "text": "Like, what is the prediction?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3661.885,
    "end": 3663.428,
    "text": "What's the source of the error?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3663.61,
    "end": 3666.115,
    "text": " Just a random point about this circle triangle thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.135,
    "end": 3672.669,
    "text": "Wouldn't you want to, after it hits the wall, wouldn't you want to grow it in a particular direction rather than move it in a particular direction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.911,
    "end": 3677.198,
    "text": "Well, I want to have that dialogue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3678.055,
    "end": 3683.003,
    "text": " So the two steps are you can move, you can grow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3683.504,
    "end": 3686.229,
    "text": "So the unconscious mind only knows how to execute this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3686.409,
    "end": 3689.735,
    "text": "And it knows when it hits something, but it doesn't know anything really.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3690.196,
    "end": 3694.583,
    "text": "So this blind conscious mind has to have this communication.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3694.603,
    "end": 3695.585,
    "text": "That's what I want to model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3695.605,
    "end": 3699.912,
    "text": "Might it be better to have grow from the center and grow in a particular direction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.904,
    "end": 3703.388,
    "text": " Well, the point is that you don't know where the center is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3703.408,
    "end": 3704.79,
    "text": "You're trying to find the center.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3704.83,
    "end": 3706.151,
    "text": "You're randomly inserted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3706.572,
    "end": 3709.576,
    "text": "Wait, I thought you knew the center of the circle, just not the triangle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.697,
    "end": 3711.299,
    "text": "Oh, the center of the circle, you know, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3711.319,
    "end": 3712.501,
    "text": "So you can only expand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3712.521,
    "end": 3713.442,
    "text": "You can grow larger.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3713.742,
    "end": 3718.449,
    "text": "But you can also grow a circle in a single direction rather than from the center of the circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.689,
    "end": 3722.775,
    "text": "And I think that would be a faster implementation of what you're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.795,
    "end": 3723.757,
    "text": "Yeah, I'm not trying to do it faster.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3723.777,
    "end": 3725.639,
    "text": "I'm trying to do it slower, so stupider.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3725.799,
    "end": 3727.482,
    "text": "Like, what's the stupidest implementation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3727.502,
    "end": 3729.004,
    "text": "That's what I'm trying to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3728.984,
    "end": 3731.352,
    "text": " Most stupid and revealing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3731.935,
    "end": 3732.497,
    "text": "Thanks, though.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3736.15,
    "end": 3736.872,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.912,
    "end": 3737.374,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]