[
  {
    "start": 8.203,
    "end": 11.445,
    "text": " Hello and welcome everyone to Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.685,
    "end": 20.51,
    "text": "It is October 20th, 2023, and we're here in Active Guest Stream 61.1 with Shagur Raman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.89,
    "end": 29.836,
    "text": "So today we'll be having a presentation, Myth of Objectivity and the Origin of Symbols, followed by a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.136,
    "end": 32.537,
    "text": "So thank you very much for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.097,
    "end": 34.338,
    "text": "Looking forward to the talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.839,
    "end": 37.06,
    "text": "Thank you very much, Sano, for...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.26,
    "end": 45.382,
    "text": " coordinating this, and thanks for all the work that you and the Active Inference Institute does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.802,
    "end": 56.064,
    "text": "I also wanted to briefly thank Carl Frusten and Paul Badcock for helping me with this paper and making it a reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.104,
    "end": 59.605,
    "text": "So this is the title of the paper here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.625,
    "end": 65.106,
    "text": "So it's called Myth of Objectivity and the Origin of Symbols, and it's in Frontiers in Sociology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.477,
    "end": 69.014,
    "text": " And so just get right into it as,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.771,
    "end": 76.412,
    "text": " as Daniel said, do hopefully a brief overview, and we can do a discussion at the tail end of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.932,
    "end": 90.535,
    "text": "And so I guess briefly, the thesis that I'm trying to argue for is that, and some of these words will need clarification, particularly in the context that we'll use them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.835,
    "end": 98.096,
    "text": "But it is that the belief in universal and kind of a codified egalitarian,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.614,
    "end": 101.455,
    "text": " social norms, or in other words, morality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.115,
    "end": 105.537,
    "text": "This essentially underwrites broadly our use of symbols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 106.497,
    "end": 113.98,
    "text": "So what does that mean functionally in terms of what other disciplines use or how they would think of our use of symbols?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.7,
    "end": 125.345,
    "text": "Well, there's cultural niche, and this you can think of as our ability to engage in cultural evolution from Joseph Henrich and others who have highlighted that as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 126.452,
    "end": 129.193,
    "text": " an important area of humanities distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.213,
    "end": 141.995,
    "text": "Another one is social reality, and this is more in the psychological realm, but how we use things like money, how we obey someone with a crown on their head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.595,
    "end": 152.617,
    "text": "So just things that are socially constructed, realities are socially constructed as opposed to existing in more of a physical sense that other non-human animals do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.357,
    "end": 156.281,
    "text": " And of course, this gets to our symbolic capacity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.321,
    "end": 172.24,
    "text": "So this is our symbolic consciousness, our ability to kind of think deeply in the past, to plan deeply in the future, and to engage with any number of concepts as well as people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.344,
    "end": 178.768,
    "text": " And so we can divide up this claim into three areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.81,
    "end": 184.613,
    "text": "The first is our modern social dynamics and social bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.694,
    "end": 189.217,
    "text": "And so this is the sociology side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.338,
    "end": 198.745,
    "text": "So how our economic systems look, how our civic and political institutions look, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.293,
    "end": 223.193,
    "text": " kind of building on um that so I think once we have the structure once hopefully I convince you of um a way we can look at um humanities uh structure of their social reality I know they're kind of symbolic reality um then you know the question is well how did we get there you know how did we become",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.949,
    "end": 248.326,
    "text": " um the kind of you know primate that points fingers and feels guilt as you can kind of see in that picture um and for this we can look to you know two areas so one is you know non-human social animals um so primates um you know crustaceans and other animals that engage in social behavior of a similar nature um so this is distinct right from eusocial insects from you know ants and bees",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.262,
    "end": 264.789,
    "text": " But rather, this is chimps, bonobos, marmoset monkeys, and some others that have been studied specifically by researchers seeking to examine humanity's social norms and how that differs from primates and other animals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.97,
    "end": 268.631,
    "text": " And lastly, is the anthropology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.091,
    "end": 279.293,
    "text": "So whatever we're able to determine about the social environments of our ancestors, what can that tell us about how we got here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.994,
    "end": 283.935,
    "text": "And I'll make some specific claims in regards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.483,
    "end": 307.616,
    "text": " Yeah, so I set out my goal and essentially my goal is to kind of tackle that first part and to persuade folks on the call here that our social system takes on a particular structure and that structure is essentially a symbolic self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.397,
    "end": 311.159,
    "text": "And I use that in the sense of Carl Jung.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.526,
    "end": 319.675,
    "text": " meaning that we inhabit, in addition to our own identities, we conceive of ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.695,
    "end": 328.245,
    "text": "Our self-conception is attached to a number of other broader cultural identities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.346,
    "end": 329.707,
    "text": "And these could be your family.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 331.707,
    "end": 333.449,
    "text": " In your country, this could be your company.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.691,
    "end": 335.632,
    "text": "This could be your community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.652,
    "end": 340.599,
    "text": "You kind of think of those five C's of country, company, clan, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.619,
    "end": 344.244,
    "text": "And so that's essentially where that star is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.364,
    "end": 346.887,
    "text": "That's where I'd like to get to by the end of today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.907,
    "end": 348.81,
    "text": "And I'll also get into some of the other areas as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.76,
    "end": 354.602,
    "text": " And so to explain briefly what I mean by the myth of objectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 354.962,
    "end": 368.366,
    "text": "So first of all, by myth, I mean to say that we haven't, it's not that we've obviously identified some kind of underlying structure with reality or with our social systems that our symbols represent, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.386,
    "end": 372.408,
    "text": "So think here of Plato's forms that there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.828,
    "end": 377.39,
    "text": " You know, a number of chairs out there, but there's a kind of an ideal form of chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.75,
    "end": 382.032,
    "text": "You know, that's not the claim I'm making, one way or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.052,
    "end": 392.416,
    "text": "So instead, what I'm saying is, well, during the Pleiades scene, we were just like another primate, trying to solve primate problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.437,
    "end": 394.377,
    "text": "And the way we did that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.267,
    "end": 409.993,
    "text": " But one way we did that effectively was through this, was through what constituted essentially establishing a common reference frame for behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.013,
    "end": 413.295,
    "text": "And I'll get into that term in a bit, in a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.835,
    "end": 419.897,
    "text": "And the second piece of this, the objectivity, so that's to mean that it's not simply a claim that your ancestors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.2,
    "end": 445.348,
    "text": " listened to stories and believed in myth and believed in religion, but that our myths that were powerful were practical, were meant to solve social problems and do so in an objective way, so be essentially more scientific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.172,
    "end": 455.719,
    "text": " One of the plans that I'm making is that our ancestors, similar to how some of us are, were interested in identifying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.749,
    "end": 485.762,
    "text": " actual real-world consequences um in a symbolic manner so having some sort of objective truth um and you know believing that an objective truth exists um so kind of right and wrong exist um in an objective way um could in bad exist in the sense of um you know this can kill me this can't kill me um and objective in the sense of you know this is part of my group this is outside of it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.426,
    "end": 489.128,
    "text": " All right, so roughly how did we get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.468,
    "end": 498.035,
    "text": "So more specific on the anthropological side, I want to look at things like Shibboleth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.055,
    "end": 506.823,
    "text": "So this is our most innate social bias, which is important because for a few reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.883,
    "end": 514.89,
    "text": "But one is that society's social units, even outside of the human spectrum,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.576,
    "end": 526.782,
    "text": " some researchers have used things such as social bias to analyze the structure of non-human animal social units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.462,
    "end": 545.032,
    "text": "So essentially, in-group preferences, social biases in that respect, are ways that we can understand how other animals, how chimps and bonobos interact with one another, how they establish friends and distinguish between foes, and essentially how they exist in these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.782,
    "end": 563.976,
    "text": " you know normative you know normative social units and hence our use of shibboleth speaks to kind of a unique way that humanity expanded upon our social biases and so although it's you know a crux now you know it's it's often seen as problematic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.718,
    "end": 572.859,
    "text": " there's a certain contingency of folk that sees Shibboleth as a necessary step in our evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.759,
    "end": 581.241,
    "text": "So I adopt that view and see that as an important factor in our road to morality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.521,
    "end": 593.203,
    "text": "And so within that Shibboleth environment, which is essentially we can think of as still non-symbolic because Shibboleth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.147,
    "end": 618.809,
    "text": " as um i should probably explain with this um so this is essentially accent bias um so we're kind of taken from um the old testament but it represents uh our kind of innate tendency um to associate and to establish an instinctive kind of common ground with folks who sound like us um and so we you know automatically trust folks",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.569,
    "end": 639.384,
    "text": " um you know who grew up near us who have a similar accent um and the further out we get um oftentimes um the more foreign someone can can see not always the case but kind of instinctually and you know prior to the acquisition of um symbolic identity um will you should will typically um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.933,
    "end": 644.756,
    "text": " you know, practice Shibboleth as a way to identify.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.357,
    "end": 656.726,
    "text": "And so, you know, assuming that this practice of Shibboleth, you know, goes kind of far back into our past, then, you know, how do we transition out of that to something more symbolic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.786,
    "end": 658.427,
    "text": "You know, how do we, you know, start using morality?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.447,
    "end": 659.528,
    "text": "How do we start using language?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.049,
    "end": 667.315,
    "text": "Well, here are my suggestions that we used one of, or one way to think of it is using, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 668.315,
    "end": 669.276,
    "text": " what's called a speech act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.716,
    "end": 676.48,
    "text": "And so this comes out of the field of the philosophy of language, John Surley and Austin a bit earlier than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.14,
    "end": 680.803,
    "text": "But there's speech acts called performative and constitutive utterances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.823,
    "end": 688.207,
    "text": "And these are essentially acts that immediately change the environment in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.447,
    "end": 693.31,
    "text": "And so if I suddenly tell you that you're fired or that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.75,
    "end": 704.933,
    "text": " You know, there's a war across the seas right now that has immediate consequences, even though it was just a speech act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.953,
    "end": 716.478,
    "text": "So before any violence happens, before someone is now kind of crowned a king and starts implementing physical policies, just by speaking, you've changed something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.578,
    "end": 723.941,
    "text": "And so in this kind of example, so my kind of stylized example is that, well, someone committed violence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.535,
    "end": 737.262,
    "text": " some kind of active deviation they violated some norm um and so some vocalization was emitted that um labeled that person so this person should have been an in-group member this person kind of should have been",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.355,
    "end": 743.237,
    "text": " aligned with our in-group's norms, but they violated it in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.257,
    "end": 753.401,
    "text": "And it could have been they violated food sharing, they violated some kind of unwritten contract about cooperative breeding that we should protect infants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.101,
    "end": 758.623,
    "text": "And it could have been a number of different norm violations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.083,
    "end": 767.287,
    "text": "But labeling that person as a deviant would constitute kind of a minimal threshold of a speech act",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.252,
    "end": 773.177,
    "text": " that could be read as symbolic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.192,
    "end": 804.943,
    "text": " the starting off point here actually is um you know one of the important starting off points here actually um is what is a self and so um you know symbols are one thing and um we can probably identify that and and have some discussion but we have some kind of clear idea of what the self is um sorry what a symbol is uh it turns out however that you know define the self is a bit um it's it's not as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.485,
    "end": 812.122,
    "text": " confirmed and locked in as at least I would have expected kind of when I started this project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 813.939,
    "end": 821.661,
    "text": " And so typically, agents are defined, and we'll get to that in a second, they're defined as along their person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.201,
    "end": 830.503,
    "text": "But it's not clear where, say, a cell starts, where an organ starts, where a person starts to where society is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.383,
    "end": 842.126,
    "text": "And so what we'll get at here is using some frameworks, we'll see how we can understand bias, perspective, shared goals, reference frames, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.201,
    "end": 861.453,
    "text": " the next topic, which is the free energy principle, see how we can use those to start understanding how self and how identity, how we can think of the self and identity in the context of our creation of simple form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 863.149,
    "end": 886.955,
    "text": " so yeah roughly uh i mentioned some of these already but um what we're gonna look at is non-human sociality um we'll look at you know religion myth and narrative and this is you know of course a very instinctual very ancient um practices um that defines humanity um we'll get a social bias as i mentioned um and then ancient shibboleth and most importantly you know this is the active inference institute um and so the framework that i'll",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.396,
    "end": 893.484,
    "text": " be positioning this within is the free energy principle, and more specifically, active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.918,
    "end": 904.319,
    "text": " Yeah, just one more overview.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 905.02,
    "end": 922.795,
    "text": "So again, for an industry principle, we'll go over the ideas of identity and how we can start to think about this subject and how that is evolving in the light of these new frameworks of the free industry principle, active inference and some other researchers who are sympathetic to these views.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.688,
    "end": 930.209,
    "text": " And then the weird journey, that's an acronym, so I'll explain what that acronym is in a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.309,
    "end": 933.15,
    "text": "But essentially for now, it's just Western society.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.17,
    "end": 936.471,
    "text": "It's a Western society zone for being particularly analytical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.931,
    "end": 950.314,
    "text": "And as a result of that, one of the consequences of that is most recently, and this is around the past century, so around 20th century, a lot of disciplines emerged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.301,
    "end": 967.532,
    "text": " that did something that had a common approach, which was an attempt to reduce uncertainty, identify agents, and provide explanatory frameworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.232,
    "end": 971.874,
    "text": "That first one, post-structural, this is in the field of linguistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.375,
    "end": 973.836,
    "text": "The second one, of course, is economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.976,
    "end": 978.379,
    "text": "The third one is behaviorism in the field of psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.999,
    "end": 994.692,
    "text": " And so we'll just kind of go through those and see what we can learn from these paradigms when I try to essentially convince and discuss humanity as an agent that occupies a symbolic self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.754,
    "end": 1008.608,
    "text": " Yeah, so going the route that I mentioned so far, we'll also discuss what this means for moral philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.431,
    "end": 1012.154,
    "text": "And of course, we'll just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.508,
    "end": 1039.65,
    "text": " of dip our toes in we won't go too far into moral philosophy but i think that the implications are kind of immediately um clear in some areas um it brings some interesting ideas from the past of you know what is a bit more relevant and what's a bit less relevant um whether you know effective altruism and things like that are kind of consistent with this view or kind of whether they're um at odds um in the last piece if we have time just because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.011,
    "end": 1061.868,
    "text": " uh i know there's a similar stream on um cooperative communication so um i'll kind of give my view on how this um kind of aligns with cooperative communication and um communication and viewed as kind of an ecological framework which you know both of those were um purportedly done within um the active influence framework so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.489,
    "end": 1070.274,
    "text": " Yeah, and so to start things off, the free injury principles, I'll just kind of give a brief explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.294,
    "end": 1071.836,
    "text": "So this is the Active Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.576,
    "end": 1081.606,
    "text": "So there's obviously a great wealth of information that explains the paradigm and how it's useful and some of the terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.407,
    "end": 1087.332,
    "text": "But essentially, it's a framework that essentially attempts to identify",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.037,
    "end": 1095.762,
    "text": " a number of formalisms that describe the science of self-organization or autopiosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1096.623,
    "end": 1104.49,
    "text": "And it represents agents, things, objects, everything as essentially statistical models of their environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.451,
    "end": 1110.995,
    "text": "And so more specifically, agents need to possess that minimum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.916,
    "end": 1116.44,
    "text": "They need to possess a generative model of their environment in which they can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.781,
    "end": 1144.086,
    "text": " um understand in a sense or infer the processes of the world so you know how does a um you know a creature navigate his environment how does it enhance um you know finance way back home they have to they themselves are can be represented um as models of their environment um so we can see that as uh these agents kind of encoding um Bayesian beliefs um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.738,
    "end": 1159.753,
    "text": " And so one way to look at it, and this isn't part of the formalism, that's why it's italicized, but I heard Chris Fields say it, so I'll say it here, which is that one way to think of it is, you know, agents are essentially all scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.434,
    "end": 1161.595,
    "text": "They have beliefs about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.216,
    "end": 1163.697,
    "text": "They act on the world in a certain sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.529,
    "end": 1185.247,
    "text": " um and those beliefs get updated so everyone has a running hypothesis of what they should next do who they are and how they should maintain themselves their environment and so at a basic level you know everything that exists in the world has to engage in some sort of science and this uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.327,
    "end": 1188.729,
    "text": " occurs at various scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.49,
    "end": 1195.92,
    "text": "So this is that cells and organs, you know, agents, people, or animals, if you will, societies and culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.94,
    "end": 1199.766,
    "text": "And that kind of last area, of course, is where our focus is here today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.576,
    "end": 1209.845,
    "text": " And this is italicized as well, but one of the takeaways from the free energy principle is that a foundational element is the search for oneself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1210.445,
    "end": 1220.977,
    "text": "And so it's not a given that we understand precisely who we are in the world, and it kind of extends to who your friends are and who your enemies are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.679,
    "end": 1233.804,
    "text": " But this surprise immunization can be thought of as this Socratic search for self, meaning Socrates' victim to know thyself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.145,
    "end": 1238.867,
    "text": "There's something ancient there, not just for moral philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.345,
    "end": 1252.354,
    "text": " Yeah, and one other point to make is that although belief in the fringe principle context is a technical term, it refers to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.242,
    "end": 1260.707,
    "text": " Bayesian statistics, it does actually come out of a use at a higher level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.167,
    "end": 1265.311,
    "text": "So Thomas Bayes was a preacher, and he was specifically talking about religious faith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.712,
    "end": 1272.577,
    "text": "And he made a formalization for how he could think about his religious beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.117,
    "end": 1277.161,
    "text": "And so that's ultimately what led to Bayesian statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.624,
    "end": 1295.79,
    "text": " One attempt or one kind of takeaway I have is that we can think of, due to free energy principle scale and variant nature, we can think of beliefs as we typically use the term in a religious context and in other contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.91,
    "end": 1300.712,
    "text": "We can try to formalize these within the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.612,
    "end": 1302.172,
    "text": "Not as a given.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.993,
    "end": 1309.055,
    "text": "We could get things wrong, but it's at least conceivable that they're contained within that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.694,
    "end": 1335.409,
    "text": " And so the next area, so in addition to the free energy principle, there's, of course, other work that's been done to understand identity, to understand the self, and whether that exists at the bounds of the skin, say, or whether that exists within social units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.33,
    "end": 1340.293,
    "text": "And so one interesting piece that's been done",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.45,
    "end": 1347.335,
    "text": " It's by Michael Levin, who focuses on bioelectricity at a cellular level and how cells communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.636,
    "end": 1355.782,
    "text": "And there, he actually used game theory, which is a paradigm typically used in economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.403,
    "end": 1360.906,
    "text": "But he demonstrated how cells, if we can model them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.888,
    "end": 1369.011,
    "text": " not just as kind of individuated little agents trying to maximize their own interests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.472,
    "end": 1383.719,
    "text": "If we can set them all as potentially inhabiting a wider self, we can see how cooperation would emerge in a way that more competitive paradigms, more reductive paradigms would not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.88,
    "end": 1391.043,
    "text": "And so immediately, even before we get to how humanity acts with other humans,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.998,
    "end": 1402.947,
    "text": " whether we do that cooperatively, whether we use morality, whether we use other norms, the same problem exists at the level of the self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.967,
    "end": 1419.399,
    "text": "Because in the second piece is once we get to chimpanzees, if we're over in the upper right-hand corner, what we understand there is for Mark Moffat, chimpanzees determine their group size by social intimacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.16,
    "end": 1429.086,
    "text": " And so that means that their group size essentially cannot exceed, generally does not exceed what any individual chimp is able to recognize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.867,
    "end": 1441.795,
    "text": "So they basically have to recognize, so each person, each member of the group has to recognize everyone within that, as opposed to, you know, as opposed to us and humans, which she argues has existed for, you know, far into our past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.815,
    "end": 1443.356,
    "text": "We've been in anonymous social units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.036,
    "end": 1466.982,
    "text": " right um and so here um what i did was before i get to um further down the line um what i did was take what i took another concept of michael evans which is this light cone so um the light cone essentially is one way of representing identity and so the the scope of each agent's goals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.922,
    "end": 1490.668,
    "text": " um can be kind of captured in this idea of a light cone and so in in the area of a chimpanzee their their goals are associated with others in their that cohabitate in their social unit um and they're necessarily subjective and so they're necessarily um based on their own perspective right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.885,
    "end": 1497.226,
    "text": " And so another piece of social identity, another way to look at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.007,
    "end": 1505.73,
    "text": "And so there was a debate whether or not we can model animals as being in societies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.19,
    "end": 1507.111,
    "text": "And so this isn't a given.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.891,
    "end": 1520.396,
    "text": "And so there's been arguments between Dawkins and Edward Wilson, for instance, that claim that you saw a kind of claim that you can, that you either can think of animals as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.237,
    "end": 1549.962,
    "text": " existing in social units and those operate similar to cells or they can't well one way around that um on this point number three researchers found that you can model them actually as just possessing in-group favoritism so if instead of kind of worrying about specifically where the boundary is from our point of view from um you know an outsider's point of view if you instead model it as well each individual agent um so like i said each one um maintains",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1552.123,
    "end": 1554.266,
    "text": " an intimate recognition of others within their in-group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.388,
    "end": 1559.191,
    "text": "Following that, they show preferences to those inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.251,
    "end": 1567.48,
    "text": "So this could be as simple as when there's a fight, when there's an attack from an outside group, you'll prefer those within your in-group versus out-group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.286,
    "end": 1569.087,
    "text": " It could be food sharing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.107,
    "end": 1570.429,
    "text": "It could be hunting and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.81,
    "end": 1572.612,
    "text": "But it doesn't have to be extensive cooperation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.632,
    "end": 1574.755,
    "text": "It could be simple preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.975,
    "end": 1581.263,
    "text": "It could be avoiding spending more time around your in-group versus your outside group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.463,
    "end": 1585.408,
    "text": "And so this is one of the ways in which social identity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1588.229,
    "end": 1589.59,
    "text": " exists at this level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.531,
    "end": 1603.938,
    "text": "Another important piece is what Judith Burkhardt and colleagues mentioned, which was implicit norms and subjective norms that are exhibited by these chimpanzees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.914,
    "end": 1620.13,
    "text": " As an example, if chimps saw an in-group infant being harmed, they would experience a visceral reaction, they would have heightened arousals, and they would pay attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.657,
    "end": 1628.5,
    "text": " And so this kind of suggests that there are norms that chimpanzees and other animals exhibit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.54,
    "end": 1634.682,
    "text": "And some animals even exhibit more extensive norms, such as marmoset monkeys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.862,
    "end": 1640.584,
    "text": "But chimps are on the lower end of that spectrum, but they still exhibit norms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.385,
    "end": 1645.466,
    "text": "And so one way that Judith Burkhardt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.515,
    "end": 1655.98,
    "text": " distinguished between priming morality and human morality was to say that we have a top down third party perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.6,
    "end": 1669.687,
    "text": "And so this is where I get the goofy graphic where there's a triangle on top of each of these, each one of our ancestors heads is because our ability to engage in objective morality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.455,
    "end": 1693.51,
    "text": " can be represented by the shift between a perpendicular perspective, where I'm looking at those around me and I'm imagining them looking back at me, versus I'm taking a top-down perspective and evaluating my actions and the actions of others in the context of some more transcendental perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.923,
    "end": 1706.43,
    "text": " And so that view of objective morality versus subjective social norms, we'll say, was also brought up by Beckhoff and Pierce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.49,
    "end": 1713.415,
    "text": "They did claim that morality exists in other animals, but they were using morality in a broader sense, in a non-symbolic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.319,
    "end": 1716.94,
    "text": " Um, and they make a lot of good points with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.98,
    "end": 1721.364,
    "text": "This is, and they go across wolves, they go across, um, crustaceans, you know, lobsters, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.964,
    "end": 1735.694,
    "text": "Um, how these animals engage in essentially behaviors that suggest norms, but also exhibit, um, behaviors that suggest emotions that are underlying that we typically think as underlying, um, norms and morality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.876,
    "end": 1740.978,
    "text": "And so the last piece I'll mention is that, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.566,
    "end": 1749.531,
    "text": " Morality for humans is typically symbolic, is pretty strongly symbolic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1750.151,
    "end": 1770.304,
    "text": "And the work of Shingrei and others will typically have found that in order to identify an action or a behavior as being immoral, constituting an immoral behavior, it'll typically need to violate some principle or some code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.203,
    "end": 1784.534,
    "text": " Continuing on the idea of what establishes a subject,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.999,
    "end": 1791.14,
    "text": " How do we first identify what an individual is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.861,
    "end": 1795.082,
    "text": "And what can this tell us about how we manage something like a symbolic self?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.702,
    "end": 1806.527,
    "text": "And how does a symbolic self then become to be constituted by a belief in morality or what is good for the overall self versus the individual?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.148,
    "end": 1817.152,
    "text": "The work of Mark Summs, who used active inference and the free energy principle to understand the function of emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.737,
    "end": 1827.622,
    "text": " And one conclusion he had is that emotions is the spot of consciousness, and that should be the direction of consciousness research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1828.263,
    "end": 1843.511,
    "text": "So I won't go that far, but one point that he makes that's relevant here is that the phenomenon of emotion is relevant, specifically in helping manage categorically distinct needs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.232,
    "end": 1847.694,
    "text": "So distinguishing between pain and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.414,
    "end": 1870.828,
    "text": " outside pain and hunger which one's more important um do i go to sleep or do i have food managing these various you know different subsystems um is the function of emotion and can start to help start to help us understand the you know the boundaries of the cell and so if we go back to um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.349,
    "end": 1886.165,
    "text": " thinking about how Michael Levin looked at an agent, how these things coalesce together, we can see how emotions fits nicely into that picture because it helps essentially harmonize these very disparate systems by into a person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1886.986,
    "end": 1887.607,
    "text": "And this gets at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.429,
    "end": 1913.987,
    "text": " hedonic valence this is kind of pleasure versus unpleasure so this is an important dimension there's a few dimensions that researchers have identified you know with regards to emotions so you know how do we study emotions in a rigorous fashion valence of course is a important measure there so kind of pleasure versus unpleasure you can think of it as pain but typically it's understood specifically as pleasure versus unpleasure and it's in that sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.807,
    "end": 1928.936,
    "text": " complex organisms start to move and help navigate the world and on social creatures how they navigate the world you can see too how it could help us conceive of ourselves as within the symbolic self",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.158,
    "end": 1935.559,
    "text": " And so there's some research on the idea as a symbolic self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.599,
    "end": 1957.224,
    "text": "So what I'm hoping here is that my idea here is that although this was brought up by previous psychologists at earlier times, I think it's clear that thinking of subjectivity and thinking of symbols in the context of active reinference and minimizing uncertainty and a more expansive view of the self,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.624,
    "end": 1980.592,
    "text": " the frameworks that i list here can become more operationalized um so carl jung found that you know this the self as symbol or the cosmic man was a motif that existed in numerous cultures um from hinduism to the ancient greeks um you know to ancient china there is this constant theme of the symbolic man",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.152,
    "end": 1991.924,
    "text": " And so each person's part from that view, from a religious perspective, from a mythological perspective, everyone was conceived as part of a common person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.944,
    "end": 1997.07,
    "text": "So this helped establish essentially a common reference frame for behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.87,
    "end": 1998.291,
    "text": "So this is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.552,
    "end": 2002.974,
    "text": " And similarly, Viktor Frankl, almost low-cost therapy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.994,
    "end": 2017.384,
    "text": "He was a Holocaust survivor and also a psychologist who emphasized indeed for humans to find meaning in groups and ultimately find a meaning in lives and our well-being is largely determined by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.404,
    "end": 2025.789,
    "text": "Yeah, and it's kind of broadly our sociological background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.809,
    "end": 2028.551,
    "text": "So in a sense, we do a number of things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.595,
    "end": 2051.125,
    "text": " that we kind of take for granted, but that are all essentially symbolic, and that all represent our ability to inhabit not just our own identities, but we attach to ourselves with cultures that are in some cases extinct and in the past, and with features that we kind of have yet to understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2059.679,
    "end": 2062.501,
    "text": " So I do want to move this into a discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2063.082,
    "end": 2065.964,
    "text": "I don't think I'll get to the final pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.905,
    "end": 2072.949,
    "text": "But I would like to kind of briefly go over the weird journey that I have here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.07,
    "end": 2081.996,
    "text": "And so I think this demonstrates how a couple things and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.059,
    "end": 2087.361,
    "text": " but analyzing Western sciences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.381,
    "end": 2096.666,
    "text": "So Western science paradigms in the field of economics and language and behaviorism can help bring some of the points that are making to light.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.607,
    "end": 2099.568,
    "text": "And so we are the acronym that I mentioned earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.608,
    "end": 2101.709,
    "text": "This is Joseph Enriquez.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.269,
    "end": 2106.331,
    "text": "It's Western educated industrial high is rich and democratic, as you can see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.552,
    "end": 2108.773,
    "text": "So essentially what he found was a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.891,
    "end": 2112.513,
    "text": " scientific studies relied on college students.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.294,
    "end": 2117.817,
    "text": "They were typically college students in wealthy countries, and they were, of course, well-educated because they're in college.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.637,
    "end": 2131.866,
    "text": "And this caused a lot of research to have certain biases that if you start including other societies that are less weird, hunter-gatherers, for instance, et cetera, you get different results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.286,
    "end": 2135.108,
    "text": "So he came up with this acronym, but then he doubled down on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.388,
    "end": 2137.33,
    "text": "And in a more recent book, he explained that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.95,
    "end": 2148.443,
    "text": " um weird psychology was the reason for the industrial revolution um the reason for the scientific um mindedness that we exhibit um uh and et cetera and so this and we differ",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.336,
    "end": 2178.571,
    "text": " the consequences of that is we possess an analytical mind so you know think of you know a scientific oriented mind um um you think of someone who's bookish um versus more gestalt um thinking which is present and more futile and cast in clan-based um societies and institutions um so this said being a lot of thinking had you know has led more recently and it was a um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.605,
    "end": 2182.969,
    "text": " a discussion a couple of days ago on using narrative theory in economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.649,
    "end": 2190.096,
    "text": "So that's firmly in the message I'm trying to try to overview here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.677,
    "end": 2197.965,
    "text": "But of course, neoclassical economics is an example of a more analytically oriented, but something that is essentially reductive and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2198.9,
    "end": 2202.501,
    "text": " structuralism and behaviorism fall on the same kind of heels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.001,
    "end": 2218.586,
    "text": "And so what these three, what these three paradigms have in common is that they attempt to explain a complex phenomenon by reducing uncertainty, although minimizing uncertainty is important within the range of principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2219.346,
    "end": 2227.049,
    "text": "It's also important to understand that it's that it's minimized, and that minimization happens dynamically within systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2227.609,
    "end": 2253.637,
    "text": " um and is part of the you know adaptive process um and essentially how we get the systems that we do and how they are dynamic how they change over time um how we have preferences um etc and so so one question is well if these um you know if these paradigms are overly reductive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.566,
    "end": 2263.013,
    "text": " and don't do a great job of explaining the systems they purport to, then why do we use them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.393,
    "end": 2266.315,
    "text": "Well, one reason is that they are great null hypotheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.896,
    "end": 2275.142,
    "text": "As we'll see, a lot of economists like to bash on neoclassical economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.843,
    "end": 2278.665,
    "text": "A lot of post-structuralists like to bash on structuralists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.441,
    "end": 2290.486,
    "text": " Um, and that kind of goes on and, and, you know, there's good reasons for that because you know, sometimes when things are bad, they're, they're, um, good at help elucidating, um, important concepts, um, that are true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.54,
    "end": 2304.843,
    "text": " And the second reason that I bring it up today is that they reveal moral conception at the heart of how humanity deviates, how our social systems deviate from these predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.123,
    "end": 2309.503,
    "text": "And the third reason is that the hunter-gatherers were also analytical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.264,
    "end": 2316.805,
    "text": "So although they differed from us in important ways, one thing they shared from us was an analytically oriented mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.485,
    "end": 2327.329,
    "text": " So that means that the clan-based and the feudal institutions that Henrik was talking about, this happened only past the agricultural revolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.349,
    "end": 2337.553,
    "text": "So this was 10,000 years ago when most societies essentially shifted their normative structure, became more stationary, and as a result of that, adopted these more gestalt views.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.293,
    "end": 2344.776,
    "text": "So one way to look at our trajectory to symbols was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.578,
    "end": 2360.011,
    "text": " Well, our ancestral past was filled with people trying to do science using symbols, trying to categorize plants and animals, hunting methods, so anything they used for cultural evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2360.592,
    "end": 2363.654,
    "text": "And most importantly, you try to classify one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.714,
    "end": 2364.735,
    "text": "They tried to type one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.198,
    "end": 2369.019,
    "text": "I'll do one example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.767,
    "end": 2393.527,
    "text": " from that and then i'll move it over to discussion so there's a few um areas that uh i wasn't able to get to but i'm happy to do that as a follow-up and then i think most importantly it would be great to get some questions in um but yes there's the idea of transcendental signification so this is one example um where the post-structuralist the philosopher derrida and piaget had a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.728,
    "end": 2424.081,
    "text": " uh similar critique um of what was known as structuralism so there's a background um cloud levi strauss around 1960s um maybe a little bit before that essentially ideology known as structuralism which attempts to view cultures view language and some other institutions that he examined as corresponding to an underlying and stationary structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.939,
    "end": 2432.962,
    "text": " And so it's removing the variability from different cultures, from different myths, and believing that there's a certain structure to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.903,
    "end": 2445.708,
    "text": "And Derrida and others' critique of this was, well, essentially we're drawing arbitrary lines, and culture isn't so easily reduced to a specific culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.268,
    "end": 2448.729,
    "text": "There's time, there's history, there's cultural variation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.65,
    "end": 2454.032,
    "text": "And one example is Levi Strauss trying to draw a hard line between nature and culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.486,
    "end": 2457.167,
    "text": " But really, those things are continuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.187,
    "end": 2462.749,
    "text": "In a different natural environment, you might say, you'll have a different culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.41,
    "end": 2466.411,
    "text": "And the culture will feed off of that natural environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.132,
    "end": 2469.653,
    "text": "And so there is nothing outside the text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.713,
    "end": 2472.834,
    "text": "So everything is a matter of perspective in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.535,
    "end": 2484.22,
    "text": "So the question then becomes, well, if that static structure that Claude Levi-Stauss purported existed, then do cultures have any structure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.04,
    "end": 2490.546,
    "text": " And of course, Derrida and others still did believe that there is room for structural science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.927,
    "end": 2496.352,
    "text": "And so the structural science we're looking at today, of course, is the free-end principle on active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.213,
    "end": 2499.455,
    "text": "And so what is the core components?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.495,
    "end": 2500.136,
    "text": "What is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.876,
    "end": 2507.183,
    "text": "I didn't go over the concept today, but where does that Markov blanket or boundary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2508.362,
    "end": 2510.083,
    "text": " that we're minimizing uncertainty within.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.104,
    "end": 2514.627,
    "text": "And that's where the transcendental signification idea comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.647,
    "end": 2525.576,
    "text": "And this is where Derrida said, well, there's typically, especially in Western societies, there's typically a concept that you just don't, that you can't argue against.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.997,
    "end": 2526.978,
    "text": "That's just something accepted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.399,
    "end": 2535.064,
    "text": "And from there, that the constant daisy chain of concepts, the constant flow of concepts can stop essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.785,
    "end": 2546.935,
    "text": " And so if you think of any, at any given time, and it took me a minute to think about what our transcendental signification is today, because there's a lot of fluid concept and there's a lot of arguments, but one example is freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.398,
    "end": 2554.382,
    "text": "So basically, at least, I mean, so if someone brings up it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.032,
    "end": 2559.755,
    "text": " political context or in a certain other context, that this will infringe upon freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.396,
    "end": 2562.037,
    "text": "But it's very hard to argue against that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.978,
    "end": 2573.126,
    "text": "And that's because it goes without saying that, you know, although there could be, in some contexts, infringements on freedom, it's generally understood that, you know, freedom is a good thing, it's a positive thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2573.146,
    "end": 2578.691,
    "text": "And any kind of disagreement?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.031,
    "end": 2603.358,
    "text": " So although Derrida was critical of Western society's use of transnational significations, and, you know, that's one modern example, but of course, and others are, you know, the belief in God, democracy, other things that are just taken for granted that the culture should abide by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2606.656,
    "end": 2616.244,
    "text": " And although he was critical of these, or our use of them, without transcendental signification, it's difficult to imagine how a culture would be maintained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.744,
    "end": 2621.228,
    "text": "I think it's also difficult to imagine how language would remain stable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2621.869,
    "end": 2622.95,
    "text": "That's because...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.912,
    "end": 2631.436,
    "text": " there needs to be some agreement, there needs to be essentially some common ground in order for communication to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.417,
    "end": 2653.531,
    "text": "That's because, of course, language involves adopting a whole bunch of norms, but also our daily lives that are kind of empowered by language and symbols need some sort of stopping point, need some sort of ground to say, well, you know, this isn't a good thing or this is a good thing, and we should all kind of orient ourselves to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.413,
    "end": 2663.959,
    "text": " And so this is one representation of why moral conceptions are necessary for our systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.68,
    "end": 2665.901,
    "text": "And you can see that in language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.042,
    "end": 2674.588,
    "text": "And you can see that, I think, in economics and the field of social trust as well that I can go into at a later time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2677.955,
    "end": 2684.318,
    "text": " And the last thing is, um, this relates as similar things happen to the motion, but I'll stop there actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.719,
    "end": 2689.861,
    "text": "And, um, you know, folks want to do kind of a follow-up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.901,
    "end": 2699.566,
    "text": "We can, we can do that, but I just want to turn it on and see if there's any, uh, questions at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.789,
    "end": 2704.009,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.169,
    "end": 2704.869,
    "text": "Well, awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.449,
    "end": 2706.41,
    "text": "A lot of, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.964,
    "end": 2708.844,
    "text": " Peace is arising.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.685,
    "end": 2714.807,
    "text": "So for those who are watching live, they can write questions in live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.907,
    "end": 2716.548,
    "text": "And I wrote down a few things as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.608,
    "end": 2724.392,
    "text": "So just while we get started, I mean, what brought you to bring in Active Inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.572,
    "end": 2729.014,
    "text": "And we'll explore the role in the coming questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.054,
    "end": 2730.515,
    "text": "But what brought you to this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.575,
    "end": 2737.578,
    "text": "Were you studying theories of cognition and looking for what or how did it come to be this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.424,
    "end": 2739.966,
    "text": " So I guess technically I took the high road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.986,
    "end": 2741.708,
    "text": "I took the high road too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.908,
    "end": 2742.348,
    "text": "So I was...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.112,
    "end": 2771.094,
    "text": " studying economics and i thought to myself well we have economics has a behavioral framework um and that might not be great but it's it's related to um utilities related to welfare it should actually be a pretty good starting point for um understanding morality so essentially it could be a utilitarian framework um except that we have prices so we should be able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.815,
    "end": 2784.283,
    "text": " clearly at least propose a set of policies and set of behaviors or essentially a normative theory that you can score behavior against to say whether it's moral or immoral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.384,
    "end": 2795.771,
    "text": "So that became very hard because it turns out that the neoclassical paradigm doesn't allow that because it fixes individuals and their preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2796.572,
    "end": 2801.375,
    "text": "And so I then kind of turned to some other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.775,
    "end": 2823.664,
    "text": " moral paradigms that that used actually prisoner's dilemma um and others that brought in morality but then yeah and then I saw the um is the Scientific American or the white article about Carl Friston and him talking about the free Andrew principle um yeah and it seemed like okay there's there's an option here there's um you know a way to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.245,
    "end": 2852.544,
    "text": " you know use math like economists love to do but kind of in a way that still allows for um you know true subjectivity and kind of true you know variation um without kind of reducing that all the way but yeah in a nutshell I guess I I really like this never never even heard it that way like math with a true subjectivity it's truly about the subject and what is subjective to them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.265,
    "end": 2856.326,
    "text": " A lot of ways to go from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.608,
    "end": 2859.711,
    "text": "Okay, you brought up Shibboleth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.735,
    "end": 2886.453,
    "text": " and syntax and shibboleth at least in its original um biblical style it had to do with how the word was said so it was truly a question of of the morphology of the word it's not like it was an unknown word it was how it was said not the underlying term um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.193,
    "end": 2904.221,
    "text": " And then you seem to suggest that we were in a new phase or mode of semantic communication, that there would be something past or different than the Shibboleth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.021,
    "end": 2908.523,
    "text": "So what was that pointing to or what do you see there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.662,
    "end": 2916.405,
    "text": " I didn't get to the anthropological side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.366,
    "end": 2922.369,
    "text": "Yeah, so essentially what I'm referring to here is, I guess you had two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2922.409,
    "end": 2926.593,
    "text": "So one is Emily Cohen has a paper called The Case for Accents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.614,
    "end": 2933.198,
    "text": "Mark Moffat has a book called Human Swarm, and he kind of echoes that same argument there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.218,
    "end": 2938.302,
    "text": "And the last piece that I'll mention is Catherine Kinsler has a book called How You Say It.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.242,
    "end": 2940.343,
    "text": " And they're all about Shibboleth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.883,
    "end": 2951.668,
    "text": "The first two were about making the argument that what we call Shibboleth and what I mean, I'm using it here in the context of it's just accent bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.088,
    "end": 2959.011,
    "text": "So in that case, the Ephraimites, one of them killed the other one because they pronounced Shibboleth incorrectly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.031,
    "end": 2960.672,
    "text": "They said Sibboleth instead of Shibboleth, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.932,
    "end": 2971.034,
    "text": " But the point is that from the second we're in utero, we listen before we see anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.954,
    "end": 2974.654,
    "text": "We listen to our conspecifics before we see them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.295,
    "end": 2988.317,
    "text": "And there's a lot of evidence that we show preferences immediately for people who sound like the people that we heard initially sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.237,
    "end": 2990.297,
    "text": "So we establish these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.095,
    "end": 2999.158,
    "text": " a kind of orbit around our social circles using that familiarity in sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.298,
    "end": 3014.925,
    "text": "And a lot of racism and a lot of other social bias can actually be deconstructed into relating either more to shibboleth or the accents are actually a bigger driver than we realize and we consciously realize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.586,
    "end": 3021.068,
    "text": "And so Emily Cohen and Mark Moffat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.389,
    "end": 3028.201,
    "text": " They use that as a way to suggest, well, what if we had accents kind of before we had words?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.466,
    "end": 3031.669,
    "text": "And how would that look?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.806,
    "end": 3038.528,
    "text": " And the idea here is that, well, other animals have vocalizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3039.848,
    "end": 3040.409,
    "text": "Dogs bark.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.809,
    "end": 3044.79,
    "text": "Chimpanzees make vocalized sounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.191,
    "end": 3047.612,
    "text": "Verovit monkeys, they do these up and below calls.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.632,
    "end": 3051.853,
    "text": "So they have, in some cases, sophisticated vocalizations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.913,
    "end": 3054.974,
    "text": "Obviously, parrots have very sophisticated vocalizations only next to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.995,
    "end": 3058.876,
    "text": "And so would we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.851,
    "end": 3070.094,
    "text": " Would there be a circumstance where our ancestors could have used that to identify with one another in a more cultural evolutionary perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.594,
    "end": 3072.874,
    "text": "So why do we do it as babies?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.894,
    "end": 3074.215,
    "text": "Why do we do it as children?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.215,
    "end": 3081.797,
    "text": "Well, the argument, well, that probably is indicative of something that's more evolutionary ancient that has more legs to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.64,
    "end": 3094.428,
    "text": " And the reason why that's important is because we'll, you know, we started off as a new primate and we somehow, you know, defeated the chimps and the monopoles in terms of resources or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.708,
    "end": 3098.751,
    "text": "And, you know, how did we start to kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.591,
    "end": 3117.274,
    "text": " cooperate at scale um and you know there's been some discussion of that but introducing shibboleth closes a lot of gaps for instance in joseph henry exam um you know the story of our success um or in his first book on cultural evolution he goes through how we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3120.667,
    "end": 3122.848,
    "text": " how we became a species that learned from one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.59,
    "end": 3128.893,
    "text": "And he said, he admits that majority of this happened when we lived close together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.634,
    "end": 3135.539,
    "text": "But if you think about it, we must have learned from each other while we were still in these sparsely communities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.559,
    "end": 3146.808,
    "text": "We transitioned from these sparsely communities to these higher dense environments, but it'd be very difficult to imagine a densely populated area of chimpanzees and minnows because there'd be a lot of fights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.269,
    "end": 3148.449,
    "text": "So how do we kind of overcome that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.29,
    "end": 3152.254,
    "text": " And Shibboleth is one example by kind of extending our networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3152.914,
    "end": 3154.977,
    "text": "But yeah, it's a long-winded answer to your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.139,
    "end": 3157.76,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.84,
    "end": 3168.172,
    "text": "So kind of the historical and developmental primacy of accents and then the kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.167,
    "end": 3176.434,
    "text": " linguistic and symbolic signification that we have as a scalable technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.015,
    "end": 3192.189,
    "text": "That's why seemingly an open-ended number of people can have a word that they might all pronounce differently or a simple abstract, simple like the triangle that you showed that might mean something different to everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.99,
    "end": 3204.534,
    "text": " But it's like this, and that's where you kind of invoked the platonic concept, which is like the word separate from any accents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.014,
    "end": 3206.734,
    "text": "Like, does the logos have an accent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.754,
    "end": 3209.135,
    "text": "Exactly, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.895,
    "end": 3210.376,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3210.836,
    "end": 3221.419,
    "text": "I was trying to, I spent a lot of time on the image because I want to be careful because it's not that there's one, there's one light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3222.059,
    "end": 3223.501,
    "text": " that we're all accessing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.521,
    "end": 3227.406,
    "text": "It's not that there's one true perspective, as far as we know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3229.737,
    "end": 3232.399,
    "text": " accessing when you talk to me and that I'm accessing when I talk to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.72,
    "end": 3247.27,
    "text": "We both have a technically transcendent perspective that sufficiently overlaps to the extent that our communication now is what you might call productive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.41,
    "end": 3253.935,
    "text": "To the extent that we can properly communicate, we're co-constructing that little triangle or blimp.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.016,
    "end": 3260.077,
    "text": " which is kind of a modification of Michael Evans, that kind of light cone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.298,
    "end": 3276.442,
    "text": "Yeah, accent encoding in the production of speech, accent decoding in the recognition of speech, and then that's what allows, for example, token-based language models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.389,
    "end": 3292.041,
    "text": " to be in our cognitive ecosystem and get some meanings or, you know, allow themselves to be projected meaning upon, but cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.474,
    "end": 3299.675,
    "text": " Okay, so where does active inference come into this for you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.735,
    "end": 3311.017,
    "text": "Like in the paper and in the presentation, you mentioned a few places, but you brought in so many historical frameworks and different directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.057,
    "end": 3322.939,
    "text": "So just in your own work leading up to here or from where you take it, what do you see active inference and the free energy principle doing in that line?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.086,
    "end": 3337.453,
    "text": " So I see it as operationalizing the Jungian notion of symbol as self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.793,
    "end": 3339.454,
    "text": "And I think that does a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.135,
    "end": 3346.458,
    "text": "And it does a lot because it gets at that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.257,
    "end": 3354.261,
    "text": " foundational, one of the foundational principles, which is seeking self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.781,
    "end": 3361.686,
    "text": "So it's not that, you know, we're born and, you know, some children decide, you know, I'm not going to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.706,
    "end": 3371.513,
    "text": "You know, I'm not, I'm not super interested in this, or I, I find that I belong in this family, they give me food, and I'm just gonna stay here forever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.952,
    "end": 3373.973,
    "text": " Those kind of things don't happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.074,
    "end": 3382.182,
    "text": "And so what it does for me is it frames the motivation for symbolic communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.083,
    "end": 3395.636,
    "text": "Because if it's conceived of as an extension of your identity, if this cultural unit is in some ways more foundational",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.4,
    "end": 3408.463,
    "text": " to human identity than even a chimp social unit is for its identity, which I think it is, then it no longer becomes an option.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.023,
    "end": 3416.365,
    "text": "So it kind of accelerates the epistemic ontology that I think the free energy principle underwrites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.74,
    "end": 3421.722,
    "text": " meaning kind of search for self, seeking information, information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.142,
    "end": 3429.245,
    "text": "And I think you could, and I didn't, but I think we can rephrase this as morality, as information processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.065,
    "end": 3434.327,
    "text": "So in that context, in the context of I'm a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.079,
    "end": 3437.439,
    "text": " person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.72,
    "end": 3441.484,
    "text": "I'm essentially a concept within a broader symbolic social reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.105,
    "end": 3450.855,
    "text": "Um, and it starts to, I start to minimize uncertainty by, um, computing cells by finding, you know, the blanket that I'm behind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.875,
    "end": 3450.915,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3453.968,
    "end": 3470.28,
    "text": " then morality in that case becomes a signal to what those identities are and where i belong so in that case um someone was deviant okay this person is evil then that's that's a big deal um let me pay attention to this um someone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3472.189,
    "end": 3476.852,
    "text": " you know, yelled at me when I crossed the street because I was crossing the street at a wrong time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.112,
    "end": 3481.214,
    "text": "That's going to stick in my mind because they've pegged me as something, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.234,
    "end": 3484.776,
    "text": "So that was the use of morality as creating something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.477,
    "end": 3492.64,
    "text": "And so, yeah, so this is one of the reasons morality is, I think, so looms so large, I think, in our minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.48,
    "end": 3513.622,
    "text": " um and i think is important for for that trajectory but yeah yeah you also have insight into you know these concepts so yeah if there's the words i should be using please please stop me here yes i think it's very interesting to apply",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.33,
    "end": 3522.695,
    "text": " active inference to the Jungian or to the symbolic journey, to the search for meaning and all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.516,
    "end": 3530.181,
    "text": "So if we were just talking about like visual perception, pixels on the screen or photons on the retina,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3531.724,
    "end": 3538.289,
    "text": " a sophisticated cognitive entity would do structure learning and propose latent causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.889,
    "end": 3542.692,
    "text": "Like, oh, maybe it's not just a million red pixels moving from left to right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.732,
    "end": 3544.653,
    "text": "Maybe it's a red car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.314,
    "end": 3548.056,
    "text": "And so then there's essential or the symbolic car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.256,
    "end": 3549.937,
    "text": "And so that would be like structure learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.598,
    "end": 3550.718,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.914,
    "end": 3571.513,
    "text": " World model, again, also for the kind of entities that we are, it's like a self in world model, because one of the most important things is agency and understanding, well, what are the movements that I have agency over, which is why we're able to kind of ignore eye saccades, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.806,
    "end": 3582.654,
    "text": " Because we know or suppress proprioception associated with our body being in the position that we expect it to be because those bodily features are under our control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.975,
    "end": 3588.279,
    "text": "And so we're able to basically calibrate them out, not need to be distracted or attend to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.879,
    "end": 3594.343,
    "text": "And then that allows us to be sensitized to changes that are not caused by us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.324,
    "end": 3598.286,
    "text": "And so it's like, what is the I?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.167,
    "end": 3599.927,
    "text": "What is this I?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.073,
    "end": 3609.54,
    "text": " symbolic and embodied strange loop that's causing all my thoughts, my thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.141,
    "end": 3624.793,
    "text": "And so it's like, that can be framed very clearly in a uncertainty reduction, structure learning, external state or hidden state framing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.54,
    "end": 3652.051,
    "text": " And only through kind of a lot of modification and coercion can that be cast in like a microeconomic reward maximization framework, which just leaves more to be done than before the application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.131,
    "end": 3654.192,
    "text": "And Act-Inf is like, well, no, this is at least...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.593,
    "end": 3668.282,
    "text": " a uncertainty-reducing way to approach that question of self and potentially multi-scale self-discovery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.905,
    "end": 3673.646,
    "text": "Exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3675.802,
    "end": 3701.545,
    "text": " Yeah, one of the points I was trying to make with neoclassical economics, like similar to what Dara did in structuralism was, well, because this is such a, this is a general equilibrium, kind of, I think of it as like a thin framework, meaning it, it reduces the economy down to essentially get no movement, because all the resources are allocated, and there's really nothing, nothing left to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3702.806,
    "end": 3702.986,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.58,
    "end": 3727.123,
    "text": " the what's interesting is is when people identify where that fails so you know classical market failures um it's the most interesting side of um you know classical economics it's how you get um pollution it's how you get technical spillovers that have you know positive reaction um I think an interesting one is in the concept of cultural niches uh social trust and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.065,
    "end": 3734.235,
    "text": " And also in how firms co-sign, how firms don't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3734.595,
    "end": 3740.125,
    "text": "So you'll have social trust at the level of a country, you'll have social trust at the level of the firm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.494,
    "end": 3770.184,
    "text": " within that that minimizes uncertainty for the employees or it minimizes uncertainty for the consumers because they know the product that they're getting um and i think we can also think of it as minimizing uncertainty for um you think of someone who's 12 and they're not in the marketplace yet they're just learning things um so what's you know how do they participate um how can we think of them participating in the market economy other than just a kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.124,
    "end": 3788.847,
    "text": " a long time consumer until they start participating well they have they have a series of of of symbols and they have a series of ways of reducing their uncertainty um and so this is you know unions this is um universities this is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.455,
    "end": 3802.962,
    "text": " know, companies that maybe they're not thinking of companies per se, but they're thinking of, you know, a business person or a scientist, or, you know, they have these similar things that can be used by their utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.625,
    "end": 3819.571,
    "text": "Another question was, you described this kind of perspective swap that we engage in, and you described it as there was a perpendicular component to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.687,
    "end": 3828.115,
    "text": " what was that social setting that was perpendicular and what was perpendicular to what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3829.778,
    "end": 3830.739,
    "text": "Yeah, and so here...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.38,
    "end": 3852.298,
    "text": " So here, I guess I'm kind of on the edge of my knowledge, but what I was... The perpendicular would be so typical primary relations, but also a lot of our social relations are intimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3852.699,
    "end": 3854.681,
    "text": "And so that's perpendicular, meaning in the sense of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.243,
    "end": 3872.39,
    "text": " These are interactions that you have that are kind of based on your subjective perceptions and meeting those interactions that we can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.093,
    "end": 3903.273,
    "text": " of carve out of a symbolic reaction so for i guess for for people it's difficult to do because as soon as you engage with someone um you know you're thinking about what you should be doing and and you know there's a bunch of unconscious things of um okay i should put you know i should shake their hand or you know i should um you know if i'm this i should kiss their cheek or um you know i should take my shoes off now so there's obviously kind of a top-down implicit um symbolic um occurrence is happening uh however you know for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.198,
    "end": 3910.235,
    "text": " non-human animals for for primates um you know for dogs etc um that world is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3912.094,
    "end": 3934.888,
    "text": " know it does have it does have history um you know it does have it does have memory but the perspective is still is still subjective it is still a you know a subjective memory um there's no kind of above the fray uh objective top-down um sense for which they can coordinate their their actions and behaviors and their kind of goals um and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3936.914,
    "end": 3950.401,
    "text": " I, on one hand, I don't think it's saying too much because I think it's basically just describing, it's kind of visualizing how symbols are different than, symbolic interactions are different than non symbolic interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.901,
    "end": 3955.924,
    "text": "On the other hand, I think it's interesting because I think it can help",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.682,
    "end": 3964.267,
    "text": " it can help us imagine the context and maybe model the context for how we first started it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3965.147,
    "end": 3984.301,
    "text": "How we first started to do it, which is that we were in an environment where, both in an actual environment, like in the place, but also our kind of cognition was at a place where we could start to imagine our behavior as if a third person were looking at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.221,
    "end": 3987.802,
    "text": " And so, yeah, that's essentially what I was getting at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.182,
    "end": 3989.482,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.722,
    "end": 3989.962,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.082,
    "end": 3992.443,
    "text": "I'm going to go to some questions from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.503,
    "end": 3995.743,
    "text": "So if you have any thoughts on them, please feel free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.923,
    "end": 3999.744,
    "text": "Otherwise, of course, however you want to see them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.724,
    "end": 4001.024,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4001.545,
    "end": 4012.067,
    "text": "Upcycle Club wrote, how can tokenization improve the performance of active inference agents that use tensor networks as generative models for sequential data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.075,
    "end": 4022.38,
    "text": " And then just followed up by defining tokenization is the process of breaking down a text into smaller units called tokens, which can be words, sub words, characters, or symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.521,
    "end": 4024.521,
    "text": "Do you have any thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4029.124,
    "end": 4029.724,
    "text": "Repeat the question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4029.744,
    "end": 4031.405,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4032.086,
    "end": 4040.05,
    "text": "How can tokenization improve the performance of active inference agents that use tensor networks as generative models for sequential data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.508,
    "end": 4065.312,
    "text": " know i was just interested in the question itself but yeah i have no i have no thoughts but other than i can't wait to you know to examine the wording of that question and maybe have an opinion one day yeah i appreciate it i appreciate whoever asked that whoever asked i think that i would have insights into that question so indeed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.934,
    "end": 4067.695,
    "text": " It's on stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.895,
    "end": 4068.735,
    "text": "We'll come back to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4070.376,
    "end": 4070.696,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4070.816,
    "end": 4072.337,
    "text": "Dave asks a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.357,
    "end": 4077.881,
    "text": "There's a few background pieces, but it will end with a question mark from what I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.042,
    "end": 4079.282,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.182,
    "end": 4093.271,
    "text": "Whitehead, in process and reality, presents a framework that allows a kind of chaining across local spatial relations that allows a group of observers to attribute objective locations to objects in a shared space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4094.351,
    "end": 4095.172,
    "text": "A group of minds...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.564,
    "end": 4105.846,
    "text": " can apparently share concepts somewhat contrary to what we'd expect from a strict avoidance of the fallacy of misplaced concreteness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4106.767,
    "end": 4124.091,
    "text": "It'd be nice to speak meaningfully of shared concepts while avoiding the fallacy of misplaced concreteness and also avoid Whitehead's rather unsatisfactory reliance on eternal objects, concepts, residing in the mind of God.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.185,
    "end": 4152.238,
    "text": " Could the trick be made to work by positing chaining across locally I and thou first and second person mappings where you and I take into account the partial discrepancies between what you and I mean by a given term or a given illusion while we retain and reuse the structural commonalities between your and my usage of the term?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.724,
    "end": 4160.009,
    "text": " Yeah, I mean, this is certainly much more in my wheelhouse than the first one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4160.769,
    "end": 4168.256,
    "text": "And yeah, I mean, I start off my paper talking about Whitehead, so I certainly deserve a question that involves it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4169.017,
    "end": 4172.28,
    "text": "I think precisely, and I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.356,
    "end": 4181.242,
    "text": " That's kind of getting at the way I present our discovery in language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.262,
    "end": 4188.728,
    "text": "We're approaching the idea of the fallacy of misplaced concreteness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4190.229,
    "end": 4191.69,
    "text": "We believe in these platonic forms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.77,
    "end": 4193.912,
    "text": "It's this Western bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.972,
    "end": 4196.855,
    "text": "It's this thing that Plato did that was wrong that we continue to do with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.375,
    "end": 4218.98,
    "text": " know classical economics but but uh even though it's wrong it's it motivates us to create language because by believing something um by believing in these forms in a sense um we end up reifying we end up creating things that do exist so i guess the way i see it first of all is that um the myth of objectivity is that well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4220.629,
    "end": 4233.926,
    "text": " By wanting to believe that there is a right way to speak, by wanting to believe that there's a right thing, there's a right thing I mean by the right thing, we end up kind of bringing that about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.834,
    "end": 4252.004,
    "text": " Where I'm curious to kind of parse his question out is at the tail end where he talks about the distance between, I guess, the two subjects, I and you, and kind of how we kind of inch closer together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.024,
    "end": 4265.554,
    "text": "I guess my simple framework, I'm thinking, well, if both me and you believe that we're speaking more or less the same language, we're both talking about active inference, like even at lower levels, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.545,
    "end": 4291.638,
    "text": " we can navigate a closer and closer space and establish something like a reference frame where things where words have common meanings etc um we can establish some common ground um and i think yeah so i think on one hand you can think of it as this if i understood correctly towards the end um we can think of it as this kind of closing the gap between our two perspectives um but i think you also have to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4292.918,
    "end": 4295.839,
    "text": " it's also necessary that we're both conceiving of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4295.859,
    "end": 4315.382,
    "text": "I don't want to say godlike because we're trying to avoid Whitehead's use of godlike, but godlike is useful because if we just think of that there's this fallacy and there's this perspective that can see the true form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.462,
    "end": 4319.243,
    "text": "So in essence, we need this kind of mythology, I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4321.403,
    "end": 4326.605,
    "text": " Or we at least needed it in the past to kind of get at something like language and forms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4328.205,
    "end": 4328.525,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.406,
    "end": 4332.907,
    "text": "I'll add a few notes on that and ask another question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.947,
    "end": 4335.488,
    "text": "So in thinking about these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.778,
    "end": 4342.041,
    "text": " appeals or abductive hypotheses about hidden causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.482,
    "end": 4345.484,
    "text": "It's like, wow, what is causing all of these horses?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4345.724,
    "end": 4351.127,
    "text": "I mean, there's small ones and big ones and they have different patterns and some have four legs, some have three legs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4351.147,
    "end": 4353.068,
    "text": "One, you know, had this other number of legs one time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.088,
    "end": 4353.328,
    "text": "So it's like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4354.429,
    "end": 4359.71,
    "text": " What could be causing all of these sounds, sights, smells?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4360.65,
    "end": 4364.751,
    "text": "And there's basically two extreme structural hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.392,
    "end": 4370.133,
    "text": "One of them is like the single, like that's the platonic horse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.653,
    "end": 4372.133,
    "text": "It's like, I don't even know what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.393,
    "end": 4376.854,
    "text": "It's very different than any of the horses, but it just somehow is the structural cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.594,
    "end": 4379.815,
    "text": "It's the formal cause of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.204,
    "end": 4402.925,
    "text": " all these horses the other extreme structural hypothesis is like horses don't exist everything causes like there's just sort of like an infinite component model now complexity is always found in between the one and the infinite and so that's where we actually do develop more well articulated accounts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.52,
    "end": 4411.086,
    "text": " And what really does cause a horse to be a certain way in its accent, in its real embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.826,
    "end": 4423.656,
    "text": "But we can see that kind of monist or absolutist appeal as being like, as you put, a good null hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4424.577,
    "end": 4428.78,
    "text": "Like potentially one of the best starting null hypotheses ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4428.979,
    "end": 4438.324,
    "text": " not going too deep into value judgments, but I mean, why not just start with saying, maybe there's one thing and then we'll keep adding latent causes as we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.965,
    "end": 4453.793,
    "text": "But then to confuse the appeal to a single cause with the actuality of the single cause is kind of this challenging dance because if you take it as real, then it's real as real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.188,
    "end": 4464.695,
    "text": " And then to hold it at a distance though, but it's hard to hold something at a distance when life and everything is on the line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.518,
    "end": 4483.127,
    "text": "And then one other piece, what you said about like, well, the godlike appeals of some of these, like Whitehead's formal approaches,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.13,
    "end": 4490.172,
    "text": " And you seem to express somewhat of an ambivalence about this kind of an appeal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.633,
    "end": 4495.434,
    "text": "And that reminded me of the quote from Hamlet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.255,
    "end": 4497.955,
    "text": "What a piece of work is a man.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.315,
    "end": 4508.119,
    "text": "How noble in reason, how infinite in faculty, in form and moving, how express and admirable, in action, how like an angel, in apprehension, how like a god.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4511.954,
    "end": 4514.878,
    "text": " Action and inference in Hamlet, early ACDIMF days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.085,
    "end": 4521.567,
    "text": "Okay, I'll ask a question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.949,
    "end": 4524.271,
    "text": "Muse Equal wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.078,
    "end": 4532.965,
    "text": " Isn't this indicative of learning and intuition being entropic post-observation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.806,
    "end": 4542.255,
    "text": "We disassemble the observed construct into segment frames of historical time through interaction, prior knowledge and memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.264,
    "end": 4550.325,
    "text": " Where is learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.586,
    "end": 4551.988,
    "text": "Where is symbolic learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.548,
    "end": 4557.655,
    "text": "In what ways is symbolic learning anticipatory, real-time, or retrospective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.612,
    "end": 4582.36,
    "text": " I guess this kind of gets over what you were saying with forms as kind of causes of hidden states and kind of how do you update beliefs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.7,
    "end": 4589.525,
    "text": "Once you have the beliefs, how complicated is it to actually update them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.545,
    "end": 4594.488,
    "text": "I'm trying to think of an example that we went through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.23,
    "end": 4598.611,
    "text": "But yeah, it's a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4601.311,
    "end": 4604.453,
    "text": " And now I'm just thinking of my daughter, because she's learning how to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4604.734,
    "end": 4606.395,
    "text": "So she's clearly symbolic learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.036,
    "end": 4619.124,
    "text": "And kids are much more comfortable with variation, with entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4620.225,
    "end": 4622.947,
    "text": "Not comfortable, but they exist in much more entropy than we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.921,
    "end": 4634.089,
    "text": " Um, so they can, they can navigate the space, I think probably better than we can conceive that they, that we can, uh, or that even one can, um, because they're in it so often.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.909,
    "end": 4638.933,
    "text": "Um, and how do you kind of build symbols?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4638.993,
    "end": 4641.915,
    "text": "Well, I guess, um, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.935,
    "end": 4648.961,
    "text": "So where I came from, from, um, symbolic learning was, um, Hofstadter and, and, and Sanders, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.062,
    "end": 4653.823,
    "text": " book on analogies of forgetting services in essence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.744,
    "end": 4663.207,
    "text": "And so their claim is that, which I think aligns pretty well with active inference, but I'm curious to hear more feedback on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.807,
    "end": 4669.109,
    "text": "And their claim is that we learn primarily through metaphor,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.112,
    "end": 4678.994,
    "text": " And so it's through, I think, through analogy, they said, so they look at, you look at surface differences rather than essential differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.114,
    "end": 4681.916,
    "text": "And essential would be more form, platonic form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4683.856,
    "end": 4685.257,
    "text": "Look at more of surfal differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.337,
    "end": 4693.02,
    "text": "So, you know, my, you know, my dad is to me, there's a dad towards someone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.021,
    "end": 4723.119,
    "text": " you know i'm crossing the street so i i i suppose learning um i'm trying to get some good examples but um you know we we build we build structures of uh symbols um using kind of like against like so you know this is um like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4725.697,
    "end": 4729.178,
    "text": " you know, this is an action of sitting in one chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.358,
    "end": 4733.019,
    "text": "I sat, I saw someone sitting on a bench outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.039,
    "end": 4735.579,
    "text": "You know, I saw someone sitting on the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4736.62,
    "end": 4749.043,
    "text": "So it's producing, I guess, a generative model of, you know, in this context, in this situation, this is happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.363,
    "end": 4753.143,
    "text": "And these are the, you know, these are the relevant features of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.444,
    "end": 4754.904,
    "text": "And this is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.806,
    "end": 4758.389,
    "text": " than the object within that environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.731,
    "end": 4764.84,
    "text": "Here's something going on here, and I'm bringing in and I'm using that as a prior to establish something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4765.821,
    "end": 4766.523,
    "text": "And then at some point,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4768.476,
    "end": 4770.257,
    "text": " And then at some point, we start getting concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4770.297,
    "end": 4779.523,
    "text": "And then once you have your initial concept, because that takes some time, once you have your initial concept, then you compare concepts to concepts in this kind of metaphorical fashion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.863,
    "end": 4783.846,
    "text": "I didn't give a good example of metaphor, but we start to move outward that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.786,
    "end": 4787.148,
    "text": "But yeah, I guess that's the best I have for you at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4788.939,
    "end": 4817.973,
    "text": " yeah this role of metaphor is very interesting and something lightly speculated upon but not quite brought into active inference generative modeling yet but metaphors like well it's like the highest point on the building or it's like the center of the circle or it's like what's inside or outside of the circle so those would those kinds of metaphors which can be bootstrapped",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.721,
    "end": 4837.091,
    "text": " or grounded in the immediacy of our developmental and evolutionary history can then be brought into purely cognitive or symbolic spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.111,
    "end": 4844.515,
    "text": "So we could talk about a clash of symbols or about friction or inertia and grasping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.215,
    "end": 4845.696,
    "text": "All of these...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.188,
    "end": 4854.05,
    "text": " tangible examples that are kind of out there, but then we bring them in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.01,
    "end": 4861.093,
    "text": "And I think that may have something to do with what Dave was discussing with the I and thou.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4861.733,
    "end": 4863.974,
    "text": "So it's not, that's kind of the Martin Buber.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4864.134,
    "end": 4865.294,
    "text": "It's not just I, it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.894,
    "end": 4873.157,
    "text": "If we were talking to an inanimate object or an object that we didn't think had a self in world model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.44,
    "end": 4898.355,
    "text": " then it'd be like ranting to, you know, this puppet or just like kind of just, but under no expectation that it has a mind of its own, but then the I thou or inactive inference, what's sometimes called like thinking through other minds or thinking with other minds where it's kind of like, well, I'm modeling my own speech in relation to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4899.272,
    "end": 4903.055,
    "text": " implicitly or explicitly, to what they'll respond to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.075,
    "end": 4912.641,
    "text": "And knowing that they have that kind of recursive activity as well, that is purely cognitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.202,
    "end": 4915.443,
    "text": "It's lifted from the accenture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4915.964,
    "end": 4918.625,
    "text": "It's brought into the structural and the symbolic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4921.487,
    "end": 4925.39,
    "text": "But it's always realized by systems with accents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.851,
    "end": 4926.911,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.666,
    "end": 4956.244,
    "text": " I think just the way that you introduced and highlighted that more direct experience of how somebody is saying that, not what they say, it's easy for us now to focus on the semantics of the what, which are so overwhelming, but that almost...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.479,
    "end": 4958.599,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.619,
    "end": 4958.699,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.291,
    "end": 4998.554,
    "text": " and so that that's a complex tangle of of cognitive and cultural phenomena it's not like only being ascribed to the ability to do metaphor or think through other minds or use symbolic um logic and learning but all of these are are coming together in this kind of unified mystery yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.034,
    "end": 5004.457,
    "text": " Yeah, maybe I understand that earlier point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5004.657,
    "end": 5017.846,
    "text": "So the Friston article on singing from the same hymn sheet, or you think of it as with language, you're engaging in these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.927,
    "end": 5035.912,
    "text": " fast-paced dances with people, exchanging beliefs in anticipation of your interlocutor's beliefs and you're co-constructing something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5035.932,
    "end": 5047.195,
    "text": "The only thing I want to say is when you asked earlier where I felt active inference was useful, in a nutshell, it can better",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5049.591,
    "end": 5054.134,
    "text": " understand the dynamics between cooperation and competition, um, you know, outside and inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5054.154,
    "end": 5063.08,
    "text": "Um, and yeah, that gets us some of the tension with how we think of communication, whether it's cooperative or whether it's kind of just ecological.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5063.8,
    "end": 5067.923,
    "text": "Um, but it encourages a, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5070.748,
    "end": 5082.311,
    "text": " it encourages that dynamic where we're in, like if, you know, if we're saying something and maybe I'll disagree, maybe you'll disagree slightly with me on a point, but we're, so we're still here trying to be cooperative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5082.951,
    "end": 5097.555,
    "text": "So we're trying to say things that we both understand and sharing that kind of same cultural new spatial attempting to, and at the same time proposing either iteratives or,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.317,
    "end": 5102.999,
    "text": " modifications of those beliefs, so that I'm able to persuade you of my point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.04,
    "end": 5107.041,
    "text": "When we get out whether communication is kind of cooperative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.061,
    "end": 5114.925,
    "text": "Take some of this cooperative thing to its dance versus it's kind of contentious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5116.245,
    "end": 5121.708,
    "text": "And you can start to tease out those, you know, those those factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5123.399,
    "end": 5126.08,
    "text": " Okay, short and interesting question in live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.52,
    "end": 5131.123,
    "text": "Upcycle Club writes, what do you think about petroglyphs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5132.403,
    "end": 5138.946,
    "text": "Petroglyphs are rock carvings made by pecking directly on rock surfaces using a stone chisel and a hammer stone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5140.307,
    "end": 5143.048,
    "text": "What do you think about rock inscription?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5144.048,
    "end": 5145.369,
    "text": " Rock inscription, surely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5146.25,
    "end": 5147.791,
    "text": "I'm a big fan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.811,
    "end": 5153.975,
    "text": "Well, I imagine what you might be getting at is, is that symbolic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.376,
    "end": 5161.88,
    "text": "Probably if a human does it, maybe he's getting at it or she's getting at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5161.92,
    "end": 5164.182,
    "text": "If a bird has done it, is that symbolic?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5164.362,
    "end": 5165.683,
    "text": "Yeah, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.483,
    "end": 5168.004,
    "text": "I'm curious, but yeah, I'm a big fan of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5169.185,
    "end": 5194.833,
    "text": " sculpture that kind of reminds me of the Ozymandias poem like I was here and all of that entails like there was an empire here now of course in the poem it's all degraded and decayed and so that's kind of like the media and the message but the inscription on the stone is like I was here I chose to do this or even if you don't sorry what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5195.733,
    "end": 5222.002,
    "text": " almost like graffiti or something like why why are we why are we doing this why are we okay i get it yeah somebody who uses that graffiti tag did that we could have different stories they could have different stories about whether they have free will or all these different like secondary things but it's like the fact of the matter is on the rock it was inscribed so i i say yes i mean i i get i get that now so um what i see there is um you know what i see there is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5223.783,
    "end": 5228.286,
    "text": " That is, you know, that's soul, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5228.346,
    "end": 5233.33,
    "text": "That's in the sense of, you know, something like Whitman would describe it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5235.551,
    "end": 5237.733,
    "text": "We do that because we have a soul.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5237.773,
    "end": 5247.12,
    "text": "I mean, not necessarily in a religious context, but as in you can exist, you know, Daniel Friedman can exist as a conceptual identity outside of space and time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5247.78,
    "end": 5275.215,
    "text": " um and the way you do that is that you you leave a mark you know you leave your legacy and um you know um you know et cetera et cetera but yeah so we we exist as these symbolic selves both um as part of these cultural units but in some sense outside of it um and so yeah do you mean do you write your name on a wall do you um you know do you start a company um you know do you want to be um you know famous do you want to be on a movie for whatever reason um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5275.987,
    "end": 5279.149,
    "text": " yeah, this is that that is an extension of identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.03,
    "end": 5282.031,
    "text": "Yes, if that's what that's getting at, then yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5283.812,
    "end": 5284.093,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5284.153,
    "end": 5293.379,
    "text": "Well, in sort of closing, where are you going to take this line after the frontiers paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5293.399,
    "end": 5293.459,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.536,
    "end": 5300.219,
    "text": " this, what's the next frontier or the next journey?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5301.621,
    "end": 5303.082,
    "text": "Well, so yeah, so that, that, that, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5303.242,
    "end": 5307.105,
    "text": "So yeah, I'm open to ideas, but yeah, I was, I was obsessed with this idea for a while.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5308.487,
    "end": 5309.828,
    "text": "And I think I've nearly gotten it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5310.068,
    "end": 5312.37,
    "text": "I think I'm kind of like 95% the way there or maybe 90%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5312.81,
    "end": 5321.818,
    "text": "And I think this discussion has helped me, but yeah, I'm just kind of curious to see where it might go, but yeah, I mean, I'd love to see it formalized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5321.838,
    "end": 5323.5,
    "text": "Let's see taken seriously, but yeah,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5323.98,
    "end": 5337.947,
    "text": " um yeah i have no specific uh no specific problems but cool it was great chatting with you i appreciate the uh setting this up and i appreciate the dialogue thank you i really appreciate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5339.474,
    "end": 5357.205,
    "text": " hearing the comprehensivity and just the relatability of the curiosity and how many things are brought together in your paper and in this discussion so see you around until next time take care thanks everybody",
    "speaker": "SPEAKER_00"
  }
]