[
  {
    "start": 7.483,
    "end": 8.144,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 8.784,
    "end": 12.969,
    "text": "Welcome to Act In Flab guest stream number 18.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 13.75,
    "end": 21.078,
    "text": "We're here with Julian Keberstein and Michael Kirchhoff, as well as Dave, Dean, and Steven from Act In Flab.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 21.839,
    "end": 28.326,
    "text": "And we're really appreciative for the authors for joining today to be discussing some of their work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 28.946,
    "end": 37.333,
    "text": " We're going to have a presentation by the authors and then following the presentation, we'll have ample time for discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 37.493,
    "end": 42.677,
    "text": "So please feel free to write any questions down in the live chat and we'll get to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 42.917,
    "end": 49.282,
    "text": "So without further ado, Julian and Michael, thanks a lot for joining and please take it away.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 50.794,
    "end": 52.775,
    "text": " Well, thanks so much for inviting us.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 52.795,
    "end": 59.539,
    "text": "We've been looking forward to this particular session, and thanks for staying up late in the US and wherever you are in Europe for getting up early.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 60.179,
    "end": 65.182,
    "text": "It's only 3.30 in the afternoon here for us, so that's more manageable in Australia.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 66.142,
    "end": 67.463,
    "text": "I'll just share my screen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 67.483,
    "end": 74.066,
    "text": "Is that right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 74.106,
    "end": 75.707,
    "text": "Yeah, you guys can see that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 76.588,
    "end": 77.048,
    "text": "Bring that up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 79.124,
    "end": 81.186,
    "text": " So that should all be clear in a second, is that right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 81.747,
    "end": 82.167,
    "text": "Looks good.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 83.128,
    "end": 84.009,
    "text": "Great.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 84.209,
    "end": 88.333,
    "text": "So the paper is called The Literalist Fallacy and the Free Energy Principle.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 89.675,
    "end": 101.066,
    "text": "It's a philosophical paper on the topic of scientific realism, scientific anti-realism slash instrumentalism in the context of the FEP, or the Free Energy Principle.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 101.967,
    "end": 109.391,
    "text": " I suppose just as a primer, this is a revised and resubmit stage for our paper at this particular moment in time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 110.011,
    "end": 117.594,
    "text": "So any comments that we might be able to get to further improve the quality of the paper will, of course, be welcomed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 119.707,
    "end": 120.808,
    "text": " So let's start.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 121.249,
    "end": 128.898,
    "text": "There will be a little bit of, I suppose, conceptual stage setting at the start, just given the nature of this particular paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 129.379,
    "end": 135.887,
    "text": "And also because it sort of speaks to a few other issues that go beyond just a sort of narrow focus on the free energy principle.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 137.881,
    "end": 145.786,
    "text": " So this is the debate as it sits, or at least as we try to sketch it in the paper, between scientific realism and instrumentalism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 146.387,
    "end": 152.27,
    "text": "So let's just say briefly what scientific realism is and briefly what instrumentalism is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 152.31,
    "end": 156.493,
    "text": "And then I will say a little bit more about how to think about scientific realism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 157.294,
    "end": 166.36,
    "text": "Overall, the point of the paper was to sort of try to marshal a set of arguments for why at least a version of scientific realism",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 167.222,
    "end": 170.865,
    "text": " can be accommodated by FEP models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 172.626,
    "end": 190.34,
    "text": "And it was motivated in part because it seems like in the last few years there's been a flurry of papers in one way or another arguing for scientific anti-realism with respect to the FEP or how to interpret parts of that particular model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 190.36,
    "end": 192.702,
    "text": "So that's the kind of setting we're in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 193.74,
    "end": 212.055,
    "text": " So, scientific realism, that's the view that one reasonable goal of our currently best scientific theories, scientific models, is to offer literally true, or probably true, or approximately true, or probably approximately true descriptions and explanations of target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 212.235,
    "end": 222.283,
    "text": "I have here in bracket, for example, natural phenomena, but it could also be artificial systems in the context of artificial intelligence, artificial life, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 223.752,
    "end": 238.018,
    "text": " Now, by contrast then, instrumentalism or scientific anti-realism, that's the view that scientific theories and models are nothing but instruments for prediction of observable behavior of target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 238.978,
    "end": 241.519,
    "text": "So here, the claim is something like this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 242.56,
    "end": 249.543,
    "text": "From an instrumentalist perspective, theories slash models, they have explanatory power, and that gives them some utility.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 250.802,
    "end": 254.465,
    "text": " But they're not, in any sense of the word, truth producing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 254.845,
    "end": 268.835,
    "text": "So one has not to think about instrumentalists or the instrumentalist position as putting forth statements about how the world is on the basis of their models, by which you can say something, say true or false, about how the world is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 271.664,
    "end": 281.471,
    "text": " So the main question now is, for this particular paper we are considering, is the FEP truth producing in a way that's consistent with scientific realism?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 282.732,
    "end": 291.899,
    "text": "And of course, as I mentioned just a minute or so ago, we think it is indeed consistent with a particular way of conceiving of scientific realism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 293.781,
    "end": 298.404,
    "text": "Maybe a footnote here that's important, both scientific realism and instrumentalism are quite",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 300.839,
    "end": 305.902,
    "text": " are multiple, there's multiple different versions of each particular framework in the philosophy of science.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 305.942,
    "end": 313.606,
    "text": "So we're trying to offer a reasonable general characterization of these particular frameworks in order to sort of get some traction on the debate.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 316.367,
    "end": 324.592,
    "text": "So as I said, it's a reasonable goal of our best scientific theories and models to offer these true or probably true or approximately true descriptions of target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 326.365,
    "end": 338.371,
    "text": " Now, here we draw inspiration from Peter Guthrie Smith, his book here, Theory and Reality, that tells us how perhaps to interpret that particular general claim.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 338.391,
    "end": 340.353,
    "text": "He says the following.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 340.373,
    "end": 348.477,
    "text": "He says it's a mistake to express the scientific realist position in a way that depends on the accuracy of our current scientific theories.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 349.707,
    "end": 364.721,
    "text": " So if we express scientific realism by asserting the real existence of entities recognized by science at this particular point in time, then if those particular theories turn out to be false, well, then the whole framework of scientific realism turn out to be false.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 365.241,
    "end": 374.97,
    "text": "So we shouldn't think that's what you have to do in order to advocate for a kind of scientific realism about scientific models and theories and their relation to target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 377.779,
    "end": 379.539,
    "text": " So building on this, we can say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 379.559,
    "end": 386.881,
    "text": "So again, this notion here is that an actual and reasonable aim of science is to give us these accurate descriptions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 387.422,
    "end": 395.364,
    "text": "Well, that's not the claim that scientific theories must be true now and make truth-producing claims about target systems now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 395.384,
    "end": 404.126,
    "text": "I mean, it's a nice thing if they do, but it is not a necessary condition for one to adopt scientific realism about scientific theories and models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 406.067,
    "end": 417.959,
    "text": " There's no commitment to the success of the individual sciences, so there can be trouble in biology, but we can still hold, for instance, scientific realism about, for instance, the FEP applied to the cognitive sciences, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 419.78,
    "end": 430.691,
    "text": "Now, importantly, and this is why I'm just spending a little bit of time initially on scientific realism, the kind of version of scientific realism we're interested in",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 431.385,
    "end": 444.709,
    "text": " is going to allow for theories and models to posit idealizations, for instance, understood as distortions, approximations, understood here as perhaps inexactness of scientific models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 445.749,
    "end": 454.912,
    "text": "They can pose fictional entities, for instance, entities that are not actual, and thus like in the here and now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 455.232,
    "end": 456.753,
    "text": "But the important point is that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 457.796,
    "end": 479.042,
    "text": " You can keep that view and still endorse scientific realism because one aspect here is that the long-term aim of working with your scientific models is for them to become truth producing or to become more and more aligned with the target systems that we're interested in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 479.062,
    "end": 481.623,
    "text": "And we'll finesse this view as we sort of move along.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 484.485,
    "end": 498.455,
    "text": " Now, this issue between the scientific realist and the instrumentalist, as we are considering it in the context of the FEP, comes up when we consider what we call the map problem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 498.775,
    "end": 501.977,
    "text": "And this is not a term of art that we have invented.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 502.178,
    "end": 507.141,
    "text": "There are other authors, both in the FEP and elsewhere, that make use of it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 507.221,
    "end": 509.443,
    "text": "For instance, Mel Andrews in her nice paper",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 510.784,
    "end": 514.728,
    "text": " 2021 in biology and philosophy that speaks of this particular problem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 514.748,
    "end": 521.495,
    "text": "So this is just a quote from the paper that gets us thinking about what our focus is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 522.436,
    "end": 530.945,
    "text": "So we're going to ask, what is the relationship between scientific models constructing using the FEP and the realities these models purport to represent?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 532.153,
    "end": 538.015,
    "text": " Our focus is especially on the FEP and what, if anything, it tells us about the system that is used to model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 538.555,
    "end": 540.436,
    "text": "And this is what we call the map problem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 541.076,
    "end": 549.919,
    "text": "How does the map, your theories, your models relate to the territory, real world target systems of which those theories and models are maps?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 552.591,
    "end": 560.197,
    "text": " Now, if there's anybody joining on the live stream, this is just a very brief statement about what the free energy principle says.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 560.838,
    "end": 568.964,
    "text": "Julian and I, and as well as Ian, are working under the assumption that that doesn't need to take long to introduce that in this particular context.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 570.165,
    "end": 579.613,
    "text": "But very briefly, then, the FEP states that a self-organizing system that tends towards maintaining a non-equilibrium steady state with its environment must minimize free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 580.563,
    "end": 593.706,
    "text": " where minimizing free energy, at least under a certain Bayesian interpretation, is to maximize model evidence, that is, maximize the likelihood of some data given a model of the system's interactions with its environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 594.886,
    "end": 598.867,
    "text": "Now, how does the MAP problem arise in the context of the FEP?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 600.187,
    "end": 602.708,
    "text": "Well, it might arise if you're a, say,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 603.979,
    "end": 624.888,
    "text": " a researcher working in artificial intelligence and the aim is to build robots that engage in active inference for example navigating or making decisions etc so here the question becomes what's the relationship between our fep model understood as an active inference model and then how",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 626.269,
    "end": 640.446,
    "text": " One engineers, if you like, artificial agents to perform in accordance with those particular models, what those models specifies in terms of, say, decision making, belief updating, and selecting action policies for adaptive behavior.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 641.639,
    "end": 655.046,
    "text": " A different way the map problem might arise would be from the computational neuroscientific perspective, where one might be interested in tracking transitions across belief, perhaps in deep generative models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 655.866,
    "end": 658.608,
    "text": "And the map problem then is, well, how does that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 659.508,
    "end": 673.114,
    "text": " theoretical specification of free energy minimization under active inference, how does that map onto what the brain actually does in order to, say, shift from beliefs to beliefs or to make decisions about what to do in the world?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 673.594,
    "end": 678.896,
    "text": "So that's just a few examples of where this particular issue becomes prevalent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 682.873,
    "end": 694.677,
    "text": " Now, just to situate this discussion a little bit, because there's a few tweaks and turns in the paper, and it's a large and somewhat complex conceptual landscape we're working in, or at least it seems to me.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 694.697,
    "end": 700.279,
    "text": "We're just going to try to situate this a little bit more so you get a feel for this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 700.299,
    "end": 707.581,
    "text": "We've got a nice reviewer comment that sort of introduces the issue here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 708.41,
    "end": 719.774,
    "text": " So the comment is something like, if we take the free energy principle, like many other theories across different sciences, then we can think about that as a kind of model-based approach to science.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 720.775,
    "end": 728.857,
    "text": "And if you look at the little image over here, which is a modification of Geer's description of how this works, modified by Geoffrey Smith in a 2009 paper,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 731.021,
    "end": 737.944,
    "text": " we can initially start to develop a description of a model and to say something about what the model system in question is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 737.964,
    "end": 740.125,
    "text": "And the comment is something like this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 740.185,
    "end": 741.946,
    "text": "We can study models for their own sake.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 742.446,
    "end": 745.788,
    "text": "As Andrews has pointed out, Mel, as I referred to earlier,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 746.627,
    "end": 750.209,
    "text": " Any model that can be treated realistically can also be treated instrumentally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 750.269,
    "end": 753.531,
    "text": "Scientists can disagree about which bits of the model are meant to be real.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 754.212,
    "end": 758.734,
    "text": "Now, this is important in understanding how the map problem arises.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 759.275,
    "end": 772.823,
    "text": "So Andrews in the 2021 paper gives us a whole list of different ways one can see the kind of mathematical structure of the FEP being interpreted as a scientific model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 773.822,
    "end": 779.725,
    "text": " The work of Michael Weisberg is influential in the context of philosophy of science, philosophy of biology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 780.846,
    "end": 794.172,
    "text": "So she and he, they can with sort of a minimally three different models that we are interested in, as a sort of targetless model, the FEP as a generalized model, and then the FEP as a target-directed model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 794.892,
    "end": 800.135,
    "text": "Now, you can work purely on the mathematics, if you like, of the free energy principle,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 801.254,
    "end": 808.096,
    "text": " for the sake of just understanding the model, for getting your model description right of your model system as per that image.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 809.256,
    "end": 817.679,
    "text": "Now, here the point is that that in and of itself doesn't give rise to anything like the map problem because you can disagree.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 817.719,
    "end": 820.659,
    "text": "You can come at that work from an instrumentalist perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 820.699,
    "end": 823.32,
    "text": "You can come at it from a scientific realist perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 823.92,
    "end": 829.842,
    "text": "But doing that kind of work doesn't really allow you to adjudicate between the two positions, or so it seems to us.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 831.135,
    "end": 834.116,
    "text": " So that would be the instance of a targetless model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 834.136,
    "end": 837.918,
    "text": "You're not asking questions that relate from the model to a target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 839.158,
    "end": 841.579,
    "text": "You can treat the FEP as a generalized model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 842.54,
    "end": 854.885,
    "text": "You can perhaps think of it as you could model theories of natural selection from the point of view of the FEP, but we are not saying anything about the involvement of any particular kind of species.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 856.499,
    "end": 865.806,
    "text": " That maps on to, for instance, a different discussion as well, which we consider, but we won't talk to unless it comes up in the Q&A, about the role of the Markov blanket notation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 866.587,
    "end": 877.255,
    "text": "Now, as we put it in the paper, that gives you a kind of generalized approach for delineating boundaries, but it doesn't give you an approach for delineating boundaries for any particular individual.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 877.636,
    "end": 883.02,
    "text": "In that sense, it's a generalist take on FEP models on the basis of the Markov blanket formulism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 884.588,
    "end": 899.12,
    "text": " Now, the math problem for us gets interesting when you pursue a target-directed model, when you try to implement the mathematical structures posited by the FEP in terms of a process theory such as active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 899.98,
    "end": 910.909,
    "text": "So you're sort of moving from a mathematically general characterization of the adaptive behavior to specifying what a particular individual or set of individuals must do",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 912.133,
    "end": 914.154,
    "text": " in order to engage adaptively in the world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 914.454,
    "end": 932.059,
    "text": "So you're sort of committing yourself to getting the right-hand side of this model or this little image, if you like, saying something about in which way do your model now resemble the systems that you're actually aiming to explain or understand something about.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 934.419,
    "end": 940.161,
    "text": "OK, so once we have that, we should give the argument for the instrumentalists.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 940.888,
    "end": 953.175,
    "text": " And then once we've done that, we'll see the kind of problem that we raise for the instrumentative that we think is a kind of a fallacy of inference from certain considerations to certain claims about the FEP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 955.036,
    "end": 967.743,
    "text": "So premise one here is that active inference models under the FEP introduce distortions in representing biological and cognitive systems via idealizations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 968.732,
    "end": 984.06,
    "text": " So one way to think about that might be the introduction of variational free energy as a kind of distortion into the framework in order to kind of solve a computational problem about how surprise is minimized, as well as in exactness via approximation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 985.161,
    "end": 994.706,
    "text": "And one example might be something like introducing this idea that free energy minimization can be construed mathematically as akin to a kind of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 996.229,
    "end": 1019.695,
    "text": " bayesian inference would be an inexactness introduced into the formalism primarily because it was so it seems nobody thinks that the brain quite literally uh encodes something like base's theorem okay premise two then is that scientific realism requires that models provide descriptions of target systems that are literally true",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1022.503,
    "end": 1028.189,
    "text": " So that's somewhat of a dead aisle, if you like, if you were to hold scientific realism with respect to premise one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1029.59,
    "end": 1038.459,
    "text": "Premise three, then, is that active inference models are not true and accurate representations of biological and cognitive systems, precisely because of the issues raised in premise one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1040.06,
    "end": 1042.402,
    "text": "Therefore, active inference models are false.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1043.944,
    "end": 1045.786,
    "text": "They're at best useful fictions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1047.129,
    "end": 1067.154,
    "text": " And just to give you the references of where we are drawing work from in terms of defining the term idealization and the term approximation, here we're using a nice paper by McMullen on Galilean idealizations to think about idealization, and we are using a canonical paper by Norton to define approximation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1068.094,
    "end": 1077.299,
    "text": " These are somewhat contentious, primarily because there's, as one might expect, there's all kinds of other takes on it, but you have to come down on one side, I suppose.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1079.0,
    "end": 1092.287,
    "text": "So, once we have the instrumentalist claim up and running, this is the kind of fallacy that we're arguing that a set of papers defending instrumentalism in the context of the FEP is making.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1092.687,
    "end": 1094.888,
    "text": "And we coined it the literalist fallacy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1095.508,
    "end": 1096.669,
    "text": "And just the prime use of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1098.066,
    "end": 1105.59,
    "text": " Premise two here is the claim that scientific realism requires that models provide descriptions of target systems that are literally true.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1106.091,
    "end": 1118.178,
    "text": "Hence the claim the literal is fallacy because we're going to show that's not a necessary condition upon which the base one's defense of scientific realism",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1119.667,
    "end": 1132.488,
    "text": " So what we say is the mistake, the literalist fantasy is the mistake of accepting or affirming about the FEP from the fact that active inference models are not literally mapped onto biological and cognitive systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1136.257,
    "end": 1147.83,
    "text": " A slightly different formulation that we have here is that in this context of the FEP, some find apparent discrepancies between the map and the territory a compelling reason to defend instrumentalism about the FEP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1147.85,
    "end": 1151.414,
    "text": "And we take that to be problematic, given this particular kind of fallacy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1153.018,
    "end": 1158.2,
    "text": " We identify this particular fallacy by those defending instrumentalism about the FEP and we call it the literalist fallacy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1158.44,
    "end": 1161.102,
    "text": "Here's the second variation of it, if you like.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1161.702,
    "end": 1171.246,
    "text": "This is the fallacy of inferring the truth of instrumentalism based on the claim that the properties of FEP models do not literally map onto real-world target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1171.346,
    "end": 1181.191,
    "text": "So one question that might be interesting to discuss in the Q&A is whether or not it's indeed the problem for an instrumentalist to infer the truth of their own position",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1181.591,
    "end": 1187.974,
    "text": " on the basis of the claim that the properties of FEP models do not literally map onto real-world target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1190.294,
    "end": 1193.496,
    "text": "So the pushback here on the second formulation is something like this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1193.816,
    "end": 1196.617,
    "text": "Instrumentalists are not asserting the truth of their own position.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1196.897,
    "end": 1198.778,
    "text": "That would be self-contradictory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1199.798,
    "end": 1204.96,
    "text": "Now, there's a set of conceptual issues here, but I just wanted to flag the issue and perhaps come back to it in the Q&A.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1205.04,
    "end": 1209.462,
    "text": "It would take us too long to get into it, and it is somewhat philosophical and conceptual.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1211.087,
    "end": 1220.77,
    "text": " Here's some evidence, if you like, a set of papers across some different topics that we argue and are all committing this kind of fallacy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1221.41,
    "end": 1228.492,
    "text": "Here's a 2020 paper by Van Ness and Hippolyto that state, they state that it remains, quote, it remains disputed",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1229.313,
    "end": 1243.691,
    "text": " whether it's the FEP statistical models or scientific tools to describe non-equilibrium steady-state systems, which we call the instrumentalist reading, or are literally implemented and utilized by those systems, the so-called realist reading.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1244.312,
    "end": 1253.097,
    "text": " And what they're going to conclude is that since FEP models are not true and accurate descriptions of these target systems, instrumentalism turns out to be the only option.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1253.457,
    "end": 1267.906,
    "text": "So for us, that's the literalist fallacy because it assumes that the realist position is that your theoretical models literally have to be implemented in target systems for that kind of framework and the philosophy of science to be up and running.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1270.29,
    "end": 1272.331,
    "text": " Runeberg et al.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1272.351,
    "end": 1283.878,
    "text": "2021, presumably updated to 2022 at some point this year in their target article on BBS, focused on the ontological status of the Markov blanket formulism in the FEP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1284.639,
    "end": 1293.064,
    "text": "Now, they argue that much of the literature on the FEP implies that organisms literally instantiate the mathematical structure of Markov blankets.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1294.325,
    "end": 1299.168,
    "text": "They argue that such a use of the formulism conflates a model with its target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1300.29,
    "end": 1319.368,
    "text": " Now, if you think that in order to use the Markov blanket formalism productively, even from the scientific realist point of view, that the mathematical formulation of that particular formalism has to be implemented in the actual target system, then you're committing the literalist fallacy, because even the scientific realist is going to push back against that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1322.155,
    "end": 1336.045,
    "text": " Colombo and Palacios in a 2021 article in Biology and Philosophy target the issue of ergodicity in the FEP, namely that one can realistically model biological systems as having an ergodic density.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1336.465,
    "end": 1343.75,
    "text": "Now, they deny that ergodicity captures properties of biological systems, and therefore the FEP is biologically implausible.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1344.27,
    "end": 1351.475,
    "text": "Now, a line on that is that's akin or a species of the literalist fallacy, precisely because it's going to assume,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1351.975,
    "end": 1358.705,
    "text": " that the theorists actually think that it's part and parcel of target systems that they have an ergodic density.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1359.505,
    "end": 1369.992,
    "text": " Our take on it is, no, that particular approach to modeling state transitions under the FEP is precisely that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1370.112,
    "end": 1389.225,
    "text": "It's an approximation of scientific convenience in order to say something about how systems occupy states over time, but you shouldn't conflate that particular perspective with saying that's literally the case of target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1391.852,
    "end": 1419.853,
    "text": " i'll skip the last quote here uh just for time considerations we can come back to it if there's there's any issues okay so let's turn to some examples and some cases of this literalist fallacy and how to how to think about it and in terms of scientific realism so in the paper we consider a bunch of this sort of cases or examples we consider the notion of variational free energy",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1420.7,
    "end": 1423.701,
    "text": " We consider the Markov blanket formulism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1424.161,
    "end": 1428.522,
    "text": "We consider the role of Bayesian inference in these sorts of formulations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1428.562,
    "end": 1431.723,
    "text": "And then finally, we turn to consider the topic of ergodicity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1432.483,
    "end": 1440.766,
    "text": "And for this particular presentation, if you like, we're only going to focus on the first variation of free energy and then the latter, ergodicity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1440.806,
    "end": 1443.867,
    "text": "And perhaps we can come back to the other cases in Q&A.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1447.088,
    "end": 1447.168,
    "text": "OK.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1449.69,
    "end": 1466.415,
    "text": " What strikes us, there's two different ways of interpreting the variational free energy notation, primed here under the consideration that it seems as if organisms are minimizing variational free energy in the long run.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1466.895,
    "end": 1471.236,
    "text": "The as if formulation here, which seems ever pervasive now in the literature,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1472.556,
    "end": 1474.618,
    "text": " is not, I think, a one-way street.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1474.658,
    "end": 1484.122,
    "text": "There's a couple of options here that we now want to try to unpack, especially because we're doing the presentation and especially because we've been prompted to do so, I think, by a set of review comments.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1484.523,
    "end": 1485.203,
    "text": "But let's get into it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1485.243,
    "end": 1497.289,
    "text": "This is the sort of first option, if you like, that's going to deliver a set of reasons for thinking that instrumentalism is the case for the FEP, and we're going to push back on those particular reasons.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1498.601,
    "end": 1510.212,
    "text": " So variational free energy is an information theoretic construction used to compute how organisms are able to resist decay by positing variational free energy as an upper bound.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1510.952,
    "end": 1516.057,
    "text": "Now, under the FPP, for an organism to exist, it must keep its states within certain bounds.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1516.978,
    "end": 1518.279,
    "text": "So that's the generic open up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1519.039,
    "end": 1525.304,
    "text": " So I'll give you some examples now of the as-if formulation, sort of prompted by this quote from Friston.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1525.765,
    "end": 1531.009,
    "text": "The FTP is a mathematical formulation of how adaptive systems natural tendency to decay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1531.95,
    "end": 1537.834,
    "text": "Ramstad and colleagues in 2020 paper say, this means that internal and active states will look as if",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1538.655,
    "end": 1546.778,
    "text": " they're trying to minimize the same quantity, namely the surprise of states that constitute the thing, a particle, or some creature.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1547.559,
    "end": 1549.58,
    "text": "So here we have the as-if statement.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1550.32,
    "end": 1555.702,
    "text": "They appear to perform this kind of minimization of variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1557.383,
    "end": 1558.844,
    "text": "Similarly, in a 2019 paper with himself,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1564.045,
    "end": 1573.908,
    "text": " Any system that avoids surprising exchanges with the world will look as if it's predicting, tracking, and minimizing a quantity called variation or free energy on average and over time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1574.508,
    "end": 1585.591,
    "text": "Now, I've included this because we're going to speak to this one, this particular paper, as a second option for how to think of the as-if formulation and how perhaps to square as-if formulations with a kind of scientific realism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1587.099,
    "end": 1602.166,
    "text": " Van Ness 2020, the system does not actually predict, infer, track, or minimize a quantity called variation of free energy, but it merely looks as if the probabilistic model merely tracks certain real statistical relations in the organism environment system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1603.786,
    "end": 1611.95,
    "text": "So this particular reading here, this first reading, the as if formulation of variation of free energy leads to scientific realism,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1612.563,
    "end": 1615.465,
    "text": " about active inference models under the FEP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1616.086,
    "end": 1623.671,
    "text": "And it does so precisely because we have to sort of treat systems only as if, but not actually minimizing this particular quantity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1623.951,
    "end": 1624.592,
    "text": "Yeah?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1625.693,
    "end": 1626.934,
    "text": "Just jump in on this a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.494,
    "end": 1632.358,
    "text": "So the Ramstad quotes there are saying that what it looks as if the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.399,
    "end": 1661.07,
    "text": " system is minimizing is surprisal whereas van s shifts to talking about variational free energy good point so um yeah i think we could accept that it looks as if the system is minimizing surprisal because variational free energy is this bound on surprisal yes so the ramstead quotes are actually consistent with realism yes that they could be read as allowing that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.872,
    "end": 1665.815,
    "text": " the system really does minimize variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.835,
    "end": 1670.719,
    "text": "And it looks as if, in doing so, it's minimizing surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.7,
    "end": 1674.222,
    "text": "So perhaps we can come back to that in the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.122,
    "end": 1681.748,
    "text": "I don't think that Ramstad and colleagues are necessarily best read as endorsing instrumentalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.109,
    "end": 1687.152,
    "text": "I think is quite consistent with realism, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.792,
    "end": 1688.613,
    "text": "Yeah, no, I agree.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1688.653,
    "end": 1690.194,
    "text": "And I think we'll see that come out.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1692.062,
    "end": 1698.513,
    "text": " reasonably explicit when we turn to the second option to just step in if I don't actually manage to pull that out explicitly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1699.515,
    "end": 1700.216,
    "text": "Very good, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1701.075,
    "end": 1710.919,
    "text": " So basically, what we can now assume is that variational free energy on this first reading is a mathematical fiction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1711.419,
    "end": 1712.659,
    "text": "At least that's what we're told.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1713.019,
    "end": 1717.841,
    "text": "These sorts of constructs are useful fictions, but they do not actually exist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1718.721,
    "end": 1720.402,
    "text": "So how to think about that then?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1721.182,
    "end": 1723.463,
    "text": "Because we tend to agree with that particular point.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1726.587,
    "end": 1739.191,
    "text": " You can think that variational free energy, a bit like a Galilean frictionless plane, for example, is a concrete entity, as in it has some mathematical concreteness about it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1740.211,
    "end": 1743.952,
    "text": "But it's not one that actually exists in target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1744.012,
    "end": 1745.653,
    "text": "Here, the mass is not the territory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1746.773,
    "end": 1755.396,
    "text": "So even though we can kind of think of frictionless planes as being concrete in one sort of sense of its mathematical concreteness,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1756.175,
    "end": 1760.736,
    "text": " one wouldn't want to infer that Julian is a friction plane, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1761.496,
    "end": 1765.597,
    "text": "That would be false, and it would ultimately end up in a bad set of influences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1767.838,
    "end": 1777.26,
    "text": "Now, here again, we draw on the work of Godfrey Smith in order to think more generally about the use of fictional entities in the context of science more generally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1777.6,
    "end": 1783.242,
    "text": "But here's what he says, generally speaking, he doesn't address anything to do with the FEP, just to make that clear.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1784.249,
    "end": 1789.195,
    "text": " Now, fictions do not exist, he says, but at least many of them might have existed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1789.835,
    "end": 1797.664,
    "text": "And if they had, they would have been concrete, physical things located in space and time and engaging in causal relations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1798.806,
    "end": 1805.173,
    "text": "So it's kind of counterfactual test you can run on fictional entities and science from the point of view given here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1806.946,
    "end": 1819.009,
    "text": " Now, you can say fictional entities such as variational free energy that might lack actual existence in target systems can be useful for understanding target systems nevertheless.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1820.889,
    "end": 1833.172,
    "text": "So, you might say that active influence models provide insight into the workings of biological systems, for instance, with helping to understand what a system has to do in order to maintain homeostasis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1834.551,
    "end": 1855.828,
    "text": " You can also say something like the following, namely that under a kind of Bayesian interpretation of how one minimizes this particular quantity, you can draw some similarities to how that, to how, um, surprise is minimized in actual target systems by understanding something about the minimization of variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1856.229,
    "end": 1863.955,
    "text": "But there's a kind of similarity relation one can draw between the positing of fictional entities in the theoretical models,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1864.468,
    "end": 1867.39,
    "text": " and then what actual target systems are doing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1870.532,
    "end": 1880.22,
    "text": "Now, just to give you a sense of this, so motivated by active inference models on the DFEP, Pa and colleagues say the following about the significance of their work on active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1880.26,
    "end": 1885.283,
    "text": "I'll just give you the quote, and you can kind of see this coming into being.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1885.804,
    "end": 1886.324,
    "text": "So in brief,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1890.011,
    "end": 1903.471,
    "text": " We use Magnoencephalography in combination with eye tracking to assess the neural correlates of a form of short-term memory doing a dot cancellation task using dynamic modeling to quantify changes in effective connectivity",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1904.899,
    "end": 1912.262,
    "text": " we found evidence that the coupling between the dorsal and ventral attention networks changed during the saccadic interrogation of a simple visual scene.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1912.282,
    "end": 1927.329,
    "text": "Now they say here, and I've highlighted this intuitively, this is consistent with the idea that these neuronal connections may encode beliefs about what I would see if I were to look there, and that this mapping is optimized as new data are obtained with each fixation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1928.21,
    "end": 1933.612,
    "text": "So the idea here is that fictional entities, such as variational free energy,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1934.204,
    "end": 1954.481,
    "text": " allows for a further understanding of target systems by making precise how target systems may minimize free energy, whether or not that be variational free energy or expected free energy, in the sense of minimizing their surprisal and not directly in the sense of minimizing these two notations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1957.504,
    "end": 1962.508,
    "text": "So the summary here that we give in the article is that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1963.547,
    "end": 1969.834,
    "text": " The FEP comprises what is known as indirect representation of a target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1969.894,
    "end": 1975.841,
    "text": "So it says something indirectly about the operations of target systems, even if it involves the use of abstract entities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1977.094,
    "end": 1981.398,
    "text": " It's an idealized approach representing complex or unknown processes in the world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1982.099,
    "end": 1987.243,
    "text": "It's standard practice to view scientific models as indirect representations of the real world target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1987.804,
    "end": 1992.007,
    "text": "Now, furthermore, most theoretical models are composed of a set of mixed claims.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1992.528,
    "end": 2000.034,
    "text": "Now, this is rather important for us to sort of preserve a notion of scientific realism about the FTP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2000.995,
    "end": 2003.637,
    "text": "Basically, and we use the work of Spielert here,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2004.634,
    "end": 2016.118,
    "text": " This means that the model will posit, if true, the presence of what he calls both OK entities, such as electrons and their ilk, and supposedly non-OK entities, such as numbers or theoretical ideals.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2016.779,
    "end": 2023.041,
    "text": "Now, we think the FEP is something like such a model, so a model composed of mixed claims.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2023.921,
    "end": 2033.805,
    "text": "It put forward all kinds of OK entities, neurons, reflex arcs, etc., and perhaps what you might think of as non-OK entities, such as the variational free energy notation,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2034.482,
    "end": 2040.226,
    "text": " where non-OK entities has to be understood in terms of not being literally true of their target systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2042.728,
    "end": 2050.253,
    "text": "So this gets us to the second formulation that Julian alluded to earlier of the as-if formulation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2051.473,
    "end": 2056.637,
    "text": "Now, take us an example here from Dennett's 1996 book, Kinds of Minds.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2056.677,
    "end": 2060.359,
    "text": "And I think thanks to an anonymous reviewer here for pointing us to this idea.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2062.076,
    "end": 2064.257,
    "text": " than its so-called Popperian creatures.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2065.097,
    "end": 2076.843,
    "text": "These creatures are said to be able to select from possible action policies, although it's not put exactly in those terms, in order to prune away inferior options to avoid fatal consequences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2077.323,
    "end": 2082.726,
    "text": "So in this sense, these creatures have some kind of inner environment where they can select amongst possible actions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2084.52,
    "end": 2092.283,
    "text": " Now, here's the Tales of Two Densities paper that I co-authored with Max Ramstad and Carl Friston.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2093.424,
    "end": 2113.673,
    "text": "I'm not going to read you the quote here, but the basic idea is going to be something like this, that one can prune away unwanted action policies by testing what kind of expected sensory observations one might encounter were one to elicit certain kinds of actions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2114.855,
    "end": 2142.03,
    "text": " But whether or not one prunes away action policies, the crucial part here is that that kind of belief transitioning over possible sensory outcomes given certain kinds of actions can itself be characterized in a fictional way, in a form of fictionalism, as Julian mentioned earlier, that is entirely consistent, as far as we can tell, with scientific realism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2144.38,
    "end": 2152.684,
    "text": " So for the Popperian active inference feature, one can think of trajectories pursued over possible action policies in terms of fictions, as I just mentioned.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2153.584,
    "end": 2160.888,
    "text": "And now we come back to our formulations of fictional entities and science from a couple of slides ago.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2162.028,
    "end": 2166.53,
    "text": "Now, you might say that action policies are concrete belief states, but they're not actual.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2166.79,
    "end": 2167.951,
    "text": "They do not actually exist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2168.091,
    "end": 2171.733,
    "text": "They do not actually exist given their counterfactual or hypothetical characteristics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2173.462,
    "end": 2176.545,
    "text": " Yet were they to exist, they would be actual with some causal powers.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2176.565,
    "end": 2179.088,
    "text": "There would be implications for inferring one over the other.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2181.11,
    "end": 2184.174,
    "text": "Arguably, some of the hypothesis come to fruition and therefore exist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2186.597,
    "end": 2194.483,
    "text": " So what we have here is an as-if formulation of FEP explanations that has a fictional characteristic to it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2194.883,
    "end": 2210.795,
    "text": "So part of the entities that compose our FEP explanations are fictional entities, but they're entirely consistent with scientific realism about FEP explanations, given the considerations about the status of fictional entities in science in general.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2212.478,
    "end": 2216.601,
    "text": " Okay, so let's see, we've been going for about 35 minutes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2216.621,
    "end": 2218.723,
    "text": "I'll start wrapping this up so we can get to the Q&A.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2218.863,
    "end": 2225.208,
    "text": "Second case, one slide really quickly about ergodicity, just to get us thinking about this, at least, and we can come back to it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2226.049,
    "end": 2229.732,
    "text": "Now, Friston defines ergodicity in the following way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2230.332,
    "end": 2239.76,
    "text": "One can interpret the average amount of time a state is occupied as the probability of a system being in that state when it's observed at random.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2240.601,
    "end": 2240.801,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2242.113,
    "end": 2251.715,
    "text": " Now, Colombo and Palacios in this 2021 paper in Biology and Philosophy, they say that phase spaces of biological systems are structurally unstable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2251.915,
    "end": 2256.796,
    "text": "They're always changing and unpredictable, making them non-ergotic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2257.196,
    "end": 2266.378,
    "text": "There isn't a set of fixed states, if you like, that the system keeps returning to if such a system is a biological system on this particular account by Colombo and Palacios.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2268.24,
    "end": 2274.323,
    "text": " Now, they say that the FEP trades off realism for generality and mathematical precision.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2276.044,
    "end": 2285.668,
    "text": "And they do so in the sense to sort of put pressure on this idea that the FEP can be thought of in terms that are consistent with scientific realism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2286.509,
    "end": 2293.352,
    "text": "Now, it's true if you take the approach to the FEP as a generalized strategy to modeling,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2294.159,
    "end": 2300.903,
    "text": " that the FEP trades off realism for generality and in the same time maximizing mathematical precision.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2301.783,
    "end": 2303.204,
    "text": "But I think here's the twist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2304.205,
    "end": 2307.367,
    "text": "So this would be the first way of responding to this particular claim.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2308.527,
    "end": 2316.292,
    "text": "If you turn the FEP, the mathematical structure, into a target directed system, what we get here, we get to work with specific systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2316.592,
    "end": 2319.794,
    "text": "So now you get to increase the level of realism in your",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2320.689,
    "end": 2323.912,
    "text": " in the relationship, if you like, between your model and your target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2325.233,
    "end": 2337.142,
    "text": "A second way of thinking about ergodicity is that, yeah, okay, it's true that they don't map up, they don't have biological plausibility, but you can think of ergodicity as a convenient modeling assumption.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2338.843,
    "end": 2343.026,
    "text": "So the FAP doesn't claim that biological systems are literally ergodic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2343.226,
    "end": 2346.709,
    "text": "There's even a loosening in the literature now to saying locally ergodic,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2347.168,
    "end": 2363.191,
    "text": " Or there's even a further loosening to shifting talk of ergodicity entirely to talk about kind of nest densities and so on, where you can actually still retain this kind of meta-stability, this level of change and this degree of unpredictability.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2365.68,
    "end": 2375.125,
    "text": " So to conclude, arguments for instrumentalism about the FEP, or at least the ones that we are considering, I'm sure there's one or two we have not considered, trade on the literalist fallacy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2375.205,
    "end": 2383.289,
    "text": "They accept or affirm instrumentalism on the grounds that the properties of active inference models under the FEP do not literally map onto biological systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2385.511,
    "end": 2392.034,
    "text": "If we are correct, then there is a version of scientific realism that is a live and tenable option with respect to the FEP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2393.255,
    "end": 2393.475,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2396.92,
    "end": 2397.28,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2398.141,
    "end": 2398.541,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2400.542,
    "end": 2400.842,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2401.922,
    "end": 2402.542,
    "text": "Great times.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2404.043,
    "end": 2407.504,
    "text": "Perhaps for the first word, we'll go to Julian.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2409.155,
    "end": 2414.939,
    "text": " Feel free to maybe say hi, give your first take, and then we'll go to the Acton Flab participants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2415.58,
    "end": 2416.881,
    "text": "Yeah, so thanks for having us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.961,
    "end": 2418.922,
    "text": "It's going to be fun to talk about this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.063,
    "end": 2425.767,
    "text": "I think we should just jump straight into discussion rather than me add anything onto what Michael already said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.428,
    "end": 2428.329,
    "text": "He gave an excellent summary of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.25,
    "end": 2431.632,
    "text": "So let's see what you guys make of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.628,
    "end": 2436.71,
    "text": " Okay, so age or beauty?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2437.491,
    "end": 2438.172,
    "text": "Where do we begin?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2440.874,
    "end": 2442.156,
    "text": "Dave or Dean or Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2442.776,
    "end": 2444.498,
    "text": "Who would like to go first?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2444.598,
    "end": 2446.801,
    "text": "Stephen first and then either Dave or Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2448.282,
    "end": 2453.307,
    "text": "Well, I'd just like to say thanks for the book that you published a few years ago about the third wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.407,
    "end": 2454.889,
    "text": "It was actually the key book that kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.635,
    "end": 2484.618,
    "text": " made me keep going with active inference after i first heard about it because uh so it was a really really cool it's nice to hear boundaries because i've been looking at inactive embodied approaches and uh so just that's the first piece um and um so in there you talk about the idea of mark of blankets you're not directly but the idea of things being dynamic and changing and um i'm curious whether when you're thinking about instrumentalism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.441,
    "end": 2511.901,
    "text": " there's a there's a in some ways the the danger of instrumentalism or is it starts to everything gets referred back to maths and then the maths isn't tethered to reality because it's instrumental and you can't it can be a kind of a challenge then as we try where we're trying to bring in the four e's um to think about well how how does this start to map onto",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.004,
    "end": 2520.95,
    "text": " the way that organisms are trying to get a grip on the world in a bit more of a literal sense outside of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.331,
    "end": 2540.465,
    "text": "So, yeah, I'd be interested in your thoughts about this question of the ability for the modelling to be used in sort of almost a way to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.311,
    "end": 2555.102,
    "text": " get into phenomenon that might be happening during this minimization process michael do you want to start i i i can start um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.687,
    "end": 2561.793,
    "text": " Well, I think one thing that's important there, just stepping back, and thanks for the nice words on the book.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2561.813,
    "end": 2563.535,
    "text": "That's always a pleasure to hear.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2565.517,
    "end": 2576.009,
    "text": "The instrumentalist, I suppose, is just sort of, as I said, making a truth claim is off the table for an instrumentalist, partly because...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2577.31,
    "end": 2594.971,
    "text": " the definition of instrumentalism is the sort of not to put forward any kinds of statements about the world that can be true or false now they can say that you have observations you know you take in observations about how systems work and that's fine",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2596.04,
    "end": 2612.734,
    "text": " One line there that's been pushed a bit in the literature now is to say, well, you can be agnostic about whether those kinds of observations can sort of truthfully reflect or oppositely, falsely reflect anything about the actual world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2613.695,
    "end": 2624.484,
    "text": "Now, my sense is that, and this is just my sense, that scientists, given different tasks and activities, questions and focus points, will shift a bit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2625.765,
    "end": 2626.385,
    "text": " between these.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2627.126,
    "end": 2632.508,
    "text": "And that's, in a sense, why I had this notion, or why we have this notion of a targetless model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2633.208,
    "end": 2642.412,
    "text": "I think precisely because that's the domain we don't need to come down on one or the other side, query the model for gaining more understanding.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2643.013,
    "end": 2653.918,
    "text": "A nice example, I was talking to an ecologist on the weekend, is just thinking about these massive climate change models with this hyper-practical goal",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2654.997,
    "end": 2661.382,
    "text": " But yet they're so wonderfully complex that one spends one's career figuring out how the model works.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2662.603,
    "end": 2664.965,
    "text": "And that's OK, in a sense.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2665.205,
    "end": 2669.328,
    "text": "But I'm shifting it and trying to answer your question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2670.709,
    "end": 2682.018,
    "text": "I think some of the work that Julie and I have been doing on the sort of ever or on occasion to soften that shifting boundaries delineated by appeal to Markov blankets",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2682.813,
    "end": 2686.476,
    "text": " tells us something concretely about such systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2687.077,
    "end": 2697.987,
    "text": "So we can start thinking a bit about the differences between, say, the spider and the spider web relative to whether or not the Australian orb weaver has just eaten its web or whether it's producing its web.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2698.427,
    "end": 2707.255,
    "text": "So in that sense, you might think that its sensory epithelia is shrinking and expanding depending on what time of day it is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2709.895,
    "end": 2737.955,
    "text": " So, yeah, and to add to that, I'd like to think that it's the ambition of even theoretical neurobiologists, or if, you know, depending on the domain or issue they're targeting, is to, if you're working in the context of psychiatry on the basis of FEP models, you want to understand something about, well, actual psychiatric disorders that we as human beings may experience",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2738.57,
    "end": 2760.798,
    "text": " may go through and and you want to understand the the mechanisms of how that of how that works so you can intervene in the right kind of way like you want to do that presumably you have to say something about how those mechanisms work and so you can you can quite literally as i said manipulate if that's possible in one in one way or another anyway so that's my sort of initial take on that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2761.564,
    "end": 2772.488,
    "text": " I want to go in a slightly different direction on how does the free energy principle relate to these ideas about embodied, inactive, extended cognition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.668,
    "end": 2788.994,
    "text": "Well, Thomas Van Es and Ines Hippolyto both argue for an instrumentalist reading of the free energy principle in order to show how it could be consistent with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.693,
    "end": 2792.735,
    "text": " a non-representational understanding of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.356,
    "end": 2802.522,
    "text": "So they're keen on avoiding the idea that the brain literally represents the world by encoding a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.883,
    "end": 2816.193,
    "text": "And the way that they avoid that interpretation of the free energy principle is by endorsing the claim that the free energy principle is just a useful fiction for modeling the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.775,
    "end": 2822.997,
    "text": " And we think there's a couple of different issues that are getting mixed up here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.878,
    "end": 2829.321,
    "text": "So one is representational readings of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.362,
    "end": 2844.708,
    "text": " And Carl Friston often says that the brain doesn't have a model, but is a model, that the organism as a whole is a model of its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.369,
    "end": 2856.613,
    "text": "And here he's picking up on ideas from cybernetics, like the good regulator theorem, the law of requisite varietyism from Ashby.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.699,
    "end": 2887.022,
    "text": " so that idea of the organism being a model of its environment um we think can be read in a realist way actually but but also as suggesting a non-representationalism so this came up a little bit when michael was talking about popperian creatures where they're able to because of the deep",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.284,
    "end": 2890.845,
    "text": " hierarchical nature of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.606,
    "end": 2895.247,
    "text": "They try out possibilities before they act on them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.708,
    "end": 2917.257,
    "text": "And that's sometimes taken to imply in the philosophical literature that the organism, if it's able to do that kind of counterfactual inference, it must have some kind of model of these possible states of affairs that it's carrying out inference over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.602,
    "end": 2924.805,
    "text": " And so that gets you back into a kind of representational reading of the free energy principle again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.206,
    "end": 2937.911,
    "text": "But we are offering an interpretation of the free energy principle where we take very seriously this idea that the organism is a model, but doesn't have a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.421,
    "end": 2967.749,
    "text": " and and therefore that opens up the space for a realist interpretation of the free energy principle um that is also non-representationalist or inactive um and that's the i think the space that thomas van s for instance thinks is not available to proponents of the free energy principle um but rather than go into why we think he's wrong let's let me just stop there because i've said quite a lot already",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.336,
    "end": 2971.938,
    "text": " Thank you for the responses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2972.959,
    "end": 2974.101,
    "text": "So, Dean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2977.465,
    "end": 2981.25,
    "text": "Well, I think I'll ask both gentlemen for your opinion on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2981.53,
    "end": 2986.797,
    "text": "I think if you set your argument up as a literal one,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.403,
    "end": 2996.789,
    "text": " you're going to find yourself into trouble because I think this thing kind of gets resolved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.809,
    "end": 3000.751,
    "text": "There's no debate if it's metaphorical because you have to have a minimum of two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3000.811,
    "end": 3004.013,
    "text": "I mean, with these Markov blankets, you've got internal and external.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3004.694,
    "end": 3009.777,
    "text": "You need minimum of two just so that you have discrimination, just so that you can tell",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3010.481,
    "end": 3031.407,
    "text": " variation in the world and that's what metaphors allow for so i'm just wondering why we're not arguing for both that it's the synthesis of the instrumentalist and that way to measure and filter what's in and what's out because we do measure that and and filter for that and also the relational piece",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.874,
    "end": 3034.296,
    "text": " I still don't like to bump into edges, so I agree with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3034.676,
    "end": 3039.139,
    "text": "As an organism, I am the model until I fall off the cliff, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.199,
    "end": 3057.21,
    "text": "So if we looked at this as a metaphor instead of literally, wouldn't that kind of at least smooth out some of the differences instead of versus, it's and, this equals that in a metaphorical sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3057.85,
    "end": 3058.711,
    "text": "What are your thoughts on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.13,
    "end": 3070.338,
    "text": " I don't think you can have both instrumentalism and realism, although Max Ramstad has said things along those lines that he wants to try to do the best of both worlds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.019,
    "end": 3076.683,
    "text": "But the difficulty is that these positions actually come into conflict, contradict each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.283,
    "end": 3084.269,
    "text": "Because one says that the free energy principle does not map onto anything in the world, so we can't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.029,
    "end": 3092.851,
    "text": " make any claims based on the free energy principle about how cognitive biological systems are organized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.052,
    "end": 3096.673,
    "text": "It's literally just a modeling tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.713,
    "end": 3103.975,
    "text": "So it can help us to predict make predictions about the behavior that we can observe of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.118,
    "end": 3118.064,
    "text": " biological cognitive systems, but the free energy principle doesn't correspond to, doesn't map onto anything in the behavior or the organization of biological and cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.124,
    "end": 3124.367,
    "text": "And that to me seems in conflict with the idea that the organism is a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.427,
    "end": 3132.531,
    "text": "If you say the organism is a generative model, then that seems to me to commit you to the idea that the free energy principle is describing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.945,
    "end": 3145.977,
    "text": " Something about how biological cognitive systems are organized and therefore it ought to be construed in realist terms, not in instrumentalist terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.317,
    "end": 3148.379,
    "text": "Now, you said something else about metaphor there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.02,
    "end": 3149.621,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.761,
    "end": 3152.263,
    "text": "Science introduces all kinds of metaphors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.024,
    "end": 3162.849,
    "text": " And I think that introduces a kind of distinct set of issues, really, from the instrumentalism versus realism debate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.429,
    "end": 3166.451,
    "text": "Because we can still ask, well, how do we interpret those metaphors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.251,
    "end": 3172.474,
    "text": "So no doubt it's true that science engages in metaphorical talk all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.294,
    "end": 3180.818,
    "text": "But it's once you get into the question of how to interpret the metaphors that then the realism instrumentalism issue comes back again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3182.205,
    "end": 3184.246,
    "text": " So can I just do one quick follow-up?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3184.606,
    "end": 3196.268,
    "text": "If I focus on the instrumentalism or the realism and not focus on the link with the two arrow ends, the metaphor, I absolutely appreciate what you're saying, Gillian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3196.989,
    "end": 3203.41,
    "text": "If I pick one camp or the other, then I'm not focused on the metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3203.45,
    "end": 3210.232,
    "text": "But what if I'm just exclusively looking at that link as opposed to the opposing camps?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.207,
    "end": 3213.268,
    "text": " I'm very comfortable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3213.928,
    "end": 3214.809,
    "text": "I'm a contradiction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.829,
    "end": 3216.65,
    "text": "I'm a human being, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3216.79,
    "end": 3219.891,
    "text": "So I'm not really sure why I have to pick a side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.152,
    "end": 3222.752,
    "text": "You haven't convinced me about that yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3222.912,
    "end": 3231.396,
    "text": "I mean, it depends a bit about how you flesh out the term metaphor here, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3232.176,
    "end": 3239.74,
    "text": "So if we went back to that little image I had from gear, you know, your model description, model system, and some target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3240.782,
    "end": 3244.204,
    "text": " They say, for instance, you posit metaphorical entities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3244.244,
    "end": 3246.425,
    "text": "Is that what you have in mind there, by metaphor?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3248.906,
    "end": 3259.472,
    "text": "I'm talking about the process of the way to be able to link two discrete or discriminatory ideas or objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.912,
    "end": 3265.315,
    "text": "Because I want to be able to hold up the relationship and the measure of that relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.395,
    "end": 3269.897,
    "text": "I don't want to say that I have to discard one in order to take up the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.988,
    "end": 3275.15,
    "text": " Maybe it's useful to bring in the Markov blanket here as a metaphor for the boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.331,
    "end": 3283.254,
    "text": "So the blanket seems like a good metaphor for capturing the boundary of a particle or an organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.475,
    "end": 3284.635,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3285.834,
    "end": 3294.317,
    "text": " And so then we can ask, well, what is the relation between that Markov blanket concept where the Markov blankets are nested?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.337,
    "end": 3301.339,
    "text": "So you can find them at multiple scales of organization, multiple temporal spatial scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.02,
    "end": 3310.362,
    "text": "What's the relationship between that nesting of Markov blankets and the self-organizing systems that we're using them to model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.257,
    "end": 3316.86,
    "text": " So I think that's where you get to when you try to unpack the metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.88,
    "end": 3320.383,
    "text": "Those nested Markov blankets is a metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.403,
    "end": 3323.246,
    "text": "And how do we then interpret that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.246,
    "end": 3333.534,
    "text": "And for Michael and I, the way to interpret that metaphor is to think of self-organizing systems as literally having this... Well, not literally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.555,
    "end": 3337.798,
    "text": "That's a taken use of words, isn't it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3338.219,
    "end": 3339.159,
    "text": "But as...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3341.301,
    "end": 3359.04,
    "text": " But to think that there is a nested organization within self-organizing systems that can be modeled and described indirectly using the mathematics of the free energy principle or using the formalism of Markov blankets or using the Bayes causal nets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.904,
    "end": 3370.799,
    "text": " So on that note, you use these particular constructs, I think, on the basis of what Julian just said, to actually guide your research.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3372.085,
    "end": 3377.228,
    "text": " in the sense of figuring out something about how your target systems are organized.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3377.809,
    "end": 3391.698,
    "text": "So the one way of casting this is in the jargon we've been using that you distort, you introduce a distortion that you think you needn't take literally, for instance, the mathematics underlying this particular Markov blanket formulism.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3392.738,
    "end": 3395.6,
    "text": "But you use that in order to guide and direct your search.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3396.281,
    "end": 3401.564,
    "text": "Now, that's important because that's the kind of key to our particular",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3402.518,
    "end": 3409.624,
    "text": " to the way of thinking for us about scientific realism, that we can have all these distortions and all these points of inexactness in our theoretical models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3410.344,
    "end": 3414.167,
    "text": "However, the ambition is to say something about the target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3414.468,
    "end": 3422.854,
    "text": "That's where the sort of conversation between the instrumentalists, or at least a version of that, a version of the scientific realist framework,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3424.396,
    "end": 3432.782,
    "text": " Now, I should say there's a set of good reasons for thinking that the two positions in philosophy of science are mutually exclusive.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3432.943,
    "end": 3435.585,
    "text": "They can't be true at the same time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3436.526,
    "end": 3441.81,
    "text": "And one is the positing of a set of metaphysical claims on behalf of the scientific realist.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3442.911,
    "end": 3445.593,
    "text": "It's typically the case that one is committed to the following.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3445.633,
    "end": 3447.935,
    "text": "There's some kind of mind-independent reality.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3449.656,
    "end": 3478.151,
    "text": " okay now that can't be the commitment of the instrumentals because you can't posit that because you have no you're not producing the truth about how the world is the second metaphysical commitment is that we can somehow get a grip on uh unobservable causes of our obsolescence but that's not an option for the instrumentalists they can say something about their observations if you're an empiricist for example you can't you can't start making",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3478.914,
    "end": 3504.675,
    "text": " influences from that to unobservable causes of those observations so metaphysically there's there's something at stake when you have a discussion that goes that considers these kinds of sort of broader considerations in philosophy of science but those are metaphysical commitments and i suppose we can argue for those here all day should like or maybe we should maybe we should not",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3506.403,
    "end": 3523.017,
    "text": " So to make it more concrete again, going back to the nested Markov blankets, and the reason that we describe self-organizing systems in those terms is because of how the faster processes are enslaved by slower processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.077,
    "end": 3534.346,
    "text": "So you see this circular causality that's described in complex systems theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.368,
    "end": 3554.081,
    "text": " So there's a dynamics that you can observe in living self-organizing systems that can be inexactly and approximately described using the formalism of Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.342,
    "end": 3562.327,
    "text": "And it's because of that similarity or resemblance between the formal apparatus that we're using when we employ",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.102,
    "end": 3573.428,
    "text": " base nets and the modeling formalism of Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.509,
    "end": 3591.579,
    "text": "It's because there's that kind of similarity or resemblance between the models that we're making as scientists and the dynamics of self-organizing systems that we think it makes sense to interpret that metaphor in realist terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.568,
    "end": 3593.348,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3594.089,
    "end": 3595.95,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3596.671,
    "end": 3609.479,
    "text": "Again, I wouldn't argue that if you do place yourself in one camp, you reject what maybe the other side is arguing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3609.859,
    "end": 3611.14,
    "text": "What I'm thinking of is the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.977,
    "end": 3624.262,
    "text": " the statistical probability as a distribution allows for perforations, meaning the metaphor, I wouldn't say it's a bridge, but it's kind of an escape hatch to boundary cross.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.222,
    "end": 3630.424,
    "text": "And I mean, quite literally, if I use a metaphor, I get out of the constraint of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.443,
    "end": 3645.239,
    "text": " of not having that other person share the idea unless we can arrive at some convergence around something that we both understand from the past in order to be able to project into that new set of congruencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3646.66,
    "end": 3648.522,
    "text": " I don't want to take up all of this conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3648.582,
    "end": 3650.765,
    "text": "I just wanted to see if there was a quick way to resolve the debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3650.785,
    "end": 3656.611,
    "text": "I think that the issue here is really something to do with what philosophers do, where we like to disagree and argue with each other, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3656.751,
    "end": 3656.951,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.792,
    "end": 3664.86,
    "text": "And that works for some people depending on their personality, and for other people it doesn't work so well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3664.9,
    "end": 3667.382,
    "text": "They prefer to try and find agreement or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.764,
    "end": 3670.786,
    "text": " to find a way of communicating with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.346,
    "end": 3676.752,
    "text": "For us, as philosophers, I think disagreeing and arguing is not to fail to communicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.812,
    "end": 3679.455,
    "text": "It's just what we do as philosophers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3682.079,
    "end": 3694.411,
    "text": " What that made me think about is very few people are in the position of putting their name and a year and a version on an idea and being like the avatar of the idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3694.712,
    "end": 3696.253,
    "text": "Like Godfrey Smith 2009, Longino 2013.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3696.333,
    "end": 3697.955,
    "text": "Here's what the idea is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3697.975,
    "end": 3698.055,
    "text": "And...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3702.319,
    "end": 3716.663,
    "text": " Dean or anyone who might be interested in applying these ideas might have less of a qualm with shifting their regime of attention even within a sentence from one usage to another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3717.444,
    "end": 3731.208,
    "text": "And it's in the fine art and science of philosophy where some of these minds become fleshed out and we can really see like how deep the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3732.308,
    "end": 3755.246,
    "text": " logic goes and that's like kind of like higher overtones in the symphony of thought and then you know dean's just fiddling away on the subway trying to trying to get whatever currency they get up there in canada um let me go to dave with a question um because you haven't gone yet and then uh steven afterwards okay um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3758.735,
    "end": 3777.14,
    "text": " Coming at this whole question, particularly the question of metaphor, my background is I'm coming at this from general semantics, through the cybernetic theory of learning teaching, through George Lakoff's grounded metaphor theory, and through Mark Solm's conscious ego.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3777.54,
    "end": 3785.962,
    "text": "So when you say metaphor, dot, dot, dot, I say, well, who's actually driving the analysis?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3786.102,
    "end": 3787.803,
    "text": "Who is it that has to be appealed to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3788.47,
    "end": 3794.273,
    "text": " And I would say, look, the interpretation is done by the metaphoric structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3795.854,
    "end": 3797.295,
    "text": "And why is that a good grounding?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3797.595,
    "end": 3815.866,
    "text": "Because the fundamental grounding of every living control system, the speed of updating, the question of how existentially imperative that you not violate your priors,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3816.798,
    "end": 3841.623,
    "text": " down through very delicate questions of of mathematical formalisms it's all grounded in the cline of avoidance or approach and the cline of pain versus pleasure so it's all grounded it's got a basis your entire structure of um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3843.467,
    "end": 3869.344,
    "text": " inference of induction your whole induction is already grounded so don't worry about what the metaphor means in terms of theories ask what do the theories mean in terms of metaphor don't be shy about telling me i've gone off the deep end every last person i respect has been accused of going off the deep end",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3870.896,
    "end": 3897.589,
    "text": " i might i might i might like might let julian take first steps here so i can sort of get myself into into my own headspace all right um so uh i like what you how you describe metaphors and uh and the place that they have within the free energy principle where they're grounded in these perception action emotion processes um so for fep that uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.526,
    "end": 3907.99,
    "text": " what everything is organized around is these imperatives to resist disintegration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3908.91,
    "end": 3916.574,
    "text": "And so it makes sense to me that the metaphors we use in communicating with each other and thinking are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.535,
    "end": 3923.72,
    "text": " in the end going to inherit there and be grounded in life processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.941,
    "end": 3936.249,
    "text": "That's something that we talk about in terms of the life-mind continuity thesis coming out of inactive ideas in philosophy, the philosophy of biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.53,
    "end": 3945.016,
    "text": "So there's an interesting connection there between the embodied cognition ideas that Lakoff and Johnson are using and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3945.919,
    "end": 3947.82,
    "text": " and the four E ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.401,
    "end": 3950.082,
    "text": "So I think that's what you were just describing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.762,
    "end": 3971.375,
    "text": "But that comes at this from a slightly different direction to what we're concerned with in our paper, where what we're looking at is, say, a MATLAB model that somebody might make in simulating active vision like Thomas Parr has done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.379,
    "end": 3980.643,
    "text": " Or Micah Allen when he's looking at how to model the interactions between heart rate and fear perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.663,
    "end": 3991.008,
    "text": "And he's constructing like a simulation, an in silico model using the mathematics of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3991.755,
    "end": 4006.427,
    "text": " to describe those kinds of interactions between interoceptive processes like monitoring of your heart rate and extraoceptive perceptions, say, of fearful images of faces making fearful expressions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4007.428,
    "end": 4010.911,
    "text": "So that's a kind of in silico model that's been made there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4012.292,
    "end": 4019.999,
    "text": "And what can we learn from those sorts of simulations about, say, interactions between heart rate and visual perception?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.312,
    "end": 4024.093,
    "text": " And that's where our sorts of questions come up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.794,
    "end": 4038.199,
    "text": "Because you can think, well, the in silico simulations that are being made, they're just instruments for making predictions about, say, heart rates, how heart rates can interact with perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4040.26,
    "end": 4048.044,
    "text": "And the simulation can be useful for predicting the kinds of data that we could measure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.312,
    "end": 4062.541,
    "text": " But the simulation itself isn't going to give us knowledge of how the interceptive system interacts with visual perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4064.442,
    "end": 4066.523,
    "text": "And we just say, no, that's wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.543,
    "end": 4070.426,
    "text": "The simulation can actually tell you something important, give you a kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.044,
    "end": 4094.017,
    "text": " knowledge maybe in the long term so we have to look over time and look at all of the refinements that are going to happen in active inference models before we can actually arrive at something that is a true accurate description but in the meantime the kinds of approximations idealizations that we're operating with when we make these kinds of in silico simulations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.677,
    "end": 4104.02,
    "text": " are still telling us something important about how the mind is organized, how living systems are organized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.12,
    "end": 4106.681,
    "text": "So that's the sort of claim that we're making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.101,
    "end": 4111.142,
    "text": "Can you see that that's sort of a little bit of a tangent from what you were asking about metaphor?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.423,
    "end": 4115.684,
    "text": "Maybe it isn't, and you can explain how you see them coming together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.525,
    "end": 4121.508,
    "text": " I have probably stated my point in an overly polemical way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.608,
    "end": 4122.929,
    "text": "I was very excited.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4122.949,
    "end": 4126.751,
    "text": "I was really, I am very excited about what you're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4128.192,
    "end": 4138.778,
    "text": "Kind of like when Muhammad, the opponent finally lands a really solid blow on Muhammad Ali and Ali says, okay, enough playing around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4138.838,
    "end": 4140.159,
    "text": "Let's hit back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4141.233,
    "end": 4142.634,
    "text": " No, I'm very sympathetic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4142.714,
    "end": 4145.816,
    "text": "I invited Professor Solms to this discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4146.396,
    "end": 4149.458,
    "text": "I certainly hope he's going to watch the film.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4149.958,
    "end": 4151.82,
    "text": "No, I'm very much on your side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4151.84,
    "end": 4159.264,
    "text": "I'm just saying, I think the embodied perspective,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4162.737,
    "end": 4178.808,
    "text": " the pre-Galilean perspective, where valence, where value, where teleology are viewed as a foundation, or at very minimum, a co-equal foundation of the entire intellectual structure, the entire research structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4178.828,
    "end": 4180.529,
    "text": "I think that is exactly correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4181.29,
    "end": 4189.195,
    "text": "And I'm really pleased, for instance, a subtle British nuance, perhaps, that Professor Christian uses the term",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4192.458,
    "end": 4196.959,
    "text": " teleology so often in such an important sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4197.159,
    "end": 4201.12,
    "text": "I think that already by itself involves hitting back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4201.38,
    "end": 4203.96,
    "text": "But he always says he's deflating teleology, doesn't he?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.5,
    "end": 4206.081,
    "text": "He loves this word deflation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.281,
    "end": 4209.522,
    "text": "Deflation, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.582,
    "end": 4218.023,
    "text": "It's something that you can see in physics as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4218.063,
    "end": 4219.924,
    "text": "Michael found something very interesting in a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.578,
    "end": 4238.282,
    "text": " a YouTube video from Friston about where he was responding to some presentations that he'd heard where he describes how this variational free energy relates to Gibbs free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.863,
    "end": 4240.203,
    "text": "Michael, did you want to come in on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.731,
    "end": 4244.633,
    "text": " Yeah, I mean, this is definitely well beyond my pay grade.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4244.733,
    "end": 4246.914,
    "text": "Yeah, me too.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4246.934,
    "end": 4256.219,
    "text": "Probably some people in our group here and in our audience will be able to... The basic gist of it is something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.219,
    "end": 4264.025,
    "text": " that you can describe transitionings across belief states by appeal to variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4264.665,
    "end": 4265.286,
    "text": "And that's nice.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4265.566,
    "end": 4271.791,
    "text": "It gives you a nice sort of computational modeling language to speak about state transitions across different beliefs.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4273.093,
    "end": 4274.834,
    "text": "So the claim is here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4276.155,
    "end": 4304.974,
    "text": " And the claim is interesting because it allows for an even tighter grip between your fictional constructs and actual systems that you can give a formulation of those state transitions by mathematically showing an equivalence relation across the variation of free energy and the Gibbs free energy, which then by definition allows you to show in energy spent per joule or something like that what it actually costs",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4305.754,
    "end": 4310.219,
    "text": " to change one's beliefs, for example, in the context of the FEP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4310.499,
    "end": 4318.548,
    "text": "Now, that's great if that's the case, because that brings you even closer from your model space to your target system space.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4319.249,
    "end": 4327.417,
    "text": "But that's a bit like when somebody asks me in Okinawa, well, how does the octopus mechanistically select its action policies?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4328.377,
    "end": 4353.644,
    "text": " well i'm not a marine biologist and i'm not a specialist in octopi i mean that that that's not for me as a philosopher to tell you and i have i'm gonna i'm gonna cheat out and provide the same sort of reason for not going any further than that but it's a good example i think um yeah the reason i brought it up was because you were talking about teleology and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4354.505,
    "end": 4362.888,
    "text": " And what Friston does in deflating that notion is actually bring it back to something in physics as well, like Gibbs free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4362.948,
    "end": 4382.695,
    "text": "And the free energy principle shows you how you can take something that looks like it's going back to Aristotle, but actually show how to bring it into contact with the mathematics that we now have for understanding self-organizing dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4384.042,
    "end": 4386.002,
    "text": " I mean, I think it's just an important note there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4386.022,
    "end": 4395.804,
    "text": "So even if the term teleology is being used in the literature, one ought not to confuse it with the sort of notion of a final cause as per the Aristotelian system, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4395.844,
    "end": 4402.826,
    "text": "So we have sort of a final cause and ultimate end point that one necessarily strives towards, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4402.846,
    "end": 4407.947,
    "text": "But rather that self-organization is somehow inherently purposeful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4408.507,
    "end": 4413.048,
    "text": "And to me, that strikes me as right, but it also strikes me as a deflated notion of teleology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4416.115,
    "end": 4421.86,
    "text": " Yeah, but there's lots more we could say on this, but probably it's for another session, isn't it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4422.32,
    "end": 4425.483,
    "text": "It's a little bit of a tangent from what we're currently talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4426.043,
    "end": 4426.223,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.044,
    "end": 4427.885,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4428.145,
    "end": 4432.468,
    "text": "Stephen, and then I'll have a question, and then we can sort of land.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4433.889,
    "end": 4444.598,
    "text": "Yeah, I think this question about what we can model with the FPP or what FPP is able to be used to do modeling on using variational free energy is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.636,
    "end": 4449.518,
    "text": " and what the model is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.318,
    "end": 4455.5,
    "text": "And I think you've kind of resolved this to some extent by distinguishing modeling from models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.181,
    "end": 4462.924,
    "text": "So there's instrumental models, there's realist models, and there's this process of modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.904,
    "end": 4469.827,
    "text": "And one of the things about non, and I think in some ways, you don't have to say non-linear, I mean, non-linear dynamical systems might be best .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.668,
    "end": 4474.609,
    "text": "But the thing with those systems is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.729,
    "end": 4480.771,
    "text": " And is that they are, in this case anyway, generative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.391,
    "end": 4488.513,
    "text": "And we've been looking at, and I was actually talking to Daniels in our tools session about how these Bayesian graphs could be thought of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.573,
    "end": 4493.715,
    "text": "And one of the things is that generally you have a model and you try and fit things to your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.235,
    "end": 4497.736,
    "text": "Like in psychology, you fit someone to the model of psychology, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.097,
    "end": 4502.118,
    "text": "And that can be the problem because now this person's being fit to all these models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.12,
    "end": 4509.002,
    "text": " Well, in this case, these models generally, not always, generate the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.802,
    "end": 4512.623,
    "text": "But they generate a little bit different each time because it's stochastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.003,
    "end": 4515.144,
    "text": "So you see the way they evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4515.444,
    "end": 4518.265,
    "text": "And that's what we're sort of getting at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.285,
    "end": 4523.506,
    "text": "So building the model can be a useful design thinking tool to think about how it would be structured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.966,
    "end": 4525.667,
    "text": "And then you get this idea of modeling,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.869,
    "end": 4530.531,
    "text": " And this is actually maybe tying this with what Dave was saying a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.412,
    "end": 4539.737,
    "text": "My belief is that at the moment, all the ways that we are able to model are very low dimensional, like extremely low dimensional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.198,
    "end": 4553.785,
    "text": "However, I do believe I've been looking at stuff where phenomenologically it would be possible to use experience as the raw instrument.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.066,
    "end": 4563.728,
    "text": " So I think high dimensionality can be done through, there is a potential for high dimensionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.268,
    "end": 4576.37,
    "text": "So there's this question of like when we're modeling using models, which are low dimensional to such an extent, and they even like often are partially observable Markov decision processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.43,
    "end": 4580.511,
    "text": "So they're not even actually saying the data coming in has been a change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.741,
    "end": 4590.05,
    "text": " necessarily through, you know, you either have these psychological models, which are very low dimensional, and are partially observable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.07,
    "end": 4600.44,
    "text": "So it's gone up, and it's hit the point of beliefs, and then they start to look, or they have these incredibly particulate models, starting from like, the first atoms of life or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.46,
    "end": 4600.52,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.87,
    "end": 4622.487,
    "text": " I think that your intuition is probably right, actually, in terms of there are then, because we've been looking at some of this in terms of phenomenologically, that is there ways that experiential information can be modelled in or put into these models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.448,
    "end": 4628.592,
    "text": "And so it doesn't only have to be these very low dimensional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4629.285,
    "end": 4633.191,
    "text": " which may be so low dimensional that maybe that's part of the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.392,
    "end": 4638.74,
    "text": "It's not that the FEP is real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.18,
    "end": 4642.906,
    "text": "It's just what they're using to model it is still so low dimensional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.724,
    "end": 4646.225,
    "text": " Yeah, that's a nice question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4646.245,
    "end": 4649.889,
    "text": "Let me at least attempt a form of response.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4651.41,
    "end": 4654.893,
    "text": "So Julian and I, Ian, met the other day and we were just sort of chit-chatting here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4655.274,
    "end": 4670.508,
    "text": "And since you did mention Markov decision processes, I suppose one way of conceiving of this, if you like, low-dimensional versus high-dimensional or kind of simplicity versus complexity or kind of inaccuracy versus more accuracy distinction would be just to sort of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4671.82,
    "end": 4677.045,
    "text": " quite often one finds that those sorts of processes are modeled in discrete states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4678.606,
    "end": 4684.271,
    "text": "And my assumption is that that's a simplification because it makes work somehow more tractable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4686.227,
    "end": 4687.387,
    "text": " So it's manageable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4687.787,
    "end": 4701.791,
    "text": "You can write the code on the basis of discrete state transitions, for example, and still learn something, even if you sort of think that maybe state transitions are continuous, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4705.031,
    "end": 4710.756,
    "text": " Another thing that's more meta, I suppose, to that view is sort of the following.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4710.796,
    "end": 4714.86,
    "text": "So we're quite inspired by a philosopher by the name of Michael Weisberg.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4714.94,
    "end": 4717.862,
    "text": "So his name appears frequently now in the paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4718.803,
    "end": 4731.114,
    "text": "And he has this really nice paper from 2006, I believe it is, or 2007 in biology and philosophy, where he gives you two different approaches to a model-based science.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4732.418,
    "end": 4736.382,
    "text": " We follow one in part because we don't think it's very feasible to do the other.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4737.502,
    "end": 4739.885,
    "text": "One he refers to as a kind of brute force approach.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4740.425,
    "end": 4747.171,
    "text": "Now, I suppose this is going to give you all the high dimensionality that you can imagine that given computational power to pull it off.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4748.512,
    "end": 4758.301,
    "text": "On that approach, the goal is to have the values of all the variables we can identify in your target system reflected in your model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4759.901,
    "end": 4765.644,
    "text": " This is a super high degree, if you like, of correspondence between your model system and your target system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4766.665,
    "end": 4776.551,
    "text": "But the catch is that that particular ambition is extremely difficult, given the sheer complexity of real-world systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4778.672,
    "end": 4783.195,
    "text": "So the alternative is to say, well, then any other kind of model-based approach",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4784.58,
    "end": 4792.448,
    "text": " in the sciences, if you can't achieve that degree of completeness, if you like, is to use idealizations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4794.27,
    "end": 4796.852,
    "text": "So by necessity, almost, you have to simplify.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4797.253,
    "end": 4803.259,
    "text": "I suppose that would be one way of thinking about why we have low dimensional models and why one uses low dimensional models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4803.659,
    "end": 4805.741,
    "text": "Can you use experience to improve those models?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4808.021,
    "end": 4809.161,
    "text": " Yeah, I'm not sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4809.221,
    "end": 4811.042,
    "text": "Perhaps it seems like you ought to be able to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.302,
    "end": 4814.963,
    "text": "I would ask a slightly different question, but I see Stephen wants to come back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4815.483,
    "end": 4817.123,
    "text": "So I'll hold my comment for a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.463,
    "end": 4817.803,
    "text": "Yeah, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.724,
    "end": 4837.108,
    "text": "Well, I just wonder, I think, I suppose the dimensionality is so low that it's almost like even if you made it a thousand times more, it still would be, it's still useful because it shows the dynamics shifting, which is a little bit different to most models, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.952,
    "end": 4848.482,
    "text": " However, yeah, there's like, it's, I don't know how many zeros it has been magnified by in terms of multiplying the complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.002,
    "end": 4856.189,
    "text": "But that might be, anyway, so that, I think it's a good point you're making though, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.989,
    "end": 4857.15,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4857.71,
    "end": 4861.454,
    "text": "Well, let's take the Casper Hess deeply felt effect model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4861.494,
    "end": 4862.555,
    "text": "I don't know if you know that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.493,
    "end": 4881.397,
    "text": " So there's a variable in that model, a matrix, the G matrix, which is trying to capture the minimization of expected free energy and the role that that plays in selecting routine action policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.617,
    "end": 4889.199,
    "text": "And the idea is that that G matrix is something that is changing over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4891.716,
    "end": 4898.578,
    "text": " such that you can do better or worse than expected at minimizing expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4899.598,
    "end": 4906.859,
    "text": "So there's a variable there, which I guess is still going to yield models which are low dimensional in your sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.939,
    "end": 4917.562,
    "text": "But it's still being used to model something that is, I think, phenomenological in the end, namely valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4919.944,
    "end": 4949.008,
    "text": " And so the moral I would draw from that is that something that's an idealization and approximation, because it's low dimensional, doesn't necessarily mean that that modeling tool that you're using there that has this low dimensionality can't still be used to describe something high level and phenomenological, namely valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4950.996,
    "end": 4952.937,
    "text": " And that goes back to what Dave was saying before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4952.997,
    "end": 4979.706,
    "text": "I think that the valence is actually something that's built into free energy minimizing systems because variational free energy is a way of describing, a way of indirectly representing something that's fundamental to life, which is this tendency to avoid decay or disintegration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.716,
    "end": 4996.12,
    "text": " So the low dimensionality, I think, doesn't stand in the way of using this to model very high dimensional phenomenologically deep, thick concepts like valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4997.501,
    "end": 4999.501,
    "text": "Yeah, that's a really good example, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.601,
    "end": 5000.602,
    "text": "Just one point on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.002,
    "end": 5009.925,
    "text": "And also, we're talking about general, because I do agree with the idea of if we're saying what are generally tractable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5010.512,
    "end": 5038.927,
    "text": " dynamical processes which maybe is another type of realism in a way or it's realism but to think of that is it does show that affect becomes a plausible way which pretty well hasn't i don't know any other way to think about it previously it's why we start to get into consciousness as well with mark soames is yeah it gives this plausible way where what was relegated in our scientific world because basically consciousness was taken away by psychology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5039.705,
    "end": 5065.689,
    "text": " and feelings were kind of these this lower down ideas like well wait a sec this is actually the all-encompassing way to know what you think so that's actually because i actually do a lot of work with metaphors and one of the things that happens with metaphors is people what's the metaphor of knowing when you get something right like what's it like to know something so if you ask a mathematician what the answer is to a problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5066.428,
    "end": 5068.41,
    "text": " they don't get an answer on a computer screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.45,
    "end": 5071.352,
    "text": "They actually feel the answer being right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5072.173,
    "end": 5074.695,
    "text": "So they've kind of somehow, and then what's that like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.755,
    "end": 5077.578,
    "text": "And then you can process that as a spatial metaphor in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.43,
    "end": 5081.812,
    "text": " But like you said, it's affective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.072,
    "end": 5084.493,
    "text": "So yeah, I do agree with what you're saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.593,
    "end": 5095.058,
    "text": "And what I'm interested in as well is working backwards from an affective state and trying to plot out people's low dimensionality another way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5095.218,
    "end": 5096.479,
    "text": "But that's for another conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5096.599,
    "end": 5098.88,
    "text": "But I do agree with what you're saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.821,
    "end": 5106.444,
    "text": "I don't know whether you would say that the realism in the dynamics is different to realism in reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.611,
    "end": 5110.071,
    "text": " physical, physical ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.992,
    "end": 5119.613,
    "text": "So in the model that the G vector is is being used to set precision on action policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5119.693,
    "end": 5122.914,
    "text": "So which action policies can you be confident in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5123.454,
    "end": 5133.896,
    "text": "That's a kind of metacognitive process in that it's not just acting based on some gut feeling, you know, in the way that you described, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5134.716,
    "end": 5152.387,
    "text": " But using that feedback from the body to assign precision, so to look at how reliable a prediction error is in relation to your predictions when the quantity that you're minimizing is this expected free energy quantity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5153.828,
    "end": 5160.472,
    "text": "So there's something global going on there, I think, which gets you closer to what you're looking for when you're thinking about consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5162.699,
    "end": 5166.622,
    "text": " something in the global dynamics when you're thinking about the G vector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5169.443,
    "end": 5176.887,
    "text": " So I'll just read out one question from the chat and the answer could be as simple as read the paper or give a thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5177.747,
    "end": 5180.329,
    "text": "And then I'll ask a closing question for the authors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5180.549,
    "end": 5191.434,
    "text": "So the question is from Matthew McTeague and they wrote, how do we resolve the controversy of the conflation between heuristic and Markov blankets?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5192.235,
    "end": 5196.757,
    "text": "What metaphysical legwork should be done to defend an ontological Markov blanket?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5201.488,
    "end": 5205.609,
    "text": " Okay, so the question is something like, we don't really take that up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5205.709,
    "end": 5209.249,
    "text": "One sneaky move might be to say, go read the Greerback et al.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5209.289,
    "end": 5209.589,
    "text": "paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5209.629,
    "end": 5224.732,
    "text": "But moving from heuristics to ontology, I think Julian has already touched on that quite a bit when speaking on the sort of multi-scale characteristics of self-organizing systems.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5225.292,
    "end": 5230.233,
    "text": "So if you have as part of your model, and this is our preferred approach here,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5231.284,
    "end": 5258.851,
    "text": " uh the formalism like the markov blanket formalism then of course you're not going to be saying that heuristic this will be the literalist fallacy it's going to just be mappable onto the this multi-scale structure that comprises the system so now you have to interpret that's the next step in this modeling you have to interpret these sorts of notations under a certain description such that you can start thinking about what it is about biological",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5260.531,
    "end": 5266.014,
    "text": " organization that reflects in that indirect sense that we are working with these sorts of heuristics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5266.154,
    "end": 5267.894,
    "text": "So that's the work that one should do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5268.595,
    "end": 5275.097,
    "text": "But it's not the kind of thing that we discuss at length in one section of the paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5275.137,
    "end": 5283.461,
    "text": "We call the section, the paper moves across four different domains that has to be done with some swiftness and level of generality to bring the philosophical point home.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5284.4,
    "end": 5289.366,
    "text": " But I think that's a separate paper, actually, that little question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5289.386,
    "end": 5290.587,
    "text": "So thank you, Matthew, for that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5292.009,
    "end": 5292.369,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5293.07,
    "end": 5296.695,
    "text": "So just one closing question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5297.435,
    "end": 5300.519,
    "text": "As you are reviewing and revising the paper,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5301.664,
    "end": 5321.471,
    "text": " Who is your audience and how would it impact the next several months or years of active inference and free energy principle research and application if people were to really direct the regime of attention and understand what you're talking about and update their generative models accordingly?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5321.491,
    "end": 5325.133,
    "text": "William, do you want me or you should go first?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5325.153,
    "end": 5327.534,
    "text": "I'm happy to go first with initial thoughts.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5329.014,
    "end": 5330.635,
    "text": "I wanted to bring up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5331.636,
    "end": 5352.316,
    "text": " the recent paper by miguel aguilera and um and chris buckley and others where the the problems that they raised there are about how to take the free energy principle and uh and use it to to model uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5355.012,
    "end": 5384.467,
    "text": " real biological cognitive systems and they take very simple system and then show what kinds of assumptions you need to build into the free energy principle in order to to use it to model those systems and they argue that those assumptions are are unrealistic and they pick out a very small class of systems and those systems are unlikely to be biological cognitive systems so that looks like bad news for the free energy principle and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5385.202,
    "end": 5407.364,
    "text": " but not from the perspective of our paper, because what our paper shows is that all of those assumptions that they identify are actually exactly the kinds of idealizations and approximations that don't rule out taking the free energy principle to indirectly represent biological cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.585,
    "end": 5423.412,
    "text": " And so the contribution of our paper to the community, I think, is to just point out that even if we look at the assumptions that underlie the free energy principle and think, well, those don't literally apply to biological and cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5424.488,
    "end": 5437.293,
    "text": " that doesn't rule out the possibility of still making active inference models and using them to learn important things about biological cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5437.853,
    "end": 5448.937,
    "text": "It would only rule that out if you think that those systems literally have to instantiate the assumptions that are built into the FEP before you can apply the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5450.644,
    "end": 5454.527,
    "text": " But we've argued, no, those assumptions don't need to literally obtain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5455.789,
    "end": 5458.351,
    "text": "They can just be idealizations and approximations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5459.012,
    "end": 5474.347,
    "text": "So the contribution, I think, of our paper to the community is to say, well, look, there are these real challenges, but they don't stand in the way of using the free energy principle to carry on doing active inference models and learn something important from those models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5478.146,
    "end": 5481.489,
    "text": " Okay, if we can achieve that, that's certainly a job well done.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5481.509,
    "end": 5493.821,
    "text": "I think in terms of the audience, perhaps outside the technical, very specific niche of the free energy principle,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5494.904,
    "end": 5512.499,
    "text": " I mean, one would like to hope that a bit like when you had Stephen on a few weeks back talking about free energy, a user's guide, which we crafted as a sort of ambition in part was, of course, to introduce these sorts of conversations into the context of philosophy of biology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5513.717,
    "end": 5516.258,
    "text": " And then hopefully they will see the light of day.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5517.079,
    "end": 5535.768,
    "text": "I think similarly here, and I'm sure Julian will agree that, you know, I think these sorts of papers that take up like broad picture discussions in the philosophy of science with say an emphasis on the free energy principle will bring an audience from the philosophy of science into contact with the kind of, you know, area of speciality that we're working in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5536.348,
    "end": 5539.009,
    "text": "But I would like to see that as an aim as well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5539.269,
    "end": 5542.291,
    "text": "I think secondly as well, or secondly just that,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5543.7,
    "end": 5556.743,
    "text": " Just working through with some precision these kinds of conceptual details in this highly mathematical and sometimes really abstract domain that is the free energy principle is important.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5558.444,
    "end": 5566.846,
    "text": "Precisely, also I think for the scientists working on it, to have a feel for what is the conceptual assumptions of making some claim.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5568.086,
    "end": 5580.529,
    "text": " So you're also conceptually engineering this debate in a particular sense that can be fruitful, I think, for non-philosophers working on it, a bit like what Julian was touching on there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5582.802,
    "end": 5583.122,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5583.523,
    "end": 5592.27,
    "text": "Well, Michael and Julian, thanks so much for the paper, and also Ian for co-authoring on the paper, and best of luck with it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5592.97,
    "end": 5596.993,
    "text": "Dave, Dean, and Stephen, and also Matthew, thanks for participating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5597.554,
    "end": 5602.498,
    "text": "This is a really interesting discussion, and we hope to continue the conversation however you all would like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5603.979,
    "end": 5605.841,
    "text": "Thanks, guys.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5606.721,
    "end": 5607.182,
    "text": "Good night.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5607.582,
    "end": 5609.103,
    "text": "See you later, everybody.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5610.104,
    "end": 5610.284,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  }
]