[
  {
    "start": 6.595,
    "end": 6.956,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.921,
    "end": 10.605,
    "text": "Welcome back, cohort five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.168,
    "end": 17.1,
    "text": "We are in our second discussion on chapter nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.862,
    "end": 24.418,
    "text": "So, Andrew or anyone else who wants to write a question or raise their hand, let's just jump into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.22,
    "end": 61.948,
    "text": " okay i just heard the recording in progress thing maybe there's something about pete's coffee that causes a time dilation but either way now we're in chapter nine so where shall we begin yeah i was gonna say if anyone has any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.198,
    "end": 91.277,
    "text": " particular points they want to get into with this chapter happy to jump into those otherwise um if anyone's like you know only able to make this meeting weren't able to make the last one I'm happy to kind of give a general overview of what's going on here uh if you don't mind a general overview would be good to start with if others are okay means",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.603,
    "end": 119.037,
    "text": " yeah go for it previous meeting is at 11 o'clock in the at night in my time so i i haven't been uh able to make them so general overview would be really helpful for me if it's a possibility yeah great um yeah let's do that and there is a lot going on in this you know this chapter this is sort of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 119.422,
    "end": 133.511,
    "text": " aside from chapter six, which gives us a general recipe for composing generative models and kind of the more general method you might take here and actually applying active inference in the second half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.834,
    "end": 138.662,
    "text": "Recall in chapter seven, we're given the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.862,
    "end": 142.147,
    "text": " POMDP model and how to construct that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.808,
    "end": 144.75,
    "text": "Chapter eight, we're given more continuous models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.83,
    "end": 158.61,
    "text": "And then here we bring it back to, okay, so how do we actually use these models and construct them in a way that we can apply them to empirical experiments where we're actually collecting real data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.371,
    "end": 166.0,
    "text": "And so we're moving beyond the range of just purely building models and running simulations to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.283,
    "end": 172.131,
    "text": " Collecting empirical data such as like neurophysiological data could be EEG.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.151,
    "end": 181.004,
    "text": "It could be just observing behavior of anywhere from human beings to to rats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.084,
    "end": 192.32,
    "text": "Or if you're in more of a an engineering setting, you might be looking at other kinds of data that's being extracted and you just basically we want to figure out how is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.38,
    "end": 192.841,
    "text": "What are the?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.021,
    "end": 195.565,
    "text": "What's the process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.933,
    "end": 202.523,
    "text": " that is generating that data, which of course we may never know, but we can attempt to model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.603,
    "end": 218.768,
    "text": "So yeah, this chapter, it's quite dense, I'll be honest, whenever we incorporate everything, but it does give us a nice full flow of how to apply these methods to empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.748,
    "end": 224.776,
    "text": " So first of all, in the introduction, there's hints at what we'll find in the rest of the chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.836,
    "end": 237.533,
    "text": "We're introduced to meta-Bayesian analysis, which is where we actually view this as the agent's subjective model versus our own objective model that we're building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.513,
    "end": 266.018,
    "text": " of the agent subjective model that kind of uh carries into the active inference ontology right just we do have to account for the fact that we are sort of the quote-unquote objective scientists in this situation we're attempting to model the behavior um and other parameters of like a separate being from ourselves like in a team maze we're trying to you know understand the subjective model of a rat which we don't have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.951,
    "end": 296.41,
    "text": " know collecting data and applying analysis to see if we can do something like approximate it so here our goal is to what we would say is recover or infer the unknown parameters of they phrase it as the subject's brain its subjective model using our own objective just by drawing on the behavior in our observed data and then we uh invert",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.727,
    "end": 301.373,
    "text": " our objective model to infer those parameters of the subjective model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.854,
    "end": 305.699,
    "text": "And then finally, by doing so, we can test and compare hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.039,
    "end": 309.884,
    "text": "For example, we might find multiple models that we could build.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.766,
    "end": 318.316,
    "text": "We could compare them and see which one holds best to the behavioral outcomes that we're seeing in the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.356,
    "end": 323.983,
    "text": "And then they have another concept called computational phenotyping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.048,
    "end": 342.85,
    "text": " This is where we kind of, by recovering model parameters, prior beliefs of our agent, we could actually like kind of classify the individuals we're studying, whether it be multiple rats in a team maze, it could be clinical patients and more of a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.83,
    "end": 356.13,
    "text": " you know, in the study of psychiatry, but we can kind of phenotype those individuals based on what model we end up developing to try and explain their behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.448,
    "end": 378.27,
    "text": " And so yeah this chapter lends itself really well to specifically computational psychiatry and neuropsychology neurology but, in principle, these methods could be applied to a broader much broader variety of phenomena, whether it be also or or even non living systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.123,
    "end": 389.115,
    "text": " So section 9.2, and again, there's a lot going on in this chapter, so I'm going to try to be a little bit more brief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.415,
    "end": 407.498,
    "text": "But we are introduced to, just as we've seen Bayes' theorem in previous chapters, now we have equation 9.1, which looks almost exactly equivalent, other than we've replaced observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.731,
    "end": 420.39,
    "text": " and states with behavioral outcomes, U, which are actions to be taken, and then a theta symbol, which represents the parameters of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.77,
    "end": 432.608,
    "text": "And so just as we can update a model's beliefs related to states, observations, the relationship between them in the form of likelihoods and posteriors,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.588,
    "end": 439.128,
    "text": " ideally doing that same exact thing here, but now we're mapping outcomes to parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.61,
    "end": 442.378,
    "text": "I'm going to pause here real quick because you had a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.333,
    "end": 456.667,
    "text": " Yes, actually, I'm just wondering, so you mentioned this computational, yeah, exactly this one, you mentioned computational phenomenology and this subjective model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 456.687,
    "end": 471.403,
    "text": "Are you saying that, I don't know anything about it, so I'm just asking, are you saying that somebody can actually start plugging in values inside that matrix that you said, like, and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.383,
    "end": 481.198,
    "text": " There will be like what i'm saying is that the values which you encode into that, and some and some variable since you include related part of that computational phenomenology, or how does it go?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 481.238,
    "end": 483.362,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.982,
    "end": 490.793,
    "text": "So one thing we could do to try and answer that question is to look at, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.06,
    "end": 498.738,
    "text": " we have in section 9.5 just a nice like brief series of steps for how to go about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.78,
    "end": 503.128,
    "text": "And so like in step one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.053,
    "end": 506.136,
    "text": " Quite simple, we collect behavioral data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.217,
    "end": 516.511,
    "text": "You could even think of this as like a spreadsheet or something along those lines, like that kind of structure where each row can represent an individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.731,
    "end": 521.217,
    "text": "Like in a T-Maze example, we have rat number one, rat number two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.838,
    "end": 531.732,
    "text": "We could have in the columns things like what are the actions that they took that we saw when we collected the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.712,
    "end": 540.285,
    "text": " What are the associated observations or other components of a model that we saw?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.865,
    "end": 552.983,
    "text": "We could also have other kinds of information, like maybe the test was being done by administering a drug to certain rats and not to others to try and study the impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.604,
    "end": 556.268,
    "text": "We could have a binary one or zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.248,
    "end": 580.905,
    "text": " um like if for each rat if it was administered the drug or not step two we formulate a pomdp this this chapter is a little bit heavier on looking at discrete models so a pomdp as we were introduced to in chapter seven although later they do give us a couple examples of more continuous models and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.56,
    "end": 593.595,
    "text": " what we're trying to do with step two is that we're trying to develop basically, yeah, derive a model that closely approximates what we see in the data that we just collected in step one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.655,
    "end": 597.82,
    "text": "But nonetheless, we know that this is our model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.9,
    "end": 606.37,
    "text": "So this is kind of that outer objective model that we're seeing in the figure that Daniel's pulled up there, figure 9.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.35,
    "end": 620.884,
    "text": " So it's kind of that inner box is the subjective model we're trying to basically devise our own objective model of what's going on in the rat's mind, so to speak, if we follow a teammate's example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.326,
    "end": 632.796,
    "text": "So there could be aspects of this that, because your question had to do with specifying priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 633.147,
    "end": 636.972,
    "text": " Step three is specifying a likelihood function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.074,
    "end": 641.358,
    "text": "And that's based on the model that we just tried to make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.919,
    "end": 644.723,
    "text": "Then after that step four, we specify prior beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.624,
    "end": 654.457,
    "text": "And so in that step, the way they've written it, we can specify prior beliefs about the parameters in terms of expectations and precisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.218,
    "end": 659.644,
    "text": "Often these will be centered on zero with precisions reflecting plausible ranges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.08,
    "end": 669.678,
    "text": " So you might think of that as you have your own hypothesis about what the prior beliefs are, and you just kind of roll with it, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.6,
    "end": 675.81,
    "text": "We're doing a process where we're trying to build a model that whenever we run that model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.381,
    "end": 702.793,
    "text": " it and and run a simulation with it hopefully it more or less approximates the real actions uh that say a rat and a team maze uh took as well as like the combination between those and the observations that the rap received so um hopefully that provided some kind of information or a bit of an answer to your question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.178,
    "end": 729.523,
    "text": " um but yeah i'm just trying to get to yeah sorry great answer all out a little more so prakash you mentioned phenomenology like the kind of felt experience and this kind of made me think about like um three different kinds of phenotypes that you might be studying you might be studying the most grossly morphological like just the actual bodily movement like the movement of an arm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.503,
    "end": 756.456,
    "text": " then there's kind of cognitive phenotypes that are internal they're not directly observed but they're also not like philosophical or metaphysical or phenomenological like um the motivational drive sorry i mean i think i'll just type i'll just type today since it's a little strange with the internet",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 756.757,
    "end": 769.536,
    "text": " But suffice to say that the phenomenological phenotypes, like the felt experience, is probably the most difficult because now you're not just talking about where the arm is in location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.956,
    "end": 775.024,
    "text": "You're not just talking about the intent to move the arm or something like that, but you're talking about the experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.825,
    "end": 779.49,
    "text": "And that is the challenge that many researchers are focused on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.237,
    "end": 791.251,
    "text": " And hey, Daniel, I want to give you a heads up that your audio is a little choppy as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.572,
    "end": 793.538,
    "text": "But I'm just going to type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.558,
    "end": 793.979,
    "text": "I'll just type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.999,
    "end": 796.667,
    "text": "Yeah, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.687,
    "end": 797.69,
    "text": "Super helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.71,
    "end": 797.85,
    "text": "Thanks."
  },
  {
    "start": 821.438,
    "end": 824.43,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.45,
    "end": 832.461,
    "text": "And then yeah, I'll just follow through with with those steps like after you specify those prior beliefs in step four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.42,
    "end": 837.223,
    "text": " step five, we solve for a posterior probability and model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.924,
    "end": 849.695,
    "text": "So effectively what we're doing is we're just kind of continuing the process of like, how do we approximate our subjects understudies subjective model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.355,
    "end": 852.777,
    "text": "And so like, here are all the different components, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.978,
    "end": 861.165,
    "text": "All the ones that we've been familiar with as we've proceeded through the textbooks we have, we're figuring out likelihood functions, we're figuring out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.145,
    "end": 891.152,
    "text": " uh prior beliefs even if we're just setting them initially as like some value and and then need to kind of further carve out our model from there and maybe uh update those priors that to better reflect what's going on in the subjective model so um i think the word they repeatedly use this word recover like we're trying to recover the prior beliefs or recover the parameters of the model so there's no assumption that we know what these are from the onset",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.132,
    "end": 900.988,
    "text": " Kieran Stonewall- Instead we're we're attempting to build a model and then kind of fine tune things from there to where they better approximate what might be the actual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.989,
    "end": 910.503,
    "text": "Kieran Stonewall- priors and and the kind of likelihood and and model evidence and so on, that the agent is working with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.186,
    "end": 912.566,
    "text": "Anand Oswal, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 912.546,
    "end": 916.212,
    "text": ": i'll just put one comment so so you're saying that if.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 916.36,
    "end": 927.395,
    "text": " Suppose we found some empirical study and we get the exact value, not the exact value, but like a distribution, a Gaussian distribution of the prior, then that would be the best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 927.876,
    "end": 928.938,
    "text": "That would be very helpful, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 930.98,
    "end": 931.922,
    "text": "Yeah, presumably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.683,
    "end": 934.005,
    "text": "Yeah, if you find that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.045,
    "end": 944.359,
    "text": "So basically we are trying to iterate our model so that we can get to those kind of values which have a very accurate description of what the prior values exactly might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 944.997,
    "end": 948.361,
    "text": " yeah something on those lines right so some some reverse engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.182,
    "end": 966.162,
    "text": "yeah you're right that's very right like we can just think of it as like we've been introduced to be sort of in silico synthetic models like in, for example, a PO mdp we're already familiar at this point, thanks to chapter seven and other chapters like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.412,
    "end": 968.917,
    "text": " we'll hear all of the components of the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.318,
    "end": 974.227,
    "text": "We have our D vector, which is our priors over initial states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.59,
    "end": 978.495,
    "text": "We have our A matrix of likelihoods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.515,
    "end": 980.9,
    "text": "We have our B matrix of state transitions and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.481,
    "end": 987.593,
    "text": "But now, whenever we've collected empirical data, well, we only have what we as the, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.573,
    "end": 1008.163,
    "text": " so-called objective scientists can observe so we can observe uh you know an agent's like a rats or human beings actions that they've taken and we can observe like maybe what was going on in the generative process like okay the mat the the rat was in a maze where the reward was on the left",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.143,
    "end": 1019.159,
    "text": " So we have our knowns and givens and what we observe, but they don't all match all of these different components of the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.179,
    "end": 1022.584,
    "text": "So we're attempting to kind of recover what's missing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.925,
    "end": 1030.675,
    "text": "We ourselves are undergoing the active inference process of trying to infer and learn",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.655,
    "end": 1035.943,
    "text": " what are the other components that we cannot directly observe of the rat's behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.444,
    "end": 1042.293,
    "text": "Because in that way, of course, it starts to match anything else, some other machine learning routine or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.333,
    "end": 1048.202,
    "text": "Like we're just trying to find these unknown parameters in what we presume to be the rat's model, subjective model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.824,
    "end": 1049.985,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.045,
    "end": 1050.425,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1051.387,
    "end": 1052.208,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.228,
    "end": 1052.709,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.553,
    "end": 1058.097,
    "text": "And then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.903,
    "end": 1079.608,
    "text": " Aside from being either introduced or given some kind of more technical refresher on what methods we might use along the way to do this, like they dedicate an entire section to variational plus, which kind of gives more description on how we're using this modified basis theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.168,
    "end": 1087.577,
    "text": "Now, instead of with states and observations, we have actions and we have like model parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.895,
    "end": 1101.6,
    "text": " Aside from how it reintroduces how we might recover parameters via the Laplace approximation, we also get a much more description",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.424,
    "end": 1111.445,
    "text": " Utility of applying these methods in the first place, which is in step 6 of the, the overall process that's introduced here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.545,
    "end": 1118.02,
    "text": "And so it's more into, you know, there's a lot of overlap between this and other more traditional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.772,
    "end": 1126.441,
    "text": " analytic settings where you might be trying to do something like a covariance analysis or a correlation analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.901,
    "end": 1142.522,
    "text": "You might be trying to, as I mentioned earlier with a T maze example where maybe a drug was administered to certain rats and not to others, let's do some kind of group level analysis to see what are the patterns in the behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.502,
    "end": 1165.978,
    "text": " uh and outcomes for the rats who were administered the drug versus those who were not right so this is getting into much more again like kind of traditional settings where really you're just applying analysis um but now you have the the added utility that you divide you've devised an entire like in this case pomdp that can potentially",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1165.958,
    "end": 1189.435,
    "text": " like really strongly explain a rat's behavior and you have all these different components and parameters that you've recovered to allow for a quite broad variety of analyses beyond just running like a simple like t-test or yeah looking at correlation between certain behaviors and outcomes and that's all we have so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.081,
    "end": 1193.843,
    "text": " Yeah, that's the general process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.923,
    "end": 1205.036,
    "text": "I think that figure 9.2 does a rather good job of trying to visualize the six-step process, collect data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.837,
    "end": 1211.364,
    "text": "We build our own objective, our initial objective model of how we think that data is produced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.085,
    "end": 1213.947,
    "text": "We derive like a likelihood function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.549,
    "end": 1218.392,
    "text": "Step four, prior beliefs, we set those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.895,
    "end": 1226.441,
    "text": " step five, we invert the model, which we're already familiar with doing previously in the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.462,
    "end": 1238.432,
    "text": "I think that's how you go from a model, an agent who has priors and likelihoods, and then those can be mapped through Bayes' theorem to a posterior and model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.452,
    "end": 1245.158,
    "text": "And so everything actually looks kind of structurally equivalent to that equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.398,
    "end": 1247.259,
    "text": "And finally, we move on to the final analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.34,
    "end": 1247.94,
    "text": "Yeah, Prakash.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.085,
    "end": 1272.612,
    "text": " um actually I have a question so so what about if we if you are like we don't exactly follow the likelihood function the way they're given with the way they're giving uh but we uh introduce our own function which actually does the likelihood mapping like not a function or a methodology and uh on top of it so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1273.52,
    "end": 1280.471,
    "text": " So so actually there's a fundamental like we're using this Markovian processes to do the state transitions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1280.511,
    "end": 1282.955,
    "text": "So we have flexibility that we use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1284.297,
    "end": 1292.11,
    "text": "We what I'm actually trying to say is that this three this likelihood function right which starts from the policy level right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1292.37,
    "end": 1296.777,
    "text": "Fundamentally down to the observation level and.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1296.892,
    "end": 1311.651,
    "text": " instead of following the exact mechanism which they give, we can introduce our own methods, but we do the mapping of transitions across states and the observation mapping, like the A matrix and the B matrix, we keep it very similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.691,
    "end": 1321.463,
    "text": "But the other, the higher levels, the higher levels, that can plausibly be changed also, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.604,
    "end": 1325.869,
    "text": "It's like we can apply a free energy principle to that also.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1326.676,
    "end": 1352.768,
    "text": " i'm just uh i'm just thinking on those lines i've not been able to formalize it very cleanly but uh i hope that in a few weeks time i'll have more clarity um so that's just what i was trying to understand you know fundamentally we do this um surprise minimization the the most core principle and then the transition mapping but the later above players like say policies and affordances we can actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1353.794,
    "end": 1360.625,
    "text": " create a methodology which fundamentally does that, but not exactly to this very complex Bayesian mechanisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1361.827,
    "end": 1364.011,
    "text": "That's what I'm trying to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1364.532,
    "end": 1371.904,
    "text": "There can be other methods to accomplish those policies and affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1372.711,
    "end": 1375.135,
    "text": " I'll see if I can if it will work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.295,
    "end": 1376.577,
    "text": "It's a very interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.638,
    "end": 1383.589,
    "text": "And it makes me think that this is like a policy selection, but you're not actually choosing the policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.31,
    "end": 1391.262,
    "text": "But it's trying to develop a function that does map from all of the model and parameters to the choice of policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.683,
    "end": 1394.147,
    "text": "So it's kind of like policy selection from the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1394.207,
    "end": 1397.773,
    "text": "And then we have the view from the inside view from the outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.108,
    "end": 1403.534,
    "text": " And maybe there are some other heuristics or rules that could be simplifying in terms of how we do the policy inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.365,
    "end": 1413.586,
    "text": "Sorry, actually, I couldn't hear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.786,
    "end": 1417.15,
    "text": "But you're saying policy inference will be from inside, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1417.211,
    "end": 1418.772,
    "text": "Or you're saying it will be from outside?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1418.812,
    "end": 1419.573,
    "text": "I don't understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1420.354,
    "end": 1425.28,
    "text": "Well, high is usually how we think about policy selection from the inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.479,
    "end": 1428.125,
    "text": " But we're the behavioral experimenter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.265,
    "end": 1433.576,
    "text": "We're only observing the you, the emitted behaviors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.358,
    "end": 1445.682,
    "text": "So we're developing a model in step three that is the distribution of the emitted behavior given all of the parameters, many of which the subject doesn't have access to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1452.243,
    "end": 1457.038,
    "text": " Daniel, just a quick heads up, your audio is still kind of choppy there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.533,
    "end": 1468.943,
    "text": " But I think you're making the point that, yeah, like whenever we've collected the data, we have access ourselves to what were the the behavioral outcomes, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.124,
    "end": 1475.07,
    "text": "whenever we're looking at equation like the tilde you, that is a series of actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.091,
    "end": 1481.618,
    "text": "The tilde always denotes like a sequence and then you being an individual action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.178,
    "end": 1488.325,
    "text": "And so with the policy, you can think of a policy as a series of actions like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.385,
    "end": 1496.943,
    "text": " we have a rat in a tea maze, action one, it takes a hint as to where the reward is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.485,
    "end": 1504.963,
    "text": "Action two, it goes to where the reward is as told by the hint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.943,
    "end": 1510.036,
    "text": " So so now we have, like, a number of actions in a sequence, like a time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.056,
    "end": 1510.678,
    "text": "Step one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.878,
    "end": 1511.62,
    "text": "It did this time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.64,
    "end": 1512.001,
    "text": "Step two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.041,
    "end": 1520.623,
    "text": "It did this, and that can be represented as the utilda, which could also be represented as an individual policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.603,
    "end": 1528.633,
    "text": " So a rat who really already thinks that the reward is on the left, it'll skip the hint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.174,
    "end": 1531.176,
    "text": "It'll go right to that reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.256,
    "end": 1531.496,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.577,
    "end": 1541.749,
    "text": "So we see a certain we can associate a certain sequence of actions with, you know, this this actual behavior that we see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.789,
    "end": 1543.031,
    "text": "It's equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.491,
    "end": 1549.058,
    "text": "And then whenever we're looking at equation, it's like, OK, well, why did the rat jump right to the reward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.342,
    "end": 1559.726,
    "text": " like what parameters are in the model that would push it into that kind of behavior rather than the kind of, you know, safer policy of going for the hint first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.588,
    "end": 1564.337,
    "text": "And so that's what we're trying to kind of recover.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.397,
    "end": 1567.384,
    "text": "Like what are those parameters that are determining that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.668,
    "end": 1570.914,
    "text": " given that we only know the actions that it took.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.014,
    "end": 1576.504,
    "text": "We don't know all of these underlying parameters and cognitive parameters or otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.005,
    "end": 1578.548,
    "text": "We don't necessarily know priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.511,
    "end": 1583.837,
    "text": "We don't necessarily know how much the rat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.817,
    "end": 1598.332,
    "text": " Another thing that we get introduced to in this book is whenever an agent has extremely strong priors, like a rat who just really, really wants the cheese and doesn't even really care.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.832,
    "end": 1608.762,
    "text": "It's not very risk averse, so it doesn't really care if it ends up choosing the wrong option and getting a small shock or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.742,
    "end": 1610.447,
    "text": " it'll run right to the cheese.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.011,
    "end": 1617.044,
    "text": "Those are all parameter settings that are determining that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.425,
    "end": 1623.983,
    "text": "And those are the parameters settings that we're trying to recover in the model inversion process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.963,
    "end": 1644.773,
    "text": " and that's why it's step five we get this like reverse uh view of that same equation instead of we have instead of having a sequence of actions given a parameter now we're trying to find what is that parameter given the actual actions that we that we observed that kind of tracks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.744,
    "end": 1649.628,
    "text": " I'm sorry, Andrew, a basic question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1649.668,
    "end": 1652.071,
    "text": "Could you please tell those values?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1652.171,
    "end": 1654.835,
    "text": "What is it, p, mu, tilde?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1654.855,
    "end": 1655.676,
    "text": "That's the policy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.938,
    "end": 1657.819,
    "text": "What is theta?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1658.62,
    "end": 1660.563,
    "text": "What is O and what is M?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1661.103,
    "end": 1662.265,
    "text": "Yes, for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.126,
    "end": 1664.868,
    "text": "Theta are your model parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.309,
    "end": 1672.819,
    "text": "It's sort of like a collection of all these different parameters that might be involved in the model, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.93,
    "end": 1695.87,
    "text": " a lot of notation in other areas and active inference and elsewhere it's like normally they would kind of put that in bold just to to denote like oh this is a collection of different things it's not just like a single value right so that might have been helpful if they used that um but but yeah so the theta are just these parameters that we're trying to recover about the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.85,
    "end": 1707.124,
    "text": " M is just a symbol that throughout the book, sometimes you see an M being included in an equation, sometimes you don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.085,
    "end": 1713.491,
    "text": "But more often than not, it's implicit that M is almost always there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.372,
    "end": 1718.938,
    "text": "M just denotes this is a model, like there's a model in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.918,
    "end": 1721.305,
    "text": " And so it has its own parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.446,
    "end": 1725.86,
    "text": "It exists just point blank, like there is a model involved here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.06,
    "end": 1732.962,
    "text": "And so we have to say, like, technically, all of these parameters are conditioned on the fact that we have a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.65,
    "end": 1741.222,
    "text": " Michael Prast- specified, maybe in a certain way, for example, that in might also carry along the idea that oh yeah this is specifically a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.063,
    "end": 1758.949,
    "text": "Michael Prast- In the form of appeal mdp versus a different kind of model so it's it's kind of there in part just as a reminder and that's why it's often left out because it's already implicit that it's always there and then, finally, the.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.368,
    "end": 1772.382,
    "text": " uh tilde o that is our sequence of observations and so with a rat like in a tea maze just as we had oh the rat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.918,
    "end": 1778.144,
    "text": " Like action one, the, the tilde U it first, it took the hint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.505,
    "end": 1780.167,
    "text": "Then after that, it went for the reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1780.587,
    "end": 1784.372,
    "text": "We know that those are, are recorded actions that the rat took.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.833,
    "end": 1794.324,
    "text": "We also know the observations that is, oh, the rat, whenever it took the action of going to the hint, we know that it observed the hint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.145,
    "end": 1799.871,
    "text": "Um, so we can track that action number two, it went for the reward and it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.121,
    "end": 1801.984,
    "text": " it successfully got it, it got the cheese.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.445,
    "end": 1809.515,
    "text": "The observation in that case at time step two is that the rat observed the reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.196,
    "end": 1816.326,
    "text": "So just as we have a sequence of actions, we also have an associated sequence of observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.767,
    "end": 1823.597,
    "text": "And those are kind of our two, those are the two things that we collect in empirical data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.577,
    "end": 1832.868,
    "text": " but which we now have like hopefully enough components to try and do this model inversion and extract those parameters that we cannot directly observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.45,
    "end": 1834.212,
    "text": "Is that helpful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.934,
    "end": 1835.995,
    "text": " Uh, uh, sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1836.075,
    "end": 1838.639,
    "text": "Can I, can I just, uh, clarify what I understood?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1838.679,
    "end": 1840.381,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.721,
    "end": 1840.961,
    "text": "Uh, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1840.981,
    "end": 1841.182,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1841.422,
    "end": 1843.384,
    "text": "So, so what they're saying is, so, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.404,
    "end": 1850.032,
    "text": "M is the model, which we can think is think of like a configuration setting initially, which we pass on to the entire system, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1850.773,
    "end": 1854.518,
    "text": "Uh, like, because every model can have a different configuration setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1855.139,
    "end": 1857.942,
    "text": "Maybe that, that might serve what I'm saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.583,
    "end": 1863.028,
    "text": "Um, your, uh, O O tilde, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1863.369,
    "end": 1863.709,
    "text": "What is it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1863.889,
    "end": 1864.57,
    "text": "O O bar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1864.887,
    "end": 1868.595,
    "text": " Oh, bar is like your it's a tilde of observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1868.816,
    "end": 1869.337,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.84,
    "end": 1875.25,
    "text": "And then this bar is like, it can be more than one observation, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.27,
    "end": 1884.33,
    "text": "It can be like a sequence of observations, but what is the length of the what is the what is the like the slot of the sequence, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1884.766,
    "end": 1894.582,
    "text": " So we do technically know that like in a teammates example, like based on your yeah, we have a certain number of time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.662,
    "end": 1898.609,
    "text": "So it's like because that's what the POMDP is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.669,
    "end": 1900.352,
    "text": "It's about discrete time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.372,
    "end": 1904.158,
    "text": "So it's like time step one, the rat starts in the center.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.138,
    "end": 1910.745,
    "text": " Like it's done nothing, there are no new observations necessarily, or maybe we say it didn't observe anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.845,
    "end": 1912.546,
    "text": "It's just time step one, there it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.187,
    "end": 1919.774,
    "text": "Time step two, it then goes to get the hint, it observes the hint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.334,
    "end": 1929.083,
    "text": "So now at time step two, we're able to record, here's the action it took, and here is the observation it had observed the hint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.063,
    "end": 1934.292,
    "text": " Then time step three, it decides to move to the left arm of the maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.373,
    "end": 1943.968,
    "text": "And so we know that its action it took, the U, is that it moved left and then it observed a reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.068,
    "end": 1949.216,
    "text": "And so time step three's O is it observed a reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.416,
    "end": 1954.024,
    "text": "So you can imagine that it's like two vectors almost of like, here's time step one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1954.645,
    "end": 1955.567,
    "text": " Here's time step two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.687,
    "end": 1956.629,
    "text": "Here's time step three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.15,
    "end": 1961.019,
    "text": "Here's the vector of actions it took from time step one, two, three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.52,
    "end": 1965.989,
    "text": "Here are the observations it had at time steps one, two, three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.052,
    "end": 1968.655,
    "text": "The trees are typical over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1970.12,
    "end": 1995.115,
    "text": " yeah and in this case it's it's been done in different ways uh for the teammates example for example and it's it's really useful because you can do things like try and study the the so-called explore exploit trade-off so imagine you you allow for four time steps um it's where the rat starts and then it can choose to take the hint or not and then it can go to the reward well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.348,
    "end": 2006.401,
    "text": " If you have four time steps, if the rat skips the hint and goes straight to the reward, well, now that you have that additional time step, the rat can spend more time with the reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.802,
    "end": 2015.072,
    "text": "And so it's like, you know, if you think about it in terms of it, like maximizing its utility or reward, it's like, oh, it gets to spend a whole extra time step with that cheese.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.112,
    "end": 2016.353,
    "text": "Like that's, you know, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.694,
    "end": 2025.304,
    "text": "It skipped the explore behavior, went straight to the exploit behavior to get as much cheese as it could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2025.284,
    "end": 2049.688,
    "text": " but then you can use that to try and study like oh this is a very like risk-taking rat right so it chose to do that uh versus other rats who might be more uh conservative and like go for the the risk uh excuse me go for the hint first even though they're giving up that additional time step that they could spend getting like spending more time with the reward",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.668,
    "end": 2062.483,
    "text": " And then finally, you could also have very risk averse rats who like, you know, maybe they got shocked a couple of times and they have preferences to really not get shocked that that those negative consequences in terms of its preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.543,
    "end": 2062.743,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.843,
    "end": 2076.199,
    "text": "Highly outweigh its preference for the reward, in which case you might have a rat who just stays in the center of the entire time or it might go to the hint as exploratory behavior to gather more info.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.466,
    "end": 2083.455,
    "text": " It might go to the hint and not even trust it, depending on how you set up the situation, and it might stay at the hint and never go for the reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.896,
    "end": 2085.078,
    "text": "It just really wants to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.118,
    "end": 2101.4,
    "text": "It's, you know, so it's as if it's so about this sort of way because it's a real animal, but like maybe it's so scared that it just keeps attempting to gather more info and never goes for the exploit behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.98,
    "end": 2106.186,
    "text": "So hopefully that's maybe kind of an illustration of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.402,
    "end": 2118.083,
    "text": " Matt Kallroos- You know, we can choose the number of time steps whenever it comes to discrete time models like this, so we can easily just index like time step one time step two cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.405,
    "end": 2146.528,
    "text": " Was that helpful at all, Prakash?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.249,
    "end": 2149.953,
    "text": "I might have been over-descriptive with the tea maze example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.275,
    "end": 2155.462,
    "text": "Sorry, actually, my internet got blocked out also.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2155.482,
    "end": 2156.784,
    "text": "I had to reconnect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2157.084,
    "end": 2159.308,
    "text": "But actually, I think I get the picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2159.608,
    "end": 2162.953,
    "text": "I like this model example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.688,
    "end": 2169.352,
    "text": " Yeah, I think it's a worthwhile one, just because this chapter spends time on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.392,
    "end": 2171.855,
    "text": "And that's kind of that figure 9.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.255,
    "end": 2177.72,
    "text": "It's like, here's the series of steps you would take if you were doing the teammates example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.961,
    "end": 2181.544,
    "text": "So it's like for anything that still seems ambiguous or uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.584,
    "end": 2189.932,
    "text": "Hopefully, I'm giving enough info that you can come back to the chapter and see like, okay, I get it now with the teammates example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.972,
    "end": 2193.075,
    "text": "Francis, you had a question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.713,
    "end": 2227.5,
    "text": " yeah um so that was really interesting and really helpful thank you um am i this may be a kind of blindingly obvious uh question is the focus of this book or indeed of the active inference program in the general sense more about understanding active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.902,
    "end": 2257.572,
    "text": " how this exists, rather than say developing active inference as a generic AI technology to solve issues where we're not necessarily, the model, the generative model is not necessarily active inference related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.682,
    "end": 2264.485,
    "text": " Yeah, I think that's a really interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.286,
    "end": 2277.983,
    "text": "And it might be somewhere between, an answer to that might be somewhere between more objective versus highly opinionated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.746,
    "end": 2289.82,
    "text": "But I'll, so I'll give my answer, which is, as far as I'm aware and looking at where, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.222,
    "end": 2298.292,
    "text": " active inference can be applied to just kind of a ton of an immense amount of phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.095,
    "end": 2311.469,
    "text": "Like here we're given chapter nine, applying active inference to empirical data that we're collecting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.529,
    "end": 2314.373,
    "text": "And so we're looking at like actual agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.855,
    "end": 2326.664,
    "text": " active inference has many of its foundations and the work of Carl Frist and others who are coming from a neurobiological background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.064,
    "end": 2336.933,
    "text": "And so there has been kind of a big push initially to use this for those fields and computational psychiatry and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.953,
    "end": 2345.44,
    "text": "And we get a variety of examples of how that's been done in this textbook itself, in this chapter, like table 9.1, they provide a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.622,
    "end": 2358.113,
    "text": " an entire annotated bibliography of all these different works on delusions and pharmacotherapy interventions and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.278,
    "end": 2369.856,
    "text": " But that said, you could build models that are entirely in silico, that don't have to do with analyzing animals or human beings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.739,
    "end": 2380.573,
    "text": "Like on Thursday mornings, we were using RxInfer, which is a package developed in Julia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.553,
    "end": 2384.897,
    "text": " to try and build in silico experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.558,
    "end": 2398.75,
    "text": "And so what I'm saying with that is you could use these tools to build AI or otherwise different kinds of behavioral systems that you could try and employ in the physical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.87,
    "end": 2404.315,
    "text": "Like you could build a robot that has its own sensory modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2404.415,
    "end": 2410.341,
    "text": "It can see visually what's going on and then try and infer what kind of actions it should take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.321,
    "end": 2438.488,
    "text": " realism's preference and of course like if we build a robot unless you're trying to actually emulate a human being or a rat probably not you're probably building it to add to our reality and find some kind of new function in society or otherwise right in that case no and it would be more about like we're starting with make you know simulating something on a computer that maybe one day can be realized in the form of like a physical machine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.468,
    "end": 2457.372,
    "text": " um so yeah it's kind of like these two worlds right it's like we can build active inference models to try and better understand the world around us or we can build models that we can then actually employ you know in the form of ai and in society for whatever your use case is um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.352,
    "end": 2480.338,
    "text": " yeah and and so you'll see a lot more literature that's been published including since the textbook that lends itself more to the latter approach that i described but again of course this textbook is co-written with friston and other folks and with a neurobiological background so i think if you really want to rely just on this textbook you probably will get much more of the flavor the kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.196,
    "end": 2486.681,
    "text": " Yeah, psychological, psychiatric, biological flavoring of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.642,
    "end": 2492.447,
    "text": "I hope that that was a helpful kind of opinion that I shared there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.628,
    "end": 2495.109,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.33,
    "end": 2503.117,
    "text": "I think that was very helpful to clarify what I was feeling my way towards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2503.738,
    "end": 2505.319,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.359,
    "end": 2505.88,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.042,
    "end": 2510.224,
    "text": "Yeah, Prakash, question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.44,
    "end": 2512.483,
    "text": " Hey, hi, Andrew.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2513.004,
    "end": 2527.766,
    "text": "Since you mentioned about this Julia thing, right, and I was planning to join, but I've not been joining because I think I will start joining maybe the week after next, after I complete a few things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2528.547,
    "end": 2530.71,
    "text": "But I have a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2531.146,
    "end": 2536.414,
    "text": " So I have never used Julia before, but I'm seeing that it's quite powerful and it's very fast, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2536.434,
    "end": 2551.677,
    "text": "That's the most, it's like it's, quite people are using it, but I'm also wondering since, does it have integrations with suppose say to tools like Neo4j and has anybody worked on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2551.737,
    "end": 2556.023,
    "text": "Like I was just seeing that they have a driver called bold.jl.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2556.003,
    "end": 2560.13,
    "text": " which does this, I don't know, I don't want to explore so much, it'd be crazy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.15,
    "end": 2568.463,
    "text": "But what I was thinking is if, if we have like, okay, well, let me let me make the question a little bit more simpler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.665,
    "end": 2571.448,
    "text": "Have you guys worked on any kind of?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2571.588,
    "end": 2579.741,
    "text": "Is it entirely within the Julie more do also do some kind of integrations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2580.082,
    "end": 2581.103,
    "text": "Suppose?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2582.986,
    "end": 2583.327,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.707,
    "end": 2595.52,
    "text": " Because in Python, if I use Python, for example, and I want to use other platforms also, the integrations are much more, there are good libraries which will help us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.64,
    "end": 2609.476,
    "text": "But over here, it will require a little bit more level of... We've not jumped into this knowing, for example, Julia and inside and out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.361,
    "end": 2614.562,
    "text": "Or anything, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.808,
    "end": 2621.916,
    "text": " a PhD student who's working directly with the people who developed RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.976,
    "end": 2629.887,
    "text": "So we do have like a little bit of support from someone who's been directly involved in building out the package and resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.128,
    "end": 2634.673,
    "text": "But the majority of us have not even coded in Julia before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2635.134,
    "end": 2642.203,
    "text": "So it's primarily like many of us just kind of learning this together and we're going through,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.183,
    "end": 2653.135,
    "text": " Another nice thing, RxInfer has their website where they've provided a series of different coding examples for different use cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.218,
    "end": 2656.986,
    "text": "We did one that follows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.27,
    "end": 2673.17,
    "text": " a Roomba, like a small machine that cleans your home and trying to model like an inference process so that it can derive like a likelihood of like, oh, if I'm on top of tiles, I must be in the bathroom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.41,
    "end": 2677.455,
    "text": "If I'm seeing a hardwood floor, I must be in the living room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.435,
    "end": 2688.71,
    "text": " So we just get these nice real-world use cases where we get to follow along and figure out how the code is functioning there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.031,
    "end": 2698.043,
    "text": "More specifically, getting back to your question on integration, I'm still learning that myself, so I can't give a terribly holistic answer, but what I can say is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.023,
    "end": 2720.115,
    "text": " anytime we've uh run through any of these examples for the most part we're really just using like uh an updated baseline you know julia like install that on your machine pull it up we use a nice visual editor called vs code if you may or may not already be familiar with that and then um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.095,
    "end": 2725.624,
    "text": " In terms of just bringing in the packages we're using, for the most part, it's just RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.086,
    "end": 2728.519,
    "text": "It's not a ton of other, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.039,
    "end": 2731.723,
    "text": " Okay, to be fair, that has its own dependencies as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.785,
    "end": 2751.175,
    "text": "But yeah, RxInfer aims to be a kind of holistic, like this is the one package you have to pull in, and then maybe you pull in like an additional like nice like plotting package so you can like visualize the results of the inference process or otherwise that come out of RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.195,
    "end": 2756.363,
    "text": "But yeah, I think RxInfer aims to be a rather",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.018,
    "end": 2772.822,
    "text": " standalone asterisk package for building active inference models, both discrete time, like POMDPs, or even just not even going that far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2772.902,
    "end": 2777.369,
    "text": "And MDP depends on your use case, as well as continuous models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.409,
    "end": 2780.494,
    "text": "And yeah, it's quite strong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.474,
    "end": 2803.107,
    "text": " as far as previous approaches to active inference like software wise we have matlab uh which has been more geared toward around uh building discrete time models and uh python where the strongest like pre-established package for that that being uh pi",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.289,
    "end": 2826.799,
    "text": " pymdp developed by uh connor heinz and others that's almost entirely like exclusive to discrete time steps um so julia yeah something about the combination of computational efficiency with like other developers who are creating these new kind of holistic packages for just trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.589,
    "end": 2838.452,
    "text": " develop everything in one go in a single script, that's able to handle continuous processes much better and kind of more holistically as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.173,
    "end": 2841.217,
    "text": "So I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.237,
    "end": 2844.684,
    "text": "That was a lot, but I hope that was helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.705,
    "end": 2846.408,
    "text": "Just a follow-up question on Julia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2847.316,
    "end": 2863.452,
    "text": " like what you're doing are you like trying to say create some functions which will say do a thing like say minimize surprise or say calculate variation free energy for you guys like just create a function which will do that are we think on those lines also",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.073,
    "end": 2891.127,
    "text": " yeah presumably you could define your own um i mean what's really interesting to me about julia versus like python is that that you can actually like type in a theta and other symbols into the code itself as stepping to write it out and so what i what i mean by bringing that up is that like you could certainly um write your own sort of objective functions uh to to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.001,
    "end": 2905.842,
    "text": " Gareth J. Energy minimization what's Nice is that arcs and for like some of its coding examples very specifically relate to have active in France, like it is explicit like an active model of building.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.142,
    "end": 2923.943,
    "text": " There are functions like they have this infer parentheses function where you plug in, here's your model that you've just built, here's your data, simulate the behavior, and then they have a single argument for free energy, true or false.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.963,
    "end": 2927.147,
    "text": "If you set it to true, it will minimize free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.547,
    "end": 2934.175,
    "text": "It's all in-house, out of the box, if you want to do free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.155,
    "end": 2945.532,
    "text": " there's on their website they also have documentation for like is how they like within that function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2946.052,
    "end": 2953.382,
    "text": " is the free that's being minimized, because at this point we have a few different kinds of free energy and formulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.422,
    "end": 2961.292,
    "text": "Like in this textbook, for example, we're already introduced to the difference between variational free energy and expected energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.893,
    "end": 2968.161,
    "text": "And since then, there's been more research into other forms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.141,
    "end": 2988.462,
    "text": " free energy they're highly relatable uh but nonetheless like for example trying to combine like how do we put together variational free energy and expected free energy into maybe an even more concise single formulation and with things like generalized energy another one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.281,
    "end": 3000.812,
    "text": " I'll be able to pronounce correctly, but I think it's birth of energy or Beth energy free energy and that's that we used in this arcs and for package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.314,
    "end": 3002.754,
    "text": "So yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.456,
    "end": 3005.377,
    "text": "summing it back up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.958,
    "end": 3013.065,
    "text": "There are ready to go like out of the box free energy objective functions in the package, but you could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.125,
    "end": 3017.149,
    "text": "define them yourself as well, if you so chose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.652,
    "end": 3026.281,
    "text": " And Daniel's making a great point with the notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.902,
    "end": 3037.922,
    "text": "Another benefit of the arts and fur approach, because I would say it's not just a package, but there's a lot of documentation on how it's its own approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.902,
    "end": 3056.738,
    "text": " highly relatable to the textbook we're going through and nonetheless it kind of makes it attempts to make some kind of advances on on how to do active inference so we end up with these things called constrained 40 factor graphs um we already see all of these different factor graphs in the textbook we're going through here um you know the way the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.106,
    "end": 3063.798,
    "text": " POMDP looks with its nodes and edges, and here's to visualize how it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.818,
    "end": 3081.308,
    "text": "RxInfer is doing the same thing, but it's attempting to make each node kind of self-contained almost, such that you just account for its connections with other nodes, and it will locally minimize its own free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.693,
    "end": 3096.68,
    "text": " In that case, rather than looking at a totality of the system, minimizing some broader free energy, now you can look at it as each node in this graph is minimizing its own free energy based on its local connections only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.7,
    "end": 3097.722,
    "text": "What's it called?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3097.742,
    "end": 3099.064,
    "text": "This allows... What is it called?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.184,
    "end": 3099.685,
    "text": "What are you saying?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3101.875,
    "end": 3104.338,
    "text": " All right, just what you said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.379,
    "end": 3104.699,
    "text": "What is it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.719,
    "end": 3105.34,
    "text": "What is it called?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3105.821,
    "end": 3106.301,
    "text": "What's the name?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3106.321,
    "end": 3109.686,
    "text": "Yes, the constrained 40 factor graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.307,
    "end": 3111.248,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.268,
    "end": 3113.311,
    "text": "And Daniel said the CFFG.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.932,
    "end": 3115.474,
    "text": "Yeah, yeah, for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.514,
    "end": 3118.258,
    "text": "And then you'll you'll see like what's nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.358,
    "end": 3120.441,
    "text": "Another thing is that in each of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.421,
    "end": 3147.07,
    "text": " um example like so if you go to the rx infer website which um you know we've put links to that uh elsewhere in the coda but uh a simple google search of rx infer will will take you right there as well um each of the examples will cite uh related paper so like here here's our code example we've kept it really concise for you but if you need more information on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.05,
    "end": 3157.502,
    "text": " the simulation we're doing, the components, what the CFFG looks like for this, you can just go to the reference paper that relates to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.523,
    "end": 3169.797,
    "text": "So part of the pull here for doing this project is that we are also giving feedback on the documentation for the package since we have this kind of direct connection with the developers themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.638,
    "end": 3176.365,
    "text": "But so we've really been kind of scrutinizing the documentation a bit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.345,
    "end": 3200.496,
    "text": " check out cffg because the whole idea is that altitude you could you could go far beyond the kind of pomdps we're seeing here uh in the textbook with a kind of a standard recipe for building those but um a cffg because each of the nose nodes is uh minimizing free energy locally you could end up building",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.568,
    "end": 3206.855,
    "text": " In principle, whatever kind of model you want, you could make it highly complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.156,
    "end": 3209.78,
    "text": "All you have to do is specify here the nodes connects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.481,
    "end": 3218.094,
    "text": "And it uses message passing algorithms underneath to transfer all the messages between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.114,
    "end": 3221.961,
    "text": "But yeah, you could make any kind of arbitrary model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.941,
    "end": 3249.99,
    "text": " uh basically and and like derive like free energy minimization for each of those nodes and then you could potentially sum those up and look at like how the overall system is doing and such things like that but uh yeah in the interest of time yeah i would just recommend looking more into the rx and per package and it sounds like something that might might interest you and then also we are posting in the coda like uh our notes and and what's coming up in the next meeting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.181,
    "end": 3276.299,
    "text": " But the other option, the active inference as a direct, the startups using active inference as a direct AI approach, rather than just using active inference, rather than using active inference to simply understand systems which understand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3276.34,
    "end": 3278.543,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.978,
    "end": 3280.041,
    "text": " Yeah, no, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.362,
    "end": 3284.714,
    "text": "I think the two kind of approaches come together too, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.734,
    "end": 3292.615,
    "text": "Because so much of this is based upon neuroscience research towards, you can almost think of it as one of them is aiding the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.635,
    "end": 3295.182,
    "text": "If we can learn how biological",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.596,
    "end": 3319.84,
    "text": " organisms learn, for example, that gives ideas of how to formulate a model that itself can learn, and then moving from that to building a pure AI that's just using many of those principles we've derived for generating its own behavior, despite the fact that it itself is not a rat or a human being or some such thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.86,
    "end": 3326.147,
    "text": "But yeah, please, absolutely feel free to add to the code if you have questions or notes or thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.127,
    "end": 3336.593,
    "text": " thanks for that um so i think we've we've about thank you andrew sure i'll stop recording",
    "speaker": "SPEAKER_00"
  }
]