[
  {
    "start": 25.06,
    "end": 38.534,
    "text": " hello everyone it is active lab live stream number 45.0 it's may 27th 2022 and we're discussing the paper the free energy principle made simpler but not too simple",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.27,
    "end": 41.69,
    "text": " Welcome to the ACTIVE Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.171,
    "end": 48.073,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.693,
    "end": 50.774,
    "text": "You can find us at the links on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.714,
    "end": 57.476,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.616,
    "end": 63.918,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.316,
    "end": 73.54,
    "text": " If you want to learn more about the live streams or any of the other projects to get involved at ActiveInfLab, head over to ActiveInference.org.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.56,
    "end": 76.822,
    "text": "We're in stream number 45.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.982,
    "end": 93.391,
    "text": "Our goal is to learn and discuss this very interesting paper, The Free Energy Principle, Made Simpler But Not Too Simple, by Carl Fristin, Lancelot DaCosta, Noor Sajid, Connor Hines, Kai Ullthoffer,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.111,
    "end": 120.166,
    "text": " gregorius pavliotis and thomas parr and just like with all the dot zero videos and indeed all the videos this is an introduction and an overview to a quite technical and lengthy ish paper it's not a review or a final word this is like the opening context for some of the coming discussions we're going to have in the following weeks and beyond",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.332,
    "end": 128.504,
    "text": " and we're going to first just say hello, introduce the big question, the aims, claims, abstract and roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.185,
    "end": 133.612,
    "text": "Then we're gonna give an overview of some of the keywords that are in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.895,
    "end": 142.282,
    "text": " Then we're going to go through the sections of the paper with a focus on some of the key points, the formalisms, and the figures especially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.802,
    "end": 147.026,
    "text": "So it should be a great discussion, and let's get into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.566,
    "end": 150.289,
    "text": "We'll start with just an introduction and saying hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.689,
    "end": 151.75,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.271,
    "end": 155.714,
    "text": "I'm a researcher in California, and I'll pass to Brock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.814,
    "end": 160.158,
    "text": "Brock, thanks for joining and for all the contributions in this .zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.445,
    "end": 165.608,
    "text": " Yeah, so exciting to be here and participate in the active lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.689,
    "end": 170.492,
    "text": "And yeah, I'm just really drawn to this topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.533,
    "end": 173.695,
    "text": "And this paper is a great starting point for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.715,
    "end": 182.843,
    "text": "It's really got a lot of, you know, detail that to dig into and a lot to learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.003,
    "end": 183.964,
    "text": "So yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.624,
    "end": 184.904,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.546,
    "end": 186.666,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.152,
    "end": 198.293,
    "text": " One of the big questions or one way to state the big question was, what are the foundations of the free energy principle and what does it contribute?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.818,
    "end": 214.707,
    "text": " In the paper, they write that they start from a description of the world in terms of a random dynamical system, systems changing through time, and end up with a description of self-organization as sentient, sensing, active behavior, and that's active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.927,
    "end": 218.049,
    "text": "So that's the question that we're wondering about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.089,
    "end": 225.434,
    "text": "We're all wondering about what is the basis and the essence and the implications of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.852,
    "end": 232.113,
    "text": " What would you say about that, or what were some big questions that you had coming into and out of this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.133,
    "end": 243.356,
    "text": "I think my biggest question around the free energy principle is, how general is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.736,
    "end": 244.936,
    "text": "Where does it end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.656,
    "end": 251.497,
    "text": "Because it seems so, they say in the paper also, it's pretty simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.817,
    "end": 254.078,
    "text": "It's kind of tautological in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.105,
    "end": 260.987,
    "text": " So yeah, that's one of my questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.667,
    "end": 262.468,
    "text": "You know, where does it begin?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.488,
    "end": 263.188,
    "text": "Where does it end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.388,
    "end": 266.47,
    "text": "And like, how general is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.55,
    "end": 271.273,
    "text": "The other question is, yeah, how?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.594,
    "end": 276.536,
    "text": "How does it emerge?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 276.636,
    "end": 279.578,
    "text": "Or what does it look like at different scales?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.727,
    "end": 282.027,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.407,
    "end": 285.569,
    "text": "So we'll be returning to questions again and again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.709,
    "end": 289.33,
    "text": "Let's check out the aims and the claims of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.37,
    "end": 294.032,
    "text": "So again, it's the free energy principle made simpler, but not too simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.292,
    "end": 296.813,
    "text": "And the authors are listed here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.297,
    "end": 307.723,
    "text": " The paper describes that it's trying to present the free energy principle as simply as possible, but without sacrificing too much technical detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.463,
    "end": 311.345,
    "text": "And that's sort of a pun slash self-reference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.385,
    "end": 315.728,
    "text": "That's what modeling in that Pareto optimal or Bayes optimal way is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.748,
    "end": 321.991,
    "text": "And that's going to come back as a theme again and again, giving information, but not overfitting nor underfitting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.052,
    "end": 338.025,
    "text": " And then several claims that they make are that they're going to step through the formal arguments that lead from the description of a world as a random dynamical system to the description of self-organization in terms of active inference and self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.192,
    "end": 349.439,
    "text": " they're going to discuss Bayesian mechanics and how those Bayesian mechanics have the same starting point as quantum, statistical, and classical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.36,
    "end": 366.691,
    "text": "And then they're going to differentiate this Bayesian mechanics for particular systems from some of these previously mentioned mechanics in that careful attention is paid to the way that the internal states of something couple to its external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.177,
    "end": 373.158,
    "text": " some of the aims and claims, although many more will be introduced and are discussed in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.339,
    "end": 375.459,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.84,
    "end": 379.9,
    "text": "Or if you'd like to, oh yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.941,
    "end": 395.365,
    "text": "Yeah, just, well, let me, that essentially that it's, you know, it's a self-evidencing, self-describing system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.18,
    "end": 407.114,
    "text": " Again, just very, it seems to fit with a lot of different domains and a lot of like, just observed experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.376,
    "end": 411.14,
    "text": "So cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.381,
    "end": 413.384,
    "text": "Would you like to read the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.291,
    "end": 439.116,
    "text": " This paper provides a concise description of the free energy principle, starting from a formulation of random dynamical systems in terms of a Langevin equation and ending with a Bayesian mechanics that can be read as a physics of sentience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.217,
    "end": 445.678,
    "text": "It rehearses the key steps using standard results from statistical physics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.909,
    "end": 472.058,
    "text": " These steps entail establishing a particular partition of states based on conditional independencies inherit from sparsely coupled dynamics to unpacking the implications of this partition in terms of Bayesian inference and three describing the paths of particular states with a variational principle of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.741,
    "end": 489.1,
    "text": " Teologically, the free energy principle offers a normative account of self organization in terms of optimal Bayesian design and decision making and the sense of maximizing marginal likelihood or Bayesian model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.422,
    "end": 506.216,
    "text": " In summary, starting from a description of the world in terms of random dynamical systems, we end up with a description of self-organization as sentient behavior that can be interpreted as self-evidencing, namely self-assembly, autopoiesis, or active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.758,
    "end": 509.038,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.599,
    "end": 512.181,
    "text": "Okay, let's go to the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.339,
    "end": 523.281,
    "text": " So this paper has layout and it'll be awesome to hear from the authors about why they've laid it out as well as numerous other details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.321,
    "end": 525.041,
    "text": "So we're looking forward to those discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.021,
    "end": 534.883,
    "text": "In section one is an introduction and they wrote at the end of the introduction, the remaining sections describe the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.523,
    "end": 540.244,
    "text": "Each section that's two through eight focuses on an equation or set actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.257,
    "end": 548.364,
    "text": " The ensuing narrative is meant to be concise, taking us from the beginning to the end as succinctly as possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.725,
    "end": 556.131,
    "text": "To avoid disrupting the narrative, we use footnotes to address questions that are commonly asked at each step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.872,
    "end": 562.197,
    "text": "We also use figure legends captions to supplement the narrative with examples from neurobiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.958,
    "end": 566.02,
    "text": "So there's a main narrative thread",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.11,
    "end": 574.053,
    "text": " that's going to touch on sections two through eight, each of these being like a single or a cluster of formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.773,
    "end": 591.0,
    "text": "And then, especially in the footnotes, which are formulated as questions, and in the figure captions, which are sometimes quite lengthy and include examples and citations and so on, more of the biological details and inspiration are added.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.58,
    "end": 594.141,
    "text": "But the mainline narrative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.126,
    "end": 614.879,
    "text": " is going to be touching on these formal areas systems states and fluctuates steady states and non-equilibrium three particles partitions and things in four self-organization to self-evidencing in five lagrangian generalized states and bayesian filtering in six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.987,
    "end": 625.511,
    "text": " statistical to classical particles in seven, path integrals, planning, and curious particles in eight, and section nine will be a conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.491,
    "end": 634.554,
    "text": "So we're going to next discuss the keywords at an overview level and just describe like some of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.087,
    "end": 642.469,
    "text": " broader topics that might lead someone to find this paper, be curious about it, or wanna cite it in one of those domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.13,
    "end": 645.851,
    "text": "And then we're going to just jump right into the introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.351,
    "end": 658.896,
    "text": "Each of the nine sections will be clearly indicated which section we're in, and we'll be following the order of the paper, bringing in a few other resources as we saw fit in the preparation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.936,
    "end": 662.097,
    "text": "And we're just gonna focus on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.703,
    "end": 677.106,
    "text": " some of the dots, connecting a few and leaving many, many for the dot one and the dot two discussions, because it's again, a paper with a lot of formalisms and a lot of rich topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.706,
    "end": 690.689,
    "text": "So we're just going to give this overview and try to front load the contextualization and then continue to unpack and develop this and work on our shared understanding in the coming weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.223,
    "end": 703.951,
    "text": " The keywords that were listed were Bayesian, non-equilibrium, self-organization, variational inference, and Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.812,
    "end": 707.854,
    "text": "So Brock, tell us about Bayesian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.557,
    "end": 713.038,
    "text": "Bayesian analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.66,
    "end": 734.406,
    "text": " So it's basically an analysis method for determining the posterior probability, which is basically your inactive inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.506,
    "end": 744.35,
    "text": "And it's going to be something like your beliefs after having evidence added to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.691,
    "end": 752.133,
    "text": " your prior beliefs, which are something approximately like a hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.153,
    "end": 762.236,
    "text": "So you have the equation here and also this word explanation, that's essentially what I just said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.116,
    "end": 772.539,
    "text": "So you're adding, you know, observation to hypothesis and changing, trying to reduce the, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.837,
    "end": 781.443,
    "text": " trying to approximate this PHV here over EU, the processor probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.763,
    "end": 793.972,
    "text": "So it is pretty foundational to, yeah, a lot of statistics and physics and other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.676,
    "end": 799.036,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.257,
    "end": 800.998,
    "text": "Yes, totally agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.098,
    "end": 803.16,
    "text": "Bayesian statistics, it's a big topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.028,
    "end": 825.366,
    "text": " and just like you said it's about how prior beliefs meet incoming evidence and how that is updated to form posterior you know after the evidence beliefs versus before the evidence and that can be done in this continuous cycle and a lot of the variables that we're going to be seeing and talking about have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.317,
    "end": 829.818,
    "text": " interpretations of being one of these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.159,
    "end": 840.501,
    "text": "For example, it might be a variable that represents a systems prior about something or something might come in and that might be evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.622,
    "end": 849.824,
    "text": "So we're going to be working within a Bayesian statistical framework rather than, for example, a frequentist p-value driven statistical framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.185,
    "end": 852.025,
    "text": "But we'll come to these details along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.446,
    "end": 854.826,
    "text": "How about non-equilibrium?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.248,
    "end": 883.046,
    "text": " this is um i think a much fuzzier topic um like the tradition like historically you know science studied like equilibrium state systems and non-equilibrium state systems are like more uh relatively newer things um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.457,
    "end": 910.718,
    "text": " And so non-equilibrium is, these are things that were mentioned in the paper, it was like flows of between transitions of between like a finite sets of states, having an attractor in a system that over time, you know, perturbations in the system still act as a set of characteristic states to which the system is attracted over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.738,
    "end": 910.778,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.04,
    "end": 921.803,
    "text": " and non equilibrium being like a higher energy level state that is its local environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.945,
    "end": 931.568,
    "text": "But nonetheless, distinct, definite, separate, and over time, continuous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.747,
    "end": 944.17,
    "text": " So just looking at the animation you put here, it's like the brick at some time scale is out of equilibrium, like the brick will also dissolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.21,
    "end": 952.673,
    "text": "But for some model of a certain timeframe hours, it could be seen as being spatially or just materially in an equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.133,
    "end": 955.634,
    "text": "And then looking at these two moving entities,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.534,
    "end": 959.216,
    "text": " It's kind of like two kinds of non-equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.776,
    "end": 966.38,
    "text": "There's like the low bar non-equilibrium, this mechanical bird on the right side, the water dipper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.86,
    "end": 969.762,
    "text": "And so it is returning to these characteristics states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.483,
    "end": 974.625,
    "text": "It's not just staying in one location, it's returning to drink the water again and again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.186,
    "end": 978.168,
    "text": "So it's not in spatial equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.068,
    "end": 984.352,
    "text": " But also there's like this stationarity or there's something about it that is constrained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.073,
    "end": 1000.726,
    "text": "And then the ostensibly living bird, I guess, on the cartoon on the left is like non-equilibrium of an even higher or more complex type because that bird might like fly away or do something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.206,
    "end": 1005.61,
    "text": "So there's like a gradient from things that are like the ball at the bottom of the bowl",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.555,
    "end": 1037.043,
    "text": " in equilibrium and then progressively mechanical systems that are returning to attracting states and then what does it mean for biological systems to be or to be modeled as returning to attracting states like sleep or a certain body temperature certain blood glucose any other thoughts on that or we can carry on yeah just yeah this is a different like time scale set of states larger smaller and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.472,
    "end": 1043.993,
    "text": " navigating, traversing those states, yeah, internally, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.213,
    "end": 1049.335,
    "text": "And so, I guess it just, it depends where you're drawing the time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.095,
    "end": 1051.415,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.435,
    "end": 1053.096,
    "text": "But they can be modeled differently like that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.116,
    "end": 1055.977,
    "text": "How about self-organization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.038,
    "end": 1060.319,
    "text": "I think this one, like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.831,
    "end": 1068.913,
    "text": " Maybe it sounds like just this complex, but I think this is like really familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.853,
    "end": 1072.694,
    "text": "For most people, they have a good idea of what this is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.215,
    "end": 1085.158,
    "text": "And, you know, these, like examples here of non equilibrium systems that, you know, have some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.362,
    "end": 1112.435,
    "text": " um symmetry asymmetry of constraints that over time causes them to take a particular path through that um you know set of states towards one attractor or another um cellular meiosis and mitosis here um black hole mergers nuclear fission nuclear fusion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.209,
    "end": 1117.87,
    "text": " very large, very small, in between scales here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.491,
    "end": 1142.998,
    "text": "In the paper referencing FEP, they said FEP was about kind of turning on its head this traditional what must things do in order to exist framing of systems and physics to if it exists",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.545,
    "end": 1145.706,
    "text": " what must they do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.466,
    "end": 1155.532,
    "text": "And so this is saying, we know we have now a Bayesian evidence of black hole mergers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.192,
    "end": 1159.874,
    "text": "What must it be doing for that data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.454,
    "end": 1162.416,
    "text": "Now that new evidence to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.758,
    "end": 1168.119,
    "text": "Yeah, exist, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.253,
    "end": 1179.435,
    "text": " What, how will, how does nuclear fusion, you know, how does that turn into two atoms turning into one atom?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1179.575,
    "end": 1184.716,
    "text": "What must it be doing instead of the other way around?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.836,
    "end": 1187.177,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.417,
    "end": 1187.657,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.177,
    "end": 1197.299,
    "text": "Big topic, many angles on it, but sometimes those inversions like actual Constance paper that we discussed in live stream 34 with, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.95,
    "end": 1221.783,
    "text": " about how you got there so conditioned on some thing which we're going to return to existing being perceived being modeled what must that thing be doing in order to exist not what has to happen for the thing to exist but we're going to come back to that and then um the last two we'll just give a first",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.583,
    "end": 1252.019,
    "text": " coat of paint because we're gonna see them in their technical glory soon so what is variational inference about um i'm actually less clear on this but uh related to bayesian inference it's about approximating that um posterior probability the um after um things happen like but what you know um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.339,
    "end": 1260.183,
    "text": " to what resolution can you kind of, you know, what precision can you state about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.443,
    "end": 1267.089,
    "text": "And also trying to have a lower bound for the marginal likelihood of evidence of the observed data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.109,
    "end": 1277.378,
    "text": "So how likely are you to see the data that would cause that to be that would lead to the posterior probability being what it is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.519,
    "end": 1281.742,
    "text": "That was my understanding of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.817,
    "end": 1285.318,
    "text": " Yeah, awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.059,
    "end": 1287.999,
    "text": "What is the divergence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.88,
    "end": 1299.466,
    "text": "It'll be awesome to hear the authors' and others' perspectives, but places where we've seen a variational Bayesian inference before, first off, it's not an innovation of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.751,
    "end": 1320.142,
    "text": " Variational autoencoders and variational Bayesian methods are being used in active inference with the partial novelty of action being considered as a parameter rather than just sensory parameters, but it's used in situations where exact Bayes is intractable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.141,
    "end": 1328.425,
    "text": " and sampling-based approaches like Monte Carlo are also not tractable or not plausible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.006,
    "end": 1345.616,
    "text": "And so variational inference is about minimizing the divergence between Q and P, mind your Qs and Ps, as they say up there, and making sure that Q is from a family of distributions that is tractable and easy to optimize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.276,
    "end": 1349.258,
    "text": "Even if P is something that is challenging,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.566,
    "end": 1364.655,
    "text": " Instead, a different distribution, for example, one that has a shape looking more like a parabola, more like a bowl, can be fit with Q. And then there's still some detail, like if P truly were bimodal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.6,
    "end": 1371.425,
    "text": " Would you want the one that identifies and rests Q on top of one hump and ignores the other hump?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.265,
    "end": 1382.013,
    "text": "Or would you want the Q that is kind of centered at a place where neither of the P humps are, but contains some density in both?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.313,
    "end": 1392.0,
    "text": "So those are some detailed questions, but in general, it's about minimizing the divergence between Q and P as a means of approximating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.001,
    "end": 1396.664,
    "text": " what exact Bayes would be doing in the asymptote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.924,
    "end": 1410.693,
    "text": "If the divergence were zero, you would be having the perfect approximation of Q on P. And then anywhere other than the divergence being zero, there's a monotonic way for you to get towards that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.994,
    "end": 1421.481,
    "text": "And then Markov blanket, which we're going to come to in multiple formalisms, but just what comes to mind when you hear Markov blanket and what did you want to show here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.099,
    "end": 1429.001,
    "text": " This one is like, I feel like this is the most easy to understand one somehow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.501,
    "end": 1436.924,
    "text": "It's like this picture here, you can see is a bunch of dots that are different colors, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.984,
    "end": 1441.526,
    "text": "And you have like a circular concentric circles here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.206,
    "end": 1447.668,
    "text": "And that's, you know, that this large inside the large square scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1448.733,
    "end": 1470.539,
    "text": " there's this like yellow line that separates all the outside dark blue from the inside orange and red and but there's also an an orange inside circle and these these yellow and orange are kind of in a um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.887,
    "end": 1480.048,
    "text": " in a relationship that keeps the dark blue and the red separate, independent of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.209,
    "end": 1492.151,
    "text": "But you also have these smaller scale inside the red, inside the yellow, inside the orange here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.211,
    "end": 1501.753,
    "text": "These other scale of the same thing, like that it is in some sense, either recursive or fractal or,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.089,
    "end": 1519.952,
    "text": " locally having this same kind of dynamic of two layers conditioned on each other to keep an external and an internal state independent of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.472,
    "end": 1524.313,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.693,
    "end": 1524.973,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.113,
    "end": 1527.153,
    "text": "Which is everything, I feel like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.074,
    "end": 1531.094,
    "text": "It's every thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.165,
    "end": 1534.272,
    "text": " Which we're going to be getting to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.516,
    "end": 1536.359,
    "text": "Mind the space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.623,
    "end": 1537.763,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.986,
    "end": 1544.647,
    "text": " It's an exciting topic and there's a lot of ongoing discussions and developments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.707,
    "end": 1554.449,
    "text": "Here's a recent paper by Caspar Hesp and there's many other valuable commentaries on Emperor's New Markov Blankets by Jelle Bernberg, which was previously on a live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.569,
    "end": 1565.572,
    "text": "So there's many, many technical and philosophical and implementation discussions around identifying Markov blankets, reifying them, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.512,
    "end": 1567.172,
    "text": "And we're going to get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.492,
    "end": 1569.353,
    "text": "So into the paper we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.947,
    "end": 1573.088,
    "text": " We're in section one, introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.429,
    "end": 1582.792,
    "text": "They write, it is said that the free energy principle is difficult to understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.252,
    "end": 1584.012,
    "text": "No citation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.332,
    "end": 1584.913,
    "text": "Who's saying that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.133,
    "end": 1585.913,
    "text": "No one is saying that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.773,
    "end": 1588.414,
    "text": "This is ironic on three counts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.774,
    "end": 1592.756,
    "text": "First, the FEP is so simple that it is almost tautological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.723,
    "end": 1618.332,
    "text": " circular reasoning indeed philosophical accounts compare its explanandum what it explains to a desert landscape in the sense of quine aquinian desert landscape as per what clark wrote and we'll return to that in a second a second reason for the irony is a tenant of the fep is that everything must provide an accurate account of things that is as simple as possible including itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.753,
    "end": 1624.057,
    "text": " Finally, the FEP rests on straightforward results from statistical physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.457,
    "end": 1628.041,
    "text": "So one is, it's not difficult to understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.301,
    "end": 1630.183,
    "text": "It's so simple, it's circular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.044,
    "end": 1639.552,
    "text": "Two is, how can it be difficult to understand when everything is as simple as it must be, including the FEP literature?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.796,
    "end": 1642.436,
    "text": " That's some high level irony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.036,
    "end": 1650.718,
    "text": "And then the third reason is how could it be difficult to understand when it rests on straightforward results from statistical physics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.298,
    "end": 1665.721,
    "text": "And then I just wanted to highlight this Clark 2013 citation and the desert landscape, because that seems like kind of like a oblique reference, but here's what Clark, and also here's two representations of desert landscapes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.881,
    "end": 1669.562,
    "text": "So they're not all bad, in fact, but what Clark wrote was,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.57,
    "end": 1674.931,
    "text": " referring to radicalisms that might exist within this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.911,
    "end": 1692.937,
    "text": "In extending the models to include action, action-oriented predictive processing, which is very, very similar to active inference, we might simultaneously do away with the need to appeal to goals and rewards, replacing them with a more austere construct of predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.797,
    "end": 1712.043,
    "text": " so i don't want to do this or i'm not rewarded by doing that i'm just making predictions and expectations about what might happen and then fulfilling them or diverging from those fulfillments and so um that is this desert landscape vision there are neither goals nor reward signals as such",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.382,
    "end": 1741.768,
    "text": " instead there are only learnt and species specific so kind of developmental and evolutionary expectations across spatial and temporal scales that are in control of perception action loops and so what are we explaining or explaining away that's this desert landscape notion and that's how the authors are beginning the paper with a sort of preemptive tripartite broadside",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.833,
    "end": 1771.834,
    "text": " dissuading one from thinking that this is going to be difficult to understand before launching into the subsequent eight sections that might give you some um evidence to the contrary but yeah any thoughts on that i just thought yeah the desert laquanian desert landscape very apt description and um yeah physical sort of yep it it lines up and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.39,
    "end": 1794.771,
    "text": " yeah like I said that this uh it does seem tautological like a lot of these concepts if you think about them from like the statistical physics it's like obviously but um didn't there's just a lot of um area there to be covered right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.919,
    "end": 1800.56,
    "text": " Yes, and also note that Clark in 2013 wrote, I remain unconvinced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.161,
    "end": 1809.383,
    "text": "Even if the austere description is possible, this would not justify the claim that this is the better tool for understanding the cognitive economy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.204,
    "end": 1814.765,
    "text": "It is intractable, so it's like, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.985,
    "end": 1815.145,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.28,
    "end": 1835.903,
    "text": " yep awesome so still in the introduction the author is right before starting it might help to clarify what the free energy principle is and why it is big question alert many theories in the biological Sciences are answers to the question what must things do in order to exist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.887,
    "end": 1862.771,
    "text": " and some answers but we could think of probably many others that people have raised so if if you ask somebody what does something have to do in order to exist some answers could be like well it has to resist dissipation it has to replicate or it has to reproduce or propagate some way like there's stuff it has to do to be there the FEP turns this question on its head and asks if things exist what must they do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.557,
    "end": 1872.625,
    "text": " More formally, if we can define what it means to be something, can we identify the physics or dynamics that that thing must possess?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.746,
    "end": 1878.23,
    "text": "To answer this question, the FEP calls on some mathematical truisms that follow from each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.652,
    "end": 1888.52,
    "text": "Then they write, much like Hamilton's principle of least action, the FEP is not a falsifiable theory about the way things behave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.48,
    "end": 1893.844,
    "text": " it is a description of things that are defined in a particular way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.805,
    "end": 1902.811,
    "text": "And for more reading on this, here's a 2018 interview with Fortier and myself and with Carl Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.772,
    "end": 1906.995,
    "text": "And here there's some discussion around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.504,
    "end": 1909.885,
    "text": " Notions of falsifiability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.185,
    "end": 1912.386,
    "text": "Can the FEP be falsified?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.706,
    "end": 1926.914,
    "text": "Or what is the relevance of falsification, which is a frequentist idea, in this Bayesian, meta-Bayesian, post-Bayesian, whatever epoch or mode that we're in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.555,
    "end": 1931.657,
    "text": "And just one really interesting quote is from Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.017,
    "end": 1937.26,
    "text": "I would assert that the notion that a framework can have the attribute falsifiable is a category error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.902,
    "end": 1948.71,
    "text": " The notion of falsifiability is thus a very weak notion because it's actually reflecting rejecting a null hypothesis in favor of an alternative hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.651,
    "end": 1965.383,
    "text": "That has some limitations, including the transcendental arguments on falsification, which is just that belief is rarely scrutinized using a falsificationist framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.031,
    "end": 1993.987,
    "text": " and then dropping from the transcendental argument into a more history of statistics and science, when we move from frequentism towards Bayesian statistics, where the p-value and so on, and the parametric distributions are seen as like special cases, but not the whole substance of the statistics, Carl's suggesting that a better way to frame evidence-based selection of hypotheses",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.08,
    "end": 2020.77,
    "text": " which is ostensibly what falsification is after as well is in terms of how much empirical evidence is accrued by competing hypotheses and that's quite a different model than uh can and then falsify the ones that aren't true let's shoot down the ones that don't exist so this is quite an interesting area um what would you say or add to this there's a word uh verisimilitude",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.839,
    "end": 2026.863,
    "text": " I think that is exactly what he's describing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.363,
    "end": 2036.831,
    "text": "Again, just how much evidence is accrued rather than... I mean, that's in practice how it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.452,
    "end": 2039.513,
    "text": "So I don't completely understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.533,
    "end": 2042.876,
    "text": "The notion of phosphorability is really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.037,
    "end": 2044.237,
    "text": "But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.121,
    "end": 2056.775,
    "text": " like Dirac had this notion of beauty, and he's saying, look, if the equation's really beautiful, then maybe you check your experiment first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.858,
    "end": 2063.984,
    "text": "So like you were saying, it's kind of like, that's not falsifiable, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.168,
    "end": 2067.25,
    "text": " then what do you mean by not falsifiable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.27,
    "end": 2069.612,
    "text": "And that is that you're not examining that claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.992,
    "end": 2087.847,
    "text": "It's kind of there's a, you know, infinite regression there of falsify ability that makes it intractable, which is why taking the opposite approach of just stacking up the evidence is, you know, a way to make the same, it's the same thing, you know, but attractable version kind of, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.208,
    "end": 2090.85,
    "text": "So awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.827,
    "end": 2099.991,
    "text": " They write, again, picking up on that last quotation there, that the FEP is not a falsifiable theory about the way things behave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.571,
    "end": 2103.993,
    "text": "It's a description of things that are defined in a particular way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.253,
    "end": 2106.454,
    "text": "Let's talk about utility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.094,
    "end": 2111.976,
    "text": "Is such a description, if the FEP is indeed a description, is it useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.917,
    "end": 2114.798,
    "text": "In itself, the answer is probably no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.218,
    "end": 2116.899,
    "text": "Oh, well then we can stop reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.123,
    "end": 2122.27,
    "text": " in the sense that the principle of least action does not tell you how to throw a ball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.151,
    "end": 2131.203,
    "text": "However, the principle of least action furnishes everything we need to know to simulate the trajectory of a ball in a particular instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.972,
    "end": 2142.075,
    "text": " In the same sense, the FEP allows one to simulate and predict the sentient behavior of a particle, person, artifact, or agent, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.375,
    "end": 2143.595,
    "text": "some thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.776,
    "end": 2154.058,
    "text": "This allows one to build sentient artifacts or use simulations as observation models of particles or of those other mentioned types of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.479,
    "end": 2159.52,
    "text": "These simulations rest upon specifying a generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.725,
    "end": 2164.406,
    "text": " that is apt to describe the behavior of the particle or person at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.027,
    "end": 2174.73,
    "text": "At this point, committing to a specific generative model can be taken as a commitment to a specific and falsifiable theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.41,
    "end": 2177.851,
    "text": "Later, we will see examples of these simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.731,
    "end": 2187.574,
    "text": "So it's like the linear regression concept is not even where you would want to focus the brunt of your falsifying effort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.459,
    "end": 2200.271,
    "text": " But if there are two different linear regression models, we might ask which one is preferable or which one is falsified by doing some subsequent perturbation or experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.891,
    "end": 2212.262,
    "text": "But the linear regression framework is like a framework, hence not falsifiable in the way that people often expect and deploying a specific generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.223,
    "end": 2239.311,
    "text": " analogous to like a specific linear aggression model but different that is where there's a commitment to a falsifiable theory i think the amygdala connects to this that way that could be tested and that evidence could be evaluated within a falsification or bayesian base factor framework falsifying the concept of generative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.247,
    "end": 2250.511,
    "text": " They would have crossed that bridge and now could be engaging in falsification and evidence comparison within some constrained space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.012,
    "end": 2254.433,
    "text": "Anything to add on that as we close the introduction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.394,
    "end": 2261.476,
    "text": "Yeah, just again, it's a linear model versus a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.516,
    "end": 2266.078,
    "text": "The linear model will yield some approximation that's not necessarily a real...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.454,
    "end": 2290.426,
    "text": " possible observation to falsify the generative model will produce many things that you might not observe possibly but some that you will and then could potentially be falsified like it gives specific examples so yes it's almost like it takes this this meso scale",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.457,
    "end": 2299.854,
    "text": " and it separates the milk from the cream and the FEP flies over falsification",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.874,
    "end": 2307.277,
    "text": " And then once you're committed to a specific generative model, it's actually written down, not just speculated that it could be written down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.817,
    "end": 2310.499,
    "text": "Then it's like, oh, well then it's trivial or against it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.039,
    "end": 2316.722,
    "text": "So it kind of separated out the framework, like language as a framework, like Dave just mentioned in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.142,
    "end": 2318.443,
    "text": "How would you falsify a language?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.563,
    "end": 2321.504,
    "text": "You would not any more than you would falsify a conceptual framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.044,
    "end": 2326.807,
    "text": "So one could not falsify a language like English",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.237,
    "end": 2336.644,
    "text": " But things that are said within English might be amenable to being tested once they're actually said using that framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.246,
    "end": 2340.547,
    "text": "Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.567,
    "end": 2344.11,
    "text": "Evidence stacked up or not versus alternatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.79,
    "end": 2347.873,
    "text": "Just like language or evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.913,
    "end": 2348.173,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.212,
    "end": 2350.474,
    "text": " So recall the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.136,
    "end": 2358.108,
    "text": "We're now going to head into the next sections, each of which is going to be building on each other in this concise narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.252,
    "end": 2361.033,
    "text": "However, also,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.566,
    "end": 2382.866,
    "text": " semi-standalone in their focus and we're just going to do basically a first pass and some contextualization because we have a lot of time in the coming weeks to discuss these topics in more detail so we're going to go to section two systems states and fluctuations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.375,
    "end": 2411.363,
    "text": " okay so they write we start by describing the world with the stochastic differential equation pavliatis 2014. so this is um a citation to the book stochastic processes and applications of diffusions processes um and uh just one preliminary note this is not the same sentence as the world is a stochastic differential equation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.537,
    "end": 2416.859,
    "text": " We start by describing the world with a stochastic differential equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.379,
    "end": 2420.2,
    "text": "So leave your realism at the door.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.58,
    "end": 2422.561,
    "text": "We're describing models here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.921,
    "end": 2425.062,
    "text": "They write, why start here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2426.082,
    "end": 2429.804,
    "text": "The principle reason is that we want a description that is consistent with physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.984,
    "end": 2432.385,
    "text": "Here's some discussion questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.065,
    "end": 2435.026,
    "text": "What does it mean to be consistent with physics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.066,
    "end": 2440.788,
    "text": "What does it mean to be consistent with physics in theory or in principle or in practice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.045,
    "end": 2468.195,
    "text": " And then they write, this follows because things like the Schrodinger equation in quantum mechanics, area A, fluctuation theorems in statistical mechanics, area B, and Lagrangian formulation of classical mechanics, area C, three different mechanics, quantum, statistical, and classical, can all be derived from this starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.298,
    "end": 2474.921,
    "text": " So we're going back to like the last common ancestor of those three different mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.961,
    "end": 2480.743,
    "text": "And then that is where Bayesian mechanics is going to also be initiated from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.724,
    "end": 2486.866,
    "text": "In short, if one wants a physics of sentience, this is the place to start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.027,
    "end": 2488.807,
    "text": "Why start where?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.687,
    "end": 2490.308,
    "text": "Where are we going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.128,
    "end": 2491.768,
    "text": "Why are we going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.33,
    "end": 2495.13,
    "text": "Anything you want to add here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2501.651,
    "end": 2520.998,
    "text": " Um, no, I think, again, just that, yeah, that at all these scale physics, it's, it's odd that you would be able to reproduce, you know, derive all these things from something that's not fundamental or important in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.858,
    "end": 2525.159,
    "text": "So awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.608,
    "end": 2531.549,
    "text": " They write, we are interested in systems that have characteristic states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.21,
    "end": 2539.772,
    "text": "This means the system has a pullback attractor, the sets of states that the system will come to occupy from any initial state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.112,
    "end": 2545.034,
    "text": "So the rubber band is going to pull back to its resting state, if it's allowed to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.294,
    "end": 2547.195,
    "text": "And formalism...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.152,
    "end": 2574.286,
    "text": " that stochastic differential equation describing the rate of change of the states so x are the states the tau is the time and the dot notation is the derivative with respect to time so how states are changing is equal to their flow f of x f for flow and random fluctuations omega so like a signal and a noise term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.216,
    "end": 2582.34,
    "text": " There's the flow, the ocean current, and then there's the vibration that isn't the directed flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.101,
    "end": 2587.803,
    "text": "And this separation of scales is going to come back again and again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.644,
    "end": 2592.946,
    "text": "So dot notation, again, means the derivative with respect to time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.507,
    "end": 2596.769,
    "text": "So how things are changing with respect to time through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.49,
    "end": 2600.291,
    "text": "This yellow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.417,
    "end": 2607.32,
    "text": " means that time and causality are baked into everything that follows in the sense that states cause their motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.281,
    "end": 2616.664,
    "text": "This equation is itself an approximation to a simpler mapping from some variables to changes in those variables with time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.225,
    "end": 2627.869,
    "text": "This follows from a separation into states and random fluctuations implicit in Formalism 1 where states change slowly in relation to fast fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.63,
    "end": 2629.47,
    "text": "So, if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.603,
    "end": 2650.465,
    "text": " this term the noise term is dominant then there will not be movements flow like movement on a manifold um there's some more details but things are changing in different ways different kind of stochastic equations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2651.502,
    "end": 2668.349,
    "text": " that are going to be presented here and in the book and in the citations, they help us see different parts of how we can use dynamical models to understand physics and specifically the physics of particular cognitive slash sentient systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.872,
    "end": 2678.774,
    "text": "Then in the footnote, they ask a question, why is the flow not a function of time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.725,
    "end": 2703.44,
    "text": " that's what we're going to return to in dot one how is time dealt with or not dealt with similarly or differently than other frameworks or other physics and then just to stay on this formalism one and then please give any other thoughts this last line of one p of x equals question mark",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.851,
    "end": 2721.898,
    "text": " The next step shared by all physics, so those three areas that we described, classical, statistical, quantum, and Bayesian, is to ask whether anything can be said about the probability density over the states, the question mark in one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.798,
    "end": 2724.479,
    "text": "So this is the common grounding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.259,
    "end": 2728.28,
    "text": "This is the last common ancestor of the multiple physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.161,
    "end": 2731.582,
    "text": "And now we're going to take it in a different direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.898,
    "end": 2739.101,
    "text": " A lot can be said about this probability density, P , which can be expressed in two complementary ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.841,
    "end": 2745.504,
    "text": "And this is going to introduce a very important distinction and dialectic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.124,
    "end": 2749.005,
    "text": "Here are the two complementary ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2750.966,
    "end": 2752.046,
    "text": "Left side, blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.907,
    "end": 2760.39,
    "text": "Density dynamics using the Fokker-Planck equation, aka, also known as, the forward Kolmogorov equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.35,
    "end": 2762.251,
    "text": "Here's formalism two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.66,
    "end": 2770.032,
    "text": " The Fokker-Planck equation describes the change in density due to random fluctuations and the flow of states through state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.753,
    "end": 2773.178,
    "text": "This is like a field model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.158,
    "end": 2783.726,
    "text": " And then the second complementary way in orange on the right side, in terms of the probability of a path through state space using the path integral formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.086,
    "end": 2785.507,
    "text": "And they write for formalism three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.227,
    "end": 2793.613,
    "text": "Conversely, the path integral formulation considers the probability of a trajectory or path in terms of its action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.134,
    "end": 2800.619,
    "text": "So what are two things that you can say or more about the probability density?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.647,
    "end": 2804.009,
    "text": " What are two complementary ways that it can be expressed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.89,
    "end": 2817.942,
    "text": "What are important similarities and differences between this Fokker-Planck formalism two approach and the path integral formulation of formalism three?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.976,
    "end": 2823.499,
    "text": " Are there other complementary ways to say it or other ways to say what is here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.859,
    "end": 2842.011,
    "text": "But this is just to introduce what's going to be very important and going to be moved back and forth in the course of this paper, which is one representation that's more field-like, continuum-like, and then another representation that's going to be more trajectory and path-based.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.891,
    "end": 2844.072,
    "text": "What do you see in there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.244,
    "end": 2873.162,
    "text": " um yeah we we discussed this like really briefly about um you know like a continuous um space versus a kind of discrete or instantaneous space like there's some um mostly i guess metaphor there analogy um but when you just ask this question of what are you know other ways to say this like it's it's um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.001,
    "end": 2885.35,
    "text": " The action trajectory, their path sounds like an action density or an energy density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.99,
    "end": 2895.259,
    "text": "Where is the path of the energy and the whole system going to evince itself?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.339,
    "end": 2898.241,
    "text": "So it's like an action density gradient or something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.028,
    "end": 2904.228,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.869,
    "end": 2905.069,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.709,
    "end": 2906.309,
    "text": "Real interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.17,
    "end": 2920.677,
    "text": "Both the Fokker-Planck and the path integral formulations, the formalism 2-3 dialectic, inherit their functional form from assumptions about the statistics of random fluctuations in one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.638,
    "end": 2925.5,
    "text": "So recall one with the flow and the random fluctuation term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.661,
    "end": 2930.303,
    "text": "For example, the most likely path or path of least action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.897,
    "end": 2958.77,
    "text": " is the path taken when the fluctuations take their most likely value of zero so we're gonna explore this more but the path of least action is not using action in the same way that active states are exactly path of least action does not mean the laziest or the least energetically costly or the least mobile thing to do it's not that it is so that is what we're going to explore",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.949,
    "end": 2982.998,
    "text": " what does it mean to minimize action in this framework the motion on the path of least action is just the flow without random fluctuations so if the question were you're trying to run in a straight line forward there's two forces there's the flow of you running forward and then there's your thermal vibrations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.911,
    "end": 2988.998,
    "text": " So in one limit, the flow might absolutely be overwhelming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.159,
    "end": 2992.323,
    "text": "The random fluctuation of least action would be that person running forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.405,
    "end": 2996.89,
    "text": "Conversely, if that person was like the size of one molecule,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.038,
    "end": 3007.344,
    "text": " they would be being buffeted by stochastic thermal vibration, and so they would not be following that path of least action the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.044,
    "end": 3020.332,
    "text": "Loose metaphor hopefully doesn't misrepresent, but paths of least action will figure prominently in the following sections of the paper, especially when considering systems that behave in a precise or predictable way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.293,
    "end": 3025.196,
    "text": "We will denote the most likely states and paths with a bold typeface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.184,
    "end": 3054.82,
    "text": " so it can be a little subtle sometimes and so we'll try to um clarify notation and get assistance as we can but like this is like a bold x like a bold x through t is the minimization of that unbolded function with respect to the action a of those states through time and that is going to be related to the change in x through time being just only the flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.836,
    "end": 3060.457,
    "text": " So here it was like x dot of t equals the flow of x plus a noise term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3061.017,
    "end": 3064.478,
    "text": "Here, if the noise term is zero, you can drop it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.599,
    "end": 3080.043,
    "text": "And then they write, although equivalent, the Fokker-Planck and the path integral formalisms, this dialectic that we've discussed, the formalisms provide complementary perspectives on dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.143,
    "end": 3083.544,
    "text": "Did we mention that they're different but complementary?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.639,
    "end": 3088.28,
    "text": " The former deals with time-dependent probability densities over states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.1,
    "end": 3094.702,
    "text": "The latter, the path integral, considers time-independent densities over paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3096.243,
    "end": 3101.084,
    "text": "The density over states at a particular time is the time marginal of the density over trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.925,
    "end": 3111.388,
    "text": "These probabilities, Bayesian probabilities, Bayesian statistics, can be conveniently quantified in terms of their negative logarithms or potentials,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.423,
    "end": 3114.865,
    "text": " leading to surprisal and action, respectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.826,
    "end": 3141.165,
    "text": "So we'll explore the formalisms more, but just to note that the fancy I, the fracture I, is the joint distribution, and it is going to be a negative log on the joint distribution P. And then similarly, A, the action, is going to be on those same variables in a slightly different way,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.155,
    "end": 3172.698,
    "text": " being looking like a surprise conditioned upon x sub zero the starting conditions and we're gonna go into more detail in the coming weeks any more comments on section two or we'll continue to three no i yeah that's awesome section three solutions steady states and non-equilibrium so far so sections one and two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.295,
    "end": 3183.082,
    "text": " We have equations that describe the relationship between the dynamics of a system and probability densities over fluctuations, states, and their paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.823,
    "end": 3186.425,
    "text": "This is sufficient to elaborate most physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.226,
    "end": 3188.787,
    "text": "Big if true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.228,
    "end": 3203.719,
    "text": "Here's where the, for example, we could use the Fokker-Planck or the path integral formalism, so either side of that dialectic, to derive quantum mechanics, where the Fokker-Planck becomes the Schrodinger wave equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.833,
    "end": 3206.214,
    "text": " Mechanics one, quantum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.134,
    "end": 3216.157,
    "text": "We could focus on systems that comprise statistical ensembles of similar states to derive stochastic and statistical mechanics in terms of fluctuation theorems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.757,
    "end": 3217.718,
    "text": "Statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.458,
    "end": 3219.178,
    "text": "Mechanics number two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.199,
    "end": 3232.763,
    "text": "Finally, we could consider large systems in which the fluctuations are averaged away to derive classical mechanics such as electromagnetism and dot dot dot, general relativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.123,
    "end": 3234.144,
    "text": "Classical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.063,
    "end": 3235.903,
    "text": " Mechanics number three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.384,
    "end": 3244.526,
    "text": "All of these mechanics, quantum, statistical, classical, require boundary conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.247,
    "end": 3258.691,
    "text": "To give the examples, the Schrodinger potential in quantum mechanics, the heat bath or reservoir in statistical mechanics, and the classical potential for Lagrangian classical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.991,
    "end": 3262.372,
    "text": "At this point, the FEP steps back",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.692,
    "end": 3288.252,
    "text": " wonder what space it's in and asks where do these boundary conditions come from indeed this was implicit in schrodinger's question in the famous article what is life 1944 where schrodinger wrote how can the events in space and time which take place within the spatial boundary of a living organism be accounted for by physics and chemistry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.438,
    "end": 3300.345,
    "text": " And this is a bit of a nod slash reference to the paper of Ramsted et al in 2018, answering Schrodinger's question of free energy formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.446,
    "end": 3315.614,
    "text": "So this was a really impactful and relevant paper that started a discussion around the FEP and multi-scale FEP and self-organizing complex biological systems and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.87,
    "end": 3321.472,
    "text": " Anything to add about these mechanics and their similarities and differences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.973,
    "end": 3324.834,
    "text": "Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.435,
    "end": 3327.115,
    "text": "I'll just leave it there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.556,
    "end": 3330.197,
    "text": "I will too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.277,
    "end": 3333.399,
    "text": "They're everywhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3335.48,
    "end": 3336.36,
    "text": "In Formalism 6...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.694,
    "end": 3362.825,
    "text": " We're going to go into it hopefully in the discussions, but just in live stream number 32 on stochastic chaos and Markov blankets, just to show where these similar equations were represented, we talked about how the Helmholtz decomposition could be used to take a field and decompose it into multiple sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.965,
    "end": 3365.606,
    "text": "There's the divergence term,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.789,
    "end": 3389.201,
    "text": " which is like um or the gradient term which is like you're on some landscape and the ruler that's the most angled just going straight up the hill that's like the divergence term and that might be useful for going up or down a hill as fast as possible then there's this solenoidal or curl flow term and that is like an iso contour",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.465,
    "end": 3414.5,
    "text": " and those two are part of the classical Helmholtz decomposition and then there's this capital lambda which is the housekeeping term as it was referred to in 32 and we explored it a bit but it reflects the way that that landscape is also influenced by movement so we wondered if that was like kind of like walking around on a trampoline where you can't just snapshot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.08,
    "end": 3443.685,
    "text": " the topographical map and then do your navigation on the fixed map but there's some change there we'll come back to that later so that's section three on solutions steady states and non-equilibria now we're going to really get to mark off blankets particles partitions and things in section four all right so what do you see in figure one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.411,
    "end": 3467.826,
    "text": " Yeah, I mean, see these two inner red and green conditioned on each other that keep these external and internal states on the outside separate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.047,
    "end": 3479.055,
    "text": "They still have conditional relationship between the sensory states, the external states, and the active states, the internal states, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.394,
    "end": 3482.595,
    "text": " not directly with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.237,
    "end": 3486.298,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.498,
    "end": 3489.521,
    "text": "So they wrote in the caption, it's an influence diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.501,
    "end": 3498.928,
    "text": "I believe it's also fairly to say it's a Bayes graph, but we're thinking of the arrows as influence and the nodes like the circles as variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.209,
    "end": 3503.092,
    "text": "It's a particular partition of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.073,
    "end": 3507.915,
    "text": " Particular is a pun because it's one specific partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.215,
    "end": 3511.676,
    "text": "It's not the only partitioning, but it's a particular one that we're sharing with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.437,
    "end": 3520.0,
    "text": "And it's partitioning that into a particle, into something that's like distinguishing figure from ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.72,
    "end": 3532.786,
    "text": "And the four states that get partitioned are internal states and external states that are separated by a Markov blanket comprised of the sensory and active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.538,
    "end": 3549.274,
    "text": " There's a lot that could be said, and we're going to continue to explore, but just to give a few more notes, the partitioning entails that all of these states come into existence in a model-specific way at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.734,
    "end": 3554.08,
    "text": "So it's not like there's some feature of the world that just is fundamentally an internal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.106,
    "end": 3563.108,
    "text": " It's the relationship between an internal and external state conditioned on a blanket by which all of those assignments can be made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.068,
    "end": 3568.67,
    "text": "It's like an incomplete sentence to have one referenced without the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.41,
    "end": 3578.472,
    "text": "Also, we have the names of the states, mu for internal and eta for external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.212,
    "end": 3581.693,
    "text": "And it's kind of like, they almost look like flips of each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.231,
    "end": 3599.198,
    "text": " then s for sensory states incoming info a for action active states outgoing actions so we have eta external s sensory a active and mu internal states and then there's a few",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.629,
    "end": 3604.711,
    "text": " couples of states, sets of states that we are going to care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.351,
    "end": 3608.753,
    "text": "And the equations that describe them have super different implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.333,
    "end": 3614.015,
    "text": "So one set of states that's interesting to compare together is the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.235,
    "end": 3626.841,
    "text": "B is the set of S and A. And that's more aligned with the Pearl 1988 formulation of the Markov blanket or boundary, where it was an undirected blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.722,
    "end": 3627.842,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.817,
    "end": 3633.802,
    "text": " Friston and others have developed this notion of like a two-way partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.382,
    "end": 3647.794,
    "text": "So the blanket is the set of both S and A. The particular states, pi, not to be confused with pi, the policy selection in the POMDP, the particular states are B,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.637,
    "end": 3674.134,
    "text": " and mu so the blanket and mu so the particular states are internal active and sensory everything except for external so the particle is like the cell the boundary and the internal generative model and then there's the autonomous states alpha which is just a and mu and one way to think about those states are like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.405,
    "end": 3679.733,
    "text": " If you were to design the system, those are the states that you can control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.575,
    "end": 3687.307,
    "text": "You can't directly control the sensory input, which is the only thing that differentiates the autonomous from the particular states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.373,
    "end": 3700.376,
    "text": " You can't directly control what photons hit the retina, but you could control your interpretation and your action for where your eyes move, which might absolutely influence which photons do hit the retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.816,
    "end": 3711.299,
    "text": "But the autonomous states are the ones that there's a degree of agency over in a way that is slightly different from just the consideration of the blankets and the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.679,
    "end": 3716.46,
    "text": "Let's continue to talk about some of the formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.07,
    "end": 3746.233,
    "text": " conditional independencies which are going to be let's pull back one more in associating some of these equations of motion with a unique non-equilibrium steady state or ness density we have a somewhat special setup in which the influences entailed by the equations of motions place constraints on the conditional independences of the nest density",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.52,
    "end": 3756.589,
    "text": " These conditional independencies can be used to identify a particular partition of states into external, sensory, active, and internal states as shown in the figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.91,
    "end": 3760.273,
    "text": "This is an important move in what space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.993,
    "end": 3770.343,
    "text": "Because it separates the states of a particle, internal states and their sensory and active states, the particular states from the remaining, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.523,
    "end": 3771.244,
    "text": "external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.827,
    "end": 3778.949,
    "text": " To do this, we have to establish how the causal dynamics in one underwrite conditional independencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.81,
    "end": 3785.592,
    "text": "This can be done simply by using the curvature or second derivative of surprisal as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.172,
    "end": 3791.874,
    "text": "So how is the second derivative of surprise related to causal sparse dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.415,
    "end": 3798.517,
    "text": "In your own words, what is the formal description of a Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.417,
    "end": 3800.978,
    "text": "What's this sort of minimal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.065,
    "end": 3802.986,
    "text": " Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.426,
    "end": 3807.289,
    "text": "This is a slide from live stream 26 on Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3808.01,
    "end": 3810.151,
    "text": "This is like an undirected blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.431,
    "end": 3817.377,
    "text": "We don't have S and A separated, just B, intermediating and partitioning, making mu and ETSA conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.406,
    "end": 3846.943,
    "text": " and what about the fristen blankets type with sense and action separated what about nested markov blankets and so on and so on but just to look at seven we basically have x u and v x sub u and x sub v are conditionally independent conditioned upon b the blanket dot dot dot dot fancy i surprise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.587,
    "end": 3855.47,
    "text": " D squared of surprise, partial derivative, second derivative of surprise, dot, dot, dot, dot, equals zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.611,
    "end": 3857.091,
    "text": "What does it mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.772,
    "end": 3862.794,
    "text": "How is the second derivative of surprise related to causal dynamics and the partitioning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.156,
    "end": 3868.057,
    "text": "But continuing with the sparse coupling notion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.317,
    "end": 3874.7,
    "text": "Sparse coupling means that any two states are conditionally independent if one state does not influence the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.192,
    "end": 3878.414,
    "text": " Tautology number five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.695,
    "end": 3886.881,
    "text": "This is an important observation, namely that sparse coupling implies the non-equilibrium steady state density with conditional independencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.641,
    "end": 3896.289,
    "text": "In turn, this means any dynamical influence graph with absent or directed edges admits a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.089,
    "end": 3902.714,
    "text": "So if your variables are all connected to each other, it's a fully connected social network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.074,
    "end": 3904.956,
    "text": "It's a fully connected statistical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.59,
    "end": 3912.994,
    "text": " then I guess you could argue it has a blanket with respect to some other things that you didn't model or you could get into that whole question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.034,
    "end": 3916.736,
    "text": "But within that model, there are no blanket partitions to make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.977,
    "end": 3929.243,
    "text": "If there are any absent edges, then there are some states which upon knowing them make some other states conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.985,
    "end": 3933.546,
    "text": "They give some more technical details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.451,
    "end": 3940.472,
    "text": " And then they raise a question in the footnote, why does the particular partition comprise four sets of states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.433,
    "end": 3944.593,
    "text": "We'll talk about that in dot one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.854,
    "end": 3956.216,
    "text": "Continuing on sparse coupling and formalism nine, we can define sparse coupling as the solution to this equation in which all the terms are identically zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3956.836,
    "end": 3959.057,
    "text": "So what terms are zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.049,
    "end": 3963.692,
    "text": " What is the reading of this equation meaning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.533,
    "end": 3966.195,
    "text": "Under what situations are they zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.275,
    "end": 3969.898,
    "text": "Are they being measured and said to be estimated at zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.439,
    "end": 3972.821,
    "text": "Are they being dictated to be zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.302,
    "end": 3975.083,
    "text": "So what terms are zero?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.283,
    "end": 3976.745,
    "text": "What does that mean in nine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.866,
    "end": 3982.69,
    "text": "Sparse coupling means the Jacobian coupling states u and v is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.051,
    "end": 3985.013,
    "text": "So on either side of the blanket is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.82,
    "end": 3994.668,
    "text": " look in seven, U and V, they're on either side of the blanket conditioned upon that blanket existing, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3994.688,
    "end": 3998.091,
    "text": "there's an absence of direct coupling from one of those to the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.032,
    "end": 4006.399,
    "text": "This definition precludes solenoidal coupling with U that depends on V because H and gamma",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.506,
    "end": 4008.387,
    "text": " are positive definite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.867,
    "end": 4017.513,
    "text": "Sparse coupling requires associated elements of the solenoidal operator and the Hessian to vanish at every point in state space, which in turn implies conditional independence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.393,
    "end": 4021.315,
    "text": "So what is being shown here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.176,
    "end": 4026.199,
    "text": "But just to give one more visual way of looking at it, this was figure eight from live stream 32.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.4,
    "end": 4035.084,
    "text": "And we had basically six variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4036.021,
    "end": 4040.784,
    "text": " that were in two clusters of three and they were like two communicating entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.585,
    "end": 4045.827,
    "text": "And so they were being coupled by this like one to four connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.628,
    "end": 4052.352,
    "text": "And so up here on the top left, there's strong coupling within nodes one, two, and three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4053.653,
    "end": 4057.095,
    "text": "And then there's strong coupling within this clique of four, five, and six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.076,
    "end": 4062.338,
    "text": "And then there was a sparse coupling between the systems with a one, four,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.145,
    "end": 4070.931,
    "text": " And there was also somewhat of a sparse coupling within the clique because they're not all block squares.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.752,
    "end": 4073.493,
    "text": "So we'll return to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.673,
    "end": 4083.742,
    "text": "And it's again on the theme of how is sparse coupling related to the particular partition and a Bayesian mechanics for particular systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.424,
    "end": 4091.188,
    "text": "They give some more formalisms in 11 about blankets and couplings and flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.2,
    "end": 4094.02,
    "text": " We'll go into it later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.402,
    "end": 4098.683,
    "text": "And 13 is very informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.884,
    "end": 4104.606,
    "text": "The normal form means that particular partitions can be defined in terms of sparse couplings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.787,
    "end": 4110.229,
    "text": "Perhaps the simplest definition that guarantees a Markov blanket is as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.49,
    "end": 4113.771,
    "text": "External states only influence sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.592,
    "end": 4119.094,
    "text": "And internal states only influence active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.458,
    "end": 4142.97,
    "text": " this means that sensory states are not influenced by internal states and active states are not influenced by external states here's formalism 13 so recall eta external s sensory a active mu internal so f is the flow and omega",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.085,
    "end": 4172.151,
    "text": " is going to be the noise and the subscript in something is here like tagging it to be about that variable so we have the rates of change through time here's like a vector or a tuple this vector is describing the four states and it's how external sense action and internal states are changing function of time this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.39,
    "end": 4181.636,
    "text": " just like formula one is gonna be unpacked where we had X dot of T equals flow plus noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4182.377,
    "end": 4185.179,
    "text": "Here, we're doing like four of those in parallel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.799,
    "end": 4200.55,
    "text": "And so it's like external states changing through time is a flow on external states as a function of external sense and action, plus the noise of external states is a function of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4201.724,
    "end": 4210.873,
    "text": " So sense and external states are a function of external sense and action states plus accompanied noise terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.994,
    "end": 4215.237,
    "text": "Whereas action and internal states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.405,
    "end": 4220.028,
    "text": " are functions of sense action and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.889,
    "end": 4226.874,
    "text": "And so it's like external and sensory states are not being caused by internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.294,
    "end": 4229.876,
    "text": "That's the only missing guy here, mu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.617,
    "end": 4233.079,
    "text": "It looks like NSA, it's not, it's ETA SA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.151,
    "end": 4247.179,
    "text": " Conversely, the autonomous states, the ones that we have more agency over, the odd one out, the missing, the dog that's not barking, is eta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.38,
    "end": 4258.547,
    "text": "So these autonomous states are flows on sense action blankets and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.508,
    "end": 4279.98,
    "text": " So the bottom two rows are the autonomous states, and those are defined as flows of particular states, functions of flows that are using the particular variables, whereas the external and sense are driven by external facing variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.041,
    "end": 4282.722,
    "text": "How would you read that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.587,
    "end": 4295.952,
    "text": " Under the sparse coupling, it's simple to show that not only are internal and external states conditionally independent, but their paths are conditionally independent given that path integral formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.332,
    "end": 4296.552,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4297.192,
    "end": 4299.233,
    "text": "Any thoughts on these last few?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.786,
    "end": 4329.256,
    "text": " yeah again I just feel like whether the math is landing for people and this um you know separation of the internal states and the being the internal flow is being conditioned on the sorry the Autonomous States right like um it's also it's just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.933,
    "end": 4339.797,
    "text": " partially like tautological or just makes sense in a simple, the way that the model is presented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4343.438,
    "end": 4344.699,
    "text": "Couple slides back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4345.399,
    "end": 4359.285,
    "text": "I'm not sure if I guess this is the right spot to bring it up, but thinking also about just, so like, I think a question that I have frequently about this is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4360.455,
    "end": 4384.876,
    "text": " where do they come from where do things come from well they come from you know the separation and conditioning of you know particular from background and the blanket forming out of blankets form etc or where is what's the difference between the internal stay the externally like you said if there was you know this giant social graft all everything's connected they're all connected then then there's no markup blankets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.226,
    "end": 4420.995,
    "text": " just like two cells in the body how do they know that they're not um you know they both have their own markov blankets and yet they are both like external states that are indistinguishable from kind of the rest of stuff to themselves right for for each of them right um like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4422.719,
    "end": 4441.648,
    "text": " over time that you know dissipates right and so yeah i just i guess i wonder like the over time um dot notation here like how that um the dynamics of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.111,
    "end": 4455.164,
    "text": " how something becomes an internal state or an external stage, how that exactly happens, because it just seems like when you look at a lot of examples on, you know, our",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.099,
    "end": 4482.086,
    "text": " entropic physics you know um anthropic like um state where we're right like everything is good for us um and everything we can observe right it's it's like galaxies or something oh they're so far away they don't you know there's a lot of intergalactic you know in space that's not affecting it's very external you rewind it a few billion years like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.365,
    "end": 4512.038,
    "text": " lots of interaction lots of markov blankets so it's like um yeah like where does that begin and end yeah oh markov where art i sting yeah um formalism 14 and 15 are further details on the entropy of internal and external paths and the conditional independencies of paths",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.899,
    "end": 4524.305,
    "text": " That's going to conclude section four, particles, partitions, and things, which was about the Markov blanket partitioning of particles, particular states, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.646,
    "end": 4528.848,
    "text": "We'll move pretty quickly through the following sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.969,
    "end": 4533.031,
    "text": "Section five, from self-organization to self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.652,
    "end": 4541.436,
    "text": "Equipped with a particular partition, we can now talk about things in terms of their internal states and Markov boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.338,
    "end": 4543.519,
    "text": " namely autonomous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.679,
    "end": 4547.301,
    "text": "And we can talk about particles, particular states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.901,
    "end": 4554.744,
    "text": "The next step is to characterize the flow of the autonomous states in relation to external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.125,
    "end": 4562.728,
    "text": "In other words, considering the nature of the coupling between the outside and inside of the particle across its Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.809,
    "end": 4571.793,
    "text": "It is at this point that we move towards a Bayesian mechanics that is the special provenance of systems with particular partitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.309,
    "end": 4585.534,
    "text": " The existence of a particular partition means that given sensory states, one can define the conditional density over external states as being parameterized by the most likely internal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.155,
    "end": 4591.977,
    "text": "And we had several discussions in Livestream 26 on Bayesian mechanics with Lance DaCosta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.518,
    "end": 4596.24,
    "text": "This is where variational inference is gonna come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.8,
    "end": 4601.162,
    "text": "We will call this a variational density parameterized by the internal mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.113,
    "end": 4606.015,
    "text": " Q, the distribution we control of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.935,
    "end": 4609.697,
    "text": "Mu, about external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.037,
    "end": 4616.861,
    "text": "Eta is defined as P of external states conditioned on sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4618.902,
    "end": 4627.666,
    "text": "Equation 16 means that for every sensory state, there's a conditional density over external states and a corresponding internal mode with the smallest surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.827,
    "end": 4630.908,
    "text": "This mode specifies the variational density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.817,
    "end": 4639.224,
    "text": " where by definition the KL divergence between the variational density and the conditional density over external states is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.565,
    "end": 4641.986,
    "text": "More formalisms, more details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.748,
    "end": 4646.43,
    "text": "Inducing the variational density is an important move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.411,
    "end": 4654.157,
    "text": "It means that for every sensory state there is a corresponding active mode and an internal mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4655.029,
    "end": 4657.331,
    "text": " This mode does not mean style here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.571,
    "end": 4663.676,
    "text": "Mode means like the most common value in a statistical distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.658,
    "end": 4669.741,
    "text": "The active and internal modes constitute active and internal manifolds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4671.743,
    "end": 4682.132,
    "text": "We will see later that these manifolds play the role of center manifolds, namely manifolds that contain paths that do not diverge or converge exponentially, the operative exponents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.544,
    "end": 4690.049,
    "text": " The internal manifold is also a statistical manifold because it is equipped with a metric and implicit information geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4691.29,
    "end": 4696.254,
    "text": "This is because movement on the internal statistical manifold changes the variational density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.355,
    "end": 4701.978,
    "text": "This is moving towards that dual information geometry perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4703.88,
    "end": 4705.841,
    "text": "What is equation 17 showing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.842,
    "end": 4711.446,
    "text": "We're looking at the flows because if we're interested in those paths of least action,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4712.639,
    "end": 4714.98,
    "text": " we can discount that fluctuation term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.701,
    "end": 4722.305,
    "text": "The expectation of the fluctuations is zero, so we're able to drop those omegas with a subscript that we saw in 13.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4723.326,
    "end": 4727.668,
    "text": "So now we're going to be looking at the flows on different states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.57,
    "end": 4737.214,
    "text": "As for the top two, the external and the sense states, those are going to be about surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4737.955,
    "end": 4739.316,
    "text": "Fracture I, fancy I.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.848,
    "end": 4749.293,
    "text": " For action and internal states, the autonomous states, that is free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4751.614,
    "end": 4759.599,
    "text": "Minimizing surprise about external and sensory states, minimizing free energy about autonomous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4761.88,
    "end": 4762.461,
    "text": "What is that F?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4764.073,
    "end": 4768.015,
    "text": " the free energy in question is an upper bound on the surprisal of particular states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4768.735,
    "end": 4775.478,
    "text": "So in variational Bayesian methods, ELBO and free energy are used to bound the surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.578,
    "end": 4785.842,
    "text": "Here we're bounding surprisal on a particular partitioning, including action to model the action perception loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.722,
    "end": 4791.364,
    "text": "So we've seen variational free energy several times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4792.874,
    "end": 4816.557,
    "text": " do these different rearrangements mean what other rearrangements or restatements of f are possible they give a few thoughts here anything you want to add on variational free energy knowing that we'll have a lot of time to go into that's why just bringing it up that's what formalism is 17 and 18 bring us to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.294,
    "end": 4839.97,
    "text": " yeah back to pat the path and a goal um you know say like um it's i'm wondering my my question is um in relation to action and energy and the way this is being stated like what um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.427,
    "end": 4871.105,
    "text": " yeah what is what is the like action version of this that's what is like the easy to to miss like oh it's just energy um thing that is in the way of like framing this here um because they're not the same thing right like so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.585,
    "end": 4883.035,
    "text": " Yeah, that's my question, is just differentiating that or better defining which parts are action, which parts are the energy components of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.836,
    "end": 4888.801,
    "text": "That's what I would like to be interested in rearranging or thinking about these equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.922,
    "end": 4890.062,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4891.588,
    "end": 4899.251,
    "text": " They write in footnote 19, is variational free energy the same kind of free energy found in thermodynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.131,
    "end": 4902.572,
    "text": "Like Gibbs free energy, perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.272,
    "end": 4904.073,
    "text": "The answer is no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.933,
    "end": 4908.734,
    "text": "This entropy is distinct from the thermodynamic entropy of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.275,
    "end": 4911.696,
    "text": "We're going to return to this and to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.576,
    "end": 4915.037,
    "text": "Are we talking about thermal free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.121,
    "end": 4924.843,
    "text": " Or are we seeing equations that look like descriptors of thermal entropy, but we're applying them in an informational setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.583,
    "end": 4927.244,
    "text": "We'll return to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.944,
    "end": 4942.587,
    "text": "As they had brought up before, one can formulate this along the lines of a center manifold theorem, where we have a fast flow towards the center manifold and a slow flow on the manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.585,
    "end": 4951.789,
    "text": " going fast towards the valley ravine, and then going slow on the river.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.95,
    "end": 4960.554,
    "text": "This decomposition can be derived simply using a Taylor expansion, Taylor series expansion around the time varying autonomous mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4961.314,
    "end": 4964.196,
    "text": "So here is a Taylor series expansion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4964.997,
    "end": 4972.381,
    "text": "It's evaluating a function at a given point, usually zero, and then taking its first derivative,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.345,
    "end": 4987.295,
    "text": " and then taking its second derivative and using higher and higher derivatives to approximate increasing distances from the reference single point where that function was actually evaluated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.675,
    "end": 4997.121,
    "text": "So how is the Taylor series expansion or other power series expansions related to time varying autonomous modes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4998.422,
    "end": 5000.423,
    "text": "What about that flow on the center manifold?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.964,
    "end": 5001.564,
    "text": "We know from 17",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.012,
    "end": 5033.033,
    "text": " the flow of autonomous mode can be expressed in terms of free energy gradients those are the two f's on the autonomous um so this expression 20 unpacks the manifold flow in terms of accuracy and complexity parts of free energy where the accuracy part depends on the sensory states and the complexity part is a function of and only of autonomous states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.667,
    "end": 5041.53,
    "text": " The manifold will look as if it is trying to maximize the accuracy of its predictions while complying with prior Bayesian beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.91,
    "end": 5045.931,
    "text": "Bayesian statistics, these are all Bayesian variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5046.972,
    "end": 5056.956,
    "text": "Here, predictions are read as expected sensory states under posterior Bayesian beliefs about their causes, namely variational density over external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.336,
    "end": 5062.258,
    "text": "The real temperature out there in the room, hidden unobserved external state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5063.308,
    "end": 5083.636,
    "text": " thermometer reading, sensory state, and then states some sort of cognitive mirror or representation as modeled of temperature that's conditioned upon the thermometer reading, but there's some generalized synchrony across that thermometer blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5086.538,
    "end": 5092.28,
    "text": "In footnote 21, they write, question, do particles minimize surprisal or free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5094.756,
    "end": 5121.675,
    "text": " we'll go into it because they say minimization implies a teleology that goes beyond any claim of the fep whence teleology i thought we were like talking about teleology earlier so how deep in the desert are we what what what level of mirage are we engaging in but we'll get there and that takes us to uh figure two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5122.708,
    "end": 5128.651,
    "text": " which is going to show two components of autonomous flow conditioned upon sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.712,
    "end": 5132.153,
    "text": "So I'll move us away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.036,
    "end": 5151.745,
    "text": "We can talk more about the technical details, like how it relies on the Taylor expansion, but here are the autonomous states and the black line potentially can be read as like that manifold attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5153.376,
    "end": 5160.818,
    "text": " And so there's a movement towards, directly towards the attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.438,
    "end": 5175.621,
    "text": "And then there's a movement that is perhaps orthogonalized, keeping in mind the difference between the gradient and the solenoidal flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5176.902,
    "end": 5177.502,
    "text": "And together...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5178.544,
    "end": 5202.926,
    "text": " through time so this is not just like a hill previously like in 26 we saw like the hill and the particle makes its way to the top of the hill as a function of gradient ascent and solenoidal coupling flow here we're not just ascending a hill like we're tracking this moving point through time but we're converging in this spiral way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5204.076,
    "end": 5231.001,
    "text": " and then we can maybe unpack that in relationship to manifold flow and how even if this black line is the manifold then how is the entity staying on the manifold so we'll talk more about figure two now they're going to summarize this section a particular partition of non-equilibrium steady state mass density implies autonomous dynamics can be interpreted as performing inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.943,
    "end": 5256.823,
    "text": " particular kind it's not doing every kind it's doing a specific kind and it's a particle there's the fast flow towards the center manifold and the slow flow on the manifold the manifold flow can be interpreted as bayesian belief updating and posterior bayesian beliefs are encoded by points on the internal states statistical manifold in other words",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.978,
    "end": 5265.685,
    "text": " For every point on the statistical manifold, that synchronization manifold, there's a corresponding variational density or Bayesian belief over external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5266.586,
    "end": 5272.671,
    "text": "These are internal states about external states conditioned on the particular partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5273.672,
    "end": 5277.415,
    "text": "And that can now be expressed as the variational principle of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5278.176,
    "end": 5279.818,
    "text": "This is a basis of the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5280.738,
    "end": 5282.76,
    "text": "Put simply, but not too simply, I guess,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5283.792,
    "end": 5291.798,
    "text": " It means that the internal states of a particular partition can be cast as encoding conditional or posterior Bayesian beliefs about external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5293.96,
    "end": 5298.204,
    "text": "This licenses a poetic description of self-organization as self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.485,
    "end": 5302.927,
    "text": "We'll unpack it later, just wanted to mention it so we can continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5303.768,
    "end": 5304.108,
    "text": "In Figure 3,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.593,
    "end": 5329.177,
    "text": " different ways in which this self-evidencing is connected to various theories for example value surprise entropy and model evidence and the schematic is illustrating how minimizing variational free energy wait but i thought that minimization implies a teleology that goes beyond any claim of the fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.974,
    "end": 5361.472,
    "text": " but minimizing variational free energy relates to normative theories of optimal behavior like value maximization pragmatic reinforcement reward learning pavlov surprise novelty info gain infomax why is the free energy principle here isn't it like all of them entropy and model evidence as well and then just to conclude the section um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.134,
    "end": 5371.978,
    "text": " They ask, is it tenable to interpret gradient flows on variational free energy landscapes as variational inference, or is this just teleological window dressing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5376.279,
    "end": 5379.241,
    "text": "The next section addresses this question through the lens of Bayesian filtering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5380.141,
    "end": 5387.744,
    "text": "In brief, we will see that autonomous paths of least action implied by our particular partition are the paths of least action of a Bayesian filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5389.525,
    "end": 5392.046,
    "text": "This takes us beyond as if arguments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5393.308,
    "end": 5397.769,
    "text": " by establishing a formal connection between particular dynamics and variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5398.809,
    "end": 5403.49,
    "text": "So, to discuss, what are particular dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5406.31,
    "end": 5407.691,
    "text": "What is variational inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5408.751,
    "end": 5413.152,
    "text": "What is the relationship between particular dynamics and variational inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.432,
    "end": 5414.872,
    "text": "What would it mean for it to be as if?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5415.732,
    "end": 5420.473,
    "text": "And what would it mean for it to be something different than as if?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5421.488,
    "end": 5444.638,
    "text": " okay continuing on six lagrangians generalized states and bayesian filtering now say we wanted to emulate or simulate active inference what if what if that were the case we could find the stationary solution to the fokker-plank equation and the accompanying helmholtz decomposition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.598,
    "end": 5452.843,
    "text": " We could then solve number 21, recall it's paths of least action that characterize the expected behavior of this kind of particle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.184,
    "end": 5462.692,
    "text": "However, there is a simpler way to recover the paths of least action by finding a path that minimizes Lagrangian at every point in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.773,
    "end": 5467.796,
    "text": "Noting from three that the path integral of the Lagrangian is the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5470.078,
    "end": 5472.84,
    "text": "First, they're going to reintroduce generalized coordinates of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5473.72,
    "end": 5486.888,
    "text": " So we talked about that in number 26 as well, but the generalized coordinates of motion are like the position, velocity, acceleration, and higher and higher and higher derivatives of the coordinates of location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5487.749,
    "end": 5494.774,
    "text": "So it's taking like the XY coordinates and adding their first derivative and their second derivative and their third derivative and just having that in a vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5495.334,
    "end": 5496.214,
    "text": "So that's what's shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5497.475,
    "end": 5501.418,
    "text": "X through time, the derivative of X, X prime is the flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5503.51,
    "end": 5528.801,
    "text": " second derivative the first derivative and so on that's the integrator chains pid control and so on in the generalized coordinates of motion state velocity acceleration and so on are treated as separate generalized states that are coupled through the jacobian so if the first and the second are related to each other in the second and third and third and the fourth there's a sparse coupling in that vector",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5530.097,
    "end": 5537.578,
    "text": " This allows us to relax certain assumptions and gives a quadratic form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.739,
    "end": 5550.061,
    "text": "We'll unpack this more, but there's a sparsity and a capacity to do modeling of movement in the generalized coordinates of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5550.421,
    "end": 5555.502,
    "text": "Now maybe three, maybe six are sufficient, but this is like an infinite dimensional framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5557.418,
    "end": 5561.181,
    "text": " but it may be the case that you can go super far with like just a few.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5564.563,
    "end": 5570.407,
    "text": "Formalisms 23 and 24 describe that M can be read as a mass matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.107,
    "end": 5573.229,
    "text": "That would be interesting to know what is meant there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5574.49,
    "end": 5581.534,
    "text": "And there's a suggestion that precise particles with low amplitude random fluctuations behave like massive bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5582.455,
    "end": 5585.037,
    "text": " So that's like the baseball on the parabola.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.658,
    "end": 5594.366,
    "text": "The air fluctuations and the thermal vibrations are not dominating its trajectory, but the one molecule baseball, it is getting tossed and turned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5595.427,
    "end": 5607.738,
    "text": "In equation 25 and 26, they continue describing using that Helmholtz decomposition, the divergence free flow and the curl free flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5609.494,
    "end": 5612.315,
    "text": " in terms of the gradient descent on a Lagrangian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.075,
    "end": 5615.036,
    "text": "That'll be helpful to learn what they mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5616.036,
    "end": 5622.079,
    "text": "And then crucially, when that is minimized, the mode of the path becomes the path of the mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.999,
    "end": 5627.241,
    "text": "That would be something useful to understand what is meant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5628.201,
    "end": 5633.103,
    "text": "What's the difference between tracking the mean and tracking the mode?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5634.623,
    "end": 5636.064,
    "text": "For Gaussian distributions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.199,
    "end": 5645.003,
    "text": " like the Laplace approximation or any other second-order curvature, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5646.344,
    "end": 5656.269,
    "text": "And then just to close this section, the generalized free energy is easy to evaluate, thankfully, given a generative model in the form of a state-space model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5659.291,
    "end": 5659.671,
    "text": "Here it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5661.312,
    "end": 5665.895,
    "text": "F of sense, action, and internal is going to be...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5667.307,
    "end": 5669.308,
    "text": " some terms that we'll learn about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5670.329,
    "end": 5677.633,
    "text": "And finally, one can simulate active inference by replacing the generalized flow of autonomous states with a generalized Bayesian filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5678.813,
    "end": 5679.514,
    "text": "So here we have 27.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5681.355,
    "end": 5691.24,
    "text": "Very similar, except notice that there's a lot more arrows and the bottom two, instead of 13,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.325,
    "end": 5723.686,
    "text": " we now have these bottom two rows with the d on a and the d on mu and some triangles have been introduced we'll unpack more what that means any thoughts or comments or we'll continue to seven so yeah awesome seventh from statistical to classical particles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.778,
    "end": 5729.341,
    "text": " So far, we have a Bayesian mechanics that would be apt to describe a particle or person with pullback attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5729.961,
    "end": 5732.502,
    "text": "But what is the difference between a particle and a person?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5735.744,
    "end": 5741.087,
    "text": "This speaks to distinct classes of things to which FEP could apply, molecular versus biological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.448,
    "end": 5742.808,
    "text": "Versus?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5744.844,
    "end": 5749.846,
    "text": " Here we associate biotic self-organization with precise and predictable dynamics of large particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5750.646,
    "end": 5759.37,
    "text": "So as we described earlier, if we were talking about classical mechanics, something bigger would be more resistant to thermal fluctuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5760.871,
    "end": 5765.313,
    "text": "We could think about that analogy to mass in the statistical setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5766.397,
    "end": 5778.544,
    "text": " Where are the priors like massive and they're just on their own inertia and they're not being buffeted by stochasticity versus where is it a lightweight something that is getting buffeted?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5780.005,
    "end": 5785.648,
    "text": "So here's going to be a distinction between statistical and classical mechanics in the setting of the particular partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5787.769,
    "end": 5793.953,
    "text": "It is often said that the FEP explains why biological systems resist the second law",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5794.861,
    "end": 5798.764,
    "text": " tendency towards disorder, and the natural tendency to dissipation in disorder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5799.605,
    "end": 5802.347,
    "text": "However, this is disingenuous on two counts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5803.468,
    "end": 5806.21,
    "text": "So is Friston 2013 disingenuous?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5807.15,
    "end": 5811.634,
    "text": "Or is that paper combating the disingenuity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.595,
    "end": 5824.524,
    "text": "First, the second law applies only to closed systems, while the free energy principle describes open systems in which internal states are exposed to in exchange with external states through blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5826.172,
    "end": 5827.273,
    "text": " A lot to unpack there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5827.513,
    "end": 5829.254,
    "text": "What exactly is the exchange?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5830.054,
    "end": 5831.895,
    "text": "Is it like an informational exchange?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.276,
    "end": 5837.918,
    "text": "Or are like nutrients crossing and becoming incorporated into the internal states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.259,
    "end": 5845.903,
    "text": "And second, there is nothing so far to suggest that the entropy of particular states or of paths is small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5847.341,
    "end": 5866.562,
    "text": " so this is like the design language for particular states that might be totally buffeted by stochasticity or totally on the least action railroad and everything in between but nothing has been said to identify um one or the other and so everything high and low entropy densities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5867.458,
    "end": 5870.419,
    "text": " So there's two particles in two different rooms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5871.059,
    "end": 5873.62,
    "text": "One particle is equally traveling to all parts of the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5874.1,
    "end": 5876.0,
    "text": "The other particle is staying in one part of the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5876.64,
    "end": 5886.223,
    "text": "So one of them has a very ordered distribution of space, and the other one has a very disordered equilibrium gas flowing throughout the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5887.523,
    "end": 5888.643,
    "text": "Both of them are particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5890.524,
    "end": 5893.925,
    "text": "So what distinguishes between high and low entropy systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5894.838,
    "end": 5895.138,
    "text": " e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5895.218,
    "end": 5923.436,
    "text": "between candle flames and concierges respectively 28 we could have had a concierge and that is going to describe that and we'll come back to it this suggests that precise particles such as you and me respond to environmental flows and fluctuations in a precise and predictable fashion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5924.343,
    "end": 5926.064,
    "text": " Well, I'm an unpredictable guy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5926.664,
    "end": 5939.151,
    "text": "Yes, in our regime of attention, it is almost like tuned to some maximally confusing or uninformative things, or we could have some cognitive experience of being confused, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.246,
    "end": 5966.579,
    "text": " someone's blood sugar through time has more predictability than zero so it's on that continuum from totally buffeted to totally on the railroad tracks and it's more like the railroad tracks if you want to survive or design high reliability systems and then they're going to introduce figures four five and six four is about the difference between generic and precise particles using an information diagram",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5967.776,
    "end": 5971.978,
    "text": " For precise particles, there's no uncertainty about autonomous states given sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5972.939,
    "end": 5974.159,
    "text": "Knowledge about action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5974.66,
    "end": 5977.001,
    "text": "Knowledge about internal states, like metacognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5979.822,
    "end": 5982.684,
    "text": "Is the behavior of precise particles sufficient for sentient behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5983.845,
    "end": 5984.205,
    "text": "Perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5985.966,
    "end": 5986.466,
    "text": "Figure 5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5987.126,
    "end": 5991.729,
    "text": "The implicit computational architecture used in simulations of sentient behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5992.768,
    "end": 5998.012,
    "text": " And six is reproducing an example from the act-inf literature with action and action observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5998.813,
    "end": 6007.239,
    "text": "So, figure four has to do with information gain and sharing with generic and precise particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6007.259,
    "end": 6009.761,
    "text": "Do you want to add anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6009.841,
    "end": 6012.243,
    "text": "Otherwise, we'll just take one look at each of four, five, and six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.184,
    "end": 6013.324,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.284,
    "end": 6021.39,
    "text": "Figure five, Bayesian mechanics and graphics summarizes belief updating implicit ingredient flows on variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6023.12,
    "end": 6026.342,
    "text": " And six, sentient behavior and action observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6027.262,
    "end": 6035.246,
    "text": "So this is like somebody involved in pointing or tracing or handwriting and also looking visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6038.447,
    "end": 6046.631,
    "text": "In summary, precise particles immersed in an imprecise world respond almost deterministically to external fluctuations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6048.041,
    "end": 6050.723,
    "text": " Why might this behavior be characteristically biological?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6051.483,
    "end": 6055.326,
    "text": "Precise particles may be the kind of particles that show lifelike or biotic behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6055.887,
    "end": 6057.808,
    "text": "So let's think of those two particles in the two rooms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6058.448,
    "end": 6065.513,
    "text": "One of them, 24 hours a day, no matter what the temperature is or what the light-dark cycle is, it's always equally covering all parts of the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6066.734,
    "end": 6074.74,
    "text": "The other particle, you find out that when it's light, it stays in this part of the room, and then when it's dark, it stays in this other part of the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.816,
    "end": 6080.539,
    "text": " which one of those particles without knowing anything more seems more biological?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.059,
    "end": 6091.466,
    "text": "The one that's diffusing like a gas molecule or the one that has this orderly distribution, especially one that's conditioned upon like salience external factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6092.666,
    "end": 6102.532,
    "text": "So the distinction between those imprecise and precise particles getting buffeted by thermal vibrations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6103.639,
    "end": 6129.55,
    "text": " or being like the classical like the kepler universe like the planets going around orbits totally unbuffeted by thermal vibrations rests on the relative contribution of dissipative and conservative flow to their path through state space one might associate precise particles with living systems with characteristic biorhythms and then they bring up many many nested biorhythms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6130.694,
    "end": 6140.433,
    "text": " from rapid oscillations that are multiple times per second in neural systems, heartbeat, respiratory, circadian, seasonal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6142.287,
    "end": 6165.687,
    "text": " life cycles even pulling out to the evolutionary angle turning this on its head one can argue living systems are a certain kind of particle that in virtue of being precise events conservative Dynamics biorhythms and time irreversibility so wow how are these all related to each other where does the time irreversibility connect and their summary",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6166.547,
    "end": 6177.574,
    "text": " The emerging picture is that biotic systems feature solenoidal flow in virtue of being sufficiently large to average away random fluctuations when coarse-graining their dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6179.395,
    "end": 6181.016,
    "text": "And figure six explores that more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6182.277,
    "end": 6187.54,
    "text": "Okay, final technical section eight, path integrals, planning, and curious particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6189.542,
    "end": 6193.905,
    "text": "The previous section was focused on linking dynamics, changes through time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6194.793,
    "end": 6196.414,
    "text": " to densities over generalized states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6197.454,
    "end": 6201.816,
    "text": "Internal states can be construed as parameterizing Bayesian beliefs about external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6202.736,
    "end": 6205.657,
    "text": "Internal states are about external states in this model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6206.717,
    "end": 6213.78,
    "text": "In what follows, we move from densities over states to densities over paths to characterize the behavior of particles in terms of their trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.62,
    "end": 6216.161,
    "text": "So, formalism 29.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6220.421,
    "end": 6229.47,
    "text": " We're interested in characterizing autonomous responses to initial particular states, autonomous, the action and internal states, the ones that we control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.452,
    "end": 6244.205,
    "text": "Recall that when random fluctuations on the motion of particular states vanish, there's no uncertainty about autonomous paths, given external and sensory paths, knowing exactly what to do and exactly what to think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6245.595,
    "end": 6260.141,
    "text": " and there's no uncertainty about sensory paths given external and autonomous paths, knowing exactly what senses will be observed given the external world and the autonomous paths, which is what one does and thinks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6262.341,
    "end": 6273.706,
    "text": "If we interpret entropies as the limiting density of discrete points, figure four, then the uncertainty about particular autonomous,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6274.966,
    "end": 6278.707,
    "text": " and sensory paths given external paths become interchangeable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6281.968,
    "end": 6282.428,
    "text": "Formalism 30.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6283.328,
    "end": 6283.809,
    "text": "Formalism 31.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6284.269,
    "end": 6285.769,
    "text": "Expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6288.77,
    "end": 6296.272,
    "text": "The autonomous path with the least expected free energy is the most likely path taken by the autonomous states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6297.733,
    "end": 6298.673,
    "text": "Expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6300.393,
    "end": 6300.994,
    "text": "How can we read it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6301.734,
    "end": 6302.194,
    "text": "What does it mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6303.442,
    "end": 6308.508,
    "text": " Why does it matter that we're focusing on autonomous states, autonomous paths?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6309.409,
    "end": 6318.761,
    "text": "And how is it similar or different from other representations that we've seen and that we will see of expected free energy and free energy of the expected future and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6321.824,
    "end": 6322.906,
    "text": "Expected free energy threats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6324.684,
    "end": 6330.949,
    "text": " where it can be regarded as a fairly universal objective function for selecting paths of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6331.61,
    "end": 6333.952,
    "text": "Planning, planning as Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6335.613,
    "end": 6342.159,
    "text": "Equation 33, expected free energy, expected action, Bayesian optimal decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6344.201,
    "end": 6345.742,
    "text": "Utility, pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6347.341,
    "end": 6371.72,
    "text": " expectations of information gain optimal info gain bay's optimal experimental design optimal hypothesizing so not just falsification not to beat a dead horse but rather than constraining and then executing keeping this infinite game optimal design perspective open so that we can always be here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6372.992,
    "end": 6377.595,
    "text": " of the balance between optimal decision-making and optimal experimenting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6379.977,
    "end": 6389.844,
    "text": "When simulating with active inference and planning afforded by path integral formulation, one usually works with discrete state spaces and belief updating over discrete epochs of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.665,
    "end": 6396.189,
    "text": "That's where the partially observable Markov decision process, POMDP, comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6397.109,
    "end": 6399.131,
    "text": "And plausible policies can then be scored",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6400.376,
    "end": 6406.942,
    "text": " evaluated based upon their expected free energy and the next action is selected from the most likely policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6407.202,
    "end": 6409.464,
    "text": "Policies are sequences of actions that can be taken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6411.306,
    "end": 6425.158,
    "text": "In summary, we now have at hand a way of identifying the most likely autonomous trajectory from any initial particular state that can be used to simulate sentient behavior of precise particles that we have associated with biotic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6426.434,
    "end": 6433.897,
    "text": " Expected free energy absorbs two aspects of Bayes' optimality into the same objective functional, which is a function with functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6435.318,
    "end": 6438.239,
    "text": "The information gain is optimal Bayesian design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6440.08,
    "end": 6446.383,
    "text": "Bayesian decision theory is minimizing the cost function under a decision or choice and uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6448.624,
    "end": 6450.845,
    "text": "As with the interpretation of variational free energy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6451.926,
    "end": 6462.489,
    "text": " This dual aspect functionality of expected free energy is an interpretation of a single existential imperative to possess a Markov blanket and implicit thingness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6463.629,
    "end": 6470.411,
    "text": "Teleologically, it's worth reflecting upon the differences between the generative models that underwrite variational and expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6471.731,
    "end": 6477.413,
    "text": "For VFE, the generative model is a joint density over external and particular states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6478.689,
    "end": 6501.639,
    "text": " supplied by or supplying the non-equilibrium steady-state density for the path integral formulation the generative model is a joint distribution over paths because consequences the generative model acquires a temporal depth they then have several figures that continue on this theme",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6502.742,
    "end": 6515.327,
    "text": " Figure seven is related to a DaCosta 2020 discrete state space synthesis paper showing special cases of variational and expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6516.028,
    "end": 6519.409,
    "text": "Like when there's no preference, there's optimal information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6520.109,
    "end": 6523.311,
    "text": "When there's no ambiguity, you get pure risk sensitive policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6524.073,
    "end": 6527.494,
    "text": " When there's no intrinsic value, you get expected utility theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6528.054,
    "end": 6542.516,
    "text": "And when there's no ambiguity or preferences, some recent work by Ramstad et al have started to soft reboot the FEP and connect it to the principle, which we're going to be looking forward to learning more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6543.496,
    "end": 6547.797,
    "text": "Figure eight is about Bayesian mechanics and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6548.317,
    "end": 6552.078,
    "text": "So we can contrast that with figure five, Bayesian mechanics and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6553.749,
    "end": 6556.25,
    "text": " Figure eight, Bayesian mechanics and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6557.691,
    "end": 6563.754,
    "text": "Figure nine is a simulation in which eye saccades are occurring, and we can explore this more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6566.695,
    "end": 6576.04,
    "text": "To the conclusion, there are many points of contact between what we described and other theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6577.16,
    "end": 6582.423,
    "text": "Please read the papes, discuss special cases,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6583.465,
    "end": 6604.905,
    "text": " discuss the mechanics of synchronization separation of time scale and applications and then in closing they write about how the developments are speaking to the shift in focus from the foundational issues addressed in this article to their applications learning and applying active inference and fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6605.956,
    "end": 6624.127,
    "text": " is quite possible that the foundational aspects of the free energy principle may also shift as simpler interpretations and perspectives reveal themselves that brings us to the end of the dot zero so brock what would you like to add or say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6633.749,
    "end": 6659.132,
    "text": " would like to add that for the next on zero i will be preparing my answer to this part first um ahead of time um i don't know just writing down a few things and thinking about um intractability and uncertainty and um possible kind of informational",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6660.854,
    "end": 6672.339,
    "text": " information entropy kind of questions that you could ask around that, like what makes those kind of ultimate Markov blankets of intractability?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6673.64,
    "end": 6680.763,
    "text": "Like how action intensive is it for information to cross?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6681.123,
    "end": 6687.306,
    "text": "Or for the external states to influence the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6690.31,
    "end": 6692.291,
    "text": " Indirectly influence the internal states, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6693.572,
    "end": 6698.175,
    "text": "And another question... How hard do you have to push on the blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6698.636,
    "end": 6699.736,
    "text": "What kind of push?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6700.157,
    "end": 6706.321,
    "text": "So yes, they're conditionally independent, but also they do influence each other via the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6706.441,
    "end": 6707.682,
    "text": "So how hard do you have to push?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6708.402,
    "end": 6710.364,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6711.304,
    "end": 6716.768,
    "text": "And it seems like, I guess what I'm saying is that the scale...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6718.995,
    "end": 6738.773,
    "text": " which we kind of you're using the particle people and the baseball analogy right and we talked about that yesterday or the day about like just a large you know matrix large space of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6740.094,
    "end": 6767.365,
    "text": " states of variables of you know um dimensions of of what you mean by a markov blanket in a particular you know and the scale of that markov blanket to the environment right um having like a big seeming to have a like a big impact on how hard you have to push there right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6768.636,
    "end": 6792.924,
    "text": " um the baseball's flying through the air but the particle is spreading out and you know being pushed around and yeah and i was like are we little molecules trying to push the baseball or are we the designated hitter who's way overpowered and able to put it wherever we want or are we just doing the tiniest buffeting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6794.162,
    "end": 6810.487,
    "text": " Maybe this is a design language that helps us frame both of those settings and recognize when are we able to be guiding the path of least action and where might, no matter how hard we yell, maybe we're not influencing it literally at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6812.147,
    "end": 6816.589,
    "text": "Or we're influencing it stochastically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6816.629,
    "end": 6817.029,
    "text": "It's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6817.769,
    "end": 6821.29,
    "text": "We can't concentrate our action into one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6823.132,
    "end": 6850.588,
    "text": " you know path right um one pet like so yeah there's i don't know there's a lot of um wonderings and questions that are like not uh probably very well informed to just read the papes on and continue reducing uncertainty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6852.518,
    "end": 6870.21,
    "text": " um yeah awesome work with this dot zero and thanks a ton for being a part of it thanks everybody for watching and all the great comments in the chat and we'll see you in the dot one and the dot two bye awesome thanks again see ya",
    "speaker": "SPEAKER_00"
  }
]