[
  {
    "start": 27.116,
    "end": 54.719,
    "text": " all right hello and welcome everyone it's act inf lab live stream number 45.1 it's june 1st 2022 welcome to the active lab we're a participatory online lab that is communicating learning and practicing applied active inference you can find us at the links here on the slide this is a recorded and an archived live stream so please provide us with feedback so we can improve our work",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 56.095,
    "end": 60.937,
    "text": " All backgrounds and perspectives are welcome, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 62.218,
    "end": 69.481,
    "text": "Head over to ActiveInference.org to find out more about what we're up to at the lab and participate if you'd like to get involved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 71.647,
    "end": 88.17,
    "text": " We're here in live stream number 45.1, and we're in our second discussion around this paper, The Free Energy Principle Made Simpler But Not Too Simple, by Fristin, DaCosta, Sajid, Heinz, Oldshofer, Pavliotis, and Parr.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 89.291,
    "end": 110.669,
    "text": " and the video just like all of them are is a introduction and an invitation for those who would like to ask questions in the live chat for those who would like to join us next week in the conversation and just to try to learn and unpack and understand this paper as well as seeing it as a starting point for the continued learning and applying that we're all involved in and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 113.151,
    "end": 121.557,
    "text": " We will just begin with some introductions and overviews, remind ourself where we've been in this paper, and then start to think about where we're going.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 122.338,
    "end": 130.184,
    "text": "And we'll see who joins, we'll see who asks questions in the live chat, and I guess where we go together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 131.755,
    "end": 148.31,
    "text": " So we can begin just by giving an introduction, saying hi, and mentioning anything like what's something that we're excited about, what's something that we liked or remembered about the paper, and what is something that we're wondering about or would like to resolve towards the end of the discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 149.011,
    "end": 150.312,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 150.532,
    "end": 154.656,
    "text": "I'm a researcher in California, and I'll answer the questions later.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 156.037,
    "end": 156.578,
    "text": "How about you, Blue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 157.682,
    "end": 158.042,
    "text": " I'm Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 158.122,
    "end": 163.848,
    "text": "I'm a researcher in New Mexico, and I don't know why I'm tasked with going first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 163.908,
    "end": 181.744,
    "text": "There's a lot of things that I think I would like to have resolved or a greater certainty about, like including the hierarchical nature of active inference and how mathematically that works out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 183.009,
    "end": 188.171,
    "text": " as well as like the time dependence and time independence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 189.451,
    "end": 196.273,
    "text": "And I'm curious about like, can, I don't know, we can get more into it later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 196.293,
    "end": 197.213,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 198.793,
    "end": 200.094,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 201.574,
    "end": 208.336,
    "text": "While people are filing in and getting their questions ready, let's take a look back at",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 209.226,
    "end": 217.19,
    "text": " Big question, kind of situate ourself in this paper and just recall also what the main sections are in the roadmap.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 218.67,
    "end": 221.932,
    "text": "So Brock and I worked together on 45.0.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 224.332,
    "end": 251.813,
    "text": " and we highlighted the big question just one way to ask it as what are the foundations of the free energy principle fep and what does it contribute and then also we can ask how is active inference related to fep and we drew from the abstract where they mentioned starting from a description of the world in terms of a random dynamical systems",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 252.794,
    "end": 257.116,
    "text": " and ending up with the description of self-organization as sentient behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 258.037,
    "end": 258.677,
    "text": "Greetings, Carl.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 262.759,
    "end": 263.2,
    "text": "How goes it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.801,
    "end": 269.343,
    "text": "I've just managed to get back in my house after being locked out by my son, but otherwise fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.504,
    "end": 272.305,
    "text": "You found an alternate policy approach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.165,
    "end": 275.967,
    "text": "I did, and some keys hiding underneath the bucket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.808,
    "end": 281.89,
    "text": "Would you say this paper is the key to the free energy principle, or what is the key?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 284.325,
    "end": 310.994,
    "text": " um this is which one's this this is the um the simpler one simple as possible uh made simpler but not too simple ah no there are simpler ones there are i hope there will be simpler ones so this is this is one route to the desired simplicity all right so what is this paper about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 312.179,
    "end": 315.5,
    "text": " What did you intend to do and how did you accomplish that in this paper?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 318.902,
    "end": 327.045,
    "text": "It was originally conceived as a brief summary of the particular physics paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.125,
    "end": 336.889,
    "text": "If you remember that one that's an archive, a very dense 100 page deconstruction of physics as we know it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.309,
    "end": 339.33,
    "text": "So this was meant to be a technical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.197,
    "end": 365.287,
    "text": " rehearsal and um focusing specifically on the free energy principle and the active inference part and was meant to be as simple as you could get it but as it was being written it became more and more complicated so now we're writing another one that's even simpler it was a technical rehearsal then it was a dress rehearsal and then before you knew it yeah um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.537,
    "end": 395.171,
    "text": " well there's many places to jump in but first thanks so much for joining and feel free to join and leave as works for you we were interested at the outset with the layout and the roadmap of the paper so you described how there's the introduction and then the following sections are topically arranged so how did these seven inner",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 396.354,
    "end": 419.386,
    "text": " sections come to be is that the seven islands in the island chain are there other topics how did you come to this order and these seven sections right are you posing the question to me i guess blue could go for it but maybe you could go first",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 421.506,
    "end": 427.451,
    "text": " So I can't see who else is here, so I'm not quite sure who else could speak to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.192,
    "end": 447.008,
    "text": "So from my point of view, as the author, it was exactly as you say, it was the stations en route from the basics or the basic assumptions of the free energy principle, which is basically the Langevin equation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.802,
    "end": 457.365,
    "text": " right through to the end, which is an account of sentient behavior meant in a very deflationary way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.425,
    "end": 477.331,
    "text": "So it was just the steps that you would need to take to go from a Langevin description of some system through to, first of all, defining systems of interest that had steady state solutions, and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 478.126,
    "end": 500.982,
    "text": " further thinking about the nature of thingness how you would distinguish a thing from something else and the implications of that distinction as articulated with a Markov blanket for the dynamics and various interpretations of those dynamics and of course the interpretation we use is that of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.344,
    "end": 531.864,
    "text": " self-evidencing or gradient flows that look as if they are the kind of gradient flows you would see in systems representing in a Bayesian sense the causes of their sensory inputs on their Markov blanket and then looking at special classes or types or kinds of particles and in particular the limiting case of large particles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.584,
    "end": 561.864,
    "text": " where the random fluctuations on the particular states, namely the Markov blanket and their internal states, tend to zero, essentially vanish, such that you are now describing things that have a classical aspect in the sense that you wouldn't need a sort of microscopic or quantum description, that they move and behave in accord with classical Lagrangian dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.464,
    "end": 584.198,
    "text": " and that has um some special put some special constraints on these gradient flows on the lagrangian or the surprisal um that is being read as a gradient flow while sharing the same minima as a gradient flow on variational free energy and that takes us then to the final move which is um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.525,
    "end": 601.247,
    "text": " what that would look like in terms of planning as inference and the articulating that in terms of expected free energy and then we stopped awesome blue anything to add or we can continue this line",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.895,
    "end": 612.281,
    "text": " I have a question that's like a burning question from reading this paper and listening to Carl talk and then also doing the textbook reading group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.501,
    "end": 620.326,
    "text": "I'm curious about the language, the causes of sensory inputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 621.146,
    "end": 624.428,
    "text": "I'm curious about this because you can see it in so many ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 624.448,
    "end": 628.431,
    "text": "I know that it's open to interpretation and depends upon the model of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 629.171,
    "end": 644.021,
    "text": " As someone from a neuroscience background, like the cause of my sensory input is like a 450 nanometer light wave or a pressure wave through air in terms in the sense of sound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 644.621,
    "end": 655.128,
    "text": "So when you think about the cause of the sensory input, like if there's a red balloon and I'm seeing red, like that's 700 nanometer light wavelength that I'm actually detecting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 655.988,
    "end": 659.031,
    "text": " But the balloon is missing from that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 659.391,
    "end": 662.814,
    "text": "And so I just wonder, why did you choose this term?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 662.914,
    "end": 664.436,
    "text": "Or do you mean it in a literal sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 664.576,
    "end": 666.398,
    "text": "Or is it supposed to be abstracted?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 666.838,
    "end": 674.365,
    "text": "Am I supposed to, you know, come away from the cause of my sensory input, come away from the red light and go more towards that's a red balloon?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 675.837,
    "end": 679.359,
    "text": " I would come away from the red light and go more towards the red balloon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.839,
    "end": 681.319,
    "text": "Would you excuse me for a second?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.4,
    "end": 684.981,
    "text": "But the son that lost me out is just knocking on the door because I stole his keys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.061,
    "end": 685.601,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.102,
    "end": 687.502,
    "text": "All good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.263,
    "end": 688.623,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.644,
    "end": 691.984,
    "text": "Move away from the red light.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 693.245,
    "end": 694.445,
    "text": "Away from the red light.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 697.607,
    "end": 698.287,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.728,
    "end": 705.01,
    "text": "So the notion or the use of the language causes...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.698,
    "end": 716.406,
    "text": " is used in a very broad sense in terms of carving up all variables into causes and consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.066,
    "end": 729.757,
    "text": "So very often when you talk in any modeling context, particularly in terms of the inversion of a generative model, people ask, what do you mean by inversion of a generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.297,
    "end": 731.979,
    "text": "Well, what I mean is a generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.845,
    "end": 738.206,
    "text": " is a probabilistic description of the joint occurrence of causes and consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.887,
    "end": 744.008,
    "text": "And usually the consequences are observable and the causes are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.268,
    "end": 747.909,
    "text": "So they're sometimes referred to as hidden causes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 749.109,
    "end": 757.751,
    "text": "So the generative model provides this description of the joint occurrence, probabilistic relationships between causes and consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.591,
    "end": 760.032,
    "text": "And the way that we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.897,
    "end": 771.319,
    "text": " or the way that one can understand sensations or sensory samples is as the consequences of some abstract causes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.219,
    "end": 778.401,
    "text": "But because the causes are hidden or unobservable, they can only be inferred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.481,
    "end": 783.062,
    "text": "So these causes now become random variables that can only be inferred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.252,
    "end": 793.296,
    "text": " It's from the point of view of a modeler, the forward model or the generative process would be a map from cause to consequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.257,
    "end": 796.478,
    "text": "But we only have available or at hand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.317,
    "end": 800.198,
    "text": " or on I, the consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 800.558,
    "end": 807.2,
    "text": "So we have to do the reverse mapping, which is the genesis of the notion of model inversion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.28,
    "end": 810.021,
    "text": "We have to map from consequences back to causes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.481,
    "end": 813.822,
    "text": "And that's basically the process of Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.322,
    "end": 815.863,
    "text": "So that's where the language comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.943,
    "end": 821.724,
    "text": "It's just sort of splitting the whole universe into two types of variables, causes and consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.344,
    "end": 824.145,
    "text": "When you move to the free energy principle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.305,
    "end": 836.908,
    "text": " as articulated in the particular physics paper, things become a little bit more nuanced because now you've got the consequences of external causes impressing themselves on the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.228,
    "end": 844.31,
    "text": "But you now also have internal states internal to the Markov blanket that are now doing the Bayesian model inversion effectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.77,
    "end": 852.492,
    "text": "But the causes are meant as a universal and very, very high dimensional or referred to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.632,
    "end": 870.282,
    "text": " a set of very, very high dimensional variables, external states out there that conspire through whole chains of causal links to produce the sensory consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.842,
    "end": 878.047,
    "text": "So I would subsume both the red balloon and the reflected and irradiant light and all of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.627,
    "end": 893.802,
    "text": " biophysics that causes your retinal cell to fire, that whole chain of causality will entail a whole series and possibly uncountable number of hidden causes in generating the consequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.842,
    "end": 897.126,
    "text": "And you have to work back through that chain and hence the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.208,
    "end": 905.112,
    "text": " the notion of hierarchical models that explicitly try to put that chain in place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.132,
    "end": 917.681,
    "text": "So one level of your hierarchical model, you have a red balloon and another level of the model you might have the consequences of that red balloon in the outside world, which would be, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.101,
    "end": 925.25,
    "text": " reflected light and passing through your optical machinery and impinging upon your retina.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.692,
    "end": 935.523,
    "text": "All of these things will be implicitly modelled or coarse-grained in your generative model so that you can solve the inverse problem, reconstruct the scene out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.204,
    "end": 937.844,
    "text": " given this is how you observed it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 938.284,
    "end": 943.786,
    "text": "Because how you observed it is specified in the generative model through a likelihood mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.046,
    "end": 949.287,
    "text": "So if I knew the cause, red balloon, what would it feel like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.567,
    "end": 950.447,
    "text": "How would I palpate it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.487,
    "end": 951.427,
    "text": "What would I observe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.787,
    "end": 961.749,
    "text": "And that whole likelihood model would entail all the mechanisms that you described as sound waves and pressure waves and photons and the like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.615,
    "end": 980.146,
    "text": " Just to conclude, another common word or phrase people use, certainly in machine learning, for this notion of causes that are unobservable, that they are effectively random variables because they are the support of a generative model which is specified as a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.766,
    "end": 982.207,
    "text": " is hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.847,
    "end": 984.928,
    "text": "Another word for this is latent states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 985.449,
    "end": 989.731,
    "text": "And I've been told off by some reviewers for using the word latent states, but I can't remember why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.811,
    "end": 994.513,
    "text": "So I've reverted to using them in exactly the same sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.294,
    "end": 1006.079,
    "text": "Latent states or hidden states are those unobservable variables that are distinguished from observable states or outcomes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.968,
    "end": 1029.913,
    "text": " measurements or or data so that's where the language comes from that's very helpful yeah it really helps me um because it's something that i've struggled with but to think about it a hidden cause in terms of a causal chain that leads to the observation that that's a very helpful um way for me to think about it thank you good",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1030.359,
    "end": 1046.745,
    "text": " Yeah, and also how hierarchical nesting of models, which we can come back to, it's like one model might be the unobserved is the temperature in the room and the observation is the number on the thermometer, but you don't really see the number, you see the light.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1047.105,
    "end": 1057.268,
    "text": "So then you could have a two-step model where the causes of the temperature are the shape of the thermometer and then the shape of the thermometer is what number it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1057.328,
    "end": 1059.509,
    "text": "And so depending on how much data",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1060.229,
    "end": 1081.588,
    "text": " the adequacy that's needed one could coarse grain and just say we're going to go from the hidden state to the observed inferred number or can start to parse that if there were degrees of freedom there let's maybe go through oh i just could say that's a nice example but yeah you could have a sort of a deep",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1083.604,
    "end": 1106.377,
    "text": " artifact or person or creature with you actually has a representation of temperature as the cause of the shape or the height of the thermometer or you could have a very um shallow artifact that just registers the height of the thermometer and i have in mind here the difference between a thermostat and me or you so we would know that you know we would represent and explain changes in the shape",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.542,
    "end": 1111.604,
    "text": " in terms of a change in temperature, because that's our model, and we would have a deeper model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.944,
    "end": 1113.065,
    "text": "But the thermostat might not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.445,
    "end": 1124.43,
    "text": "It might directly act upon the world simply because there are some quantitative single-valued scalar observable that is telling it to switch the radiator on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.81,
    "end": 1126.511,
    "text": "So it's a nice distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.531,
    "end": 1129.753,
    "text": "There's no rule which says how much core screening or how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.593,
    "end": 1154.545,
    "text": " much depth or hierarchical structure you bring to the table in terms of trying to explain what you can observe great let's go to quite early in the discussion in the introduction um elsewhere",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.441,
    "end": 1160.763,
    "text": " the tautology and the tautological aspects and the falsification have been explored.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1161.643,
    "end": 1165.784,
    "text": "So let's jump into a slightly different point, which is the utility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1166.585,
    "end": 1175.388,
    "text": "So there was a rhetoric in the paper, is such a description of the FEP being in this framework or principle like way?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1176.348,
    "end": 1178.489,
    "text": "And the answer was probably no.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1179.674,
    "end": 1196.933,
    "text": " there was a however so where do you see the utility of the fep and how does that come into play in the particulars for carl or blue maybe to you first blue goes first this time yes blue where have you seen utility in the fep",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1200.183,
    "end": 1213.421,
    "text": " I like that the FEP resolves so many very difficult things to model, or maybe it doesn't resolve it fully yet, but has the potential to resolve, is maybe a better way to put it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1214.542,
    "end": 1224.209,
    "text": " especially in terms of hierarchical modeling, also the balance between exploration and exploitation, complexity and accuracy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.47,
    "end": 1242.502,
    "text": "So I think that it's useful to describe circumstances where there's not always a single solution, but maybe a best solution, or how can we find the best solution, given what we know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.812,
    "end": 1273.224,
    "text": " okay what would you say carl where what was the function of this example with the principle of least action which we'll also want to explore but how is their utility in the fep how is their utility in the principle of least action and what is their relationship between fep and the principle of least action",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1274.929,
    "end": 1284.695,
    "text": " I think that Blue has provided the answer and it can be illustrated with Hamilton's principle of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.755,
    "end": 1303.286,
    "text": "So if I wanted to understand how a ball was thrown or understand its dynamics and its kinetics and the laws, the physical laws by which a ball or a massive body pursued a particular trajectory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.008,
    "end": 1328.019,
    "text": " then what i could do is to apply hamilton's principle of least action to the particulars of this situation the mass of the ball the initial conditions the um the wind resistance and everything else that i would need to know in order to predict the behavior and understand the mechanics that underwrote what actually unfolded so um if you sort of dumb down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.059,
    "end": 1346.844,
    "text": " lose aspiration to understand sentient creatures and the distinction or the relationship between exploration and exploitation, and just think about understanding the trajectory of massive bodies, what you will end up doing is appealing to a principle of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.384,
    "end": 1358.147,
    "text": "And all that says is these prescribe the lawful behaviors if you apply that principle to a particular situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.747,
    "end": 1373.878,
    "text": " So for us, as builders of sentient artifacts or neuroscientists trying to understand sentient creatures, what it says is that you have a principle at hand that allows you to build.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.622,
    "end": 1389.068,
    "text": " And if you can build an artifact that either resembles or reproduces the kind of behaviors that you're interested in studying, then you have a more formal understanding of the mechanics and how those artifacts or systems actually operate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.328,
    "end": 1390.248,
    "text": "Or you can simulate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.049,
    "end": 1396.491,
    "text": "Or you can build artificial intelligence systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.431,
    "end": 1400.833,
    "text": "So it's all in the pragmatic building of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1402.353,
    "end": 1428.903,
    "text": " something by applying the free energy principle to something and you may be asking well what is that something well it's a generative model so all the hard work starts not in understanding or deploying the free energy principle you know it's all the hard work is really specifying writing down the generative model apt to describe the kind of creature you're interested in or that you're the the system um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.011,
    "end": 1431.794,
    "text": " that you're trying to characterise and understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.115,
    "end": 1432.896,
    "text": "I'll just close by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.015,
    "end": 1464.202,
    "text": " nodding to, or giving a nod to, Richard Feynman here, because that whole, the motivation for application of the free energy principle, and in a sense the motivation for the free energy principle in and of itself, was just to realise or provide tools for realising the observation that was famously or purportedly on his blackboard at the time of his death, that you can't build something, you can't create it, you can't understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.722,
    "end": 1467.544,
    "text": " So to build it is to understand it and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.286,
    "end": 1471.427,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1472.308,
    "end": 1475.95,
    "text": "I'll ask one follow-up on Feynman, and then we have a great question in the chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1477.211,
    "end": 1484.556,
    "text": "What is variational inference as Feynman utilized it and as it's utilized in FEP and ACTIV?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1486.678,
    "end": 1493.523,
    "text": "Well, variational inference is generally read as a suite of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.102,
    "end": 1501.869,
    "text": " data analytic tools called variational Bayes that used to always also be called ensemble learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.889,
    "end": 1505.112,
    "text": "But I haven't heard that phrase in the recent years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.572,
    "end": 1507.474,
    "text": "So what is variational Bayes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.814,
    "end": 1512.419,
    "text": "Well, it's a form of approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.324,
    "end": 1516.586,
    "text": " which should be contrasted with exact Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.626,
    "end": 1519.708,
    "text": "So what's the difference between approximate and exact Bayesian inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.169,
    "end": 1533.617,
    "text": "The key difference is that you assume a functional form for the posterior beliefs that you're trying to update from your priors to the posterior beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.218,
    "end": 1540.362,
    "text": "Now, in assuming a functional form, you are going to depart from the actual true posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.902,
    "end": 1542.183,
    "text": "And it's that departure,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.648,
    "end": 1546.911,
    "text": " which renders the inference scheme an approximate Bayesian inference scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.572,
    "end": 1552.696,
    "text": "But what you buy for that approximation is tractability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.536,
    "end": 1566.126,
    "text": "So exact Bayesian inference cannot be realised physically, by which I mean it's mathematically intractable and also numerically impossible to do exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.841,
    "end": 1585.071,
    "text": " even if you have enormous sampling and you use sampling-based procedures like Metropolis-Hastings or Gibbs sampling, just open brackets is another way of approximating a posterior just with a large number of samples and sample density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.031,
    "end": 1594.456,
    "text": "So what's the fundamental importance of the move from exact Bayesian inference to approximate Bayesian inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.069,
    "end": 1615.327,
    "text": " namely variational inference, it's because you've assumed a functional form which makes your inference approximate, you can now analytically convert what is an impossible marginalization or integration problem into a tractable optimization problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.827,
    "end": 1617.168,
    "text": "So just to put some flesh on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.507,
    "end": 1645.71,
    "text": " if you wanted to use um if you wanted well let's take richard fireman's problem he was trying to work out the probability distributions over all the paths a small particle could take from some initial state to some final state now given the nature of the paths he had in mind there is a universe of an enormous and countable number of such paths which meant that any um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.747,
    "end": 1668.011,
    "text": " either analytic or numerical realization of these paths, meant that it was impossible to normalize the distribution by marginalizing or integrating over the distribution to work out the normalization constant, also known as a partition function, which you would need in order to specify the probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.691,
    "end": 1676.013,
    "text": "So when people talk about an intractable marginalization or integration problem, what they mean is for very high dimensional probabilities,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.237,
    "end": 1685.381,
    "text": " you cannot integrate under the unnormalized distribution to produce a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.962,
    "end": 1704.854,
    "text": "However, if you know the functional form, then you can create what's called an evidence bound or a variational free energy, which is always, for a physicist, always greater than the probability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.701,
    "end": 1733.02,
    "text": " the quantity that you want to estimate or marginalize the evidence that constitutes the result of that marginalization, also called the marginal likelihood, which means that if you can reduce that bound, you're guaranteed to find the minima that is always greater than the thing you actually want to minimize, which is usually the negative log marginal likelihood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.195,
    "end": 1738.998,
    "text": " which converts an impossible integration problem into a tractable optimisation problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1739.418,
    "end": 1741.539,
    "text": "And that's conceptually quite important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.1,
    "end": 1752.305,
    "text": "So what it means is that you are now converting effectively an inference problem, an exact Bayesian inference problem into an optimisation scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.825,
    "end": 1753.626,
    "text": "So now you have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.096,
    "end": 1759.519,
    "text": " a formal definition of the normative account of behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.559,
    "end": 1767.984,
    "text": "You can now talk about inference as an optimization procedure where you're optimizing a well-defined objective function that is the variational free element.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.244,
    "end": 1769.424,
    "text": "Why variational?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.725,
    "end": 1775.668,
    "text": "Well, very simply, given the functional form of your approximate posterior,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.599,
    "end": 1805.173,
    "text": " And given the functional form of the bound on the marginal likelihood or the negative log marginal likelihood, to be more precise, you then use the calculus of variations to demonstrate that this is indeed a bound and thereby you can perform a gradient descent or you can find the minima analytically as part of that optimization scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.475,
    "end": 1819.698,
    "text": " So the variational Bayes just means you're using the calculus of variations to license the use of a particular approximation to the posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1823.799,
    "end": 1824.98,
    "text": "Welcome, Thomas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1825.28,
    "end": 1826.1,
    "text": "Thank you for joining.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1827.18,
    "end": 1830.461,
    "text": "Would you like to say hi or give any overview?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1830.701,
    "end": 1833.802,
    "text": "I can continue with the question or please feel free to take it in any direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1836.592,
    "end": 1837.913,
    "text": " Well, thank you for inviting me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.153,
    "end": 1842.955,
    "text": "I don't have any particular comments at the moment because unfortunately I missed the start of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.015,
    "end": 1844.195,
    "text": "Apologies that I joined late.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.456,
    "end": 1846.817,
    "text": "Perfect.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1847.037,
    "end": 1850.558,
    "text": "Well, I'll go to the question that was in the chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1851.058,
    "end": 1861.383,
    "text": "So this was asked by Jax in relationship to our discussion about the balloon example and the thermometer example with hidden causes and observed consequences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1862.617,
    "end": 1888.517,
    "text": " is this all in the service of homeostasis so how can we connect what we've been talking about with this causal bayesian framework and the variational inference to the idea of homeostasis and survival for cognitive entities as per tradition we could go to blue or thomas if you'd like to jump in on that no please go ahead",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1889.773,
    "end": 1893.277,
    "text": " You have to give Thomas a few minutes to settle in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.018,
    "end": 1896.741,
    "text": "Daniel, I'm deflecting that question back to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1896.781,
    "end": 1899.024,
    "text": "So you've dodged every question so far today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1899.404,
    "end": 1900.966,
    "text": "So we're going to let Daniel answer this one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1900.986,
    "end": 1901.447,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1904.167,
    "end": 1919.02,
    "text": " So just to give a first thought, so we just heard about how variational free energy calculation is converting an impossible integration problem to attractable optimization and a gradient descent that's through time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1919.961,
    "end": 1938.207,
    "text": " and so if we were trying to stay within homeostatic bounds for temperature or for blood sugar or some other vital parameter and we found ourselves anywhere but exactly on the one target location so we're some divergence away from a set point",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1940.359,
    "end": 1961.955,
    "text": " number of paths that we could take back to get to our set point or to get to the range of comfort just like feynman's particles the number of paths we could take would be infinite like in the blood sugar example you could change the regulation of every single gene in every single possible combination so the number of paths and microstates would be very large",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1963.308,
    "end": 1977.023,
    "text": " variational inference and planning as inference would give us a way to, in an unfolding through time way, functionally optimize and return to homeostasis",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1979.153,
    "end": 2008.332,
    "text": " rather than waiting on the sideline for this intractable integration to occur we could start moving in a direction that's more like a ball rolling to the bottom of a hill or like a molecule descending to a gibbs free energy attractor but in some other space that we're doing inference in maybe blue next",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2009.821,
    "end": 2011.422,
    "text": " We'll go from least knowledge to most.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2016.083,
    "end": 2016.963,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2016.983,
    "end": 2018.124,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2018.184,
    "end": 2024.466,
    "text": "Homeostasis, I think there's always... So we started off by saying...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2027.69,
    "end": 2030.613,
    "text": " what exists or if you exist, what must you do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.713,
    "end": 2030.933,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.973,
    "end": 2033.255,
    "text": "Like, so the paper starts off saying this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2033.676,
    "end": 2040.442,
    "text": "So if something exists, what does it, what must it do rather must, what must something do in order to exist?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2040.522,
    "end": 2041.903,
    "text": "So it starts with the reverse of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2041.963,
    "end": 2044.786,
    "text": "And I think homeostasis is like the most, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2045.583,
    "end": 2054.968,
    "text": " driving force behind life, which goes back to the life as we know it paper and also a particular physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2056.008,
    "end": 2058.67,
    "text": "So what must something do in order to exist?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2058.77,
    "end": 2067.534,
    "text": "Something biological must maintain this non-equilibrium steady state density of homeostasis because if you don't, then you die.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2068.014,
    "end": 2070.796,
    "text": "So equilibrium in a living system is death.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2074.317,
    "end": 2081.84,
    "text": " Fundamentally, I think that it does come back to homeostasis, yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2090.423,
    "end": 2090.744,
    "text": "Thomas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.924,
    "end": 2093.205,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.465,
    "end": 2094.985,
    "text": "I think I've got my bearings now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.334,
    "end": 2123.872,
    "text": " I think homeostasis is always quite an interesting comparison or thing to relate back to variational inference and the free energy principle and for me part of the reason for that is that homeostasis is really just the observation that sensor values tend to live in some particular space over time or some particular distribution and so it's more when we talk about homeostatic bounds what we're talking about really are just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.792,
    "end": 2128.975,
    "text": " a description of how things tend to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.995,
    "end": 2140.402,
    "text": "And coming back to this question about inverting this question of how things have to exist and going in reverse and saying, well, it does exist and it exists in this form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.942,
    "end": 2141.903,
    "text": " How does it then do it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.765,
    "end": 2148.469,
    "text": "We're sort of starting when we talk about homeostasis from the principle that we are in this range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.769,
    "end": 2156.556,
    "text": "And traditionally you then talk about negative feedback type mechanisms, reflexive correction of deviations from some set point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.396,
    "end": 2169.963,
    "text": " But you could also see that as exactly the process of maintaining some steady state density over time, of climbing probability gradients exactly as you would for variational inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.124,
    "end": 2180.169,
    "text": "And when you look at things in that framing, and particularly because in homeostasis we're normally dealing with sensor values, whether those be Bayer receptors or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.35,
    "end": 2185.914,
    "text": " measures of blood glucose and that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.215,
    "end": 2202.948,
    "text": "We're really dealing with a probability distribution over some sort of sensory data here, predominantly interoceptive data, which is effectively a marginal likelihood once you then equip it with a model of how those sensor variables are generated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.909,
    "end": 2220.807,
    "text": " And so one of the things that's useful in terms of taking it from homeostasis to variational inference or putting it in the realm of the free energy principle is it then asks you to try to formulate the sort of generative model you'd need to be able to explain those data and therefore to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.448,
    "end": 2225.589,
    "text": " optimize your own internal environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.03,
    "end": 2239.134,
    "text": "And that's, I think, where a lot of the interesting neuroscience comes in, where you try to build the models that the brain might use and then invert as the process of performing autonomic reflexes and the like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.836,
    "end": 2245.157,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2246.177,
    "end": 2248.878,
    "text": "Carl, anything to ask or we can continue with other questions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2250.317,
    "end": 2255.399,
    "text": " No, just very briefly, just to reinforce the last two answers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.82,
    "end": 2265.704,
    "text": "The question is an excellent question, because in a sense, the free energy principle is just about describing things that have a generalized homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.721,
    "end": 2269.603,
    "text": " So it's not saying, how would you implement homeostasis?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.724,
    "end": 2275.188,
    "text": "It's saying that our universe seems to be populated with things that possess a homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.609,
    "end": 2279.872,
    "text": "So what behaviors must they, what principles must they conform to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.892,
    "end": 2283.295,
    "text": "So, you know, it's a very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.036,
    "end": 2291.442,
    "text": "In this notion of generalization, we just heard generalized homeostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2292.203,
    "end": 2295.145,
    "text": "And I'd like to ask how it's connected to two other generalized homeostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2295.987,
    "end": 2323.799,
    "text": " generalized synchrony and generalized coordinates of motion and if there's any other generalizations we can add those but how might this notion of generalized homeostasis be related to generalized synchrony for one entity or in communicating ensembles and then the notion of generalized coordinates of motion",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2331.784,
    "end": 2332.804,
    "text": " Shall I take that one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.645,
    "end": 2335.205,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.165,
    "end": 2337.346,
    "text": "Shall I take that one first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.746,
    "end": 2343.407,
    "text": "I think there's a very close relationship between the notion of generalized synchrony and the notion of homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.468,
    "end": 2357.772,
    "text": "And by generalized, I just mean the same tendency to keep states that matter, sometimes referred to as essential variables in the cybernetics literature, within certain bounds or within viable domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.065,
    "end": 2367.079,
    "text": " If you wanted to describe that process as a systems, dynamical systems theory, what you would be saying is that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.492,
    "end": 2389.193,
    "text": " trajectories through some state space are limited to a relatively small attracting set and the smallness of that attracting set defines the bounds or the range that characterizes that particular system so for you and i we have quite narrow bounds say on our temperature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.674,
    "end": 2398.745,
    "text": " and that just means that our dynamics keeps us within or close to those set points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.286,
    "end": 2406.396,
    "text": "So from a point of view of the dynamicist, understanding the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.094,
    "end": 2410.617,
    "text": " dynamical behavior of two systems that are coupled to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.657,
    "end": 2422.728,
    "text": "And these can either be a creature or a particle and its embedding niche or environment or the external states, or there could be two similar particles in dyadic interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.289,
    "end": 2451.43,
    "text": " the way that if they are coupled and they are both restricted to a small set of states or paths that they relative to the the total number of states or paths that they could pursue or occupy then they're said to have a generalized synchrony technically it means that i can predict how i will move given your state and vice versa so i think there is a very close",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.173,
    "end": 2465.881,
    "text": " formal relationship between the notion of generalized synchrony and homeostasis of the kind that is accountable to the coupling between one system and another system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2466.622,
    "end": 2472.725,
    "text": "Generalized coordinates of motion, I think, are meant in a slightly more technical sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.165,
    "end": 2475.467,
    "text": "So in order to understand the dynamics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.207,
    "end": 2497.614,
    "text": " So to move from a description of things in terms of where they are in some state space, say your temperature, and now to understand the processes that keep you at a certain temperature, then you have to talk about the rate of change of temperature or the paths in a state space where one dimension or coordinates of that state space is temperature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.294,
    "end": 2501.275,
    "text": " So how would you describe mathematically paths?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.695,
    "end": 2524.885,
    "text": "Well, you could just have a long list of states as an increasing function of time, or there's a more compact way of describing a path, which is effectively to use a Taylor expansion and describe it with a list of coefficients of that Taylor expansion, which turn out to be the state you're in at the moment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.802,
    "end": 2532.387,
    "text": " your velocity, your acceleration, your jerk, and all higher order temporal derivatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.088,
    "end": 2543.176,
    "text": "And if you go to an infinite number of temporal derivatives, you can now reconstruct using that Taylor expansion, your trajectory into the future and into the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.756,
    "end": 2548.02,
    "text": "So generalized coordinates of motion are just the observation that you have to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.68,
    "end": 2574.636,
    "text": " describing or more precisely in defining the support of a probabilistic description of a system if you want to describe the paths then you just augment the state with all its higher order temporal derivatives and that's called generalized coordinates of motion interestingly should be slightly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2577.213,
    "end": 2582.936,
    "text": " disambiguated from the way that people use generalized coordinates in physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.516,
    "end": 2594.782,
    "text": "So that's usually read as basically thinking about a complete description of the system just in terms of the state and its first order temporal derivative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.802,
    "end": 2603.807,
    "text": "So you'll come across, for example, in mechanics, p and q, so momentum and position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.328,
    "end": 2615.013,
    "text": " So if you're in quantum physics, you'll be dealing with real and imaginary parts of a particular variable or a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.139,
    "end": 2622.701,
    "text": " The important observation here is that you've got more than one variable to describe what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.622,
    "end": 2627.323,
    "text": "And this, if you like, is the simplest kind of generalized quants of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.383,
    "end": 2631.925,
    "text": "So it's basically x and x prime or the rate of change of x or x dot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.306,
    "end": 2641.79,
    "text": "But you can extend that notion ad infinitum to create a Hilbert space or an infidimensional space where one point in this infidimensional space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.668,
    "end": 2671.777,
    "text": " encodes or stands in for mathematically represents an entire trajectory or path and that's a formalism that in fact the free energy principle is actually articulated in in terms of path integral formulations awesome thomas would you like to add anything there it's difficult to know what to add to such a comprehensive description um i suppose one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.409,
    "end": 2681.777,
    "text": " and perhaps this is more a question for Carl, but you mentioned the idea that a Taylor expansion is a more compact way of describing the trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.797,
    "end": 2685.821,
    "text": "I was wondering whether that's necessarily true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.841,
    "end": 2688.964,
    "text": "I appreciate it would be if the trajectory is relatively simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.405,
    "end": 2712.691,
    "text": " but you could argue that you need a very large number of Taylor's coefficients to be able to adequately describe a more complex trajectory, complex in the sense of nonlinear, whereas it may be simpler in some circumstances just to have a series of discrete temporal points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.791,
    "end": 2715.972,
    "text": "Yep, excellent question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.809,
    "end": 2729.116,
    "text": " Yeah, it speaks to when I or people like me talk about compact, where sort of implicit in that statement is the notion of some truncation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.877,
    "end": 2736.462,
    "text": "And certainly one truncation of the kind you just mentioned would be having a discrete set of points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.802,
    "end": 2739.464,
    "text": "But if you wanted to represent the entire path,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.256,
    "end": 2744.58,
    "text": " you're obliged to write down an infinite number of numbers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.9,
    "end": 2756.391,
    "text": "You can either write an infinite number of states as time moves forward or backwards, or you can write down an infinite number of Taylor coefficients or generalized coordinates of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2759.782,
    "end": 2765.187,
    "text": " certainly generalised courts of motion in and of themselves don't afford any compactness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.788,
    "end": 2771.514,
    "text": "But when you actually apply these different kinds of representations, practically speaking,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.33,
    "end": 2801.352,
    "text": " then there are two kinds of truncations that now present themselves if you're dealing with continuous time trajectories so that your path is now described as a function of time you normally have to truncate it by specifying t equals zero and some horizon in the future you know the initial and the final state so there's a choice there that you have to make in order to deal um practically or numerically indeed some instances um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2802.533,
    "end": 2807.596,
    "text": " analytically with a path by truncating its length in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.217,
    "end": 2821.106,
    "text": "The equivalent truncation in generalized coordinates of motion is in terms of a discrete bound or upper limit on the number of the generalized coordinates or order of the temporal derivatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.586,
    "end": 2823.427,
    "text": "The nice thing, the compactness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.648,
    "end": 2852.573,
    "text": " comes in generalized coordinates in that there's a natural there's a natural space in which you can do that truncation and that comes from the fact that as you increase the order of the temporal derivatives or the order of the generalized coordinates of motion because the variance of the random fluctuations on the higher order motion gets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.3,
    "end": 2854.941,
    "text": " large very, very quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.642,
    "end": 2868.227,
    "text": "You can assume that after a certain number of generalised coordinates or orders of generalised coordinates of motion, the precision is effectively zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.787,
    "end": 2874.97,
    "text": "So that means that you can get away with describing an infinitely long trajectory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2875.899,
    "end": 2882.583,
    "text": " with a small number of generalised coordinates because there's no further information in the higher orders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.044,
    "end": 2886.266,
    "text": "So it now becomes like a local description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.766,
    "end": 2905.178,
    "text": "But in that locality, it becomes compact in the same way that you would discretely change the length of the time series or the path in a function of time formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2906.477,
    "end": 2908.661,
    "text": " So practically what tends to happen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.932,
    "end": 2913.174,
    "text": " And it has to happen in the sense that the random fluctuations have to be fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.574,
    "end": 2916.815,
    "text": "Therefore, they have quite a narrow autocorrelation function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.296,
    "end": 2925.56,
    "text": "And the shape of the autocorrelation function determines how quickly the precision of higher order motion decreases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.96,
    "end": 2937.806,
    "text": "So generally speaking, even for quite smooth random fluctuations, you don't need generalized orders of motion beyond about four to six orders of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2938.086,
    "end": 2939.447,
    "text": "So just practically speaking,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.838,
    "end": 2943.2,
    "text": " then you now have a compact representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.501,
    "end": 2952.029,
    "text": "But in doing that truncation, you now can no longer roll out the path using the Taylor approximation to t equals infinity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.67,
    "end": 2958.856,
    "text": "You can only roll it out with confidence for a relatively shorter period of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.255,
    "end": 2966.143,
    "text": " It's not defined precisely because, of course, you're defining it probabilistically because you've got random fluctuations in play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2967.104,
    "end": 2972.31,
    "text": "So it has a sort of soft locality associated with it, but only when you do the truncation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2975.314,
    "end": 2975.594,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2977.089,
    "end": 3002.311,
    "text": " ask a follow-up on the taylor series especially in spm the statistical parametric mapping there's discussion of the volterra series so what is the volterra series how is it different from the taylor series and what are they doing does blue want to take this ocean thomas ever go",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3004.751,
    "end": 3009.552,
    "text": " I can have a go, but I think that's a bit before my time being involved with SPM on the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.372,
    "end": 3022.435,
    "text": "As I understand it, it's more a kernel-based representation of dynamics where you're looking at convolution with particular kernels over time as an expression of how dynamics might evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.315,
    "end": 3027.596,
    "text": "Beyond that, I think I'll probably have to refer back to Carl to answer that one in any detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.017,
    "end": 3050.031,
    "text": " i'm asking to understand a little bit of the history of the movement from focusing on the taylor and the volterra to only seeing the taylor series in the current paper we're discussing so but thomas is uh absolutely right the the volterra series is a way of describing um uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3051.644,
    "end": 3060.026,
    "text": " convolution operators that are an equivalent description of your equations of motion in terms of convolution kernels of increasingly high order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.846,
    "end": 3076.211,
    "text": "But Daniel, you're also absolutely right implicitly in the sense that a Volterra kernel expansion just is a functional Taylor approximation to any given dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.231,
    "end": 3076.271,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.449,
    "end": 3087.157,
    "text": " What's the difference between a Taylor expansion of a path of a function and a functional, a functional approximation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3087.657,
    "end": 3093.623,
    "text": "And it just it's using exactly the same technology, but now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.705,
    "end": 3123.699,
    "text": " expanding the or applying the Taylor approximation to the equations of motion so the functions that determine the flow of the system so you're applying a Taylor approximation to the flow operators or the equations of motion but the spirit of the expansion is exactly the same as a standard Taylor expansion I don't think we need to know much more about it really in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.824,
    "end": 3134.411,
    "text": " The Volterra series expansion is another way of providing a compact description, compact in the sense you truncate the Taylor expansion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.794,
    "end": 3149.604,
    "text": "In the same way we were just describing truncating the order of generalized coordinates of motion to get a compact representation and in some instances a compact inversion scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.16,
    "end": 3162.57,
    "text": " So normally when people actually apply, and certainly as we apply in a practical data analysis context Volterra series, we generally don't worry about very high order terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.631,
    "end": 3166.814,
    "text": "And in fact, all our software is written just to deal with first and second order terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.834,
    "end": 3176.562,
    "text": "So we actually stop at the second order, second order derivatives or functional derivatives, which is, you know, even simpler than the, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.684,
    "end": 3185.706,
    "text": " stopping at the fourth or the sixth order in terms of expressing the original variables in generalized coordinates of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.738,
    "end": 3206.085,
    "text": " But because it's really a device that just represents a differential equation in terms of convolution operators and kernels, it doesn't really get you anywhere in terms of understanding the mechanics or the theory behind it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.505,
    "end": 3209.966,
    "text": "So there is nothing in the free energy principle that refers to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.706,
    "end": 3227.385,
    "text": " the Volterra series expansion, but you could always derive a Volterra series expansion and the implicit kernels to a certain order, given some differential equations at hand, and if those differential equations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.105,
    "end": 3234.907,
    "text": " are doing a gradient descent on free energy, such as in a Bayesian filter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.927,
    "end": 3249.031,
    "text": "You could always articulate a Bayesian filter in terms of a convolution operator, which might be one way of understanding how Bayesian smoothing and Bayesian filtering operates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.312,
    "end": 3250.932,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3251.052,
    "end": 3254.733,
    "text": "We're deconvolving and adding action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3255.64,
    "end": 3262.948,
    "text": " in many, many layers and adding more depth to the deconvolution and to the planning and inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3263.769,
    "end": 3264.009,
    "text": "Blue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3266.612,
    "end": 3273.839,
    "text": "So speaking of convolution, I have a follow-up question that's maybe a little bit convoluted or hopefully I can articulate it well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3274.969,
    "end": 3295.526,
    "text": " So when we're talking about, in the very beginning of the paper, you talk about the Fokker-Planck equation, and then you talk about the path integral formation, and the Fokker-Planck encompasses random fluctuations, and then the path integral formulation encompasses the trajectory of a particle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3296.13,
    "end": 3302.454,
    "text": " And we talked about, or you talked about the like fast path and the slow path and the fucker paint fucker plank is fast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3302.994,
    "end": 3304.555,
    "text": "And then the path integral is slow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3305.215,
    "end": 3309.077,
    "text": "So I just want to kind of try to wrap my mind around what happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3310.198,
    "end": 3312.799,
    "text": "Like for atoms inside of my cells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3313.039,
    "end": 3313.26,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3313.3,
    "end": 3315.621,
    "text": "There, the, the density is over States.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3315.681,
    "end": 3319.143,
    "text": "Like the atoms can occupy excited States or any number of States.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3320.281,
    "end": 3322.663,
    "text": " but the cells are really the ones doing the work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3322.723,
    "end": 3324.765,
    "text": "The motion is happening inside of cells.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3324.805,
    "end": 3329.128,
    "text": "So that's kind of the slow, the slow procedure, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3329.149,
    "end": 3330.069,
    "text": "The path integral path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3330.289,
    "end": 3333.192,
    "text": "But then when you think about the cells, they're in my body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3333.592,
    "end": 3336.975,
    "text": "So the cells that are occupying the states and I'm doing the moving around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3337.295,
    "end": 3338.676,
    "text": "So then I'm on the trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3338.696,
    "end": 3347.043,
    "text": "And similarly, like I am in any number of states with all the rest of the humans on planet earth, we're all in any number of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3347.483,
    "end": 3350.146,
    "text": " Like we could be any number of places, but they're all on planet Earth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.566,
    "end": 3353.409,
    "text": "And then planet Earth is moving at a slower trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3353.609,
    "end": 3366.803,
    "text": "So what is the math kind of or can you guess or maybe foreshadow how the math compresses or unfolds in this kind of hierarchical situation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3372.202,
    "end": 3373.805,
    "text": " So Thomas has to answer that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.285,
    "end": 3376.589,
    "text": "And he has to use the word renormalisation group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3377.65,
    "end": 3378.652,
    "text": "I thought you might say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.033,
    "end": 3381.917,
    "text": "I was going to try and do it without, but now that you've said that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.937,
    "end": 3382.037,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.25,
    "end": 3401.227,
    "text": " Just to start with, I mean, you mentioned this problem to start with in the context of the Fokker-Planck equation and the path integral formulations and looking at that sort of distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.349,
    "end": 3410.358,
    "text": " which I think is interesting when thinking about fast and slow, but is to some extent orthogonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.718,
    "end": 3417.026,
    "text": "I think it's interesting when thinking about fast and slow in that you might expect that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.704,
    "end": 3437.28,
    "text": " the Fokker-Planck equation describing the rate of change or the evolution of some probability density is going to be a slower evolution than the evolution of sort of individual particles that might be described by the stochastic differential equation or Langevin equation of that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.901,
    "end": 3444.887,
    "text": "There may be very fast fluctuations but really what we're dealing with when we're dealing with the Fokker-Planck equation is some summary statistics, some slower",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.647,
    "end": 3450.91,
    "text": " a change over time that might be reflective of a mean or a variance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.871,
    "end": 3468.12,
    "text": "That does link back then into the idea of a renormalization group, which is a way of describing how things at one temporal scale can be summarized in terms of some slower changes and some faster changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.201,
    "end": 3482.511,
    "text": " Typically, the way you might do that in a dynamical system setting would be to look at the Jacobian, which is a linearized version of the flow equation, and look at the eigenvalues and eigenvectors of the flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.771,
    "end": 3496.641,
    "text": "And the eigenvalues tell you how quickly the system is either expanding or contracting or how quickly it's decaying in one direction or in unstable systems going off towards infinity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.641,
    "end": 3508.764,
    "text": " And that means that if you take the set of eigenvalues, they will tell you a series of different directions that the system is changing in and the speed with which they're changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.344,
    "end": 3521.167,
    "text": "That means that you can choose at some point at which or some threshold above which the eigenvalues are considered slow and below which they're considered fast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.447,
    "end": 3522.787,
    "text": "And I got that the right way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.187,
    "end": 3524.948,
    "text": "I have as long as they're negative eigenvalues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3526.048,
    "end": 3534.235,
    "text": " Those eigenvalues are each associated with an eigenvector, which is just a way of expressing some linear combination of the components of that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.555,
    "end": 3542.562,
    "text": "Or you could think of it as a direction in some high dimensional space that describes the position of that system at any one time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.173,
    "end": 3557.539,
    "text": " By separating things out or separating out the eigenvectors and the particular directions based upon whether their eigenvalues are large or small, you can separate the system out into its components that move very slowly and decay very rapidly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.559,
    "end": 3560.92,
    "text": "Oh, sorry, that move very slowly and those that decay very rapidly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.023,
    "end": 3577.771,
    "text": " And that's effectively the principle that the renormalization group works on when applied to these kinds of systems, because it then says that if we have some way of describing all the things in that system, we separate them out into the fast and slow components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.871,
    "end": 3581.793,
    "text": "We can then say, well, let's just look at the fast components, find some new way of grouping them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.013,
    "end": 3591.839,
    "text": " and then look at the fast components of that or the slow components of that and continue separating it out hierarchically to multiple different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.719,
    "end": 3601.885,
    "text": "And that can be quite interesting in a range of settings to think about the emergent behavior you might get at higher and higher levels when the dynamics of the lower level might be a very simple description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.686,
    "end": 3622.722,
    "text": " And I think that's probably what you were getting at when you were talking about the sort of very fast movement of atoms in your cells versus the slightly slower movement of yourself and the even slower movement of things that are much larger and evolve over a much larger timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.442,
    "end": 3632.01,
    "text": "You could read each move from one timescale to the slower timescale as an application of a renormalization group operator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.654,
    "end": 3635.154,
    "text": " Is that enough?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.294,
    "end": 3639.175,
    "text": "From your perspective, Carl, have I said the words renormalization group enough?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.675,
    "end": 3642.515,
    "text": "Yes, you have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.555,
    "end": 3643.216,
    "text": "That's excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.256,
    "end": 3643.736,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.836,
    "end": 3647.336,
    "text": "Interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3647.456,
    "end": 3658.598,
    "text": "I just wrote down, Thomas, when you said thinking about fast and slow, and that plays into this meta-Bayesian cognitive systems on cognitive systems angle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3659.638,
    "end": 3661.759,
    "text": "Any entity might be thinking fast and slow,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3662.796,
    "end": 3683.802,
    "text": " famous work but this is thinking about the fast and the slow maybe of a cognitive entity and maybe that's multi-scale so i'm going to bring another question into chat and then we'll be continuing on what type of boundary does a markov blanket define for a system",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3684.946,
    "end": 3690.909,
    "text": " functional in terms of ports or constructive and modular with interfaces?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3691.729,
    "end": 3695.551,
    "text": "Or might both viewpoints be considered depending on modeling reasons?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3702.815,
    "end": 3707.017,
    "text": "I think for me, you may have to unpack what some of those terms mean a little bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.197,
    "end": 3713.54,
    "text": "When you're talking about ports and whether they're constructive, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.147,
    "end": 3719.468,
    "text": " It was a question from the chat, so I'll try to unpack and see what you think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3724.69,
    "end": 3732.672,
    "text": "Perhaps even a general question would be, what is the physical interpretation of these Markov blankets that are being identified?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3733.712,
    "end": 3742.055,
    "text": "Are they causal or functional connections that occur across an interface, like a USB port?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3743.772,
    "end": 3746.756,
    "text": " Or are they the interfaces themselves?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3750.38,
    "end": 3759.53,
    "text": "Or in what viewpoints exist to interpret the Markov blankets in terms of the modeling of some defined system of interest?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3765.791,
    "end": 3773.187,
    "text": " It's an interesting question at quite a few levels, and I think you could probably unpack each of those terms in several different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.019,
    "end": 3786.541,
    "text": " I guess the first thing to do is think about how we define a Markov blanket and what it actually means, because we can sit around interpreting it in various ways of different sorts of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.241,
    "end": 3790.882,
    "text": "But actually the key thing is that it's a probabilistic relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.322,
    "end": 3798.504,
    "text": "It's a relationship between normally three distinct sets of variables, where we're saying that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.664,
    "end": 3803.906,
    "text": " Two of those types of variable are separated by the Markov blanket probabilistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.306,
    "end": 3809.187,
    "text": "And all that means is that the two that are being separated are conditionally independent of one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.367,
    "end": 3814.769,
    "text": "Once we know the thing that's doing the separating and the thing that's doing the separating is the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.091,
    "end": 3825.055,
    "text": " And often that means that there are direct relationships between each of those things in the blanket, but no direct relationship across the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3826.195,
    "end": 3839.563,
    "text": "But then it's important to think about what sort of relationships we're talking about, whether those are dynamical relationships and causal relationships and all sorts of other ways you can describe the interactions between pairs of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.6,
    "end": 3857.965,
    "text": " And there's a discussion we've had on and off for the last couple of years, really, about what is the relationship between dynamics and probabilistic relationships, and even which probability distributions are appropriate to use to even define a Markov blanket of this sort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.077,
    "end": 3879.383,
    "text": " One answer to that is that we can look at the Markov blankets associated with some steady state density, but we can also do the same thing with any probability distribution, which includes distributions over the paths and look at the independence or dependence between different paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.203,
    "end": 3893.791,
    "text": " When formulated in terms of path, there's a slightly clearer relationship between the dynamics of the system and the Markov blanket, because once we've said that the path of one variable or two sets of variables are independent of one another, given the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.967,
    "end": 3905.211,
    "text": " be true about the dynamical coupling and implies a certain degree of sparse coupling between those in a dynamical setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.132,
    "end": 3925.123,
    "text": "And it's probably once you look at the dynamical setting that a lot of the physics, as you framed it, might come in because you can then start to interpret that in terms of physical influences and things that might cause an acceleration or a change in velocity or change in position and interpret it in terms of physical forces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.594,
    "end": 3928.98,
    "text": " There are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.001,
    "end": 3938.322,
    "text": " There are, of course, other ways in which you can look at Markov blankets and sometimes they're interpreted in terms of sort of cell membranes and that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3938.342,
    "end": 3948.564,
    "text": "And I wondered whether that was what was meant when ports were mentioned, because you can think of sort of ion channels as being ports that allow interactions between two sets of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.184,
    "end": 3958.246,
    "text": "I think when people make those sorts of comparisons, you have to be very careful about what exactly you mean, which variables reflect different parts of that blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.926,
    "end": 3970.053,
    "text": " So, for instance, you might talk about intracellular extracellular ion concentrations being independent of one another, conditioned upon the state of some cellular protein.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.065,
    "end": 3988.235,
    "text": " So I think, again, it's an interesting question and there are lots of different ways you could unpack it and you could think about a range of different systems and try and interpret what the Markov blanket is there and what the physical interpretation of that is, if it is a physical system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.616,
    "end": 4003.785,
    "text": "Ultimately, I think probably the physics of it is going to be articulated most clearly in terms of the dynamical equations, which sometimes bear a direct relationship to the Markov blanket, but it depends where it's defined or in what domain it's defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.897,
    "end": 4009.258,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4012.963,
    "end": 4021.716,
    "text": "There was two complementary ways that this question one, it's like this is where the two paths first branched.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4022.156,
    "end": 4022.998,
    "text": "And they're complementary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4023.779,
    "end": 4023.939,
    "text": "But",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4025.666,
    "end": 4043.6,
    "text": " Could you describe where equation one begins and read it however you see fit, and then the question mark at the end, and then help us understand how the probability density can be expressed in two complementary ways?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4045.181,
    "end": 4046.562,
    "text": "What is equation one showing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4047.102,
    "end": 4048.924,
    "text": "What does the question mark leave us with?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4049.544,
    "end": 4054.148,
    "text": "And how do these two sides shown on the left and the right provide two complementary approaches?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4064.673,
    "end": 4068.438,
    "text": " I feel like I've done a lot of the talking, but I'm happy to take this one as well if you'd like me to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4070.834,
    "end": 4071.094,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.055,
    "end": 4081.864,
    "text": "So first line of equation one, we're really just describing some dynamical system that has some fluctuations associated with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.984,
    "end": 4095.917,
    "text": "So there's some degree of randomness where that randomness may be interpretable as deterministic behavior at a much faster scale that we're effectively ignoring through the application of our renormalization group, what we were speaking about earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.638,
    "end": 4102.622,
    "text": " So our x in this equation is some variable that's evolving through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.642,
    "end": 4115.411,
    "text": "The f of x describes how, in a deterministic system, the rate of change of that variable would depend upon the variable itself, depend upon its position in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.592,
    "end": 4129.528,
    "text": " And the omega term at the end here tells us that there's some additional fluctuations associated with that, something that's changing in a less predictable way, at least at the scale and speed of description that we're interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.69,
    "end": 4133.272,
    "text": "The second line of the equation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.595,
    "end": 4137.818,
    "text": " provides a little more definition to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.338,
    "end": 4155.318,
    "text": "So the first equality is relating the current position of the system, the current x, to the probability density describing the fluctuations, so saying how that's likely to be at any one point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.159,
    "end": 4159.621,
    "text": " And here we're saying that it's something that is zero mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.021,
    "end": 4164.744,
    "text": "So if we were to take an average over time, the fluctuation would end up averaging to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.005,
    "end": 4178.972,
    "text": "But then we're also defining a variance that's associated with it, and that's this two times gamma parameter, which effectively tells us about the amplitude of those fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.839,
    "end": 4206.602,
    "text": " The implication symbol then is saying, OK, so if we've found that or if we've defined it in this way, so we now know the form of fluctuations, that then tells us the form of the rate of change of x. And we know that if the average rate of change of or the average fluctuation is going to be zero, then the average rate of change of x is just going to be our f of x. So the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.823,
    "end": 4211.688,
    "text": " path or the same rate of change the x would have if we were dealing with a deterministic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4212.448,
    "end": 4222.96,
    "text": "However, we then have this additional uncertainty around that rate of change which inherits exactly the same variance as the random fluctuations did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.907,
    "end": 4232.251,
    "text": " So we then finally have this third line which says, so what is this probability distribution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.311,
    "end": 4237.774,
    "text": "How do we now account for what the distribution of X would be at some time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.794,
    "end": 4248.5,
    "text": "And I say at some time to make an additional distinction that isn't necessarily expressed in this slide, which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.788,
    "end": 4270.886,
    "text": " we can talk about the distribution of x evolving through time from some initial conditions, or we can talk about the distribution that it will eventually attain if we wait until we're a long way from our initial conditions, which is then the steady state density, so the point at which the Fokker-Planck equation here evaluates to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4273.688,
    "end": 4280.37,
    "text": " So there are several ways now we can think about the distribution of X and the density associated with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.131,
    "end": 4301.197,
    "text": "Equation three then says, well, we could also look at it a different way and think about some distribution or density over alternative trajectories that X could take in alternative paths, which is a description of a slightly different sort of quantity, but is equivalent in many ways because they're determined by exactly the same things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.032,
    "end": 4304.173,
    "text": " Does that sort of make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.193,
    "end": 4305.394,
    "text": "I know I've said quite a lot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.099,
    "end": 4310.419,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4313.782,
    "end": 4315.704,
    "text": "Have I got myself out of answering the next question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.326,
    "end": 4317.606,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4319.068,
    "end": 4320.369,
    "text": "Probably one rain pass.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4323.365,
    "end": 4350.709,
    "text": " maybe we can even just continue walking through and understanding the formalisms it's how we structure the dot zeros is with the formalisms and the figures in order and so we we follow along and try to connect key points in between so um you wrote that both the fokker plank and the path integral formulations inherit their functional form from assumptions about the statistics of random fluctuations in one which we just described",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4351.704,
    "end": 4357.708,
    "text": " Then you describe the path of least action and the most likely path.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4358.388,
    "end": 4360.61,
    "text": "So what is happening in four?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4361.31,
    "end": 4364.793,
    "text": "Where is the fluctuation being reduced to zero?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4365.513,
    "end": 4369.296,
    "text": "And what does it mean to take the most likely path or the path of least action?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4375.3,
    "end": 4377.141,
    "text": "Blue, do you want to do this or do you want me to do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.009,
    "end": 4380.03,
    "text": " Definitely, by all means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4380.05,
    "end": 4381.471,
    "text": "Carl, why don't you go?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4382.131,
    "end": 4383.171,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.532,
    "end": 4397.519,
    "text": "So just to backtrack a little bit and just to reiterate some of the key points that Thomas just made, just notice that everything basically starts with this Langevin equation or stochastic differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.7,
    "end": 4400.461,
    "text": " And then you can go in one of two ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.521,
    "end": 4409.723,
    "text": "You can go via the density dynamics description of the probability density distributions, which is a description which is deterministic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4410.423,
    "end": 4416.305,
    "text": "Or you can go via the path integral formulation and you can map gracefully between one and the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.825,
    "end": 4417.545,
    "text": "They're complementary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.565,
    "end": 4419.106,
    "text": "You can derive one from the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4419.666,
    "end": 4426.608,
    "text": "A little bit like the difference between dealing with the equations of motion or dealing with the convolution operators that we're just talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4426.648,
    "end": 4427.248,
    "text": "They're equivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.708,
    "end": 4428.528,
    "text": " in many senses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4429.368,
    "end": 4434.11,
    "text": "However, the way that they are used in the free energy principle are very distinct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4434.19,
    "end": 4438.351,
    "text": "I just wanted to rehearse that because that speaks to the particular question here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.371,
    "end": 4443.552,
    "text": "Where did the random fluctuations go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4444.292,
    "end": 4452.514,
    "text": "Before I do that, though, just to note that all the first equality in equation one is telling you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4453.416,
    "end": 4458.181,
    "text": " is that there is some probabilistic relationship between x and x dot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.942,
    "end": 4459.983,
    "text": "That's all it's saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4460.444,
    "end": 4470.015,
    "text": "It's saying that there is some coupling, and normally interpreted in terms of a causal coupling, between a function of x and x dot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.615,
    "end": 4495.997,
    "text": " so if you just think about our previous conversation in terms of generalized coordinates of motion and everything coming along in pairs like p's and q's in classical physics or real and imaginaries in quantum physics this is why there's always a pair of things at least two things to worry about because all that we're saying here is that there's some relationship between where you are and how you're moving",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.677,
    "end": 4499.359,
    "text": " in state-space, and it's a probabilistic relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.399,
    "end": 4506.522,
    "text": "So if you think about what that means in terms of modeling things, this is a state-space model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.542,
    "end": 4510.624,
    "text": "So it tells you nothing about which is the most likely state to be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4511.224,
    "end": 4514.706,
    "text": "It just tells you how likely, where am I going to go from here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4515.407,
    "end": 4516.647,
    "text": "That's all it's telling you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4516.667,
    "end": 4517.528,
    "text": "That's all we know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4518.668,
    "end": 4525.852,
    "text": "So you can start to think now about the probability distributions of where I will be in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4527.188,
    "end": 4532.772,
    "text": " Or you can think about probability distributions over the trajectories or the paths that you take.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.792,
    "end": 4536.394,
    "text": "And that's basically what Thomas was highlighting previously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.566,
    "end": 4545.468,
    "text": " In the free energy principle, the Fokker-Planck is actually not used very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.128,
    "end": 4549.109,
    "text": "So I'm just saying for Blue's benefit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.39,
    "end": 4553.191,
    "text": "She was worried about the fast and slow and how does that fit into the Fokker-Planck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4553.771,
    "end": 4557.993,
    "text": "In fact, most of the interesting stuff comes from the path integral formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.813,
    "end": 4567.137,
    "text": "The Fokker-Planck does bring a lot to the table, but only when you look at the solutions to the Fokker-Planck equation that you would get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.477,
    "end": 4570.72,
    "text": " under the assumption that it has a solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.0,
    "end": 4587.958,
    "text": "And you get into things like the Helmholtz decomposition and solenoidal flow and all of that interesting stuff and the link between the steady state density over states and the dynamical coupling that underwrites or defines the original Langevin equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.702,
    "end": 4596.645,
    "text": " You can ignore all that if you wanted to and just talk about the probability distributions over paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.685,
    "end": 4603.768,
    "text": "So no longer am I defining me, my homeostasis, in terms of the states that I occupy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4604.208,
    "end": 4612.732,
    "text": "That's a side product of the trajectories and the dynamics that I typically evince when I'm in this situation or at this point in state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4613.252,
    "end": 4614.593,
    "text": "So I think the more powerful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.251,
    "end": 4623.402,
    "text": " And certainly the basis of the free energy principle, the more powerful calculus is actually in the path integral formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.743,
    "end": 4629.39,
    "text": "So you can tell a free energy principle story without even mentioning the Fokker-Planck equation if you wanted to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4629.971,
    "end": 4630.632,
    "text": "And really,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4631.795,
    "end": 4637.282,
    "text": " that story is a story of least action or Hamilton's principle of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.322,
    "end": 4637.963,
    "text": "So what does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4637.983,
    "end": 4646.574,
    "text": "It just means that one way of summarising the behaviour of things or the characteristic behaviour of things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4647.234,
    "end": 4655.736,
    "text": " is in terms of the most likely way forward from here, the most likely trajectory or path from this point in state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4656.456,
    "end": 4657.076,
    "text": "What is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4657.276,
    "end": 4658.657,
    "text": "It is the path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.917,
    "end": 4659.337,
    "text": "What is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.357,
    "end": 4661.618,
    "text": "It's nothing more than the most likely path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4662.278,
    "end": 4663.518,
    "text": "What is the most likely path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.798,
    "end": 4675.481,
    "text": "Well, it's just given by the Langevin equation, the flow operator, the f of x, iterated in time in the absence or under the most likely random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.241,
    "end": 4678.383,
    "text": " So what are the most likely random fluctuations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4678.423,
    "end": 4682.086,
    "text": "Well, we've just said that the most likely random fluctuation is zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.827,
    "end": 4690.133,
    "text": "So all that we're doing is taking the omega, the random fluctuations, out of the equations of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4690.493,
    "end": 4697.039,
    "text": "And that just is the path of least action, which is just the most likely path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4697.699,
    "end": 4700.522,
    "text": "And if you apply the calculus of variations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.175,
    "end": 4722.087,
    "text": " to that notion you get these expressions that in equation four here so the if you interpret the action a as the probability or the surprisal or the negative log probability of a particular path then if you want to minimize the action you're just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.631,
    "end": 4731.157,
    "text": " trying to identify the path that is most likely, that is just the evolution of the system without any random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4731.557,
    "end": 4745.668,
    "text": "So the first expression, which follows a convention pursued in this paper and other papers, that the paths of least action, namely the most likely paths, are in boldface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.088,
    "end": 4748.89,
    "text": "All this says is that the most likely path in boldface",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.773,
    "end": 4757.677,
    "text": " simply is that which renders that path the most likely for this system, which is another way of saying that it minimizes the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.198,
    "end": 4759.938,
    "text": "What does that mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4759.958,
    "end": 4775.546,
    "text": "Well, it means that if you deviate from this path in any way, known as a variation, hence variational calculus, if you vary or deviate from this path, then you are going to increase the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.746,
    "end": 4779.488,
    "text": "So you can think of a marble rolling down a long valley",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4780.419,
    "end": 4791.41,
    "text": " And the course of the marble rolling down a long valley will follow a trajectory that is always at the minimum of the height of the valley.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4792.889,
    "end": 4799.432,
    "text": " And therefore, any deviation from that path will cause you to climb the sides of the valley.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4799.953,
    "end": 4810.578,
    "text": "And therefore, the path integral or the average action, perfect, the average action will be slightly bigger than the path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.258,
    "end": 4825.54,
    "text": " So that's basically what is meant by the second implication, which is that any variation of the path about the path of least action will cause an increase in the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4826.922,
    "end": 4846.499,
    "text": " And another way of stating that is that the path of least action at the point of the minima, infinitesimal changes don't change the action because you're at the flat bottom or microscopically the valley has bottomed out and therefore your variation is zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.62,
    "end": 4853.785,
    "text": "And another way of expressing that is where we started, which is the path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4854.637,
    "end": 4860.719,
    "text": " follows the trajectory in the absence of any random fluctuations, which is just the final equality down there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4861.06,
    "end": 4868.322,
    "text": "So it's just the original Langevin equation, but without random fluctuations, or with the most likely random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.623,
    "end": 4877.326,
    "text": "So I brought on, as you saw, this classical Waddington epigenetic landscape.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4877.986,
    "end": 4882.968,
    "text": "Here's the marble rolling down a hill, coming towards us,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4884.502,
    "end": 4889.204,
    "text": " might we interpret decisions as being bifurcations?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4889.944,
    "end": 4901.609,
    "text": "Or if we're talking about paths of least action in space or paths of least action on cognitive parameters, where do decisions come into play?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4908.851,
    "end": 4910.252,
    "text": "That's definitely for blue, that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4912.513,
    "end": 4913.233,
    "text": "Yep, I knew it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4916.858,
    "end": 4919.842,
    "text": " So can we even make decisions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4919.882,
    "end": 4922.264,
    "text": "I'm going to just answer your question with a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4924.087,
    "end": 4932.016,
    "text": "Because I mean, if up until this point, we are just a sum of all the things that have occurred up into this point,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4932.677,
    "end": 4936.3,
    "text": " We now have a model that's based on all previous action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4937.18,
    "end": 4945.066,
    "text": "And when you come to this bifurcating path, you're just going to take the one that minimizes free energy, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4945.186,
    "end": 4946.266,
    "text": "Isn't that how it goes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4947.087,
    "end": 4955.333,
    "text": "So according to your model and all the things that have brought an organism to that point, that's my answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4957.494,
    "end": 4961.557,
    "text": "I want Thomas to answer now, but he must use the words free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.797,
    "end": 4964.658,
    "text": " I'm not going there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.339,
    "end": 4968.322,
    "text": "I don't think I'm philosophically qualified enough to use those words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4968.982,
    "end": 4971.725,
    "text": "I skipped right over it, but said it, borderless.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4975.329,
    "end": 4984.398,
    "text": "Anyone can address how is free will related to free energy, or how decision-making plays into a path of least action?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4986.202,
    "end": 4993.927,
    "text": " While Thomas is gathering his thoughts to slip free will in a non-philosophical sense into his response, I think that's absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4993.968,
    "end": 5005.395,
    "text": "So the notion of a bifurcation, I think, is very prescient when you think about paths of least action on any energy landscape, in particular free energy landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.321,
    "end": 5017.904,
    "text": " But at the same time, if we just pursue the path of least action, there are no decisions or it looks as if there are no decisions from a mathematical point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5018.524,
    "end": 5031.828,
    "text": "But in virtue of the fact that there is an indeterminacy about the paths that you would pursue from the initial where you start, say, the marble at the beginning of the top of the hill here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5032.711,
    "end": 5047.045,
    "text": " That indeterminacy, I think, does call into question whether technically the chaotic structure that underwrites the itinerancy of the thing that we are trying to model will actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5047.515,
    "end": 5060.201,
    "text": " induce a sensitivity to initial conditions, which means that we can never totally predict how we will behave or the decisions we will make, given our state of mind and the state of the world at the present time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.241,
    "end": 5074.548,
    "text": "So I think there is a latitude to talk about free will, but it would be of the kind that inherits from deterministic chaos and sensitivity to initial conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.548,
    "end": 5076.069,
    "text": "And that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.383,
    "end": 5093.4,
    "text": " That's quite important, or framing it in the context of bifurcations in deterministic dynamical systems theory is quite an important move because, of course, the Langevin equation does not admit deterministic chaos because you've got random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5094.284,
    "end": 5099.768,
    "text": " So you have stochastic chaos, or you could have stochastic chaos, but you can't have deterministic chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.549,
    "end": 5114.419,
    "text": "So the question now is, is there any opportunity for deterministic chaos in the context of the free energy description of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5115.757,
    "end": 5117.578,
    "text": " sentient behavior and choice making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.918,
    "end": 5129.002,
    "text": "And I think there is, but only in a very special class of systems where the internal, the particular states or the internal states and the blanket states don't have any random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5129.342,
    "end": 5132.183,
    "text": "And you may be asking, well, there must always have random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5132.683,
    "end": 5134.744,
    "text": "Well, not necessarily at a particular scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5135.624,
    "end": 5143.967,
    "text": "If you take 100 million neurons or say even a million neurons, and you now write down your state as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5144.332,
    "end": 5151.161,
    "text": " the average of a population or ensemble of neurons, all the random fluctuations in neural noise will be averaged away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5151.201,
    "end": 5155.947,
    "text": "And this is exactly the same mechanics that Thomas was talking about before in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.828,
    "end": 5167.974,
    "text": " renormalization group and taking certain mixtures carefully to eliminate fast fluctuations and random fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5168.455,
    "end": 5177.32,
    "text": "So the argument would be here, if you want to talk about bifurcations in the sense of transcritical bifurcations or hot bifurcations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5178.141,
    "end": 5202.494,
    "text": " as a way of describing a particular path of least action or paths of least action from slightly different initial conditions, then I think you'd be perfectly licensed to do that, but you'd have to be very careful in saying that we are assuming here that the dynamics are deterministic and therefore only apply at a particular scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5202.952,
    "end": 5212.597,
    "text": " and they apply it at a scale where the particular dynamics, the internal and blanket states, don't possess any random fluctuations of that matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5213.498,
    "end": 5218.46,
    "text": "And that's quite interesting because there are other things that inherit from that assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5219.361,
    "end": 5231.307,
    "text": "Again, coming back to this notion of different kinds of particles, some very, very small particles, like the single cells that Blue was talking about before, maybe so small in number and in size",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.929,
    "end": 5238.132,
    "text": " that you cannot average away the random fluctuations and they would not show any deterministic chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5238.652,
    "end": 5259.321,
    "text": "But there may be a coarser-grained description of neuronal dynamics and computational anatomy that does actually acquire a deterministic aspect, a classical aspect, where you have an n-body-like problem, which will invariably show some kind of deterministic chaos, which means that then you can get back to one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5261.368,
    "end": 5266.616,
    "text": " form of looking at something that might look like free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5267.176,
    "end": 5271.843,
    "text": "Anyway, now Thomas has had plenty of time to tell us about the dynamics of free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5274.898,
    "end": 5295.435,
    "text": " So I noticed that the way you framed that was in terms of unpredictability and that under the definition of free will you were using there, it's things where we wouldn't necessarily be able to predict in advance how well a particular or how a particular system would evolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.736,
    "end": 5297.497,
    "text": "And I'm sure that will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5298.377,
    "end": 5301.403,
    "text": " please some philosophers and upset many others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5303.386,
    "end": 5306.853,
    "text": "I don't have an alternative definition that would work better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5306.873,
    "end": 5307.554,
    "text": "Please everybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5310.493,
    "end": 5318.197,
    "text": " And so I suppose we've spoken really about one side of things, which is the deterministic aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5319.017,
    "end": 5324.14,
    "text": "And clearly that does become very relevant at larger and slower scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5325.12,
    "end": 5333.364,
    "text": "And I suppose it's also interesting to think about unpredictability when stochastic dynamics become much more important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.984,
    "end": 5339.227,
    "text": "So we certainly could think about systems where there are multiple plausible paths and where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.307,
    "end": 5355.077,
    "text": " or even a continuum of plausible paths, and the particular path they end up taking will depend upon the particular values that the fluctuations take during the course of that path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.378,
    "end": 5384.887,
    "text": " arguably if the fluctuations are themselves just dynamical systems that are deterministic but occurring at a much faster scale it's still not really an unpredictability of the stochastic sort because ultimately it's described by a deterministic dynamical system which again brings us back to this renormalization group idea and it depends a little bit on your your interpretation of what happens at the slowest or so the fastest possible scales when we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5386.507,
    "end": 5400.795,
    "text": " performance renormalization operation is the fastest scale something that is genuinely random or is it something that is a sort of recursive recursively faster deterministic dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5402.835,
    "end": 5427.727,
    "text": " Either way, it may be that if stochastic descriptions are most appropriate at some scale of description, we can develop a form of unpredictability both from things like deterministic chaos and uncertainty of initial conditions, but also potentially from the random fluctuations that happen along a particular trajectory in systems that have more randomness involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5429.549,
    "end": 5448.31,
    "text": " Clearly when we're trying to describe a real system or a real brain and the decisions people make, we clearly don't have access to every part of that system and what every neuron in that brain is doing, so to some extent we're always dealing with a partially stochastic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.291,
    "end": 5454.337,
    "text": " And that feeds into how we might end up modeling behavior in those kinds of systems as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5455.117,
    "end": 5470.173,
    "text": "So if we were trying to fit an active inference style model to real behavior or even simulated behavior, often what we end up doing is adding in a term to account for some uncertainty in the action selection or uncertainty that we as experimenters have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.494,
    "end": 5480.338,
    "text": " in the action someone might choose, even if we think we know what the expected free energy they're going to calculate is and how they're going to evaluate the alternative paths they might choose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.619,
    "end": 5493.545,
    "text": "So that's just an acknowledgement that if we don't know everything, if we don't have a complete description of the system, then we have to, to some extent, allow for some stochastic parts of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5494.125,
    "end": 5504.476,
    "text": " Of course, that stochastic element may be purely the uncertainty over the initial conditions in a system that can exhibit chaotic behaviour and that bifurcates in various different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.532,
    "end": 5527.726,
    "text": " awesome we'll continue on as we approach the end of the dot one and introduce something we had talked about in terms of the markov blanket previously but it's the particular partition so how have other mechanics",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5529.204,
    "end": 5530.585,
    "text": " addressed particles?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5531.365,
    "end": 5536.748,
    "text": "And how does this particle framework do something different?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5536.808,
    "end": 5538.689,
    "text": "And what does that different framing enable?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5542.771,
    "end": 5544.933,
    "text": "It's blues turn or I could give a shot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5548.094,
    "end": 5549.035,
    "text": "Why don't you go ahead, Daniel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5550.327,
    "end": 5564.143,
    "text": " Okay, as a non-physicist, my understanding is that particles have not been explicitly modeled this way and fields or continua have been the norm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5566.226,
    "end": 5569.23,
    "text": "The particulate description provided here",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5570.549,
    "end": 5598.497,
    "text": " enables a principled approach to separating bigger from ground from separating an entity that's being tracked that's doing the movement away from the entity that is not doing the movement in a sense that would just be one thought which I would concur with very much you know it's um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5599.648,
    "end": 5613.21,
    "text": " If you go back and think about the physics you did at school, usually it will be focused on the behaviour of some idealised gas in what they would call a heat bath or a heat reservoir.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5613.971,
    "end": 5622.112,
    "text": "And really what the particular petition brings to the table are deep questions about how did that heat bath get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5622.332,
    "end": 5624.833,
    "text": "And the heat bath now stands in for blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5625.173,
    "end": 5626.593,
    "text": "And what's beyond the heat bath?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.314,
    "end": 5633.632,
    "text": " the external states so you know it is it is a move which I am not aware of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5634.449,
    "end": 5639.571,
    "text": " being attempted in any other branch of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5640.111,
    "end": 5658.037,
    "text": "So in quantum physics, the Markov blanket, or the thing that contains the particle of interest, probabilistically speaking, is usually defined in terms of a Skrodinger potential, and the functional form of that potential leads to all the applications of quantum electrodynamics that you might encounter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5658.578,
    "end": 5672.865,
    "text": " And I repeat, in thermodynamics, people just talk about there being some blanket states in terms of a heat path, but they don't think about what's beyond the heat path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.486,
    "end": 5680.389,
    "text": "In terms of classical mechanics, perhaps there is a notion of particles there, which is less...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5683.425,
    "end": 5695.175,
    "text": " less if you like hidden under under the rug the rug but of course you don't have any explicit representation of the internal dynamics because normally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5695.842,
    "end": 5715.764,
    "text": " Classical mechanics is just dealing with the motion of heavenly bodies or large, massive objects without really thinking about the faster dynamics that underwrite autonomous movement or animate movement or what people in chemistry might refer to as active matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5717.813,
    "end": 5735.508,
    "text": " just a few thoughts on that the classical indeed it does deal with diffusing particles massive bodies but just like you pointed out it doesn't consider internal states so it's like a view from the outside and this is a bit more like a view from both sides which enables us to have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5735.968,
    "end": 5752.604,
    "text": " sentient or cognitive behavior on both sides of the observation interface rather than implicitly on only one side which is a very different situation and then you uh talked about in this thermo physics context and in this quantum physics context like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5753.405,
    "end": 5782.334,
    "text": " what is beyond the boundary and then uh in the quantum case you said that that was like the role of the heat bath and what's outside of it is the schrodinger potential and what's outside of it and that makes me think about schrodinger's implicit question and schrodinger's explicit question schrodinger's explicit question in 1944 and in ramsted at all 2018 was what is life schrodinger's implicit question was what is beyond",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5783.479,
    "end": 5801.782,
    "text": " the quantum what is outside of that and so it's almost um interesting though appropriate that the particular partition actually brings those two together but I would let anyone else reflect to how they're brought together",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5814.224,
    "end": 5820.019,
    "text": " anyone wants to add or we'll just continue to leave a few little pieces before closing the dot one",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5821.696,
    "end": 5825.337,
    "text": " I was hoping that Thomas and Blue would... I think that's an excellent observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5825.357,
    "end": 5828.879,
    "text": "I just wanted to reinforce it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5829.379,
    "end": 5831.399,
    "text": "So what is life?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5831.9,
    "end": 5840.843,
    "text": "It's basically, coming back to our early question, it's those systems that are equipped with a homeostasis of sorts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.263,
    "end": 5843.724,
    "text": "But beyond that, these things move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5843.924,
    "end": 5846.685,
    "text": "So there are homeostatic systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5847.325,
    "end": 5851.347,
    "text": " that are self-constructing and self-maintaining, that move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.847,
    "end": 5861.611,
    "text": "And this, I think, speaks to the importance of having the active states that couple back and influence the external states beyond the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5861.631,
    "end": 5869.495,
    "text": "So, again, speaking to another important natural kind, the distinction between inert particles and active particles,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5870.276,
    "end": 5879.396,
    "text": " um where you've got this active autopoetic like aspect to the maintenance of uh of the homeostasis so you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5880.589,
    "end": 5889.536,
    "text": " I think that's quite an important observation that we're not talking, you know, we are talking about a bidirectional exchange across the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5889.556,
    "end": 5898.563,
    "text": "Just to reiterate your sort of observation that what we're doing here is trying to account for the coupling between the inside and the outside of something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5898.824,
    "end": 5906.93,
    "text": "We're not just interested in the inside as in classical physics or the outside or what it looks like from the outside in terms of, sorry, thermo...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.451,
    "end": 5920.273,
    "text": " statistical mechanics or what it looks like from the outside in terms of classical mechanics, we're actually trying to get to the meat of the maintenance of a Markov blanket and thingness in an inactive context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5923.014,
    "end": 5932.475,
    "text": "So then as a closing round here, I want to point to one tension that we pulled in the dot zero.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5933.235,
    "end": 5934.596,
    "text": "So here in footnote 21,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5937.111,
    "end": 5958.506,
    "text": " it says a lot of interesting things but then it says minimization implies a teleology that goes beyond any claim of the fep do particles minimize surprisal or free energy well minimization implies a teleology that goes beyond any claim of the fep okay very well later",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5960.046,
    "end": 5966.93,
    "text": " The question is asked, is it tenable to interpret gradient flows on variational free energy as variational inference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5967.53,
    "end": 5970.171,
    "text": "Or is this just teleological window dressing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5971.032,
    "end": 5973.433,
    "text": "So where is teleology?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5974.133,
    "end": 5978.256,
    "text": "Is teleology in the FEP?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5979.997,
    "end": 5981.497,
    "text": "Or is it window dressing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5981.637,
    "end": 5982.458,
    "text": "What's the window?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5982.558,
    "end": 5983.498,
    "text": "What's the building?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5983.658,
    "end": 5985.019,
    "text": "What's outside the building?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5986.08,
    "end": 5988.281,
    "text": "Is minimization teleological?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5989.744,
    "end": 5997.37,
    "text": " And is that in the FEP's claims or what other claims are coming to the table if it's not part of FEP in the strict sense?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6001.313,
    "end": 6003.094,
    "text": "This is Thomas's favorite question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6004.795,
    "end": 6005.256,
    "text": "I didn't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6009.019,
    "end": 6012.641,
    "text": "My favorite question in that I've asked it before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.882,
    "end": 6014.663,
    "text": "Several times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6016.624,
    "end": 6018.126,
    "text": "And what's lyrical about it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6023.486,
    "end": 6026.549,
    "text": " I mean, it is a tricky question in lots of ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.629,
    "end": 6030.834,
    "text": "I mean, to some extent, the answer to the big, bold question is both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6030.854,
    "end": 6037.061,
    "text": "I think it's also worth asking the question, is it useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6041.753,
    "end": 6068.805,
    "text": " The reason we've spoken about it quite a lot in the past and one of the reasons it's come up is that in some of the recent formulations we've dealt with in some of the papers that we've been discussing, is that the free energy or the gradient flows have been on some normally steady state density that can be interpretable as a generative model of sorts or as a marginal likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6071.827,
    "end": 6095.883,
    "text": " Now, the challenge is that a marginal likelihood in itself is not necessary, or is, I suppose, a special case of the free energy when the variational density that we were speaking about earlier, this tractable part of the optimization problem, is exactly equal to a true posterior density once we've performed Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6097.063,
    "end": 6123.29,
    "text": " So the question we've often asked is whether that KL divergence, whether this divergence between our approximate distribution, our variational distribution and our true exact Bayesian solution, whether if that is defined stipulatively as being zero, whether there is a meaningful role of free energy minimization as being interpretable as inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6126.115,
    "end": 6128.436,
    "text": " And there are several possible answers to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.636,
    "end": 6143.564,
    "text": "One is that we're really dealing with, when we're engaging in computational neuroscience, we're dealing with an attractable approximation to how systems behave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.125,
    "end": 6150.188,
    "text": "So it's useful from the perspective of a computational neuroscientist to be able to write it down into the free energy functional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.389,
    "end": 6159.802,
    "text": " but not necessarily treat that as a literal description of what brains and sentient creatures are doing in terms of the variation of free energy aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6160.483,
    "end": 6166.592,
    "text": "We could still interpret the marginal likelihood as before, or interpret gradient flows in the marginal likelihood as before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6168.782,
    "end": 6179.864,
    "text": " Another answer to it is that part of what makes inference work, particularly in a dynamical setting, is not going to the bottom of a free energy minimum, but it's finding a way of staying there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6180.624,
    "end": 6187.706,
    "text": "And so that depends upon the ability to predict and the ability to represent some dynamics of how a system is evolving over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6187.726,
    "end": 6192.667,
    "text": "So it's a question of the model staying at the bottom of the valley and not deviating up the sides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6194.607,
    "end": 6197.108,
    "text": " And we could interpret that as a form of inference as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6197.288,
    "end": 6210.233,
    "text": "And here we then deal with flows that are not necessarily up or down free energy gradients or marginal likelihood gradients, but are maintaining the same level or staying at the bottom of the valley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.834,
    "end": 6213.495,
    "text": "And that's often what we refer to in terms of the solenoidal flows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.255,
    "end": 6231.449,
    "text": " And this links back to a lot of the discussion we were having about deterministic versus sort of chaotic dynamics, or I suppose deterministic chaos, where systems can behave in a range of different ways that is very difficult to capture if you're just going up and down probability gradients.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6232.43,
    "end": 6239.056,
    "text": "So it talks about how we go around probability gradients, how we circle around the hill or along the valley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6240.556,
    "end": 6243.358,
    "text": " and the potentially chaotic way that we do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6243.958,
    "end": 6251.922,
    "text": "And that results in a form of prediction, it results in a way of staying at the bottom of the valley and not leaving it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6252.162,
    "end": 6255.164,
    "text": "So we could interpret that as a form of inference as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6257.536,
    "end": 6275.183,
    "text": " I think they're probably asked some open questions as to whether, under certain circumstances, it looks as if we are also minimising this KL divergence part, this divergence between the approximate and exact basin posteriors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6276.423,
    "end": 6278.524,
    "text": " And I think that's still open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6278.544,
    "end": 6282.527,
    "text": "I think plausibly there will be ways of writing things down that look as if they're doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6283.207,
    "end": 6296.035,
    "text": "It may be that it's simply a useful approximation that we can attractively write down and simulate and perform computational neuroscience with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6297.403,
    "end": 6321.773,
    "text": " The third possibility is that if the brain is realised or evolved to realise that things in the world behave in the way we've been describing, it could plausibly be a mechanism or variational inference type approaches could be a mechanism that the brain has evolved to use to model its environment as well, which would bring back this idea of explicit variational for energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6323.353,
    "end": 6325.274,
    "text": " So I think there are several different possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6325.314,
    "end": 6329.055,
    "text": "I think there's still probably an ongoing discussion about a lot of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6330.096,
    "end": 6344.62,
    "text": "For me, the idea of inference and variation inference has to be one where the KL divergence is decreasing over time, where it's not something that we necessarily keep static, which might mean that variation inference is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6347.041,
    "end": 6368.07,
    "text": " not something that's necessarily happening in the systems we've been describing so far but whether it could be something that could be interpreted in terms of the flow of internal states toward their most likely value and other aspects of that or whether it's simply a good approximation I'm sure Carl will have other things to say on this because I've not given a definitive or a clear answer one way or the other here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6369.471,
    "end": 6372.813,
    "text": " For me, variation in inference occurs when the KL divergence is shrinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6374.814,
    "end": 6383.28,
    "text": "However, you could also argue that marginal likelihoods and the optimization of marginal likelihood is itself a form of Bayesian inference and more akin to sort of model selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6384.141,
    "end": 6391.506,
    "text": "Certainly it feeds into the idea of active inference in terms of acting upon the world to maximize the fit between model and the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.566,
    "end": 6393.327,
    "text": "And that element is certainly there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6396.423,
    "end": 6396.823,
    "text": " Excellent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6398.085,
    "end": 6401.128,
    "text": "Carl and then blue will each have a last thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6401.528,
    "end": 6405.052,
    "text": "And next week at the same time, we'll continue with 45.2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6405.172,
    "end": 6411.318,
    "text": "But for now, Carl and then blue are last thoughts on what Thomas just added or anything else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6412.878,
    "end": 6414.319,
    "text": " No, I think he's absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6414.659,
    "end": 6417.541,
    "text": "I mean, it's more interesting to ask the question, isn't it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6417.561,
    "end": 6422.624,
    "text": "I think it's largely from the point of view of the way the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6422.684,
    "end": 6427.386,
    "text": "I think the FEP interpretation is largely teleological window dressing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6429.062,
    "end": 6445.565,
    "text": " but I think it's incredibly useful to have that cheap and cheerful and doable kind of window dressing when you actually want to build artifacts that behave as creatures who are autopoetic and have a homeostasis and make the right kinds of decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6448.386,
    "end": 6448.686,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6450.946,
    "end": 6453.387,
    "text": "First, Thomas or Carl, any last thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6453.487,
    "end": 6455.147,
    "text": "And then Blue, and then I'll close.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6459.259,
    "end": 6462.66,
    "text": " Just to say thank you for organizing this and inviting us to be part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6466.321,
    "end": 6466.561,
    "text": "Blue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6469.221,
    "end": 6471.362,
    "text": "Yeah, it was great to have you guys here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6471.482,
    "end": 6477.643,
    "text": "And I definitely had some questions that I've been wondering about for a long time resolved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6477.804,
    "end": 6479.664,
    "text": "So that was really great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6481.84,
    "end": 6483.922,
    "text": " Yes, this was an excellent discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6484.302,
    "end": 6489.026,
    "text": "And we sometimes think about the dot zero as almost like preparing the marble.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6489.046,
    "end": 6492.95,
    "text": "I don't know if it's blowing it out of glass or just bringing it to the edge of the bathtub.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6493.01,
    "end": 6504.98,
    "text": "And the dot zero, we just walk through in the order as it was laid out and try to follow the traces and understand some of the causal dynamics at play behind the writing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6505.601,
    "end": 6506.582,
    "text": "And then in the dot one,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6507.202,
    "end": 6508.983,
    "text": " we're in kind of like this plane.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6509.043,
    "end": 6520.732,
    "text": "And so there's little micro variations, some local sense to be made, but I really appreciated how we opened up a lot of threads and also covered a lot of the key aspects of the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6521.894,
    "end": 6530.862,
    "text": " And then we'll be looking forward to the dot two when we get to climb or descend or circumambulate and continue the discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6530.962,
    "end": 6535.546,
    "text": "So thanks again to Carl and Thomas and all the other authors for this great paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6535.647,
    "end": 6537.849,
    "text": "And thank you Blue and Brock for the dot zero.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6538.809,
    "end": 6539.43,
    "text": "See you next week.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6541.952,
    "end": 6542.132,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6543.053,
    "end": 6543.153,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]