[
  {
    "start": 5.296,
    "end": 7.659,
    "text": " Hello everyone and welcome back to the show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7.679,
    "end": 14.626,
    "text": "Today I am joined by Julian Kiverstein, Senior Researcher in the Department of Psychiatry at Amsterdam Medical Research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.087,
    "end": 29.042,
    "text": "Professor Kiverstein's work is fascinating and deeply important as he has developed phenomenologically informed answers to a number of questions in cognitive science, including time perception, conceptual thinking, empathy, free will, consciousness and the self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.022,
    "end": 33.048,
    "text": " In doing so, he has become a leading intellectual in the world of 4E cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.749,
    "end": 41.9,
    "text": "As he puts it, cognitive scientists once shared a vision of mind as a kind of logic engine carrying out rule based operations on symbolic representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.341,
    "end": 52.735,
    "text": "Today, this view is rapidly being replaced by an alternative vision of brain, body and world as dynamically interacting equal partners, sharing the load in our day to day problem solving behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.715,
    "end": 56.42,
    "text": " Professor Kiverstein's work has also been highly impactful on my own thinking in these domains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.981,
    "end": 59.344,
    "text": "So honestly, I am really, really excited to speak to you today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.965,
    "end": 63.169,
    "text": "Professor Kiverstein, Julian, thank you so much for joining me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.189,
    "end": 64.631,
    "text": "As I said, it really is a privilege.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.752,
    "end": 67.114,
    "text": "Thanks so much for inviting me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.154,
    "end": 69.077,
    "text": "Looking forward to our discussion very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.838,
    "end": 76.526,
    "text": "As am I. And I think, you know, I've read some of your papers multiple times and I adore them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.567,
    "end": 80.271,
    "text": "I think some of them are absolute gems in the 4E sort of lineage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.872,
    "end": 81.473,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.605,
    "end": 87.43,
    "text": " And you sort of propose this notion of ecological inactive cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.865,
    "end": 91.309,
    "text": " for ecog Psi, inactive cognition has a very rich history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.429,
    "end": 99.538,
    "text": "And it's worthwhile, I'm picking what some of these terms mean, because I can imagine people are going to get confused, because they're rather niche terms, at least they can sound so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.159,
    "end": 103.723,
    "text": "So it'd be good to get maybe just some definitions off the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.584,
    "end": 110.391,
    "text": "Perhaps we could start with autonomy, versus heteronormative heteronormative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.411,
    "end": 111.612,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.632,
    "end": 114.075,
    "text": "What does it mean to be a kind of autonomous being?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.034,
    "end": 117.818,
    "text": " Yeah, so that is an excellent starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.161,
    "end": 124.509,
    "text": "Well, autonomy is like a very rich concept with a long history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.731,
    "end": 134.365,
    "text": "But the way that it's used in the context of philosophy of cognitive science is by drawing on ideas about biological autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.046,
    "end": 138.612,
    "text": "So autonomy is like a form of self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.845,
    "end": 151.45,
    "text": " that a living system has when it is both self-producing, so that's basic to the idea of self-organization, that the organization is something that emerges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.49,
    "end": 157.883,
    "text": "So the structure, the form that the living system has is something that's emergent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.167,
    "end": 169.0,
    "text": " but also that autonomous systems are able to keep themselves going, so maintain their organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.402,
    "end": 179.533,
    "text": "And that requires them to be self-individuating in a particular way, so distinguishing themselves from their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.902,
    "end": 191.314,
    "text": " Um, so I think those are the two key features that we need to have in view, the self distinction, uh, self production or self individuation, as I called it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.114,
    "end": 192.295,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.015,
    "end": 200.183,
    "text": "I've been, uh, I've been sort of perusing Evan Thompson's 2007 mind in life, which is just cracking, but also super long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.223,
    "end": 202.145,
    "text": "So I'm working my way for it slowly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.765,
    "end": 204.407,
    "text": "And here's a bit where he says, well, autonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.978,
    "end": 211.476,
    "text": " it's sometimes quite tricky to say when something is explicitly autonomous, rather than heteronymous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.836,
    "end": 213.421,
    "text": "I think that's the right way of saying it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.163,
    "end": 220.219,
    "text": "Do you subscribe to that notion that this is kind of a spectrum or that these can be cast these sharp dividing lines?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.701,
    "end": 222.061,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.102,
    "end": 228.29,
    "text": "So there's a, there's a technical discussion about whether autopoiesis is necessary and sufficient for autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.31,
    "end": 230.493,
    "text": "I think maybe that's what you're thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.693,
    "end": 235.24,
    "text": "So autopoiesis is this idea that the organization is self produced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.281,
    "end": 240.587,
    "text": "Um, and there's some questions about, well, is that enough on its own to get autonomy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 241.09,
    "end": 243.073,
    "text": " And Evan argues it isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.654,
    "end": 251.145,
    "text": "So you need, and so does Ezekiel DePaulo, you need this extra condition of adaptivity, as they call it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.447,
    "end": 260.179,
    "text": "In my work with Michael Kirchhoff, we connect that idea of adaptivity to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.159,
    "end": 279.298,
    "text": " yes so we discussed this in in the context of an issue that's come up quite a few times on your your podcast about what to say about pebbles or yes swinging pendulums that seem to behave as if they are minimizing free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.278,
    "end": 300.264,
    "text": " But it still seems like, well, if free energy principle is so general as to apply to the behavior of those kinds of physical systems, how is it going to be useful to use the mathematics of the free energy principle to understand life and mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.445,
    "end": 308.914,
    "text": "So perhaps before we get there, it'd be worthwhile just so people are aware, what does someone like Evan Thompson mean by adaptivity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.873,
    "end": 320.847,
    "text": " Yeah, sorry, so adaptivity is this ability of living systems to regulate their encounters with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.728,
    "end": 338.209,
    "text": "It requires a sensitivity to tendencies that can be sensed in the environment, where those tendencies could be threatening to the precarious organization of the living being, of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.881,
    "end": 356.62,
    "text": " So adaptivity is like moving towards dynamical tendencies that are going to sustain the organization of the system and away from tendencies that are threatening, are going to lead to disintegration or collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.802,
    "end": 368.339,
    "text": " And this sounds to me like this implies some necessary coupling with the environment whereby, to use active inference terms, you are, there's some conditional dependencies via Markov blanket, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.359,
    "end": 377.713,
    "text": "I mean, that's interesting because, as you know, this Weisingen tests with some of the earlier formulations of autonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.031,
    "end": 397.173,
    "text": " So Varela, for example, in 79 writes, the environmental elements intervening between the effector and the sensory surface of the organism is irrelevant because the nervous system can be redefined as a network of neuronal interactions in terms of the interactions of its component neurons, regardless of intervening elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.014,
    "end": 402.739,
    "text": "So that brings in this notion of operational or organizational closure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.529,
    "end": 412.143,
    "text": " Perhaps it's worth explaining to the audience why, at least on first glance, that might seem like it engenders some notion of internalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.91,
    "end": 426.988,
    "text": "Yeah, so certainly the way that Varela defines autonomy in that 1979 quote he just gave us is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.525,
    "end": 438.075,
    "text": " would entail a very strong form of internalism where the environment is just providing perturbations to the autonomous organization of the living system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.916,
    "end": 456.773,
    "text": "I don't think in the end that is what Varela intended, but there are places where he certainly sounds like it's a view where the meaning that we find in the world is something that's projected by the living organism onto the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.327,
    "end": 463.777,
    "text": " It can be read as a kind of solipsism or idealism without some careful handling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.961,
    "end": 480.083,
    "text": "Matriana and Varela had this metaphor of the submarine where you're underwater and all that you have in terms of access to the external world is through the periscope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.684,
    "end": 484.971,
    "text": "This sounds very similar to some of the things that we hear in active inference quite a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.238,
    "end": 500.018,
    "text": " There are hidden causes out in the world and we have to infer from our sensory states what it is that are causing those sensory states because we have no direct or immediate access to those hidden causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.101,
    "end": 511.313,
    "text": "I think the quote that you just read really fits with that view of life and autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.867,
    "end": 520.843,
    "text": " But I think that at the same time, we can think of the Markov blanket as coupling us to the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.863,
    "end": 523.287,
    "text": "This is something that came up in your discussion with Innes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.709,
    "end": 527.514,
    "text": "It separates us from our surroundings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.574,
    "end": 533.645,
    "text": "If we think of the Markov blanket around the organism, we can, of course, talk about where to place the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.665,
    "end": 537.351,
    "text": "That's one of the things that has also come up many times in your discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.124,
    "end": 555.925,
    "text": " But focusing on the Markov blanket around the biologically autonomous system, we can think of that as separating or enforcing some kind of separation between the organism and the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.326,
    "end": 562.393,
    "text": "But we can also think of it as coupling the organism to the environment via the active states of the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.234,
    "end": 586.288,
    "text": " yes yeah when i was going in in saying well what's the difference between the the pebble the the pendulums that are kind of oscillating together and an autonomous system an agent i think a key difference is that in the case of the agent there is this adaptivity or what michael and i call adaptive active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.011,
    "end": 594.699,
    "text": " So there's mere active inference, which is what you see in pebbles or in the pendulums.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.899,
    "end": 613.98,
    "text": "But there's also what we call adaptive active inference, where that requires that the organism is able to select actions, select policies that are going to minimize expected free energy or expected prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 614.568,
    "end": 615.971,
    "text": " Yes, yes, indeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.192,
    "end": 629.22,
    "text": "I mean, again, for me, this fits very nicely into the kind of dissection that people make of the variational free energy equation between the so-called KL divergence with your recognition density and your posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.24,
    "end": 632.547,
    "text": "So what's the difference between what you think is the posterior and what the true posterior is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.208,
    "end": 634.872,
    "text": "That's just perceptual inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.577,
    "end": 642.95,
    "text": " But the key thing here, at least for humans, is this capacity to maximize model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.712,
    "end": 645.876,
    "text": "So this is the probability of Y given your model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.437,
    "end": 656.455,
    "text": "And that seems to me to be, well, I think this is strongly put within the active inference community that that's reserved for animate active beings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.435,
    "end": 661.221,
    "text": " Those anima active beings have what we're calling autonomy here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.321,
    "end": 674.779,
    "text": "So that's a characterization of the organization of those systems that goes beyond just a mere operational closure where the opponents are reciprocally dependent on each other for their production.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.819,
    "end": 677.062,
    "text": "That's what operational closure means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.625,
    "end": 684.231,
    "text": "What autonomy adds to that is this idea of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.65,
    "end": 691.9,
    "text": " of self-evidencing, as we would put it in active inference terms, would probably disagree with me describing it in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.921,
    "end": 703.978,
    "text": "But the project here is to try to bring together active inference, the free energy principle with these ideas about inaction from the inactive community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.599,
    "end": 704.819,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.34,
    "end": 705.961,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.981,
    "end": 708.885,
    "text": "I think a lot of these problems have come very well once we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.0,
    "end": 722.807,
    "text": " make this distinction between systems that minimize variational free energy and those are abundant in the physical world, systems that do this adaptively because of their autonomy, because of their agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.34,
    "end": 724.621,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.002,
    "end": 726.065,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.225,
    "end": 731.981,
    "text": "I think a lot of the dichotomies or debates in active inference really come down to this fundamental issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.102,
    "end": 735.752,
    "text": "I mean, in many ways, it depends on what your lens of analysis is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.033,
    "end": 739.362,
    "text": "You have some people who focus heavily on the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 739.342,
    "end": 741.885,
    "text": " you have some people focus on what's called the particle state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 741.925,
    "end": 743.267,
    "text": "So that includes the blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.287,
    "end": 750.415,
    "text": "And then you have some people like a Maxwell Ramsey, who says, Well, really, the currency is about the Markov across the Markov blanket, the internal and external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.756,
    "end": 766.615,
    "text": "And that you can almost cost us, you know, we talked about nested Markov blankets, well, that itself is a Markov blanket, which leads me to question, you know, in the classical literature about autopoiesis and operational closure, people talk about the cells production of its cell membrane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.303,
    "end": 770.788,
    "text": " which relies on the metabolic activity of the cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.309,
    "end": 777.318,
    "text": "But the metabolic activity of the cell can only happen if there is a coherent cell membrane that separates it from its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.099,
    "end": 780.823,
    "text": "But that again gives us this very internalist view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.965,
    "end": 794.003,
    "text": "Is it misspeaking to say that why don't we just say that operational closure can expand beyond the skin and we could just be operationally closed in some sense with our eco niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 796.126,
    "end": 799.833,
    "text": " Is that reasonable or is that just stretching the meaning of these terms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.256,
    "end": 810.253,
    "text": "Well, let's back up to what you said about perceptual inference and the KL divergence and think about how to understand that part of the free energy mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.706,
    "end": 830.298,
    "text": " So in the work that I did with Yala Brownaber, we tried to understand the difference between the actual posterior and your inferred posterior in terms of the disattunement, as we describe it, between the internal dynamics and the external dynamics of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.398,
    "end": 835.566,
    "text": "So the actual posterior there is describing the external dynamics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.968,
    "end": 841.935,
    "text": " and your inferred posterior is corresponding to the internal dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.076,
    "end": 854.571,
    "text": "So then we can unpack what KL divergence is within this larger agent environment system in terms of this mismatch between the internal and external dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.512,
    "end": 858.596,
    "text": "So I think it's a consequence of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.616,
    "end": 862.701,
    "text": "And Carl sometimes says this explicitly when he's writing about niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.272,
    "end": 873.746,
    "text": " that not only is the agent a model of its environment, but it applies the other way around as well, that the environment is a model of agents that inhabit it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.667,
    "end": 888.486,
    "text": "So when we're thinking about the environment side of things, obviously we can't focus on an individual agent because that would then lead to some kind of solipsism that actually you talked about in your discussion with Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.972,
    "end": 896.609,
    "text": " But so we shouldn't think about the environment as predicting agents just by focusing on single agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.71,
    "end": 906.171,
    "text": "We should instead think of groups, communities, practices and so on as where or how the niche is constructed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 906.775,
    "end": 928.142,
    "text": " And then thinking about the niche that's constructed through cultural evolution in part, through practices, you could start to see how there's a symmetry so that the environment could have a kind of dynamics, an external dynamics, which begins to predict what individual agents are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.983,
    "end": 930.545,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.565,
    "end": 931.245,
    "text": "Yeah, it's very nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.286,
    "end": 931.686,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.088,
    "end": 934.471,
    "text": " this makes me think that number of things that come into my head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 934.591,
    "end": 938.216,
    "text": "One is, there's this thing called, for some reason, I've been getting kind of into the maths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.079,
    "end": 943.243,
    "text": "To my, you know, I shouldn't be but I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.283,
    "end": 948.83,
    "text": "But as I recently spoke to Lance, and there was a lot of mass preparation I needed to do for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.431,
    "end": 953.817,
    "text": "I stumbled across something called an Fisher information metric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 954.117,
    "end": 956.34,
    "text": "You familiar what a Fisher information metric is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.32,
    "end": 983.948,
    "text": " no because you're very much like no but you'll really like this the fisher information metric basically it's very simple it tracks how your kl divergence is doing over time so i think this fits in very nicely of what you're talking about with attunement because you talk about you and mark and eric talk about prediction error uh sorry aerodynamics aerodynamics exactly yeah but that that implies over some oh you know some diachronic over timeness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.367,
    "end": 996.704,
    "text": " And this Fisher information metric basically tracks that in mathematical terms, which is how much, you know, how great or how much bigger or how much smaller is your KL divergence becoming over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.724,
    "end": 997.705,
    "text": "So I thought you would enjoy that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.588,
    "end": 1000.249,
    "text": "Wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.269,
    "end": 1001.391,
    "text": "Let's go there eventually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.911,
    "end": 1002.292,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.692,
    "end": 1003.373,
    "text": "Yeah, we will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.215,
    "end": 1012.386,
    "text": "Yeah, because that's going to connect with some other things we wanted to talk about later on about play and intrinsic motivation, foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.367,
    "end": 1013.968,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.168,
    "end": 1020.717,
    "text": " So the other thing that Yeah, so the other thing that came into my mind is a proposal that I made to jump a vacay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.398,
    "end": 1024.422,
    "text": "This this one, again, this is an this is sort of a live question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.522,
    "end": 1034.696,
    "text": "It was a philosophical pondering, but I quite like it, which is that our intuitions tell us that we self evidence given are the observations we make of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.317,
    "end": 1039.062,
    "text": "So and that includes interoceptive observations, extra receptive and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.666,
    "end": 1045.333,
    "text": " My proposal is that certain aspects of the environment also self evidence given the observations that they make of us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.994,
    "end": 1048.757,
    "text": "And the example that I give of that is the rock is the climbing wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.438,
    "end": 1056.326,
    "text": "So my idea here is that sure, the climbing wall provides the necessary affordances for the agent to self evidence as a rock climber.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.227,
    "end": 1061.953,
    "text": "But the rock climber provides the necessary affordances for the climbing wall to self evidence as a climbing wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.095,
    "end": 1064.256,
    "text": "Now, this might be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.333,
    "end": 1068.618,
    "text": " some it might sound highfalutin and actually be quite dull.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.239,
    "end": 1083.139,
    "text": "But I think in that it touches upon what you were saying about the environment in being shaped through niche construction, as you say, can begin to manifest prediction dynamics of the actual agents within it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.042,
    "end": 1085.603,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.937,
    "end": 1097.232,
    "text": " I mean, the key thing about niche construction is that we're actively modifying, changing our environment in ways that contribute to prediction error, free energy mobilization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.252,
    "end": 1100.936,
    "text": "And we put these footholds in place in the climbing wall and these finger holds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.017,
    "end": 1109.127,
    "text": "And in many ways, that permits a wall that in its own evolution would never be a climbing wall to become a climbing wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.596,
    "end": 1109.897,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.017,
    "end": 1110.678,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.698,
    "end": 1111.079,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.099,
    "end": 1112.341,
    "text": "I, I really liked this notion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.361,
    "end": 1119.555,
    "text": "Well, it is a, you know, it can be seen as a, as predicting the trajectory of the agents movements up the climbing wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.517,
    "end": 1120.998,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.018,
    "end": 1121.258,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.06,
    "end": 1122.361,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.501,
    "end": 1131.418,
    "text": "I, I guess the issue that a lot of people have here is structured in a way that, that does predict well, that does some of the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.77,
    "end": 1134.433,
    "text": " that otherwise would have to be done by the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.934,
    "end": 1138.478,
    "text": "So this is like a classic way of thinking about the extended mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.139,
    "end": 1147.408,
    "text": "You asked me about the four E's and how to understand the four E's and we started with autonomy, but we could move to extended mind here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.909,
    "end": 1148.209,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.27,
    "end": 1156.579,
    "text": "In that one of the ways in which extended mind is classically understood is by thinking about the offloading",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.913,
    "end": 1179.58,
    "text": " of computation that would otherwise need to be done by the the brain onto structures in the environment that's then simplified the kinds of inferences computations that the brain has to perform so your climbing wall example i think is an excellent example of this kind of um offloading of computation onto the structure in the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.252,
    "end": 1187.781,
    "text": " Yes, I so extended, I've been thinking about the extended mind hypothesis, quite a bit, I plan on doing some writing over it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.821,
    "end": 1192.786,
    "text": "And I think the big debate here is where we cost what Jakob Harry would call the evidential boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.787,
    "end": 1201.636,
    "text": "So his notion is, is that, in a very internalist way, what you might say is that the mind is doing the prediction, and everything else is being predicted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.656,
    "end": 1209.145,
    "text": "That's why you cost your evidential boundary, because it can't be the case that the body is both predicted, predicting and predicted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.732,
    "end": 1226.141,
    "text": " And then you have someone like Andy Clark who goes, well, um, you know, the parity principle, if my notebook is doing as good a job as my hippocampus and that acts, you know, as part of my cognition and, and in terms of active inference, we could say, well, that becomes part of my predictive schema.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.203,
    "end": 1234.896,
    "text": "Do you take a particular, do you adopt a kind of fine line or a bright line as to where you cost your evidential boundary?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.31,
    "end": 1247.341,
    "text": " Well, this goes back to the Varela quote again, actually, interestingly, because what Jacob is saying is that we should put the Markov blanket around the dorsal horn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.881,
    "end": 1257.01,
    "text": "And that's the candidate that he gives for where the Markov blanket might be relative to which self-evidencing then takes place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.171,
    "end": 1266.199,
    "text": "So that would then imply that anything that I'm describing as offloading is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.803,
    "end": 1277.296,
    "text": " an example of self-evidencing where the structure of the environment is causally very important, but it isn't actually part of what's doing the self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.738,
    "end": 1287.088,
    "text": "So the way to think about that is in terms of this notion of embedding rather than extending the mind or extending cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.108,
    "end": 1288.069,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.37,
    "end": 1309.176,
    "text": " So, so Jakob could well agree that, um, that the environment here is causally very important and the way that the environment is structured, but all of the inference is now going to be done, uh, uh, through processes that, that are mediated by exchanges between the brain and the body at the dorsal horn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.158,
    "end": 1314.122,
    "text": "And, you know, well, there's many things to say about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.684,
    "end": 1317.246,
    "text": "So, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.985,
    "end": 1327.708,
    "text": " One thing I want to point to is a paper in Synthesa and also the book that I wrote with Michael Kirchhoff where we argue that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.207,
    "end": 1353.814,
    "text": " there's reasons to think that the self-evidencing system is an agent again, and that that agent can incorporate into its body resources that are external to the body so that they become part of what's doing the self-evidencing or what's doing the inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.794,
    "end": 1374.38,
    "text": " If you think, going back to where we started, that the free energy minimizing system is an agent, an agent that has this property of biological autonomy rather than heteronomy, and I didn't answer your question of what heteronomy is, so we'll come back to that in a minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.961,
    "end": 1380.628,
    "text": "But if you think that the free energy minimizing system is biologically autonomous,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.115,
    "end": 1394.491,
    "text": " then that system can begin to have an organization that incorporates resources that are external to the organism in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.952,
    "end": 1407.887,
    "text": "And those resources can include things like the structure of the climbing wall or the white lines that are painted onto the road that you use to simplify your driving behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.428,
    "end": 1410.21,
    "text": "You just follow the white lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.697,
    "end": 1416.926,
    "text": " That gives you a very simple heuristic that you can use for minimizing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.908,
    "end": 1419.129,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.991,
    "end": 1426.419,
    "text": "One paper that's really informed my thoughts on this is Andy Clark's How to Knit Your Own Markov Blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.899,
    "end": 1436.012,
    "text": "It's a wonderful kind of deflation of all the tensions in this area because you can just say, well, the Markov blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.228,
    "end": 1442.318,
    "text": " is an abstraction in the sense that it's always embedded within another Markov blanket, which is always embedded within another Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.639,
    "end": 1448.268,
    "text": "And where you choose to cast that Markov blanket, as we've discussed many times on this podcast can be often just an instrumental tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1450.091,
    "end": 1456.422,
    "text": "But more importantly, that is, if we do take it seriously, that there is a Markov blanket, it doesn't need to be fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.163,
    "end": 1462.472,
    "text": "So we can have a process ontology rather than a substance ontology, whereby when I'm in my car,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1463.38,
    "end": 1469.807,
    "text": " For me to self-evidence, I incorporate the car's dynamics so that me and the car, it's sort of recursive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.368,
    "end": 1477.857,
    "text": "My sort of A and B becomes a new A. And we can scale this way all the way up to social or global dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.478,
    "end": 1486.667,
    "text": "But I think the important point is no one's asking anyone to find the one Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.808,
    "end": 1489.27,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.127,
    "end": 1492.21,
    "text": " There's going to be a nesting of Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.23,
    "end": 1493.191,
    "text": "That's absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.872,
    "end": 1506.527,
    "text": "And once you start to see how Markov blankets are nested, then you can start to think about, well, what's the relationship between the Markov blankets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.547,
    "end": 1517.721,
    "text": "And that's where we've argued you can get an account of how to formalize autonomy using the Markov blanket concept, because you can start to think about how the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.528,
    "end": 1528.781,
    "text": " the sensory and active states that are forming the Markov blanket enter into these kind of reciprocal relations of dependence that the organization of the system then depends on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.542,
    "end": 1540.697,
    "text": "So you can start to get a formalization of operational closure out of the relationship between the different Markov blankets in a system that has a nested Markov blanket organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.317,
    "end": 1543.32,
    "text": "So that's one thing that you can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.435,
    "end": 1555.667,
    "text": " And also do what we've been talking about here of thinking about how some of the Markov blankets in this complex system are going to be located outside of the boundaries of the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.809,
    "end": 1569.021,
    "text": "So the sensory and active states that are forming the Markov blanket could start to be outside of the sensorium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.254,
    "end": 1571.497,
    "text": " So think about a spider and its web.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.517,
    "end": 1583.43,
    "text": "That's the example that Michael used as a very intuitive example of this, that the spider can start to use the movements in the web as its sensory and active states to catch prey, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.132,
    "end": 1590.358,
    "text": "So then the web and the spider are forming a single system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.378,
    "end": 1596.645,
    "text": "There's a kind of extended phenotype that forms between the spider and the web.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.705,
    "end": 1601.33,
    "text": " And also his notebook can also be described in this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.41,
    "end": 1618.394,
    "text": "So the sensory and active states that form the boundary of the extended cognitive system could now involve the notebook and the writing down of things in the notebook, the looking up of information in the notebook and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.756,
    "end": 1620.016,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.457,
    "end": 1620.877,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.897,
    "end": 1622.86,
    "text": "See, the thing is, I like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.92,
    "end": 1626.345,
    "text": "My only sort of naive reticence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.528,
    "end": 1628.65,
    "text": " is because we're conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.792,
    "end": 1632.014,
    "text": "And this is such a sticking point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1632.374,
    "end": 1641.564,
    "text": "But I think where some of the corticocentrism comes from is the kind of presumption that- I know you've said this before, but you know that Michael and I argue for extended consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.664,
    "end": 1644.507,
    "text": "So maybe we get there a bit later on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.567,
    "end": 1653.497,
    "text": "There's one more thing I want to say about the extended mind and how active inference is relevant to the extended mind discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.967,
    "end": 1660.377,
    "text": " And this relates to the idea of recruitment of external resources and how recruitment works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.417,
    "end": 1674.26,
    "text": "So for a long time, Andy Clark's argued that the brain is a kind of lazy brain that tries to simplify its computations as much as possible for evolutionary reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.201,
    "end": 1681.071,
    "text": "So you could relate it to the principle of least action, probably this idea of efficient computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.507,
    "end": 1690.476,
    "text": " And sometimes to efficiently compute, it makes sense to offload that computation onto the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.197,
    "end": 1699.926,
    "text": "So this is classic kind of situated cognition idea that goes back to the 1990s, maybe even further back than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.707,
    "end": 1709.235,
    "text": "So how do you then weigh up what's going to be the most efficient way to solve a problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.992,
    "end": 1720.143,
    "text": " Do you solve the problem just by relying on your onboard biological hardware or do you offload the problem solving onto the world and recruit external resources?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.744,
    "end": 1735.02,
    "text": "So this is called the recruitment problem because it's a problem about how you soft assemble a cognitive system on the fly in such a way as to, as efficiently as possible, compute a solution to a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.861,
    "end": 1757.19,
    "text": " And what Andy Clark's been arguing in recent work is that the recruitment problem is solved by your imperative to minimize prediction error over time, to minimize expected prediction error or expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.991,
    "end": 1761.936,
    "text": "So we can give a kind of account of how it is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.152,
    "end": 1781.41,
    "text": " cognitive systems whose boundaries extend beyond the organism come to recruit certain external resources to solve problems in terms of free energy minimization or in terms of expected free energy minimization that can become a policy that's inferred that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.778,
    "end": 1792.752,
    "text": " The most efficient way to solve a problem is by recruiting external resources that simplify the computations that would otherwise have to be done inside of the hedge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.814,
    "end": 1795.436,
    "text": "That's really, really nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1795.596,
    "end": 1797.338,
    "text": "I'm writing that down because I really like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1798.7,
    "end": 1799.02,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.181,
    "end": 1800.262,
    "text": "That's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.462,
    "end": 1800.662,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.263,
    "end": 1801.604,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.824,
    "end": 1809.153,
    "text": "There's a paper that we can link you to in the Australasian Journal of Philosophy that Andy published, I think, last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.434,
    "end": 1809.574,
    "text": "Please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.297,
    "end": 1814.049,
    "text": " There's a reply to Jakob Hoey as well called Busting Out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.651,
    "end": 1814.872,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.554,
    "end": 1818.945,
    "text": "That also makes these same sorts of arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.105,
    "end": 1823.158,
    "text": "And in that paper, Andy ties it to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.307,
    "end": 1831.08,
    "text": " uh, precision and to precision as kind of sculpting the effective connectivity of the brain in a context sensitive way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.961,
    "end": 1843.78,
    "text": "So he has the idea that when you're computing precision, sometimes those computations will lead you to, to increase the game on, um, on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.532,
    "end": 1854.722,
    "text": " Well, I'm going to put it in terms of the sensory and active states that are external to the body and that relate to the structure in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.563,
    "end": 1860.409,
    "text": "So then, as you put it before, the Markov blanket is not fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.509,
    "end": 1864.794,
    "text": "It kind of extends to include those resources in the external environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.095,
    "end": 1872.282,
    "text": "Although, that said, there's a way of modeling sort of a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.751,
    "end": 1882.662,
    "text": " Bayesian graph, for example, or POMDP scheme, whereby that which you deploy precision waiting over is not necessarily incorporated into your own Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.742,
    "end": 1901.863,
    "text": "So there's a really nice paper by MIT and colleagues 2019, where they talk about selective attention, and how selective attention needs to be governed by the capacity for cognizers to, to pay or to down regulate task irrelevant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1902.265,
    "end": 1903.166,
    "text": " objects, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.627,
    "end": 1911.354,
    "text": "But that doesn't mean that the task irrelevant objects are automatically incorporated within the self Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1911.475,
    "end": 1915.198,
    "text": "It's just that they have gain control, or there's gain control over them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.199,
    "end": 1931.175,
    "text": "No, but I was thinking about a different case where it's not so much the task irrelevant objects that you are now disattending to, but the task relevant objects that you're attending to, and how the precision mechanism can be what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.442,
    "end": 1957.467,
    "text": " explains how those task relevant objects get to become a part of an extended cognitive system so it's the opposite of the case that you were describing where they were describing how task irrelevant objects are not selected yeah now i'm thinking about the case where a task relevant object that is external to the body like the book or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.733,
    "end": 1981.48,
    "text": " spiders web are now attended to because they are precisely because they're task relevant they allow you to to solve a problem in a much more efficient way than you would if you just relied on your brain to clarify um i i was sort of introducing it as the kind of down rating of task irrelevant um objects but it's it's a zero-sum game",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.932,
    "end": 1984.074,
    "text": " So yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.434,
    "end": 1984.875,
    "text": "Oh, I see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.095,
    "end": 1986.216,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.456,
    "end": 1990.48,
    "text": "I guess it's all relative on the task relevant stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.92,
    "end": 1991.16,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.461,
    "end": 1991.701,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.901,
    "end": 1994.223,
    "text": "I think I won't misspeak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.323,
    "end": 1999.688,
    "text": "People can see it themselves, but the outcome is the same in the sense that it's all relative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.748,
    "end": 2001.129,
    "text": "So precision is a zero sum game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.149,
    "end": 2003.371,
    "text": "So if it goes down here, it's going to go up here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.493,
    "end": 2008.016,
    "text": "What I'm saying is you don't want to include the task irrelevant stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.056,
    "end": 2008.196,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.216,
    "end": 2009.057,
    "text": "So that's exactly that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.438,
    "end": 2010.538,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.957,
    "end": 2023.397,
    "text": " you do want to include the task relevant stuff that's what the soft assembly of the cognitive system is it's the it's the selecting what's relevant to your problem solving in this context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.664,
    "end": 2028.23,
    "text": " I guess my question here is, does it make a difference whether we downregulate task-irrelevant objects?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.891,
    "end": 2044.451,
    "text": "Because in doing so, if we just think of a landscape where everything is equal, in pressing these down, you get relative gain on those which have not been suppressed versus actively inflating the precision of task-relevant objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.471,
    "end": 2047.275,
    "text": "Do we not get the same outcome just in relative terms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.376,
    "end": 2052.321,
    "text": "So I think what's super interesting here is that precision turns out to be doing what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.638,
    "end": 2054.96,
    "text": " John Vivecki calls relevance realization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.061,
    "end": 2068.874,
    "text": "So the model that you've just been talking about is which prediction errors should be treated as salient or reliable so that they get to influence future processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.176,
    "end": 2079.625,
    "text": "And so you are focusing on the error signals which are downweighed, so not treated as salient because they're task irrelevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.689,
    "end": 2084.698,
    "text": " I've been talking about the error signals, which, where you turn up the gain because they are salient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.918,
    "end": 2085.359,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.379,
    "end": 2086.02,
    "text": "They are relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.06,
    "end": 2097.24,
    "text": "So this is part of the problem of how, as Viveky calls it, how do we solve the, in a particular context, the problem of what's relevant and what's irrelevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.541,
    "end": 2098.041,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.062,
    "end": 2099.244,
    "text": "The frame problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.264,
    "end": 2100.185,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.205,
    "end": 2100.406,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.446,
    "end": 2101.808,
    "text": "No, you might.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2101.828,
    "end": 2103.09,
    "text": "Indeed, you might well be right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.11,
    "end": 2103.992,
    "text": "The mere turtle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.799,
    "end": 2107.142,
    "text": " 2019 with Frist and frame it that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.262,
    "end": 2125.046,
    "text": "Again, it's been a while since I read it, but it converges on the same point, which is that the human organism, the cognizer has the capacity, even before it even glances over, even before it does the ISA card to have this disambiguation, which I just think is stunning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.406,
    "end": 2134.198,
    "text": "And I think you can scale that up towards the fact that in the classical bias competition theory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.55,
    "end": 2145.686,
    "text": " Desimone and Duncan basically just postulate that goal representations inflate the stimuli that correlate with the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.287,
    "end": 2155.039,
    "text": "So if I'm looking for my ginger friend, I have this template of ginger and everything orange or ginger starts increasing in game control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.439,
    "end": 2158.043,
    "text": "What active inference gives you is a really nice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.411,
    "end": 2177.601,
    "text": " I think it gives you a really nice way of modeling that although I don't think it's been done yet, which relies on sort of deep parametric modeling, and about mental action yielding precision waiting over sensory expectations, I might have a mental action, okay, I want to have high precision over anything that's ginger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.323,
    "end": 2181.888,
    "text": " And then in turn, I'm going to act so as to confirm that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.469,
    "end": 2188.517,
    "text": "I think the other thing just for the audiences and something that has really become quite clear to me is there's a difference between precision and precision weighting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.298,
    "end": 2193.063,
    "text": "And this is something that I think needs to be articulated a little bit more in the active inference literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.484,
    "end": 2199.252,
    "text": "Insofar as precision is just the inverse entropy of a probability distribution, or you can just say it's standard deviation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.856,
    "end": 2205.446,
    "text": " But precision weighting is actually the deployment of, well, it could be considered gain control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.867,
    "end": 2210.835,
    "text": "But gain control is not just based on the precision of a signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.517,
    "end": 2220.312,
    "text": "People talk about attention being the optimization of what's called the A matrix, which is the likelihood distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.697,
    "end": 2225.326,
    "text": " So given a state, what's the likelihood of this observation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.887,
    "end": 2231.658,
    "text": "But just having a really strong one-to-one mapping between those two doesn't mean you're going to pay attention just to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.099,
    "end": 2240.595,
    "text": "Because if I'm looking for my ginger friend, there might be loads of things out there which have very precise mappings to their causes, but I'm ignoring them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.757,
    "end": 2246.104,
    "text": " So they might be very precise observations, but they don't matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.627,
    "end": 2255.18,
    "text": "So that's just to say that I think at least it needs to become more articulated within the literature exactly what this difference is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.701,
    "end": 2259.507,
    "text": "Although, as I said, the deep parametric modeling of it hasn't been done yet, as far as I'm aware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.269,
    "end": 2262.072,
    "text": "So there's plenty of work to be done there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.092,
    "end": 2264.035,
    "text": "But yeah, John, this is right up John's street.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.74,
    "end": 2265.684,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.286,
    "end": 2273.114,
    "text": "What you said there about it, if you're interested in finding your friend with ginger hair, that's the thing that matters to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.375,
    "end": 2275.223,
    "text": "So that's vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.422,
    "end": 2304.957,
    "text": " that's really in an important point because it makes the connection between attention and uh and your goals yep yeah and it also makes the link between attention and what you care about so what matters to you and yeah as an agent and so finding your friend matters to you that's something that you care about yeah yeah yeah friend so there's a link here between precision and an emotion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.937,
    "end": 2312.871,
    "text": " which I think in the work I've been doing with Mark Miller, we would argue leads to an embodied view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2312.951,
    "end": 2316.677,
    "text": "So going back to the E's, now we could think about the E of embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.819,
    "end": 2327.316,
    "text": "We can also think about the E of extendedness some more here, but thinking about the E of embodiment, the reason that we should think of precision as embodied is because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.296,
    "end": 2335.23,
    "text": " And what you care about is sculpting, modulating what is given precision in a particular context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.232,
    "end": 2341.862,
    "text": "So in your example, what's given precision is finding your friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.062,
    "end": 2350.97,
    "text": " And that's given precision because that matters to you, because that's important to you, because you care about your friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.491,
    "end": 2357.536,
    "text": "Because we're autonomous, because we act according to our own norms and values, which we've made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.877,
    "end": 2358.277,
    "text": "That's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.317,
    "end": 2359.078,
    "text": "That's part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.498,
    "end": 2370.128,
    "text": "So people talk about autonomy as then entailing sense making or meaning making, because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.243,
    "end": 2380.592,
    "text": " based on your autonomy, there are then norms, meanings, values that become intrinsic to your biological organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.653,
    "end": 2400.25,
    "text": "So in this case, the value of your friend, your caring about your friend, can be thought of as something that falls out of the free energy minimizing machinery, because that machinery is the machinery of an autonomous being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.23,
    "end": 2408.301,
    "text": " values, meaning and so on become intrinsic to the sustaining, the maintaining of the organization of that being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.901,
    "end": 2409.122,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.682,
    "end": 2414.449,
    "text": "I'm going to spitball an idea and I'm curious about what you think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.469,
    "end": 2419.335,
    "text": "So people take this idea of the relationship between attention and values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.585,
    "end": 2422.308,
    "text": " and inflate it quite strongly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.389,
    "end": 2433.202,
    "text": "And I don't mean that in a disparaging way, because I think some of the work is very powerful, but for example, someone like a Jordan Peterson or Jonathan Pajot, or even John Vivecki might say, well, what is sacred?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.242,
    "end": 2439.41,
    "text": "The term sacred is that which you pay most attention to, or that which captains or that which governs your attentional schema.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.311,
    "end": 2443.215,
    "text": "So for example, you could have a hierarchy of values.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.575,
    "end": 2444.817,
    "text": "So why do I want to earn money?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.117,
    "end": 2446.739,
    "text": " because I want to go on holiday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.779,
    "end": 2447.82,
    "text": "Why do I want to go on holiday?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.901,
    "end": 2448.962,
    "text": "Because I want to be happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.002,
    "end": 2449.863,
    "text": "Why do I want to be happy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2449.883,
    "end": 2451.725,
    "text": "And then Aristotle would say, well, that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.306,
    "end": 2452.667,
    "text": "You got it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.928,
    "end": 2465.663,
    "text": "Do you think that's a viable way of recapturing the idea of the sacred, if that means anything to you, in terms of computational attentional mechanisms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.866,
    "end": 2469.027,
    "text": "Wow, that's a big question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.267,
    "end": 2471.31,
    "text": "I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.999,
    "end": 2479.579,
    "text": " So how do we get to wisdom and the sacred and so on from this kind of computational machinery?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.778,
    "end": 2483.001,
    "text": " I think there's an interesting story to be told about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.042,
    "end": 2485.884,
    "text": "And I think we can get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.845,
    "end": 2504.723,
    "text": "But it requires a number of different steps along the way to connect attention as it's modeled using precision to attentional schemes, as you just described them, that could be shaped by religious beliefs, for instance, and beliefs in the sacred and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.504,
    "end": 2509.768,
    "text": "And no, I think we can go there because,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.153,
    "end": 2528.348,
    "text": " This free energy principle, once you think of Markov blankets as nested, can be applied to very complex groups, communities, by thinking about how the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.783,
    "end": 2542.317,
    "text": " agents that make up that group are now part of collective systems where it makes sense to think of those collective systems as also minimizing expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.058,
    "end": 2557.052,
    "text": "So one of the routes I would go here would be to think about cultural ecosystems and think about what you just called the sacred and the sorts of attentional schemas that are involved there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.64,
    "end": 2564.313,
    "text": " in terms of these, these larger collective, um, free energy minimizing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.736,
    "end": 2565.937,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.177,
    "end": 2568.041,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.061,
    "end": 2574.113,
    "text": "And then going back to the individual, um, and how,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.751,
    "end": 2580.023,
    "text": " and an individual may have an experience of the sacred, how to make sense of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.885,
    "end": 2590.988,
    "text": "Well, you're getting into very deep aspects of consciousness when you think about subjective experiences of the sacred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.39,
    "end": 2594.315,
    "text": " and very deep notions of meaning-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.136,
    "end": 2610.642,
    "text": "And your friend example that got us into this was an example of a source of meaning in people's lives which comes from the social connectedness between people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2610.682,
    "end": 2612.445,
    "text": "That's a source of meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.407,
    "end": 2617.313,
    "text": "But obviously the sacred is also a profound source of meaning for people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.394,
    "end": 2619.817,
    "text": " But it's a very thick concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.618,
    "end": 2640.702,
    "text": "So how to make sense of the kind of meaning that people get from the sacred and the meaning in life that that gives people using these ideas of predictive processing would require a much more complex story than how the value that we place in our connectedness to one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.137,
    "end": 2653.908,
    "text": " Um, that could be traced back to something that's more, I think, to do with primary emotions, our basic emotions to go to the emotion literature, something that we see in animals as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.509,
    "end": 2669.862,
    "text": "And that probably is tied to neurotransmitters, but the sacred, um, the kind of meaning that people find in the sacred to account for the way that that gives meaning to people's lives in terms of predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.432,
    "end": 2674.538,
    "text": " I think can be done, but it requires a much more complex story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.9,
    "end": 2686.615,
    "text": "Yes, I think some of that story will come, one, from your notion of nested affordances, but not that these nested affordances are separate from one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.635,
    "end": 2698.212,
    "text": "There's a very important idea in predictive coding literature that the higher levels of the predictive coding hierarchy contextualize and constrain the activity at the lower levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.867,
    "end": 2703.436,
    "text": " So for example, I have a and the higher levels track longer term regularities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.298,
    "end": 2708.246,
    "text": "So they're slower, they're more entrenched.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.266,
    "end": 2713.175,
    "text": "And they constrain and contextualize what happens with the tracking of slower, faster fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.216,
    "end": 2714.137,
    "text": "To give an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.081,
    "end": 2718.807,
    "text": "I might I've written this actually in this new paper that I've written.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.248,
    "end": 2719.508,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.927,
    "end": 2747.335,
    "text": " my beliefs that i want to go to france in june is based off a higher order belief that summer in france is quite a nice experience and that is going to constrain every action that i do so it's going to constrain the way that i go on skyscanner and book my flight but then the other important thing is that those lower levels also interact with the higher levels so i again i give this example if it rains every day in june in nice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.652,
    "end": 2755.262,
    "text": " I'm probably going to take out an umbrella on July 1st, despite the fact that I had this high order belief that it's always sunny in France in the summer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2756.023,
    "end": 2767.939,
    "text": "So I think this trickling prediction down and the cascading or the movement up of prediction error is maybe where this answer is going to lie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.1,
    "end": 2778.013,
    "text": " why, as you say, why we get this notion of meaning in life or the sacred or this particular phenomenological essence, I think is up for grabs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.814,
    "end": 2780.757,
    "text": "I don't think anyone knows as of yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.158,
    "end": 2786.966,
    "text": "But I think it is going to be done in this kind of deep in the modeling sense is deep parametric modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.986,
    "end": 2788.729,
    "text": "So something akin to what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.587,
    "end": 2800.532,
    "text": " I think what I like about what you just said was that when you think about the experience of the sacred, it seems that there's a whole rich story to be told there about what the sacred is exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.592,
    "end": 2802.617,
    "text": "So you're looking at a narrative of some sort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.739,
    "end": 2806.726,
    "text": "And there's a good argument for thinking at least in terms of the self model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.107,
    "end": 2807.207,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.187,
    "end": 2827.407,
    "text": " what you find that the the higher layers of the self model are going to be narrative type structures that connect your self in the past to who you are in the present where you're going in the future so where are you going on holiday in your example so it's the there's a narrative structure to uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.045,
    "end": 2836.576,
    "text": " both to the experiences of the sacred, I would argue, and to what you're doing when you're planning your summer holiday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.778,
    "end": 2841.062,
    "text": "And so how would we think about a narrative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.122,
    "end": 2856.482,
    "text": "Well, you could think about that just within the individual in terms of, for instance, the mental time travel idea, the mode network that is involved both in imagining the future and in remembering the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.462,
    "end": 2862.235,
    "text": " So you could think of the process of constructing a narrative as just something that happens within the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.276,
    "end": 2869.392,
    "text": "Or you can think, no, when it comes to very complex experiences like the experience of the sacred,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.777,
    "end": 2893.32,
    "text": " The construction of the narrative there is something that involves a much larger system, a collective system, where the beliefs about the sacred that are used to make inferences, for instance, are ones that we need to explain in terms of some dynamics of a larger collective system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.891,
    "end": 2897.081,
    "text": " Uh, so what's at the top, I think is what I'm asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.682,
    "end": 2904.964,
    "text": "You have the idea that the top layers of the generative model are constraining, um, the.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.311,
    "end": 2933.938,
    "text": " decision making the selection inference of policies at the lower levels and that's that's absolutely right but what's at the top can be thought of using the idea of andreas rubstorff and uh and chris frith in terms of what they call uh top top interactions so they can be thought of in terms of interactions that take place within cultural systems or within a cultural ecosystem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.863,
    "end": 2952.499,
    "text": " And so to make sense of this kind of experience in terms of the inferential processes that minimize free energy, we need to look at a much larger collective system here, not just a system inside of the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.899,
    "end": 2964.55,
    "text": "And that's another way of thinking about extended mind, where we're thinking of mind here as distributed over a cultural ecosystem, not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.614,
    "end": 2966.677,
    "text": " as something that's inside of individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.898,
    "end": 2968.839,
    "text": "Yes, that's wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.06,
    "end": 2969.66,
    "text": "That's wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.721,
    "end": 2969.941,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.041,
    "end": 2972.684,
    "text": "So I've been thinking a lot about these self models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.744,
    "end": 2977.811,
    "text": "But I think you're absolutely right, the sacred taps into self evidencing of almost a world model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.632,
    "end": 2987.623,
    "text": "A world model that is not not for one, but for what you call what Wittgenstein and you guy and you call a way of life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.025,
    "end": 2990.487,
    "text": "Life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.77,
    "end": 3020.76,
    "text": " form of life way of life i love as well but a form of life form of life i was literally thinking i'm not going to mess that one up okay a form of life in the sense that a form of life isn't it's connected with a way of life certainly the sacred is connected with the way of life sure but yeah yeah go ahead form of life where we define that as um as a a regular pattern of activity that can be found within a a group or a community right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.55,
    "end": 3025.754,
    "text": " So perhaps the notion that scales, but you can apply it at a collective level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.774,
    "end": 3035.544,
    "text": "That's the key idea that's relevant here as a species, as a form of life or as members of that form of life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.564,
    "end": 3037.607,
    "text": "So individuals as forms of life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.867,
    "end": 3048.638,
    "text": "And when we think about autonomy, again, biological autonomy, that's, that's a way of thinking about what form of a form of life is at the scale of an individual organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.445,
    "end": 3050.907,
    "text": " So it's a scaling notion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.967,
    "end": 3072.077,
    "text": "Like the Markov blanket is a scaling notion because it can be applied to very big things like economies and ecosystems, and it can be applied to very small things like cells or molecules, particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.289,
    "end": 3076.012,
    "text": " Yeah, this is super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.853,
    "end": 3078.175,
    "text": "Again, yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.195,
    "end": 3079.677,
    "text": "Scale is really the relevant thing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.217,
    "end": 3088.627,
    "text": "The question is, what is at the highest level of the form of life's generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.929,
    "end": 3091.891,
    "text": "And there are answers that some people have posited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.971,
    "end": 3094.234,
    "text": "I mean, consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.227,
    "end": 3106.823,
    "text": " There's this idea, at least, I don't think they would have expanded this to a panpsychist view, but it certainly lends, I would say, some, it leans quite heavily on panpsychism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3107.043,
    "end": 3113.292,
    "text": "Maxwell Ramstein and Mal Albaraz in this notion that consciousness is the uppermost Markov blanket in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.313,
    "end": 3124.727,
    "text": "Well, this is not too dissimilar to someone like Jordan Peterson, who says that the voice of God is actually the voice of consciousness, and that's the guiding spirit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.758,
    "end": 3135.614,
    "text": " So again, we're postulating, but I think there's a really interesting framework set up there for anyone who wants to get into that, which is what is the fundamental thing that's constraining us and contextualizing us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.734,
    "end": 3138.258,
    "text": "And I don't, I just don't think it's survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.638,
    "end": 3141.422,
    "text": "I don't think it can just be biological imperatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.442,
    "end": 3145.348,
    "text": "I think maybe it's just me being romantic, but I sense that it transcends that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.037,
    "end": 3149.883,
    "text": " There are two things I want to say on that before you move on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.605,
    "end": 3151.266,
    "text": "Sure, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.286,
    "end": 3168.214,
    "text": "The first is that going back to the Ropestorff and Frith paper about the top-top interactions, what they were interested in that paper is the idea that what you have at the top in top-down control, they were thinking about executive functions, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.194,
    "end": 3177.607,
    "text": " is something in the prefrontal cortex, for instance, that might be the source of will or willpower or agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.109,
    "end": 3195.771,
    "text": "And they were arguing that actually it makes sense to think that the executive functions could be unfolding not within individuals but within larger groups or within dyads or within social systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.19,
    "end": 3208.68,
    "text": " So the role of executive functioning or top-down control would then be done in interaction with other people rather than as something that unfolds within individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.268,
    "end": 3233.098,
    "text": " And so that's a way of thinking about what's at the top in terms of top-down control or executive functioning, where we think that the executive functioning is now the control processes are in the sense of the thing that might be doing willpower is something that is social and involves social interactions rather than something that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.382,
    "end": 3234.683,
    "text": " happens inside of the head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.823,
    "end": 3235.965,
    "text": "Oh, that's so nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.405,
    "end": 3237.486,
    "text": "Oh, that's, yeah, I like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3237.866,
    "end": 3238.047,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.067,
    "end": 3240.049,
    "text": "That's, yeah, that's really good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.069,
    "end": 3241.77,
    "text": "That's one thing I want to say about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.79,
    "end": 3245.194,
    "text": "And then the consciousness being at the top in top down control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3245.214,
    "end": 3251.8,
    "text": "Well, again, we have this idea of willpower as conscious intention making or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.82,
    "end": 3261.31,
    "text": "And then there's all of the arguments about whether the will is epiphenomenal or is it just an illusion like Daniel Wegner's work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.49,
    "end": 3261.55,
    "text": "And"
  },
  {
    "start": 3262.222,
    "end": 3269.754,
    "text": " And then people that want to say no, the will is tied to consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.774,
    "end": 3282.033,
    "text": "Or people who want to say no, all intentional action is just generated unconsciously and there isn't really any work for the will to do anymore based on like Libet-type arguments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.135,
    "end": 3288.904,
    "text": "So there is a connection between consciousness and this idea of executive functioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.238,
    "end": 3293.104,
    "text": " Uh, not, it's a bit different from what Maxwell and Mauer are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3293.124,
    "end": 3295.507,
    "text": "I think that there is a connection there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.888,
    "end": 3303.94,
    "text": "Maybe it ties more closely with what Adam Saffron tries to do, where he tries to bring this like homunculus ideas together with free will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.08,
    "end": 3306.203,
    "text": "And that's part of his work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.305,
    "end": 3307.525,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.565,
    "end": 3311.511,
    "text": "I mean, I mean, Varela said, well, that we're composed of micro identities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.713,
    "end": 3317.76,
    "text": "Um, I think there's always an open question about how seriously you take this notion of, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3318.415,
    "end": 3345.233,
    "text": " self-construction once you start getting to the very the very top of the very bottom level of the generative hierarchy so what a minimal self model might look like um but that's that's that's a different question maybe we'll come to self-modeling so we wanted to finish the thought on the will and consciousness sorry because i didn't get to the end of it but yeah the thought that the path i was on was that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.158,
    "end": 3348.442,
    "text": " Well, it's going to take us back to narrative again, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.562,
    "end": 3362.326,
    "text": "So if we think about the narrative layers of the self-model, I think there's a good reason to think that they might be where you need to look to understand will, for instance, willpower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.768,
    "end": 3371.642,
    "text": "So Elizabeth Pashery in her work on intention makes this distinction between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.365,
    "end": 3379.836,
    "text": " present-directed and future-directed intentions, which are like what we call plans in Active Inference, the future-directed intentions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.799,
    "end": 3390.371,
    "text": "And those you can think of as coming from your narrative about who you are, those future-directed intentions, like your example of going on holiday to France.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.611,
    "end": 3399.604,
    "text": "That's a future-directed intention that then sculpts the decisions that you make when you go on to your flight booking schedule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.373,
    "end": 3402.114,
    "text": " Oh, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3402.134,
    "end": 3403.957,
    "text": "Let me just pause a minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.197,
    "end": 3406.601,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.621,
    "end": 3409.385,
    "text": "So we're talking about present directiveness and future directiveness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.026,
    "end": 3410.467,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.487,
    "end": 3420.883,
    "text": "And how the narrative might be what connects together your present intentions with your future intentions and your past experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.112,
    "end": 3425.499,
    "text": " I think your example of holidaying in France illustrated that very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.519,
    "end": 3438.404,
    "text": "So you have the past experiences of France being beautiful in the summer, and that then feeds into your plans for the future, leading you to form particular intentions in the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.926,
    "end": 3440.188,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.168,
    "end": 3451.987,
    "text": " So the narrative we can think of as at the higher level, doing the work of controlling planning in a way that you might think of gets you intentional action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.107,
    "end": 3460.52,
    "text": "So actions where you could think that the intention is the cause of your actions, which is what we're looking for when we think about free will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.843,
    "end": 3463.044,
    "text": "That's excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.085,
    "end": 3464.286,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.307,
    "end": 3465.889,
    "text": "I completely agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.19,
    "end": 3467.934,
    "text": " Yeah, there'd be some wonderful ideas here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3468.475,
    "end": 3474.99,
    "text": "Um, so just want to point people in the direction of, uh, Jakub Limanowski's work with Karl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.652,
    "end": 3479.44,
    "text": "They sort of point to, uh, the depth of temporal modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.46,
    "end": 3481.465,
    "text": "Karl has done this in his solo work as well to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.103,
    "end": 3487.631,
    "text": " really what underlies the construction or the generation of what they call an epistemic agent model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.152,
    "end": 3500.43,
    "text": "And this is something that I spoke about in the paper, which is that an epistemic agent model can use past experience, past knowledge to inform allostasis, counterfactual reasoning, and all these things we associate with planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.473,
    "end": 3507.901,
    "text": "But that all comes from this really wonderful work that Karl has done with people like Jakub Lewinowski.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3508.642,
    "end": 3510.565,
    "text": "Okay, that's excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.146,
    "end": 3511.446,
    "text": "Wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.707,
    "end": 3511.907,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.242,
    "end": 3515.468,
    "text": " we're talking exactly the same language, which is which is awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.508,
    "end": 3519.435,
    "text": "Now, I want to go on to something maybe a little different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.397,
    "end": 3526.549,
    "text": "And I'm going to make a I'm going to say a quote, firstly, just to frame the conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3526.99,
    "end": 3531.017,
    "text": "So Lauren Shapiro, who you'll be very, you know, you'll be very aware of his work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3531.538,
    "end": 3532.039,
    "text": "He says,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.289,
    "end": 3539.422,
    "text": " I challenge anyone to explain how I managed recently to travel from Madison to Cologne purely in terms of my sensitive responding to natural signs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.163,
    "end": 3544.831,
    "text": "Now he says this in response in a review of Hato and Mayans books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.953,
    "end": 3551.563,
    "text": "So the 2013 and the 2017 book now I just finished the 2013 book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.387,
    "end": 3558.192,
    "text": " And I've been delving a little bit into the sorts of critiques, so Evans' critiques, Lawrence's critiques.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3558.713,
    "end": 3560.254,
    "text": "But again, I'm not an expert.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.475,
    "end": 3563.778,
    "text": "In my conversation with Chris, I actually had to go back and sort of clarify.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.398,
    "end": 3570.224,
    "text": "But Hato and Maya make this basic point that basal or basic cognition is contentless, representation free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3572.066,
    "end": 3582.175,
    "text": "But you do have these higher order forms of cognition, which are scaffolded of social interactions, symbolic systems, developmental schema, which are basically about public language use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3583.066,
    "end": 3592.056,
    "text": " Now, you, if I speak correctly, have a scepticism of this distinction between higher and lower forms of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.137,
    "end": 3601.987,
    "text": "And you, in your paper on affordances 2014, say, we suggest instead, so you say, we find this commonly made distinction between lower and higher forms of cognition unhelpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.667,
    "end": 3610.336,
    "text": "We suggest instead that the relevant distinction is better marked by differences in level of ability or expertise in doing things with the affordances of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.017,
    "end": 3612.398,
    "text": "So my first question is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.643,
    "end": 3618.372,
    "text": " Do you think that cognition is representation free?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.432,
    "end": 3622.579,
    "text": "And if so, to what degree?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3622.92,
    "end": 3623.661,
    "text": "Is it all of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.861,
    "end": 3625.925,
    "text": "Is it just a lower order, the basic cognition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.586,
    "end": 3631.956,
    "text": "What are your thoughts in that domain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.223,
    "end": 3633.264,
    "text": " representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.304,
    "end": 3635.466,
    "text": "We're going to go into representations now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.486,
    "end": 3636.607,
    "text": "I've been getting really into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.688,
    "end": 3639.61,
    "text": "And I know it's a very hot area and people get angry at each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.63,
    "end": 3641.152,
    "text": "So no one's going to get angry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3641.472,
    "end": 3642.093,
    "text": "And feel free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.133,
    "end": 3643.234,
    "text": "We don't have to go into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.254,
    "end": 3644.575,
    "text": "No, I'm not going to get angry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.836,
    "end": 3645.356,
    "text": "Certainly not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3646.097,
    "end": 3647.218,
    "text": "It doesn't make me angry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.06,
    "end": 3655.807,
    "text": "But the issue comes up when we think about the generative model and what exactly Bayesian priors are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.327,
    "end": 3661.993,
    "text": "So there's this purely statistical understanding of what Bayesian priors are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.973,
    "end": 3677.35,
    "text": " what they turn out to be in the generative model and that i think we can unpack without bringing in anything like representations or content um this is a controversial position so most people would think as soon as you've got an internal model of the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.33,
    "end": 3685.023,
    "text": " then that internal model has to be a representation because they think, well, it meets all of the conditions for representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.103,
    "end": 3694.458,
    "text": "Like, for instance, there's a structural isomorphism between the model and the environment where that isomorphism can be exploited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.52,
    "end": 3701.65,
    "text": "So made use of by downstream processes to infer, to make decisions and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.524,
    "end": 3712.546,
    "text": " So it looks like the internal model, the generative model, meets all of the conditions for being a representation, a full-fledged representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.869,
    "end": 3714.731,
    "text": "And I think it doesn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.831,
    "end": 3718.018,
    "text": "I think it's just a mathematical construct, the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3718.572,
    "end": 3723.299,
    "text": " that can be used to model autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3724.241,
    "end": 3742.169,
    "text": "And we can think of the agent not as having a model, but as instantiating a model of the internal, sorry, a model of the external dynamics in its internal dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.429,
    "end": 3743.651,
    "text": "Yeah, that's what I've been saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.092,
    "end": 3744.192,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.745,
    "end": 3759.991,
    "text": " but rather as just a mathematical construct that describes the dynamics, the self-organizing dynamics of the agent in its coupling with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.632,
    "end": 3767.864,
    "text": "So we can give a contentless, content-free, representation-free account of what the generative model is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.924,
    "end": 3769.327,
    "text": "That's part of what I want to say here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.988,
    "end": 3770.128,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.615,
    "end": 3791.396,
    "text": " Now, you ask me, does that then commit me to something like Hato and Mayan's distinction between basic and cognition, which is non-representational, doesn't involve representations, and non-basic cognition, which is content involving or representation involving?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.777,
    "end": 3797.382,
    "text": "And to answer that question, we need to know what representations are because they clearly exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.918,
    "end": 3805.468,
    "text": " So it's just the issue is whether it makes sense to think of the brain as having content-bearing states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.07,
    "end": 3809.232,
    "text": "So where exactly do representations come in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.793,
    "end": 3816.322,
    "text": "And there I think we need to look at classic kinds of examples of what representations are in human life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.962,
    "end": 3822.169,
    "text": "So we find representations when we use pictures and images and diagrams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3823.23,
    "end": 3825.293,
    "text": "And those are...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.509,
    "end": 3839.198,
    "text": " coming from cultural practices like the use of diagrams to do science or the use of figures in writing articles or the use of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3839.532,
    "end": 3847.021,
    "text": " Pictures when we're doing art that can be traced back to making paintings on cave walls.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.443,
    "end": 3854.451,
    "text": "So these are representation-based practices, but they come from culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.972,
    "end": 3857.475,
    "text": "They don't come from what the brain is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.676,
    "end": 3863.262,
    "text": "So that's one example of what a representation is, that it's an image or a picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3864.406,
    "end": 3870.574,
    "text": " A second example of what a representation might be is a state that carries semantic content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.976,
    "end": 3874.159,
    "text": "So what is semantic content?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.199,
    "end": 3891.561,
    "text": "Well, it's a type of meaning where there's a determinacy to that meaning such that you can specify truth conditions, conditions of satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.693,
    "end": 3896.218,
    "text": " that the state that's carrying that semantic content can be evaluated for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.278,
    "end": 3899.502,
    "text": "So the state can be correct or incorrect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3899.522,
    "end": 3902.906,
    "text": "It can be evaluated as correct or incorrect, true or false, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.927,
    "end": 3915.76,
    "text": "And the problem with the kinds of states that we find within a generative model is that they don't have the kind of determinate contents that map onto semantic meanings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.022,
    "end": 3933.539,
    "text": " So when it comes to making the translation from Shannon information, is semantic information, where semantic information has this determinacy, this specificity to it, there's a mismatch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.02,
    "end": 3946.472,
    "text": "We have to explain how to get from what is mere co-variation or correlation, which is what you're dealing with when you're thinking about Shannon information,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.638,
    "end": 3965.912,
    "text": " information that's specific enough that you can start to say that the organism could be wrong in how it's taking the world to be, or wrong in the way that it states are states that have meaning for the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.55,
    "end": 3976.326,
    "text": " So it's that mismatch that makes me think, no, it's just not right to think of the generative model in terms of representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.867,
    "end": 3992.372,
    "text": "We can just make sense of it as a mathematical object that is tracking statistical patterns captured by the sorts of variables, parameters that we use to write down the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.044,
    "end": 3996.17,
    "text": " Long answer, but hopefully it gets some of the issues on the table for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.23,
    "end": 3996.871,
    "text": "No, it's wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.911,
    "end": 3998.675,
    "text": "It frames it very nicely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.695,
    "end": 4003.083,
    "text": "And that is precisely, actually, in that 2013 book, at least, what Hato and Mayan say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4004.005,
    "end": 4010.698,
    "text": "Just to repeat what you said, that it seems impossible to go from covariance to content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4010.965,
    "end": 4013.63,
    "text": " And I think they actually have a principle for it because why not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.251,
    "end": 4018.399,
    "text": "Of course, lots of philosophers don't agree with them about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4018.439,
    "end": 4023.929,
    "text": "So Nick Shay, who's a good colleague of Chris Frith, and they've worked together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.57,
    "end": 4027.776,
    "text": "He has a whole book where he lays out how you can get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.127,
    "end": 4035.295,
    "text": " semantic meaning from adding some extra conditions to co-variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.378,
    "end": 4037.678,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.738,
    "end": 4047.089,
    "text": "He thinks you need both indicators, so that's what Shannon Information gets you, and also consumers of those states that indicate something very roughly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4048.471,
    "end": 4057.341,
    "text": "So once you have a richer account, he thinks that you can give an argument for thinking, well, no, there is real semantic meaning here, not just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.878,
    "end": 4065.769,
    "text": " Um, but that's one thing he wants to say, this like more nuanced picture where there's just different kinds of content that we need to bring in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.711,
    "end": 4073.701,
    "text": "And, uh, how to a Mayan really focus on a very rich, demanding sort of content finding language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.861,
    "end": 4076.185,
    "text": "That's a paradigm example of representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.205,
    "end": 4086.079,
    "text": "And what, what Shay tries to do is show, well, there's more, um, there's less demanding notions, weaker notions, which still qualify as content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.139,
    "end": 4087.86,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.88,
    "end": 4087.98,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.0,
    "end": 4088.641,
    "text": "Well, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.661,
    "end": 4092.286,
    "text": "So, and Chris didn't have too much time for the radical and activists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.927,
    "end": 4107.828,
    "text": "Um, no, most, most, uh, cognitive neuroscientists have no time for radical in activists and, and it's their own fault because the radical and activists are so kind of polarizing in how they engage in this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.289,
    "end": 4108.67,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4109.05,
    "end": 4111.113,
    "text": "So yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.714,
    "end": 4116.741,
    "text": "So I, I have no skin in the game, so I'm not gonna, I have no passion there, but I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.261,
    "end": 4117.682,
    "text": " I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.702,
    "end": 4125.721,
    "text": "I think Hato and Mayan obviously spend a lot of time criticizing this notion of cognition as content or the mark of the cognitive being representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.643,
    "end": 4135.303,
    "text": "Where I think there are viable critiques of their book and their work is the alternative is somewhat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.621,
    "end": 4140.789,
    "text": " not particularly, at least, explicated in any great depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.791,
    "end": 4149.944,
    "text": "They say, for example, they want to endorse the idea that organisms are informationally sensitive, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.964,
    "end": 4158.878,
    "text": "that they exploit correspondences in their environments to adaptively guide their actions, while denying that it follows that they take in, store, or process informational content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.858,
    "end": 4165.928,
    "text": " This notion of exploiting correspondences sounds very much like there's a function there which indicates something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.849,
    "end": 4169.954,
    "text": "Now that is representation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.054,
    "end": 4173.038,
    "text": "Under a Dretschian account of what representation is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.739,
    "end": 4183.212,
    "text": "Now, on the other hand, if they say, well, no, all we're talking about here is just the responsivity of the organism, the adaptivity, the good jobs that they do by responding to stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.103,
    "end": 4187.066,
    "text": " Well, then I think this is the point that Shapiro makes, or maybe it's heaven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.787,
    "end": 4193.453,
    "text": "Their teleosemiotics, what they call their teleosemiotics, is no different from behaviorism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.735,
    "end": 4207.829,
    "text": "And actually, it's even more radical than the behaviorists, because all the behaviorists said was, well, it's just not really part of the scientific purview to talk about internal states, because all we can observe are behavioral action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.11,
    "end": 4210.212,
    "text": "They didn't necessarily deny",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.58,
    "end": 4232.622,
    "text": " um content bearing states they just thought it wasn't worth the examination until mr chomsky and so do you like is there a way out of this um conundrum that one is we find it very difficult to get content out of covariance and there is covariance but then the other hand it's very difficult to account for adaptive behavior solely in terms of covariance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.061,
    "end": 4261.765,
    "text": " so uh on the behaviorist thing and i think hato and mayan well certainly mayan is willing to just bite the bullet on behavior really yeah fantastic so behaviorism is often depicted as this like devilish position that nobody should hold anymore since the cognitive revolution but sure some caricatures and straw men about what behaviorism is exactly yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.2,
    "end": 4270.89,
    "text": " that I think the Mayan at least is in the business of, and also Louise Barrett and some of the work that she's done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.851,
    "end": 4277.297,
    "text": "They're trying to correct for mistaken interpretations of what behaviorism actually means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.238,
    "end": 4282.102,
    "text": "So that is part of the radical inactive project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.823,
    "end": 4285.626,
    "text": "At least some people are pursuing that within radical inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.142,
    "end": 4296.004,
    "text": " um so how to go well why is indication that serves a particular function not sufficient for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.153,
    "end": 4299.057,
    "text": " for content according to Hato and Mayan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.279,
    "end": 4307.748,
    "text": "Why couldn't we use that model and just have a completely contentless explanation of behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.468,
    "end": 4318.381,
    "text": "Well, they think it's not sufficient because it doesn't get us the specific take on the world that's required to say that an organism could be mistaken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.242,
    "end": 4319.342,
    "text": "Yeah."
  },
  {
    "start": 4319.575,
    "end": 4330.339,
    "text": " And any definition of content or meaning requires that the state that's carrying the content could be mistaken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.379,
    "end": 4338.597,
    "text": "It could be misrepresenting how things are in terms of that state's particular take on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.336,
    "end": 4349.025,
    "text": " So when we try to build in specificity and get that out of function, there's longstanding problems that that project has run into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4350.008,
    "end": 4354.24,
    "text": "Again, it fails to get us the specificity that we require.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.367,
    "end": 4373.089,
    "text": " So where the debates kind of got to, and this is Nick Shay's position, is that you just need to have a more relaxed view of what specificity is, such that it depends on your question that you're asking, what kinds of questions you have in doing psychology or cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.17,
    "end": 4376.715,
    "text": " will dictate whether you need more or less specificity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.777,
    "end": 4382.944,
    "text": "So relative to your questions, you can get the kind of specificity you need to talk about content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.585,
    "end": 4397.605,
    "text": "We shouldn't think that there's one-size-fits-all picture that's going to answer all of the different questions that we might have because each question might require a different level of granularity or specificity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.306,
    "end": 4398.527,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.268,
    "end": 4402.232,
    "text": "We'll also try and offer a one-size-fits-all, but I'm curious about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.735,
    "end": 4404.878,
    "text": " your position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.898,
    "end": 4405.338,
    "text": "So moving on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.639,
    "end": 4409.804,
    "text": "Sorry, I've been saying what's been going on and elsewhere and discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4409.945,
    "end": 4411.086,
    "text": "No, not at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4411.106,
    "end": 4412.027,
    "text": "That's my fault as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.628,
    "end": 4414.19,
    "text": "It's all the framing, which is excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.25,
    "end": 4424.464,
    "text": "And I also wanted to backtrack on the heart and mind thing because it was it was dealt with quite briefly in my conversation with Chris, and there were certain things I had to go in and clarify post hoc.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4424.524,
    "end": 4428.81,
    "text": "So it's useful to people, you know, are aware of these clarifications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.79,
    "end": 4432.162,
    "text": " So what do I think about all of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.343,
    "end": 4439.61,
    "text": "Well, I'm sympathetic to the idea that when we think about what representations and content is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.759,
    "end": 4443.944,
    "text": " then this is where my phenomenological background comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4444.945,
    "end": 4455.978,
    "text": "We need to go back to lived experience, which is where the notion of intentionality was first introduced by Brentano and Husserl and other phenomenologists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.179,
    "end": 4462.325,
    "text": "So intentionality has its origins in lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.547,
    "end": 4468.753,
    "text": "And then when we try to deploy this notion in doing science,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.852,
    "end": 4474.795,
    "text": " And then we've taken up a particular attitude towards the world, the scientific attitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.517,
    "end": 4486.271,
    "text": " But the notion of content and meaning itself derives from our perception and thoughts as conscious beings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.473,
    "end": 4502.132,
    "text": "So there's a bigger question here about how to make phenomenology fit together with the naturalistic worldview that we get when we start to do cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.652,
    "end": 4524.812,
    "text": " and um yeah this goes back to another one of the ease the ease of the inactive camp where going back to the embodied mind of varela thompson and roche from 1991 the critique that they made of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.792,
    "end": 4537.069,
    "text": " Cognitivist cognitive science of cognitive science that thinks just cognition is information processing of some kind was that it doesn't have room for human experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.129,
    "end": 4553.753,
    "text": "If you think of of cognition as information processing, how do we then account for the what's described phenomenologically when we think of intentionality as a structure of human experience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.256,
    "end": 4558.283,
    "text": " So intentionality here means the directedness of the mind upon objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.404,
    "end": 4567.959,
    "text": "And the idea of intentionality is that you're always working with a kind of relation between subject and object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.019,
    "end": 4581.04,
    "text": "So intentionality is supposed to be describing a mode of experience that involves a central relationality between subjects and their world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.661,
    "end": 4590.221,
    "text": " Heidegger went on to talk about this in terms of being in the world in a beautiful episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.742,
    "end": 4591.303,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4591.644,
    "end": 4592.326,
    "text": "That was wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.346,
    "end": 4593.128,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.148,
    "end": 4594.33,
    "text": "There's loads of things that come up here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4594.411,
    "end": 4596.295,
    "text": "I mean, so firstly, you're not going to find an enemy of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.578,
    "end": 4597.52,
    "text": " Yes, please go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.54,
    "end": 4597.901,
    "text": "If you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.941,
    "end": 4599.103,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.123,
    "end": 4605.337,
    "text": "Just where I look for intentionality and meaning is in lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.357,
    "end": 4615.819,
    "text": "And then that raises the question of how to bring together, how to make room for what was described in phenomenology when they were describing the human mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.305,
    "end": 4619.628,
    "text": " in cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.21,
    "end": 4636.846,
    "text": "And Varela, Thomson and Roche put forward this idea of mutual constraints, that what is described phenomenologically is a constraint on the kinds of explanations that we give in cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.807,
    "end": 4643.072,
    "text": "And what's described in cognitive science likewise, constraints, that's why this is a mutual constraint,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.592,
    "end": 4646.201,
    "text": " what we can make sense of phenomenologically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.124,
    "end": 4654.75,
    "text": "So there's a kind of what's described by Varela in terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.215,
    "end": 4658.738,
    "text": " a, what's the term he uses now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.798,
    "end": 4663.805,
    "text": "Maxwell also uses this in one of his papers on computational neuro phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.845,
    "end": 4664.206,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4664.286,
    "end": 4674.88,
    "text": "It's, um, there's a kind of generative, um, passage between phenomenology and cognitive science that, that you get from this mutual constraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4675.48,
    "end": 4675.681,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.241,
    "end": 4676.542,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.562,
    "end": 4676.662,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.702,
    "end": 4677.443,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.463,
    "end": 4677.964,
    "text": "Uh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.984,
    "end": 4681.348,
    "text": "So I was saying, yes, he says from generative models to generative passages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4683.111,
    "end": 4683.471,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.788,
    "end": 4704.891,
    "text": " Yeah, so you're not going to find generative, but the idea is that we ought to be able to have this kind of passage, so bridge that goes between phenomenology, which was not describing anything in a scientific way, but trying to go back to lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4705.571,
    "end": 4713.66,
    "text": "There ought to be like a bridge that takes us from phenomenology to what we can now model computationally using the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4714.062,
    "end": 4715.885,
    "text": " That's the idea of generative passage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.045,
    "end": 4719.431,
    "text": "Well, that's the game that I'm in and enjoying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4719.572,
    "end": 4720.894,
    "text": "That's the game I'm in as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4721.415,
    "end": 4721.735,
    "text": "It's fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.396,
    "end": 4722.537,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4723.338,
    "end": 4724.22,
    "text": "I'm enjoying it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.622,
    "end": 4728.347,
    "text": "So involved in this within the active inference community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.308,
    "end": 4732.374,
    "text": "Yes, it gives a wonderful way of doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.375,
    "end": 4735.619,
    "text": "Back to the original embodied mind idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4736.321,
    "end": 4738.905,
    "text": "That book, The Embodied Mind, was what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.105,
    "end": 4742.572,
    "text": " I found as an undergraduate that brought me into this field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.614,
    "end": 4745.798,
    "text": "And it's very inspiring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.838,
    "end": 4753.153,
    "text": "It tries to bring together phenomenology, Buddhism, and cognitive science through this idea of inaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4753.173,
    "end": 4756.82,
    "text": "I still think it's a brilliant book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.86,
    "end": 4758.463,
    "text": "I would recommend it to everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4758.832,
    "end": 4764.38,
    "text": " Evan wrote it when he was young and Varela was at a later stage in his career.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4764.46,
    "end": 4770.79,
    "text": "So some of the ideas I think are developed much better in, in mind and life, which you also mentioned earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.911,
    "end": 4777.179,
    "text": "Um, but, but just because of its kind of broad brushstrokes, it makes it very readable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.299,
    "end": 4781.445,
    "text": "And, and so everybody can kind of get on board with the project at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.806,
    "end": 4782.026,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4782.307,
    "end": 4782.407,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4782.427,
    "end": 4784.149,
    "text": "I'm very much enjoying mind and life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.169,
    "end": 4785.551,
    "text": "Um, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.652,
    "end": 4788.636,
    "text": "So as you know, you're not going to find an enemy of phenomenology here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.088,
    "end": 4792.391,
    "text": " Um, I like my Heidegger and Hussle and Merleau-Ponty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4792.411,
    "end": 4793.432,
    "text": "I particularly like Dreyfus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4794.493,
    "end": 4804.063,
    "text": "Um, and Dreyfus has a, Dreyfus I think is an important addition to this conversation because I hate to go back to them, but I don't hate to go back to them, but Hutto and Mayer actually mentioned Dreyfus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4804.683,
    "end": 4810.889,
    "text": "Dreyfus's notion of skillful coping, skillful action as exhibiting intentionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.59,
    "end": 4818.977,
    "text": "And bear in mind, yes, it's not basic cognition according to them is not contentful, but it is still intentional in some sense it's targeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.582,
    "end": 4827.93,
    "text": " But they use Dreyfus to say, well, there are no mental representations or content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4828.49,
    "end": 4835.857,
    "text": "And I build off some of this in this notion of flow states, which I think are a really interesting example of which taps into some of these ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4835.917,
    "end": 4846.547,
    "text": "But the problem with this is that Dreyfus, I don't think, and I think this is the point that actually Evan Thompson made, that Dreyfus wouldn't say that those states are contentless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4846.567,
    "end": 4848.289,
    "text": "And I wouldn't say those states are contentless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.248,
    "end": 4862.771,
    "text": " Rather, they're intentionally contentful, but in a way that's not representational, in a way that it's not like there's a representation which stands for something precise in the world to which you can attribute, well, that function, you could attribute a truth claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.873,
    "end": 4874.952,
    "text": "Rather, there are these norms that are governed by perception and action loops and this biological autonomy that we've been discussing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.252,
    "end": 4882.139,
    "text": " And but right, but there's still this intentional content, which he would call skillful coping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4882.599,
    "end": 4887.884,
    "text": "And I think you could consider to be this kind of auto tellicity that comes out of flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.246,
    "end": 4902.559,
    "text": "So what does what what does the what do the phenomenologist contribute more broadly beyond Dreyfus, although he does rest his arguments a lot of Merleau Ponty about the role of content?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.395,
    "end": 4904.996,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.016,
    "end": 4911.683,
    "text": "So, um, let's first of all, go back to the, the categories of the ready to hand and the present at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.703,
    "end": 4921.935,
    "text": "The Dreyfus really focuses on in his, uh, in his work, uh, interpreting division one of Heidegger's being and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.076,
    "end": 4928.783,
    "text": "Um, so when we're dealing with the ready to hand, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4929.725,
    "end": 4940.157,
    "text": " We're behaving in a way that our actions are drawn from us by the solicitations of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4940.377,
    "end": 4955.935,
    "text": "That's the kind of phrasing that he often gives and that we, Eric Rietveld and I, and Jelle Brouneberg, the three of us have been very much inspired by Dreyfus's reading of the Ready to Hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.235,
    "end": 4960.022,
    "text": " So it's this responsiveness to the solicitations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.442,
    "end": 4975.929,
    "text": "So solicitations are, for us, affordances which stand out from the surroundings as relevant or meaningful, salient to what the agent is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.99,
    "end": 4981.399,
    "text": "So the classic example that Heidegger uses, which you know from the conversation with Marilyn, is the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.784,
    "end": 4983.486,
    "text": " the hammer and nails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4983.506,
    "end": 4985.91,
    "text": "And you're a little bit worried about that example, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.99,
    "end": 4990.255,
    "text": "Well, just the target to flow every day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4990.295,
    "end": 4991.177,
    "text": "Yeah, but it's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.197,
    "end": 4991.557,
    "text": "It will do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4992.138,
    "end": 4993.039,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.059,
    "end": 4997.886,
    "text": "So no, but we can think about my just reaching for my coffee cup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4998.106,
    "end": 5000.249,
    "text": "Yeah, want to take a drink of coffee.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5000.809,
    "end": 5005.376,
    "text": "The coffee cup solicits my behavior, it draws my hand towards it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.416,
    "end": 5005.716,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.27,
    "end": 5014.978,
    "text": " Um, so my actions are kind of drawn from me in my forming an equilibrium state with, uh, the, the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5015.959,
    "end": 5033.475,
    "text": "Um, so in our, in our work with yellow and Eric, we tried to argue that this tending towards an optimal grip can be thought of as a consequence of, uh, of what we were then calling variational free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5033.962,
    "end": 5038.567,
    "text": " And now I think since then, that paper was written in 2016.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.647,
    "end": 5041.631,
    "text": "So the field has moved on enormously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.812,
    "end": 5052.784,
    "text": "Now we would think about those sorts of examples of tending towards a good grip, tending towards an improved grip in terms of expected free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.265,
    "end": 5061.994,
    "text": "But the idea there was that this kind of tending towards the right sort of optimal relationship with the environment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5062.548,
    "end": 5068.93,
    "text": " is a consequence of what we can model in terms of free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5069.872,
    "end": 5071.975,
    "text": " Now, is that representational?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.995,
    "end": 5080.107,
    "text": "Well, I've been saying, no, it's not, because the generative model is not something that the organism has.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.227,
    "end": 5081.93,
    "text": "It's something that the organism embodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.851,
    "end": 5098.073,
    "text": "We can think about what are the dynamics that the organism instantiates, and do we need to bring in content or representations to explain the internal states that the organism instantiates?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.352,
    "end": 5111.455,
    "text": " And that's where I think the idea of inactive inference that Ramstad and Carl and Michael introduced in their adaptive behavior paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.093,
    "end": 5116.64,
    "text": " And Carl talks about embodied inference sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5117.681,
    "end": 5126.754,
    "text": "These are all ways of unpacking how active inference might be understood, where you think, no, the organism is a model, and so it doesn't need to represent anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.834,
    "end": 5135.267,
    "text": "It can just be thought of in terms of states that carry Shannon information about the world, where that's not semantic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.35,
    "end": 5139.012,
    "text": "So that's one thing I want to say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5139.498,
    "end": 5165.175,
    "text": " the translation from the ready to hand via this notion of solicitation tending towards an optimal grip, those notions can be unpacked in a way that maybe we can characterize in terms of content, a content to be motor intentionality as Melo Ponti was describing it or comportment towards the ready to hand as Heidegger would describe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.157,
    "end": 5169.201,
    "text": "If that's what you're calling content, fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5169.451,
    "end": 5171.295,
    "text": " It's okay to talk about content here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.315,
    "end": 5171.655,
    "text": "Why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.696,
    "end": 5178.89,
    "text": "Because the content here is traced back in the end to something that we can describe in lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.491,
    "end": 5179.732,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.415,
    "end": 5183.68,
    "text": "I wouldn't call it representational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.98,
    "end": 5186.443,
    "text": " nor would I call it semantic meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5186.924,
    "end": 5187.525,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5188.025,
    "end": 5192.591,
    "text": "Dreyfus wouldn't either, in the sense of those satisfaction conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5192.611,
    "end": 5193.212,
    "text": "Maxwell does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5193.552,
    "end": 5198.839,
    "text": "So Maxwell has this paper where he's trying to give an account with Innes, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.959,
    "end": 5203.605,
    "text": "Strangely, Innes is a non-representational inactive theorist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.685,
    "end": 5209.853,
    "text": "But they have this paper together where they try to give a formal semantics for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5210.12,
    "end": 5214.91,
    "text": " and they tried to derive a formal semantics out of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.531,
    "end": 5215.771,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.194,
    "end": 5227.716,
    "text": "And no, that formal semantics, if you think you can get formal semantics out of Bayesian mechanics, I think that that's really a representation is program that you're on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.217,
    "end": 5228.417,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.838,
    "end": 5228.938,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5229.256,
    "end": 5235.041,
    "text": " I think what they do is kind of, it goes into this instrumentalist realist thing again that you've talked about before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.643,
    "end": 5240.406,
    "text": "There's a little bit of as if stuff going on or looks like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.627,
    "end": 5243.009,
    "text": "You've got to read carefully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5243.209,
    "end": 5244.21,
    "text": "You've got to read through the lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.931,
    "end": 5255.941,
    "text": "So perhaps if you go instrumentalist here, then you can hold on to Innes' kind of inactive take on where representations come from, that they only come from practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.021,
    "end": 5257.542,
    "text": "They're not something that you find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.522,
    "end": 5260.145,
    "text": " or they come from the science of making models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.047,
    "end": 5262.849,
    "text": "So scientists make models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5263.51,
    "end": 5270.459,
    "text": "Those models can then be interpreted instrumentally as useful tools for representing dynamics and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5270.479,
    "end": 5286.06,
    "text": "So you can start to think of where representations come in through scientific practices or without thinking that the brain is doing operations over semantic bearing, content bearing states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5286.732,
    "end": 5287.052,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.293,
    "end": 5300.513,
    "text": "I mean, I still find it a slight challenge, that distinction, because I think there's a question about, well, how does public language become exacted into internal language such that you can even speak of internal representations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5300.553,
    "end": 5301.915,
    "text": "But I think that's a separate question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5303.036,
    "end": 5314.714,
    "text": "I think the thing to say there as well, and this is something I've argued with Eric as well, that if you think that the generative model is non-representational,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5315.453,
    "end": 5335.673,
    "text": " It doesn't thereby become representational just through a process of reenacting or reusing states that are content-bearing, like when we engage in inner speech and we make use of language to think with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5335.653,
    "end": 5340.42,
    "text": " That's very much a phenomenological experience that we have of thinking in language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.123,
    "end": 5356.505,
    "text": "But we shouldn't infer from that that when we're explaining inner speech in terms of neural processes, then there's inference over semantic bearing states going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5359.429,
    "end": 5361.292,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5361.392,
    "end": 5361.753,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.295,
    "end": 5364.597,
    "text": "Yeah, I intuitively...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5364.728,
    "end": 5394.347,
    "text": " separating those phenomenal and content but maybe that's just me there's the modeling which is something that can be characterized in purely mathematical statistical terms just in terms of shannon information and then there's the interpretation the gloss that we give of the model as scientists where we may be able to interpret what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.749,
    "end": 5405.561,
    "text": " We're modeling in terms of meaning and representation, but that's something that we're doing as scientists who are making use of representations to interpret their models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.724,
    "end": 5414.291,
    "text": "And yet there is still, unless you're an illusionist about the whole thing, phenomenal experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5415.553,
    "end": 5423.642,
    "text": "And so I find it difficult just personally to separate content from phenomenal experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5423.977,
    "end": 5451.418,
    "text": " so yes that's what i was arguing as well in trying to connect to motor intentionality in in phenomenology in yes or to the ready to hand okay dealings with the ready to hand so yeah okay okay that okay i see that okay those are notions of intentionality and content and meaning yes without without truth and accuracy being built in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5452.343,
    "end": 5482.148,
    "text": " yeah and then they're not their descriptions of lived experience of human beings and so when we're describing lived experience i agree it makes total sense to bring in the notion of intentionality as a structure of lived experience and if we try to read that back into what we're modeling when we use a generative model or um or into the target system that we're modeling the brain yes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5483.123,
    "end": 5499.948,
    "text": " there's an extra move that's being made there that we can go from the notion of intentionality as it's used to understand lived experience to whatever we're doing as scientists when we use a model, model a target system, the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5500.709,
    "end": 5501.891,
    "text": "So there are three things there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5501.911,
    "end": 5509.722,
    "text": "There's lived experience, there's the model and the Bayesian beliefs that we use to write down a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.853,
    "end": 5517.07,
    "text": " And then there's the target system, the brain that we're using the generative model to make inferences about in the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5519.335,
    "end": 5522.121,
    "text": "And where do we bring in intentionality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5522.181,
    "end": 5524.807,
    "text": "Well, for me, only in lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5524.827,
    "end": 5529.077,
    "text": "And then we can use the model, the Bayesian beliefs, Bayesian mechanics to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5529.277,
    "end": 5539.071,
    "text": " explain, in the terms of cognitive neuroscience, lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5539.571,
    "end": 5547.943,
    "text": "That's the generative passage from phenomenology to cognitive neuroscience that's made possible by Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5548.092,
    "end": 5556.763,
    "text": " But we shouldn't think that then we're going to read back straight from the phenomenology intentionality into the Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5556.783,
    "end": 5559.406,
    "text": "Bayesian mechanics is just mathematics and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5561.029,
    "end": 5561.329,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5563.151,
    "end": 5566.856,
    "text": "What's described in phenomenology because of the generative passage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5566.936,
    "end": 5575.467,
    "text": "But we need to be careful not to just conflate the two and match the two together because they're not the same thing, the Bayesian mechanics and intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5575.565,
    "end": 5578.391,
    "text": " No, it's a very useful disambiguation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5579.394,
    "end": 5592.443,
    "text": "I guess the only question that, well, one of the only questions that comes, one of the questions that comes to mind, because I have plenty, is about perception, because perception is cast as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5593.469,
    "end": 5606.261,
    "text": " resulted, again, it's quite, it's not particularly well sketched out, but resulting from Bayesian mechanics, in the sense that perceptual adequacy is just the minimization of the KL divergence, the recognition density and the true posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5606.901,
    "end": 5615.629,
    "text": "So this leads us quite nicely into affordances, because you have in your 2014 paper, you have, I believe the section is called affordances for higher cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5616.71,
    "end": 5622.936,
    "text": "And you talk about this example of a nettle and mint leaves, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5623.287,
    "end": 5626.455,
    "text": " I would like to read out because I think it would be a very useful framing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.197,
    "end": 5636.841,
    "text": "So you say, does he quote Gibson, who says that the affordances of human behavior is staggering, because it's in the whole domain of social significance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5637.293,
    "end": 5648.396,
    "text": " And then you give this example, you say, for instance, when we are out looking for mint leaves to make mint tea and a friend incorrectly reaches for a nettle, we can stop him or her by making the judgment that is not a mint leaf, that is a nettle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5648.416,
    "end": 5652.524,
    "text": "In doing so, we are skillfully engaging with the affordances the nettle leaf has in our form of life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5652.965,
    "end": 5656.272,
    "text": "The leaf affords judging correctly that it is a nettle in our form of life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.173,
    "end": 5657.935,
    "text": "You see, for me,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5659.535,
    "end": 5668.17,
    "text": " For me, I just cast that as a that just for me is just what one person's model is perceptually adequate and the others isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.991,
    "end": 5673.639,
    "text": "And for me, that's pure Bayesian mechanics about the reduction of the KL divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.699,
    "end": 5678.046,
    "text": "But that yields that doesn't necessarily yield me an affordance in terms of public language use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5678.848,
    "end": 5680.851,
    "text": "It just yields perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5682.232,
    "end": 5697.566,
    "text": " So maybe you could explain, because people might hear that and go, well, I don't think that the seeing of the nettle is in and of itself encapsulated in the notion of an affordance to inform your friend that it's a nettle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5698.687,
    "end": 5700.269,
    "text": "Rather, this is just perception, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5700.289,
    "end": 5704.593,
    "text": "And the role of perception is purely just to achieve what I've been calling descriptive adequacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.113,
    "end": 5712.12,
    "text": "Whereas action, the maximization of model evidence gives us normative viability, normative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5712.488,
    "end": 5713.69,
    "text": " Yeah, normative explanations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5714.231,
    "end": 5726.05,
    "text": "So it seems to me that you're kind of slotting perception into norms and in some sense, the maximization of model evidence, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.19,
    "end": 5728.774,
    "text": "I need to be a good social actor in this situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5730.877,
    "end": 5736.927,
    "text": "Well, one thing that's important about that example is that it's supposed to be an example of discursive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.362,
    "end": 5758.442,
    "text": " thoughts so the person judges that's not a a nettle sorry that's not a a nettle that's a mint leaf or is it the other way around i can't remember no it's not a net it's not a mint leaf it's a nettle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5758.642,
    "end": 5767.411,
    "text": " But the point is that it's a demonstrative judgment that's being made, a judgment about the type of leaf that the person's just picked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.431,
    "end": 5776.981,
    "text": "So there's a perceptual categorization going on that might make it look like it's just a perceptual phenomena that's being described here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5777.741,
    "end": 5788.092,
    "text": "But it was being introduced as an example of perception serving as a reason for making a judgment, a particular kind of demonstrative judgment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5788.375,
    "end": 5794.464,
    "text": " about the type of leaf that you're looking for and whether this is that type of leaf or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5794.544,
    "end": 5804.76,
    "text": "So it was being given as an example of higher cognition because people think that higher cognition is reason responsive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5804.82,
    "end": 5812.712,
    "text": "So you're in the space of reasons, you're not just in the space of causes anymore, to use a distinction from Wilfrid Sellers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5812.81,
    "end": 5821.185,
    "text": " So if you can make this kind of demonstrative judgment based on your perception, that's because you're responsive to what the reasons are here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5823.049,
    "end": 5828.018,
    "text": "So there's a kind of rationality in play in this example of perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5828.605,
    "end": 5842.637,
    "text": " And then the question is, well, you were pushing the idea, well, it's just about the Bayesian mechanics, this kind of using of perception to make judgments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5842.818,
    "end": 5847.829,
    "text": "And there I think we need to be careful to distinguish personal level explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5848.501,
    "end": 5870.108,
    "text": " which is explanation in terms of reasons from sub-personal processes, which are being described by Bayesian mechanics, where the inferential processes here are supposed to be just a matter of mechanics, just a matter of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5871.67,
    "end": 5873.833,
    "text": "And we want to, in the end, connect up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5874.067,
    "end": 5894.083,
    "text": " we're appealing to in our personal level explanations this is the bridging idea with what can be described sub-personally in terms of bayesian mechanics but how do you go from the personal level explanation which is reason giving kind of explanations to sub-personal explanation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5894.35,
    "end": 5897.393,
    "text": " There's an interface problem, as it's sometimes called here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5897.433,
    "end": 5904.861,
    "text": "How do you get your reasons to interface with the causes, which is what you're interested in when you're thinking about Bayesian mechanics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5906.602,
    "end": 5920.316,
    "text": "And I think what you were doing was saying, well, you were missing that there's an interface that we need here that allows us to move from personal level explanations to sub-personal explanations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5921.097,
    "end": 5922.839,
    "text": "We shouldn't lose that interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5922.859,
    "end": 5923.159,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5923.814,
    "end": 5924.876,
    "text": " No, I agree with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5926.619,
    "end": 5933.229,
    "text": "I've said on paper that I think there is an issue how perception, let's say, just gets chucked out of KL divergences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5933.71,
    "end": 5934.271,
    "text": "That's an issue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5934.632,
    "end": 5935.774,
    "text": "I'm not denying that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5936.375,
    "end": 5949.957,
    "text": "I guess my question here was... Going back to the phenomenology discussions again, the way we were thinking about this was the kind of intentionality that perception has where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5950.021,
    "end": 5955.689,
    "text": " That can be thought of just in terms of what Husserl called passive and active synthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5955.85,
    "end": 5965.384,
    "text": "So there's a kind of constitution that we can appeal to at work in perception that is pre-predicative, comes before any categories are introduced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5966.265,
    "end": 5973.396,
    "text": "And then there's a kind of intentionality which is distinctive of thought and judgment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5973.376,
    "end": 5996.683,
    "text": " where that is uh predicative it's categorized so you're bringing in some kind of subject object distinction you're dealing with the present at hand yeah um and this example was supposed to be like an example of that moves from the ready to hand to the present at hand because there's some sort of breakdown that happens there's a mistake that's made um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5997.22,
    "end": 6002.392,
    "text": " that gets corrected and that pushes you to start to think and make judgments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6003.334,
    "end": 6013.879,
    "text": "And so you're not any longer dealing with just being drawn by, well, actually we want to say you are, because we bring in this idea of affordances that come from language, but, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.23,
    "end": 6029.892,
    "text": " But what's important is that we're dealing with a discursive, propositional, predicative form of intentionality in the judgment that's being made here, not just a pre-predicative, subject, objectless form of intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6030.272,
    "end": 6031.074,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6031.094,
    "end": 6036.441,
    "text": "Yeah, I guess part of my point was...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6037.13,
    "end": 6044.338,
    "text": " we have to integrate the ready-to-handedness form of intentionality with the present at-handedness intentionality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6044.419,
    "end": 6057.414,
    "text": "And I think maybe one reading of this would just be like, oh, we're just skipping over the fact that there's some concept-free perception going on in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6057.434,
    "end": 6059.556,
    "text": "And I just wanted to get clarity that that's not what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6060.718,
    "end": 6066.124,
    "text": "There is still the perceptual act prior to the categorization that language grants us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6066.56,
    "end": 6073.432,
    "text": " So I agree with you that we need some way of integrating the ready to hand and the present at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6073.452,
    "end": 6074.233,
    "text": "That's what you just said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6074.273,
    "end": 6075.175,
    "text": "That's absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6075.856,
    "end": 6084.771,
    "text": "That takes us back to this question of higher and lower cognition and how we want to call into question that distinction in the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6085.072,
    "end": 6088.737,
    "text": " So you could think there's still a distinction to be made here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6088.877,
    "end": 6108.244,
    "text": "So looking at the paper by Andrew Corcoran and Jacob Hoy, Giovanni Pizzulo, they have this beautiful picture where you can go from homeostasis to allostasis to planning deep temporal models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6108.224,
    "end": 6126.6,
    "text": " you might think that that underwrites a distinction between higher cognition, which is where you find planning and deep temporal models, and lower cognition, where it's just about homeostasis or about chemotaxis, like in the Shantz and colleagues model of chemotaxis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.202,
    "end": 6136.729,
    "text": "So there's this differentiation that you get where higher cognition emerges in these deep temporal models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6137.57,
    "end": 6150.803,
    "text": " And what we want to say is, well, that's the kind of approach where you try to get to higher cognition vertically by building up from lower cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.913,
    "end": 6176.824,
    "text": " mere homeostasis to higher cognition deep active inference parameter deep parametric active inference as last sanford smith calls it quite yeah yeah now we want to do something that's different from that which is to horizontalize the whole thing so instead of trying to build up to higher cognition vertically in the generative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6176.939,
    "end": 6202.153,
    "text": " through temporal depth we want to look at the horizon in which we engage with the environment and think that spatially and temporally there can be more or less distal engagements with the environment that are made possible by us being by our cultural practices so this goes back to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6202.252,
    "end": 6227.736,
    "text": " where we actually started on the question of cultural ecosystems, niche construction, and how once we have in view the idea that the environment predicts agents as much as agents predict the environment, then we can start to have a picture where instead of thinking of temporal depth as coming from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6228.239,
    "end": 6250.384,
    "text": " the hierarchy in the deep temporal generative model, we can think of temporal depth as coming from the ecosystems in which we're situated and the way that those ecosystems make possible dealing with distal states of affairs that are currently absent from us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6250.764,
    "end": 6254.989,
    "text": "That's what I think we get from language, from being able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6255.948,
    "end": 6265.0,
    "text": " engage in propositional type reasoning, reasoning where we're using predicative forms of intentionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6266.442,
    "end": 6269.246,
    "text": "This is how you sort of end up swallowing up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6271.208,
    "end": 6283.845,
    "text": "To do perceptual judgment, to do thinking about what is currently absent, dealing with the distal and so on, where people normally bring in representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6284.737,
    "end": 6305.276,
    "text": " Yeah, so this is how you swallow up, if you pardon the pun, representation hungry cognition, whereby you sort of refute offline cognition as being distinct, but rather this, quote, more complex form of coordinating nested states of action readiness and activities to multiple relevant affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6305.316,
    "end": 6312.583,
    "text": "Such a process is complex because of the nesting of the activities and their increasing reach through time, which I guess gives us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6313.036,
    "end": 6319.635,
    "text": " Well, at least your answer to Shapiro's challenge, which is not going to be convinced by that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6319.655,
    "end": 6323.044,
    "text": "I mean, you already said, well, yes, natural signs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6323.305,
    "end": 6327.216,
    "text": "Don't explain how you can navigate from Madison to wherever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6327.457,
    "end": 6327.838,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6328.223,
    "end": 6331.447,
    "text": " I guess my question here is, why can't we have both?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6331.687,
    "end": 6341.499,
    "text": "And so what I mean by that is, you also give another example from Shapiro, reenacting his past experiences going to his household, his former house in New Jersey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6342.48,
    "end": 6350.469,
    "text": "And you say that, you know, him pretending to engage in those activities of being there is in itself a act of coordinating to multiple relevant affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6351.791,
    "end": 6354.514,
    "text": "But my question is, why can't we?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6355.154,
    "end": 6355.615,
    "text": "Why can't we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6356.033,
    "end": 6359.598,
    "text": " sort of have our cake and eat it too, in the sense that we can accept that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6359.618,
    "end": 6369.551,
    "text": "And we can accept that when I'm trying to get my train from, or my plane from Madison to Cologne, that's me reacting to the affordance of going to Cologne and what that might afford me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6370.132,
    "end": 6381.788,
    "text": "Why can't we also say that to even kick off that process, I have this kind of offline representation, which frames my nested activities, I want to go to Cologne.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6383.54,
    "end": 6385.963,
    "text": " Or is that permitted?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6386.063,
    "end": 6391.009,
    "text": "Because you want to reframe representation-hungry cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6391.089,
    "end": 6408.13,
    "text": "You say you give the, quote, possibility of a positive alternative, namely whether representation-hungry cognition might be achieved by other means by, for example, skillfully coordinated, complexly structured nested activities to multiple affordances, such that episodic memory imagining can be given in these terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6408.295,
    "end": 6410.9,
    "text": " I just don't see why we can't have both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6410.94,
    "end": 6421.237,
    "text": "We have the benefits of saying, okay, these are representational, so they include content, they include public language or private language in this case, and also they're a response to affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6421.298,
    "end": 6422.76,
    "text": "Why do we need one rather than the other?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6426.74,
    "end": 6432.976,
    "text": " So it goes back to a number of things that we've been talking about already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6433.076,
    "end": 6437.808,
    "text": "So one is where does intentionality originate from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6437.848,
    "end": 6440.595,
    "text": "Where does content meaning originate from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6440.635,
    "end": 6442.42,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6443.024,
    "end": 6450.224,
    "text": " I've been contending that the source of intentionality is lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6450.404,
    "end": 6451.106,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6451.126,
    "end": 6459.008,
    "text": "So the reason why I want to appeal to practices in the form of life,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6459.359,
    "end": 6477.351,
    "text": " like how language is used within communities following a Wittgensteinian model, is because that traces meaning back to something human, to what human beings do when they are speakers of English, say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6478.36,
    "end": 6492.321,
    "text": " What they are able to do then is to articulate certain thoughts, but they're also able to revisit past experiences by constructing narratives about those past experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6492.501,
    "end": 6496.707,
    "text": "So that connects us to the narrative topic again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6497.092,
    "end": 6506.042,
    "text": " And I think the way that you were describing things was to suggest that narratives can be modeled at the higher layers of these deep temporal models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6506.082,
    "end": 6506.983,
    "text": "That's absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6507.343,
    "end": 6508.664,
    "text": "They can be modeled in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6508.725,
    "end": 6520.297,
    "text": "But does that mean then that the narratives just are the processes of inference that take place within these deep temporal models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6520.938,
    "end": 6525.883,
    "text": "And that's where I would say, no, we shouldn't make an identity between the narrative and the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6526.572,
    "end": 6535.325,
    "text": " and what we're modeling using a generative model, because the modeling practice is being done by a scientist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6536.567,
    "end": 6554.014,
    "text": "And those models that the scientist is constructing are what we use then to explain some target phenomena, which is the cognitive process of constructing narratives, but can also be understood in terms of the actions of scientists",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6555.007,
    "end": 6562.796,
    "text": " normatively regulating your linguistic behaviors so that they fit with how other speakers of your language behave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6564.858,
    "end": 6568.041,
    "text": "That's something which is very much a cultural communal activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6570.204,
    "end": 6576.351,
    "text": "So yes, generative models capture these processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6576.431,
    "end": 6582.938,
    "text": "They give us ways of explaining them in the terms of the free energy principle and cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6582.918,
    "end": 6593.754,
    "text": " Should we then take the phenomena that we're modeling to be nothing over and above what can be modeled using these generative processes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6593.814,
    "end": 6606.151,
    "text": "So we simply identify the behaviors of constructing narratives, thinking about our past experiences, being a master of linguistic practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6607.313,
    "end": 6610.157,
    "text": "Can we just identify those behaviors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6610.222,
    "end": 6638.389,
    "text": " behaviors with what we're modeling when we use generative models that's where i say no because there's a lot more to the linguistic behaviors there are the practices the what people do when they belong to communities now interestingly and this connects to where we started from those practices and communal behaviors can also be modeled using",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6638.639,
    "end": 6651.797,
    "text": " Bayesian mechanics, where we think that the system now is a collective system that has maybe collective intelligence and is made up of lots of interacting agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6651.817,
    "end": 6656.964,
    "text": "So we can also model that system using Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6656.984,
    "end": 6662.972,
    "text": "But should we then say that the collective system just is a free energy minimizer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6664.394,
    "end": 6667.718,
    "text": "No, because the target system here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6667.698,
    "end": 6695.477,
    "text": " is one that can also be described by doing social science by doing linguistics and it can be described using lots of different explanatory frameworks and all of those explanatory frameworks can be made to um bridge can be bridged to from bayesian mechanics that's super interesting but we shouldn't then try to do a reduction of all of these other explanations to bayesian mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6695.677,
    "end": 6703.229,
    "text": " So what I'm resisting here is a kind of reductionism where everything can just be taken back to physics again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6704.07,
    "end": 6704.25,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6704.29,
    "end": 6705.052,
    "text": "I want to say no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6705.753,
    "end": 6720.115,
    "text": "There are social dynamics, cultural dynamics where we need the tools of social science, where we need to do ethnography, for instance, or anthropology, or where we need to do phenomenology to understand these dynamics and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6720.787,
    "end": 6728.24,
    "text": " And those also give us very good ways of interpreting and understanding what human beings are doing as agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6728.26,
    "end": 6728.54,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6729.862,
    "end": 6738.096,
    "text": "Yeah, I don't think it's a reductive claim, the relationship between the phenomenal and the physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6739.859,
    "end": 6742.103,
    "text": "When I've written about it, I've used words like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6742.319,
    "end": 6756.656,
    "text": " emergent or causally downstream from, and I know these are problematic words and whether it's supervenient or not, these are obviously very tricky and philosophically, um, deep questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6757.437,
    "end": 6770.672,
    "text": "I guess my, my only point here about was if it doesn't need to be reductive to say that representations, at least in this, uh, episodic memory imagining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6771.209,
    "end": 6775.096,
    "text": " might have a role or may play a part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6775.116,
    "end": 6776.398,
    "text": "I'm not saying it's the whole picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6776.919,
    "end": 6779.103,
    "text": "I'm not saying that it replaces the Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6779.864,
    "end": 6785.995,
    "text": "I think representations do play a role in episodic memory because there are forms of episodic memory which are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6786.515,
    "end": 6792.923,
    "text": " are such that we can articulate and we can express linguistically what we're remembering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6793.244,
    "end": 6802.156,
    "text": "And that process of putting it into words, of articulating it, is part of the construction, the reconstruction of that memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6802.536,
    "end": 6804.599,
    "text": "Okay, yeah, that's exactly right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6804.619,
    "end": 6808.003,
    "text": "So then my question really was, why are we considering this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6808.664,
    "end": 6811.628,
    "text": "You posit the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6811.608,
    "end": 6822.924,
    "text": " framing of offline representations as nested activities governed by the affordances that the environment grants us as a positive alternative to representation hungry cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6823.244,
    "end": 6827.67,
    "text": "But it sounds like you're also permitting there to be some representational schema in place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6828.451,
    "end": 6837.143,
    "text": "The difference is that we don't think of the representations as something that's part of the information processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6837.292,
    "end": 6842.818,
    "text": " representations get involved, but not via the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6843.158,
    "end": 6847.162,
    "text": "Because the generative model for us is just a mathematical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6847.223,
    "end": 6848.664,
    "text": "It's just pure statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6849.405,
    "end": 6860.897,
    "text": "It's not bringing in... I mean, you can then give interpretations of that statistics using constructs like Bayesian belief and inference over beliefs and inference of posteriors and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6860.917,
    "end": 6866.623,
    "text": "But that's all a gloss on something that is just mathematics and statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6866.603,
    "end": 6890.62,
    "text": " so where do the representations come in when we're trying to understand and explain in terms of cognitive neuroscience episodic memory they don't come in through the brain they come in through the coupling between the agent and an environment that is structured by social cultural linguistic practices so we talk about affordances in our more recent work as in languaged",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6890.903,
    "end": 6894.769,
    "text": " Andy Clark talks about material symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6895.39,
    "end": 6909.193,
    "text": "He has very interesting work with, um, um, trying to think of the name, the guy's name, Gary Lupian about how, uh, material symbols, for instance, can scope precision expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6910.114,
    "end": 6915.443,
    "text": "Um, but they're doing that work, not, uh, internally, but, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6915.794,
    "end": 6921.18,
    "text": " as material symbols that are in the environment, that are situated in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6921.841,
    "end": 6942.426,
    "text": "So this example of language sculpting attention, sculpting precision, is an example of a looping through the world where the material symbols are being taken up and included in the precision estimation process, in the sculpting of precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6942.406,
    "end": 6950.138,
    "text": " as something that is located in the environment, something where the agent is coupling with a with an environmental structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6950.599,
    "end": 6952.261,
    "text": "In this case, real symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6953.003,
    "end": 6959.252,
    "text": "Yeah, that makes it a lot clearer for me, I guess the question that going back to Shapiro's episodic memory imagining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6960.554,
    "end": 6960.955,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6962.116,
    "end": 6965.286,
    "text": " What would that look like in this kind of worldly loop?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6965.447,
    "end": 6973.071,
    "text": "So just to provide the example, he imagines going back to his family parent house in New Jersey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6973.507,
    "end": 6976.852,
    "text": " And he say, how on earth could that be part of, you know, how on earth can that be representation for you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6976.872,
    "end": 6978.655,
    "text": "But you're not saying that's representation for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6978.675,
    "end": 6984.683,
    "text": "You're saying it's just that that representation is yielded from the action, uh, the agent arena relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6984.703,
    "end": 6986.686,
    "text": "And it's not actually part of the Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6986.706,
    "end": 6986.847,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6987.568,
    "end": 6990.672,
    "text": "Well, what does, what does that mean for this Asian mechanics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6990.712,
    "end": 6995.92,
    "text": "Because I want the Bayesian mechanics story to apply to extended systems as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6996.28,
    "end": 6996.821,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6996.841,
    "end": 6997.743,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6998.764,
    "end": 7001.488,
    "text": "Internal to the brain anymore there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7001.924,
    "end": 7009.252,
    "text": " Part of this that's getting the representations involved is the coupling with representational practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7009.432,
    "end": 7023.628,
    "text": "So being a language speaker who can articulate and put into words a past experience like the poster that was hanging on your bedroom wall as a child.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7023.768,
    "end": 7025.029,
    "text": "Yes, Jimi Hendrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7025.6,
    "end": 7039.837,
    "text": " Being able to remember that poster is something that you can do because you're a language speaker who can describe, can make sense of linguistically past experiences that you've had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7039.857,
    "end": 7051.27,
    "text": "Is it wrong to say that just because that capacity is scaffolded from my development and the culture in which I've been raised, that that hasn't become internalized?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7051.655,
    "end": 7054.978,
    "text": " Are you permitting that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7055.018,
    "end": 7056.099,
    "text": "Because you're saying it's not in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7056.7,
    "end": 7064.768,
    "text": "My intuition is telling me that fine, language didn't... I mean, we're not going to go into nativism and Chomsky because it's not really that relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7065.148,
    "end": 7071.895,
    "text": "But fine, language comes from exposure to data and societal norms and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7072.495,
    "end": 7079.282,
    "text": "But at a certain point, I can use language in the absence of social contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7079.363,
    "end": 7084.831,
    "text": " Like in the case of my EM imagining, Shapiro's EM imagining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7085.632,
    "end": 7088.636,
    "text": "So it seems like in that case, it has been internalized to some degree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7089.617,
    "end": 7100.292,
    "text": "It's just that it was the presence of a previous social dynamic was necessary for its internalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7101.115,
    "end": 7103.639,
    "text": " Yeah, so that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7103.659,
    "end": 7110.851,
    "text": "And the key question there is how to think about what internalization means exactly in the case of episodic imagining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7112.814,
    "end": 7126.296,
    "text": "So in keeping with the ecological inactive approach, what we try to do is say, well, what conceptual framework do you need for making sense of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7126.411,
    "end": 7130.715,
    "text": " episodic imagining in terms of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7132.337,
    "end": 7154.038,
    "text": "So is it a representational conceptual framework, or can we instead use the tools of ecological inactive cognitive science, what we call the skilled intentionality framework, to make sense of the Bayesian mechanics that's involved in that example of episodic imagining?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7154.677,
    "end": 7163.708,
    "text": " And we would argue that you can make sense of what's happening in that case by thinking of it not vertically, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7164.309,
    "end": 7170.276,
    "text": "looking at the top layers of the generative model and then saying that's where episodic imagining happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7171.017,
    "end": 7175.582,
    "text": "It happens in a kind of mental time travel that is made possible by deep active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7176.223,
    "end": 7181.089,
    "text": "But instead thinking that the cognitive system here is an agent environment system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7181.643,
    "end": 7190.931,
    "text": " episodic imagining, internalization of linguistic abilities is a matter of skills that you have as a language user.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7191.732,
    "end": 7199.578,
    "text": "And those skills are then, well, the kind of meaning that's involved here is accounted for in terms of responsiveness to affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7199.758,
    "end": 7205.203,
    "text": "So this all just sounds very philosophical and not interesting to scientists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7205.323,
    "end": 7209.306,
    "text": "So I'm not sure how much your listeners are going to get out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7209.326,
    "end": 7210.487,
    "text": "Oh, they're philosophers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7210.527,
    "end": 7211.228,
    "text": "They love it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7211.748,
    "end": 7214.851,
    "text": " I mean, there's so much, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7215.511,
    "end": 7234.388,
    "text": "To go to agent environment system and to try to understand horizontally in terms of the dynamics within the agent environment system, what could be going on when somebody can revisit their past experiences and construct that kind of experience of the poster on their wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7235.589,
    "end": 7240.894,
    "text": "So horizontally, what's going on there, we think is that you're using your skills as a language user.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7241.448,
    "end": 7261.77,
    "text": " So as a master of English, I can then make sense of my past experiences and interpret them as the experiences of this poster of Jimi Hendrix, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7262.211,
    "end": 7262.832,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7262.913,
    "end": 7264.034,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7264.054,
    "end": 7264.355,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7264.775,
    "end": 7266.838,
    "text": "Cultural stuff that's packed into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7266.858,
    "end": 7267.078,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7267.619,
    "end": 7272.164,
    "text": "And that stems from our skills as speakers of a language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7272.765,
    "end": 7272.965,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7273.766,
    "end": 7273.906,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7273.926,
    "end": 7278.431,
    "text": "To cap off this profound conversation into affordances, which I'm sure has taken many people into the weeds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7278.651,
    "end": 7280.033,
    "text": "They're probably sick of us talking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7280.814,
    "end": 7292.768,
    "text": "I guess the question is, the overarching question therefore is, so these representational states are scaffolds yielded from language learning in a cultural setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7293.254,
    "end": 7311.913,
    "text": " In terms of the actual act, therefore, of reimagining, do the presence of those representations have a causal role, or are they just epiphenomenal over the affordance exploitation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7316.077,
    "end": 7320.021,
    "text": "But the representations just are affordances for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7320.693,
    "end": 7335.829,
    "text": " Now we try to have an ecology, a cultural ecosystem that is populated by affordances that, that grow out of our linguistic practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7340.013,
    "end": 7346.7,
    "text": "So the representation, external representations, we think that there are no internal mental representations because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7347.322,
    "end": 7359.323,
    "text": " Those are scientific constructs in internal mental representation that require you to be able to solve this hard problem of content that we were talking about earlier on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7360.552,
    "end": 7363.776,
    "text": " Um, we don't think that representations are not real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7364.016,
    "end": 7369.103,
    "text": "There are real representations, but they're just not internal mental representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7369.163,
    "end": 7370.585,
    "text": "They're not internal to the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7371.245,
    "end": 7380.036,
    "text": "They come from our cultural systems, like our linguistic practices, our systems of making pictures and images and diagrams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7381.118,
    "end": 7385.624,
    "text": "Um, we couple to those practices as participants in those practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7385.764,
    "end": 7389.208,
    "text": "And that's what allows us to engage in, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7389.712,
    "end": 7397.46,
    "text": " in representational style cognition by making use of these external resources in our environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7399.943,
    "end": 7400.043,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7400.063,
    "end": 7414.558,
    "text": "And I guess the people's worry might be the sort of standard objection that this position means that affordances can't have any objective quality, which undermines Gibson's original realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7415.078,
    "end": 7417.761,
    "text": "But I believe you have a response to that in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7418.298,
    "end": 7448.018,
    "text": " the fact that we also have to take in the material reality of the affordances too into account not only our socio-cultural practices again the paper the 2014 paper is cracking so everyone can just go there um i mean how long have we been going for two hours and five minutes okay we'll wrap up in a bit in a sec there's so many things i want to ask about um we didn't even really touch on you can you can like figure it out in the editing right yeah yeah yeah it's always all in the editing in the end i don't edit them that much um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7449.348,
    "end": 7456.335,
    "text": " I do want to so there's, there's a paper that you have about mindness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7457.457,
    "end": 7459.379,
    "text": "So about self modeling and mindless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7461.521,
    "end": 7464.684,
    "text": "Which I thought was really interesting as I'm fascinated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7464.704,
    "end": 7473.333,
    "text": "This is slightly further down on your Google Scholar, but I saw it and I thought I have to have a bit of that because I love the self modeling is entirely why I'm fixated on them or not entirely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7474.134,
    "end": 7474.815,
    "text": "And you say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7476.297,
    "end": 7480.608,
    "text": " In line with the arguments of the phenomenologists, I will claim that every feeling must be felt by someone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7480.849,
    "end": 7483.997,
    "text": "It must have mindfulness built into it if it is to feel a particular way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7487.567,
    "end": 7491.758,
    "text": "Some people might go, well, I thought that Anil Seth and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7492.328,
    "end": 7496.695,
    "text": " absence of curious said that mindfulness came from interoceptive inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7497.557,
    "end": 7501.844,
    "text": "And that is the sort of seat of the so called minimal phenomenal self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7502.826,
    "end": 7508.415,
    "text": "And if that disbands, so does the notion that the experiences the feelings the affect that I have a mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7510.479,
    "end": 7516.108,
    "text": "Maybe it's worth just separating your perspective or your position from theirs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7518.08,
    "end": 7527.571,
    "text": " Yeah, so this goes back to, again, generative passage between phenomenology and free energy principle, cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7527.591,
    "end": 7531.836,
    "text": "Because the mindness construct is a phenomenological construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7531.856,
    "end": 7547.293,
    "text": "It's describing a structure of consciousness whereby every conscious state is also experienced at the same time as it is an experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7547.645,
    "end": 7558.881,
    "text": " Mindness is capturing the relationality that is part of the experience, whereby it's an experience of mine or yours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7559.682,
    "end": 7568.935,
    "text": "Sometimes this is called sense of ownership, that each experience is owned by a subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7570.157,
    "end": 7576.926,
    "text": "And then when you have phenomena like depersonalization or derealization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7577.277,
    "end": 7584.229,
    "text": " That can be thought of in terms of a loss of this experience of mindness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7585.03,
    "end": 7587.374,
    "text": "We can debate whether that is entirely lost or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7587.394,
    "end": 7589.137,
    "text": "So Anna Chaunica says it's not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7589.978,
    "end": 7591.541,
    "text": "It's just disturbed in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7592.062,
    "end": 7594.746,
    "text": "So there's still this phenomenological structure that's present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7595.387,
    "end": 7602.88,
    "text": "But the phenomena of depersonalization, derealization is a disturbance of that structure of experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7603.501,
    "end": 7604.562,
    "text": " And I think that's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7605.323,
    "end": 7617.293,
    "text": "So then what we need to try to do is to take the phenomenological structure and bridge to how we could think about that in terms of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7619.255,
    "end": 7633.187,
    "text": "And that's where the idea of interceptive inference or multisensory integration understood in terms of integrating interceptive predictions with extraceptive predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7633.454,
    "end": 7650.292,
    "text": " That becomes then a construct within active inference that we can use to build that bridge from the phenomenology, the idea of mindness as a phenomenological structure to cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7650.312,
    "end": 7650.973,
    "text": "Okay, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7651.392,
    "end": 7657.881,
    "text": " Okay, so so yeah, Anna doesn't say that it completely disbands the sense of ownership.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7657.901,
    "end": 7664.931,
    "text": "I don't know if you've read George Dean's paper on where he's got two papers wonderful, but one on derealization, the other on psychedelics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7665.833,
    "end": 7666.534,
    "text": "Yeah, self dissolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7667.215,
    "end": 7668.096,
    "text": "He goes a bit further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7668.116,
    "end": 7673.784,
    "text": "And I made this point at the end of my paper that I think they're talking about two separate parts of the derealization process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7673.804,
    "end": 7676.888,
    "text": "And I think Anna's is just a bit more moderate, whereas George's is a bit more severe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7677.71,
    "end": 7677.99,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7678.375,
    "end": 7680.898,
    "text": " It's a good, good difference that you pick up on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7680.958,
    "end": 7686.583,
    "text": "That's definitely a divergence, an interesting divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7686.603,
    "end": 7693.19,
    "text": "Just talking about my from, I think it's very explicable that divergence, but I think they're just talking about two different phenomenological states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7694.251,
    "end": 7699.857,
    "text": "But George would say, she would be a really good guest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7700.297,
    "end": 7704.722,
    "text": "She has spoken to plenty of times, I think, yes, I think she might well be coming on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7706.283,
    "end": 7707.825,
    "text": "But I guess the question here is, okay, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7708.953,
    "end": 7715.223,
    "text": " I'm from the school of people who say, well, mindless is emergent from the computational processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7715.243,
    "end": 7722.395,
    "text": "It's emergent from the interoceptive inferences, from the integration, the multisensory integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7723.797,
    "end": 7729.627,
    "text": "So what that means is that if that breaks, so for example, George Dean gives an example of torture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7730.248,
    "end": 7733.914,
    "text": "And I mentioned this to Chris as well, that if you're in a torture chamber,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7734.738,
    "end": 7740.383,
    "text": " you're going to be very unlikely to be able to succeed in suppressing interoceptive prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7740.404,
    "end": 7743.607,
    "text": "And torture is a very reliable instigator of depersonalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7744.668,
    "end": 7746.63,
    "text": "But there are still experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7747.49,
    "end": 7748.311,
    "text": "There are still feelings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7750.053,
    "end": 7751.334,
    "text": "But the sense of ownership has gone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7752.255,
    "end": 7756.059,
    "text": "But you said, I will claim that every feeling must be felt by someone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7757.24,
    "end": 7758.962,
    "text": "So who are those feelings being felt by?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7759.002,
    "end": 7764.627,
    "text": "So what's lost is the transparency in that case of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7764.91,
    "end": 7787.492,
    "text": " um ordinarily our uh our sense of mindness the experiential self is not something that gets in the way uh something that was conspicuous in our experiences rather transparent we look through it to the world and that notion of transparency is then modeled using uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7788.299,
    "end": 7791.603,
    "text": " disattending sensory attenuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7791.643,
    "end": 7793.065,
    "text": "Thomas Metzinger and all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7793.085,
    "end": 7794.006,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7794.026,
    "end": 7794.787,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7794.807,
    "end": 7812.45,
    "text": "So what happens in the torture example, I think, is that what would normally be transparent becomes opaque.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7813.171,
    "end": 7813.311,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7814.607,
    "end": 7836.148,
    "text": " and then becomes very conspicuous to you and your way of dealing with the prediction errors that come with the pain experience, and we've done some work on pain, is by dissociating from it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7836.628,
    "end": 7841.332,
    "text": "Okay, that's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7841.733,
    "end": 7842.994,
    "text": "So it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7843.177,
    "end": 7848.784,
    "text": " Yes, I mean, people do talk about derealization, for example, as this kind of bubble wrap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7849.165,
    "end": 7855.473,
    "text": "That's there as a function to dissociate from pain and from the anxiety of being eaten by a tiger or whatever in the savannah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7857.355,
    "end": 7860.719,
    "text": "So okay, that's the kind of not off the pain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7861.681,
    "end": 7864.004,
    "text": "You're arguing that the minus is still there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7864.044,
    "end": 7873.015,
    "text": "It's just somewhat clouded by this objectification or opacity of what normally would be transparent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7874.142,
    "end": 7882.317,
    "text": " So go back to Melo Ponti's example of the two hands touching, which he uses to illustrate how the body is both an object and a subject of experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7883.459,
    "end": 7890.673,
    "text": "And ordinarily there's this, what he calls a chiasm, so an intertwining of the subject and the object in the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7891.634,
    "end": 7894.159,
    "text": "And what happens in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7894.274,
    "end": 7901.889,
    "text": " depersonalization, derealization is that this intertwining of subject and object now breaks down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7901.929,
    "end": 7906.277,
    "text": "You have now a kind of distancing of the subject from their body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7907.239,
    "end": 7910.545,
    "text": "And that's necessary in the torture example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7911.031,
    "end": 7923.37,
    "text": " It's necessary to, in some way, disidentify with the pain experiences, to treat them as some kind of object that's separate from you if you're to be able to deal with the pain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7924.391,
    "end": 7939.755,
    "text": "So the derealization is a kind of adaptive response to what would otherwise be overwhelming, where you can gain a distance from it and relate to it as if it were not you that this was happening to, as if it were an object that was separate from you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7940.579,
    "end": 7943.302,
    "text": " Yes, this is this is this is very much Anna's account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7944.424,
    "end": 7953.094,
    "text": "And it feeds into this notion of kind of hyper precision over beliefs about the self model, which leads to this kind of dissociation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7953.835,
    "end": 7969.253,
    "text": "But again, like the way that I was writing about it was not only that, but also what Dean and colleagues spoke about in 2020, which is, they use this quote from a writer called Lofthouse 2014, saying,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7969.655,
    "end": 7993.62,
    "text": " first time i remember feeling like the first time i can remember feeling like i didn't exist i was 15. i was sitting on a train and all of a sudden i felt like i'd been dropped into someone else's bodies my memories experiences and feelings uh and feelings the things that make up my intrinsic sense of meanness projected across my mind like phantasmagoria but i felt like they belonged to someone else like i was experiencing life in the third person so this seems slightly different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7995.035,
    "end": 8005.951,
    "text": " But I think the key thing to pull out from that quote is I felt like these experiences belong to somebody else that I felt there is that still the presence of mindness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8006.092,
    "end": 8011.68,
    "text": "So it's me that this is happening to similarly in examples of ego dissolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8011.7,
    "end": 8011.78,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8011.94,
    "end": 8013.984,
    "text": "That's what I was going to ask about as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8014.004,
    "end": 8014.765,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8014.785,
    "end": 8019.191,
    "text": "Psychedelics that George talks about in the losing ourselves paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8019.231,
    "end": 8024.299,
    "text": "And also in another paper about ego dissolution, I forget what it's called.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8024.735,
    "end": 8028.703,
    "text": " There are a couple on there, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8028.723,
    "end": 8032.951,
    "text": "So you might think, well, ego dissolution is a kind of egoless experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8033.051,
    "end": 8037.9,
    "text": "This is how Raphael Millier describes ego dissolution in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8038.42,
    "end": 8046.092,
    "text": " in extreme examples that there's just this complete loss of ego, of self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8047.515,
    "end": 8057.03,
    "text": "But I think rather what happens in those examples is that there's you that's undergoing these very strange experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8057.871,
    "end": 8059.914,
    "text": "You're still present as the subject of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8059.934,
    "end": 8062.839,
    "text": "It's still me that this is happening to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8062.879,
    "end": 8064.782,
    "text": "I've taken the psychedelic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8064.762,
    "end": 8073.954,
    "text": " And now I'm undergoing this experience of loss of boundary between me and the world or this kind of feeling of union and connectedness with nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8073.974,
    "end": 8077.298,
    "text": "And that's an experience that I'm having.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8077.378,
    "end": 8081.523,
    "text": "So there's still that mindness that's part of the experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8082.945,
    "end": 8089.774,
    "text": "But there's something that's lost as well, which is this higher narrative layer of the self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8090.277,
    "end": 8105.322,
    "text": " Instead of identifying with who I have been in the past and then that identity being brought into the framing of my experience, I think George is right that there's this kind of loss of temporal depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8105.462,
    "end": 8115.238,
    "text": "So influence of the narrative on your experience of who you are at that moment is now stripped away",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8115.843,
    "end": 8120.525,
    "text": " But still, what's in place is the core or minimal self, the mindless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8121.891,
    "end": 8124.503,
    "text": "And for you, that's just intrinsic to the experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8125.225,
    "end": 8149.242,
    "text": " it's part of the structure of the experience it's a phenomenological structure interesting as you saw described it called it ipsaity and of course disturbed in in uh psychopathologies like schizophrenia or uh depersonalization derealization depression these are all disturbances of the self yes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8149.778,
    "end": 8154.123,
    "text": " of that ipsaity, which is part of our experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8154.223,
    "end": 8156.165,
    "text": "It's our perspective on the Welsh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8156.666,
    "end": 8179.633,
    "text": "So I guess my thinking here is that maybe I'm wrong, that where I've divorced Dean George's and Anna's accounts, they can actually be tied under the single banner of distancing, opacity, hyper-precision over self-models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8180.035,
    "end": 8200.795,
    "text": " so on not that dean that not that george's account implies the total uh dissolving of the self-model uh well you know there's there's some debate about this isn't there about whether the self-model is entirely dissolved or not and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8201.348,
    "end": 8209.698,
    "text": " George, I think just talks about it in terms of the shrinking of the temporal depth, this diminution of the temporal depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8212.161,
    "end": 8218.649,
    "text": "So you could ask, well, is there still something that is left of the self once that temporal depth is lost?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8219.75,
    "end": 8229.482,
    "text": "I would tend to think about it in terms of different layers of the self model and the temporal, the loss of temporal depth is describing the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8230.137,
    "end": 8232.079,
    "text": " the narrative layer of the self model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8233.901,
    "end": 8244.012,
    "text": "That could leave in place the bodily core minimal self, which is what is accounting for mindness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8245.974,
    "end": 8257.326,
    "text": "But it isn't in and of itself, according to you, sufficient for mindness in the sense that mindness is just part of the structure of experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8258.268,
    "end": 8270.978,
    "text": " So as well, is there a distinction here between mindless and self modeling such that you could have dissolved entirely dissolved self models, but you would still have experiences that by necessity are owned by someone?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8271.532,
    "end": 8280.165,
    "text": " It goes back to the same question about the relationship between phenomenology, personal level explanation, sub-personal processes, Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8280.325,
    "end": 8286.294,
    "text": "And the way I think about that relationship is using the idea of generative passage from Varela.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8286.935,
    "end": 8299.935,
    "text": "So mindness and phenomenal selfhood, I don't think are identical with the generative model and the processes that are described using Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8300.455,
    "end": 8313.814,
    "text": " Those processes explain in the sense of they give us a model that will allow us to bridge to phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8315.076,
    "end": 8317.479,
    "text": "But they don't reduce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8318.0,
    "end": 8330.277,
    "text": "You can't reduce the first-person experience, which is where we start from, the lived experience, to what can then be described, modeled in third-person terms using Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8330.442,
    "end": 8354.992,
    "text": " But if I were to say that, I guess what I'm getting up to here is you could claim, there have been claims, for example, that interoceptive inference underwrites the minimal self model, such that if interoceptive inference falls apart, if it's just completely unsuccessful, such as in the torture chamber, the minimal self model itself will dissolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8355.092,
    "end": 8360.078,
    "text": "If you just grant me that causal relationship,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8361.273,
    "end": 8379.57,
    "text": " But the construct of the minimal self model is a construct introduced by Metzinger in order to make sense of cognitive neuroscientific models of lived experience, of phenomenal selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8379.59,
    "end": 8388.438,
    "text": "And of course, Metzinger thinks that we should be strong realists about the phenomenal self model as described in cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8388.558,
    "end": 8390.52,
    "text": "And we should say that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8391.108,
    "end": 8399.857,
    "text": " that what we learn from cognitive neuroscience is there's no self and that mindness is just a construct of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8401.098,
    "end": 8402.98,
    "text": "It's hallucinated actually in the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8403.201,
    "end": 8415.293,
    "text": "It's a controlled hallucination, but in the end you can lose it entirely because it depends on and is identical with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8415.796,
    "end": 8419.42,
    "text": " inferential processes that are taking place in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8419.961,
    "end": 8431.315,
    "text": "Whereas my view is different from Thomas's in that I don't start from cognitive neuroscience and what can be modeled within cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8432.156,
    "end": 8437.062,
    "text": "I take as my starting point, and this is what Varela meant when he said,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8437.666,
    "end": 8461.918,
    "text": " um that cognitive science should always go back to find a way back to lived experience because lived experience is where we start from and it's what we must always return to and this is from um his paper on um neurophenomenology so so that the idea there is that what's basic what we start from is lived experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8462.607,
    "end": 8467.655,
    "text": " And then we have to try to find a way to explain that in the terms of cognitive neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8467.675,
    "end": 8472.022,
    "text": "And that's what the phenomenal self-model gives us and what Bayesian mechanics give us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8472.082,
    "end": 8478.954,
    "text": "They give us a way of explaining in naturalistic cognitive science terms what is described in phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8479.715,
    "end": 8484.042,
    "text": "But what's real, what's most real here, what we start from is lived experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8484.477,
    "end": 8494.349,
    "text": " Would you say that Thomas says that the phenomenal self model is identical to the inferences that the brain makes or is emergent over the inferential mechanics that are occurring in the brain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8495.05,
    "end": 8498.053,
    "text": "As in one is causally related, the other one's an identity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8498.794,
    "end": 8501.678,
    "text": "Depends what you mean by emergent there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8501.758,
    "end": 8511.97,
    "text": "So emergence can be understood in like a weak sense of epistemically, we can't really predict from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8512.186,
    "end": 8530.723,
    "text": " the lower level, the properties that we find at the higher level because of non-linearity, because there's something non-additive about the causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8532.044,
    "end": 8536.708,
    "text": "That means you get something qualitatively new once you move to the higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8537.429,
    "end": 8541.012,
    "text": "And that can just be understood in a purely epistemic way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8541.498,
    "end": 8560.475,
    "text": " Or it can be understood ontologically that there's something new that's brought into existence, a self that you get from, or a phenomenal self-model, which is just a construct of the brain, but it's a higher-level construct that emerges out of lower-level processing as something ontologically new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8562.096,
    "end": 8570.003,
    "text": "And then you could say, well, what's the relationship between the phenomenal self-model and the experience of being somebody or the experience of mindness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8571.367,
    "end": 8578.055,
    "text": " And Thomas's answer to that last question is that the experience of being someone is an illusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8578.396,
    "end": 8589.469,
    "text": "It's a, a, the outcome of, um, the phenomenal self modeling process, which is in turn the outcome of inference and Bayesian modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8590.31,
    "end": 8596.378,
    "text": "He would now say, I guess, um, so, um, emergence,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8597.928,
    "end": 8620.172,
    "text": " answer your question can be understood in like a weak sense or it can be understood in a stronger ontological sense and the stronger ontological notion doesn't decide in favor of the reality of the self because you could still believe that this phenomenal self model is strongly emergent even though in the end it's just an inferential construct of the brain and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8620.996,
    "end": 8633.942,
    "text": " So whether you say emergence gets you a real self or just gets you and lose reconstruct, as Thomas argues, I think doesn't fall out of the concept of emergence on its own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8635.812,
    "end": 8639.097,
    "text": " Okay, that's, that's really, that's real food for thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8640.298,
    "end": 8657.483,
    "text": "I'm gonna have to differentiate out my position and the position of other people that are trying to do neuro phenomenology from, from Thomas's position, because we think, I'll speak for myself, I think that the Varelian project of generative passage,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8657.952,
    "end": 8666.441,
    "text": " means that what's real here is being in the world or lived experience, the body subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8667.061,
    "end": 8683.638,
    "text": "And then the task for anyone that is doing 4E cognition that comes out of the inactive strand of 4E cognition is to try to build a bridge back from lived experience to what can be described scientifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8684.619,
    "end": 8687.622,
    "text": "So thereby making room for lived experience within science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8688.26,
    "end": 8703.994,
    "text": " And that can then take a more elaborate form like John Vavakey's project of not only just trying to build room for lived experience within cognitive science, but these richer notions like wisdom and the sacred and meeting in life and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8705.535,
    "end": 8716.545,
    "text": "But yeah, it's, it's at least according to your, your own phenomenological camp, I might say that the reduction to the science is a false move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8718.145,
    "end": 8721.19,
    "text": " Yeah, I take 4E cognition to be non-reductive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8722.472,
    "end": 8731.425,
    "text": "Sometimes that non-reduction move is cashed out in terms of a strong notion of emergence, so that connects to what I think you were trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8731.445,
    "end": 8742.702,
    "text": "So Evan Thompson will talk about neurophenomenology as committed to circular causality, where at the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8743.39,
    "end": 8752.621,
    "text": " the higher levels that are to do with consciousness and lived experience loop back down and change the lower level dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8753.682,
    "end": 8769.06,
    "text": "So that's a kind of downward causation or a strong form of emergence that he thinks you get from neurodynamics, from self-organization, from autonomy, which is where we started from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8770.053,
    "end": 8785.432,
    "text": " Um, so neuro phenomenology then would, would get you a kind of metaphysics where, uh, there's a strong form of emergence and consciousness can actually make a difference to, um, neural dynamics too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8785.933,
    "end": 8786.373,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8787.395,
    "end": 8795.084,
    "text": "As a higher level property, it can loop back down and change the faster changing processes in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8795.765,
    "end": 8796.045,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8796.626,
    "end": 8799.79,
    "text": "Well, this, this has its resonance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8800.681,
    "end": 8804.806,
    "text": " to use a relevant term with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8807.088,
    "end": 8809.711,
    "text": "But yeah, as you say, it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8809.731,
    "end": 8827.971,
    "text": "There's this idea of enslaving and synergetics that Carl has been influenced by that comes from Herman Harkin, where there's ensemble dynamics that unfold over slower timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8828.288,
    "end": 8832.374,
    "text": " and loop back and change the faster time scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8833.295,
    "end": 8837.361,
    "text": "So causation that's being described there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8838.343,
    "end": 8840.546,
    "text": "Get away from the analytic philosophy, just more colloquially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8841.708,
    "end": 8844.171,
    "text": "Would you ever use the term self modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8845.253,
    "end": 8845.513,
    "text": "For you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8845.533,
    "end": 8845.773,
    "text": "Does it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8845.954,
    "end": 8846.254,
    "text": "Does it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8847.196,
    "end": 8853.705,
    "text": "Does it make sense in terms of the phenomenological starting point to even talk about self models?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8854.495,
    "end": 8859.282,
    "text": " Or is it, does it, does it make more sense to talk about intentionality and mindless and so on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8860.463,
    "end": 8882.173,
    "text": "So I, again, we have this necessity to, to keep apart the phenomenology, which we're trying to bridge to where I think notions like mindless and intentionality are have their home and the, the, the modeling that we're doing when we use active inference models to explain, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8882.474,
    "end": 8908.026,
    "text": " there i don't okay yeah where we also talk about models and um we talk about a generative model and and we then give intentional semantic glosses on that generative model but that last move i resist making and i say no that intentionality always belongs within lived experience which we can then explain using bayesian mechanics which is non-intentional and non-representational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8908.343,
    "end": 8912.169,
    "text": " I meant more, maybe I should have said more, this is like metacognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8912.749,
    "end": 8925.408,
    "text": "Because metacognition in a way is, it feels like a form of intentional self modeling, or phenomenological self modeling in the sense of in lived experience, you are reflecting on yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8927.311,
    "end": 8932.478,
    "text": "Yeah, is that self model, which is grounded in phenomenological intentionality?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8934.297,
    "end": 8946.735,
    "text": " So using Thomas's framework, we can talk about the phenomenal self-model and we can say within that there's a minimal self and then there's the epistemic agent model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8947.276,
    "end": 8951.142,
    "text": "So these are all ways of talking about the self-model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8951.122,
    "end": 8953.045,
    "text": " within active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8954.807,
    "end": 8958.212,
    "text": "Of course, I don't deny that we can talk about the self-model there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8958.232,
    "end": 8974.276,
    "text": "In fact, in the paper you talked about, I do something that no one else has picked up on and no one else seems to like, which is to say that all generative models are actually self-models because what's being modeled by a generative model is an agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8974.316,
    "end": 8980.285,
    "text": "So going back to the agent is a model of its environment and the greatest theorem and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8980.872,
    "end": 8996.65,
    "text": " And the agent in active cognitive science, in active philosophy, is a point of view, a perspective on the world relative to which you can make sense of the world and make distinctions between what's good for me, what's bad for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8998.773,
    "end": 9009.445,
    "text": "So I want to argue that right at the core of all generative modeling, because the generative model, at least when it's applied to life,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9009.593,
    "end": 9013.94,
    "text": " is the model of an agent, a minimal agent, is a self-model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9014.621,
    "end": 9017.906,
    "text": "So generative models are always self-models, I want to argue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9018.487,
    "end": 9031.348,
    "text": "It's not that there's some part of a generative model at the higher layers of it where we can start to say, well, that's the self-model, or an interceptive inference, say, and say that's the self-model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9032.071,
    "end": 9042.983,
    "text": " Micah Allen and Manos Sekiris have a beautiful figure, actually, where they have the self-model right at the core of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9043.083,
    "end": 9044.485,
    "text": "And that, to me, is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9044.785,
    "end": 9047.228,
    "text": "And they talk about the first prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9047.869,
    "end": 9049.571,
    "text": "Yeah, the body is the first prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9050.171,
    "end": 9061.504,
    "text": "Yeah, Anna Chaunaker and Catalina also talk about the... And Manos also talk about the self as a first prior, but they understand the self...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9061.636,
    "end": 9068.284,
    "text": " model here in a more relational way into subjective, so thinking about attachment dynamics, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9069.205,
    "end": 9079.637,
    "text": "But all of that work, for me, indicates that you can't really take the idea of the agent as a model of its environment without thinking that the model there is a self-model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9080.678,
    "end": 9083.241,
    "text": "So I'm very serious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9083.301,
    "end": 9089.348,
    "text": "I think the self-model construct is extremely important in thinking about how the agent could be a model of its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9090.931,
    "end": 9104.732,
    "text": " But the move that Thomas makes then of just reducing the self as a phenomenological experience to the self-modelling, I want to resist because I don't like his reductionism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9105.232,
    "end": 9109.699,
    "text": "And I certainly don't like his move of saying the self doesn't exist, the self is not real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9110.05,
    "end": 9114.736,
    "text": " I don't think Buddhism really, uh, substantiates that idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9114.756,
    "end": 9118.421,
    "text": "And I don't think, uh, cognitive science supports it either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9118.461,
    "end": 9122.746,
    "text": "So I would resist a kind of move to a no self theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9125.71,
    "end": 9127.552,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9127.572,
    "end": 9137.965,
    "text": "I'm gonna call, I'm gonna say that that's, that's good for me because, uh, we've covered so much ground and we could go on for hours more, but yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9138.164,
    "end": 9141.307,
    "text": " That's enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9142.608,
    "end": 9143.97,
    "text": "There's so much to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9143.99,
    "end": 9152.018,
    "text": "To be candid, I'm coming out of the Metzinger school, which is informed active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9153.279,
    "end": 9164.07,
    "text": "So it's difficult at a personal level to real time shift one's paradigm because maybe some of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9164.27,
    "end": 9171.103,
    "text": " bear in mind that there's, there are other ways of using active inference here that don't necessarily leads to a no self theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9173.026,
    "end": 9177.916,
    "text": "Well, yeah, I mean, I wouldn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9179.298,
    "end": 9181.823,
    "text": "Is there a difference between the no self and the constructed self?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9185.195,
    "end": 9199.761,
    "text": " uh yes and that you can think that constructions are real and whereas thomas wants to say no if the self is constructed inferentially yeah then you should infer from that that that no one ever was or had a self",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9200.045,
    "end": 9202.31,
    "text": " Yes, I've seen him say that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9203.392,
    "end": 9205.877,
    "text": "I agree that the self is a construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9206.518,
    "end": 9214.194,
    "text": "Evan Thompson has this very nice idea in his work on Eastern philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9214.214,
    "end": 9215.877,
    "text": "Why I am not a Buddhist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9216.127,
    "end": 9240.379,
    "text": " yeah where he thinks that the self is a construct but the layers of the self that construct the self come from things like the body from our intersubjective relations like katarina and manosagi from our uh being uh members of a culture where other people can understand us in a particular way so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9240.359,
    "end": 9258.199,
    "text": " and then we can take on board how we're perceived or understood by others so these are all layers that lead to the construction of the self um but we shouldn't then infer that the self isn't real just because it's constructed or that no one ever was or had a self that just doesn't follow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9258.398,
    "end": 9265.25,
    "text": " And I don't want to go on the side of instrumentalists here and say, if it's a modeling tool, then what's being modeled is not anything real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9266.051,
    "end": 9275.006,
    "text": "So Michael and I have done work on this with Ian Robertson, where we say that that amounts to making what we call the literalist fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9275.668,
    "end": 9280.035,
    "text": "So the fallacy of thinking that in order for a model to be a model of something real,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9280.015,
    "end": 9285.5,
    "text": " The model has to be taken literally as describing what is literally happening in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9285.76,
    "end": 9287.302,
    "text": "And that's not true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9287.362,
    "end": 9294.889,
    "text": "You can be a realist about these models without thinking that what's being described is something that's literally real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9296.09,
    "end": 9303.517,
    "text": "So models involve you making all kinds of imaginative leaps from what you're modeling to the target phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9303.537,
    "end": 9305.619,
    "text": "Yeah, that's really useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9305.659,
    "end": 9309.583,
    "text": "I feel like I've been slightly converging on this in my own thinking that there's a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9310.795,
    "end": 9316.844,
    "text": " something that I've been coming to find is that there's a difference, this might be not entirely the same, but it's adjacent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9317.985,
    "end": 9328.4,
    "text": "There's a difference between maybe what the Bayesian mechanics permits, and I use that word knowing that it's probably the wrong word, but permits in terms of the phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9330.123,
    "end": 9335.31,
    "text": "And there's an actual, but there's a difference between that and the actual phenomenology itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9337.393,
    "end": 9339.216,
    "text": "And I think that might be akin to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9339.331,
    "end": 9340.713,
    "text": " Yeah, that's exactly what I'm saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9340.753,
    "end": 9352.989,
    "text": "So there's the model that we use as scientists, and then there's the target system that we're modeling, which is the system as just, well, phenomenologists wouldn't call it a system, but lived experience as it's described, which is what we're trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9353.049,
    "end": 9357.194,
    "text": "And we're trying to build this generative passage from the modeling to phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9358.015,
    "end": 9360.158,
    "text": "And those are different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9360.712,
    "end": 9364.658,
    "text": " One is the model, the other is the target of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9365.119,
    "end": 9372.551,
    "text": "The target could be phenomenology or it can be the brain because these are both targets that we're trying to use the generative modeling to capture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9373.572,
    "end": 9376.597,
    "text": "But the relationship here is between the model and the target system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9377.359,
    "end": 9378.46,
    "text": "Oh, that's so useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9378.801,
    "end": 9379.482,
    "text": "That's so useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9379.542,
    "end": 9383.508,
    "text": "Again, it's not helped by the fact that it's called a phenomenal self model, is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9383.649,
    "end": 9387.715,
    "text": "I mean, that's a way of really deflating that gap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9388.117,
    "end": 9395.387,
    "text": " But of course, for Metzinger, he does that for a good reason because he thinks no one ever was or had a self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9396.509,
    "end": 9399.493,
    "text": "So all there is to the self is the phenomenal self model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9400.654,
    "end": 9406.943,
    "text": "Whereas I'm saying no, phenomenologically, the self belongs in phenomenology and it's real because that's where it comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9407.364,
    "end": 9414.073,
    "text": "Isn't it a bit odd to call it a phenomenal self model and then say there's nothing, there's no self given that it's phenomenal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9415.471,
    "end": 9417.174,
    "text": " Does that not strike you as a slight contradiction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9417.214,
    "end": 9424.606,
    "text": "Because we take the phenomenal reality to be real in and of itself, regardless of how we end up demarcating it and reifying it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9425.027,
    "end": 9426.71,
    "text": "We take lived experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9427.09,
    "end": 9429.915,
    "text": "The idea of the ego tunnel, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9430.155,
    "end": 9434.202,
    "text": "And it's a bit like the Plato's cave myth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9435.484,
    "end": 9437.908,
    "text": "So, yes, the self appears to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9439.19,
    "end": 9440.753,
    "text": "It appears to be real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9441.07,
    "end": 9444.775,
    "text": " But the argument is then it's just an appearance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9445.135,
    "end": 9446.677,
    "text": "And where does that appearance come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9447.298,
    "end": 9449.921,
    "text": "It comes from the construction of this phenomenal self model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9451.182,
    "end": 9451.923,
    "text": "That's enough for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9451.963,
    "end": 9462.977,
    "text": "That still seems to be like what you're talking about in terms of mindness, subjectivity, intentionality, which for me seem to be the things that matter in the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9463.582,
    "end": 9482.552,
    "text": " yeah interesting what this comes back to is whether you're a physicalist or not so if you if you think that reality fundamentally is just what can be described and explained by physics which i think thomas would in the end endorse yes uh the phenomenal self model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9483.055,
    "end": 9489.346,
    "text": " is going to be reducible to neurobiological processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9489.366,
    "end": 9492.511,
    "text": "And those are going to, in the end, come back to something physical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9493.333,
    "end": 9501.266,
    "text": "Whereas phenomenologists are not physicalists, they're non-reductive naturalists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9501.406,
    "end": 9504.051,
    "text": "They try to have a softer form of naturalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9504.352,
    "end": 9508.756,
    "text": " John Faveke talks about transcendent naturalism in some of his work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9509.977,
    "end": 9516.823,
    "text": "That's because he has in view trying to get to the wisdom traditions in the end from these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9516.904,
    "end": 9526.813,
    "text": "But these softer forms of naturalism, I think, are alive possibilities for us as well when we're using active inference and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9526.833,
    "end": 9531.557,
    "text": "We don't have to be physicalists, whereas Alex, Jacob, Hoey,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9531.824,
    "end": 9536.909,
    "text": " You know, they're long time on card-holding physicalists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9537.73,
    "end": 9543.395,
    "text": "And the free energy principle goes nicely with physicalism because there's so many of these ideas are coming from physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9543.635,
    "end": 9557.108,
    "text": "And so you might think, well, it follows from where all of these ideas are being drawn from that we should end up being physicalists about anything that's described in phenomenology, which means being reductionists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9557.809,
    "end": 9559.25,
    "text": "But I just don't think that that's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9559.27,
    "end": 9561.072,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9561.305,
    "end": 9572.717,
    "text": " Going forward, in your present work and past work and forward work, what words would one use to talk about bridging this gap?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9573.417,
    "end": 9580.044,
    "text": "Because we want to keep the Bayesian mechanics and we want to keep the phenomenology and we want to find an explanation that's non-reductive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9580.985,
    "end": 9585.81,
    "text": "This is taking you back to philosophy when I was at school.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9585.976,
    "end": 9589.62,
    "text": " What are the relations that we're trying to describe here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9589.64,
    "end": 9591.162,
    "text": "Are these causal relations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9591.683,
    "end": 9599.933,
    "text": "They're not epiphenomenal, but what's the best way of talking about them from your perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9602.516,
    "end": 9607.942,
    "text": "Well, I see myself as doing neuro phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9609.424,
    "end": 9613.789,
    "text": "So what that means is that I think there's a necessity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9614.292,
    "end": 9630.395,
    "text": " when we're explaining phenomena that are tied to lived experience like consciousness, the self, and disturbances that can happen in mental illness, of making reference to first, second-person experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9631.977,
    "end": 9638.967,
    "text": "And that then means using methods for studying first-person experience like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9640.212,
    "end": 9670.067,
    "text": " phenomenology but also uh contemplative methods like meditation mindfulness because they involve something that is akin to the phenomenological reduction as it was practiced by phenomenology so what we need to try to do is to find ways of bridging between what can be described in first person terms and what can be described third person what's the relationship between those well the reductionist would say that the first person reduces to the third person",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9670.537,
    "end": 9676.428,
    "text": " Whereas I try to have a metaphysics where it's non-reductive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9677.51,
    "end": 9678.431,
    "text": "So what does that look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9678.471,
    "end": 9682.799,
    "text": "Well, I don't think there's anything outside of science that we're dealing with here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9682.999,
    "end": 9687.508,
    "text": "So it's nothing like metaphysically spooky being introduced here, I wouldn't want to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9688.309,
    "end": 9690.553,
    "text": "But we need a more relaxed naturalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9691.073,
    "end": 9693.858,
    "text": " And what is the metaphysics of that going to involve?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9693.898,
    "end": 9702.893,
    "text": "Well, it involves having a richer notion of causality, for instance, than just efficient causality, because we're thinking about self-organizing systems now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9702.913,
    "end": 9709.605,
    "text": "So we need to have what Alicia in her book",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9709.94,
    "end": 9735.795,
    "text": " um context matters for everything or something right constraints yeah enabling constraints yeah yeah yeah so we need that we need a notion of enabling constraints for instance here um we need self-organization we need to have a kind of teleology here and so in discussions of the free energy principle people sometimes wonder about um what's the reality of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9735.944,
    "end": 9739.267,
    "text": " of what Spinoza called the conatus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9740.168,
    "end": 9746.675,
    "text": "It is part of what we're looking at when we try to model agents as free energy minimizing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9747.776,
    "end": 9756.184,
    "text": "And Axel has said, no, it's not, because the existence of the agent is a consequence of free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9757.746,
    "end": 9761.85,
    "text": "You don't get an explanation of why agents exist out of free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9762.674,
    "end": 9774.878,
    "text": " I want to say something different from Axel there, that living systems do indeed have this drive to maintain themselves, this conatus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9775.212,
    "end": 9784.206,
    "text": " So the metaphysics that we need here is something that looks a lot like Spinoza's metaphysics, that you've got a substance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9785.428,
    "end": 9788.513,
    "text": "I don't really like substance talks or that part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9788.573,
    "end": 9790.697,
    "text": "I would try and resist and go to processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9790.837,
    "end": 9800.933,
    "text": "But you do need this idea of a canatus, I think, in accounting for what makes the difference between a pebble and a living system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9802.027,
    "end": 9807.417,
    "text": " And that we can make sense of in terms of free energy minimization as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9807.617,
    "end": 9811.644,
    "text": "So the metaphysics that comes out of this is not physicalist metaphysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9811.684,
    "end": 9816.232,
    "text": "It's something that has room for there being a difference between living systems and pebbles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9817.174,
    "end": 9818.757,
    "text": "And that we can make sense of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9819.098,
    "end": 9820.099,
    "text": "Beyond just the physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9820.901,
    "end": 9822.203,
    "text": "In terms of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9822.243,
    "end": 9826.11,
    "text": "So look at the paper about strange particles, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9826.63,
    "end": 9833.164,
    "text": " And look at the work that Michael and I did about the difference between mere active inference and adaptive active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9833.986,
    "end": 9845.23,
    "text": "And there's an account there, a print support account that comes out of active inference about the difference between a mere physical system and a living system, a biological agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9846.155,
    "end": 9849.16,
    "text": " This goes loops back to where we started with autonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9849.24,
    "end": 9849.54,
    "text": "Of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9849.58,
    "end": 9852.545,
    "text": "I'm just so aware that Carl would just say, well, this is Justin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9852.565,
    "end": 9853.466,
    "text": "I'm using his hand signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9855.089,
    "end": 9857.152,
    "text": "This is the depth of temporal planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9859.255,
    "end": 9867.087,
    "text": "Again, what you're saying, that's the Bayesian mechanics, but that's not everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9867.748,
    "end": 9870.272,
    "text": "There's a non reductive phenomenology on top of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9873.374,
    "end": 9893.475,
    "text": " yeah so i do want to say that that's uh that it isn't just about the the temporal depth of the generative model this difference between the a being that has a canatus a drive to maintain itself and uh yeah because the model here is just a model of that kind of thing and that kind of being yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9894.012,
    "end": 9896.938,
    "text": " Julian, gosh, I've learned so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9897.86,
    "end": 9900.625,
    "text": "I thought I came in knowing roughly what I was talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9900.645,
    "end": 9903.972,
    "text": "And I've left ever so confused and in doubt with myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9904.012,
    "end": 9905.695,
    "text": "But nonetheless, it's been wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9905.936,
    "end": 9906.537,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9907.023,
    "end": 9911.07,
    "text": " or inspiring and incredibly informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9911.17,
    "end": 9917.78,
    "text": "They should just leave you in a bit of a confused state where you then try and sort through your confusions and make sense of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9917.821,
    "end": 9919.423,
    "text": "No, not at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9919.543,
    "end": 9920.645,
    "text": "It's been incredibly useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9920.725,
    "end": 9926.555,
    "text": "I feel like I've kind of cheated my way six months ahead of my education in three hours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9927.256,
    "end": 9928.718,
    "text": "So that's no bad thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9928.818,
    "end": 9933.486,
    "text": "It's just super informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9933.668,
    "end": 9938.419,
    "text": " What can people look forward to in terms of your upcoming work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9940.083,
    "end": 9940.504,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9940.584,
    "end": 9946.958,
    "text": "So something we didn't get to talk about at all, which is a shame is the work we've been doing on play and playfulness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9946.978,
    "end": 9947.199,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9947.259,
    "end": 9947.68,
    "text": "I know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9947.7,
    "end": 9948.061,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9948.081,
    "end": 9948.642,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9948.662,
    "end": 9949.183,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9949.785,
    "end": 9952.15,
    "text": "Aerodynamics came up very briefly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9952.602,
    "end": 9960.131,
    "text": " So I've been working with Mark Miller in Aarhus University with Mark Anderson there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9961.693,
    "end": 9970.224,
    "text": "We've been developing ideas around why it's fun and pleasurable to learn through play activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9971.605,
    "end": 9980.196,
    "text": "So together with Mark Anderson, we have a paper that's now under revision with topics in cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9980.699,
    "end": 9985.025,
    "text": " in a special issue about development of models of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9985.545,
    "end": 10000.105,
    "text": "And we talk about the contribution of play in child development in that paper, using our ideas about aerodynamics and carrying on our account of why it is fun to learn through play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10001.346,
    "end": 10004.31,
    "text": "So that's one of the things that we're working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10004.56,
    "end": 10016.9,
    "text": " And then together with my colleague Damian Denise here in Amsterdam, we're starting a new center on this interface between psychiatry, psychotherapy and philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10017.621,
    "end": 10027.717,
    "text": "My work as part of that will be using active inference to try to understand psychotherapy, say in the context of psychedelic psychotherapy, for instance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10028.378,
    "end": 10031.142,
    "text": "So I'm doing work on psychedelics that come out of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10032.151,
    "end": 10038.538,
    "text": " but also trying to apply active inference to make sense of mental illness more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10038.578,
    "end": 10042.842,
    "text": "And finally, how things can go well for people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10042.862,
    "end": 10048.549,
    "text": "So that's the work that I've been doing with Mark Miller on wellbeing and meaning in life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10049.45,
    "end": 10062.023,
    "text": "That's gonna continue to be a strand of research to try to make sense of how people can be happy and be well using these tools of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10062.712,
    "end": 10087.133,
    "text": " wonderful well i'm gonna need to go take a nap because i've had my world view just demolished and i didn't even know that it was problematic but it's fine um i'm sure we'll stay in touch um i'd love to i mean you're a true inspiration and the wealth of knowledge is just unbelievable so thank you again for giving me free hours which has felt like 15 minutes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10087.45,
    "end": 10092.78,
    "text": " My final question is a tongue-in-cheek one, but I'm giving you three phenomenologists and you have to choose one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10093.742,
    "end": 10096.166,
    "text": "Herschel, Heidegger, Merleau-Ponty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10096.968,
    "end": 10097.268,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10098.891,
    "end": 10103.58,
    "text": "I'm going to go for Merleau-Ponty because he's like a combination of Husserl and Heidegger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10103.901,
    "end": 10104.622,
    "text": "He's underrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10105.063,
    "end": 10106.566,
    "text": "Both of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10106.866,
    "end": 10110.994,
    "text": "And he's French, so coming back to your theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10111.261,
    "end": 10117.213,
    "text": " your Franco file comment earlier on everything from France is wonderful, including French philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10117.273,
    "end": 10121.963,
    "text": "So apart from that, it rains in June, according to my model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10122.804,
    "end": 10126.131,
    "text": "She's a French rather than German.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10126.718,
    "end": 10148.98,
    "text": " yes yeah absolutely uh and a bit more legible of course but yes uh the style is just so much more uh pleasurable to engage with of his writing than you know heidegger he has his own style but it's uh it's much harder and husal is uh he's a mathematician so there's fewer hyphens in merleau-ponty despite the hyphen in the name",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10149.736,
    "end": 10174.191,
    "text": " yes julian thank you so much um i think we probably there's been a couple of wi-fi on and off but this is the beauty of editing is i will go in and scrub it all out but um genuinely on my part it's been an absolute pleasure um i know daniel and the rest of the inference uh clear enough you're able to follow it all make a story out of it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10174.947,
    "end": 10175.61,
    "text": " I hope so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10176.172,
    "end": 10179.929,
    "text": "But yes, for me and the rest of the team here at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10179.949,
    "end": 10180.652,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10181.797,
    "end": 10182.882,
    "text": "My pleasure.",
    "speaker": "SPEAKER_00"
  }
]