[
  {
    "start": 9.608,
    "end": 32.345,
    "text": " all right we are live welcome everybody thank you for joining us live or in replay this is actin flab live stream number 23.0 it's may 27 2021 and we're going to be talking about the paper embodied skillful performance and i'm daniel i'm here with blue and dean so thanks for joining you too",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.417,
    "end": 36.598,
    "text": " Welcome everybody to the ActInf Lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.398,
    "end": 43.401,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.101,
    "end": 46.603,
    "text": "You can find us at the links that we have laid out here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.543,
    "end": 52.825,
    "text": "This is recorded in an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 53.806,
    "end": 56.967,
    "text": "All backgrounds and perspectives are welcome to contribute here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 56.987,
    "end": 60.789,
    "text": "And as far as video etiquette for live streams, we'll be doing our best.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.534,
    "end": 71.738,
    "text": " We're heading into June so soon, in just a few weeks, and we'll be having discussion number 23.1 and .2 on this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 71.878,
    "end": 82.243,
    "text": "So today it's gonna be about background and context, and then we're looking forward on June 8th and 15th, 2021, to be talking about this in a group setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 83.823,
    "end": 92.504,
    "text": " So as stated, the goal of this 23.0 is to set the context for the upcoming .1 and .2 videos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 93.285,
    "end": 104.467,
    "text": "We're going to be discussing the paper, Embodied Skillful Performance, where the action is, which is a collaboration of Hippolyto, Baltieri, Friston, and Ramsted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 105.267,
    "end": 109.967,
    "text": "And just like the other .0s, it's an introduction and a first pass to some of these ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 110.107,
    "end": 112.668,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.729,
    "end": 125.979,
    "text": " We're gonna go over the aims and claims, the abstract roadmap, and then kind of walk through the figures plus a few of these ideas because there are a lot of cool ideas and it's an embodied paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.279,
    "end": 128.661,
    "text": "It's about our movement and our behavior in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.721,
    "end": 134.446,
    "text": "So hopefully that will lead all of us to have some fun ideas about what it means and where it applies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.629,
    "end": 139.171,
    "text": " And of course, we're looking forward to the .1 and .2 discussions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 139.651,
    "end": 149.577,
    "text": "So you can write any questions during this stream in the live chat, or you can write a comment, or find a way to get that question to us otherwise, and get in touch if you want to participate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 150.557,
    "end": 150.717,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 153.118,
    "end": 168.782,
    "text": " to slide six we're checking out this paper embodied skillful performance where the action is and before we get to the aims and claims maybe each of you any just top of the head thoughts what made you excited or curious about this paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.351,
    "end": 182.101,
    "text": " I don't want to talk too much about this because it was a great paper, but I, again, could go off into the wilderness very rapidly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.161,
    "end": 191.451,
    "text": "So I want to just kind of stick to what the basics of the paper are and we'll worry about other ideas in point one and point two for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.852,
    "end": 192.452,
    "text": "Sounds great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 192.673,
    "end": 194.134,
    "text": "Thanks for that contribution, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.345,
    "end": 205.216,
    "text": " I've been just thinking a lot about, you know, related to this paper and other work I'm involved in right now, like how beliefs and desires and intentions map to action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.696,
    "end": 208.659,
    "text": "So it was really kind of cool to see this perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.981,
    "end": 210.221,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.323,
    "end": 215.987,
    "text": "So maybe Blue, want to start with the aim of the paper?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 220.464,
    "end": 221.906,
    "text": " Or I'll read it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.926,
    "end": 222.927,
    "text": "Sure, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.368,
    "end": 223.909,
    "text": "I was muted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.929,
    "end": 234.162,
    "text": "It says, the aim of this paper is to discuss critically the limitations of instructionist control theoretic models of skillful performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.983,
    "end": 236.005,
    "text": "So that's the overall aim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.385,
    "end": 236.565,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 236.945,
    "end": 239.107,
    "text": "Nice that they said it so clearly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.587,
    "end": 241.089,
    "text": "So that's what they're trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.269,
    "end": 248.454,
    "text": "They're bringing up what's the instructionist control theory model of skillful performance, which we're going to cover the background on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.095,
    "end": 260.863,
    "text": "And then they're going to show that that instructionist assumption in its strong and weak form is imbued in the optimal motor control theory or OMCT framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 261.644,
    "end": 271.852,
    "text": " And then coming in to save the day, Active Inference is going to be proposed as an alternative framework for understanding skillful performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.833,
    "end": 282.2,
    "text": "And they then conclude by suggesting that if we understand these generative models within Active Inference as formal tools,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 282.921,
    "end": 290.267,
    "text": " then we may be able to have an account of skilled performance that's based upon interactions rather than instructions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.868,
    "end": 300.476,
    "text": "So that's kind of cool because instructions are how computers work and education is also sometimes framed as being about instruction rather than interaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 302.475,
    "end": 308.677,
    "text": " So here is the abstract, and then either of you are welcome to add a thought or it stands alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 309.617,
    "end": 313.519,
    "text": "When someone masters a skill, their performance looks to us like second nature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.979,
    "end": 321.101,
    "text": "It looks as if their actions are smoothly performed without explicit knowledge-driven online monitoring of their performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.782,
    "end": 326.883,
    "text": "Contemporary computational models in motor control theory, however, are instructionist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.383,
    "end": 331.265,
    "text": "That is, they cast skillful performance as a knowledge-driven process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 332.305,
    "end": 358.227,
    "text": " optimal motor control theory omct as representative par excellence of such approaches casts skillful performance as an instruction instantiated in the brain that needs to be executed a motor command this paper aims to show the limitations of such instructionist approaches to skillful performance we specifically address the question of whether the assumption of control theoretic models is warranted",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 359.261,
    "end": 362.262,
    "text": " Then they lay out the three sections or four sections of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 363.023,
    "end": 373.627,
    "text": "The first section of this paper examines the instructionist assumption according to which skillful performance consists of the execution of theoretical instructions harnessed in motor representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.407,
    "end": 383.391,
    "text": "The second and third sections characterize the implementation of motor representations as motor commands with a special focus on the formulations from OMCT.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 384.531,
    "end": 400.415,
    "text": " The final sections of this paper examine predictive coding and active inference, behavioral modeling frameworks that descend but are distinct from OMCT, and argue that the instructionist control theoretic assumptions are ill-motivated in light of new developments in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.136,
    "end": 403.196,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 405.441,
    "end": 405.581,
    "text": " Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.481,
    "end": 406.661,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.681,
    "end": 415.764,
    "text": "So I think that there is a place for command and control, but it's not the only place or the sort of all-embracing place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.804,
    "end": 418.864,
    "text": "And I think that's what the paper sets out to try to show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.905,
    "end": 420.125,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.445,
    "end": 425.706,
    "text": "They don't say there is no such thing as instruction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 426.686,
    "end": 433.788,
    "text": "They just suggest that for talking about motor control and for skilled performance especially, maybe there's a better way to frame it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.694,
    "end": 437.755,
    "text": " The roadmap is shown here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 438.136,
    "end": 440.677,
    "text": "So it starts with an introduction section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 441.698,
    "end": 460.251,
    "text": "They then introduce their whipping horse, the scapegoat, the instructionist model of skillful performance, and discuss how motor representations are playing the role essentially of motor commands in a sort of brain instructing the body model of motor behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 461.274,
    "end": 475.417,
    "text": " They talk about how motor commands are representational, and we'll talk a little bit about representations as well, and then connect the ideas of motor commands and instructionism to optimal control theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 475.917,
    "end": 488.499,
    "text": "So basically saying in order to achieve that kind of optimal or even adequate control, instructions are being sent to the motor department of the university from a non-motor department like the nervous system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 489.966,
    "end": 507.154,
    "text": " In section six, less control, more action, they try to move the discussion from simply optimal control to a broader consideration of the dynamics of biological systems framed generally as in the case of predictive coding and active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 508.393,
    "end": 522.108,
    "text": " And then in section seven, they discuss how motor control, again, building up this argument that it's about interactions, not just instructions, they frame motor control as being a mode of sensory motor engagement with the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 522.509,
    "end": 528.215,
    "text": "And even that word sensory motor kind of suggests that there's gonna be a non-duality between sense and action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.996,
    "end": 532.118,
    "text": " which brings us, of course, to active inference and the conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.259,
    "end": 538.523,
    "text": "And also then after the conclusion, there's a box where they define active inference and free energy and some other terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.224,
    "end": 540.965,
    "text": "So that's the roadmap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.026,
    "end": 544.007,
    "text": "Any thoughts on the roadmap or we'll just keep on going?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.569,
    "end": 545.769,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 546.529,
    "end": 549.592,
    "text": "Okay, the keywords were laid out by the authors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.172,
    "end": 552.474,
    "text": "Skillful performance, it's right there in the title.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.694,
    "end": 554.756,
    "text": "So not too surprising that it's a keyword.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 555.396,
    "end": 557.638,
    "text": "They also talk about optimal control theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 558.908,
    "end": 566.636,
    "text": " instructionism, motor representation, action-oriented representations, and our favorite, active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.257,
    "end": 572.903,
    "text": "So we're going to now meander through these keywords and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 574.346,
    "end": 579.252,
    "text": " define it, try to use the author's own words to see how they framed the keyword.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 579.452,
    "end": 587.382,
    "text": "And then also just because we're having fun here in this trio, we took it in a few different ways and brought up some related ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 588.123,
    "end": 590.727,
    "text": "And so I think this will be a fun walk through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.54,
    "end": 599.182,
    "text": " So I'll read the author's definition of skillful performance, and then both of you please add.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.962,
    "end": 615.407,
    "text": "So skillful performance in the paper is defined as, as opposed to bare movements such as breathing and blinking, skillful performances are intelligent bodily activities which harness knowledge about how to perform certain movements expertly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.007,
    "end": 623.937,
    "text": " And just to describe some of the expert movements that we see on this slide, we have a basketball, a sports ball being played with a free throw.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 624.618,
    "end": 625.419,
    "text": "We have a pilot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.619,
    "end": 630.846,
    "text": "This is kind of an extended skillful performance involving a flight deck in the cockpit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.607,
    "end": 641.13,
    "text": " We have various styles of dance and performance and martial arts and interaction, whether touching somebody or not touching somebody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.41,
    "end": 647.291,
    "text": "These are all skillful activities that people can train their entire life to enable the performance of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.972,
    "end": 653.313,
    "text": "So either of you, I'm sure you can jump in on this key term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 654.593,
    "end": 655.694,
    "text": "So blue first, then Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 655.754,
    "end": 655.894,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.604,
    "end": 657.124,
    "text": " I'll jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.705,
    "end": 667.952,
    "text": "You know, I thought like, of course, these are all very physical and like sensory motor, but there's also, I mean, I guess all things are, but like music, I think was brought up in the paper that's not here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.972,
    "end": 672.675,
    "text": "And I think about stuff I've done, like, you know, and think about like surgery, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.715,
    "end": 676.317,
    "text": "Like, like what a surgeon does, like they go, that is a skillful performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.637,
    "end": 680.08,
    "text": "It might not be in front of others, but like, you have to just kind of know and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.6,
    "end": 685.222,
    "text": " like guided by your kinesthetic memory, like any kind of aseptic technique, lab work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.262,
    "end": 690.625,
    "text": "I'm sure you've done some wet lab work, Daniel, like where it's like you come in and it's like you just have to flow through it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.406,
    "end": 692.026,
    "text": "Yeah, pipetting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 692.526,
    "end": 692.706,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.327,
    "end": 694.447,
    "text": "They have robots for that now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 695.087,
    "end": 695.768,
    "text": "And that's the joke.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 695.828,
    "end": 697.189,
    "text": "How do you know someone's a biologist?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.529,
    "end": 701.711,
    "text": "They can take the cap of the toothpaste off and put it back on with one hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 704.124,
    "end": 707.687,
    "text": " That's what we do with bottles of reagents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 708.969,
    "end": 712.071,
    "text": "It takes so much time to think about it at first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.192,
    "end": 713.873,
    "text": "And then you just do it without thinking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.074,
    "end": 720.94,
    "text": "So there's this ironic where you're consciously trying to do it with one hand and not touch the other thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.04,
    "end": 724.623,
    "text": "And then after you do it for so many years, it just becomes second nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.643,
    "end": 726.185,
    "text": "Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.281,
    "end": 742.22,
    "text": " Yeah, it was interesting to me because I don't know when the line is crossed and you go from an autonomic habituated response, the part about blinking, the ones that I don't think about versus the ones when my spouse says,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.121,
    "end": 749.768,
    "text": " She looks at me and I wasn't aware of it in the past, but she was using those blinks in a certain way and was very effective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.188,
    "end": 754.292,
    "text": "I went way over my head, but she was sending a signal and it worked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.973,
    "end": 761.479,
    "text": "So is it, again, it can come down even to, it can come to thinking and not thinking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.56,
    "end": 766.665,
    "text": "And it can also come to sometimes what we notice and don't notice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.638,
    "end": 792.919,
    "text": " i agree and not to um generalize too rapidly but perhaps active inference can describe the entire continuum of performance and so we're almost dismantling this idea of skilled performance because that makes it sound like there's going to be a distinction between skilled and unskilled whereas walking is a skill and there's so many different capacities and constraints and ways that the body adapts to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.201,
    "end": 821.364,
    "text": " itself and its needs so it's something that you can learn and anyone who's had a physical injury or needs to go to physical therapy it's relearning as well so i think it's a big way to talk about motor behavior but it's almost like saying if we can clear this high bar if we can have an active inference account that is playing piano or doing martial arts then surely we can have one that is more at a unskilled level but it's still a skill",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 824.031,
    "end": 824.891,
    "text": " Okay, nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.632,
    "end": 827.373,
    "text": "So then I'll play the video.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.393,
    "end": 835.076,
    "text": "I don't think you'll see it, but I'm playing the video in the background of Elo Wan, a plant hybrid, hybrid, plant robot hybrid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 835.236,
    "end": 837.137,
    "text": "And this is from the MIT Media Lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 837.417,
    "end": 840.579,
    "text": "So Blue, what made you want to put this video here while it's playing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.991,
    "end": 847.174,
    "text": " So I just kept thinking, like, they kept using the terminology motor plant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.734,
    "end": 851.677,
    "text": "And having seen this video, like, I was like, oh, motor plant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.777,
    "end": 856.1,
    "text": "That reminds me of this motor plant that's attached to a motor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.281,
    "end": 859.803,
    "text": "And the, you know, mechanisms that are used for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.763,
    "end": 873.29,
    "text": " motion in in the plant um which is is awesome so i just i don't know wanted to put it in there and just see if maybe our active inference active in for plants applies across you know all domains of life",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.417,
    "end": 895.599,
    "text": " yep very nice so it's kind of like we know that active inference is a scale free framework but also it sort of doesn't have a human centered frame either so this is a plant that in the video you can see it's using its signaling processes to react to stimuli and move back and forth between these two lights",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.32,
    "end": 901.464,
    "text": " So it's kind of like a person in a mobility device.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.045,
    "end": 905.487,
    "text": "You're giving it a new affordance by modifying its niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 906.068,
    "end": 913.093,
    "text": "And so just like we're rethinking skilled versus unskilled, we're also maybe rethinking who gets to have behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.034,
    "end": 925.961,
    "text": " And that made me think of a paper from 1989 by my PhD advisor, Deborah Gordon, and a collaborator, Silberton, where they laid out a framework for plant behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.782,
    "end": 937.088,
    "text": "And they just plainly wrote out, here we use the term behavior to mean what a plant or animal does in the course of an individual's lifetime in response to some event or change in its environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.788,
    "end": 960.375,
    "text": " so it's like it's what things do you know just do it that's Behavior and that's kind of how action is in active inference whether your active state is you can only move one finger or you can move all your fingers those are your active state affordances so we want to have a framework that is able to accommodate differences in individuals or even species in how they behave",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 961.909,
    "end": 962.91,
    "text": " Can I add one thing, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.93,
    "end": 971.414,
    "text": "I think that the adding of the wheels, and you've heard the cliche, it's a game changer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.255,
    "end": 974.977,
    "text": "But essentially, the rules changed in that video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 975.657,
    "end": 979.639,
    "text": "And when the rules change, the behaviors can modify.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.659,
    "end": 984.022,
    "text": "And I think that's one of the things that comes out in this paper later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.062,
    "end": 987.844,
    "text": "If we want to include that, we want to sort of inflate it up to that level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.542,
    "end": 989.782,
    "text": " Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 990.242,
    "end": 1001.986,
    "text": "And the skillful performance of music, you know, if somebody is really good at like drumming on their own body or using their voice box or beatboxing, like those are all sort of onboard tools and affordances that we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.607,
    "end": 1004.987,
    "text": "People can clap really well and do all sorts of stuff like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.408,
    "end": 1017.532,
    "text": "But once you start talking about physical instrumentation, whether it's a spoon or a violin or a drum set, you're talking about kind of modifying your niche and being able to undertake skilled performance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1018.772,
    "end": 1020.633,
    "text": " with your new tools.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1021.473,
    "end": 1029.016,
    "text": "So again, extended, embedded, encultured, cognition, the four E's, active inference, it's right there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1029.056,
    "end": 1045.323,
    "text": "And that's why we wanna think broadly about skilled performance here and invite into this conversation, whether a technical minded person or somebody who considers some of their own behaviors to be skilled performances, how does this remark on them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1047.406,
    "end": 1051.967,
    "text": " it brings us to what the authors call the paradox of skillful performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.247,
    "end": 1058.088,
    "text": "So they write, here's the paradox, a seemingly paradoxical relationship between action and knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.988,
    "end": 1062.429,
    "text": "Action both requires knowledge and is inhibited by knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1063.069,
    "end": 1074.952,
    "text": "Skillful performance involves both an exquisite sensitivity to cultural norms and situational context, but also kind of requires us to put that aside, at least consciously, while it's happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.041,
    "end": 1080.784,
    "text": " How then to make sense of the relation between knowledge and skillful performance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1081.244,
    "end": 1089.309,
    "text": "Surely knowledge is involved in skillful performance, but is it entirely in the form of a theory that ought to be executed as a top-down instruction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.95,
    "end": 1092.711,
    "text": "Anything to add on this paradox?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.053,
    "end": 1101.316,
    "text": "I think that you can have thinking as doing and then you can have doing as doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.356,
    "end": 1102.037,
    "text": "And I think this is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1103.328,
    "end": 1106.569,
    "text": " talking to some of the ideas around the quieting of the mind piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.609,
    "end": 1112.81,
    "text": "So instead of always having these commands coming through, you don't have to think about it so much anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.49,
    "end": 1114.61,
    "text": "So yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.231,
    "end": 1120.912,
    "text": "I like the idea that knowledge inhibits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.072,
    "end": 1125.032,
    "text": "So action requires knowledge, but it's also inhibited by it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.453,
    "end": 1129.593,
    "text": "It lends itself to the kind of overthinking process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.793,
    "end": 1130.554,
    "text": "You're overthinking it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.574,
    "end": 1131.294,
    "text": "You're never going to get it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.874,
    "end": 1136.335,
    "text": " I think someone was just speaking on Tuesday about like holding the butterfly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.355,
    "end": 1137.035,
    "text": "Was it Steven?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.055,
    "end": 1148.198,
    "text": "You know, like, it's like when, when you grip an idea, like I want to ride a bicycle or play the piano, you have to hold it and like, let it rest on your hand, but don't like squeeze it or you'll, you'll kill the butterfly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.518,
    "end": 1150.799,
    "text": "And that kind of like reminds me of this knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.819,
    "end": 1154.0,
    "text": "Like if you're overthinking the process of playing the piano, like you're going to get it all wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.96,
    "end": 1155.1,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.032,
    "end": 1170.235,
    "text": " If you grab the handlebar too tight or grab your dance partner too tight, and then when you take it into the area like poetry recitation or playing a classical music piece, are they thinking about the sheet music?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1170.355,
    "end": 1175.176,
    "text": "Is their internal representation or knowledge what is enabling that performance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.756,
    "end": 1177.876,
    "text": "That's kind of what we're gonna be exploring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1177.936,
    "end": 1181.077,
    "text": "So they motivate that paradox as being something that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.877,
    "end": 1182.718,
    "text": " It has to be explained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.778,
    "end": 1187.624,
    "text": "Why do people choke when they think too much about their golf swing or their tennis swing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1188.144,
    "end": 1191.088,
    "text": "And we'll come back to flow and thinking about that later on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1192.756,
    "end": 1199.843,
    "text": " There has to be like this correct relational distance from the task that you're trying to perform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1199.963,
    "end": 1206.65,
    "text": "And I think that that is embodied by this sentence and action requires knowledge and is inhibited by it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.931,
    "end": 1208.913,
    "text": "You have to be the right distance away from it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.953,
    "end": 1210.354,
    "text": "Like if you're too close, it doesn't make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.394,
    "end": 1211.856,
    "text": "And if you're too far away, it doesn't make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.957,
    "end": 1213.097,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.783,
    "end": 1215.365,
    "text": " Yeah, I just want to add one other thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.405,
    "end": 1221.553,
    "text": "Like yesterday, I was walking in the park, and there was three kids that were zooming down the hill on their scooters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.253,
    "end": 1222.994,
    "text": "And the first kid...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.045,
    "end": 1236.436,
    "text": " was making the sound we like this, like not we as in she was having a good time, but she felt she had to put the reflective and the analytical on it because she was going first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.037,
    "end": 1239.659,
    "text": "She wasn't, she wasn't thinking about how much fun she was having.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.28,
    "end": 1247.927,
    "text": "She was thinking about, Oh, I'm supposed to say this is exciting, even though I'm really not sure if I'm going to go off into the trees or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.347,
    "end": 1248.767,
    "text": "And so she,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.588,
    "end": 1261.858,
    "text": " It's fascinating how we kind of get habituated to this idea that in a cultural setting, we have to let others know we're having fun when really what we're trying to do is not fall off the scooter, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.878,
    "end": 1265.02,
    "text": "Like that's a big part of this overthinking piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.261,
    "end": 1266.522,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.622,
    "end": 1274.928,
    "text": "And a roller coaster where you can't change the way that the roller coaster is working, but it just erupts people screaming or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1275.569,
    "end": 1276.51,
    "text": "What is going on there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1276.53,
    "end": 1278.051,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1279.821,
    "end": 1283.003,
    "text": " Optimal or laughing in a standup comedy situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.004,
    "end": 1286.405,
    "text": "So optimal control theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1287.106,
    "end": 1288.146,
    "text": "So that's OCT.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1288.847,
    "end": 1296.752,
    "text": "And they define OCT is a field in mathematical optimization that deals with finding a control for a dynamical system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.552,
    "end": 1301.334,
    "text": "But they spend most of the discussion, of course, with a focus on motor behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1301.775,
    "end": 1306.598,
    "text": "And so they introduced the OCMT, optimal control motor theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.358,
    "end": 1314.123,
    "text": " and write, OMCT is a label for the modeling tools used to study motor behavior and its neural processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1314.943,
    "end": 1326.791,
    "text": "We target specifically OMCT to show that it rests on the instructionist assumption, which we're gonna cover, that the brain literally contains and leverages explicit instructions for movements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.511,
    "end": 1332.555,
    "text": "So what did either of you think about OCMT?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.197,
    "end": 1348.846,
    "text": " I just thought it was really interesting because I would imagine that there would be some emotion on the part of the spotter, not the person on the handstand, if suddenly his cigarette fell out of his mouth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.906,
    "end": 1350.607,
    "text": "I assume that's a cigarette that's in his mouth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.048,
    "end": 1358.934,
    "text": "But he wouldn't even be aware of the fact that he lost something, that he was losing optimal control because his focus was off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.307,
    "end": 1361.367,
    "text": " elsewhere in front of him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.928,
    "end": 1369.031,
    "text": "So again, you have to kind of take this idea of skill and make sure that you understand what you're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.051,
    "end": 1374.833,
    "text": "Because yeah, there's probably a lot of skill perceived in the person doing the handstand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.974,
    "end": 1381.196,
    "text": "But there's also other skills going off there that we don't give as much attention over to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.441,
    "end": 1386.602,
    "text": " Yep, there's the skill of standing up, which is a dynamic process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1386.642,
    "end": 1389.663,
    "text": "There's holding an object in the lips, even of the observer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1390.103,
    "end": 1395.365,
    "text": "And then there's the spotter's skill to know when to intervene and when not to intervene.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1396.165,
    "end": 1402.967,
    "text": "And half of the battle is knowing when not to move and when to just let it ride and trust in the partner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.347,
    "end": 1409.629,
    "text": "So it's kind of cool that when people look at this photo, they might immediately be highlighting this sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.779,
    "end": 1422.206,
    "text": " difficult looking task, the stacked chairs and whatnot, but it's an idea that would help us explain this whole situation as active inference agents engaging in motor behavior potentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1422.866,
    "end": 1427.509,
    "text": "Well, it just asks us to redefine what command and control is, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.77,
    "end": 1429.01,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.511,
    "end": 1432.332,
    "text": "So how about instructionism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1433.294,
    "end": 1459.717,
    "text": " So on the left is a quote, which we're not going to read in full, but they do write down at the bottom, and I know, Blue, that we'll have a little bit to say on this from the genetics angle, but they write, following Wheeler and Clark's 1999 paper, yes, that Andy Clark, we will refer to this position as instructionism, which is the idea that skill is essentially of a theoretical nature mediated by knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.243,
    "end": 1467.487,
    "text": " We cast instructionism in terms of explicit instructions, that is, forms of knowledge that directly guide performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.847,
    "end": 1472.69,
    "text": "Like, okay, I'm supposed to run over to the left side of the stage when I hear the timpani, boom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.851,
    "end": 1481.876,
    "text": "Applied to skillful performance, the instructionist assumption prescribes that instructions are harnessed in separable structures such as beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.677,
    "end": 1486.919,
    "text": "And then on the left side is the abstract and title of Wheeler and Clark 99,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1488.16,
    "end": 1496.007,
    "text": " which is actually a paper called Genic Representation About Genes, Reconciling Content and Causal Complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1496.507,
    "end": 1499.73,
    "text": "So Blue, any thoughts on where genes come into play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1503.76,
    "end": 1515.703,
    "text": " I mean, it's all, right, like there's penetrance and there's, you know, all of these things come into this, you know, genetic relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.803,
    "end": 1518.683,
    "text": "And so I think it's interesting to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.803,
    "end": 1527.325,
    "text": "And also, I think as the authors point out that there's, you know, the genes aren't really the instructions for creating protein, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.365,
    "end": 1529.806,
    "text": "Like they are just the fundamental blueprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.206,
    "end": 1533.688,
    "text": " So they don't have such a direct relationship with action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.068,
    "end": 1536.929,
    "text": "They're just like the belief system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.949,
    "end": 1537.869,
    "text": "They're not the intention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1537.889,
    "end": 1538.73,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1539.59,
    "end": 1553.756,
    "text": "We're going to spiral back to the mapping between genes and motor representations in a little bit, but just cool that they drew from a different area of philosophy and science to be building their instruction as point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.816,
    "end": 1557.238,
    "text": "But for the next few slides, let's focus back in on the motor behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1558.118,
    "end": 1562.943,
    "text": " So here we highlight a few different attributes of instructionism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.623,
    "end": 1568.928,
    "text": "So if somebody is asking, well, like, what is instructionism or what are its characteristics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1568.988,
    "end": 1573.132,
    "text": "Or how would I know if a theory is being cast in an instructionist frame?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1573.893,
    "end": 1579.978,
    "text": "Here in red, we have a few words like separability and its cousin modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.919,
    "end": 1587.405,
    "text": " We have representational thinking, which we're going to come back to as well, and normativity, meaning how things should be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.665,
    "end": 1593.751,
    "text": "And these are quotes saying, instructionism saying that instructions come in the form of separable structures such as beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1594.191,
    "end": 1596.213,
    "text": "So that implies separability, modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.074,
    "end": 1607.921,
    "text": " And then they also say that instructionism suggests that performance is enabled by motor representations, which harness knowledge about how a specific skillful performance should be executed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.321,
    "end": 1613.845,
    "text": "Like if the instructions were to have you fall over, that's not how you get to a walking person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1614.285,
    "end": 1615.646,
    "text": "So it's about how things should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.126,
    "end": 1619.909,
    "text": "And then if there's like something on your leg grabbing you down, it's about how you should escape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.709,
    "end": 1626.591,
    "text": " So here's kind of an example of instructionism with a person chopping herbs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1627.372,
    "end": 1632.874,
    "text": "And it's almost like you could imagine step one, first instruction, grip the herbs with one hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.454,
    "end": 1634.855,
    "text": "Step two, grip the knife.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1634.935,
    "end": 1638.196,
    "text": "And then step three is gonna be like, move your arm up and then move your arm down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1638.656,
    "end": 1640.617,
    "text": "Move it up, go to the side, drop it down again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1641.137,
    "end": 1645.719,
    "text": "So that's sort of a simplification, but it's highlighting how it's representing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.599,
    "end": 1651.382,
    "text": " It's saying what should be done, and it's giving separable instructions like a recipe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.083,
    "end": 1659.387,
    "text": "And so it's kind of a knowledge-driven pseudocode or recipe for getting a motor behavior done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.688,
    "end": 1662.77,
    "text": "Okay, first you're going to just do this, then you're going to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.671,
    "end": 1670.475,
    "text": "And they basically, again, highlight and cite suggesting that most accounts of...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1671.255,
    "end": 1680.069,
    "text": " motor representation have in common that they're representations of knowledge that get translated in a way into motor action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1680.71,
    "end": 1682.112,
    "text": "So that's the instructionism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1683.254,
    "end": 1684.757,
    "text": "Any thoughts on the knife slide?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.303,
    "end": 1694.789,
    "text": " So, you know, having watched a chef do this, like when I used to work in restaurants and then like trying to teach my children, like my daughter's nine, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.809,
    "end": 1697.21,
    "text": "Like it is horrifying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.23,
    "end": 1700.753,
    "text": "I'm like, you are going to cut your finger off, but like you watch a chef and they can do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.773,
    "end": 1701.934,
    "text": "They can be talking to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.054,
    "end": 1710.359,
    "text": "And, you know, I mean like doing 10 other things and chop, chop, chop, like not even looking or paying attention, just driving by, by sheer kinesthetic memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.02,
    "end": 1714.082,
    "text": "And then my daughter's like, girl, it's really scary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.102,
    "end": 1714.202,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.035,
    "end": 1716.175,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.335,
    "end": 1723.783,
    "text": "But if the instructions were too strong, then the individual would never learn how to chop without the direct oversight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1724.324,
    "end": 1726.626,
    "text": "So it's sort of a, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1726.726,
    "end": 1734.595,
    "text": "One thing could, does this not demonstrate clearly that knowledge and information are not the same thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1736.356,
    "end": 1737.658,
    "text": "What do you mean by that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.051,
    "end": 1754.964,
    "text": " Well, I mean, both are portable, but do we assume that they're the same thing when, in fact, what knowledge is is it demarcates how much mental time travel we can span as opposed to information, which can fill up volumes, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.045,
    "end": 1757.446,
    "text": "But it's not the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.246,
    "end": 1763.971,
    "text": "One is literally that we open the lid on the brain and we pour this stuff in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.371,
    "end": 1764.811,
    "text": "But when we...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.058,
    "end": 1770.879,
    "text": " when we unpack that, it doesn't come out the way that it went in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.939,
    "end": 1778.842,
    "text": "It comes out, the knowledge comes out as something that we can relate in terms of time spans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.082,
    "end": 1782.203,
    "text": "That's why we've had a lot of these conversations and a lot of these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.141,
    "end": 1790.563,
    "text": " A lot of these live streams that I participated in there, a lot of people now are coming back to, so what role does the hippocampus play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.763,
    "end": 1800.227,
    "text": "Is it a spatial thing or can we segregate that out from time or are these time cells as opposed to space cells?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.347,
    "end": 1810.591,
    "text": "I don't, I'm not going to go much further on this, but I believe that this slide shows once and for all that we should stop thinking of information as knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.74,
    "end": 1824.424,
    "text": " So I've thought a lot about this, Dean, about the relationship between information, data, knowledge, and wisdom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.725,
    "end": 1831.147,
    "text": "And I've thought about this in big groups and come to touch on some tentative definitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.267,
    "end": 1833.848,
    "text": "Data is information that's useful in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.709,
    "end": 1836.109,
    "text": "And then knowledge is the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.359,
    "end": 1842.784,
    "text": " the application of the data or the interpretation of the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.964,
    "end": 1847.389,
    "text": "And then like where wisdom is kind of knowing how to apply the knowledge, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.429,
    "end": 1852.055,
    "text": "So it's kind of like a succession of, from, you know, information to wisdom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1852.075,
    "end": 1855.278,
    "text": "I look at it in like a hierarchical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.288,
    "end": 1870.74,
    "text": " Do you see how people that are having difficulty, maybe they're addressing issues with dementia or Alzheimer's, and when their ability to mentally time travel collapses, so does their knowledge?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.483,
    "end": 1876.105,
    "text": "Very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1877.182,
    "end": 1883.552,
    "text": " at least not from a working memory and fluid ability to integrate and interpret in those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.932,
    "end": 1887.738,
    "text": "Again, I don't want to go off into the weeds, so I'm not going to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.319,
    "end": 1891.263,
    "text": "But I think one of the biggest problems that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.301,
    "end": 1903.025,
    "text": " this paper is pointing out is if you believe that information and knowledge are the same thing, you might want to go to a place that says command and control is what's actually happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.806,
    "end": 1908.428,
    "text": "My suggestion is this blows that up right here, right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1908.488,
    "end": 1911.549,
    "text": "Now, maybe I'm wrong, but I don't think I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.112,
    "end": 1925.203,
    "text": " So interestingly, Dean, I don't know if you know this or not, but Alzheimer's and dementia patients, like while they won't even remember the names of their children, they do remember the lyrics to songs, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.344,
    "end": 1929.187,
    "text": "And like they remember music in a way that is very different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.247,
    "end": 1931.629,
    "text": "So perhaps when you get to the level of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.27,
    "end": 1933.991,
    "text": " you know, skilled performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.291,
    "end": 1939.975,
    "text": "And I know like the active inference is going to kind of squish all motor in a minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.115,
    "end": 1941.256,
    "text": "We're going to squish it all together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.296,
    "end": 1946.86,
    "text": "But when you think about skilled performance, perhaps that knowledge is integrated in a deeper way, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.88,
    "end": 1958.067,
    "text": "Like you might be able to give, to get an Alzheimer's patient, if they were physically capable to ride a bicycle, like they still retain that knowledge without having to do some kind of command.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.167,
    "end": 1961.029,
    "text": "So there's maybe like some chain in the link is broken there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.069,
    "end": 1962.01,
    "text": "It's interesting to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.37,
    "end": 1970.112,
    "text": " Yeah, I mean, I've got firsthand experience because I've got family that are addressing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.852,
    "end": 1972.752,
    "text": "And yeah, so I know exactly what you're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.212,
    "end": 1983.775,
    "text": "And again, I don't want to carry this off too far, but I think it's worth contemplating what knowledge is relative to what information is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.835,
    "end": 1984.155,
    "text": "That's all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.655,
    "end": 2006.358,
    "text": " awesome points and for moving bodies bodies in motion space and time are going to be deeply intertwined you're always somewhere some when but we have the clock and we have the gps and so it makes it seem like you could separate those out but not for the body not for the embodied agent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2007.574,
    "end": 2013.539,
    "text": " So there's a few types of instructionism that they then flesh out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2013.759,
    "end": 2015.14,
    "text": "So that was the big category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2015.28,
    "end": 2016.061,
    "text": "It's about instructions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2016.602,
    "end": 2021.426,
    "text": "And they distinguish two kinds of instructionism, the strong form and the weak form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2022.226,
    "end": 2030.633,
    "text": "The strong form is the claim that neural representations, so specific like firing patterns and neurons and things like that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.454,
    "end": 2050.281,
    "text": " completely specify on their own the specific movements to be executed so if like you were recording from the brain you could just template out a specific firing sequence or a specific pattern and then that would be like the contract bicep now signal and the weaker form of instructionism is a more modest claim",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2051.061,
    "end": 2062.703,
    "text": " that among the many dynamically coupled systems that generate skillful performance, so the neurons in the bicep and everything in between and different regions in the brain, so all those dynamically coupled systems,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2063.618,
    "end": 2065.459,
    "text": " there is a special kind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2065.739,
    "end": 2066.94,
    "text": "Maybe you didn't capture it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2067.2,
    "end": 2070.882,
    "text": "Maybe you don't know what it is, but there ought to be a special kind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2071.462,
    "end": 2083.648,
    "text": "And those are the structures internal to an agent that are responsible for encoding information or instructions that are relevant for action, given the background of everything else that is enabling that role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.128,
    "end": 2089.951,
    "text": "So in this modest account, motor representations play the role in the generation of behavior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.871,
    "end": 2111.574,
    "text": " analogous to genes in the generation of phenotypic traits so the strong form is like um would be like as strong as saying that the protein was hiding inside of the gene and then a dna gene and then it just popped out whereas the weaker form is saying there's a lot of dynamically coupled systems and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2112.515,
    "end": 2133.913,
    "text": " um this weak instruction is something that's distributed maybe even among them but that's the part of the dynamics of the system that are relevant for action so strong and weak and it turns out that they're going to um have something to say about both them so let's go to is that good anything to add on that one yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2135.171,
    "end": 2146.047,
    "text": " So here, they're gonna highlight the weak instructionist claim, but as you can see from the bottom of the slide, they're gonna argue that neither kind of instructionism is warranted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2146.428,
    "end": 2148.571,
    "text": "So whether you take a strong or a weak approach,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2149.537,
    "end": 2157.22,
    "text": " they say that you're still making the same type of error, although maybe you're making it more egregiously or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2157.92,
    "end": 2167.784,
    "text": "The weak instructionist framework for motor representation says that skillful performance is the result of an orchestrated process, spanning components in the brain, body, and world,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2168.464,
    "end": 2178.871,
    "text": " But some of these components, especially those in the brain, play specific explanatorily irreducible roles of encoding explicit instructions for motor performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2179.452,
    "end": 2181.813,
    "text": "So that is the instructionist mindset.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.954,
    "end": 2186.096,
    "text": "And for those of you inside or outside of the Active Inference game,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.997,
    "end": 2210.48,
    "text": " is that your implicit understanding of like what is happening would you say that there is something like an instruction for pick up the finger or is there something like i should be pedaling in the brain because that's the exact kind of notion that they're going to be seeking to challenge so that's what's on the table is any idea no matter how strong or weak that instructions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2211.161,
    "end": 2217.88,
    "text": " can be something that is distributed throughout the system are useful for skillful performance, that's what they're going to be critiquing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.442,
    "end": 2218.603,
    "text": "Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2220.636,
    "end": 2226.022,
    "text": " So I just really wanted to kind of loop back to the gene versus protein.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.843,
    "end": 2234.21,
    "text": "So a DNA gene gets transcribed into mRNA and then translated into protein.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.571,
    "end": 2240.717,
    "text": "But you can still have environmental modifications on that DNA gene, which I think that's kind of a neat thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.426,
    "end": 2243.647,
    "text": " way to kind of think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.867,
    "end": 2252.272,
    "text": "You can have methylation, epigenetic modifications, or you can also have suppression of the gene by rolling it up in the chromatin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.352,
    "end": 2260.137,
    "text": "So many different environmental factors can still map onto that DNA gene to modify it so that the instructions are somehow different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.278,
    "end": 2262.498,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2263.519,
    "end": 2269.583,
    "text": "So let's go from instructionism of any kind to representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.819,
    "end": 2285.064,
    "text": " So if there is some sort of instruction in any part of the system, whether it's in one neuron or a set of neurons, or it's between neurons and glia and all kinds of cells, if there is some kind of representation, what is that representation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2285.684,
    "end": 2287.505,
    "text": "So here's a quote from the paper with the red box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.493,
    "end": 2293.534,
    "text": " They wrote, what does it mean for a thing to explicitly represent some state of affairs?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.294,
    "end": 2300.376,
    "text": "It is common in the philosophy of mind to argue that representations involve modes of presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2300.736,
    "end": 2303.156,
    "text": "It's right there, re-presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.237,
    "end": 2312.278,
    "text": "And that sort of made me curious about following to this Frege, not sure if that's the pronunciation, 1892 citation, Sense and Reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2315.747,
    "end": 2321.382,
    "text": " And there's a few pieces that were kind of interesting about this 1892 paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.433,
    "end": 2348.099,
    "text": " so one thing is that it's written the question of truth would cause us to abandon aesthetic delight for an attitude of scientific investigation so that's maybe even like the spirit of what we do here we try to be clear when we're talking about what we want to be clear about but we always want to leave the door and the window and the roof open for aesthetics and for art and for that kind of delight",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2348.96,
    "end": 2357.062,
    "text": " Hence, it's a matter of indifference to us whether the name Odysseus, for instance, has a referent, so long as we accept the poem as a work of art.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2357.663,
    "end": 2362.844,
    "text": "It's the striving for truth that drives us always to advance from the sense to the referent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.484,
    "end": 2372.567,
    "text": "And that is what is known as the semiotic triad, which is the relationship between the symbol, which is like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2373.922,
    "end": 2376.843,
    "text": " Maybe Dean, actually, what would you say about the semiotic triad?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.883,
    "end": 2379.924,
    "text": "Yeah, it's back to Piercy and stuff, Charles Sanders Pierce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.244,
    "end": 2391.888,
    "text": "What I think is really interesting, again, is that you can have a content policy, so you can have information in representative form, but knowledge is actually a change policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.248,
    "end": 2395.429,
    "text": "It's the advance from knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.809,
    "end": 2397.069,
    "text": " sense to referent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.73,
    "end": 2399.73,
    "text": "So you don't want to mix the two things up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.93,
    "end": 2400.75,
    "text": "One is content.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.151,
    "end": 2402.471,
    "text": "The other is change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.091,
    "end": 2406.812,
    "text": "And if you want to say that apples are oranges, you can have that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.372,
    "end": 2411.433,
    "text": "I'm not saying that our minds aren't capable of doing that, but you can't impose it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.194,
    "end": 2420.856,
    "text": "And that's what I think that maybe I look like a guy from the 1890s because I just have a lot of respect for everything that they talked about 100 years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.916,
    "end": 2423.897,
    "text": "But yeah, I mean, it's right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.807,
    "end": 2431.11,
    "text": " You don't want to fly, you don't want to crash your airplane into that mountain, is my point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.55,
    "end": 2432.131,
    "text": "Mount Sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2433.111,
    "end": 2440.495,
    "text": "And then also that note six right after art is, it'd be desirable to have a special term for signs having only sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.335,
    "end": 2448.079,
    "text": "Hmm, what would it mean to have sense like it compiles in a sensical way, but it doesn't have reference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2449.645,
    "end": 2455.248,
    "text": " If we named them say representations, the words of the actors on stage would be representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2455.428,
    "end": 2457.57,
    "text": "Indeed, the actor himself would be representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2458.11,
    "end": 2462.632,
    "text": "Well, what if all the world's a stage and then who's not representing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.073,
    "end": 2468.216,
    "text": "So these are some really cool ideas about what is being communicated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2469.056,
    "end": 2472.397,
    "text": " symbolically, when we use symbols like language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.057,
    "end": 2475.238,
    "text": "So representation is a big topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2475.278,
    "end": 2482.579,
    "text": "And we talked about the representation wars and about representation and active inference beyond internalism and externalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2483.079,
    "end": 2487.1,
    "text": "It's a topic we're going to probably be coming back to forever because it's such a rich area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2487.881,
    "end": 2490.101,
    "text": "Let's go back to motor representations, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.601,
    "end": 2497.163,
    "text": "So that's what a representation was sort of broadly, but bringing it back to the body to the motor behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2499.025,
    "end": 2503.588,
    "text": " They cite a 2017 paper that provides a definition of motor representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.069,
    "end": 2514.374,
    "text": "This account is basically coming from a combination of pragmatism, practical representations, as well as computational neuroscience research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2514.994,
    "end": 2521.538,
    "text": "And they highlight three key attributes in this modern research on motor representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2522.078,
    "end": 2524.3,
    "text": "The first is that those motor representations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.721,
    "end": 2529.766,
    "text": " represent objects and situation in terms of their properties relevant for action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.187,
    "end": 2541.421,
    "text": "So like a great example is like a cup, it has a handle and like your brain will do a different thing when somebody grabs it from the top or when somebody grabs it with a,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2542.102,
    "end": 2543.163,
    "text": " weird way of grabbing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.503,
    "end": 2545.003,
    "text": "So we see objects for actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2545.223,
    "end": 2547.485,
    "text": "We see things to sit on and things to grab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2548.265,
    "end": 2550.306,
    "text": "We don't just see the pixels or anything like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.006,
    "end": 2560.711,
    "text": "A second key aspect of motor representation is that they're informed by or contain implicitly some knowledge about the body's biomechanical and kinematic constraints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2561.391,
    "end": 2564.273,
    "text": " So you'll see something for gripping that's like grippable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.753,
    "end": 2576.379,
    "text": "You won't see like a 10 foot pipe as being something you could grip, but then as it shrinks, given the implicit or explicit knowledge of what the body can do, it becomes something that's grippable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2577.08,
    "end": 2584.184,
    "text": "And then third, they say that motor representations, at least usually, serve the execution of transient movements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2584.904,
    "end": 2588.466,
    "text": "So in that knife cutting example, there's a motor representation for like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2590.058,
    "end": 2610.395,
    "text": " contract up and bring start to bring the arm up but it doesn't need to be the representation of like the entire story arc it just has to be a transient executable um motor action so that's again motor representation it's within this instructionism frame and then dean you had a really interesting comment down here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2612.475,
    "end": 2625.644,
    "text": " Well, all I wanted to point out was that, so the active inference allows us to, well, what they're going to talk about, what we're going to get to is the generative model can be inverted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.545,
    "end": 2630.488,
    "text": "But essentially, there's top-down and there's bottom-up, and I think that's what needs to be included.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.768,
    "end": 2633.41,
    "text": "But in the last sentence of that little comment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.19,
    "end": 2644.335,
    "text": " world to mind and mind to world, that ability to sort of go bottom up and top down, assumes a capacity to differentiate what actually contains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.896,
    "end": 2650.018,
    "text": "And then what is contained in a practical sense beyond a thought experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.078,
    "end": 2652.039,
    "text": "We can all do thought experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.559,
    "end": 2656.401,
    "text": "We can all reflect and analyze prior to and post.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.701,
    "end": 2659.923,
    "text": "But when you're in that otherwise, when you're actually carrying it out,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2660.822,
    "end": 2681.497,
    "text": " you're sort of going beyond that thought experiment so how do we how do we address that when we're doing our motor representing is what i basically wanted and that's just from the paper yeah basically pavisi's decomposition cool we're having so much fun but we are going to i think try to get through the rest of the slides",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.922,
    "end": 2687.124,
    "text": " Here's one way that motor representations are used just in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.684,
    "end": 2688.685,
    "text": "They use fMRI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2689.025,
    "end": 2695.388,
    "text": "They find a pattern that correlates with a certain motor behavior, and that is discussed as being the motor representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.109,
    "end": 2698.63,
    "text": "So that's how scientists are using the term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.031,
    "end": 2703.773,
    "text": "We can think about motor representations as being motor commands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2704.413,
    "end": 2707.655,
    "text": "So I think, Blue, did you make this one and want to add something here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2709.013,
    "end": 2709.393,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.654,
    "end": 2718.901,
    "text": "So this motor command I thought was interesting because it's like you have to have the forward and the reverse in this motor command.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.221,
    "end": 2728.008,
    "text": "So you have to already know the outcome that you, like you have to envision the outcome in that said environment and then work backwards from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.148,
    "end": 2730.651,
    "text": "So I'll just read this part in blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.831,
    "end": 2734.554,
    "text": "It says that this entails an inverse inference problem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.034,
    "end": 2738.857,
    "text": " which requires working back from the desired sensory consequences, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.917,
    "end": 2747.143,
    "text": "desired visual and proprio-receptive sensory feedback, to a specification of their motor cause in an intrinsic frame of reference, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.223,
    "end": 2751.707,
    "text": "a set of muscle activations that can generate such desired consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.347,
    "end": 2756.29,
    "text": " So I just thought that that was an interesting way to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.55,
    "end": 2765.756,
    "text": "And I always love the picture of the motor representation, the literal motor representation on the cerebellum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.796,
    "end": 2768.637,
    "text": "And so it just shows, or maybe this is cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.138,
    "end": 2779.504,
    "text": "So this is literally how it maps to the sensory cortex, which part of your piece of your brain literally maps to each piece of your body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.524,
    "end": 2780.325,
    "text": "It's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.212,
    "end": 2787.075,
    "text": " And it reminds me of coaching cues like lift, lift, lift, or push, something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2787.375,
    "end": 2792.137,
    "text": "You say what you want to see happen, lift the bar or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.197,
    "end": 2794.518,
    "text": "You don't have to say every single cue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.878,
    "end": 2801.902,
    "text": "So that's sort of a semantic way of engaging with what's happening across the brain and across the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.97,
    "end": 2816.404,
    "text": " And to bring the motor to action before we go to active inference, they talk about action oriented representations as being the motor representations that are for action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2816.725,
    "end": 2817.846,
    "text": "So anything on this blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.949,
    "end": 2821.09,
    "text": " Yeah, but it's another example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.25,
    "end": 2823.17,
    "text": "Like breathe in, pretend you're smelling a flower.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.891,
    "end": 2826.052,
    "text": "Which one conveys more of a story?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2826.712,
    "end": 2836.076,
    "text": "And that reminds me actually of Dave Snowden's address not so long ago, where instead of just asking someone, you know, tell me a story about San Francisco.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2836.436,
    "end": 2842.759,
    "text": "You'd say, a friend only has two minutes and they want to know the single thing that's most exciting to visit when they go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2843.519,
    "end": 2847.12,
    "text": " That's a very rich setup for somebody to tell a story in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2847.74,
    "end": 2859.502,
    "text": "And so it relates to giving suggestive cues that are richer than just contract your bicep, but you could give a cue, you know, bend it like Beckham or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2859.722,
    "end": 2866.023,
    "text": "You can make a metaphor or you can allude to something that actually invokes more activation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2866.803,
    "end": 2867.903,
    "text": "You know, it'd be interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.983,
    "end": 2871.504,
    "text": "Can people deadlift more if you say, all right, lift up the car.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2872.469,
    "end": 2873.752,
    "text": " You know, somebody's underneath it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.172,
    "end": 2874.673,
    "text": "Go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2875.054,
    "end": 2878.421,
    "text": "Or, you know, you're going to win this competition if you do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2879.363,
    "end": 2881.507,
    "text": "Those are like very action-oriented motivators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.567,
    "end": 2881.707,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2882.421,
    "end": 2890.526,
    "text": " Yeah, actually, I put this in here, this slide, because I did a lot of coaching in my life, probably 30 years of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.027,
    "end": 2899.472,
    "text": "And I think one of the things that I found as an effective coach is you want to think of it as any puzzle pieces missing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.353,
    "end": 2905.956,
    "text": "Back to that, I don't want to go back up to the slide where the guy was balancing on the edge of the building.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2906.477,
    "end": 2907.497,
    "text": "But again, as a coach,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.718,
    "end": 2913.482,
    "text": " There'll be things that the person who's performing that motor skill will be thinking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2914.183,
    "end": 2918.326,
    "text": "And what an effective coach tends to do is try to bring into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.248,
    "end": 2933.458,
    "text": " into the realm of what they are focusing on without interfering with that, without adding a bunch of cognitive issues that again, get in the way of doing, making it an overthinking thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.938,
    "end": 2939.623,
    "text": "If you can breathe, if you can remind a person to breathe out or exhale just before they do something,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.156,
    "end": 2943.217,
    "text": " They would do that autonomically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.778,
    "end": 2948.682,
    "text": "But if you can actually get them to think about that, that again, that's a mind calming exercise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2949.162,
    "end": 2951.023,
    "text": "That's actually a pretty effective coaching tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.444,
    "end": 2952.725,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.806,
    "end": 2956.688,
    "text": "And I think we're going to come back to that with instruction versus interaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.168,
    "end": 2957.609,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.989,
    "end": 2960.411,
    "text": "Then we turn to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.618,
    "end": 2961.978,
    "text": " Yay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2962.899,
    "end": 2968.581,
    "text": "And they have box one in their paper at the very end where they define active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2970.082,
    "end": 2970.802,
    "text": "Was it a reviewer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.122,
    "end": 2972.143,
    "text": "Did they want to clarify?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2972.863,
    "end": 2973.563,
    "text": "We'll find out soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.304,
    "end": 2985.889,
    "text": "And they basically write that a system can be described to engage in active inference in the sense of performing belief updating and acting such as to fulfill prior preferences about observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.509,
    "end": 2990.631,
    "text": "Because in active inference, there's kind of two things that the system can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2991.491,
    "end": 2993.433,
    "text": " It can act or it can infer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2993.953,
    "end": 2995.615,
    "text": "It can update its action states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.415,
    "end": 2999.238,
    "text": "It can update its internal generative model of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2999.358,
    "end": 3004.762,
    "text": "Those are sort of the two levers that it has to play with because it can't directly control the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3005.283,
    "end": 3013.67,
    "text": "But those two levers, action and inference, are being played with in service of reducing uncertainty about observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3014.55,
    "end": 3017.112,
    "text": "So that's some of the key attributes of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.274,
    "end": 3030.621,
    "text": " And they suggest that active inference provides a mechanism to derive the dynamics of sensory and active states, which are these two blanket states on this image, such that they minimize a variational free energy functional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.021,
    "end": 3041.968,
    "text": "So we're not going to go into that now, but there's basically an equation, a formalism that trades off model complexity, how many parameters it has with model accuracy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3042.828,
    "end": 3049.014,
    "text": " So real systems are sort of on this razor's edge where they want to have well-fitting but simple models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3049.575,
    "end": 3060.966,
    "text": "And then the tuning between, you know, great tasting and less filling, the tuning between fewer parameters and better fit, that is where active inference agents are surfing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.887,
    "end": 3065.951,
    "text": "Anything on active inference or let's just see how it gets used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3068.908,
    "end": 3074.389,
    "text": " So the paper draws extensively on Fristin 2011, the figures and a lot of the citations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3074.509,
    "end": 3080.63,
    "text": "So it's worthwhile to actually go to that Fristin 2011 paper if you're curious about a deeper level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.59,
    "end": 3089.212,
    "text": "And here from the skillful performance paper, they basically, oh, this is actually, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.292,
    "end": 3091.572,
    "text": "This is from Fristin 2011.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3092.672,
    "end": 3096.293,
    "text": "Despite the compelling simplicity of the optimal control approach,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3097.247,
    "end": 3099.269,
    "text": " He's saying that it's wrong for two reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3100.23,
    "end": 3110.839,
    "text": "The first is that basing on the ideas from information flow, he's going to suggest that motion cannot be specified by a single value function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3111.139,
    "end": 3113.982,
    "text": "There might be many different ways to achieve a goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3114.503,
    "end": 3123.03,
    "text": "So it might be hard to rank or even compare totally different ways of achieving that goal on a value only framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.091,
    "end": 3129.636,
    "text": " And then secondly, optimal control theory assumes that movement is caused or determined by value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3130.396,
    "end": 3136.881,
    "text": "Like motors, motor actions are valued differentially and then ones that are more valuable are undertaken.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3137.682,
    "end": 3141.365,
    "text": "However, value is an attribute of the states that are caused by movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3141.425,
    "end": 3143.126,
    "text": "It's a consequence, not a cause.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3143.987,
    "end": 3149.051,
    "text": "This means that the real problem is to understand the acquisition and realization of beliefs that cause movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3149.652,
    "end": 3153.275,
    "text": "In other words, to understand motor control in terms of inference and belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3154.5,
    "end": 3163.966,
    "text": " And then another really interesting piece was to describe optimal control even way back when in 2011 as active inference with three simplifications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3164.867,
    "end": 3170.01,
    "text": "So the first simplification is saying you got to combine action inference together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3170.551,
    "end": 3181.338,
    "text": "You could simplify and consider only action or consider only perception, but optimal control is not dealing with those two in a way as integrated as active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3182.571,
    "end": 3187.553,
    "text": " The second simplification has to do with the delays in the signals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.014,
    "end": 3192.636,
    "text": "So that's a little bit of a motor specific, more neural perspective on motor control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3193.516,
    "end": 3201.12,
    "text": "And then the third piece, which is perhaps the most salient is to realize that value alone and cost functions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3201.9,
    "end": 3214.045,
    "text": " doesn't get you all the way to embodied action, but embodied action is more consistent with thinking about how organisms have prior beliefs about what kind of motor behaviors are likely for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.945,
    "end": 3218.046,
    "text": "And that is a broader framework than just value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.326,
    "end": 3221.787,
    "text": "So that's first in 2011, but there's of course a whole paper there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.847,
    "end": 3223.568,
    "text": "So if you're curious, you should check it out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.089,
    "end": 3226.409,
    "text": "Okay, figure one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3228.11,
    "end": 3230.011,
    "text": "Wanna take a first pass on this one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3233.092,
    "end": 3233.672,
    "text": " Sure, I'll read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.833,
    "end": 3244.196,
    "text": "So just like we had talked about earlier, you have the extrinsic frame of reference, like what needs to be done in this environment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.316,
    "end": 3251.279,
    "text": "So the motor plant is the physical motor system, like a limb, that executes the task to be performed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.801,
    "end": 3256.163,
    "text": " And that's the plant kinetics equation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3257.124,
    "end": 3262.066,
    "text": "And then physical movements of the motor plant in turn generate sensory information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.547,
    "end": 3267.71,
    "text": "This information is conveyed to a state estimator via a sensory mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.81,
    "end": 3274.733,
    "text": "So that's the sensory mapping process, the next equation, and then there's the state estimator in the middle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3276.054,
    "end": 3287.528,
    "text": " And over on the right, the forward model, it says the function of the forward model is to improve the execution of action by helping to finesse the inferences of the state estimator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.229,
    "end": 3293.335,
    "text": "And you can see that there's a feedback with the state estimator, both forward and backwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.957,
    "end": 3298.7,
    "text": " And then the efference copy says the optimal controller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.76,
    "end": 3300.521,
    "text": "Oh, yeah, that's this next part down here at the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.281,
    "end": 3308.365,
    "text": "The optimal controller maps desired trajectories specified in extrinsic coordinates to muscle movements, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.425,
    "end": 3313.509,
    "text": "to changes in muscular states specified in terms of intrinsic coordinates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.369,
    "end": 3317.271,
    "text": "And then that goes back, loops back to the plant kinetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.257,
    "end": 3318.417,
    "text": " Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3318.657,
    "end": 3322.699,
    "text": "So this is the whole forward model in motor control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3322.739,
    "end": 3329.782,
    "text": "So this is basically the optimal motor control theory framing of what is happening in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3331.762,
    "end": 3335.264,
    "text": "Starts with a control implication like control theory or cybernetics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3336.144,
    "end": 3340.426,
    "text": "Motor behavior occurs in the plants, the motor plants, the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3341.735,
    "end": 3343.217,
    "text": " the infer plant, but not here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3343.737,
    "end": 3347.922,
    "text": "And then that gets mapped through sense to a state estimator, where is my hand?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3348.523,
    "end": 3355.571,
    "text": "And then that is going to get in feedback with a forward model that then says, oh, your hand is too gripped.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3356.171,
    "end": 3357.332,
    "text": "It needs to relax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.513,
    "end": 3360.596,
    "text": "And then that feeds back to the optimal control equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3361.457,
    "end": 3367.389,
    "text": " So whether these actually are instantiated in modules of the brain, that's like the super strong take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3367.89,
    "end": 3372.239,
    "text": "The weaker take would be, or the instrumental take would be that we could model as if it were this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3375.925,
    "end": 3389.321,
    "text": " Now they're going to bring together the motor representations and this optimal motor control theory way of forward and reverse modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.062,
    "end": 3392.565,
    "text": "So this is an intrinsic to extrinsic mapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3393.066,
    "end": 3394.547,
    "text": "Intrinsic is the motor commands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3395.228,
    "end": 3397.069,
    "text": " They're representations internal to the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3397.669,
    "end": 3400.65,
    "text": "And the forward model goes from motor command to bodily motion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3400.99,
    "end": 3404.731,
    "text": "So that's like the instruction is like, relax the hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3405.211,
    "end": 3405.511,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3405.751,
    "end": 3406.712,
    "text": "And then it gets implemented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3406.792,
    "end": 3412.553,
    "text": "But interestingly, just thinking relax your hand semantically or syntactically, it doesn't open your hand, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3412.693,
    "end": 3413.794,
    "text": "Or, you know, play Beethoven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3414.875,
    "end": 3416.217,
    "text": " Doesn't work quite like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3416.998,
    "end": 3423.469,
    "text": "So the instructions are not just what we hear in our inner voice, but that is the forward model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3423.67,
    "end": 3427.716,
    "text": "And then the inverse model would be the mapping from bodily motions back to the commands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3428.943,
    "end": 3443.472,
    "text": " and to now connect it to their citation of the Wheeler and Clark 99, it's like the DNA genes, it's a story for another day why the gene concept is a little bit more nuanced than just that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.572,
    "end": 3445.233,
    "text": "But again, that's another day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3445.914,
    "end": 3450.717,
    "text": "The DNA genes are like intrinsic and forward genetics,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3451.497,
    "end": 3475.307,
    "text": " is the study of how changes in dna influence phenotype and reverse genetics is going from an interesting phenotype and then asking what were the genetic changes that caused it so it actually helped me as a geneticist to understand what was happening here by thinking about forward and reverse genetics and then thinking okay so then the kinds of arguments that people make about how genes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.007,
    "end": 3482.47,
    "text": " go to protein are like the arguments that people go from motor representations to motor behavior, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3482.51,
    "end": 3484.471,
    "text": "that the information is in the genes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3484.692,
    "end": 3485.732,
    "text": "It's in our DNA.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.052,
    "end": 3488.133,
    "text": "I mean, you see that on billboards on the freeway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3488.534,
    "end": 3489.754,
    "text": "It's in our company's DNA.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3490.194,
    "end": 3494.237,
    "text": "It's in our motor representation, the motor behavior, or is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3495.237,
    "end": 3499.299,
    "text": "So they talk about forward and reverse model or inverse models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3499.439,
    "end": 3502.201,
    "text": "And that's again, like kind of like forward and reverse genetics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3503.181,
    "end": 3504.482,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3507.438,
    "end": 3511.94,
    "text": " I was just thinking about self-driving cars and like, where's that like motor representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.96,
    "end": 3518.222,
    "text": "And then Dean, you wrote a really nice point in the comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3519.363,
    "end": 3524.685,
    "text": "I just, I honestly, why should I feel bad for OMCT?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.725,
    "end": 3533.628,
    "text": "But I did because it was at this point I was like, man, and all the people that are sort of really invested in this, they're like, they're vested in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3533.868,
    "end": 3534.909,
    "text": "This is how it works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.677,
    "end": 3544.967,
    "text": " And again, it was kind of like, okay, if you want a set of commands, like I understand a bunch of people that program and they do that sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3544.988,
    "end": 3552.356,
    "text": "And so it's an easy transference to say that a content policy is also a change policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.396,
    "end": 3555.039,
    "text": "But how do you write out a change policy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.15,
    "end": 3573.531,
    "text": " yep and i think this is just as you highlighted it in the notes there it says um the omct is inverting the forward model so they're literally looking for an inversion from the bodily back to the motor this is contrasted with active inference which replaces the inverse forward model pair",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3574.392,
    "end": 3582.317,
    "text": " with a generative model that expands on the forward model to harness probabilistic beliefs about the expected sensory causes of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3582.918,
    "end": 3592.984,
    "text": "So rather than using a separate inverse model to infer what is appropriate action, you have basically just a generative model that's integrating that feedback loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3593.585,
    "end": 3593.825,
    "text": "Do you have?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3595.683,
    "end": 3618.797,
    "text": " yes so um this is uh an idea that i think we've heard steven talk about too the sandwich model the classical sandwich it's actually called the classical sandwich of cognition so this is kind of a classical sandwich for me that looked tasty um one of the every every stream with dean you gotta have like a sandwich or a hamburger",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.047,
    "end": 3623.868,
    "text": " Senti Burger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3624.509,
    "end": 3624.789,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.11,
    "end": 3625.59,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.65,
    "end": 3627.553,
    "text": "This is a quasi sandwich.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3629.205,
    "end": 3648.273,
    "text": " A major assumption in OMCT is the often implicit reliance on a sequential and modular architecture of perception, cognition, and action, which is the sense, model, plan, act, or the OODA, observed, orient, decide, act paradigm, or the classical sandwich.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3648.953,
    "end": 3658.297,
    "text": "So it kind of like sees these epochs of action where first a new stimuli comes in, that's observe, and then that gets integrated with cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3660.014,
    "end": 3665.776,
    "text": " orient and decide in the OODA loop or in the cognitive framing about modeling and planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3666.476,
    "end": 3668.436,
    "text": "And then that gets translated into action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3669.997,
    "end": 3670.537,
    "text": "Seems fair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.357,
    "end": 3674.718,
    "text": "That is the sense, think, act cycle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3675.158,
    "end": 3677.058,
    "text": "And that's the classical sandwich.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3677.619,
    "end": 3682.92,
    "text": "So I don't know what food active inference would be, but it's not going to be a classical sandwich.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3684.702,
    "end": 3687.463,
    "text": " Okay, maybe we'll leave that as an open thought question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3687.943,
    "end": 3692.465,
    "text": "If active inference were a food or a style of food, what might it be?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3694.246,
    "end": 3695.027,
    "text": "Okay, and then...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3696.693,
    "end": 3702.236,
    "text": " That takes us, again, they're just, these are like, they're sort of like two teams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3702.296,
    "end": 3709.3,
    "text": "We have instructionism, motor representation, OMCT, sense plan act, classical sandwich.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3709.721,
    "end": 3711.642,
    "text": "That's not active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3712.222,
    "end": 3717.005,
    "text": "Active inference is going to be in contrast to all of them and hopefully getting some of the limitations resolved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.068,
    "end": 3720.128,
    "text": " Do you have anything to say about this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.829,
    "end": 3725.99,
    "text": "Okay, in this section, less control, more action, they're gonna actually move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3726.05,
    "end": 3731.852,
    "text": "We spent most of this video highlighting what that integrated set of ideas was.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3732.452,
    "end": 3735.773,
    "text": "The non-active inference ideas about how all those topics were related.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3736.614,
    "end": 3743.656,
    "text": "And they basically here are going to highlight how OMCT does have an instructionist assumption.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3744.835,
    "end": 3753.806,
    "text": " and how that relies on separable forward and inverse models rather than an integrated generative model, and how that relates to motor commands rather than something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3754.407,
    "end": 3755.348,
    "text": "So finally, we get to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3757.017,
    "end": 3759.978,
    "text": " active inference and how motor control is going to occur.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3760.518,
    "end": 3767.92,
    "text": "And we'll juxtapose these two figures in a second, but this is again, a similar drawing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3768.04,
    "end": 3779.644,
    "text": "In fact, it might even make sense just to show figure one and figure two side by side, because at first I looked at them, I thought it's the same brain and I'm kind of seeing the same like shapes on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3780.484,
    "end": 3783.526,
    "text": " But we can go to 30 and look at the two differences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3784.086,
    "end": 3785.066,
    "text": "So it's color coded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3785.687,
    "end": 3788.388,
    "text": "Left is the figure 1 OMCT.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3789.529,
    "end": 3792.39,
    "text": "Figure 2 is on the right with the active inference framing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3793.13,
    "end": 3797.893,
    "text": "So we can see that plant kinetics and sensory mappings in red are found on both sides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3798.957,
    "end": 3821.887,
    "text": " also see that there's a forward model on both sides and that there is an optimal control element in blue on both sides but it's that state estimator at the nexus between the sensory mapping and the forward model and the optimal control there's the rub something is rotten in the state estimate of omct",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3823.103,
    "end": 3834.487,
    "text": " That's what Hamlet would have said, because there's something about estimating the state, like that's where my hand is that isn't happening in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3835.787,
    "end": 3848.071,
    "text": "And that's really this key and interesting piece is that you can even look at the way that the models are connected to see that there's kind of like this fundamental loop between the generative model, forward model in active inference,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3849.15,
    "end": 3851.772,
    "text": " and sense and action getting spun off of that loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3852.732,
    "end": 3854.474,
    "text": "Act, infer, act, infer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3855.034,
    "end": 3855.975,
    "text": "That's active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3856.475,
    "end": 3867.482,
    "text": "And here it's like perceive, estimate, state, reverse engineer, value-driven assessment of optimal control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3868.383,
    "end": 3871.585,
    "text": "That's a quite different layout for cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3871.765,
    "end": 3875.548,
    "text": "This is the one that's consistent with a sense, think, act loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3876.849,
    "end": 3905.847,
    "text": " because in that think as a separable module you get state estimators how else would you translate from the perception to the action well in active inference we kind of have an answer for that at least we have a model framework that helps us get at it anything to add on the figure or we'll continue to how it challenges okay great so how does active inference challenge omct either of you want to say something on this one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3908.44,
    "end": 3916.027,
    "text": " So since I made this slide, I liked this comparison and these two like sentences really kind of stuck out for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.649,
    "end": 3924.055,
    "text": "So in the OMCT, which is linear quadratic Gaussian control, that's this LQG model that I'm going to mention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3924.756,
    "end": 3934.789,
    "text": " So it says, this means that the canonical controls generated by the LQG models cannot reduce or even increase a system's uncertainty in the future, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.049,
    "end": 3940.856,
    "text": "actions can only be instrumental and have no epistemic effect on future state estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.417,
    "end": 3949.601,
    "text": " So I thought that that's kind of really nailing at what's the fundamental thing that OMCT doesn't do that active inference is going to allow for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.981,
    "end": 3964.248,
    "text": "So it says with active inference, the core idea then is rather than select an explicit motor command, the organism infers what it must be doing under the assumption that what it does must minimize prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.588,
    "end": 3967.829,
    "text": "So there is that room to reduce uncertainty in the active inference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.849,
    "end": 3969.39,
    "text": "I just thought that was an important distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3971.598,
    "end": 3972.419,
    "text": " Dean, anything on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3973.92,
    "end": 3986.131,
    "text": "No, I think Blue, thanks for throwing that in there because I think one of the things that we have to sort of address is do all actions follow commands?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.771,
    "end": 3989.714,
    "text": "I think the act of inference says, no, we can act first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.112,
    "end": 3995.234,
    "text": " as opposed to always following some sort of a prompt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.894,
    "end": 3998.936,
    "text": "And I think this slide really spells that out clearly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.297,
    "end": 3999.477,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3999.757,
    "end": 4006.141,
    "text": "And this piece right here is about how actions can only be instrumental and have no epistemic effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4006.881,
    "end": 4015.406,
    "text": "So you need a total bolted on second layer in a value-driven and value-evaluated model of motor behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4015.706,
    "end": 4017.628,
    "text": "You need a second layer to explain play,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4018.328,
    "end": 4024.173,
    "text": " to explain exploratory behavior, curiosity, and just like sort of not caring that much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4025.374,
    "end": 4029.538,
    "text": "Whereas an active inference, those are natural attributes of our fundamental model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4030.859,
    "end": 4031.079,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4031.119,
    "end": 4035.503,
    "text": "I think the OMCT naturally constrains us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.144,
    "end": 4041.448,
    "text": "If you're in the business of learning, it would be great because then everybody would have to follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.309,
    "end": 4044.971,
    "text": "There would be no other option but to follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.953,
    "end": 4052.776,
    "text": " But I think what active inference does is it takes the lid off that and says, no, I can model first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.337,
    "end": 4056.298,
    "text": "If there's nothing to follow, I'm not stuck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4057.879,
    "end": 4061.921,
    "text": "That reminds me almost of like the teacher is the person who could get 100% on the test.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.321,
    "end": 4063.902,
    "text": "So I'm up here on the top of the mountain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4064.322,
    "end": 4065.383,
    "text": "Come on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4065.703,
    "end": 4067.164,
    "text": "75 is okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4067.184,
    "end": 4067.764,
    "text": "76 is better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4068.424,
    "end": 4068.665,
    "text": "Come on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4069.025,
    "end": 4069.525,
    "text": "One by one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4069.605,
    "end": 4073.127,
    "text": "Let's go over the questions you got wrong so that you can get them right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4075.066,
    "end": 4076.927,
    "text": " Where does that come into play visually?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4077.768,
    "end": 4080.65,
    "text": "So, sorry for the slightly busy slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4081.251,
    "end": 4082.692,
    "text": "Earlier versions were even busier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4082.712,
    "end": 4090.498,
    "text": "Active inference framework comprehensively challenges the optimal control theoretic approach to sensory motor behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4091.218,
    "end": 4103.905,
    "text": " In particular, the idea in traditional OMCT is that behavior can only, basically you can evaluate the performance of different behaviors with a single number, a scalar that is defined and tracked by a value function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4104.546,
    "end": 4107.227,
    "text": "So this is sort of a traditional hill climber approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4107.747,
    "end": 4114.951,
    "text": "Like if you want to get to the top of the mountain, then the higher up the mountain you are, the better it is, the more value of that state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4116.252,
    "end": 4128.17,
    "text": " so here's an agent on landscape and it's going to kind of take a ruler and then it's going to look at where it is locally and then it's going to follow uphill it's like a greedy value pursuing agent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4129.076,
    "end": 4143.844,
    "text": " Whereas an active inference, it actually draws on thermodynamics and information flows, as suggested earlier, to take the total current, the total flow, and separate it into two components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4144.724,
    "end": 4146.305,
    "text": "One of those is value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4146.645,
    "end": 4154.909,
    "text": "So you still do get exactly a separable component from the total flow that represents that ruler going uphill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4156.17,
    "end": 4156.99,
    "text": "But there's also a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4159.341,
    "end": 4171.556,
    "text": " vector that is like resting on that ruler but going at a flat it's an iso contour it's kind of like when you look at a topo map for going hiking and that is what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4175.314,
    "end": 4184.319,
    "text": " Yep, that's the physics of flow embedded in active inference show that motion in a biologically realistic state irreducibly includes two orthogonal kinds of motion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4184.539,
    "end": 4190.381,
    "text": "So those two rulers, again, one is going on whatever the angle is of the hill and the other one is going on the flat part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.842,
    "end": 4195.324,
    "text": "Those are going to be always like orthogonal to each other, like at a 90 degree cross.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4196.224,
    "end": 4198.825,
    "text": " So there's an irrotational curl-free component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4199.346,
    "end": 4203.668,
    "text": "That's which movement will take me just locally up the hill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4204.408,
    "end": 4211.912,
    "text": "And then there's a solenoidal or divergence-free component that circulates you on the same elevation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4213.137,
    "end": 4217.82,
    "text": " The curl-free component allows the flow to climb a gradient towards more valuable or probable states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4218.661,
    "end": 4226.326,
    "text": "The solenoidal component specifies a flow around an isoprobability contour where all entered states have an equal value or probability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4226.807,
    "end": 4232.451,
    "text": "So there is an isocontour for this agent on the left, but it's not calculating or tracking it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4233.231,
    "end": 4258.793,
    "text": " in active inference we could turn the knob so that it just pursues value but we also have a framework for that sort of play and who on the rugged landscape is going to get to the top of the hill an agent that's able to switch back and forth or you know shade between these different ways of working it's like you climb up and then you're at the top of a local peak and then can you circulate a little bit",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4261.383,
    "end": 4266.905,
    "text": " So that is part of how information theory and information flows play in active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4267.925,
    "end": 4280.129,
    "text": "Let's take information flow from a sort of quantitative ontology of information flow like first in 2011 and in this figure to this version of a flow state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4280.169,
    "end": 4285.01,
    "text": "So I'm gonna play this video on repeat blue while you describe what you're excited about here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4287.49,
    "end": 4294.115,
    "text": " Cool, so just upon reading the title of the paper, skilled performance, I was like, oh, active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.135,
    "end": 4295.396,
    "text": "We're going to talk about the flow state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.456,
    "end": 4301.3,
    "text": "And I was like, we got to flows, but I kind of was left wanting to talk about the flow state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.62,
    "end": 4309.586,
    "text": "And so this is the preview from the Disney movie, Soul, where everybody has their thing, and they can jump into a flow state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.706,
    "end": 4313.449,
    "text": "And it's just showing funny parts from the movie for people who have seen it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.209,
    "end": 4314.73,
    "text": "It's very cute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.49,
    "end": 4326.18,
    "text": " But in that flow state, which I think we've all kind of experienced, it is like the skilled performance where Daniel and I were discussing earlier, like you can just do things without thinking about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.081,
    "end": 4331.805,
    "text": "And so I was reminded of the paper that we did",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.947,
    "end": 4356.95,
    "text": " toward a predictive global neuronal workspace by Chris White and Ryan Smith and that was stream 18.0.1 and .2 if anybody wants to check it out but they're there they mapped they built a model of the visual consciousness right and so we talked a little bit about consciousness and specifically phenomenological consciousness like where you're able to report like I am",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.53,
    "end": 4369.876,
    "text": " Saw a red bird or whatever like you can say I saw a red bird and we talked about in that video how the model didn't apply for or it like for Inattentional blindness, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.896,
    "end": 4374.998,
    "text": "It couldn't it couldn't account for when you see something but you can't report that you saw it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.018,
    "end": 4378.58,
    "text": "So you have to have this this phenomenological consequence or consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4378.64,
    "end": 4381.001,
    "text": "And so I was thinking about the flow state and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4381.881,
    "end": 4384.824,
    "text": " And really, like, is there, like, a motor consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.904,
    "end": 4385.304,
    "text": "Like, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.424,
    "end": 4388.627,
    "text": "Like, so, you know, I'm conscious that my feet are on the floor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.787,
    "end": 4390.989,
    "text": "And, like, this is something for people who meditate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.029,
    "end": 4395.093,
    "text": "Like, a lot of it is, like, awareness of the body and where the body is in space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.133,
    "end": 4397.935,
    "text": "And so it's sometimes you can use proprioception there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.556,
    "end": 4402.239,
    "text": "But am I conscious of where my body is, where I want to put my body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.399,
    "end": 4403.46,
    "text": "Or can I just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.361,
    "end": 4429.387,
    "text": " do it like is it like inattentional blindness like when you're in that flow state like when you're dancing you know like you don't you can't report like oh i did a pirouette and then you know or whatever like you can't you can't verbally report what's happening with your motor consciousness in a lot of times especially when you're in that like flow state so is that like similar maybe to inattentional blindness anyway it's just something that i was thinking about um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4430.067,
    "end": 4439.558,
    "text": " And I think that there's an interesting contrast between the way that this paper models the motor active inference versus the visual active inference that was modeled in that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.578,
    "end": 4444.904,
    "text": "And it almost reminds me of like a sports, you know, or like a track meet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4445.544,
    "end": 4447.466,
    "text": "And sometimes the reporter, okay, how does that feel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4447.506,
    "end": 4448.367,
    "text": "You just won the game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4448.387,
    "end": 4448.588,
    "text": "It's like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4449.77,
    "end": 4453.954,
    "text": " The athlete, it just, their body says it all or the performance says it all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4454.014,
    "end": 4455.976,
    "text": "And it's like, and then what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4456.056,
    "end": 4465.625,
    "text": "And it's like, as if they were running alongside trying to get the play-by-play from the person who's actually in the action, they're not going to be able to report it in the same way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4465.646,
    "end": 4469.689,
    "text": "It breaks them out of the flow state to have to verbally represent it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4470.33,
    "end": 4491.324,
    "text": " which is why in sports commentary, sometimes you have like a conversation happening between like the more maybe pragmatic or descriptive representation and then a more like color commentary, because that plays both roles of giving the information about what is happening, but also some of that excitement and connecting the dots.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4491.924,
    "end": 4495.947,
    "text": "But the person you can't ask in the moment is the one who's actually doing the action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4497.321,
    "end": 4498.181,
    "text": " So that's cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4498.542,
    "end": 4498.722,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4498.922,
    "end": 4499.102,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4499.342,
    "end": 4506.345,
    "text": "Oftentimes wondered if after one of these performances, the reporter got the response, well, here's my physiological state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.165,
    "end": 4508.365,
    "text": "I think that would be awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.686,
    "end": 4512.807,
    "text": "Well, right now I'm just feeling like my right knee is, I can't move it anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4513.527,
    "end": 4516.229,
    "text": "And then they just dropped the mic and walked away, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4516.269,
    "end": 4517.089,
    "text": "There's my tooth drop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4518.464,
    "end": 4539.778,
    "text": " nice maybe in the future they'll be wearing you know physiological sensors and that'll say it all right so what does active inference sort of in closing here what is being added or contributed by active inference well it's a formal model of motor control it helps us understand online",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4540.771,
    "end": 4555.491,
    "text": " no, not like this live stream, like real time, motor adaptation to an environment, and thinks about that environment in terms of a, not necessarily symmetric, but bidirectional relationship between agent and environment, and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4555.931,
    "end": 4582.122,
    "text": " um brunberg and constant and many other papers have explored this interface and that's been just the tip of the iceberg of the richness in terms of thinking bi-directionally like in the value-driven motor control they didn't even mention the environment they didn't mention generative models of the niche or having a second person who you're playing with or an adversary or a collaborator it was very much internal and value-driven and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4582.862,
    "end": 4602.655,
    "text": " active inference blows the lid open to play and collaboration and a niche that's rich with rich models of it and the tight and reciprocal relationship between action and perception in active inference resonates with other key ideas related to embodied inactive embedded and cultured extended eee",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4604.176,
    "end": 4606.437,
    "text": " approaches to cognition and agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4606.957,
    "end": 4607.597,
    "text": "Any adjective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4608.017,
    "end": 4621.72,
    "text": "We like all the letters, but there's a whole area of sort of critiques that swirled and eventually coalesced that critiqued a sort of narrow computationalist framing of cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4622.5,
    "end": 4633.102,
    "text": "And active inference is almost bringing these threads back together by helping us have computational models that respect the richness and the embodiment in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4634.002,
    "end": 4647.262,
    "text": " but we're only steps down that pathway in terms of where it can go and in the end where the authors take us is towards a focus on interactions not instructions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4648.633,
    "end": 4661.485,
    "text": " and say that the interactionist account portrays skill as enacted without needing to assume it's driven by instructions that are implicitly couched in terms of the content of what is being represented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4662.066,
    "end": 4668.491,
    "text": "You can't say pick up the arm so the knife is higher without having a state estimate of where the arm is and where the knife is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4669.632,
    "end": 4672.795,
    "text": "And their alternative interactionist account for skilled performance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4673.712,
    "end": 4698.339,
    "text": " achieves this um resolution this improvement by avoiding two sets of commitments so for those who are commitment phobic active inference is great for you um it doesn't assume that generative models used in active inference are the models that are used by the organisms or systems themselves this is kind of the instrumental way of thinking we don't need to say that's what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4699.019,
    "end": 4714.587,
    "text": " the organism is doing we don't need to have a debate whether birds know where their wings are or what they think about what it's like to be a bird we can just have a framing that helps us understand how they act in the world and also the second commitment avoided by active inference is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4715.507,
    "end": 4729.614,
    "text": " and more importantly for their discussions about representation and instructions, they do not assume that the explanatory story that's offered by sensory motor accounts needs to posit any causally efficacious mediating knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4730.354,
    "end": 4737.118,
    "text": "So you don't need to propose that there's some sort of kernel of knowledge that then gets enacted through a command",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4739.116,
    "end": 4741.359,
    "text": " you have an account that just sidesteps that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4741.94,
    "end": 4743.001,
    "text": "It doesn't say it doesn't exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4743.221,
    "end": 4745.884,
    "text": "It's just, there's another way of framing what is happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4746.625,
    "end": 4751.772,
    "text": "So I'll go to this closing slide and we can actually provide our last thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4752.753,
    "end": 4755.576,
    "text": "So what would a good understanding enable here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4755.657,
    "end": 4756.858,
    "text": "We actually, we didn't have the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4758.339,
    "end": 4766.582,
    "text": " big questions and why it matters slide here, because we kind of went through and through, but what would a good understanding enable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4766.702,
    "end": 4772.383,
    "text": "And this is an open question for those listening and also for the authors, why does it matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4772.964,
    "end": 4779.966,
    "text": "What would we be enabling ourselves to do if we had a better way or a different way of thinking about skill performance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4780.677,
    "end": 4783.98,
    "text": " Can everybody play classical music or is there going to be some other implication?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4784.901,
    "end": 4787.243,
    "text": "What are the unique predictions and implications?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4787.904,
    "end": 4792.348,
    "text": "So for those who say, hey, I don't think OMCT is knocked out yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4793.048,
    "end": 4794.27,
    "text": "What is the differentiator?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4794.31,
    "end": 4800.515,
    "text": "What's the experiment or the test that we can actually do to see where active inference is coming into play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4801.776,
    "end": 4804.979,
    "text": "What are the next steps for us as a research community?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4805.993,
    "end": 4808.538,
    "text": " And what are the goals of skilled performance research?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4809.079,
    "end": 4811.884,
    "text": "And of course, what are you still curious about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4813.187,
    "end": 4814.489,
    "text": "So any closing thoughts here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4818.524,
    "end": 4819.324,
    "text": " Well, I'll just give one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.344,
    "end": 4824.906,
    "text": "I want to thank both of you guys for keeping this grounded because so many times I could have blown off on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4824.946,
    "end": 4835.69,
    "text": "But one of the things I do want to, I'm going to want to ask the authors about is, I do think that there is a place for instruction, but it's a tiny...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.638,
    "end": 4853.48,
    "text": " It's a fragment of the total memory sphere and it's to do with perspective memory, where if I don't remember to bring the milk home when I'm driving home from work, I am going to get in trouble because I forgot to carry out a side action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4854.324,
    "end": 4861.85,
    "text": " in the continuum of I have to come home from work today, but I can't forget to bring a quart of milk home with me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4862.211,
    "end": 4870.438,
    "text": "So I do think that there is a part for this, this instructionist piece in the memory scape, but I don't think it should be the total picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.458,
    "end": 4871.959,
    "text": "So I'm going to want to ask the authors about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.424,
    "end": 4873.804,
    "text": " Perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4873.844,
    "end": 4882.51,
    "text": "And that's a theme that we've seen come up, which is like, just because active inference is awesome doesn't mean it's our only tool in the toolbox.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.031,
    "end": 4894.538,
    "text": "So like even earlier today, we were hearing about how active inference models can then be used as input into a just totally different kind of model to draw on the strengths of both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4895.119,
    "end": 4896.36,
    "text": "So it could be possible that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4896.98,
    "end": 4899.621,
    "text": " There's things that are described well by active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.021,
    "end": 4903.263,
    "text": "And then there's a wrapper that is almost instructionist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4903.943,
    "end": 4907.465,
    "text": "So like people could give instructions, pick up your hand and then the person does it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4907.965,
    "end": 4909.846,
    "text": "So was that not an instruction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4909.886,
    "end": 4912.067,
    "text": "I mean, what does instruction mean if that's not an instruction?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4912.407,
    "end": 4916.009,
    "text": "So how do we combine active inference models with other kinds of models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4916.069,
    "end": 4916.289,
    "text": "Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4919.231,
    "end": 4920.851,
    "text": "Yeah, I mean, that's a great question too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.951,
    "end": 4925.954,
    "text": "And I also think about, I don't know, really like where...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.621,
    "end": 4936.387,
    "text": " where like the model fits in and, and really just like what I was thinking, what I was talking about earlier about like phenomenological consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4936.427,
    "end": 4943.913,
    "text": "Like if I intend to do something, is that like, do intentions matter to beliefs and desires and intentions like matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4943.933,
    "end": 4950.258,
    "text": "Um, sometimes, but like also like if, you know, a tennis ball is flying at my face and I reach my hand up and catch it like without thinking, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.593,
    "end": 4974.783,
    "text": " like that's like a very like i just a perception action a perception action like just happened all at the same time right so is there space for for the thought um about the action or is it always i don't know i'm still squishy like where does that where does thinking about doing something fit into the active inference loop because sometimes you think about it and sometimes you don't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.496,
    "end": 4983.459,
    "text": " Sometimes you rehearse, you think about it, think about it, and then you choke or you don't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4984.26,
    "end": 4990.363,
    "text": "Other times there's like, I mean, famously captured by viral videos since the beginning of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4990.503,
    "end": 4999.227,
    "text": "Somebody does like an incredibly amazing maneuver that they certainly didn't plan and they didn't have knowledge of, and they probably could never do it twice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5001.061,
    "end": 5026.437,
    "text": " It's awesome to have a framework that covers potentially our autonomic reflexes all the way up perhaps to culturally infused and trained performance and enables us to think about how pre-play and replay of motor actions come into effect, but also those America's home videos moments where something amazing just happens or something in sports where something amazing happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5026.997,
    "end": 5029.038,
    "text": "And you look at the replay, it's like, what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5030.319,
    "end": 5046.312,
    "text": " how did that happen and the answer is they didn't know it was going to happen so right there it couldn't have been knowledge driven can i add one last thing daniel for at least for me yeah again thanks blue for for putting in the uh the little clip about flow there because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5047.788,
    "end": 5060.32,
    "text": " I would like to find out if somebody actually identifies by the sequence of commands that they carried out, like if I carried out a set of instructions, would I identify myself now as the carrier out of those commands?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.48,
    "end": 5070.389,
    "text": "Or is my identity more about those aspects of how I sort of move through commands",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5072.145,
    "end": 5075.246,
    "text": " through time and change along with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.487,
    "end": 5086.952,
    "text": "Because if it is, I guess if I could see myself as being identified by the instructions I carried out, then I guess optimal motor control theory would be the whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5087.492,
    "end": 5099.418,
    "text": "But until somebody shows me that that's actually how I identify, I think we have to sort of take it off that deflated sense and inflate it up to the identity piece and see the interstate for what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5101.297,
    "end": 5104.44,
    "text": " I'll close with a Borges quote inspired by Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5108.323,
    "end": 5110.305,
    "text": "Time is the substance I am made of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5111.086,
    "end": 5114.228,
    "text": "Time is a river which sweeps me along, but I am the river.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5114.629,
    "end": 5117.131,
    "text": "It is a tiger which destroys me, but I am the tiger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5117.451,
    "end": 5119.973,
    "text": "It is a fire which consumes me, but I am the fire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5119.993,
    "end": 5121.715,
    "text": "There you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5122.376,
    "end": 5122.736,
    "text": "Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5123.517,
    "end": 5125.438,
    "text": "Thank you everybody for watching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5125.498,
    "end": 5128.021,
    "text": "We hope to see you participating soon.",
    "speaker": "SPEAKER_02"
  }
]