[
  {
    "start": 8.732,
    "end": 9.072,
    "text": " Greetings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.692,
    "end": 10.313,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.413,
    "end": 12.974,
    "text": "Thank you for joining live or in replay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 13.694,
    "end": 15.975,
    "text": "Today, it is May 27th.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.055,
    "end": 16.555,
    "text": "Is that true?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.116,
    "end": 18.556,
    "text": "Not even close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.996,
    "end": 19.637,
    "text": "Not even close.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 20.337,
    "end": 20.917,
    "text": "It's June 8th.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.279,
    "end": 26.519,
    "text": "It's June 8th, 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.12,
    "end": 36.484,
    "text": "We're here in Act-Inf Lab Livestream 23.1, and we are discussing the paper, Embodied Skillful Performance, where the action is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.611,
    "end": 39.592,
    "text": " So welcome everyone to Active Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.372,
    "end": 46.936,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.576,
    "end": 50.577,
    "text": "You can find us at the links that are here on this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.538,
    "end": 58.141,
    "text": "This is a recorded and an archived live stream with all of the advantages and constraints that that provides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.741,
    "end": 61.883,
    "text": "Please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.004,
    "end": 65.653,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.335,
    "end": 69.645,
    "text": "And we'll be trying to follow good etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.004,
    "end": 79.047,
    "text": " From this short link, you can access the calendar of events for live streams of multiple different kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.947,
    "end": 86.649,
    "text": "And highlighted there with the blue arrows are today's discussion on June 8th and next week's discussion that'll be on the 15th.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.17,
    "end": 90.891,
    "text": "And they're both gonna be on this paper, embodied skillful performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.651,
    "end": 96.513,
    "text": "So we had a good time making the dot zero and learning about this and kind of opening up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.273,
    "end": 112.774,
    "text": " what this was adjacent to and now we'll look forward to continuing the discussion and just seeing where it goes for those who are watching live it would be i guess especially appreciated to throw us some questions whether they're related to the paper or not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 114.465,
    "end": 118.529,
    "text": " The goal for today is to discuss and learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.149,
    "end": 127.737,
    "text": "The paper is Embodied Skillful Performance, where the action is by Hippolyto, Baltieri, Friston, and Ramsted from 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.798,
    "end": 136.065,
    "text": "And today in 23.1, we'll be ambling skillfully, we hope, through the paper again and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.459,
    "end": 142.38,
    "text": " flagging areas where we wanna be talking with the authors next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.021,
    "end": 143.641,
    "text": "Greetings, Dave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.081,
    "end": 144.381,
    "text": "Welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 145.402,
    "end": 152.564,
    "text": "And just seeing where we get to, opening up threads and kind of enjoying the middle part of the .012 sandwich.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 155.034,
    "end": 158.936,
    "text": " So we can begin with the introductions and the warmups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.257,
    "end": 172.544,
    "text": "Today, there's a few of us, so we can go around in the introduction and just give a short introduction or a check-in, and we can also then pass it to somebody who hasn't spoken, taking a look at the warmup questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.864,
    "end": 179.228,
    "text": "So I'm Daniel, I'm a postdoctoral researcher in California, and I'll pass to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.325,
    "end": 182.086,
    "text": " Yeah, I'm Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 182.286,
    "end": 183.607,
    "text": "I'm up here in Calgary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.909,
    "end": 194.078,
    "text": "And I'm getting more and more involved with this idea of sort of building up the active inference profile.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.239,
    "end": 196.32,
    "text": "I'll pass it to David.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 196.401,
    "end": 197.061,
    "text": "Dave is there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.683,
    "end": 200.605,
    "text": "But if he isn't, I'll pass it back to Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 202.31,
    "end": 205.512,
    "text": " Dave, you're welcome to join in whenever you would like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.353,
    "end": 210.216,
    "text": "I hear you tapping a little bit, but maybe whenever you want to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.296,
    "end": 212.498,
    "text": "Otherwise, what is the Active Inference profile?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.499,
    "end": 216.521,
    "text": "That's what I think we're trying to build out here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 216.561,
    "end": 221.124,
    "text": "I think we're trying to give that some anchors and some leverage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.384,
    "end": 223.826,
    "text": "So we haven't figured it out completely yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.886,
    "end": 226.328,
    "text": "It's like everything in Active Inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 226.448,
    "end": 228.329,
    "text": "It's a generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 229.69,
    "end": 230.351,
    "text": "It's growing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.113,
    "end": 236.36,
    "text": " And I don't know what its final form will be or if it takes on a final form even.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 238.363,
    "end": 243.031,
    "text": "Are there other areas that have profiles or are there other profiles of note?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.316,
    "end": 248.697,
    "text": " Yeah, I think there's convention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.218,
    "end": 251.478,
    "text": "That's already an established profile.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 251.999,
    "end": 259.722,
    "text": "And I don't know that this has got to that place yet where we can say it has a convention or something that's predictable about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 260.262,
    "end": 264.444,
    "text": "And I think that's what makes it kind of, well, in my mind, it makes it curious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 265.044,
    "end": 270.286,
    "text": "Where is it going as opposed to where it's been and what it's established so far?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.705,
    "end": 301.353,
    "text": " nice points agreed active inference especially in these nascent times it's like a strange attractor where people come in from so many perspectives and then they get slingshot out in a different direction or with a different um memory or different view so dave no worries about the hardware mystery everyone is welcome to just type in the youtube chat if they have questions so i think for the rest of this stream",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.213,
    "end": 319.929,
    "text": " we're going to walk through again, maybe thinking again about walking as a skillful action and all the fun similarities and differences between motor actions, which are what are discussed here and that sort of space where motor and knowledge come together like with skilled action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.35,
    "end": 324.253,
    "text": "Yes, Dave, your different embodiments are muted indeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 326.395,
    "end": 327.737,
    "text": "So the paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.225,
    "end": 352.47,
    "text": " uh laid out their aims and claims and the central aim of the paper according to the authors is to discuss critically the limitations of instructionist control theoretic models of skillful performance so the big dichotomy or dilemma that's going to come up again and again is this difference between interactionism and instructionism so maybe dean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.737,
    "end": 359.715,
    "text": " Where are you coming at that from or how would you describe the difference between instructionism and interactionism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.698,
    "end": 360.879,
    "text": "Well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 362.776,
    "end": 368.921,
    "text": " Well, first of all, even including interactionism as a formality, I think is a huge step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.161,
    "end": 373.985,
    "text": "It's metaphorically speaking, it's opening both of your eyes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 374.025,
    "end": 377.188,
    "text": "You have a second eye available, but maybe you weren't aware of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 377.708,
    "end": 386.395,
    "text": "And now with the idea of turning that into sort of a structured or formalized approach as opposed to just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.176,
    "end": 398.905,
    "text": " the instructionalism piece, which is traditionally what we've formalized is it's not just a doubling of what we might be aware of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.525,
    "end": 410.934,
    "text": "It's actually placing ourselves where we can see the depth of what we're observing or what we're analyzing or what we're addressing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.596,
    "end": 416.36,
    "text": " And I think that that would be a huge step if we could get people comfortable with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.74,
    "end": 419.603,
    "text": "I'm not saying that people will necessarily get comfortable with it, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.003,
    "end": 425.968,
    "text": "Because for a lot of people, let's be honest, just following along and being instructed is difficult enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 426.488,
    "end": 431.413,
    "text": "And now you're introducing a whole second lens of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.793,
    "end": 436.317,
    "text": "And very quickly, you'll have a bunch of people screaming, no, you're going to overwhelm them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 436.337,
    "end": 437.458,
    "text": "You're going, well, I'm not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 438.218,
    "end": 443.463,
    "text": " Just because I have both my eyes open doesn't mean that I'm going to be... I hope it doesn't mean I'm going to be scared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 443.483,
    "end": 449.408,
    "text": "I hope it means that I'm going to feel a little bit more grounded and centered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 449.448,
    "end": 454.313,
    "text": "But we'll have a conversation about that today, especially when we include the whole body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 455.7,
    "end": 457.121,
    "text": " Yes, the entire corpus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.681,
    "end": 464.125,
    "text": "One thought there, instructionism being like instructions are passed from A to B, you know, water flowing downhill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.545,
    "end": 472.95,
    "text": "Instructionism has a directional context and also the idea that what's being passed is the sort of packet of meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 472.99,
    "end": 475.452,
    "text": "Like, here's the envelope with your instructions, now carry them out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.312,
    "end": 499.968,
    "text": " and what i think is exciting about interactionism is it's not just a bi-directional instructionism it's not like well you instruct me and then i'll instruct you that's sort of the the low bar for interactionism but where interactionism really blows the lid off is when we open into that third space of interaction and improvisation so i think that's what's kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.848,
    "end": 515.775,
    "text": " Interesting to draw out, and they are going to highlight in this paper how control theory models of skillful performance or otherwise, implicitly or explicitly, do have instructionist assumptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.395,
    "end": 524.019,
    "text": "Specifically, this idea that motor representations convey or harness instructions about how to perform a specific task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.679,
    "end": 539.186,
    "text": " So even if the authors of those control theory papers didn't explicitly use the word instructionism, then they're still playing into this idea that instructions are being passed, for example, from the brain to the body in order to be carried out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 540.226,
    "end": 544.989,
    "text": "And we'll be looking at that from a more formal perspective in a few minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.052,
    "end": 553.656,
    "text": " And the big claim that they're going to be reaching is that Active Inference doesn't need to posit that instructionist assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.996,
    "end": 568.123,
    "text": "So there's a way to frame control and skillful performance in the Active Inference framework that doesn't take on these instructionist assumptions and the content based directional message passing that it entails.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 569.56,
    "end": 572.062,
    "text": " And that'll be something fun to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.603,
    "end": 574.244,
    "text": "Also, Dave has a nice comment in chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.005,
    "end": 586.696,
    "text": "Dave wrote, as I recall, Piaget and colleagues counted and described something like 400 distinct embodied concepts used by the walking skills of a typical 15 month old.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.237,
    "end": 593.762,
    "text": "So that just shows how there's a lot going on, even with, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.267,
    "end": 596.748,
    "text": " behaviors like walking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.769,
    "end": 598.59,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.99,
    "end": 613.662,
    "text": "One other thing too, the assumption that somehow the muscles and the nerve endings sending signals that are in symbolic form is quite a stretch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 613.682,
    "end": 620.428,
    "text": "I mean, we talked about that last week when we got to that inverse directionality slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 621.068,
    "end": 624.031,
    "text": "But I thought about that a little bit after because I went back and watched",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 624.94,
    "end": 649.245,
    "text": " after last week, and I was just like, I know for me, I was incredulous a couple of times when we went through the paper with Blue, but even going back and looking at it, you'd have to build a really powerful argument that says that the pressure signals on my fingertips are coming back to me in verbalized form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.802,
    "end": 653.302,
    "text": " Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.562,
    "end": 662.405,
    "text": "It's this idea that, you know, the files are on the computer, like what's coming up from the fingertips is pain and what's going down is an instruction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.025,
    "end": 678.109,
    "text": "That's sort of the Cartesian dualism mapped onto instructionism is just like body and brain are two disjoint pieces and they pass special symbolic information to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.909,
    "end": 679.109,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 679.682,
    "end": 683.504,
    "text": " And we'll see how that... Then our brain and our body is having a conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.764,
    "end": 688.586,
    "text": "So what is it, if not a conversation, or could it be beyond a conversation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.926,
    "end": 689.427,
    "text": "Right, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.247,
    "end": 690.447,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 691.768,
    "end": 692.008,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.989,
    "end": 697.571,
    "text": "We covered the abstract last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.391,
    "end": 706.335,
    "text": "All we'll point out here is just that they start as good philosophers with an examination of the instructionism and what that entails.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.674,
    "end": 722.367,
    "text": " The second and third sections of the paper are characterizing the representationalism that's related to these motor commands, kind of what we were just alluding to, and a special focus on the optimal motor control theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.942,
    "end": 743.992,
    "text": " And then the final sections take it to predictive coding and to active inference, which are formal frameworks for modeling behavior that are related to control theory formalizations, but the goal of the paper is to show that some of the instructionism is left at home, which allows us to go out with interactionism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.333,
    "end": 750.375,
    "text": "Here is the roadmap framing a similar outline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.357,
    "end": 761.412,
    "text": " and also just giving a few more signposts along the way with the figures and the box and whatnot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.246,
    "end": 773.868,
    "text": " The keywords provided here were helping us understand what did the authors want to have their work indexable near.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 774.468,
    "end": 781.909,
    "text": "In the semantic net of literature online, how did the authors want their work to be grounded?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.809,
    "end": 785.97,
    "text": "And it was in skillful performance, that's in the title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.59,
    "end": 792.351,
    "text": "Optimal motor control, that's the sort of scapegoat or foil, that's the contrast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.211,
    "end": 797.092,
    "text": " Maybe even bringing us back to contrasting divergences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.233,
    "end": 802.234,
    "text": "Instructionism, again, tied up with the optimal motor control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.094,
    "end": 814.718,
    "text": "Motor representations lending us into action-oriented representations and finally taking us to active inference where we kind of begin and end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.56,
    "end": 833.261,
    "text": " So skillful performance can mean many pieces and the authors defined it as opposed to bear movements, such as breathing and blinking, skillful performances are intelligent bodily activities, which harness knowledge about how to perform certain movements expertly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 835.157,
    "end": 851.162,
    "text": " It reminds me of the eternal debate who slash what is intelligent if an insect knows how to walk or if it is trained to do something versus if it's something that its body provides the training for inherently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.628,
    "end": 853.809,
    "text": " What is skillful?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.909,
    "end": 860.213,
    "text": "So definitely we'll want to ask the authors and anybody in the chat and anybody who joins us next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.453,
    "end": 862.014,
    "text": "What is skillful performance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.635,
    "end": 864.296,
    "text": "What is unskillful performance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.396,
    "end": 871.961,
    "text": "If somebody tries to do a skillful performance and fails, is that still within this category of behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 871.981,
    "end": 876.264,
    "text": "I saved up for this week because I wanted to get to the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.023,
    "end": 880.606,
    "text": " after the comma, the which harness knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 881.767,
    "end": 888.752,
    "text": "I kind of hinted that that's, I wanted to ask a question, and I still do want to ask a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 889.112,
    "end": 891.934,
    "text": "What does that mean, to harness knowledge?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.035,
    "end": 893.616,
    "text": "Consciously?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.636,
    "end": 899.46,
    "text": "Or can you get to a place, I mean, Blue talked about this, you talked about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 899.86,
    "end": 902.302,
    "text": "Can we get to a place of doing it automatically?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 903.043,
    "end": 906.305,
    "text": "Does that mean it's harnessed, just because we're not thinking about it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 908.668,
    "end": 911.73,
    "text": " And how much time did they spend looking at that piece?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.79,
    "end": 918.796,
    "text": "Because that kind of demarcates out what skill is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 919.817,
    "end": 926.182,
    "text": "If it's a dependency on harnessing, then how do we define that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.242,
    "end": 929.225,
    "text": "How do we define what's captured and what isn't?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 931.198,
    "end": 938.343,
    "text": " And the harnessing brings up kind of like harnessing or yoking a buffalo or a horse or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.004,
    "end": 941.906,
    "text": "And that's kind of hinging on that word.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.526,
    "end": 946.149,
    "text": "It's like the knowledge is that wild stallion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.13,
    "end": 949.611,
    "text": "And it's actually the bodily activities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.552,
    "end": 976.275,
    "text": " which harness that knowledge because when you quote know that your body can move in many different ways but skillful performance is when that is harnessed it's when it's connected to an instrument or whether it's its own instrument and it's channeled in a way maybe that's productive or expressive well at a fundamental level we have to again be careful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 977.382,
    "end": 986.95,
    "text": " that something going on at our fingertips is being harnessed by something going on three and a half feet away?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.15,
    "end": 994.156,
    "text": "Yes, connected, but is that an assumption that's verifiable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.998,
    "end": 999.6,
    "text": "Is there an actual harnessing going on even?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.821,
    "end": 1004.464,
    "text": "Because lots and lots of times, things happen at my fingertips that I'm not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.928,
    "end": 1032.469,
    "text": " sending i'm not even aware of what my hand is doing my wife tells me stop jiggling right just because i got nervous energy or whatever i think that's going to come back also to the predictive processing and predictive coding frameworks which is sort of when the body is getting the sick the signals it expects like if you're not consciously bringing your attention to you know your foot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.109,
    "end": 1039.073,
    "text": " If it's just your foot in the shoe, it feels like nothing or there's no attention paid to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.594,
    "end": 1043.436,
    "text": "And you can kind of shine that light of attention on it and it will feel normal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.576,
    "end": 1049.08,
    "text": "Or maybe you can start to zoom in on other sensations like tingling or other feelings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.661,
    "end": 1055.725,
    "text": "But the sort of default state when you're not paying attention, things that are happening the way that you expect is normal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.685,
    "end": 1061.11,
    "text": " And that's why that active inference piece is really interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.631,
    "end": 1068.06,
    "text": "Because in order for it to be active inferencing, there has to be some kind of attention or awareness being paid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1072.25,
    "end": 1074.932,
    "text": " And that's like, it's attention as a resource.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.412,
    "end": 1081.556,
    "text": "Got to pay the cost of attention or suffer the regret of not paying attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.076,
    "end": 1097.986,
    "text": "And Dave wrote, trying and failing, especially if part of the problem is choking, which was brought up by the authors in the paper as well, is likelier to involve more neocortical activation and more access consciousness than smooth performance of the same routine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.198,
    "end": 1106.266,
    "text": " So trying and failing, there's a lot more inner dialogue or thought process, like awareness happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.446,
    "end": 1116.236,
    "text": "Whereas when something is performed skillfully and smoothly, it just sort of goes off without a hitch and just, you know, you whip out the instrument",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.168,
    "end": 1119.95,
    "text": " make your shot or your swing or whatever it happens to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1120.47,
    "end": 1127.015,
    "text": "And then maybe you can narrate in retrospect, but in the moment you're not having as much awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1127.575,
    "end": 1128.196,
    "text": "So that's something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.716,
    "end": 1129.097,
    "text": "One last.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1129.977,
    "end": 1130.277,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.738,
    "end": 1144.988,
    "text": "So this is really interesting to me because again, is it skillful to be in the Peloton and be, be pulled along by what we would describe as the intention of those people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1145.448,
    "end": 1173.796,
    "text": " front of you is that considered to be a part of this because there's a lot of things that we're aware and conscious of and some things that happen in these skill performances they're just because they're part of the collective they're they're caught up in the inertia of the moment and is how do we how do we factor that in when we're talking about active inference because I think that's what instructionalism doesn't attend to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.469,
    "end": 1180.314,
    "text": " There's many, many things that are going to get dragged along here just because they're drafting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1182.556,
    "end": 1190.685,
    "text": "And how do we address that when we're talking about skill performance, skillful performance and interactionism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1190.725,
    "end": 1196.291,
    "text": "Because interactionism at least says I can be caught up in an inertia moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1197.212,
    "end": 1198.273,
    "text": "I don't have to explain it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.123,
    "end": 1216.657,
    "text": " absolutely um instructionism has to pitch and hole everything into that symbolic information theory what is the instruction from the front of the pack of the flock of birds or the peloton of cyclists what is the instruction that's getting passed back",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.558,
    "end": 1222.326,
    "text": " And so we have to go from what we know is just happening, which is like the physical inertia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.846,
    "end": 1224.649,
    "text": "There's also a narrative inertia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.93,
    "end": 1231.399,
    "text": "There might even be just an air current going over the person that actually stabilizes them in their spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.426,
    "end": 1243.072,
    "text": " We don't need to fall back to referring to those as instructions when they're clearly interacting phenomena, different types of interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.112,
    "end": 1259.341,
    "text": "You could have somebody breathing heavily next to you and that could give you a signal, but it's about the unpacking of that interaction and then where that takes the collective rather than again, just thinking about everything as connected with wires and passing secrets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.261,
    "end": 1260.562,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.222,
    "end": 1261.382,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.721,
    "end": 1284.845,
    "text": " um we can look again at the active infer plants so this was just asking where are the limits of skillful performance if the niche and the fitness to the niche is what counts for different organisms our human cultural niche has all these awesome kinds of skillful performance and otherwise but what about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.212,
    "end": 1286.692,
    "text": " other creatures?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.073,
    "end": 1304.448,
    "text": "What about other phenomena, the kinds of things that we might want to also model with active inference, but just don't quite have that same level of maybe thinking through other minds as we have with people, whereas we try to put ourselves in the shoes of somebody else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.29,
    "end": 1313.176,
    "text": "Do you think, Daniel, that that plant has got an embodied technical skill?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1315.936,
    "end": 1316.496,
    "text": " Welcome, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.037,
    "end": 1317.437,
    "text": "Hey, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1318.257,
    "end": 1318.478,
    "text": "Hi."
  },
  {
    "start": 1319.678,
    "end": 1323.441,
    "text": "We're just wondering whether plants have the... This plant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.461,
    "end": 1324.221,
    "text": "Oh, this plant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.321,
    "end": 1332.046,
    "text": "This plant has a technical skill now that it has the tools to be able to move from side to side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1336.049,
    "end": 1337.99,
    "text": "It's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.423,
    "end": 1352.145,
    "text": " I wonder if it could be shown that it got better at moving from side to side, that would start to look increasingly skill-like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1353.625,
    "end": 1362.287,
    "text": "And I think it's that idea that the molecular changes could occur that would allow the plant to respond faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.527,
    "end": 1368.828,
    "text": "Or you could imagine selecting on a whole greenhouse of plants, and the ones that are able to switch faster",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.901,
    "end": 1395.442,
    "text": " those are going to grow faster and then you select the ones that grow faster based upon their ability to learn in that generation so it kind of shows how you get this development of skill within a life that's development but then between generations you can also have the um entrenching or the canalizing of learned skill like language",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.903,
    "end": 1407.192,
    "text": " And skillful performance in this paper and in our slides, it's kind of like we're hinting a lot at this full body type performance, high jump and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.612,
    "end": 1413.978,
    "text": "But of course, language is maybe one of the examples of skilled performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1414.058,
    "end": 1415.299,
    "text": "It's a motor behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.02,
    "end": 1421.585,
    "text": "It involves a huge number of interacting motor subunits, voice box and the mouth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.485,
    "end": 1422.565,
    "text": "And...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.286,
    "end": 1440.306,
    "text": " speech therapists and others that they go deep into that but speech is almost like the case where you say well surely instructions are being passed that's maybe the the high watermark for where interactionism could go would be to have a speech",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.38,
    "end": 1457.656,
    "text": " a framing of speech that moved us beyond instructionism because this seems like clearly the transmutation of semantic or symbolic information into not directly related motor behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.297,
    "end": 1460.499,
    "text": "So that would be kind of a nice case to investigate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.707,
    "end": 1470.853,
    "text": " And Dave wrote in the chat, it seems odd that dogmas that have been known to be false for decades are still premises of so much funded professional activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.413,
    "end": 1488.083,
    "text": "I'm thinking of BF Skinner's insistence that all control activity must be strictly cortical, even though it's been known since at least the 50s, purely on the basis of speed of nerve conduction, that that would prevent graceful walking, let alone faster and more intricate movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.263,
    "end": 1489.564,
    "text": "So that's pretty interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.175,
    "end": 1502.141,
    "text": " we have almost just anatomical reasons to know that not everything can go through this sort of control and cognition in the loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.761,
    "end": 1506.243,
    "text": "There's just not fast enough transduction along the nerves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1506.783,
    "end": 1515.808,
    "text": "So there has to be this sort of distributed function more consistent with an interactionist framework than an instructionist framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1517.689,
    "end": 1520.351,
    "text": "Yet it's easy to fall back to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.045,
    "end": 1525.647,
    "text": " Instructionism, maybe, especially for professionalized areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.428,
    "end": 1535.512,
    "text": "Let's go to optimal control, blue, if you want to, feel free to add anything that you'd like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.772,
    "end": 1540.374,
    "text": "Optimal control theory is a nice bridge point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1541.277,
    "end": 1554.367,
    "text": " because in the paper, and as we'll be going into, we're again, thinking about motor behavior, but control theory is something that applies to the electrical grid, to logistics, to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.498,
    "end": 1579.734,
    "text": " robotics which are i guess motorized but optimal control theory is a framework that expands to many non-motor systems as well so that makes me wonder about whether we can also apply that instructionism versus interactionism contrast to control theoretic situations that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.491,
    "end": 1582.812,
    "text": " are implicitly instructionist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.912,
    "end": 1589.676,
    "text": "Like there's an algorithm and then it sends the buy order to the unit that makes the purchase on a market.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.196,
    "end": 1599.181,
    "text": "Or it sends a certain piece of information to a different computer that then enacts that suggestion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.522,
    "end": 1610.528,
    "text": "And then even in systems where we know instructions are being sent, like computer systems, maybe there's an interactionist way to think about that too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.697,
    "end": 1615.34,
    "text": " Any other thoughts or?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.862,
    "end": 1629.877,
    "text": "Does optimal control essentially place all of our chips on the top down aspect of the relationship between top down and bottom up?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.576,
    "end": 1645.706,
    "text": " Does it optimal control, say, optimization happens exclusively from a top-down directionality that there is really no place for the bottom-up part?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.89,
    "end": 1659.999,
    "text": "I think it's a good question, and I'll skip to this Friston 2011 paper, which is entitled, What is Optimal About Motor Control?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.843,
    "end": 1683.469,
    "text": " I wonder if um that optimality does arise from the top or um what is optimal once we move beyond instructionism there's a perfect set of instructions there's a perfect way to do it and then that is either carried out faithfully or it's not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.792,
    "end": 1703.46,
    "text": " So philosophically, if you said optimal would be some openness to both an ability to recapitulate and an ability to discover, to be able to put those two things into some sort of coherent relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.674,
    "end": 1715.762,
    "text": " I'm not saying that that's what is being said here, but I'm just not sure why we always assume that optimal is always about being able to create copies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.742,
    "end": 1730.652,
    "text": "Even in skillful performance, even compared to a standard, there are things that happen when a gymnast does their routine where some...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1732.443,
    "end": 1741.57,
    "text": " some element of the variability that applied to that situation is considered when something is being judged.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1741.59,
    "end": 1748.555,
    "text": "I think the only thing that doesn't factor in variability is the clock, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.035,
    "end": 1751.997,
    "text": "Like you either ran 9.8 seconds or you didn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1752.998,
    "end": 1758.662,
    "text": "But many of the skillful performances that we pay attention to,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1760.006,
    "end": 1763.109,
    "text": " aren't always about recapitulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1764.45,
    "end": 1765.932,
    "text": "So it's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1765.992,
    "end": 1766.332,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.652,
    "end": 1769.595,
    "text": "I guess, again, it's all how you define it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1769.615,
    "end": 1772.538,
    "text": "But we actually want to get on to doing something useful here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1774.198,
    "end": 1792.845,
    "text": " Yep, and also here's a line in that first in 2011 that reminds me of Dave's comment, which is these estimates, which are coming from a predictive processing or active inference framework can finesse problems incurred by sensory delays in the exchange of signals between the central and peripheral nervous system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.626,
    "end": 1798.608,
    "text": "So the generative model can include space for that delay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.619,
    "end": 1815.046,
    "text": " When we think about just sort of two people who are talking and accounting for each other's delay, for example, in that kind of an interaction versus the send, process, wait, send back model, there's actions that happen faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.466,
    "end": 1824.51,
    "text": "Another example of that maybe would be like baseball, where there's such a small amount of time to decide whether to initiate the behavior of swinging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.067,
    "end": 1844.579,
    "text": " um and this paper from 10 years ago laid out just such an interesting difference between value learning and active inference which allows for that pragmatic and the epistemic component the optimal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.771,
    "end": 1846.872,
    "text": " suggests multiple things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1847.072,
    "end": 1851.894,
    "text": "First off, it kind of suggests that there is an optimum that is being achieved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.194,
    "end": 1860.439,
    "text": "So that's one easier point just to say, okay, well, maybe there's an optimal way, maybe there's not an optimal way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.379,
    "end": 1864.881,
    "text": "But what is being optimized is the value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.361,
    "end": 1871.705,
    "text": "Just like reinforcement learning, what's being implicitly optimized here is a value function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.825,
    "end": 1882.435,
    "text": " And just as it says here, the replacement of value and cost functions with prior beliefs about movements removes the optimal control problem completely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.295,
    "end": 1888.12,
    "text": "So this idea of the value and cost, it's kind of like an economic analysis of motor behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.041,
    "end": 1895.867,
    "text": "So then let's just imagine that any number of circumstances, like somebody has a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.105,
    "end": 1922.963,
    "text": " belief about how a performance will be viewed socially well you could couch that in reward and you could try to go break down from the narrative and the social all the way down to the movement of the fingers on the piano about the value and well if you mess up it's a lower value action but you're getting really far away from the embodiment of the performance which maybe doesn't have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.082,
    "end": 1947.96,
    "text": " that same sort of cost all the way down so it's like will we have cost functions and economics all the way down and value and cost or will we have generative models and an instrumental way of thinking about action blue anything overall otherwise also anyone who's watching lives welcome to ask a related or an unrelated question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.509,
    "end": 1950.909,
    "text": " I'm good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.271,
    "end": 1956.634,
    "text": "Anything after last week's discussion that you'd been thinking about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.658,
    "end": 1963.4,
    "text": "I'm trying to remember last week's discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.42,
    "end": 1966.422,
    "text": "Refresh my memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.804,
    "end": 1969.485,
    "text": "Yep, that's what this first part is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.406,
    "end": 1972.968,
    "text": "Let's go to figure one and two of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.769,
    "end": 1973.889,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.339,
    "end": 1999.215,
    "text": " take a more formal look at uh and we can go to first in 2011 if we want more details on the similarities and differences because this is kind of the core of the contrast between optimal optimal motor control theory and active inference it's going to come down to the differences in how these models are framed because there's an interpretive layer but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.968,
    "end": 2024.532,
    "text": " the heart of it it's the differences between these two kinds of models between figure one and figure two here so in figure one uh and we'll go to the juxtaposition in figure one and figure two we have in both cases the plant kinetics which are defined with the exact same equations um and the sensory mapping so this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.109,
    "end": 2035.253,
    "text": " Red box is the same between both of the models, between optimal motor control on the left and ACT-INF on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.493,
    "end": 2041.635,
    "text": "And there is still an optimal control module in Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.456,
    "end": 2042.856,
    "text": "So that is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.349,
    "end": 2064.717,
    "text": " interesting but if we look a little closer we can see that in figure one that uh motor commands that u with a tilde over it it's the minimization so it's optimization you know minimization maximization sometimes by minimizing the cost you maximize the profit or it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.95,
    "end": 2068.951,
    "text": " flippable, throw a negative sign in there and a min becomes a max.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.711,
    "end": 2082.873,
    "text": "So here what's being minimized is an integral of potentially the cost function, C of X and U for changes in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.573,
    "end": 2089.874,
    "text": "So cost is being minimized through time and that is optimal control in that framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.595,
    "end": 2092.355,
    "text": "When we look at the optimal control,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2093.598,
    "end": 2101.142,
    "text": " In the active inference model, we see a really different structure, even of that optimal control module.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.243,
    "end": 2117.932,
    "text": "We see that u, which is playing a similar role, it's not a command, but it's still being passed, this u function, is still related to a minimization, but what's happening inside of the equation is very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.812,
    "end": 2119.232,
    "text": "And we can...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.764,
    "end": 2126.646,
    "text": " go to the Fristen figure caption to see what is happening there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.346,
    "end": 2144.611,
    "text": "That E, curly E, is the distinction between exteroceptive, which is E with little e, and proprioceptive, E with a P, reporting on hidden states in extrinsic and intrinsic frames of references, respectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.471,
    "end": 2149.773,
    "text": "These prediction errors are the difference between sensory input observed and predicted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.737,
    "end": 2165.019,
    "text": " so going back to here what's being minimized isn't the cost function through time even philosophical disagreements with homo economicus aside okay let's put aside cost",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.204,
    "end": 2169.506,
    "text": " And then there's the challenge of assigning costs to different kinds of states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.226,
    "end": 2171.947,
    "text": "What's being minimized here is the cost through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.147,
    "end": 2174.048,
    "text": "I mean, don't businesses try to do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.168,
    "end": 2176.57,
    "text": "Everyone wants to figure out how to minimize cost through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2176.63,
    "end": 2177.47,
    "text": "It's challenging to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.191,
    "end": 2179.071,
    "text": "What's being done here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.812,
    "end": 2191.178,
    "text": "The minimization between the proprioceptive sensory differential with a multiplication potentially through time, not sure what that does in the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.592,
    "end": 2218.554,
    "text": " it just so interesting that um the minimization here is just like we've talked about in so many of these discussions it's about your generative model of action and sensory outcomes sensory outcomes are emitted by hidden underlying states that you can't directly observe like you don't know exactly whether it's night or day but you are getting photons or not so there's a hidden state that's being",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2219.215,
    "end": 2243.571,
    "text": " evaluated that's the sort of hidden markov model component and the hidden state is in the model emitting states that are being observed as sensory outcomes and in active inference the depth of that generative model is actually such that instead of having a really rich generative model of cost functions and then trying to reverse engineer your cost function to find the cheapest behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.995,
    "end": 2272.206,
    "text": " generative model is of expected sensory outcomes like every time i move my shoulder here it starts to hurt and we don't need to introduce a concept of reward or cost into that equation we can suffice to say that there is a generative model of the sensory outcomes under different motor policies and the organism has a preference for let's just say being in non-painful states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2274.17,
    "end": 2290.912,
    "text": " It sidesteps that question of cost in a way where we can see that even from the side by side, even where there is an optimal control element, like a minimization element, what's being minimized is something that is very, very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.852,
    "end": 2302.12,
    "text": " And that's one of the key aspects of active inference that what's being minimized is the divergence between expected outcomes and realized outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.78,
    "end": 2318.372,
    "text": "That's what of course makes it so related to predictive coding, predictive processing, rather than drawing only on the reinforcement learning type approaches that are doing a minimization, implicitly maximization on reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.721,
    "end": 2321.462,
    "text": " Daniel, can I color in a little bit too?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2321.542,
    "end": 2321.862,
    "text": "Please.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2322.483,
    "end": 2330.047,
    "text": "When I saw this, it was interesting because what I saw was not, I guess it was a replacement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2331.428,
    "end": 2336.391,
    "text": "So on the figure one, it's due estimation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2338.252,
    "end": 2346.618,
    "text": "And then in figure two, what I saw was the removal of that and the application of a rule.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.58,
    "end": 2352.741,
    "text": " minimize prediction errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2352.821,
    "end": 2355.702,
    "text": "That's the rule as opposed to a step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2356.543,
    "end": 2361.325,
    "text": "And all I thought about was, for example, Hippocratic oath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.126,
    "end": 2369.389,
    "text": "I don't know what I should be doing in terms of this patient, but the rule is do no harm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.669,
    "end": 2377.293,
    "text": "So I think that's what I thought was really interesting here is that an actual step was replaced with a rule.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2377.313,
    "end": 2378.213,
    "text": "Hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2379.185,
    "end": 2383.707,
    "text": " And that to me was the big differentiator, the introduction of rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2383.727,
    "end": 2398.952,
    "text": "That's why I asked last week, when you changed the rules of the game for the plant, I know the affordance has changed and I know the tools were introduced and all of that stuff, but I keep coming back to tools, rules and pools.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2399.532,
    "end": 2404.234,
    "text": "Tools being obvious, rules being obvious, pools just being an aggregation of resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2405.973,
    "end": 2413.149,
    "text": " And so I think if you're able to sort of coordinate all three, it gives you a different sense of what might be going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2414.804,
    "end": 2419.026,
    "text": " Okay, a fun thought on that just to think about game playing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.346,
    "end": 2424.107,
    "text": "The rules are always in effect and the rules can be explicit or implicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.228,
    "end": 2428.449,
    "text": "Like it's a rule in chess that you have to move out of check or figure out how to get out of check.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.849,
    "end": 2431.65,
    "text": "But then there's sort of what are equivalent to rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.73,
    "end": 2435.612,
    "text": "Like if a piece is pinned, it can't move but you don't need to state that as a rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.052,
    "end": 2437.813,
    "text": "So rules are, they're simultaneous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.273,
    "end": 2443.775,
    "text": "They're always in effect unless there's another rule and they can breed emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.295,
    "end": 2447.278,
    "text": " You just say, okay, here's how the pieces move, and then here's check.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.598,
    "end": 2448.259,
    "text": "Those are the rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.879,
    "end": 2453.864,
    "text": "And then it's as if there's a rule that is you can't move out of a pinned piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.364,
    "end": 2457.868,
    "text": "So rules always in effect allow for the space of emergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.408,
    "end": 2459.789,
    "text": "Steps have to be sequential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.762,
    "end": 2465.685,
    "text": " And so it's almost like we're moving from the within a round of a game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2466.465,
    "end": 2467.486,
    "text": "That's the instructionist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.626,
    "end": 2468.646,
    "text": "Okay, you're playing risk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.126,
    "end": 2470.147,
    "text": "First, roll the die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2470.907,
    "end": 2474.269,
    "text": "Now, see whether the three is higher than the two die or whatever it happens to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2474.289,
    "end": 2483.394,
    "text": "And interactionism is pulling us back to like the rules and the pattern that still there can be sequential interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.56,
    "end": 2487.021,
    "text": " instructions or sequential information can occur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.822,
    "end": 2494.485,
    "text": "But it is very different to have rules rather than specified steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2494.965,
    "end": 2495.465,
    "text": "So let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.845,
    "end": 2496.446,
    "text": "We're building up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.506,
    "end": 2497.586,
    "text": "Yeah, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.606,
    "end": 2498.366,
    "text": "Just one last thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2498.687,
    "end": 2510.112,
    "text": "So when I would ask young people to watch a video clip of something, and I would ask them to draw three columns and title them tools, rules and pools, and find examples, find tokens of each.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2511.513,
    "end": 2514.516,
    "text": " What do you think was the easiest thing for them to accumulate under?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2515.457,
    "end": 2516.157,
    "text": "It was tools.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.619,
    "end": 2518.619,
    "text": "Those have got the edges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2518.96,
    "end": 2522.023,
    "text": "What was the second highest aggregation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.097,
    "end": 2541.316,
    "text": " tools because they could they could literally figure out what was congregating what was the hardest thing the parallel processing which is what you just described it's always going off the sequential is much easier to account for the parallel processing the happening",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2542.66,
    "end": 2550.304,
    "text": " as co-occurrence is the hardest thing for people when you're walking into a novel situation to take account of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.324,
    "end": 2559.268,
    "text": "So you can say it, it's just being aware of it and finding examples of it that's really, really hard for most minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2560.464,
    "end": 2568.51,
    "text": " So even from a computational aspect, the parallelizing functions make them speed up so much, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.53,
    "end": 2572.752,
    "text": "But they also are so computationally intensive, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.772,
    "end": 2574.934,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.03,
    "end": 2578.291,
    "text": " Dave has another great comment on this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.732,
    "end": 2582.033,
    "text": "He wrote, I'm looking for where time is applied in the two approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.754,
    "end": 2591.238,
    "text": "The intrinsic frame of reference for ACT-INF is U tilde of T. So that's, we'll zoom in a little bit on just figure two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.619,
    "end": 2595.101,
    "text": "Here's that U tilde of T passing through the intrinsic frame of reference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.662,
    "end": 2600.385,
    "text": " but there's no explicit T in the optimal control formula.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.585,
    "end": 2603.207,
    "text": "We can just see that motor commands U tilde are passed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.748,
    "end": 2608.212,
    "text": "So there's kind of like a timelessness to, you know, contract this muscle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.852,
    "end": 2613.556,
    "text": "It's not contract this muscle now, it's actually just a timeless statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.397,
    "end": 2619.421,
    "text": "So T he says, whereas T is inside the optimal control formula,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.896,
    "end": 2628.161,
    "text": " here is t, dt, it's a derivative through time and not in the intrinsic frame of reference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.435,
    "end": 2630.416,
    "text": " as seen in Act-Inf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.816,
    "end": 2636.2,
    "text": "So he asked whether that tells us where the approaches are taking account of time differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.24,
    "end": 2637.921,
    "text": "I think that's a great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.021,
    "end": 2642.684,
    "text": "How does time play a role differently in these two frameworks?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.465,
    "end": 2646.467,
    "text": "Let's keep on looking for similarities and differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.547,
    "end": 2649.248,
    "text": "So we have rules, not steps for active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.549,
    "end": 2653.691,
    "text": "We introduce a time dependence of that downward motor signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2655.313,
    "end": 2657.294,
    "text": "We have, of course, a deep generative model component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2658.598,
    "end": 2663.425,
    "text": " we have state estimation, that's the Hamlet joke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.805,
    "end": 2670.675,
    "text": "There's this whole module that's clearly different in optimal motor control, which is the state estimation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.784,
    "end": 2686.295,
    "text": " And that's what doesn't need to be done in active inference is this state estimation of, okay, given the sensory input we're getting, like I'm getting, you know, two thirds of my proprioceptors here and one third here are firing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.475,
    "end": 2688.697,
    "text": "So let's estimate that the arm is here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.638,
    "end": 2691.96,
    "text": "Okay, now pass that to the next part of the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.32,
    "end": 2695.002,
    "text": "Given that the arm is here, what happens?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2696.281,
    "end": 2721.456,
    "text": " we want to get the arm to okay now given which side of where we want the arm to go to we estimate the optimal and the actual r send the command you know turn the steering wheel to the side to bring it into alignment with the optimal or the most rewarding state so state estimation is in optimal motor control theory but in active inference you just don't have it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.352,
    "end": 2736.356,
    "text": " And that's sort of an interesting piece to drop out of the model because we don't need to have an explicit representation or an explicit variable with the location of the arm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.436,
    "end": 2738.917,
    "text": "So that's a rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.215,
    "end": 2743.597,
    "text": " It's like John Cage, everybody has the best seat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.278,
    "end": 2759.993,
    "text": "It's almost like it's enough to just say you're on the ocean, you're sailing, and then you're going to be trying to reduce your uncertainty as you pursue policies that in your generative model of the world, which includes latent causes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2760.754,
    "end": 2768.742,
    "text": " So the deep generative model includes like latent causes of the world, which are not anywhere to be seen in this optimal motor control theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.122,
    "end": 2773.627,
    "text": "Like there's a deep latent cause that if too much weight is on, you know, this branch, it's going to break.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2774.428,
    "end": 2775.269,
    "text": "But where's that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.661,
    "end": 2799.928,
    "text": " the constraints of the niche or something that's deep about the nation not there so anyways it's like you're in the boat you want to be reducing your uncertainty about getting the sensory states that you want like seeing that land look bigger reflecting you being closer but you don't need to have that gps coordinate where am i okay now where do i want to be and how are we going to get there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.925,
    "end": 2809.892,
    "text": " it's enough to actually have a sensory preference and then reduce your uncertainty on the trajectory of reaching that sensory outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.593,
    "end": 2814.596,
    "text": "So that's a big difference in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.597,
    "end": 2818.079,
    "text": "And I'm seeing even a few more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.779,
    "end": 2820.26,
    "text": "Let's look at the green boxes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.881,
    "end": 2825.084,
    "text": "So in the green box for figure one, we have a forward model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.005,
    "end": 2828.007,
    "text": "So they write that the function of the forward model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.304,
    "end": 2831.466,
    "text": " is to improve the execution of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.446,
    "end": 2839.892,
    "text": "It's kind of funny, you know, executive office or the executive component of the government, it's about executing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2839.952,
    "end": 2842.854,
    "text": "That's where the instructions are issued from, executive orders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.975,
    "end": 2849.639,
    "text": "Improve the execution of action by helping to finesse the inferences of the state estimator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.279,
    "end": 2856.524,
    "text": "So again, it's in feedback with the state estimate, and then it's sending an effort copy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.205,
    "end": 2858.966,
    "text": "So that's outgoing is efference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.882,
    "end": 2873.653,
    "text": " And so there's this feedback between the prediction of basically where the body is in this case, and then that gets sent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.933,
    "end": 2876.375,
    "text": "It's kind of interesting that the X comes from a state estimation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.415,
    "end": 2878.517,
    "text": "That's the where is the arm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.278,
    "end": 2882.5,
    "text": "And then the forward model is the forward model of motor control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.241,
    "end": 2885.103,
    "text": "That is what connects with this U tilde.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.262,
    "end": 2891.104,
    "text": " That's the green box, that forward model in Optimal Motor Control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.904,
    "end": 2897.887,
    "text": "Whereas in Active Inference, we have a different forward model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.787,
    "end": 2903.569,
    "text": "It's a forward model of X as well as V, which is the prior belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.409,
    "end": 2912.953,
    "text": "So again, there doesn't need to be a forward model of position and motor action as happening here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2914.17,
    "end": 2922.276,
    "text": " it's enough potentially to have a model of action and over beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.316,
    "end": 2929.28,
    "text": "We can look at the first in caption to see a little bit more closely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.3,
    "end": 2931.922,
    "text": "Yeah, any thoughts on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.525,
    "end": 2941.149,
    "text": "I think the state estimator to go back, I think one live stream",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2942.486,
    "end": 2951.59,
    "text": " State estimator says that there have to be ties between the two rails to stabilize those ties so that some processing can take place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2952.15,
    "end": 2961.655,
    "text": "I think what this talks about is the fact that we know that there's a gradient, we know the train is gonna roll downhill as long as there's a gradient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2962.015,
    "end": 2968.738,
    "text": "It's a rule as opposed to trying to stabilize the relationship between the ties of the railroad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2969.878,
    "end": 2972.44,
    "text": " Two very different ways of looking at something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.041,
    "end": 2977.323,
    "text": "And I think that this goes kind of back to what I said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2977.343,
    "end": 2986.029,
    "text": "I think there are times when we do give ourselves instructions and then there are times when we simply parallel process because we have a rule.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.449,
    "end": 2992.333,
    "text": "I don't want to make mistakes because that doesn't serve my goals or my target.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2993.014,
    "end": 2995.916,
    "text": "And I think, again, I just suggest",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.67,
    "end": 3002.714,
    "text": " that the inclusion of both is probably to our advantage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3002.954,
    "end": 3014.382,
    "text": "It's just that what we tend to do is give all of our, we've been trained to give all of our attention over to making sure that the thing is stabilized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3016.798,
    "end": 3033.666,
    "text": " nice also one piece of first in 2011 that's not brought over to this paper figure one was that motor control figure two is predictive coding and motor control so already we see the um reduction of the model in the terms of the state estimate goes away",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.226,
    "end": 3044.95,
    "text": " You don't need to explicitly have a state estimator because the state estimator has now been subsumed into the forward model, which is why crucially the mapping from hidden states to sensations is now part of the forward generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3045.55,
    "end": 3048.291,
    "text": "So we have a generative model of what we expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3048.752,
    "end": 3054.274,
    "text": "And now with predictive coding, instead of keeping a variable of what we think is happening,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3055.054,
    "end": 3064.348,
    "text": " which can be tracked through time and all that, we're simplifying that state estimator by including the expectations about the state estimator in our forward model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.19,
    "end": 3066.251,
    "text": "That's predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3066.972,
    "end": 3069.236,
    "text": "How does that differentiate from active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.41,
    "end": 3095.941,
    "text": " that's a good question here we have plant kinetics sensory mappings forward model and optimal control with a cost function still coming in you still see that integral with the minimization of motor commands u over time whereas in active inference again we're moving from it's more valuable to be getting the signals i like and i like rewarding things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.079,
    "end": 3106.983,
    "text": " to I'm just bringing the sensory outcomes into alignment with expectations and I'm selecting policies based upon which ones I think are gonna get me there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3107.003,
    "end": 3112.345,
    "text": "And then this section that I had highlighted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3113.809,
    "end": 3122.235,
    "text": " In summary, the tenet of optimal control lies in the reduction of optimal motion to flow on a value function like the downhill flow of water.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.695,
    "end": 3124.076,
    "text": "So that's pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.516,
    "end": 3130.08,
    "text": "And that's awesome because think about how much work has been done on information flows in the last 10 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.601,
    "end": 3140.568,
    "text": "Conversely, in active inference, the flow is specified directly in terms of the equations of motion that constitute prior beliefs like patterns of wind flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.394,
    "end": 3154.939,
    "text": " The essential difference, so how do we go from water going downhill on the value, gradient descent or up and down again, they kind of get flipped around, but how do we go from just thinking about what direction does gravity take you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.26,
    "end": 3156.8,
    "text": "That's value, that's reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.1,
    "end": 3158.101,
    "text": "There's one answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.441,
    "end": 3162.983,
    "text": "Which policy for financial outcomes is gonna have a higher value?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.323,
    "end": 3166.284,
    "text": "That's that scalar estimate of value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.052,
    "end": 3172.635,
    "text": " The essential difference is that prior beliefs in active inference can include solenoidal flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.455,
    "end": 3176.958,
    "text": "So this is where we're opening up the whole discussion of play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3177.058,
    "end": 3178.899,
    "text": "So I hope that we can think about that for a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.599,
    "end": 3183.862,
    "text": "And Friston says, you know, he doesn't want to overstate the shortcomings of optimal control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.462,
    "end": 3188.205,
    "text": "So it's not that you can't introduce a solenoidal component to value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.965,
    "end": 3192.567,
    "text": " You can have the idea of solenoidal flow circulating on iso contours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.167,
    "end": 3197.669,
    "text": "But how many businesses stop and say, you know, let's not pick the most rewarding number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.549,
    "end": 3205.552,
    "text": "Let's look for maybe it's not the most rewarding number, but then there's the most solenoidal play around that number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.452,
    "end": 3208.293,
    "text": "People say, but we're not going to be doing those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3208.993,
    "end": 3214.015,
    "text": "So why would we stop at, you know, 5000 feet when we know that we can get to 6000 feet?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.623,
    "end": 3227.739,
    "text": " And solenoidal flow and the ability to have that pragmatic and epistemic, that directed and the solenoidal components opens up the space of play, hopefully.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3228.12,
    "end": 3230.423,
    "text": "So what do you think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.483,
    "end": 3231.324,
    "text": "Or does that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.455,
    "end": 3238.54,
    "text": " I'll put up this slide where we had separated out this optimal motor control theory with a value only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3238.56,
    "end": 3244.264,
    "text": "That's the one thing that this robot is tracking, is the slope and the altitude.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3244.965,
    "end": 3250.409,
    "text": "Its following is uphill as much as it can, so it can get to the top of mount value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.15,
    "end": 3258.516,
    "text": "Whereas in active inference, we're using the Helmholtz decomposition, which is related to the physics of flow on vector fields,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.614,
    "end": 3284.803,
    "text": " that is going to reduce to these two irreducibly separated components so like they're totally orthogonal they don't have redundant information they have totally separate information there is the value component the straight line but there's also this equal value solenoidal flow any thoughts on that you explained it really well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.496,
    "end": 3288.978,
    "text": " Here's a comment from Dave, while people are thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.739,
    "end": 3297.924,
    "text": "Giving oneself instructions can refer to something real and useful if one interprets the execution of the instruction appropriately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.524,
    "end": 3304.228,
    "text": "I'm referring to playing a piece of music without touching the instruments, which can be nearly as effective as actually playing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.409,
    "end": 3310.772,
    "text": "If the challenge is to simply touch the right stops at the right moments, this can actually be more affecting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.795,
    "end": 3319.361,
    "text": " Empowered machine operators may seem less efficient than highly regimented ones, but may over time get to far more effective overall operations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.662,
    "end": 3322.263,
    "text": "Dean, what do you think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.584,
    "end": 3327.647,
    "text": "Again, I completely agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3327.727,
    "end": 3337.414,
    "text": "My only question is, so why are more people not picking up on the potential of this and the value of having an awareness of both?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3339.986,
    "end": 3344.047,
    "text": " So I think it's maybe just getting started in a computational way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.268,
    "end": 3353.671,
    "text": "I mean, we've explored some computation papers looking at how to optimize a given task computationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.251,
    "end": 3355.572,
    "text": "So I think that it will...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.267,
    "end": 3358.347,
    "text": " gain traction, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.387,
    "end": 3359.268,
    "text": "It's just so new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.288,
    "end": 3368.291,
    "text": "I mean, not active inference as a concept, but the practical applications of active inference, I think, are just starting to be explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.991,
    "end": 3370.232,
    "text": "And I think that the play...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.139,
    "end": 3374.08,
    "text": " aspect is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.16,
    "end": 3378.042,
    "text": "I mean, because it's like how we learn, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.102,
    "end": 3389.346,
    "text": "Exploring or playing or, you know, these types of things give rise to real learning, even if it's accidental learning, like not necessarily effort directed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.366,
    "end": 3392.167,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3392.187,
    "end": 3400.551,
    "text": "I think it's also, I think it's something some has to do with a perception that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3401.892,
    "end": 3409.139,
    "text": " play doesn't necessarily generate value, which is kind of sad because there's so many examples where it does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.58,
    "end": 3417.166,
    "text": "The outcomes of play cause your mind to go off in so many because it's supposed to be about distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3417.547,
    "end": 3421.61,
    "text": "This is a kind of a way of encouraging that distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3421.69,
    "end": 3426.395,
    "text": "And yet, for some reason, it just doesn't get the same respect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3427.456,
    "end": 3427.576,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3429.801,
    "end": 3440.307,
    "text": " I'm just thinking about the pipeline from basic to translational to applied to sort of infused research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.548,
    "end": 3442.609,
    "text": "Like once, oh, everybody knows that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.709,
    "end": 3447.332,
    "text": "Once basic though becomes applied and then becomes every day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.352,
    "end": 3451.694,
    "text": "So let's just imagine that we're going back shooting on that skilled performance slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3452.515,
    "end": 3458.899,
    "text": "Well, if we have implicitly or explicitly, if we're working under this optimal motor control function,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3459.704,
    "end": 3466.947,
    "text": " we're thinking, okay, maybe people's biomechanics differ, but for each person's biomechanics, there is an optimal way to shoot a free throw.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3467.927,
    "end": 3478.791,
    "text": "And we want people to have a more accurate modeling of where their hand is on the ball so that they can execute the movement better so that we can get the reward, score the points, put the ball in the hoop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.391,
    "end": 3482.953,
    "text": "And so it relates to having people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3484.093,
    "end": 3491.588,
    "text": " practice or maybe get input on your hand was a little bit off here relative to the coach's expectations of where the hand should be um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.72,
    "end": 3518.034,
    "text": " But then there's this whole question about visualization and about what Dave was saying, like playing the music without touching the instrument and the ability that was almost discovered in a bottom-up way of changing beliefs about one's performance, rehearsing mentally, but also changing beliefs about performance, influencing motor behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.975,
    "end": 3522.797,
    "text": "That is more consistent with what we see in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.181,
    "end": 3533.817,
    "text": " And so there's just multiple things that previously would be seen as sort of exceptions or quirks of a pure motor control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.515,
    "end": 3562.384,
    "text": " system like incorporating these deeper elements of our generative model um all the way up to even like the psychological like maybe your generative model is that your team is fated to lose so then you do choke in that moment because like you know you didn't psychologically want to win or whatever and that's as dina's we're always joking about like the interview with the athletes right after the game it's like i wanted to win or something like that like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.964,
    "end": 3566.346,
    "text": " they're not going to give you that third person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3567.207,
    "end": 3569.829,
    "text": "My hand, you know, was on the wrong spot on the ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3571.13,
    "end": 3574.032,
    "text": "It just, we're seeing how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.433,
    "end": 3597.239,
    "text": " now as we have just like blue said more computational modeling that recognizes interactionism and that recognizes deep generative models it will be possible to start to slide some of these examples from being like quirky outliers to actually sketching out the structure of inference and action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.328,
    "end": 3602.814,
    "text": " instead of just being seen as this one weird trick that's going to help you learn free throws.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3603.534,
    "end": 3609.261,
    "text": "It'll be like, that's always about your generative model, and that includes you as being a team player, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.642,
    "end": 3617.391,
    "text": "It always is going to include that, and then it's going to come down to maybe being modeled better by active inference rather than a reward-based framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3617.552,
    "end": 3617.712,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.398,
    "end": 3631.805,
    "text": " So I just was thinking like, you know, in your, you said you, you were exploring like the, the dynamic, you were, you were going through the dynamic that was like exploration and then doing something intentionally, like learning how to do it and then like perfecting a skill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.286,
    "end": 3632.446,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.506,
    "end": 3639.35,
    "text": "And I was thinking like you left off the end of that, like, uh, just like from a societal like standpoint, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.39,
    "end": 3644.613,
    "text": "Like we explore new things, like not thinking as an organism, but thinking as, as a social structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.973,
    "end": 3650.697,
    "text": " We explore new things, we set out the intention to complete those new things, we perfect those new things, and then we forget them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.418,
    "end": 3654.719,
    "text": "So does that come into play in this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.799,
    "end": 3667.667,
    "text": "I wonder, because I think about scaling active inference a lot, not in the way that we talked about scaling active inference in the paper, scaling active inference, but just as from small components of a system to systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.507,
    "end": 3674.352,
    "text": " And, you know, in that scaling, like, so are we missing something about forgetting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.612,
    "end": 3682.238,
    "text": "Like handwriting, if you think about like learning cursive, you know, that was something like people start out scribbling on paper, little kids, you know, they're playing and they're drawing and whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.278,
    "end": 3685.38,
    "text": "And then they intend to learn cursive, they perfect cursive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.021,
    "end": 3688.343,
    "text": "But like as a society, we're not teaching that anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.403,
    "end": 3689.364,
    "text": "So they don't know cursive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.704,
    "end": 3692.146,
    "text": "And it's like typing, like now we have voice translation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.186,
    "end": 3693.967,
    "text": "So we don't know typing anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.007,
    "end": 3697.21,
    "text": "I mean, these types of things like are influential in a society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.23,
    "end": 3697.35,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.87,
    "end": 3699.912,
    "text": " Does that come into play here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.092,
    "end": 3704.815,
    "text": "Like where I've talked about before, you know, thinking about doing something like entering the flow state, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.835,
    "end": 3716.383,
    "text": "When we talked about the flow last live stream, you know, it's like you have the intention to do something and like you think about doing something, but when you're really a skilled performer, you enter that flow state and you forget about doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.424,
    "end": 3717.344,
    "text": "You just do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.404,
    "end": 3719.326,
    "text": "It's just magically accomplished.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.746,
    "end": 3724.509,
    "text": "So is that like flow state comparable to this like forgetting of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.55,
    "end": 3743.338,
    "text": " as a society right so so when you enter that flow state and like you're doing something magically like just with your kinesthetic memory and you're perfect at it does that compare to society like forgetting a task because we've already mastered it like we're we forgot about that we're on to the next thing i wonder if that's relevant anyway sorry if i rambled",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.278,
    "end": 3745.318,
    "text": " No, it's really nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.338,
    "end": 3753.2,
    "text": "Here's what it made me think about was instructions, again, implicitly or explicitly, they have to be remembered or forgotten.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.52,
    "end": 3759.381,
    "text": "Because if they're not remembered along the chain or at least in the RAM of the computer, it's like they're never carried out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.921,
    "end": 3765.802,
    "text": "If you started a sentence and they forgot what the first part was by the end of the step, they can't carry out the instructions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.303,
    "end": 3771.244,
    "text": "So instructions, we think about symbolic, representation, remembering, and forgetting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3771.904,
    "end": 3772.824,
    "text": "But with interactions...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3773.962,
    "end": 3776.746,
    "text": " it doesn't have to be remembered or forgotten.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.826,
    "end": 3777.967,
    "text": "It's actually just experienced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.588,
    "end": 3783.995,
    "text": "Like in the ant colony, the interactions between ants, they don't have to be remembered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.116,
    "end": 3789.763,
    "text": "It updates the generative model of each nestmate, and then they continue on their path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.629,
    "end": 3798.334,
    "text": " but it's actually just experienced and that's enough in an interactionist framework rather than being remembered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.155,
    "end": 3801.477,
    "text": "I'm not sure if that gets at it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.817,
    "end": 3818.188,
    "text": "I think it's a great point about how as something becomes pervasive and other skills and scaffolds are layered over it, there is a forgetting that can happen, but also it's like we don't even need to have memorization of everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.54,
    "end": 3828.004,
    "text": " I remember hearing from different college majors and somebody would say, somebody would say what major they were and somebody else would say, oh, well that one always was too much memorization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3828.324,
    "end": 3829.865,
    "text": "Like there was, that was too much memorizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3830.745,
    "end": 3833.446,
    "text": "And then for that person, it wouldn't be who it was their major.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3833.466,
    "end": 3835.167,
    "text": "It wouldn't be too much memorizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3836.048,
    "end": 3838.949,
    "text": "It just seemed like it was parts of a bigger picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.009,
    "end": 3845.012,
    "text": "And so they didn't feel like they were memorizing little factoids, but rather just interacting with the material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.149,
    "end": 3846.53,
    "text": " Not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3846.59,
    "end": 3847.632,
    "text": "Dean, what do you think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3847.652,
    "end": 3854.405,
    "text": "Yeah, well, Blue, you didn't say this, but you touched on something that's mattered to me for a really long time, and that is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3855.62,
    "end": 3862.885,
    "text": " Should we scale bottom up or does it sort of exist in its own realm?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3863.726,
    "end": 3866.308,
    "text": "Because that's the thing that you basically said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3866.788,
    "end": 3875.875,
    "text": "I taught for a long time and it bothered me greatly that all the learning from haptic movement was disappearing into a keyboard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3877.585,
    "end": 3885.412,
    "text": " So we top down that one and then we forgot about it because top down basically erased the bottom up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3886.233,
    "end": 3893.859,
    "text": "We seem to think that if we top down it, if we give it an app, we can now forget about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3893.939,
    "end": 3898.483,
    "text": "And I find that crazy because I've had many quite...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3901.803,
    "end": 3913.63,
    "text": " heated debates with people who want to take another bottom-up exercise where we can really learn something and get some joy out of discovery and say, well, I'm going to scale that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3914.29,
    "end": 3915.491,
    "text": "And I say, leave it alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3917.232,
    "end": 3917.892,
    "text": "Leave it alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3917.952,
    "end": 3919.053,
    "text": "It's a bottom-up thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3919.133,
    "end": 3920.033,
    "text": "What are you doing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3920.934,
    "end": 3927.658,
    "text": "I know you can top down it, but why can't we just let it explore a little bit and figure things out for itself?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3929.102,
    "end": 3932.787,
    "text": " So Dean, you really touched on something there with like the haptic movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3933.648,
    "end": 3940.057,
    "text": "And, you know, I like personally learn super well by writing things down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.458,
    "end": 3942.501,
    "text": "Like I take notes, I throw the notes away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.581,
    "end": 3943.662,
    "text": "I never look back at them again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3943.682,
    "end": 3944.664,
    "text": "They're all processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3945.064,
    "end": 3949.047,
    "text": " It's the act of physically writing something down that helps me learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.148,
    "end": 3952.93,
    "text": "And I mean, sometimes I do look back at my notes, but mostly not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.97,
    "end": 3955.291,
    "text": "I just take them to commit things to memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3955.472,
    "end": 3960.355,
    "text": "And, you know, my daughter was really struggling with learning her times tables, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.375,
    "end": 3963.197,
    "text": "She's like doing these flashcards and the Quizlet app and all this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.497,
    "end": 3978.727,
    "text": " And I had her manually copy, you know, like the times tables and, you know, instantly like within a month she had them down and just like destroyed the standardized tests, like where they do math computation, which is just like rote memorization of your math facts and how fast can you do it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.987,
    "end": 3984.37,
    "text": "She got like a hundred percent and she's, you know, at like off the charts for her grade level in testing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3984.43,
    "end": 3988.133,
    "text": "So anyway, it's, it's really very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.653,
    "end": 3991.295,
    "text": " real and actual, but in that kinesthetic memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.615,
    "end": 3997.899,
    "text": "And this goes back to that motor command and the disappearance of the motor command.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.499,
    "end": 4002.221,
    "text": "And so this is what I think about these two juxtapositions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4002.321,
    "end": 4008.025,
    "text": "And I think there is a space where you do issue a motor command, at least for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.545,
    "end": 4012.167,
    "text": "There is a space where it's like, okay, I need to put my right foot in front of my left",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.227,
    "end": 4014.508,
    "text": " foot and walk along to learn to balance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.568,
    "end": 4018.409,
    "text": "I'm issuing a command to myself to execute some task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.009,
    "end": 4022.57,
    "text": "But there are many times where you do not issue that motor command.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.61,
    "end": 4029.452,
    "text": "I mean, think about if you've ever tried to learn to play the piano, placing your fingers on the keys and stuff, and then you just do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4029.612,
    "end": 4031.433,
    "text": "There's no command at that space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.513,
    "end": 4040.496,
    "text": "And so there's a mental, a kinesthetic something that happens where you transition between having to issue the command and not having to issue the command.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.876,
    "end": 4046.297,
    "text": " And this is something that I'm excited to talk to the authors about if they are able to join us on a live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4046.897,
    "end": 4048.718,
    "text": "Because I don't know, where does that step?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4048.818,
    "end": 4051.458,
    "text": "Where does that step get erased in active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.578,
    "end": 4056.859,
    "text": "I mean, we aren't always just, we aren't always commandless, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4057.079,
    "end": 4057.399,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.72,
    "end": 4061.86,
    "text": "I'll just put one more, one last thing on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4062.7,
    "end": 4069.682,
    "text": "If I think of myself, if I think of myself separately from the neck down, everything from the neck down is giving me the bottom up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4070.726,
    "end": 4072.527,
    "text": " My brain is way up here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4073.748,
    "end": 4077.87,
    "text": "There's things that are supporting that, that are giving me that chance to bottom up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4078.33,
    "end": 4080.691,
    "text": "I don't want those things to disappear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4080.731,
    "end": 4082.852,
    "text": "I don't want to be a head on a cart.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4083.352,
    "end": 4088.295,
    "text": "I don't want to be like that plant with just my head going back and forth between lights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4089.395,
    "end": 4094.218,
    "text": "When do we stop saying that everything has to... Like I said, you didn't say this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4095.114,
    "end": 4108.32,
    "text": " But I've had so many people say, oh, Dean, all the stuff that you're doing is great and you create all these unicorns and all these young people are able to go out and contribute in professional settings, but it's not scalable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4109.24,
    "end": 4112.021,
    "text": "And I go, what do you mean it's not scalable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4112.381,
    "end": 4120.505,
    "text": "Every one of these things is a bottom-up example that it can happen as long as you don't try to top down it to death.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4125.157,
    "end": 4152.336,
    "text": " interesting the part about the body and the neck reminded me of ken wilbur's centaur stage of development which is sort of like uh along the integral psychological trajectory there's a step where there it's like half human half horse and so it's like one step beyond kind of a human in dialogue with a horse as two separate entities there starts to be like a fusion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.897,
    "end": 4173.462,
    "text": " in his framework moving towards non-dual framings but there's that stage where it's like uh the top down the bottom up but you know our brain is further out just gravitationally so it makes it seem like it's the top down piece but you know what about a person upside down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.746,
    "end": 4176.947,
    "text": " Then is it bottom-up signaling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.967,
    "end": 4179.128,
    "text": "Well, you've already pointed him out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4179.148,
    "end": 4181.77,
    "text": "He's on the edge of a building back there about 10 slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4182.01,
    "end": 4183.331,
    "text": "Or people on the other side of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.351,
    "end": 4184.812,
    "text": "They're upside down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.513,
    "end": 4191.977,
    "text": "And I think asking about speech and sign language...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.015,
    "end": 4206.649,
    "text": " could be interesting because I think those are gonna be the challenge cases for symbolic, the last bastion of instructionism and symbolic messages being passed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4208.638,
    "end": 4210.679,
    "text": " maybe is happening through language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.159,
    "end": 4220.342,
    "text": "Whereas with this sort of elegant, skillful performance model, maybe you go, okay, I can see where predictive processing is coming into play, where it's not just about value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4220.422,
    "end": 4231.806,
    "text": "Okay, so if predictive processing is an improvement from reinforcement learning or from optimal motor control, then I guess I could see why active inference builds upon predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.986,
    "end": 4234.167,
    "text": "So that's the pipeline, the act-inf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4234.887,
    "end": 4262.275,
    "text": " down the rabbit hole pipeline for some but i think when it actually is semantic or symbolic what is being performed that'll be where on one hand there's going to be resistance because it's going to seem the most instructionist but on the other hand i think we're going to tap into the richness of active inference to have a deep generative model including semantic information whereas the semantics are not in this motor control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.536,
    "end": 4278.873,
    "text": " framing so it'll be like double or nothing with active inference for some of the symbolic cases uh blue yeah i just wanted to go back to what um dean was saying earlier about bottom up and um like i don't know uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4280.678,
    "end": 4289.065,
    "text": " like using active inference and modeling active inference in like a bottom up and nested way is super, super interesting to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.085,
    "end": 4293.669,
    "text": "And I just am wondering, like, when are we going to crack that walnut?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.13,
    "end": 4295.291,
    "text": "Because it's going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.331,
    "end": 4299.094,
    "text": "I feel like we're we're teetering, you know, on the edge of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.354,
    "end": 4300.896,
    "text": "What will that look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.176,
    "end": 4302.117,
    "text": "I mean, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.337,
    "end": 4305.08,
    "text": "What will it look like or what will be a system where we can explore it in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4306.306,
    "end": 4311.27,
    "text": " I mean, maybe the active in France, I think is maybe maybe Daniel will grace us with we get to do his paper one day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.13,
    "end": 4312.851,
    "text": "We can do it soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.871,
    "end": 4313.852,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4313.992,
    "end": 4324.74,
    "text": "The only thing I'll add is that we have to people that are participating in this and really are going, oh, my goodness, we're really on the cusp of something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4325.36,
    "end": 4328.983,
    "text": "Just have to be willing to go over the edge of the cliff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4330.219,
    "end": 4331.6,
    "text": " And I'm not joking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4331.64,
    "end": 4343.624,
    "text": "It's the letting go of all of the habits that we formed to get to this place because most people didn't get to, we didn't, the three of us didn't get here through active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4343.684,
    "end": 4348.186,
    "text": "That came after a whole bunch of things that were more instructionalist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4348.942,
    "end": 4354.343,
    "text": " And to step back, it would be much easier than to go over.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4354.383,
    "end": 4360.764,
    "text": "If we've got the prospecting, the proposition, and the provisions in place, we'll go over the edge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4361.445,
    "end": 4362.485,
    "text": "And it'll all be fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4362.905,
    "end": 4364.245,
    "text": "It'll actually be quite thrilling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4366.826,
    "end": 4368.266,
    "text": "I really like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4369.026,
    "end": 4370.727,
    "text": "Sort of that come to the edge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.027,
    "end": 4374.747,
    "text": "There's a different thought chain when you're climbing the ladder to the high jump.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.468,
    "end": 4377.028,
    "text": "We've all jumped off of something that was...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.399,
    "end": 4379.78,
    "text": " scary or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.761,
    "end": 4384.985,
    "text": "There's a different thought process when you're climbing, maybe because your motor behavior is grounded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4385.305,
    "end": 4387.587,
    "text": "You're on the ladder or you're on the mountain going up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.487,
    "end": 4389.628,
    "text": "That's one mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.009,
    "end": 4392.11,
    "text": "That's actually like approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.531,
    "end": 4395.653,
    "text": "But then right at the end, the mind goes blank.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.67,
    "end": 4424.399,
    "text": " and you know the mind will say jump jump jump but there's that resistance and that reminds me one of the few times that i've used vr goggles um it was like you walked into an elevator this was like a scenario walk into an elevator and then it carried you up a building and you could see yourself getting higher and higher up and then the elevator doors opened and you looked down and it was just like dropping off a building and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.566,
    "end": 4428.128,
    "text": " it felt like my foot was just glued to the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.708,
    "end": 4438.456,
    "text": "Like I felt like I could not take a step forward, even though I could inch my foot forward and I could see that it was, that I hadn't moved, that I was still just on a flat ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4439.236,
    "end": 4439.717,
    "text": "It was like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.812,
    "end": 4450.095,
    "text": " it just stopped motor behavior to know that it would be resulting in some unpleasant situations in the usual case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.655,
    "end": 4458.078,
    "text": "So Dean, what do we say to those who are not sure if they want to go to the cliff?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.978,
    "end": 4461.219,
    "text": "What do we say to those who are walking towards the cliff?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4461.299,
    "end": 4463.3,
    "text": "And then what do we do with those who are on the edge?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.851,
    "end": 4470.538,
    "text": " This is a fantastic question because this is the nut of the problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4470.918,
    "end": 4479.467,
    "text": "So do you want instructionalism extended into the active inference realm?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4479.487,
    "end": 4485.554,
    "text": "Or do you realize that whatever identity you take on in terms of learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4486.516,
    "end": 4496.078,
    "text": " with both eyes open with some instructionalism and some interactionism, I don't know what that will be for you or Blue or me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4496.378,
    "end": 4500.179,
    "text": "I just know it won't be an extension of instructionism alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4501.279,
    "end": 4502.8,
    "text": "That's the counterfactual here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4503.4,
    "end": 4509.181,
    "text": "I don't know what that will feel like as different any more than you knew",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4510.021,
    "end": 4518.37,
    "text": " what the difference was going to be in terms of releasing to gravity as opposed to pushing against it as you were climbing up those stairs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4518.751,
    "end": 4528.421,
    "text": "I just know that if you considered it to be just two more stairs as an extension of what you were already doing, you're going to be disappointed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4529.679,
    "end": 4534.404,
    "text": " So I think that's the big question here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4536.026,
    "end": 4546.858,
    "text": "When I used to say to kids, as long as you don't think that a field researcher is simply an intern outside of school, I don't know what that's going to feel like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4547.279,
    "end": 4551.243,
    "text": "And I certainly don't know what that's going to look like because I'm not out there with you and your sponsors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4552.188,
    "end": 4561.674,
    "text": " So how can you let go of what you know in order to realize this thing that nobody can give you a direct answer to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4562.955,
    "end": 4581.307,
    "text": "That's a beautiful question, Daniel, because that for active inference is going to be the, that's the rule that's going to have to be discovered that even people who are spending a lot of time focusing on this right now and giving it formalisms and developing the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4583.117,
    "end": 4586.98,
    "text": " the way to formalize the math are going to have to ask themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4587.04,
    "end": 4590.062,
    "text": "Otherwise it's just going to be an extension of instructionalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4590.102,
    "end": 4590.983,
    "text": "And that would be sad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4592.444,
    "end": 4592.664,
    "text": "Hmm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4593.425,
    "end": 4593.625,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.665,
    "end": 4594.666,
    "text": "It's like jumping off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.306,
    "end": 4596.948,
    "text": "It's not a staircase in reverse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.935,
    "end": 4623.844,
    "text": " right and um I think the idea would be maybe we already have flight suit on where it's like if you climb up that's the provision you climb you climb up with the provisions and then you know when you jump you're going to be able to do something that was just qualitatively different it's going to feel different it's going to be different it's going to be a different action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4625.863,
    "end": 4651.517,
    "text": " and wasn't the point of listening to instructions to change to update to be better or to be different and then it's like by being different and following that path we become who we are like somebody said i always wanted to be skilled in this martial art so then they trained along the way to become who they wanted to be and that was them being who they wanted to be it's a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4652.754,
    "end": 4654.835,
    "text": " sort of loose associations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.915,
    "end": 4658.037,
    "text": "But again, I think we're working towards making it happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.757,
    "end": 4663.82,
    "text": "It is and it isn't though, because instructionalism, my point was that the instruction stopped.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4664.28,
    "end": 4668.783,
    "text": "I cannot give you a description of what that will look and feel like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4669.363,
    "end": 4671.304,
    "text": "So you're going to have to interact with it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4673.066,
    "end": 4675.347,
    "text": " That's, there's not, it's not a negotiable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4675.827,
    "end": 4680.95,
    "text": "If you really want to be there, you have to let go of the instructionalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4681.53,
    "end": 4683.431,
    "text": "So I don't think that's a loose association.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4683.811,
    "end": 4685.071,
    "text": "That's a non-negotiable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4685.512,
    "end": 4688.613,
    "text": "Now you may not like it and you may not go there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4688.633,
    "end": 4691.134,
    "text": "You may step back from the edge and that's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4691.394,
    "end": 4694.656,
    "text": "But don't think that I'm, or other people that are actually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4695.396,
    "end": 4706.523,
    "text": " looking at active inferences as a second eye open, won't be aware of what you're transpiring, whether you're going over or whether you're stepping back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4707.844,
    "end": 4709.545,
    "text": "That's not a loose association.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4710.666,
    "end": 4711.407,
    "text": "That's pretty clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4714.128,
    "end": 4714.549,
    "text": "Lou, any...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.138,
    "end": 4716.598,
    "text": " Thoughts on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.179,
    "end": 4725.583,
    "text": "I guess my question would be, let's just stay with this sort of like climbing the instructions to get to the space of interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.484,
    "end": 4727.684,
    "text": "What?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.984,
    "end": 4728.945,
    "text": "Yeah, Blue, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4729.64,
    "end": 4741.747,
    "text": " So it just as like climbing the instructions to get to the space of interactions, like I feel like something is there that is has to do with like the bottom up and the scaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4742.527,
    "end": 4751.612,
    "text": "Like, you know, in the systems, like we are climbing the instructions as you know, parts of a system until we get to to that space as a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.726,
    "end": 4776.514,
    "text": " the rules well it's like okay we have the ladder going up or you know staircase going up to the jumping off point you could frame that in terms of instructions go to the second step go to the third step go to the fourth step instructionism all the way i mean our interactionism all the way it's like it gives you the rule walk forward",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.679,
    "end": 4801.382,
    "text": " so you can replace on a structured ascension you can replace the sequential instructions with a rule or a pattern so that it's interactionism all the way down all the way up and that kind of relates to active as a scale free framework like bottom up from where blue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4802.346,
    "end": 4806.271,
    "text": " Are you going to start with subatomic or where is the kernel going to be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4807.193,
    "end": 4810.257,
    "text": "And maybe just interactions all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4810.277,
    "end": 4817.527,
    "text": "And then at some sufficient level, you can granularize or you can coarse grain, you can make something look as if it has instructions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.423,
    "end": 4822.524,
    "text": " So I wonder if it's like, you know, you see this loop, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4822.564,
    "end": 4825.244,
    "text": "The active inference loop, and it's like an oval like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.844,
    "end": 4829.185,
    "text": "And so I wonder if it's like, starts to be like the structure of an atom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.325,
    "end": 4831.346,
    "text": "Like, okay, there's like this oval that's this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.366,
    "end": 4838.407,
    "text": "And then I wonder if I could superimpose one going the other way, a vertical and a horizontal, like a little one of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4840.948,
    "end": 4846.249,
    "text": "So that, you know, because there's this across scales as we scale up and down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4846.857,
    "end": 4851.219,
    "text": " You know, is there a loop going between and then a loop going this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.759,
    "end": 4852.28,
    "text": "Possibly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4852.56,
    "end": 4853.02,
    "text": "Probably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.04,
    "end": 4853.62,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.64,
    "end": 4854.621,
    "text": "I think about it in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.561,
    "end": 4857.182,
    "text": "So this could be the S orbital.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.142,
    "end": 4859.523,
    "text": "This is just like a spherical one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.563,
    "end": 4865.506,
    "text": "And maybe there's other trajectories or flows that have different shapes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.71,
    "end": 4890.344,
    "text": " so dave wrote in there and anyone else in this last little bit is welcome to write a comment dave wrote in most effective military units troops are told what to accomplish not what to do so that's the difference between for me like push and pull push you know lift the bar is like it's a command about what to do versus like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4891.244,
    "end": 4893.246,
    "text": " when it's an accomplishment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4893.507,
    "end": 4897.911,
    "text": "And so it's the teleos or the end directedness that pulls the person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4898.732,
    "end": 4910.164,
    "text": "And then in that pull, there is the space to have the solenoidal flow, to walk straight towards the goal where there's a clear path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.899,
    "end": 4913.76,
    "text": " but then to be like, oh yeah, but then I'm hitting a wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4914.24,
    "end": 4916.641,
    "text": "So in order to accomplish, I do have to walk around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4917.261,
    "end": 4938.83,
    "text": "Of course, that makes sense in the context of being pulled by a goal, but that's where the instruction-based robotics always fails because anytime there's something that requires a deviation from value, you need a total second layer of the model to reintroduce curiosity or epistemic gain into the value framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4940.529,
    "end": 4958.214,
    "text": " So then it's this question, how do you balance all these second layer bolt-ons so that you can still salvage your value-driven model, even when there's aspects that are just clearly better framed within a pragmatic epistemic distinction, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.395,
    "end": 4962.936,
    "text": "Yeah, it's like solving the problem without ground truth data, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.956,
    "end": 4970.098,
    "text": "Like, so how do we, you know, if we don't know, if we've never been exposed to the system before, if it's not programmed into our robotic function,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4970.93,
    "end": 4973.852,
    "text": " You know, how do we account for that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.952,
    "end": 4978.115,
    "text": "So I think that that's where the exploration and the play a lot comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4978.695,
    "end": 4980.277,
    "text": "Or maybe tossing and turning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4980.617,
    "end": 4997.329,
    "text": "Like you want to be comfortable and then it just sort of uncoordinated behavior that's just rummaging around, searching for something in a box or all these examples where it's so, you couldn't say that that twist of your side, it was, it's not skillful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4998.169,
    "end": 5020.905,
    "text": " least for me but it's also not reward driven again you need a way second level bolt on to be explaining how the rummaging behavior is itself value driven you can say that there is a value that's pulling or you want the valuable thing in that box but that's we all agree on that we all agree that there's something valuable in the box and that search behavior is going to be required",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.966,
    "end": 5037.015,
    "text": " are we going to have a process theory that allows for exploration and then zeroing in on a goal or will we have a process theory that tries to go like well if the end is valuable then let's just back propagate value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.178,
    "end": 5043.061,
    "text": " Yeah, or if we don't know what's valuable in the box, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5043.121,
    "end": 5044.402,
    "text": "Something is valuable in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5044.422,
    "end": 5046.824,
    "text": "Like, how do we find out what is it that's valuable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5046.884,
    "end": 5052.909,
    "text": "Okay, so we implement the search function, but then exploring what is the valuable item out of, you know, 50 items in the box, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.67,
    "end": 5057.732,
    "text": "Yep, it's almost like in the simplest cases...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.254,
    "end": 5061.516,
    "text": " the value learning is defensible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.056,
    "end": 5067.901,
    "text": "When we have this hill climbing robot on a single hill, okay, but now you got a triple bottom line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5068.221,
    "end": 5074.386,
    "text": "You got the financial success, but you also have environmental and social considerations of a business.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.267,
    "end": 5087.456,
    "text": "So will you reduce all three of them to one of them or try to generate a fourth standard that you're going to reduce them all like a common currency for all of your values and rewards?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5089.013,
    "end": 5101.418,
    "text": " Or could there be a deep generative model where the organization has preferences in the financial, social and environmental realm, and then take stock of its action possibilities, not even described in the value mindset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5101.918,
    "end": 5104.659,
    "text": "Maybe every time you have a meeting, it's like square zero, what can we do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.259,
    "end": 5111.642,
    "text": "Whereas in active inference, we start with the space of policies, the affordances that the niche provides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5112.402,
    "end": 5116.044,
    "text": "And so you don't need to consider policies that cannot be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.179,
    "end": 5122.683,
    "text": " And you should reweight policies accordingly to how likely or tractable they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5123.224,
    "end": 5143.639,
    "text": "So there's just so many ways that we see that the mathematical framings get expanded on through relaxation of some of their attributes, just like Frist in 2011 wrote, which is that optimal control can be cast as active inference with three simplifications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.575,
    "end": 5163.326,
    "text": " And then he walked through those, which we discussed a little bit last time, but this is kind of cool how we're building out some differences between the motor control approaches that have been used in the past and active inference as a process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5163.466,
    "end": 5171.531,
    "text": "And then the way that that encompasses what we've seen before, and then maybe also opens up the discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5172.992,
    "end": 5175.434,
    "text": " into just areas that weren't even considered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.474,
    "end": 5179.036,
    "text": "Like we can add in affordances plus preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5184.14,
    "end": 5193.486,
    "text": "I think that embodied skillful and active inference implies a huge leap of faith back to that jumping off the, because it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5193.506,
    "end": 5199.251,
    "text": "And I mean, that's not, that's a, that's a cliche that people can probably appreciate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5200.431,
    "end": 5202.673,
    "text": "What do you think the trust or faith is in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5203.499,
    "end": 5205.18,
    "text": " Yeah, that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5206.02,
    "end": 5206.4,
    "text": "Yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5206.88,
    "end": 5207.8,
    "text": "Yourself, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5209.061,
    "end": 5209.721,
    "text": "Or lack thereof.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5212.002,
    "end": 5214.082,
    "text": "Act or act not, there is no infer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5216.083,
    "end": 5217.023,
    "text": "No, there is, there is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5220.224,
    "end": 5222.785,
    "text": "So it's interesting, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5222.885,
    "end": 5231.348,
    "text": "How can we distill the similarities and differences so that when we see one of those limitations,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5232.501,
    "end": 5250.846,
    "text": " being like okay we had um uh curiosity slash pragmatic plus semistemic so that when we see a sort of here's the new hack on value we can see that as a saddle point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.588,
    "end": 5261.435,
    "text": " for where that model could move towards an active inference framing just by kind of rewiring some of the modules that it has.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.579,
    "end": 5267.821,
    "text": "Here's a great question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5268.321,
    "end": 5276.148,
    "text": "Bill wrote, would a priority parameter according to depletion levels of different resources be applicable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.885,
    "end": 5282.266,
    "text": " Yeah, that's back to the pools thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5282.286,
    "end": 5283.267,
    "text": "Yeah, I would say yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5286.39,
    "end": 5286.691,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.712,
    "end": 5292.697,
    "text": "Dean with the pools, here would be my thought from the multi-scale decision making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5294.25,
    "end": 5316.246,
    "text": " just think about a bee colony the resources that they need to forage for include like pollen which has a lot of protein and fat and it's helpful for the developing larva then nectar which is like high octane gasoline a lot of carbs good for the adults um and then depending on the environment they might need like water or salt or other different resources",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5317.19,
    "end": 5323.172,
    "text": " So the depletion of, there might be an imbalance of the nutrients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5323.612,
    "end": 5328.334,
    "text": "And you can think about that similarly for an organism, like rabbit starvation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.454,
    "end": 5334.116,
    "text": "When you only eat protein, your body will enter starvation mode because other fats and stuff are needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5335.157,
    "end": 5338.358,
    "text": "So definitely multiple resources are being balanced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5338.518,
    "end": 5345.501,
    "text": "And part of the challenge of decision-making under uncertainty, just as we've been getting at, is that there's not just one kind of outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.243,
    "end": 5348.444,
    "text": " Like it's enough to be uncertain about value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5349.245,
    "end": 5368.355,
    "text": "But now when we're thinking about these multi-dimensional resource landscapes, whether it's just protein versus carbs, or whether it's a lot more nuanced, like the triple bottom line, we really do need a principled way of talking about the relative depletion of different resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.915,
    "end": 5371.717,
    "text": "So in the bee colony case,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.677,
    "end": 5394.788,
    "text": " selection has shaped nest mates so that they use the rate and the type of interactions they have in order to update their nestmate level behavior so i'm having a lot of interactions with hungry larvae maybe we need more pollen i'm having a lot of interactions with food reservoirs maybe that can slow me down because we probably have enough um forage for now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5395.868,
    "end": 5418.305,
    "text": " so colonies that don't consist of nest mates with that productive way of interpreting their interactions not instructions those colonies are swept off the table and so we end up seeing distributed systems succeed where they act as if there is a correct prioritization amidst uncertainty of different kinds of resources",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5419.526,
    "end": 5444.189,
    "text": " and then if we use active inference instrumentally in the deep generative model of the body's nutrient ratios or the colony's relative balance between protein and carbs then it's as if there is a priority parameter where when something is depleted it's the one that's prioritized but we don't need that expressively in the model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5445.205,
    "end": 5470.868,
    "text": " we can have a multi-dimensional generative model of different resources, and then actions will be selected according to their expected free energy being minimized, almost going along the curve that takes us on that edge of explore and exploit from wherever we are in that resource depletion landscape towards our preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5473.752,
    "end": 5502.067,
    "text": " would be totally open to hearing other explanations or maybe there is a priority parameter that can come into play but one sort of longish response would be organisms do act adaptively to prioritize depleted resources but that doesn't mean that there needs to be a parameter in our model that explicitly prioritizes specific resources it's enough just to have a preference vector that includes multiple types of resources blue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5504.266,
    "end": 5508.668,
    "text": " No, I think that that's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.848,
    "end": 5514.711,
    "text": "So you can make it as simple or complicated as you want, but I always think less parameters in the model is better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5514.731,
    "end": 5524.356,
    "text": "It just makes me think, how do we get those preferences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5525.276,
    "end": 5530.279,
    "text": "And then what happens when the niche changes so that preferences that were adaptive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5531.26,
    "end": 5537.268,
    "text": " like to act as if prioritization of sugar and salt over all other preferences, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5538.709,
    "end": 5541.453,
    "text": "What happens when the situation changes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5541.893,
    "end": 5547.04,
    "text": "So how do we integrate high precision priors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5548.05,
    "end": 5576.785,
    "text": " with highly accurate sensory input that's something we've talked about before how do we get the best of both worlds with being able to like fly blind because we have a deep generative model but then also when there is sensory input that requires a categorical shift in cognitive model for example we want to have the fluidity to do that and we don't want to be wasting our time in one mode when",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5578.669,
    "end": 5579.432,
    "text": " It's the wrong mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5579.472,
    "end": 5584.992,
    "text": "We don't want to be hard when hardness is a flaw or be soft when softness is a flaw.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5587.005,
    "end": 5596.534,
    "text": " So I wonder if there's, like, you know, I mean, for organisms like bees and birds, like, there's some programmed... I mean, things are shifting all the time, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.595,
    "end": 5603.421,
    "text": "Like, there's, you know, a huge amount of, like, migratory stuff that comes into play and hibernating and all these things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5605.083,
    "end": 5609.567,
    "text": "And so, like, for us, like, we notice that prioritized, like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5610.388,
    "end": 5631.794,
    "text": " shift like i need water right now right like you know if we're suddenly like parched right like the need for water is overwhelming but there's not this like because we have offloaded so much of our needs into our niche like the need for to stay warm or whatever we build houses we wear clothes so we've offloaded a lot of this stuff so i i wonder if it's like um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5633.055,
    "end": 5636.457,
    "text": " the instinct becomes less instinctual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.477,
    "end": 5650.266,
    "text": "I wonder if that happens, like the instinct to sequester food or fly south for the winter or these types of things, just because we've just offloaded our need to do those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.326,
    "end": 5653.788,
    "text": "So it just becomes, I don't know, there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5655.103,
    "end": 5657.985,
    "text": " I think that's another distinction here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5658.525,
    "end": 5665.69,
    "text": "Here we can include extended slash embedded 4Es, 7Es, 11Es, however many there are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5667.171,
    "end": 5672.975,
    "text": "We can at least frame those situations in terms of niche modification or niche construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.075,
    "end": 5675.096,
    "text": "Where is that in motor control?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.777,
    "end": 5676.357,
    "text": "It's nowhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5676.597,
    "end": 5678.859,
    "text": "Where's the golf club with a squishy handle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5679.858,
    "end": 5686.466,
    "text": " that is being interacted with as an instrument, we don't have those nice interfaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5687.047,
    "end": 5698.46,
    "text": "Whereas Active Inference has excellent interfaces quantitatively and qualitatively for being enriched by pieces that are, as Dean would say, maybe non-negotiable for the actual creature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5699.241,
    "end": 5703.304,
    "text": " but it'd be totally ad hoc, where would you put the instrumentation in here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5703.424,
    "end": 5704.404,
    "text": "Is it a state estimator?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5704.684,
    "end": 5706.325,
    "text": "Should I be estimating where my golf club is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5706.886,
    "end": 5711.969,
    "text": "Or is it enough just to estimate my hands and the angle of the hands and then do another second level prediction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5712.709,
    "end": 5713.61,
    "text": "Not quite clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5713.67,
    "end": 5715.751,
    "text": "You could probably implement it multiple ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.552,
    "end": 5718.993,
    "text": "And here's another nice comment from Dave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.794,
    "end": 5724.417,
    "text": "So Dave said, the term in cybernetics, so it's always good to connect back to related areas,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5725.711,
    "end": 5728.955,
    "text": " for putting drives into a model is algodonic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5729.496,
    "end": 5731.318,
    "text": "So here's the definition of algodonic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5731.338,
    "end": 5736.285,
    "text": "It comes from, I guess, algos meaning pain and hedon meaning pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5736.905,
    "end": 5738.167,
    "text": "Sorry, Dave, for the mispronunciation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5739.204,
    "end": 5764.459,
    "text": " um putting multiple algodonic drives like pains and pleasures may yield complex instructive behaviors but there are so many advantages in having a model i think active inference so sophisticated that it generates its drives the drives come out of the model rather than being put in so yes and he wrote then clarifying i mean the innumerable drives emerge from the model's internal dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5765.382,
    "end": 5773.323,
    "text": " If your robot is spontaneously curious, spontaneously attends to events or responsive externals, it's as if it has a curiosity parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5773.924,
    "end": 5774.424,
    "text": "So it's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.504,
    "end": 5782.185,
    "text": "Maybe we could even write like drives, quote, you know, as if... I'm going to take Shakespeare.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5782.205,
    "end": 5782.885,
    "text": "Thanks, Hamlet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5784.005,
    "end": 5785.346,
    "text": "You are a great prince.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5786.126,
    "end": 5788.826,
    "text": "Drives... Drives emerge from model...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5794.275,
    "end": 5796.056,
    "text": " don't need to be put in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5798.638,
    "end": 5809.084,
    "text": "Instead of maybe the rabbit being put in the hat, this is like the rabbits emerge from the hat if you put in enough hydrogen and enough time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5809.104,
    "end": 5816.008,
    "text": "That's interesting to think about where cybernetic models come into play here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5817.308,
    "end": 5820.03,
    "text": "Let's give just a few final minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5820.11,
    "end": 5821.771,
    "text": "Any final questions in the chat?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5824.111,
    "end": 5850.613,
    "text": " and thanks of course to dave and to phil for the great questions we can just think about um maybe dot one dean is um being on the edge dot zero is climbing and so it's a two-directional trail you know there's people going up to half dome and there's people coming down so dot zero is two-directional",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.789,
    "end": 5865.414,
    "text": " Highway, lots of on-ramps and off-ramps, but we try to make the topics accessible for those who are not in the Active Inference game, but they're familiar with related topics like the keywords usually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5865.434,
    "end": 5872.577,
    "text": "And in the .zero, we're going to go from bridging the keywords and the topics of broader concern to Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5873.317,
    "end": 5875.379,
    "text": " So that's the onRamp to Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.899,
    "end": 5893.733,
    "text": "But then also for those who are already in the Active Inference mode of learning by doing and working, then it's their window out to like, oh, wow, this idea that I had been working on Active Inference in one context, it's also applying outwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5894.233,
    "end": 5894.734,
    "text": "So that's in the .0.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5894.874,
    "end": 5896.175,
    "text": ".1, whoever and whenever it is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5900.738,
    "end": 5928.824,
    "text": " uh we are in the the bathtub face the part between the bookends that's we're at the edge and we can look back to the dot zero and see again recapping the the steps that we took but also we want to start looking out and then i don't know where dot two would be but dot two is when we sort of take the next step and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5930.763,
    "end": 5932.324,
    "text": " The dot two is the no going back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5932.964,
    "end": 5941.686,
    "text": "I mean, I can add a twist to the fact that I'm going to be hitting the water soon, and that's a skillful embodied movement, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5942.307,
    "end": 5951.429,
    "text": "We actually watch people that do the 10-meter platform and can add quite a few things before they hit the water and regain control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5951.489,
    "end": 5959.712,
    "text": "But I think this is what interactionism is versus instructionalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5961.104,
    "end": 5965.607,
    "text": " I mean, the way that this is set up, the 0-1-2, is interactionism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5965.647,
    "end": 5971.712,
    "text": "It's more about this than it is about bidirectionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5971.732,
    "end": 5975.174,
    "text": "And I think you talked about that at the beginning of today's episode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5977.076,
    "end": 5988.764,
    "text": "Right, we have a structure that we hold to, a rail that we could modify as well, but we hold to the rail so that we don't have to frame it like instructions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5990.052,
    "end": 6012.327,
    "text": " um we weren't instructed to do this and i don't know i hope that people don't feel like these are instructions but rather interactions or engagements with them and then just like so many other things that we're seeing online the new technological affordances allow it to actually be an interaction we actually can have people asking questions live",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6013.447,
    "end": 6015.569,
    "text": " being a part of the conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6016.369,
    "end": 6030.119,
    "text": "Whereas if it were just recording a video and releasing it or making a book and releasing it, it'd be hard to break out of the instructionist frame because the deliverable would be static and very unidirectional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6031.38,
    "end": 6039.987,
    "text": "Here, we have a different affordance that helps us break out of that frame basically for free because even if instructions are being conveyed on the live stream,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6042.222,
    "end": 6050.926,
    "text": " it would still be within an interaction of participants, of individual and collective and of the community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6051.686,
    "end": 6054.387,
    "text": "So any final thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6056.215,
    "end": 6077.763,
    "text": " on one no fun times thanks both of you for the the dot zero and dot one fun we've had a few hours to think about it but you know the paper is the distillation of many more hours so there's always value dare i say and going back and playing with it because it's fun",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6078.903,
    "end": 6090.289,
    "text": " and it's just yep they're great topics to be considering about and learning so cool thanks everyone for watching thanks dean and blue and we'll see you next week for 23.2 thanks guys bye",
    "speaker": "SPEAKER_01"
  }
]