[
  {
    "start": 23.712,
    "end": 23.972,
    "text": " All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 24.632,
    "end": 29.033,
    "text": "Hello and welcome everyone to ACT-INF Lab live stream number 38.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 29.394,
    "end": 33.595,
    "text": "It's February 16th, 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 35.695,
    "end": 37.016,
    "text": "Welcome to the ACT-INF Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.676,
    "end": 43.477,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 43.857,
    "end": 45.738,
    "text": "You can find us at the links on this slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 47.118,
    "end": 49.479,
    "text": "This is a recorded and an archived live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 50.019,
    "end": 52.8,
    "text": "So please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 53.82,
    "end": 78.688,
    "text": " all backgrounds and perspectives are welcome and we'll be following video etiquette for live stream just release an unending torrent of emojis if you have to speak or just raise your hand i'm sure that we'll get to it if you're watching live please feel free to write questions in the live chat and we'll have enough time to hang out and discuss during this dot one where we'll be opening into the paper",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 80.219,
    "end": 86.949,
    "text": " Check out ActiveInference.org for updated information on participating in any of the lab's activities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 88.371,
    "end": 90.354,
    "text": "I hope you'll find something that resonates with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 92.417,
    "end": 93.559,
    "text": "Today in ACT-INF,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 94.522,
    "end": 95.763,
    "text": " Livestream number 38.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.303,
    "end": 110.351,
    "text": "We're going to be learning and discussing this cool paper, The Evolution of Brain Architectures for Predictive Coding and Active Inference by Pizzulo, Parr, and Friston from December of 2021.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 112.192,
    "end": 122.059,
    "text": " And we're just going to enjoy discussing it and opening up any ideas or questions that us here on the panel have or those who are live chatting us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.08,
    "end": 127.604,
    "text": "And we have some ideas and thoughts prepared, a few things that we know that we can go into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 128.064,
    "end": 138.492,
    "text": "And also, I hope that everyone has brought some other prepared seeds and also, of course, spontaneously feeling like new things are arising.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 139.332,
    "end": 141.893,
    "text": " So we'll just start with some introduction and warmup.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 142.153,
    "end": 151.976,
    "text": "We can each say hi, and then maybe it'd be cool to just also mention like what got you excited about the paper or what made you want to discuss this paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.596,
    "end": 154.437,
    "text": "What's something that stayed with you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 155.297,
    "end": 156.638,
    "text": " So I'm Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 156.878,
    "end": 163.284,
    "text": "I'm a researcher in California, and I was very excited by the evolutionary focus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 164.104,
    "end": 169.149,
    "text": "A lot of my research over the last years has been in evolution and ecology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.529,
    "end": 178.316,
    "text": "So it's always awesome to see how people are thinking about how active inference, free energy principle, and evolutionary studies can all be learning from one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 178.977,
    "end": 180.398,
    "text": "And I'll pass to Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 182.008,
    "end": 183.249,
    "text": " Hello, I'm Stephen Sillett.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.309,
    "end": 184.269,
    "text": "I'm in Toronto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.69,
    "end": 193.055,
    "text": "I'm really interested in how this paper connects to my work with spatial meaning making and social topographies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.095,
    "end": 206.623,
    "text": "Because this paper talks about a more biological, nascent stage of development, rather than some higher order meaning that often people think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.663,
    "end": 207.123,
    "text": "And I'm really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.061,
    "end": 221.07,
    "text": " interested in how this sort of grounded, bottom-up, inactive ecological approaches can be thought about as something where we can actually ground a lot of our meaning making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.771,
    "end": 225.593,
    "text": "So I'm interested in how this might match with some of that thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.833,
    "end": 227.595,
    "text": "And I will pass this over to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.218,
    "end": 231.259,
    "text": " I'm in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.92,
    "end": 238.81,
    "text": "What I found interesting about the paper is that given that I've worked with a lot of young learners for a lot of my life, I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.135,
    "end": 257.783,
    "text": " It was really interesting to see how this affirmed a lot of the thinking that I was doing when I was trying to get people past the idea that science is only about the biology and the chemistry and the physics, that there is a statistical and predictive component to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.384,
    "end": 267.208,
    "text": "And those relationships in that realm can build certain sense of what the underlying architecture is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.728,
    "end": 268.509,
    "text": "So as I said,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.15,
    "end": 280.818,
    "text": " A lot of this is affirmations, and it's kind of seen as being not part of what is typically addressed as core learning, but I think it should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.379,
    "end": 281.999,
    "text": "Back to you, Dan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.381,
    "end": 283.681,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 283.961,
    "end": 284.822,
    "text": "Nice intro.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 285.042,
    "end": 288.104,
    "text": "Let's just start with a big question, and then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.133,
    "end": 298.935,
    "text": " Either of you have any reflections on the big question, or we'll go over to blank slide and just bring up some questions we have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 299.676,
    "end": 306.497,
    "text": "And also it might be good to go over just some of the key points in the paper, like what did they actually do in terms of their contribution?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 307.197,
    "end": 312.739,
    "text": "So the big question, or at least one way to phrase something that might bring someone to approach this paper,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.059,
    "end": 318.083,
    "text": " What is the evolutionary neurophysiological basis of cognition?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 318.744,
    "end": 321.667,
    "text": "And how do complex cognitive phenotypes arise?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 322.167,
    "end": 325.291,
    "text": "Like you don't go from zero to colony in one time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 325.891,
    "end": 335.081,
    "text": "How does it happen that evolution arises from precursor, sometimes simpler, but also sometimes more complicated, precursors?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 336.454,
    "end": 342.159,
    "text": " Stephen mentioned like, what is the basis for sense-making and cognition and sense-making are very related.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 343.06,
    "end": 351.067,
    "text": "And what's been fun over these last weeks and months is we've explored basic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 352.0,
    "end": 356.263,
    "text": " or simple or reduced or basal cognition from a variety of perspectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.643,
    "end": 363.447,
    "text": "Like we talked about the bioelectric components of thinking about basal cognition with Mike Levin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.027,
    "end": 371.432,
    "text": "Now we're thinking about a slightly different approach to understanding basal cognition, which we'll be discussing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 372.212,
    "end": 381.618,
    "text": "And then also we've looked at some of these more complex cognitive phenotypes like mental action, counterfactuals, deep",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 382.321,
    "end": 409.604,
    "text": " temporal inference all the abductive logic which we'll get into probably later um how can we use integrative models of perception cognition action and impact like active inference to study this whole continuum and diversity of relatively simpler in our perspective cognition and also relatively more complex cognitive phenotypes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 410.666,
    "end": 411.687,
    "text": " and everything in between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 412.268,
    "end": 414.55,
    "text": "So yes, Stephen, and then on with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.351,
    "end": 416.852,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.872,
    "end": 422.977,
    "text": "Yeah, I mean, I suppose also what some of the paradigm impacts of that, of taking that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.045,
    "end": 424.885,
    "text": " all the way through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.905,
    "end": 447.573,
    "text": "And one question that might come up, which you may or may not have an answer to or thoughts on, but, you know, Mike Levin's work with the teleological cones at the different nested levels, and how this sort of could be thinking about what kind of action control potential",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.28,
    "end": 451.581,
    "text": " you know, in these different nested levels might exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.341,
    "end": 459.042,
    "text": "I would be interested to think about how this may either be able to connect to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.062,
    "end": 465.844,
    "text": "I can see it connecting philosophically or whether there's another bridge needed between this modeling and that type of modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.124,
    "end": 467.264,
    "text": "So just something I've mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.965,
    "end": 472.225,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 475.643,
    "end": 476.724,
    "text": " Dean, anything to add?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 476.744,
    "end": 481.147,
    "text": "I'm going to wait until you get to figure one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.867,
    "end": 482.147,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 483.648,
    "end": 489.132,
    "text": "So we won't go through all of the finer points in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 489.192,
    "end": 491.654,
    "text": "That's for the reading of the paper itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 492.555,
    "end": 498.699,
    "text": "Nor will we even go over all of the overview, which is what the .0 video, 38.0, is for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 499.279,
    "end": 503.942,
    "text": "So, you know, turn back time and watch that one if you haven't, or pause the video if you're not watching it live.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 504.563,
    "end": 504.683,
    "text": "But",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 505.953,
    "end": 521.17,
    "text": " What this paper does, as evidenced by their roadmap, is introduce a few basic principles of cognition, predictive regulation and control, and then also structure learning in generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 522.031,
    "end": 525.334,
    "text": "That's not how every neurophysiology text is gonna begin",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 526.548,
    "end": 552.487,
    "text": " building blocks of cognition it's not how every evolutionary neurophysiology text is going to be framing cognition but that's what they do here and that will play into how it's similar and different than other approaches then with those building blocks in hand or on the floor they provide three examples of motifs that ancestral brains may be modeled as having or may have actually had",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 553.868,
    "end": 563.776,
    "text": " With those three examples in hand, it's then possible for them to state a more general way of thinking about the transitions amongst different structures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 564.756,
    "end": 569.54,
    "text": "These structures represent brain design as structure learning in generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 570.381,
    "end": 580.809,
    "text": "That is called an evolutionary algebra, and they introduce five operators that can basically either leave unchanged or change",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 582.128,
    "end": 586.43,
    "text": " the structure of brain design with respect to generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 587.631,
    "end": 595.175,
    "text": "And each of those are explored in terms of what are the architectural changes that that evolutionary transition is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 596.256,
    "end": 600.098,
    "text": "And then what are the functional consequences of that kind of an evolutionary transition?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 601.867,
    "end": 612.673,
    "text": " Then they have some discussions about how sequences or patterns of application of this evolutionary algebra could lead to different evolutionary phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.233,
    "end": 620.036,
    "text": "So, for example, increasing temporal depth in the future means that models are increasingly prospective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 620.757,
    "end": 624.298,
    "text": "Increasing temporal depth in the past is like memory, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 625.379,
    "end": 642.487,
    "text": " And then they close with mapping to a phylogenetic tree and thinking about that evolutionary algebra of state transitions being mapped onto the bifurcating tree structure that's called a phylogenetic tree, which shows the relatedness of different life forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 645.969,
    "end": 646.609,
    "text": "That's the roadmap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 647.41,
    "end": 649.691,
    "text": "Let's go to the long awaited figure one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 650.902,
    "end": 653.984,
    "text": " and talk about the action perception cycle and predictive regulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 654.504,
    "end": 665.89,
    "text": "And so they're, again, discussing this in the context of predictive regulation, anticipatory regulation, cybernetics, and control as a basic design principle for the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 666.59,
    "end": 670.332,
    "text": "So Dean, what do you see here or what would be cool to think about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 672.705,
    "end": 678.95,
    "text": " So what this follows, I think, is the usual pattern when we're trying to explain where we're going to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.851,
    "end": 681.412,
    "text": "And so you just had a roadmap up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.472,
    "end": 687.117,
    "text": "And I think a roadmap is a way for the people who are reading the roadmap to find their way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.178,
    "end": 694.063,
    "text": "But I think what this diagram shows is that in the middle of there, there's something called a discrepancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 694.903,
    "end": 697.625,
    "text": "And that discrepancy is later going to be given a label Y. And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.406,
    "end": 707.088,
    "text": " What I think is really interesting here is there's a flip potentially that can happen here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.649,
    "end": 715.313,
    "text": "That discrepancy is where what I would describe as a rule factory and rule in the sense that we find pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.813,
    "end": 722.056,
    "text": "That's kind of our place where, as it says, the prediction and the observation come together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.696,
    "end": 726.839,
    "text": "And I believe that that's different than a roadmap, which is find your way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.179,
    "end": 730.16,
    "text": "I believe that that discrepancy or that rule factory is wayfinding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.7,
    "end": 731.081,
    "text": "And I think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.19,
    "end": 750.454,
    "text": " What we have the potential to do with this paper because of the way that they have sort of presented the information is the words eventually become explicated rules, which then become action in the phenomenological space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.929,
    "end": 761.332,
    "text": " That's where it gets really, really interesting because I think most of the time when people look at things as a subject, they've taken the world and they've collapsed down to words and diagrams and models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.892,
    "end": 771.296,
    "text": "What this potentially allows us to do is flip that and move from the words back out into the space with a little bit more confidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.336,
    "end": 780.019,
    "text": "So yeah, that's why I wanted to kind of start here because I think the word discrepancy, it's the first time I've seen it in this kind of figure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.198,
    "end": 791.933,
    "text": " model and i really like it cool yeah it makes me think about uh setting off on the road trip on the mental actions that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 792.918,
    "end": 813.695,
    "text": " reflect the paper and there's the roadmap which is super informative but it is like instructionalism it's saying you're going to go two streets and then take a left turn at the stop sign and then when this happens then you'll do that and if you've seen this then you've gone too far kind of classic instruction type sequences",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 814.756,
    "end": 825.058,
    "text": " Here we have a figuring out because it's visually arranged with some local connectivity that's suggestive of a causal connection through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 825.598,
    "end": 830.739,
    "text": "But by no means is there only one way to read this simultaneous figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 831.659,
    "end": 839.681,
    "text": "And so that allows potentially for more of a figuring out, including a figuring out of rules.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 841.243,
    "end": 845.245,
    "text": " Yes, it is indeed a little different with discrepancy at the intersection here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.365,
    "end": 845.625,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 847.246,
    "end": 855.551,
    "text": "Yeah, so this ties in with the lower bound evidence control approach of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.251,
    "end": 865.517,
    "text": "So, you know, the idea is that action is what we can tractably approximate and perception is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.119,
    "end": 882.842,
    "text": " something that we can access but can't, and we can try to make more sense of, but is a harder piece of the equation to get a handle on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.122,
    "end": 895.224,
    "text": "So I'm wondering if that's... I mean, how do you feel about that declaration in terms of its use across other areas of applied active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.304,
    "end": 895.864,
    "text": "I think it's a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.829,
    "end": 902.033,
    "text": " it could make things a little bit more digestible for a number of contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.053,
    "end": 909.278,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 910.472,
    "end": 927.821,
    "text": " Thinking about this in the context of recognizing that it's different than other action perception loops that we've seen, which is just really important to keep in mind that we're not perceiving something that we're projecting too much because other times the outgoing arrow from the entity is what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 928.681,
    "end": 940.331,
    "text": " If this were a Markov blanket type diagram, which they often are, the outgoing arrow would reflect active states and then the statistical dependencies that are outgoing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 941.212,
    "end": 942.293,
    "text": "But where is action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 943.174,
    "end": 944.055,
    "text": "It's on the bottom right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.156,
    "end": 949.72,
    "text": "So let's really try to understand why the pieces are placed this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 951.021,
    "end": 955.104,
    "text": "The outgoing feature of the cognitive entity is the prediction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 956.192,
    "end": 957.813,
    "text": " And here's observation coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 958.373,
    "end": 966.638,
    "text": "If this were a Markov blanket diagram, we'd have the world and then the incoming statistical arrow would be the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 967.119,
    "end": 968.259,
    "text": "That would be the sensory states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 969.54,
    "end": 977.265,
    "text": "So here it's the outgoing prediction of the entity and the incoming sensory data or observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 978.046,
    "end": 984.99,
    "text": "Those two are being differentiated to form a discrepancy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 986.343,
    "end": 998.933,
    "text": " which is just a qualitative term, but it could be then brought a little bit more formally into a prediction error or a little bit even beyond that into like a free energy differential.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1000.514,
    "end": 1005.518,
    "text": "This discrepancy has two arrows coming out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1006.699,
    "end": 1013.184,
    "text": "From the discrepancy is arising perception and the changing of beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1014.482,
    "end": 1016.424,
    "text": " Does perception always involve changing beliefs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1017.765,
    "end": 1020.787,
    "text": "And discrepancy is also giving rise to action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1021.728,
    "end": 1030.354,
    "text": "So what kind of a thing is discrepancy such that the inputs are prediction and observation and the outputs are perception and action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.835,
    "end": 1038.14,
    "text": "So at the very least, this is not the Bayesian graph representations that we've seen before or that we'll see",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1039.375,
    "end": 1046.551,
    "text": " in just a few slides with a more traditional interpretation of nodes as random variables and edges as statistical dependencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1047.292,
    "end": 1049.216,
    "text": "This is a little bit more like a thought map",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.72,
    "end": 1076.602,
    "text": " that then connects to the variational free energy equation which we talked about in number 37 a lot more but just to recall there's the red and the blue lines these two different components of the variational free energy and those are shown again here so check out 37 to learn more about the red and the blue and about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1077.577,
    "end": 1101.132,
    "text": " variational and expected free energy but for here we're starting with this action prediction discrepancy motif and then connecting it to perception and action as variational free energy minimization steven i think one thing that's useful with this um more nascent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1102.208,
    "end": 1108.091,
    "text": " representation is discrepancy can go in different directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.131,
    "end": 1111.753,
    "text": "So it can be discrepancy in terms of temporal occurrence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.634,
    "end": 1114.995,
    "text": "When was the prediction predicted to happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.775,
    "end": 1116.756,
    "text": "When was it observed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.816,
    "end": 1118.597,
    "text": "But it could also be what kind of prediction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.646,
    "end": 1126.348,
    "text": " and what kind of observation, or whereabouts was the prediction, whereabouts was the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.368,
    "end": 1129.449,
    "text": "There's many different, and at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.829,
    "end": 1146.974,
    "text": "So there may be that at the kind of lower levels, there's quite a big jump between when I predict the baseball coming to my hand, when that prediction was made, when that observation occurs,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.205,
    "end": 1160.89,
    "text": " And also when that is chained up at different, slower, bigger steps of the nested Markov blanket sort of sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.95,
    "end": 1169.173,
    "text": "So this idea of discrepancy is, I suppose, is probably the biggest bucket they could find, I would imagine, at that spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.373,
    "end": 1171.014,
    "text": "And that may be partly why it's there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.403,
    "end": 1191.8,
    "text": " i just add to that stephen i think one of the things that's interesting is especially after just doing the 37 paper where we were talking about guides to me the timing of this was absolutely immaculate because now all of a sudden we've gone from guiding to almost taking potentially a referee's position",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1192.702,
    "end": 1198.227,
    "text": " on the world, which is a whole different thing than taking up the position of being a guide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.068,
    "end": 1201.43,
    "text": "And that was, I mean, that's not nuanced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.49,
    "end": 1202.331,
    "text": "That's not subtle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.911,
    "end": 1204.593,
    "text": "That's quite an identity shift.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.633,
    "end": 1209.597,
    "text": "And we're going to actually get into identity when we look at some of the evolutionary steps later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.877,
    "end": 1215.903,
    "text": "But I wanted to slow down on this because I thought that's not a minor change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.991,
    "end": 1218.631,
    "text": " That's a whole different perspective shift.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.911,
    "end": 1223.413,
    "text": "And I think we need to really make note of that because I think it colors a lot of what's to follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.893,
    "end": 1229.614,
    "text": "What makes you say that we're a referee in this situation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1230.414,
    "end": 1231.174,
    "text": "Discrepancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.475,
    "end": 1237.496,
    "text": "There's a difference between what the world is telling us and then how we rule on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.236,
    "end": 1241.537,
    "text": "So think of any game where you get into an argument with the refs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.093,
    "end": 1244.693,
    "text": " Are they wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1245.233,
    "end": 1245.793,
    "text": "Are you wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1246.134,
    "end": 1246.954,
    "text": "It doesn't really matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1247.014,
    "end": 1248.474,
    "text": "The point is that there's a difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.374,
    "end": 1253.876,
    "text": "That's when you said differential graphing is maybe one of the ways to be able to make that explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.836,
    "end": 1262.098,
    "text": "But that's not how it's typically framed out when we're talking about Bayesian or Markovian stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.972,
    "end": 1265.415,
    "text": " So I think this is a big move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.076,
    "end": 1279.411,
    "text": "I know it might seem like a tiny one, but I think as we go, again, as we go deeper into this paper, it affirms a lot of the stuff that I actually saw when you're trying to go out there and forage and figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.152,
    "end": 1282.195,
    "text": "So I'm excited to keep going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.035,
    "end": 1297.78,
    "text": " Yeah, it could be like the observation, the baseball player is running towards the base and the coach is observing and there's this ongoing prediction and observation with no discrepancy because part of the generative model includes the person moving through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1298.601,
    "end": 1298.881,
    "text": "And then,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1300.39,
    "end": 1312.642,
    "text": " Given the observation and the generative model, the coach predicts slash expects and prefers, which we'll come to again later with the three Ps, that the baseball player is safe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1312.862,
    "end": 1322.712,
    "text": "You rarely see super animated refusals when a call has gone towards somebody, but it's when it has gone against, it's violated their fitness, that there's a discrepancy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.181,
    "end": 1332.627,
    "text": " with what the referee has called and what the interested coach has called, and that is going to lead to some consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1333.287,
    "end": 1337.93,
    "text": "And again, we're still not at the Bayesian graph level, but that's going to be the next figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1338.37,
    "end": 1338.631,
    "text": "Steven?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.392,
    "end": 1344.554,
    "text": "This can then build on...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.56,
    "end": 1349.024,
    "text": " the idea of what's cognitive, what can you have a perspective on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.044,
    "end": 1363.5,
    "text": "So I think what you're saying there with this referee position is as well as the kind of the swarming dynamics and the kind of inactive processes, much of which is beyond our ability to sense or integrate,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.412,
    "end": 1386.008,
    "text": " what is it once it starts to hit what's the big bucket at the kind of cognition level that still isn't too much of a of an inflation so in this case here discrepancy there is a sense of being able to distinguish perception and action at some level and find a discrepancy which in some ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.311,
    "end": 1394.232,
    "text": " I would imagine covers a lot of what cognition would require to be thought of in a cognition way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.093,
    "end": 1407.175,
    "text": "Other types of action, for instance, how we heal or grow, maybe action and perception won't be so separated, but this is trying to come at the idea of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.195,
    "end": 1410.636,
    "text": "So maybe that also informs this process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.142,
    "end": 1419.244,
    "text": " Cool, so section two, again, was just about the two concepts of predictive regulation and control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1419.884,
    "end": 1424.805,
    "text": "That's what we saw here, predictive and control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.145,
    "end": 1428.226,
    "text": "So it's just conceptually laid out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1429.526,
    "end": 1436.948,
    "text": "In figure two, they formalized brain design as structured learning in generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1438.001,
    "end": 1440.282,
    "text": " So here we have a different figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1441.222,
    "end": 1448.525,
    "text": "We still have the cognitive entity and the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1449.486,
    "end": 1458.569,
    "text": "We add in one layer of absolutely essential active terms, which is generative model, generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1459.269,
    "end": 1462.911,
    "text": "The generative model is the cognitive entity's model of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1464.91,
    "end": 1486.624,
    "text": " generative process is the underlying phenomena that gives rise to observations it's the difference between the cognitive model of vision a generative model of vision and the generative process of visual input which is like photons and the sun and all of that so these are very different they're complementary",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1487.489,
    "end": 1499.718,
    "text": " but just so that we're really clear going forward that we're going to be using those in their specific sense, not using them like, oh, well, it's a generative model because this is a model of cognition that makes me excited and think of ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1500.179,
    "end": 1502.641,
    "text": "That's not how we're using generative model here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1502.921,
    "end": 1504.122,
    "text": "So just to be clear on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1505.171,
    "end": 1529.689,
    "text": " Now we see action as changing the world represented by you, and the cognition involves partially action selection, policy selection, planning as inference, but not going to all those details yet, which can have some influence on actual unobserved hidden states of the world, X star.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1531.491,
    "end": 1553.588,
    "text": " x is the cognitive model of that hidden state of the world that is being inferred and y is the observation that then feeds back into the cognitive model so that's what these nodes mean it's about partitioning the cognitive model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1555.421,
    "end": 1556.501,
    "text": " from the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.242,
    "end": 1572.668,
    "text": "Separating the generative model from the generative process, and we're starting to see the traditional blanket form with observations having incoming statistical dependencies and actions having outgoing statistical dependencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1574.109,
    "end": 1576.35,
    "text": "What else do either of you see in this model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.29,
    "end": 1578.63,
    "text": "Yeah, Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1579.891,
    "end": 1580.111,
    "text": "Let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1583.203,
    "end": 1585.385,
    "text": " Let's go back to being a referee for a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.587,
    "end": 1588.349,
    "text": "The assumption is that you're already attending.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.73,
    "end": 1601.783,
    "text": "And most of these models that we have taken up in the past, especially in 37, what they try to focus on is getting from A to B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.049,
    "end": 1617.821,
    "text": " what this is essentially saying is, let's add something to that translation, right, from A to B. Whatever we're trying to incorporate in this representation, let's maybe look at the interpretation part of it now and the recitation part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.841,
    "end": 1626.909,
    "text": "So if I'm the umpire, and we can all be umpires, we don't have to do that just in a baseball game, this is incorporating now a certain critical process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.317,
    "end": 1636.039,
    "text": " I was attending and I saw this, but then there were 60,000 other people also paying attention and they saw that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.319,
    "end": 1640.48,
    "text": "That's where I think this is getting really interesting now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.08,
    "end": 1649.061,
    "text": "This is actually bringing it back to sort of, I still think it's an instrumental piece, but I think now we're going to incorporate some of the reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.562,
    "end": 1651.522,
    "text": "And were the 60,000 wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.282,
    "end": 1656.163,
    "text": "Or is the one person who yelled out safe wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.032,
    "end": 1667.877,
    "text": " That's what I see in this, because that you is definitely embedded in the generative process, not the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.599,
    "end": 1671.199,
    "text": "Okay, thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.219,
    "end": 1671.479,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.741,
    "end": 1683.225,
    "text": "So the question that comes into mind is where the body is in all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.626,
    "end": 1686.247,
    "text": "And I sense that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.182,
    "end": 1692.303,
    "text": " The generative process is the bigger process with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.843,
    "end": 1703.765,
    "text": "The generative model gives a way to access those priors and to give away the hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.465,
    "end": 1713.847,
    "text": "And the cognitive model, generally speaking, cognition is thought of more in terms of deductive and inductive reasoning and logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.33,
    "end": 1723.533,
    "text": " And it could be that there's elements of the abductive that could be held within the kind of body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.733,
    "end": 1728.775,
    "text": "And I suppose there's a question there to how and where that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.815,
    "end": 1733.697,
    "text": "I don't think anyone quite knows the answer to that, but that's my thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.678,
    "end": 1739.299,
    "text": "So let's remember that this partitioning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1740.552,
    "end": 1747.798,
    "text": " is specific to a given instantiation of model-based science, just like Majeed was talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1748.579,
    "end": 1755.484,
    "text": "So we're not going around and assigning aspects or phenomena of the world into either generative model or generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1755.585,
    "end": 1756.866,
    "text": "So where does the body fit in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1757.386,
    "end": 1766.674,
    "text": "Well, with respect to a model of the body being a structurally real thing that gives rise to observations, it's a generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.143,
    "end": 1790.235,
    "text": " looking at the coin from the other side and thinking of the body as a generative model of its niche doing inference on certain things or acting as if in that sense it's generative model so different kinds of entities are not going to be just assigned simply to one side or the other it's going to come down to what is specifically being discussed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1792.739,
    "end": 1801.105,
    "text": " There's a few other, not complexifiers, but first off, just note that the notation here is not the same that's used elsewhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.825,
    "end": 1814.494,
    "text": "So we will move towards better and cleaner or reformatable notation, but like X star as an external state and X as an internal state might be clearer for some people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1815.501,
    "end": 1822.826,
    "text": " It also carries a little bit of a baggage that the hidden state is exactly what is being inferred about the external world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1823.627,
    "end": 1828.09,
    "text": "Like there's a temperature parameter in the brain and then there's a temperature parameter outside in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1829.446,
    "end": 1834.428,
    "text": " as we explored in the representations paper, it doesn't necessarily have to be that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1834.468,
    "end": 1856.999,
    "text": "There could be a hidden state internally having to do with movement left or right, and then there's a temperature variable outside, and then the model, the generative model of the cognizer is about movement conditioned on temperature observations, but not necessarily simply a thermometer being instantiated in the head.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.877,
    "end": 1878.086,
    "text": " It's like good to look at this graphically and think about what is being connected to what without worrying too much about all of these side questions, but this is what they're setting up as the basis of their further discussion, which is it's about prediction and control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1879.667,
    "end": 1883.629,
    "text": "And we can use Bayesian graphical approaches to represent that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1883.969,
    "end": 1884.209,
    "text": "Steven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1886.658,
    "end": 1892.362,
    "text": " And that inferred state, as you mentioned, in some ways that's always slightly hidden from us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1892.982,
    "end": 1907.913,
    "text": "What does that mean to be an inferred state in terms of is that the cognition that's coming out of that in some sort of deductive, or can it be an effective sense of how well something's going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.333,
    "end": 1913.156,
    "text": "So again, it's not directly asked here, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.038,
    "end": 1930.96,
    "text": " Accessing that is one of the big problems that happens is how do you access what has been inferred when it's not necessarily something you can access through sort of direct reporting from a subject matter or from a participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.019,
    "end": 1947.152,
    "text": " Another example of that might be somebody who has skilled action with respect to investing, but they may not be able to give an estimate for a number that a certain asset is expected to be at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1947.632,
    "end": 1951.896,
    "text": "Because it's not like they're doing the asset price prediction and then doing a strategy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1952.476,
    "end": 1954.678,
    "text": "The cognitive model may have a very different structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1955.805,
    "end": 1974.148,
    "text": " So we explored it in the representations paper, but like there would be ways in which therefore that investment decision is not a representation of the actual stock market because it's not the same variable, but then the aboutness of the investment decision would be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1975.109,
    "end": 1998.039,
    "text": " representation with respect to what was happening in the generative process so those are some of the like side avenues that we've looked at previously but they're all in play at once and so the question is just how to linearly structure to respect the specific contributions that are made here and the insight that can be gleaned without every single time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1999.414,
    "end": 2024.408,
    "text": " pulling back to some of these questions but it's great that we have like specific papers and memes and core terms that we can refer to and then carry on with what they actually contribute okay any thoughts on one or two before we get into the structure of the um allostat or the homeostat first i guess",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2027.386,
    "end": 2027.846,
    "text": " Let's go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2027.866,
    "end": 2028.907,
    "text": "Let's begin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2028.947,
    "end": 2042.06,
    "text": "So we're going to go from this black and white, you know, Dorothy still in Kansas mode to some predictive motifs of ancestral brains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2043.381,
    "end": 2052.829,
    "text": "And the three motifs, the red, green, and blue, are homeostasis, so returning to a set point, allostasis,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2053.88,
    "end": 2068.145,
    "text": " anticipating or approaching a set point in the future, which could be a fixed or changing one, and then implementing behavioral control, not just scalar homeostasis or allostasis on an interoceptive variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2070.206,
    "end": 2070.366,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2071.883,
    "end": 2075.125,
    "text": " Citation 20 in the paper, Chance et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2075.645,
    "end": 2084.61,
    "text": "from the future, March 22, is where to look for more details on the homeostatic formulation that they're using here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2085.471,
    "end": 2087.972,
    "text": "But we can see it in terms of their figure three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2089.264,
    "end": 2099.21,
    "text": " Okay, so the left side, just for reference, there's figure two, so that we can remember the structure of perception, cognition, action, impact that the authors are working with here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.95,
    "end": 2103.793,
    "text": "And we're going to connect this black and white figure two to figure 3A.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2106.991,
    "end": 2124.463,
    "text": " This is a graphical model, graphical in both senses, meaning visual, like we're perceiving it through computer graphics, and graphical meaning like a network, so nodes and edges, because there's computer graphics that aren't network topologies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.224,
    "end": 2134.651,
    "text": "But this happens to be a computer graphic that we're perceiving visually that also is reflecting a graph in terms of nodes and connected edges.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2135.905,
    "end": 2142.006,
    "text": " It's a generative model for the regulation of a single interoceptive variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2142.326,
    "end": 2161.49,
    "text": "So here's A and B with the homeostat and C we split out to talk about later, but first A and B. This generative model includes an interoceptive thermoreceptor and a belief about body temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2163.254,
    "end": 2170.077,
    "text": " The prior over X, which is body temperature, is kept fixed, and hence it acts as a cybernetic set point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.057,
    "end": 2186.743,
    "text": "Any discrepancy between the predictive thermoreceptor activity given beliefs about X, so Y conditioned on X, and the measured Y is registered as a prediction error that is canceled out by an autonomic response U, for example, a thermoregulatory response.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2187.303,
    "end": 2188.664,
    "text": "So hidden state,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2189.924,
    "end": 2191.466,
    "text": " On temperature, beliefs about temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2192.086,
    "end": 2192.367,
    "text": "Why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2192.387,
    "end": 2193.928,
    "text": "The thermometer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.948,
    "end": 2195.49,
    "text": "Perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2196.331,
    "end": 2199.614,
    "text": "And then there's the selection of action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2200.295,
    "end": 2203.839,
    "text": "So some sort of like vasodilation or thermoregulatory response.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2204.76,
    "end": 2209.205,
    "text": "And then that's going to change the underlying unobserved true temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2209.925,
    "end": 2210.506,
    "text": "But that's not...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.857,
    "end": 2227.596,
    "text": " needing to be shown so any comments on that first part we're looking just at the top half of 3a and connecting x y to um you action can you still hear me because i think i've",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2229.706,
    "end": 2235.448,
    "text": " Can you take the cursor now and just reinforce the feedback and the feed forward part of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2235.468,
    "end": 2242.691,
    "text": "Because the authors spent a bit, I don't want it sort of unpacked like they have at the figure three unpacking that we have in the bottom of the slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.931,
    "end": 2249.313,
    "text": "Can you just run the cursor over all the examples of feedback and feed forward going on concurrently?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.393,
    "end": 2256.156,
    "text": "Because I think that's really important to see that it's happening in both directions at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.492,
    "end": 2262.317,
    "text": " Let's label everything and then definitely can do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2263.158,
    "end": 2263.578,
    "text": "Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.799,
    "end": 2264.159,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2276.212,
    "end": 2276.492,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2276.792,
    "end": 2280.196,
    "text": "So light blue is action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.117,
    "end": 2305.455,
    "text": " These are subtracted, so red circles represent expected values of x, the red circles, which are used to make predictions about y. These are subtracted to form a prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2310.953,
    "end": 2314.355,
    "text": " Because those lines with the arrows on the end of them are just dependencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.395,
    "end": 2317.938,
    "text": "They don't really show both the feedback and the feed forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.327,
    "end": 2333.148,
    "text": "Yes, agreed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2333.208,
    "end": 2335.89,
    "text": "Like having some rounded...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2337.111,
    "end": 2362.257,
    "text": " edges and other um directed edges let's see whether it's whether they're like kind or not um let's start with action action influences the state of the world which an edge can be drawn",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2363.703,
    "end": 2367.284,
    "text": " to how that changes the state of the thermoreceptor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2367.304,
    "end": 2370.966,
    "text": "I thought Y here was the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.626,
    "end": 2371.806,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2372.866,
    "end": 2375.007,
    "text": "That's the state of the thermoreceptor is the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2375.327,
    "end": 2375.587,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.107,
    "end": 2376.288,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2376.448,
    "end": 2387.211,
    "text": "So action changes the observation, the state of the thermoreceptor, which is being contrasted with the belief about temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2388.932,
    "end": 2389.112,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2389.132,
    "end": 2391.433,
    "text": "From there, a prediction error",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2392.924,
    "end": 2393.564,
    "text": " is generated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2394.245,
    "end": 2397.607,
    "text": "It could be zero if there's no difference, or it could be higher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2401.789,
    "end": 2414.937,
    "text": "Can you just show with a green, some colored line that has an arrow on each end, a connection that demonstrates within that diagram, the feedback and the feed forward at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.118,
    "end": 2418.259,
    "text": "Is that possible using this diagram?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.758,
    "end": 2420.178,
    "text": " Let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2420.318,
    "end": 2435.068,
    "text": "This representation, so a single arrow or a single line that has an arrow at both ends is a different color, so we've superimposed it over this, but that it shows that there's a feed-back, feed-forward loop going off at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.088,
    "end": 2444.475,
    "text": "Okay, so here's the temperature information measurement flowing in to contrast with the beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.814,
    "end": 2450.695,
    "text": " And this is, it is in general really important to label the edges, not just use color coding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.156,
    "end": 2453.096,
    "text": "We'll let it roll for now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2453.476,
    "end": 2456.657,
    "text": "The information is flowing from the measurement to the belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2457.837,
    "end": 2462.378,
    "text": "And then that gives us the prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.199,
    "end": 2475.522,
    "text": "Then the prediction error is used in the selection of action, which then influences future observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2478.561,
    "end": 2498.516,
    "text": " Now the red circles represent expected values of X. I'm actually not sure what exactly the red bottom larger circle is meaning because the prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2499.217,
    "end": 2502.119,
    "text": "Well, there has to be some way of representing that discrepancy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.12,
    "end": 2508.184,
    "text": "So they needed the second ball on the bottom to show difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.529,
    "end": 2513.152,
    "text": " Between prediction error and expectation, I think that's all that's trying to show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.713,
    "end": 2520.657,
    "text": "Yeah, or another possibility might be that the prior is staying fixed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2521.557,
    "end": 2521.857,
    "text": "Correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.898,
    "end": 2523.178,
    "text": "That's X to the prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.218,
    "end": 2523.819,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.959,
    "end": 2524.139,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2524.539,
    "end": 2531.024,
    "text": "Priors can also... They can be flexible, but in this case, it's a fixed prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2532.064,
    "end": 2533.886,
    "text": "That's because we're talking about homeostasis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2534.566,
    "end": 2534.706,
    "text": "Yep."
  },
  {
    "start": 2535.367,
    "end": 2535.547,
    "text": "Then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2537.512,
    "end": 2554.183,
    "text": " the observations are diverging from the prior and the posterior is kind of like the realized perception, which is a compromise between the sensory data coming in and the prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2554.863,
    "end": 2558.345,
    "text": "And so, yes, there's a lot of degrees of freedom depending on how parameters are weighted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2558.425,
    "end": 2561.447,
    "text": "This green line might approximate the red a lot more sharply.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2562.068,
    "end": 2563.429,
    "text": "We'd call that a weaker prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2564.281,
    "end": 2567.603,
    "text": " because sensory data updates the posterior to be more like it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.505,
    "end": 2575.289,
    "text": "Or it could be the case that having a lot of observations different from your prior don't change it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2575.329,
    "end": 2579.352,
    "text": "That's a strong prior where sensory data do not change it as much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2579.992,
    "end": 2591.321,
    "text": "But then here is the prediction error in relationship to X. I don't know, we can look at the paper, but is mu",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2594.136,
    "end": 2620.408,
    "text": " shown in an equation i don't have it copied out if it is let me look here while you're doing that yeah but that is the perhaps here okay um stephen anything yeah i'm just noting how the effectively the belief on temperature it's it flows through the thermosector",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.786,
    "end": 2648.593,
    "text": " down into the to get the expectations prediction error so it's you know it's it's it's like you've shown there there is a a dynamic going down from the belief through to prediction error being mediated it's like the thermoceptor is kind of like a mediator between belief and prediction error on what to do for action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.417,
    "end": 2665.062,
    "text": " And another point, the reason why you can't find the Mew is because it's not actually pointed to in the description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.183,
    "end": 2667.023,
    "text": "It's not in the caption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2667.604,
    "end": 2679.531,
    "text": "Yeah, and I remember reading and looking and looking and looking and not being able to find it and then looping back up paper to go, okay, so how about feedback feed forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.752,
    "end": 2685.815,
    "text": "Now, there are cases where Mew is used to describe internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2689.201,
    "end": 2695.885,
    "text": " That may be implicitly how it's being used, but it's super important that all variables are defined in a paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2695.965,
    "end": 2700.487,
    "text": "I wish they all had a table for every single variable and expression that were used.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2701.167,
    "end": 2704.849,
    "text": "Yeah, it would make the dot zeros easier, but also it would reduce uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2707.511,
    "end": 2711.493,
    "text": "For example, is this epsilon even described?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2711.533,
    "end": 2711.973,
    "text": "Okay, Steven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.197,
    "end": 2735.22,
    "text": " mean I suppose in a thermostat in some ways the the internal states of the bioelectric strip and in some ways it's kind of it holds the kind of the the way that the expectations of action can happen because it in some ways it dictates the way that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.503,
    "end": 2759.516,
    "text": " thermostat will behave it's uh in some sort of ways even if it's kind of a uh an analog uh process so i'm i'm thinking like where where would the kind of in a thermostat where would um i know this is a homeostat so it's a bit more sophisticated now but extrapolating that out you've you've kind of got a belief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.552,
    "end": 2767.014,
    "text": " And there's a belief of what something is, and then there's an expectation of what you can do about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.154,
    "end": 2771.955,
    "text": "For instance, my beliefs can go bigger than what I can do in my actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.015,
    "end": 2781.077,
    "text": "I could have beliefs about temperature, which exceeds where I could even exist or where I am able to change it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.597,
    "end": 2782.818,
    "text": "It depends on the scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.898,
    "end": 2788.339,
    "text": "So it's sort of held in both scenarios, in both the body",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.702,
    "end": 2813.344,
    "text": " and the context and the kind of the the probabilities available okay so for a non-living thermostat it doesn't have a cognitive belief on temperature but there could be something that's computationally like that reflected by like just a digital prior on temperature and again these aren't cognitive personal affective experienced beliefs",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2814.11,
    "end": 2820.792,
    "text": " Bayesian belief, this is just saying random variable reflecting in a model variable on temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2821.372,
    "end": 2828.633,
    "text": "So even a sincerely held incorrect psychological belief is not the Bayesian belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2829.053,
    "end": 2840.616,
    "text": "They might coincide at times if it were a parameter, but the belief here being the prior,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2844.56,
    "end": 2845.541,
    "text": " It must be adaptive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.581,
    "end": 2858.073,
    "text": "That's the evolutionary twist that actually helps resolve a lot of this because otherwise, right, the design space of all edges by all nodes and then any variable, I mean, it's just like saying, here's all the words in the dictionary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2858.393,
    "end": 2865.86,
    "text": "And so evolution helps restrict the discussion to cases that actually do manage to achieve adaptive control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2866.161,
    "end": 2866.301,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2867.119,
    "end": 2877.184,
    "text": " And this is where that translation from the silhouette of a head to a statistical density is assumed that the person who's following along with this just sees that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.524,
    "end": 2891.331,
    "text": "But you can also see how easy it is to slip into the idea that, oh, wait a second, we've gone from the physical space and we just held on to the physical space when really now we're talking about a statistical density space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.452,
    "end": 2895.053,
    "text": "And again, if you're not really, really careful,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.492,
    "end": 2901.316,
    "text": " You can see how people can carry forward something, but the actual thing that they're talking about has changed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.257,
    "end": 2920.11,
    "text": "That's why the word discrepancy was such a big deal to me because I normally gloss over things, but this time it actually, I went, oh, okay, so there's going to be some moments here where we're actually talking about different things, even though in the continuum, we kind of think that they're talking about the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.171,
    "end": 2920.631,
    "text": "No, we're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.288,
    "end": 2951.015,
    "text": " yep it's um the travails of realism and instrumentalism for biological active inference episode 55 because are these terms are they an example or is this an example of a model being used to discuss a real system but this suffice to say is the architecture of the homeostat it undertakes action",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2952.113,
    "end": 2961.536,
    "text": " to reduce discrepancy relative to a prior held belief, fixed in this case, about what temperatures are expected slash preferred.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2962.337,
    "end": 2965.718,
    "text": "The dialectic of the first two Ps from livestream number 37.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2965.758,
    "end": 2978.902,
    "text": "This is an expectation and a preference because expectations having to do with survival are as good as preferences for survival over evolutionary time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2980.003,
    "end": 2980.243,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2981.38,
    "end": 2989.444,
    "text": " This is going to be contrasted with figure 3b, which is the Allostat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.304,
    "end": 3004.331,
    "text": "And so we see the same stack of X1, Y1, light blue, dark blue, red, except there's now a second column next to it, and there's some cross connectivity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.971,
    "end": 3008.933,
    "text": "So again, the Xs are going to be beliefs about, so priors on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.984,
    "end": 3033.622,
    "text": " then these are observations and so they're saying this generative model extends the homeostat by including a second set of exteroceptive variables that correspond to light intensity y2 observations of light and beliefs about sunrise so like beliefs about the generative process so generative model of the generative process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3036.277,
    "end": 3043.202,
    "text": " Furthermore, the model includes a predictive relationship between sunrise and body temperature .",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3044.523,
    "end": 3051.669,
    "text": "So, again, I wish we could label every edge because the edges are meaning different things even at different times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.55,
    "end": 3057.433,
    "text": "Like, this is a predictive relationship, so it's an anticipatory one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.487,
    "end": 3083.152,
    "text": " then the one about light intensity and the belief about sunrise there would be ways to make that an anticipatory or an anticip or an instantaneous relationship um but the result of this sketched architecture is that inferring a sunrise which will only happen with high posterior confidence if the visual observations are consistent so low prediction error",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3084.488,
    "end": 3091.635,
    "text": " Inferring a sunrise, not quote, seeing a sunrise, that is not what is happening in the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.815,
    "end": 3099.123,
    "text": "Inferring a sunrise and finding that visual observations are compatible with it can trigger the autonomic response, the behavior, you,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.544,
    "end": 3125.226,
    "text": " of thermoregulation in an anticipatory manner that is before sunlight actually increases body temperature well how would the parameter be set that way because if that were adaptive then other parameter combinations have been weeded out already by evolution so that is where we tuck the thread back into the ball of yarn which is the parameter combinations that are non-adaptive die",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3126.24,
    "end": 3126.881,
    "text": " They dissipate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.041,
    "end": 3127.801,
    "text": "They fail to exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.821,
    "end": 3132.966,
    "text": "They're not going to be measured as things in the future, empirically, however you want to take it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.146,
    "end": 3135.648,
    "text": "So the quote, like, how does it work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.489,
    "end": 3142.113,
    "text": "It's the same as it was 50 years ago, which is it has to do with survival of the persistent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.394,
    "end": 3142.694,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.196,
    "end": 3152.942,
    "text": "And these graphs, what they're used for as well is they do show beliefs tied to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.198,
    "end": 3168.923,
    "text": " the observation space, the space available around the observation, you know, whatever the sensorium that is available, that's what gives the beliefs its scope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.963,
    "end": 3178.866,
    "text": "And then the expectations are tied in here more clearly to action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.926,
    "end": 3181.887,
    "text": "So the errors, the errors or the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.795,
    "end": 3197.884,
    "text": " What's important, the actual dynamic that's driving action to change something is coming out of the prediction error that's feeding into action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.444,
    "end": 3205.509,
    "text": "I think that's quite important because this is like the proto-animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.549,
    "end": 3211.413,
    "text": "This is like the proto kind of piece here that ties into a lot of how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.386,
    "end": 3214.428,
    "text": " we think about knowledge and meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.108,
    "end": 3229.521,
    "text": "And I'm not saying that, I'm just extrapolating a lot, but I think it does show how beliefs are tied to the type of sensorium that is being used to shape the observation space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.541,
    "end": 3230.882,
    "text": "And I think that's quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3232.083,
    "end": 3233.845,
    "text": "Yeah, and these are just, yeah, Dean, first go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3235.154,
    "end": 3241.419,
    "text": " I just want to get both your guys' opinions about that orange barbell at the bottom of the diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.459,
    "end": 3246.363,
    "text": "Because we're talking identity, but we're also still talking about dependency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.383,
    "end": 3248.925,
    "text": "We're talking about duplication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.586,
    "end": 3251.267,
    "text": "We're talking about anticipation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.427,
    "end": 3255.831,
    "text": "So that's a lot of stuff packed in one orange barbell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.071,
    "end": 3256.752,
    "text": "What do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.534,
    "end": 3261.796,
    "text": "Yeah, I'm going back to the full caption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3268.991,
    "end": 3294.504,
    "text": " the red circles represent the expected values of x so if we're interpreting these as the posteriors on x because the expectations the priors are the top blue ones so it wouldn't have to be the red circles and they don't mention the word orange",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3296.593,
    "end": 3300.519,
    "text": " Note the lateral... It's there, and it's identity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3301.78,
    "end": 3306.868,
    "text": "Note the lateral modulatory connections in the allostatic network C24 for details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3307.469,
    "end": 3311.674,
    "text": "And 24 is the graphical brain with Frist and Parr and DeVries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3314.212,
    "end": 3316.515,
    "text": " So yeah, again, this is just a sketch model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3316.535,
    "end": 3320.519,
    "text": "They're not using it to fit any data or even simulate any data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.801,
    "end": 3334.535,
    "text": "And it does relate to what Steven said about the intersensory or the intermodal inference, which is one could imagine a cognitive model where if there's noises that are associated with sunrise,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.438,
    "end": 3341.062,
    "text": " Then beliefs about sunrise can be a variable with edges coming from different sensory modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3341.722,
    "end": 3350.008,
    "text": "So it gives us a separation of the organs of sense and internal cognitive modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.408,
    "end": 3350.628,
    "text": "Steven?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3352.847,
    "end": 3358.329,
    "text": " Yeah, it gives a sense of when would something be important to act upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.669,
    "end": 3370.674,
    "text": "So there's many, many things that I could believe I'm seeing or being perceived in terms of this is a sunrise or this is the type of light coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.714,
    "end": 3371.874,
    "text": "This is the nature of the light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.914,
    "end": 3374.575,
    "text": "This is where the light's coming from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.595,
    "end": 3375.496,
    "text": "There's all sorts of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3376.016,
    "end": 3379.898,
    "text": "The stuff that's really filtering down is what is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.751,
    "end": 3388.089,
    "text": " important and this is where the affordance is coming what affords me to make some action",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3390.362,
    "end": 3393.723,
    "text": " If it was expanding out, there can be lots of things I notice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.043,
    "end": 3406.067,
    "text": "I might notice that there's a line there, and I may notice and believe it's orange, but I may not act upon it until I take my attention to it and think it's useful, as there's many things going on on the page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.427,
    "end": 3417.391,
    "text": "So when we have beliefs, but then there's what's being acted upon out of all of that to then create some sort of change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.691,
    "end": 3418.311,
    "text": "So I think that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.218,
    "end": 3420.9,
    "text": " is also quite useful in this architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.387,
    "end": 3426.867,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.948,
    "end": 3427.689,
    "text": "Can I add to this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.049,
    "end": 3429.651,
    "text": "Because I think it's really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.033,
    "end": 3435.098,
    "text": "So we're talking about in the context of a sun coming up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.899,
    "end": 3457.135,
    "text": " But let's see whether it still is true, and I think it is, just to prove a point, whether that orange barbell still makes sense if we're talking about Daniel anticipating 61-year-old Daniel and Stephen anticipating 61-year-old Stephen and Dean anticipating 61-year-old Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.895,
    "end": 3463.68,
    "text": "Now, I'm much closer to 61 than the two of you, but do I need the Monte Carlo?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.96,
    "end": 3465.221,
    "text": "Do I need the play out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.641,
    "end": 3478.17,
    "text": " to be able to make that anticipation as long as I have the identity and the parallelism and the backwards and forwards looking dependency that we see between X1 and X2 and Y1 and Y2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.75,
    "end": 3489.737,
    "text": "That's what I think makes this a very interesting way of being able to sort of build on the previous homeostatic example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.419,
    "end": 3491.679,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.739,
    "end": 3491.979,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.376,
    "end": 3500.079,
    "text": " Yeah, I think also this speaks to traditionally we think about the meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.119,
    "end": 3500.859,
    "text": "What does this mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.899,
    "end": 3501.98,
    "text": "What's all the meaning out there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.0,
    "end": 3507.462,
    "text": "As you mentioned, all the data, the stuff that it could mean to relate all these variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.583,
    "end": 3517.127,
    "text": "But ultimately, and the bit that is actually what active inference gives us is that barbell is where the meaning comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.307,
    "end": 3518.908,
    "text": "It's like the way to know...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.196,
    "end": 3535.829,
    "text": " how being 61 is for you, Dean, is for you to imagine what it would be like to make choices and to act in the world as a 61-year-old Dean, not necessarily to go out and look at all the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.196,
    "end": 3542.46,
    "text": " the data, so to speak, all the beliefs and the things we think about the world, but to actually bring that in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.161,
    "end": 3550.206,
    "text": "And of course, you've got a better chance to do that because you're closer to being that kind of dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.406,
    "end": 3561.214,
    "text": "So I think that's quite interesting, that barbell at the bottom in terms of pairing together the kind of beliefs about what actions and prediction areas are available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.055,
    "end": 3565.518,
    "text": "And it's more into that meaningful action, meaningfulness,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.519,
    "end": 3568.46,
    "text": " realm, rather than what does it mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.64,
    "end": 3572.243,
    "text": "What's the data tell us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.303,
    "end": 3575.144,
    "text": "We might get there, and I'm not pushing back on what you're saying, Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.585,
    "end": 3576.665,
    "text": "We might get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3577.246,
    "end": 3592.515,
    "text": "But I think for now, what we're saying is that in order to get there, we have to have more than a single stack of dependencies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.547,
    "end": 3606.123,
    "text": " We have to have a double stack in order to be able to extend the homeostatic nature of how we've evolved to where we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.124,
    "end": 3607.545,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.805,
    "end": 3609.107,
    "text": "Again, I'm not pushing back on you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.347,
    "end": 3610.909,
    "text": "I'm just saying I don't want to jump that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.363,
    "end": 3619.694,
    "text": " I don't want to jump that firing pistol just yet because I think that orange barbell is going to turn into a green arrow and then all hell is going to break loose anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.895,
    "end": 3621.597,
    "text": "So we should carry on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.617,
    "end": 3628.066,
    "text": "I don't want to take Stephen's stuff away, but I think I want to park it because we're going to go somewhere in a minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.222,
    "end": 3655.161,
    "text": " I'm hesitant to ascribe too much specificity to something that wasn't labeled in the caption, doesn't have a clear labeling in the figure either, but I think it is already demonstrated that using graphical frameworks and partitionings like we have in Active Inference, we can start to approach some of these questions, like how would different kinds of variables be connected",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.226,
    "end": 3661.308,
    "text": " How does that relate to future inference on action, counterfactuals, et cetera?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3661.788,
    "end": 3681.954,
    "text": "Okay, so these sections four, five, six, seven, were just laying out the relationship between an evolutionary or a physiological function like homeostasis, allostasis, or simple behavioral control, models of things that are core evolutionary features and functions,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3683.519,
    "end": 3698.49,
    "text": " connecting them to the kinds of graphical representations, which are like a little bit of a hybrid of a Bayesian graph and a factor graph, because there's some kind of computations being implied here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3699.411,
    "end": 3703.394,
    "text": "Whereas in a Bayesian graph, the edges only reflect statistical dependencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3703.874,
    "end": 3709.458,
    "text": "Whereas we're bringing in a little bit more of like a nuanced type relationship that one could imagine",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3710.421,
    "end": 3714.244,
    "text": " could be unpacked a bit more were it to be specified.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3714.785,
    "end": 3724.593,
    "text": "But it's just to show how different graphical models relate to different functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3725.774,
    "end": 3737.544,
    "text": "Architectural underpinnings, whether you think this is the actual architecture or whether it's just an instrumental architecture, like a model structure on a given phenomena,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3739.434,
    "end": 3765.207,
    "text": " how do model architectures relate to evolutionary functions where is evolutionary time in this model we started out by asking like how do cognitive phenotypes arise specifically over evolutionary but also over developmental time and that's where we get to one of the main pieces and contributions of the paper which is figure four",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3766.957,
    "end": 3771.301,
    "text": " the five main dimensions of elaboration of generative models introduced in this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3772.121,
    "end": 3779.908,
    "text": "So there's other kinds of changes and ways that this structure could evolve, but they're going to focus on these five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3780.628,
    "end": 3783.31,
    "text": "There's starting with the homeostat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3783.991,
    "end": 3785.572,
    "text": "Does it have to be our starting point?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3785.632,
    "end": 3786.233,
    "text": "Maybe not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3787.242,
    "end": 3809.735,
    "text": " starting with a homeostat there's the i operation which is identity unchanged there's i plus i which is just a parallel isolated duplication that's like from one photoreceptor to going to two photoreceptors so to speak there's the allostat which is a duplication as well as a cross-linking",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3810.885,
    "end": 3812.646,
    "text": " So these are just sketches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3813.046,
    "end": 3820.048,
    "text": "One could also probably write that one as like a duplication followed by a linking, and there's no like change in linking, for example, here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3820.548,
    "end": 3824.77,
    "text": "So this is like a few of a taxonomy of operations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3825.71,
    "end": 3830.111,
    "text": "There's increases in temporal depth within a level of the hierarchy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3830.772,
    "end": 3834.533,
    "text": "So looking one more unit further in time,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3835.589,
    "end": 3836.99,
    "text": " at a given time scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3837.851,
    "end": 3846.58,
    "text": "And then there's hierarchical nesting with an H. And the figure is shown like this because these are like the things that can happen to the homeostat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3847.561,
    "end": 3850.904,
    "text": "And then they can have a second round and so on and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3852.585,
    "end": 3854.125,
    "text": " there's so many other ones that could happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3854.165,
    "end": 3855.926,
    "text": "Like where is reduction?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3856.526,
    "end": 3857.426,
    "text": "Where's loss?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3858.306,
    "end": 3859.607,
    "text": "Where's deduplication?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3860.107,
    "end": 3862.007,
    "text": "Where's the uncoupling of the allostat?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3862.167,
    "end": 3864.568,
    "text": "Reduction of temporal depth, reduction of hierarchy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3865.048,
    "end": 3880.252,
    "text": "So there's a broad space, but one of the main contributions of this paper is to connect functionally oriented graphical models of homeostatic and physiological function to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3881.878,
    "end": 3889.845,
    "text": " operations that result in the elaboration of simpler model architectures into different architectures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3890.845,
    "end": 3892.086,
    "text": "This is an interesting part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3892.367,
    "end": 3899.092,
    "text": "I know Stephen wants to say something too, but really quickly, there's no plus minus multiply and divide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.993,
    "end": 3905.077,
    "text": "There's an operation, but there, there's no symbolism for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.717,
    "end": 3906.218,
    "text": "And again, again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3908.111,
    "end": 3910.933,
    "text": " that keeps it safe on a statistical level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.573,
    "end": 3914.495,
    "text": "I think that's a nice tell there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.856,
    "end": 3921.3,
    "text": "And I want to, again, for somebody who's just sort of looking at this for the first time, pointing that out, it's not there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3921.32,
    "end": 3924.803,
    "text": "And because it's not present, that tells us something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.063,
    "end": 3929.206,
    "text": "To your point about maybe how do we get deduplication?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.708,
    "end": 3936.252,
    "text": "Yes, it's... Well, I plus I, it is like... It's a...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3937.788,
    "end": 3943.395,
    "text": " suggestive use of the addition operator, but we're not adding these just like integers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3943.956,
    "end": 3952.206,
    "text": "So yes, they're kind of like categorical operations that constitute this evolutionary algebra.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3953.328,
    "end": 3955.35,
    "text": "Okay, Steven, anything on figure four?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3956.164,
    "end": 3968.576,
    "text": " Yeah, I was just saying that they've set a kind of a paradigm from the homeostat and they've taken that through and they've shown that it plausibly can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.404,
    "end": 3971.785,
    "text": " carry through to cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.625,
    "end": 3981.951,
    "text": "And then, like you say, there can be other ways, but what they've now given is they've given some legs another way to think of the legs that can be attached to that paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.971,
    "end": 3995.919,
    "text": "Because this modeling approach, while they could have chosen a lot of others, by taking it, there are certain things which are hard-baked into that early stage choice-making, which then makes other paradigms wouldn't fit with it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3996.18,
    "end": 3999.782,
    "text": "You know, even if you go instrumental or realist,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.797,
    "end": 4028.386,
    "text": " know your instrumental models your realist models don't make sense unless you with this unless you take in some of the paradigms that this structuring creates yeah agreed thanks so just maybe think like is this functional model realism like the function of the model is what is being tracked through time and so that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4029.721,
    "end": 4033.424,
    "text": " there's many other alterations that could occur.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4034.305,
    "end": 4041.211,
    "text": "And then there's the even more granular, like parametric changes or changes in connectivity or edge types.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4042.312,
    "end": 4047.977,
    "text": "And then I think, as you said, Dean, when all hell breaks loose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4048.498,
    "end": 4054.683,
    "text": "So then it just, what's interesting here, let's look at the Allostat in a little bit closer detail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4055.595,
    "end": 4060.679,
    "text": " Okay, so previously we looked at the allostat and we were like, okay, there's an orange bar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4062.2,
    "end": 4068.826,
    "text": "Now, the allostat has a green bar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4070.027,
    "end": 4072.069,
    "text": "It's a green arrow and it's a unidirectional one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4072.929,
    "end": 4074.971,
    "text": "This one... The dependency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4078.894,
    "end": 4079.795,
    "text": "The allostat...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4082.873,
    "end": 4084.234,
    "text": " has the green bar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4084.534,
    "end": 4085.294,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4085.314,
    "end": 4086.274,
    "text": "Well, those are my bad eyes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4086.334,
    "end": 4090.916,
    "text": "Cause I saw, I saw the little arrow from the blue actually turning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.196,
    "end": 4093.097,
    "text": "I didn't actually see that there was two circles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.417,
    "end": 4093.837,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.558,
    "end": 4097.178,
    "text": "There's my 60 year old eyes for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.779,
    "end": 4097.999,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4100.245,
    "end": 4127.444,
    "text": " okay cool um and so each of these are in quite a different domain um or at least like a different aspect of cognition and these are the transitions that it can engage in so like duplication retains the exact same function but it's a very important step and that's a little bit what i explored in the dot zero with genetic duplications like on the left side here at the screen",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4129.201,
    "end": 4136.948,
    "text": " having a region of the genome duplicate, yes, one of the duplicate copies can just degenerate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4137.928,
    "end": 4144.314,
    "text": "That may be like opening up space or creating motifs for other kinds of later evolutionary steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4144.354,
    "end": 4146.816,
    "text": "So even this is not like a failure, it's just a change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4147.877,
    "end": 4152.521,
    "text": "There's neo-functionalization where then those two models can start to subspecify.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4152.661,
    "end": 4156.004,
    "text": "Like if you only have one photoreceptor, it has to be doing what it's doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4156.484,
    "end": 4157.325,
    "text": "But duplicating it,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4158.502,
    "end": 4163.505,
    "text": " then allows one to focus on a different wavelength than the other, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4164.265,
    "end": 4179.354,
    "text": "And then there's sub-functionalization, which is where initially a composite function, AB, becomes two, like enzymes start to sub-specialize on one of the two functions of the ancestral.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4179.374,
    "end": 4180.955,
    "text": "So this is kind of like a role duplication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4180.975,
    "end": 4184.878,
    "text": "Okay, so duplication is an important event.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4186.167,
    "end": 4214.288,
    "text": " then there's the allostat and multiple things happen with a but we're seeing it as there is a duplication occurring and there's also cross-linking occurring between beliefs in one modality or beliefs about one type of thing influencing observations um or in about another kind of thing as well as this lateral modulatory uh green orange",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4216.192,
    "end": 4239.219,
    "text": " bar um we have and then we have two kinds of expansions into temporal depth a sort of local expansion with the t operation just pushing the model one step deeper and then the h hierarchical nesting operation which brings it to another time scale of analysis dean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4240.205,
    "end": 4241.686,
    "text": " And this is where I really struggled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.087,
    "end": 4246.47,
    "text": "And that is when they were at Alistat, it wasn't just comparative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.65,
    "end": 4251.614,
    "text": "I felt like you had to build in time, especially if we're talking about identity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.775,
    "end": 4255.497,
    "text": "But then it was like, no, we're just going to leave it comparative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.737,
    "end": 4258.239,
    "text": "And then we're going to introduce the when-ness of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.739,
    "end": 4262.783,
    "text": "Now, I mean, I understand why they're doing that to try to make it tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.443,
    "end": 4268.467,
    "text": "But I don't know how they can say it can be comparative, meaning it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4269.068,
    "end": 4283.118,
    "text": " I know the difference between A and B right now, but not sort of address the fact that in order to differentiate into A and B, some amount of time had to have been applied to that split.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.479,
    "end": 4291.403,
    "text": "So I was saying you have to go back in time in order to just be able to do a comparison.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.984,
    "end": 4294.265,
    "text": "So it's temporal only going forward in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.525,
    "end": 4298.088,
    "text": "I don't mean all hell broke loose, but I mean, I did ask this question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.444,
    "end": 4313.81,
    "text": " you're right like here there's um there's the triggering in an anticipatory manner and so in one view it's like but this is a single time step model so how could that occur because it doesn't have a temporal depth",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4315.177,
    "end": 4339.275,
    "text": " on the other hand again like kind of that those two senses of representation in the structural sense if the model is a single time step model it cannot have a representation through deep time ergo it cannot be anticipatory functionally right the other side of the coin would be if it's enough at this time step such that beliefs about sunrise trigger and a response",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4340.376,
    "end": 4345.857,
    "text": " the model can be functionally anticipatory without a temporal depth representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4346.737,
    "end": 4355.339,
    "text": "Which is why the representation discussion was very important leading up to this one, because we're all over those eight quadrants here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4356.28,
    "end": 4362.041,
    "text": "Because in evolution, and this is something that like cognitive psych people talk about and is like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4365.643,
    "end": 4387.7,
    "text": " our cognition being shaped towards effective which is to say productive reproductive success not towards like ultimate truth discovery and so should we be too surprised that our instrumentation which has had a certain objective function is then susceptible to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4389.98,
    "end": 4393.542,
    "text": " being convinced about things that are not true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4395.024,
    "end": 4399.347,
    "text": "Well, I don't socialize with those people, so I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.447,
    "end": 4407.772,
    "text": "I just knew that when I was looking at it, I was thinking in real practical terms, what is built into this in order for it to still make sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4407.973,
    "end": 4411.215,
    "text": "And that wasn't necessarily parsed out in the diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4411.235,
    "end": 4416.158,
    "text": "You kind of had to fill that in through your own interpretation of what was going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.378,
    "end": 4418.56,
    "text": "So thus, back to discrepancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4419.738,
    "end": 4421.939,
    "text": " That discrepancy thing is going to come up again and again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.979,
    "end": 4424.0,
    "text": "And I'm really glad that they inserted it at the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.621,
    "end": 4426.221,
    "text": "Thanks, Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4428.602,
    "end": 4435.806,
    "text": "I think it's useful here to hear this temporal depth and hierarchical depth being sort of spelt out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.588,
    "end": 4442.552,
    "text": " because I think sometimes it's a little confusing in other papers quite where it fits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.213,
    "end": 4449.898,
    "text": "So if temporal depth, and this again might be where some of this ontology work can be useful, just to sort of see if that can be kind of consistent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4449.958,
    "end": 4463.63,
    "text": "But if temporal depth is, you know, you've got variables for past, present, and future states, but they're operating maybe within the same kind of dynamics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.827,
    "end": 4477.81,
    "text": " And then if you've got different temporal rates operating simultaneously, then you get that hierarchical depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4478.611,
    "end": 4485.393,
    "text": "And I thought in the past, I'd sometimes thought temporal depth would have covered that more hierarchical depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.513,
    "end": 4494.435,
    "text": "So this is interesting to think about whether this might be actually the way that that differentiation is best made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.393,
    "end": 4501.854,
    "text": " Differentiation is probably best made with reference to a specific model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4502.434,
    "end": 4506.936,
    "text": "And this gives us the design language and the grammar and the motifs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4507.916,
    "end": 4518.62,
    "text": "So if we want to predict 100 years in the future, should we have a decade model with 10 year models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4519.18,
    "end": 4525.363,
    "text": "That's a times depth of 10 decades, and then a nested model with a depth of 10 years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4527.199,
    "end": 4531.522,
    "text": " Or will we have a one-layer model with 100?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4533.503,
    "end": 4534.224,
    "text": "They're very different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4535.185,
    "end": 4537.346,
    "text": "And it's not to say that one is more accurate or less.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4537.386,
    "end": 4544.311,
    "text": "And depending on how the exact situation is set up, maybe the computational requirements of one are higher or different than the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4544.911,
    "end": 4547.033,
    "text": "But that's the discussion to have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4547.573,
    "end": 4550.235,
    "text": "Do we want to have a B transition matrix?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4551.476,
    "end": 4554.198,
    "text": "Let's look at a nested model with temporal depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4555.239,
    "end": 4555.559,
    "text": "So here...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4557.813,
    "end": 4582.526,
    "text": " we have on the top level of the model s state two this is temporal depth happening at the upper level of the model three discrete time points in an upper level that is temporal depth there's also nesting within each um time step",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4583.595,
    "end": 4610.639,
    "text": " there's a cognitive rollout on three time steps this is one type of nested model but there's other nestings that can exist so here we see a depth of two and then at each level of the nesting there's three temporal depth but they're totally different in architecture and in function so it is the interesting discussion like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4612.682,
    "end": 4617.307,
    "text": " especially when we have to do multi-scale prediction, like Fermi estimation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4618.048,
    "end": 4620.431,
    "text": "So if the prediction is within one timescale,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4621.701,
    "end": 4624.043,
    "text": " there isn't necessarily a need to nest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4625.003,
    "end": 4633.148,
    "text": "But once we get into larger timescales or where there's recurrence over multiple timescales, it makes sense to have a nesting model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4633.168,
    "end": 4642.894,
    "text": "Like if we wanted to predict someone's activity over the next seven days, it might make sense to have a day model with a nested model inside of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4643.795,
    "end": 4664.767,
    "text": " because then within each day there could be parameter setting versus just trying to fit one time series and find the parameters that make that one time series oscillate in a circadian way instead we just need a day model with a very specific kind of simple transition and then a transition at a nested level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4665.834,
    "end": 4670.117,
    "text": " with a depth that's measured at the hourly or the minute time scale rather than the days.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4670.837,
    "end": 4676.48,
    "text": "And that becomes especially important when doing family-based model fitting like variational inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4677.201,
    "end": 4684.585,
    "text": "So we're not just getting all the data points and fitting a spline through them, but we actually need to have appropriate model structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4685.485,
    "end": 4692.73,
    "text": "Otherwise, free energy minimization will drive right off a cliff, just like we talked about with Axles bacterium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4693.601,
    "end": 4706.71,
    "text": " So if we want to do free energy minimization and model selection on model structures, we can find the best model relatively easily given the families that we've specified.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4707.351,
    "end": 4714.296,
    "text": "But there's no guarantees once we step outside of that spotlight that we're even in the right category structurally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4714.836,
    "end": 4721.061,
    "text": "And so that's why humans having these design motifs in mind and many, many, many more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4722.099,
    "end": 4735.665,
    "text": " helps us not get into what seems to be a global optimization based upon free energy minimization, but actually is a very relatively local optimization based upon unimaginative model structure learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4736.225,
    "end": 4736.465,
    "text": "Steven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4738.486,
    "end": 4738.866,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.886,
    "end": 4739.887,
    "text": "That's really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.107,
    "end": 4751.292,
    "text": "And it also ties into something I've been really thinking about in terms of the model in itself is these scales, these steps, you know, you're talking about the multi-year, decades,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4752.165,
    "end": 4755.467,
    "text": " When we're modeling, it's like, what do we have access to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.267,
    "end": 4765.553,
    "text": "So we tend to ascribe that in terms of what can we externalize and what can we use to put something into a model if it's instrumental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.633,
    "end": 4769.755,
    "text": "And then, of course, there's a question of, well, what is the realist perspective on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.215,
    "end": 4778.14,
    "text": "And what is there that's within our conscious awareness of being in the world, something that can be reported as an event, a story,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.98,
    "end": 4782.142,
    "text": " And what time scales are present there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4782.562,
    "end": 4784.643,
    "text": "When you get into 100 years, it's beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4784.903,
    "end": 4787.184,
    "text": "So then you're saying, okay, what are you going to extrapolate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.244,
    "end": 4789.465,
    "text": "What sort of temporal structure?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.966,
    "end": 4808.455,
    "text": "But on the other scale, if I'm asking what do I think I expect you to do next or Dean to do next, and it might seem intuitive, I can have a whole series of temporal and nested scales going on, which is not even available to me today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4809.85,
    "end": 4811.772,
    "text": " in a cognitive conscious way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.493,
    "end": 4824.644,
    "text": "I might have a sense, have a feel for what I think is going on, but a lot of my predictive processing will be happening at rates unavailable to my conscious awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.336,
    "end": 4839.526,
    "text": " So that also ties in, I suppose, I'm not saying it's an answer, it sort of adds to the challenge, I suppose, but it is the challenge of, you know, how much ends up being what we can get a measure on to put into our model as much as what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.927,
    "end": 4851.555,
    "text": "And that's the same challenge in a way that comes even from the realist perspective, at some level, as an organism, what is it that I even can access in some realistic way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.615,
    "end": 4852.776,
    "text": "Not saying we can model it or no,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.161,
    "end": 4855.622,
    "text": " could be put into something like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.662,
    "end": 4858.043,
    "text": "Sorry, Dean, you were going to say something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4858.104,
    "end": 4870.571,
    "text": "Well, all I was going to add is that, I mean, so the paper's talking about how do we use certain math to be able to understand maybe the evolution of cognition, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.611,
    "end": 4875.074,
    "text": "That's essentially what the paper's trying to give us, you know, point us in that direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.435,
    "end": 4875.535,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4876.539,
    "end": 4899.726,
    "text": " Again, in order to make this accessible, in order to lower the barrier for people who actually want to have this make sense, because they don't necessarily spend sums and sums of hours on trying to figure this stuff out, like the authors or maybe even us, I want to point out something that I think is obvious to us, but maybe not so obvious to people who are looking at this and going, I have no idea what they're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4900.882,
    "end": 4908.905,
    "text": " I think first of all is that there's a chronology which we keep going back to, not just at the temporal depth level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4909.025,
    "end": 4910.285,
    "text": "So that's relativity math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4910.766,
    "end": 4914.427,
    "text": "There's an evolutionary aspect to this, so that's algebraic math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4914.707,
    "end": 4917.348,
    "text": "And there's a dependency, so there's a statistical math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4918.068,
    "end": 4922.27,
    "text": "Do we have to be polymath in order to be able to feel our way through this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.55,
    "end": 4926.171,
    "text": "And I'm gonna go back to what I said at the end of the 37,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4929.279,
    "end": 4940.889,
    "text": " Carl Friston said, you don't have to be a polymath, but you better be at least somewhat comfortable, feeling comfortable with the math, because there's no one math that's going to get you here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4941.049,
    "end": 4948.555,
    "text": "It's a blending of all of them, and then it's how you feel about that that's probably going to be the thing that lowers your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4950.543,
    "end": 4957.145,
    "text": " the impediment to really being able to use this now in real practical terms going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.465,
    "end": 4959.705,
    "text": "So what's the next evolutionary step, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4960.345,
    "end": 4962.526,
    "text": "It's how you're able to turn this into something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.506,
    "end": 4967.847,
    "text": "So I think that's one of the great gifts of this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.167,
    "end": 4978.27,
    "text": "If you're not afraid of being, if you don't consider, if you don't identify now, or you don't duplicate now, or you don't allostat now as a polymath,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4979.684,
    "end": 4985.952,
    "text": " Maybe that's something we owe people that want to get into this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4988.376,
    "end": 4996.086,
    "text": "Maybe the British pronunciation of maths helps reflect that there's already a plurality of maths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4997.27,
    "end": 5013.427,
    "text": " And Kirby Erner, coming more from the synergetic side, talks a lot about this actually, like how the discourse around math as universal language makes it sound like math is a singular language when actually math is a pluriverse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5014.087,
    "end": 5016.57,
    "text": "And so math reflects that a little better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5018.263,
    "end": 5030.028,
    "text": " It's not like these are just sort of slopes on one mountain and that's Mount Math and it's so high and only a few people get to the top and scale every side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5030.728,
    "end": 5033.79,
    "text": "This is just like we're using maths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5035.01,
    "end": 5035.21,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5035.71,
    "end": 5036.451,
    "text": "Of all different kinds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5036.611,
    "end": 5036.831,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5038.186,
    "end": 5042.168,
    "text": " And often you see a lot of this in the papers that are published around active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.188,
    "end": 5049.192,
    "text": "There's often a team of people, a group of people, where maybe one member has that higher level understanding of the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5049.772,
    "end": 5055.175,
    "text": "But the other question is to understand what would it mean to make an observation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5056.135,
    "end": 5058.459,
    "text": " Now, the mathematician may not be the one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5059.62,
    "end": 5065.93,
    "text": "Some of the work with Ryan Smith's work on the gut, it was like, well, they're going to do gut inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5065.97,
    "end": 5070.217,
    "text": "Well, how do you get some tractable source",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.383,
    "end": 5072.504,
    "text": " on what's the gut doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5072.544,
    "end": 5084.012,
    "text": "So they created some electrode, I'm not quite sure how they did it, but they had some way of getting sensory information, effectively sensory information, or effectively some sort of information to put into their model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.813,
    "end": 5090.257,
    "text": "And so knowing how action and observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5091.53,
    "end": 5110.925,
    "text": " can flow in and the implications of that i think is also kind of a a big part of of this right and um in some cases it may be a trivial part because it's fairly obvious in other parts that may be the biggest barrier",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.967,
    "end": 5115.448,
    "text": " And that may be the biggest barrier as well, often in organisms, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.748,
    "end": 5125.031,
    "text": "How do you even access, plausibly, the approximation science, which isn't so approximate that it's just chaos, that it's tractable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.792,
    "end": 5141.256,
    "text": "Yeah, the rate-limiting step for impact and improvement in the real world is unlikely to be any single individual's conceptualization of math on a team.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5142.631,
    "end": 5143.872,
    "text": " if it's structured appropriately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5144.853,
    "end": 5152.201,
    "text": "And for those pushing the frontiers of math, their understanding of math is quite literally a rate limiting step for them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5153.843,
    "end": 5157.287,
    "text": "Or maybe it might be something very mundane like time availability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5157.868,
    "end": 5164.495,
    "text": "But when it comes to thinking about real model-based science and translational applications of active inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5167.802,
    "end": 5186.137,
    "text": " I think that we're working towards new ways of combining skills and having shared knowledge resources that help make that make sense and using shared language and ontologies, narratives, formal documents, tools, ONFT, because we're doing it on Teams and we're online.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5187.598,
    "end": 5189.84,
    "text": "Let's just, in the last 20, 30 minutes,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5191.533,
    "end": 5203.802,
    "text": " go through the final pieces of the paper so that this dot one will have been like a first sweep, initial pheromone deposition, and then we can return and take some cul-de-sacs, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5204.582,
    "end": 5216.65,
    "text": "So section nine explores a little bit how the duplication operation allows for multiple behaviors to arise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5217.933,
    "end": 5226.24,
    "text": " And that's sort of by analogy to the genomic duplications and specializations and all those different routes that can occur.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5230.843,
    "end": 5239.53,
    "text": "Here, they connected duplication a little bit more directly to the factor graph models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5244.764,
    "end": 5251.088,
    "text": " in the sense that duplicated motifs have dynamics that are conserved over different sensory motor domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5251.888,
    "end": 5257.912,
    "text": "So let's just say that we just had a visual model with the column of visual, and then we duplicated it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5257.972,
    "end": 5260.874,
    "text": "So now we have two photoreceptors with parallel columns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5261.714,
    "end": 5273.421,
    "text": "And now the photoreceptor in the second one changes into a chemoreceptor because instead of expressing rhodopsin protein, it's expressing an olfactory receptor protein.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5275.905,
    "end": 5300.439,
    "text": " can be a conservation of the dynamics of inference even when the observation has changed but it was a slot for observation and so we went from having like monocular vision to binocular vision to monocular vision and olfactory perception but you can't get there in one jump to just like duplicate and transpose",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5301.923,
    "end": 5304.265,
    "text": " It's not likely to happen in an evolutionary context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5305.025,
    "end": 5319.217,
    "text": "And we can see the structure of these graphical models as equivalent to being factorized probability distributions, which is to say that the sparse connectivity of variables",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5320.874,
    "end": 5328.18,
    "text": " means that we can make parts of the model that can be like fine-tuned independently in a way that can be fit very tractably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5328.84,
    "end": 5332.183,
    "text": "That's the factor graph, that's factorized Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5332.263,
    "end": 5344.413,
    "text": "And we've talked about that in other places, but just to here, all we need to say is duplication enables like a control C, control V, copy, paste, and then let's edit the other version.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5345.393,
    "end": 5349.737,
    "text": "But that can now happen with evolutionary features and functions, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5350.506,
    "end": 5356.808,
    "text": " Real quick, your hand gestures in this section point to the orthogonal mesh beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5358.908,
    "end": 5362.529,
    "text": "And then point two, I'd like to pull that apart a little bit, but let's carry on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5362.729,
    "end": 5364.89,
    "text": "But that's what I took away from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5365.37,
    "end": 5366.83,
    "text": "The mesh began.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5366.85,
    "end": 5369.911,
    "text": "And in the beginning, there was a mesh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5370.951,
    "end": 5371.411,
    "text": "Begins.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5372.071,
    "end": 5375.052,
    "text": "We'll return to that for dot two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5375.872,
    "end": 5375.972,
    "text": "Yeah."
  },
  {
    "start": 5376.593,
    "end": 5376.813,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5377.673,
    "end": 5377.973,
    "text": "Section 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5379.758,
    "end": 5397.01,
    "text": " talks about temporal depth, it's about time, and about the endowing of generative models with temporal depth and the way that that supports prospective inference, anticipation, or retrospective inference, which is like memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5399.232,
    "end": 5400.693,
    "text": "So here's what the operator looks like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5400.753,
    "end": 5407.378,
    "text": "We have X sub tau, X at a time point, and then now there's X tau plus one, the next time point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5408.388,
    "end": 5415.254,
    "text": " or T plus one could be now, and then T could be the last moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5416.055,
    "end": 5420.099,
    "text": "So memory and expectation- Like figure five now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5420.299,
    "end": 5424.042,
    "text": "Because I still see figure four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5428.306,
    "end": 5428.606,
    "text": "Slide 29.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5428.646,
    "end": 5428.826,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5428.866,
    "end": 5428.947,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5434.508,
    "end": 5439.231,
    "text": " So the structure of anticipation and of memory are very similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5439.691,
    "end": 5451.417,
    "text": "It just depends whether one has the stream of observations happening on the left side and a prospection or the stream of observations are on the right side and in which case it's retrospection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5451.477,
    "end": 5451.717,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5451.737,
    "end": 5454.539,
    "text": "Yeah, I mean, it sort of ties in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.579,
    "end": 5456.26,
    "text": "They talk about what the police do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5456.28,
    "end": 5458.121,
    "text": "It's very hard for someone to lie backwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.721,
    "end": 5461.422,
    "text": "So you always get them to tell their story backwards because it's a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5462.594,
    "end": 5478.96,
    "text": " It's very hard for them to do that because, as you say, if we're creating things retrospectively but sort of playing them forward, so to speak, it would kind of tie in with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.98,
    "end": 5480.301,
    "text": "I want to emancipate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5482.582,
    "end": 5484.423,
    "text": "I looked up police in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5484.443,
    "end": 5485.863,
    "text": "I see policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5488.775,
    "end": 5515.408,
    "text": " is that polices um it's a great opportunity for my favorite joke but i won't um this section talks about temporal depth okay from whence temporal depth various researchers have speculated that a major driving force for the development of deep temporal models was foraging",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5516.63,
    "end": 5525.379,
    "text": " And there's a lot of interesting empirical and conceptual reasons to think about foraging in terms of temporal and spatial depth of model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5526.9,
    "end": 5536.37,
    "text": "And that's true in the vertebrates where they're discussing mainly like hippocampus and entorhinal system and in the invertebrates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5537.219,
    "end": 5557.806,
    "text": " don't have a hippocampus entorhinal system but it's one reason why comparative neuroscience is so important because it prevents us from getting fixed on specific anatomical realizations of given functional attributes of evolutionary systems like if the story of memory is just about some brain region in humans",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5559.818,
    "end": 5586.104,
    "text": " it may be a useful model it's not even to say that it's inaccurate it's not even to say that it's a partial model it just is a model of that whereas if we want to understand a given cognitive function in a broader context we have to pull back somewhere a little bit beyond or in complement to the anatomy because we need the empirical anatomy to have anything specific to be talking about but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5587.0,
    "end": 5590.887,
    "text": " It isn't just the case that vertebrate anatomy is the way to do active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5591.628,
    "end": 5591.849,
    "text": "Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5593.031,
    "end": 5600.184,
    "text": "I think this is really helpful because it shows that the traps you were just mentioning there that people fall into is like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5600.95,
    "end": 5604.011,
    "text": " Humans have the frontal cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5604.071,
    "end": 5608.152,
    "text": "It's all about this new, what's the new parts of the brain that are there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5608.752,
    "end": 5610.972,
    "text": "But we don't say that with a Formula One car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5610.992,
    "end": 5615.353,
    "text": "We say, well, it's just got a primitive engine thing in there and the rest of it's evolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5615.413,
    "end": 5618.034,
    "text": "It's like, well, that's itself different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5618.614,
    "end": 5621.054,
    "text": "And the same with the Mark Soames conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5621.354,
    "end": 5628.056,
    "text": "The evolution of what's often dismissed as the primitive parts of the brain,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.406,
    "end": 5633.287,
    "text": " They, they themselves can have been more sophisticated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5633.327,
    "end": 5652.894,
    "text": "I know they're doing more things, but that they, they, they, they may be helped to be doing more than they were, as opposed to this, something else, um, that is doing all the heavy lifting, which I think is certainly common, a common misconception, I think in psychology anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5652.914,
    "end": 5656.575,
    "text": "Can I read quickly from the paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.035,
    "end": 5657.195,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5658.833,
    "end": 5667.273,
    "text": " The evolution of temporally deep models from simpler models could have been realized during evolution via the progressive, keyword here, parcellization,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.396,
    "end": 5674.817,
    "text": " of an initially undifferentiated model, so a relative sense of an invariance, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5674.837,
    "end": 5682.118,
    "text": "a model that does not distinguish present from past and future, into a model that features separate latent states for the past, present, and future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5683.079,
    "end": 5683.959,
    "text": "This is the part I loved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.279,
    "end": 5696.441,
    "text": "A key drive for this factorization or parcellation may have been the observation and progressive internalization of the sensory motor sequences sequentially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5697.219,
    "end": 5701.643,
    "text": " that the animal creates and experiences while acting, while acting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5701.823,
    "end": 5705.566,
    "text": "In other words, the self-modeling of one's own sequential behavior patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.966,
    "end": 5708.188,
    "text": "See 53 for a computational example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5708.528,
    "end": 5715.234,
    "text": "I didn't open up 53, but again, if we want to talk about the polymath piece of this and the fact that our hex cells",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.414,
    "end": 5727.356,
    "text": " have to do some parcelization, it's right there in terms of sort of the next layer on top of this as we move up through that evolutionary cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5729.417,
    "end": 5738.719,
    "text": "Yeah, 53 is Stoyanov et al., the hippocampal formation as a hierarchical generative model supporting generative replay and continual learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5740.421,
    "end": 5746.246,
    "text": " There's a ton that could be said about that from like a computational and a neuro anatomical perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5748.028,
    "end": 5757.436,
    "text": "The internalization of the sensory motor sequences relates to the sensory motor detachment that we talked about in the representation paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5758.136,
    "end": 5761.759,
    "text": "So if some motor region in the brain",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5762.836,
    "end": 5767.198,
    "text": " if it's like a marionette and the fingers and then the motor plant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5767.978,
    "end": 5777.642,
    "text": "So that motor region has to be coupled to the activity of that motor region, like either in a one directional way or maybe even in a bi-directional way, let's just say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5778.223,
    "end": 5783.645,
    "text": "So that system, like as it thinks, so it does and vice versa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5784.745,
    "end": 5787.847,
    "text": "It cannot engage in counterfactuals because any,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5789.306,
    "end": 5794.032,
    "text": " direction that the neural system turns, the motor system is just simply doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5794.993,
    "end": 5801.04,
    "text": "So it is not able to engage over evolutionary time in maladaptive action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5802.165,
    "end": 5825.592,
    "text": " ones that do no longer persist it's just it's always what ties it back to reality and to like the finite amount of entities on the finite spaceship earth like darwin's famous calculation like if the number of elephants slowly reproducing like they'll cover the earth unless their population levels are kept in check and so um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5826.38,
    "end": 5855.861,
    "text": " once there's sensory motor detachment so there's some brain region either a motor region or some supplemental area or some ancillary area that's able to intervene in that process or somehow play a role that's detached from the motor activity now there can be like a motor planning occurring that opens up the affordance of temporal depth or of counterfactuals all these other cognitive functions arising",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5857.316,
    "end": 5880.619,
    "text": " via the sensory motor detachment and so um foraging is an awesome place to look at that for a lot of reasons in different life forms and computational foraging and so like just a few of the notes were like what are the real cognitive demands of foraging for different creatures and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5881.564,
    "end": 5884.125,
    "text": " What about internal foraging, like mental foraging?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5884.925,
    "end": 5886.665,
    "text": "And these papers are very good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5887.306,
    "end": 5907.711,
    "text": "Foraging in mind and foraging in semantic fields, both very useful because they have to do with the way that, and they have some nice maths too, but they have to do with how actions that are spatial can have conserved dynamics structurally",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5908.769,
    "end": 5911.71,
    "text": " just like we explored here to mental actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5912.311,
    "end": 5916.092,
    "text": "And then we see them come together like with a memory palace or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5917.953,
    "end": 5920.154,
    "text": "So forging is cool, it's good to study.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5921.915,
    "end": 5925.857,
    "text": "11, endowing generative models with hierarchical depth affords multi-scale inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5926.437,
    "end": 5929.159,
    "text": "We kind of addressed that earlier with like the decades and years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5929.899,
    "end": 5933.901,
    "text": "Nested temporal modeling is not the same as just deep temporal modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5936.858,
    "end": 5963.259,
    "text": " then um and another way to look at that is like how many operations you would need to get to 100 years well if you're going to do only temporal depth it's going to take plus 100 or 99 time steps versus if it's one nesting and then 10 on the higher order than 10 on the lower order it was 21 operations and so then there's shorter",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5964.528,
    "end": 5989.943,
    "text": " sequence of events to achieve a higher performance model assuming that they're appropriate um section 12 uh yeah go ahead just one thing just on that model and it's also interesting thinking about how we think of time because like indigenous approaches tends to be well as a cyclical time right so things in the future will be a repeat of the cycle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5990.723,
    "end": 6005.614,
    "text": " So the times of a thought in a cyclic motion of this sort of passing of the day, passing of the... And of course we have this assumption of time stretching out, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6006.235,
    "end": 6014.281,
    "text": "So is it that we will, over time, is it thought of, well, what will things be like in four generations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6015.712,
    "end": 6031.456,
    "text": " And, um, and if my world or my ecology follows certain cyclical patterns and it's fairly stable, maybe that's quite a good way to think about, um, you know, it's like say plant, plant the tree now to help the people in 150 years, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6031.936,
    "end": 6041.098,
    "text": "So, um, it sort of comes back to there's different ways to construct how we think about time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6041.118,
    "end": 6044.979,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6046.764,
    "end": 6070.34,
    "text": " so 12 looks into a phylogenetic tree of the evolution of generative model so what is a phylogenetic tree and what's the relationship between active inference fep and evolution well we'll have more to share in the coming papers as always but how do they address it specifically here in figure five",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6073.314,
    "end": 6075.695,
    "text": " they map on, we'll root the tree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6076.255,
    "end": 6079.577,
    "text": "So technically as shown right here, it's an unrooted tree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6079.797,
    "end": 6097.084,
    "text": "There is an implicit rooting here, but it's a very interesting feature of phylogenetics that few outside of the field know about that computationally, the tree is often inferred in unrooted fashion, like by clustering the ones that are close and finding the relationships, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6098.085,
    "end": 6098.425,
    "text": "However,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6099.853,
    "end": 6105.035,
    "text": " that is leaving an ambiguity as to where the root of the tree is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6106.416,
    "end": 6115.34,
    "text": "So like, for example, if this is the overall connectivity of the, based upon the phylogenetic inference, this is what the tree topology has been inferred to look like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6116.42,
    "end": 6124.003,
    "text": "And somebody might say, well, it looks like this one, the red one, and then the green one below it, they're clearly very closely related.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6124.984,
    "end": 6127.385,
    "text": "But actually if the root comes in here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6129.392,
    "end": 6155.076,
    "text": " then that's not necessarily the case so the rooting of a phylogenetic tree is very important and a tree that's rooted inappropriately or has an inappropriate outgroup selection is just it's worse than illegible because it's highly legible and it can have a high statistical confidence but it can have an absolutely non-biological topology but assuming that they meant the tree to be rooted here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6157.145,
    "end": 6165.692,
    "text": " Here, the branches are where there's going to be different operators occurring, including the eye identity, unchanging one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6166.853,
    "end": 6172.997,
    "text": "And then the edges reflect like bifurcations, speciation events.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6173.778,
    "end": 6176.0,
    "text": "So here there's an ancestral homeostat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6176.94,
    "end": 6182.505,
    "text": "And then the lineage leading to orange did not undergo any changes that were non-conservative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6183.729,
    "end": 6207.632,
    "text": " on the branch leading to these sister species there was a duplication and then it stayed the same and stayed the same and then the purple node is going to have two duplicated homeostats and so they're just overlying evolutionary algebra the steps that they gave onto the topology of speciation and so that um as they discuss",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6209.989,
    "end": 6227.799,
    "text": " opens up a way to think from this sort of graphical functional perspective, which is compatible with ACT-INF, to think about how, for example, from the species today, we could infer some of the schema of the early vertebrate brain or the early primate brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6227.819,
    "end": 6228.66,
    "text": "Or push it back further.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6229.12,
    "end": 6231.681,
    "text": "What about the common ancestors of the vertebrates and the invertebrates?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6232.922,
    "end": 6233.803,
    "text": "And all these other questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6233.883,
    "end": 6235.364,
    "text": "But that's kind of what they lay out here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6236.577,
    "end": 6249.67,
    "text": " And so these are familiar models to evolutionary biologists, like phylogenetic ancestral state reconstructions of phenotype, which are often even done in a Bayesian way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6250.371,
    "end": 6254.996,
    "text": "Like there's an algorithm beast, Bayesian estimation of ancestral states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6256.697,
    "end": 6257.999,
    "text": "This is also a Bayesian model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6259.048,
    "end": 6286.532,
    "text": " model that allows us to do reconstruction of ancestral states but it's in a very very different way than it's been approached outside of the active world but that's figure five and that's where we see the evolutionary algebra the design patterns or the um pattern language for structural changes in generative model superimposed on species relatedness in a phylogenetic tree",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6293.962,
    "end": 6295.003,
    "text": " Any thoughts on five?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6296.744,
    "end": 6312.376,
    "text": "I tried to convert this and reapply it to my picking of teams in the March Madness table, and I wasn't able to take phylogenetic trees and convert them into winning thousands of dollars on betting on college basketball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6312.477,
    "end": 6319.202,
    "text": "So despite my best efforts, it's kind of contained for what it represents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6320.882,
    "end": 6327.386,
    "text": " I mean, not to foreshadow too hard, but I think live stream number 39 and 40 might constitute March Madness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6329.947,
    "end": 6333.589,
    "text": "And then also here's another, you know, for those who watch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6333.609,
    "end": 6339.012,
    "text": "Okay, here, now we have a little bit of a March Madness bracket going, don't we?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6339.232,
    "end": 6340.253,
    "text": "Here's bracketology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6341.894,
    "end": 6343.294,
    "text": "That is so fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6343.955,
    "end": 6344.615,
    "text": "So here we go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6345.236,
    "end": 6349.398,
    "text": "Yeah, so now we have, now here, the root could have been here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6350.984,
    "end": 6357.108,
    "text": " And then here's like two big species clades, like two, like this is like vertebrates and invertebrates, and then there's some rooted clade.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6358.509,
    "end": 6365.873,
    "text": "So that's like why it's important to root the tree because here it looks like all of these are sister to each other at the exclusion of this one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6366.534,
    "end": 6375.759,
    "text": "But then if we were to have rooted that tree like here, then actually this is a small sister out group to all of these.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6377.2,
    "end": 6379.522,
    "text": "And so the rooting and the contextualizing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6380.575,
    "end": 6381.555,
    "text": " is really important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6381.775,
    "end": 6392.137,
    "text": "It's just like, it's super interesting because it seems like you put in so much data into these phylogenetic models and it seems like literally how could this not converge on a super obvious answer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6392.437,
    "end": 6397.559,
    "text": "I mean, isn't it clear how these answer related to each other phylogenetically?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6398.419,
    "end": 6400.419,
    "text": "But then there's a little bit of nuance that enters the picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6400.599,
    "end": 6400.859,
    "text": "Steven?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6403.58,
    "end": 6409.481,
    "text": "Yeah, I was curious that the allostatic can recombine with the homeostatic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6410.919,
    "end": 6412.621,
    "text": " to give a base level temporal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6413.782,
    "end": 6422.712,
    "text": "So it doesn't deflate back to just staying allostatic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6422.732,
    "end": 6424.734,
    "text": "I suppose they would be, they just don't show that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6425.434,
    "end": 6431.361,
    "text": "If it did that, I suppose you just wouldn't talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6432.637,
    "end": 6438.242,
    "text": " You know, it's got A. When it goes A, then it goes A, I, goes to HT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6439.123,
    "end": 6440.404,
    "text": "So, yeah, it's a TH.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6440.464,
    "end": 6443.107,
    "text": "Yeah, so we have a homeostat here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6443.167,
    "end": 6444.288,
    "text": "We have two homeostats.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6445.489,
    "end": 6446.149,
    "text": "Two homeostats.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6446.209,
    "end": 6450.633,
    "text": "And now here we have one homeostat and one allostat in this blue node.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6451.414,
    "end": 6451.794,
    "text": "And so that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6455.345,
    "end": 6483.952,
    "text": " but they're just kind of giving general examples like it would have been cool to see this is where we're talking about mammals and here's non-mammal vertebrates like here is a specific brain region and also that is in this Chakraborty and Jarvis 2015 paper this paper gets more into the nuances of neuroanatomy and neurogenetics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6485.433,
    "end": 6495.218,
    "text": " and how duplication in brain regions can be underpinned by developmental neurogenetic changes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6495.918,
    "end": 6508.964,
    "text": "And they do link that a little bit more closely to studying the bird brain and the song and motor system in parrots, which is also cool because birdsong has been studied with Act-Inf.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6509.004,
    "end": 6510.285,
    "text": "So there could be a nice...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6511.53,
    "end": 6521.201,
    "text": " building upon this work and connecting it to some of the structure fitting in figure five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6521.821,
    "end": 6530.25,
    "text": "So it could almost be like you got parts of the brain which are more allostatic orientated or homeostatic orientated and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6531.58,
    "end": 6542.149,
    "text": " So in a way, by the structuring of that gives some sort of differentiation in terms of how information and control would be carried out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6543.03,
    "end": 6544.071,
    "text": "Yeah, totally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6544.151,
    "end": 6550.596,
    "text": "And extending temporal depth within a model, it's like a brain region getting a little bigger, let's just say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6550.936,
    "end": 6556.841,
    "text": "Not that size is correlated with function in that specific way, but then duplicating brain regions is like duplicating...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6557.89,
    "end": 6560.852,
    "text": " laterally or nesting a brain region that's hierarchical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6561.673,
    "end": 6565.235,
    "text": "Think about how the eyes developed, the insect eye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6566.296,
    "end": 6580.605,
    "text": "It has a relatively simple module, but then insect eyes can change in size over evolutionary time very radically from like taking up, you know, half of the head to being just one photoreceptor or even being lost.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6582.028,
    "end": 6587.35,
    "text": " because they're existing in more of a duplicable motif.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6588.21,
    "end": 6600.575,
    "text": "Whereas the binocular eye system that mammals have, it's not as amenable to like just doubling into four eyes or splitting into two in the middles or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6600.795,
    "end": 6604.296,
    "text": "Whereas the insect compound eye has like some of those evolutionary affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6606.217,
    "end": 6609.758,
    "text": "So then understanding like parameter change within a model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6610.811,
    "end": 6632.418,
    "text": " then structure learning on populations of models and what are the mutational adjacencies there's so many awesome areas and it's like truly just beginning for evolutionary bio and active steven yeah it was really helpful like having someone like yourself who's got that background to go through that's quite helpful because it's a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6633.444,
    "end": 6640.29,
    "text": " It's a little bit intimidating, actually, at first sight, seeing this for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6640.951,
    "end": 6642.532,
    "text": "And I see the logic, what you're saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6642.672,
    "end": 6644.874,
    "text": "It's quite exciting actually seeing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6645.255,
    "end": 6657.866,
    "text": "Again, one of the things this paper does is it's tying threads together, which seem very distant, almost in traditional terms like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6659.417,
    "end": 6666.304,
    "text": " well, I don't like using the word kamikaze, but it's a little bit like, yeah, it's a bit overwhelming often.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6666.364,
    "end": 6672.83,
    "text": "So I think it's, but of course that's the beauty of Act-Inf is it has that unifying potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6674.031,
    "end": 6674.452,
    "text": "So thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6675.252,
    "end": 6675.553,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6675.653,
    "end": 6676.173,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6676.354,
    "end": 6678.335,
    "text": "I agree, like there's some labelling",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6679.298,
    "end": 6686.646,
    "text": " This is rarely included, unless it's a time-calibrated phylogenetic tree, but we're looking at the passage of time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6687.887,
    "end": 6690.09,
    "text": "But that's not even always shown.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6690.39,
    "end": 6694.174,
    "text": "And so, yes, Dean, we'll have our final thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6694.514,
    "end": 6695.896,
    "text": "Can you just go back to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6696.296,
    "end": 6699.54,
    "text": "Because I didn't prompt you to put that up there, but I really like that because...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6701.266,
    "end": 6707.129,
    "text": " At some point, we're going to have to, in point two, talk about that sort of basal gating part of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6707.91,
    "end": 6714.473,
    "text": "And most things are organized as if-then causality, but you just said it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6714.573,
    "end": 6715.313,
    "text": "It's then-if.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6716.514,
    "end": 6723.537,
    "text": "Go or don't go is very dependent on then before we choose to go or don't go, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6723.857,
    "end": 6728.64,
    "text": "Go or don't go is still held open until one of the others decided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6728.8,
    "end": 6728.98,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6730.769,
    "end": 6731.91,
    "text": " Another thank you for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6731.97,
    "end": 6737.174,
    "text": "Cause that again, that in the point two, we should maybe talk a little bit about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6741.978,
    "end": 6742.258,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6742.298,
    "end": 6742.659,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6742.979,
    "end": 6747.743,
    "text": "There's so many ways to think about like this garden of forking paths, branching paths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6749.471,
    "end": 6753.715,
    "text": " how that relates to parameter updating, Bayesian belief updating and structure learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6754.656,
    "end": 6758.539,
    "text": "What about when the structure of a model is a parameter in a nested model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6759.24,
    "end": 6767.187,
    "text": "So then that sort of blurs the line from the bottom looking up, it looks like structure learning, but then from the top looking down, it looks like parameter fitting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6769.109,
    "end": 6771.691,
    "text": "And if only we had like some mathematics to describe that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6776.282,
    "end": 6781.645,
    "text": " Okay, any final thoughts or what are we excited about for The Dot 2 next week?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6783.507,
    "end": 6789.27,
    "text": "Well, my last thought is, yeah, I'm excited to keep this going because I think it's got a lot of legs to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6789.29,
    "end": 6798.297,
    "text": "I think one thing that comes to mind as well with all this progressively increased tempo and hierarchical depth",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6798.997,
    "end": 6824.887,
    "text": " is is maybe where some of the more basic uh elements still have a really useful part to play is is what mark mike levin said about when do we stop like so we've got all these ways where we can start to okay so we've got all these ways that we can think how do we know when to stop and to sit down i mean maybe in the ultimate ways when our tummy maybe that's where the gut is so useful like at the end of the day the brain can go running off and maybe the gut and the heart need to say okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6827.288,
    "end": 6842.144,
    "text": " sit down get some food so which i might well i'm going to get a drink of honey now but uh i'll bid you farewell and thank you for a great dark time but i'll i'll hear your last thoughts as well dean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6843.73,
    "end": 6847.132,
    "text": " Uh, I hate having the last word, so don't worry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6847.712,
    "end": 6848.192,
    "text": "You'll have it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6848.372,
    "end": 6850.593,
    "text": "And I just appreciate what Steven just said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6850.633,
    "end": 6858.217,
    "text": "Cause I, I think that that's a big part in this ability to go from word back into the phenomenological space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6858.597,
    "end": 6868.242,
    "text": "And, and I think there are other, other brains that we know of now that play a significant role in that, not just the one that turns everything into symbols.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6870.302,
    "end": 6870.522,
    "text": " Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6871.384,
    "end": 6875.491,
    "text": "My last thought is there's no better drink after a foraging trip than honey.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6879.377,
    "end": 6879.677,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6881.36,
    "end": 6881.761,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6881.961,
    "end": 6882.722,
    "text": "And talk to you later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6883.724,
    "end": 6883.884,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6884.545,
    "end": 6884.706,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]