[
  {
    "start": 29.192,
    "end": 30.553,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.933,
    "end": 36.417,
    "text": "It's Actinth Lab live stream number 38.0, February 10th, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.517,
    "end": 43.722,
    "text": "We're going to be discussing the paper, The Evolution of Brain Architectures for Predictive Coding and Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.486,
    "end": 70.471,
    "text": " welcome to the active inference lab we are a participatory online lab that is communicating learning and practicing applied active inference you can find us at some of the links here on the slide this is a recorded and archived live stream so please provide us with feedback so we can improve on our work all backgrounds and perspectives are welcome here and we'll be following good video etiquette for live streams it's going to be a solo stream though",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.537,
    "end": 83.706,
    "text": " Go to ActiveInference.org if you want to learn more about how to participate or contribute or get involved with any ActiveInfLab project and check out this Coda link to see past and upcoming live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.387,
    "end": 85.348,
    "text": "The page looks like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.728,
    "end": 89.451,
    "text": "So you can see events that haven't happened yet, like 39, 40.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.233,
    "end": 95.336,
    "text": "And then also you can look back and you can see who is participating and read the papers and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.177,
    "end": 97.398,
    "text": "So check it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.239,
    "end": 99.7,
    "text": "Today in ActiveStream,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.141,
    "end": 108.481,
    "text": " Number 38, the goal is to learn and discuss this cool paper, the evolution of brain architectures for predictive coding and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.585,
    "end": 115.647,
    "text": " the papers by Giovanni Pizzulo, Thomas Parr, and Carl Fristen from December, 2021.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.407,
    "end": 120.408,
    "text": "And just like all videos, it's just an introduction to some of the ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.508,
    "end": 122.649,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.969,
    "end": 124.85,
    "text": "So go check out the paper to learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.91,
    "end": 132.112,
    "text": "And there's going to be an overview with first names and claims, abstract and roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.372,
    "end": 134.152,
    "text": "All right, I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.172,
    "end": 135.673,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.383,
    "end": 148.812,
    "text": " The big question that this paper is getting at is what is the evolutionary neurophysiological basis of cognition and how do complex cognitive phenotypes arise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.653,
    "end": 152.675,
    "text": "So how do things develop and evolve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.595,
    "end": 156.918,
    "text": " how they think, and how does that change over evolutionary time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.819,
    "end": 164.106,
    "text": "And shown here are three images representing three scales of analysis of looking at ant cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.686,
    "end": 175.517,
    "text": "So on the left is a representation of the synapse with the glia wrapped around it and the molecules and some of the mechanisms because changes in those mechanisms can influence cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.789,
    "end": 184.345,
    "text": " Then in the middle is a 3D representation of an ant brain with the different brain regions like the central complex and the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.549,
    "end": 187.01,
    "text": " optic and the olfactory lobes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.99,
    "end": 195.294,
    "text": "And this represents the level of regional or micro or meso-anatomical variation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.414,
    "end": 198.796,
    "text": "And that definitely changes over evolutionary time, just like the synaptic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.616,
    "end": 202.858,
    "text": "And then there's this behavioral ecological level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.258,
    "end": 206.559,
    "text": "And that's where the ants are engaging in collective behavior and stigmergy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.2,
    "end": 209.661,
    "text": "And so how does this all work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.762,
    "end": 213.643,
    "text": "How does this all work in today's ants and how has it evolved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.175,
    "end": 218.016,
    "text": " And then expand that to other species and other questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.777,
    "end": 229.299,
    "text": "The paper was published right at the end of 2021 in December in the Royal Society of Publishing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.559,
    "end": 234.9,
    "text": "And just to go over the aims and claims of the paper, this is in the author's words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.96,
    "end": 243.122,
    "text": "There's growing consensus that the brains of humans and other phylogenetically derived or advanced organisms operate in a predictive manner",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.723,
    "end": 255.35,
    "text": " across perception and action control , yet the ways in which our advanced predictive abilities may have arisen during evolution remain unclear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.651,
    "end": 262.195,
    "text": "The goal of this article is to sketch an evolutionary history of brain architectures for predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.332,
    "end": 291.504,
    "text": " central tenet of our proposal is that although prediction is often characterized as a complex cognitive function it is not a late evolutionary addition of advanced animals like us rather in distinction to a late stage cognitive argument like saying language is what makes us an advanced cognizer or semantic language with certain types of syntax rather our complex predictive abilities e.g planning and imagination",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.509,
    "end": 294.23,
    "text": " emerged gradually, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.27,
    "end": 311.038,
    "text": "via phyletic gradualism, smooth changes through evolutionary time, or punctuated equilibrium, sharp changes through evolutionary time, but punctuated at one scale is smooth at another, from simpler predictive and error correction loops, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.438,
    "end": 321.003,
    "text": "motor and autonomic reflexes, that were already part of the brains of our earlier evolutionary ancestors and were key to solving adaptive regulation problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.003,
    "end": 336.874,
    "text": " So just like Mike Levin's paper was addressing the question of basal cognition from the bioelectric perspective, here is going to be more of a predictive processing and action inference perspective on the functional aspects, not on the mechanistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.214,
    "end": 339.956,
    "text": "So the bioelectric was down here at the level of cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.656,
    "end": 344.419,
    "text": "This is going to be approaching it from a little bit of a different perspective, but we'll find out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.54,
    "end": 347.121,
    "text": "Here's the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.462,
    "end": 352.443,
    "text": " This article considers the evolution of brain architectures for predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.124,
    "end": 360.587,
    "text": "We argue that brain mechanisms for predictive perception and action are not late evolutionary additions of advanced creatures like us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.847,
    "end": 375.192,
    "text": "Rather, they emerged gradually from simpler predictive loops, for example, autonomic and motor reflexes that were a legacy from our earlier evolutionary ancestors and were key to solving their fundamental problems of adaptive regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.65,
    "end": 385.554,
    "text": " We characterize simpler to more complex brains formally in terms of generative models that include predictive loops of increasing hierarchical breadth and depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.654,
    "end": 392.217,
    "text": "These may start from a simple homeostatic motif and be elaborated during evolution in four main ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.797,
    "end": 405.683,
    "text": "These include the multimodal expansion of predictive control into an allostatic loop, its duplication to form multiple sensory motor loops that expand an animal's behavioral repertoire,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.559,
    "end": 419.853,
    "text": " and the gradual endowment of generative models with hierarchical depth to deal with aspects of the world that unfold at different spatial scales, and temporal depth to select plans in a future-oriented manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.417,
    "end": 427.921,
    "text": " In turn, these elaborations underwrite the solution to biological regulation problems faced by increasingly sophisticated animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.722,
    "end": 437.808,
    "text": "Our proposal aligns neuroscientific theorizing about predictive processing with evolutionary and comparative data on brain architectures in different animal species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.508,
    "end": 440.749,
    "text": "And just looking ahead, here's a figure that we're going to get to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.71,
    "end": 443.051,
    "text": " Here's the ancestral state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.411,
    "end": 444.271,
    "text": "It has this structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.611,
    "end": 445.092,
    "text": "It's a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.012,
    "end": 451.374,
    "text": "And then it's going to undergo a set of different types of discrete operations that change it structurally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.594,
    "end": 458.097,
    "text": "And that's structure learning, and it's going to happen over evolutionary timescale, and it's going to be tied to functional architectures for predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.778,
    "end": 462.079,
    "text": "Okay, how do they go from here to there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.879,
    "end": 463.84,
    "text": "This is the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.87,
    "end": 473.294,
    "text": " After the introduction, they introduce predictive regulation and control, perception, cognition, and control, action, as basic design principles of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.494,
    "end": 481.358,
    "text": "So kind of taking that embodied approach, but making it very operational and functional so that it can be studied from an evolutionary function perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.458,
    "end": 490.062,
    "text": "Introducing the brain as doing structure learning in generative models over evolutionary and also other timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.459,
    "end": 502.105,
    "text": " They then give three examples of simple predictive motifs in ancestral brains, which is the homeostatic control, the allostatic control, and the simple behavioral learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.405,
    "end": 509.749,
    "text": "Then they introduce that figure that we just looked at, and that's the evolutionary algebra of structure learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.029,
    "end": 515.712,
    "text": "Just like you can multiply and add, these are kind of like operations on evolutionary spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.92,
    "end": 529.186,
    "text": " They then discuss a few finer points related to behavioral switching, temporal depth, hierarchical depth, and then take a phylogenetic perspective at the end, giving an example, and there's a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.587,
    "end": 542.933,
    "text": "Okay, so to go into section two and just sort of deal with the keywords and themes as they are needed, here's figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.487,
    "end": 564.052,
    "text": " In Figure 1, the reason why we can even jump in here without going to any keywords is it's biology we're talking about, and we can jump in, why not, as good a place as any to go in at the action-perception loop and then connect it to some of the analytical or mathematical formalisms of active inference and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.692,
    "end": 570.614,
    "text": "So this is Figure 1 in the paper in Section 2, the action-perception cycle and predictive regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.374,
    "end": 577.538,
    "text": " So here's our entity, our agent on the left, and here is our world state on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 579.5,
    "end": 581.361,
    "text": "The entity is engaged in prediction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.796,
    "end": 586.117,
    "text": " while they're making observations that are being emitted from the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.617,
    "end": 588.577,
    "text": "That's resulting in some discrepancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.897,
    "end": 591.458,
    "text": "Either things are exactly as expected or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.878,
    "end": 600.52,
    "text": "So an example would be in the visual field, the brain is generating a prediction of what is in the blind spot of the retina.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.84,
    "end": 609.262,
    "text": "And then if the eyes were to move there to use action, changing the world in terms of the stimuli coming in through ocular motor action,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.58,
    "end": 625.91,
    "text": " that would result in a different perception that could either confirm or deny, confirm with a low discrepancy or be very surprising with a high discrepancy, what was expected about what was in the blind spot, which would confirm accuracy in a visual model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.75,
    "end": 634.616,
    "text": " So in this partitioning of action and perception, which is just very descriptive, it's not quite the Bayesian graph that we're going to get to later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 635.196,
    "end": 636.717,
    "text": "It's kind of like a flow model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.998,
    "end": 639.66,
    "text": "And there's probably other flow models that could be used as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.2,
    "end": 647.686,
    "text": "But it turns out that this partitioning or this way of thinking about flow, at least conceptually, leads to in the active inference proposal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.7,
    "end": 675.386,
    "text": " this idea of using a free energy minimizing function over some math that we'll get to a little bit more formally in the next figure, and using a kind of combined metric that has two parts, the red and the blue, to make decisions about perception as well as action, because it turns out that perception and action and cognition and metacognition are all part of the entity's model that it's doing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.346,
    "end": 704.712,
    "text": " inference on in certain cases so just to kind of throw back to not so long ago here we have the f of q that's the distribution that's under the entity's control and y and so it's as a function of beliefs and data there's going to be some term and so just looking back to 37 we looked at the variational free energy and how that relates to perceptual inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.532,
    "end": 728.566,
    "text": " where there's a penalty for overfitting as well as a penalty for failing to explain the data so it's kind of making a visual model or a perceptual model that in that snapshot given the priors and precision and all that is not overfitting but it is fitting the data and it's kind of existing on that frontier and then it's using variational inference to solve that in a really tractable way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.5,
    "end": 733.064,
    "text": " And then when action comes into play, a few things happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.285,
    "end": 740.273,
    "text": "First, the agent has to incorporate their own preferences because why care about action if you don't even care why it's gonna happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.874,
    "end": 748.463,
    "text": "So they have to incorporate their preferences, which is a non-arbitrary in a sense for action selection, but it's arbitrary in a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.563,
    "end": 759.53,
    "text": " as well as incorporating the fact that there's uncertainty over the consequences of action or just future states of the world, not just like sensor measurement as in other cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.07,
    "end": 768.697,
    "text": "So we have to take this variational free energy calculation that was just like snapshot perception and expand it a little bit to the expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.997,
    "end": 773.14,
    "text": "So here's F in the background, and now there's this expected free energy term G,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.221,
    "end": 791.163,
    "text": " which is over also an action selection policy z and now there's kind of similar like resonating or rhyming terms but rather than overfitting the imperative on the left side is to satisfy preferences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.495,
    "end": 802.16,
    "text": " On the right side, the penalty for failing to explain the data is kind of transposed into this failing to minimize expected surprise of future data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.66,
    "end": 811.765,
    "text": "So this is like fitting the expectations well on the right side in blue, and then living up to your preferences and expectations in an optimistic way on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.105,
    "end": 815.487,
    "text": "So it's kind of like realism on the right and optimism on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.429,
    "end": 846.799,
    "text": " that is what we talked about in 37 and that's the partitioning that's being done basically here the authors are setting that up as the action perception cycle and predictive regulation just wanted to kind of view 37 really quick because it was a fun discussion that we had it also really sets the stage for how is that similar or different than other action perception partitionings or models does evolutionary psychology or evolutionary cognitive studies do they have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.101,
    "end": 872.315,
    "text": " fundamental action perception model at the root is that a good thing is it a bad thing section three goes into section two again was just about how this single slide and represented in figure one about this predictive so anticipatory but also embedded etc infinity loop cycle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.448,
    "end": 875.15,
    "text": " is the basic principle of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.27,
    "end": 895.946,
    "text": "We can't take the basic principle of the brain to be some lower level, like just information transmission amongst cells, nor do the authors jump in at a higher level, like the fundamental unit of cognition is linguistic tokens that are being modified, not discrepancies with multiple different kinds of things that are being predicted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.848,
    "end": 899.91,
    "text": "From this functional description of cognition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.069,
    "end": 907.054,
    "text": " They move to section three, formalizing brain design as structured learning in generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.154,
    "end": 910.416,
    "text": "So what is the structure of this model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.877,
    "end": 915.18,
    "text": "And then what does it look like to do structured learning in that model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.94,
    "end": 916.821,
    "text": "And why is it generative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.642,
    "end": 919.163,
    "text": "And then how is that formalized?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.266,
    "end": 926.088,
    "text": " So here's figure two, the generative model and the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.328,
    "end": 929.689,
    "text": "So the first word's the same, second word's different, so they're different words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.569,
    "end": 935.37,
    "text": "And the figure on the left side has the entity, and the figure on the right side has the world state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.571,
    "end": 938.391,
    "text": "So it's the same action perception loop we saw in figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.912,
    "end": 949.255,
    "text": "And now this sort of conceptual flow, single edge model, like just only one arrow here, no extra anything, just sort of first pass,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.43,
    "end": 953.794,
    "text": " It's compatible with this, which is actually a Bayesian graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.274,
    "end": 956.316,
    "text": "But how do they describe it and what are all the variables?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.077,
    "end": 958.639,
    "text": "We still have the same things happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.3,
    "end": 963.164,
    "text": "We have the observations coming in to the cognizing entity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.664,
    "end": 965.166,
    "text": "That's the observations coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.809,
    "end": 971.253,
    "text": "The entity is going to infer some action policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.591,
    "end": 980.756,
    "text": " based upon the observations coming in, which is going to result in some change to the actual underlying system, which is the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.036,
    "end": 986.54,
    "text": "So that's like the actual birds and the bees and the sun and stuff, allegedly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.731,
    "end": 995.796,
    "text": " It does get into a little bit of a gray area with the realism, instrumentalism, and the structural realism, but we're not even gonna go there in this discussion right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.637,
    "end": 1000.359,
    "text": "The generative process is the one that's handing out the observations as modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.28,
    "end": 1004.602,
    "text": "The generative model, to close the loop, is the entity's inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.382,
    "end": 1009.243,
    "text": " And so here is x, the entity's prediction on hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.923,
    "end": 1016.785,
    "text": "And then here is x star, which is like the actual hidden state that is being alleged in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.485,
    "end": 1023.827,
    "text": "And we've had some other discussions about how that's the sigma function that's like mapping between the two x's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.887,
    "end": 1027.368,
    "text": "That's what's being minimized if the discrepancy is low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.788,
    "end": 1028.788,
    "text": "There's other notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.329,
    "end": 1031.369,
    "text": "How did the authors describe it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.349,
    "end": 1035.471,
    "text": " the difference between the generative model and the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.413,
    "end": 1043.497,
    "text": "Nodes correspond to probability distributions and edges to their statistical dependencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.897,
    "end": 1045.378,
    "text": "So this is like a Bayes graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.299,
    "end": 1058.187,
    "text": "Mathematically, a generative model may be formulated as the joint probability density P of Y and X of observations Y and hidden states X of the world that generate those observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.628,
    "end": 1060.189,
    "text": "I think it was just a copy error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.462,
    "end": 1065.806,
    "text": " The latter are referred to as hidden or latent states as they cannot be observed directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.307,
    "end": 1070.23,
    "text": "The joint probability distribution can be decomposed in two parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.35,
    "end": 1076.556,
    "text": "The first is a prior, P , which denotes the organism's knowledge about hidden states of the world prior to seeing sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.637,
    "end": 1084.243,
    "text": "The second is the likelihood, P , which denotes the organism's knowledge of how observations are generated from states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.803,
    "end": 1086.465,
    "text": "So that's the perceptual model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.803,
    "end": 1100.007,
    "text": " And then they go on to describe how there's a difference between the entity's inference on hidden state and the actual hidden state, which is the generative process versus the generative model distinction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.407,
    "end": 1112.411,
    "text": "And then they introduce action and say action U, that's this node that influences the hidden state, even if zero effect, is generated based upon the inferences made under a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1113.471,
    "end": 1116.112,
    "text": "Action is shown here as part of the generative model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.177,
    "end": 1117.438,
    "text": " Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.378,
    "end": 1126.367,
    "text": "Action is shown here as part of the generative process making changes to the world despite being selected from the inference drawn under the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.907,
    "end": 1129.63,
    "text": "So action is actually making influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.97,
    "end": 1134.215,
    "text": "Again, the edge could be zero in some respect, but it's making actual influence in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.335,
    "end": 1137.818,
    "text": "It's like the active states interpreted in this statistical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.113,
    "end": 1144.116,
    "text": " So what does that have to do with structured learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.876,
    "end": 1164.087,
    "text": "So the entity is going to either, whether you're a realist and saying the entity is doing structured learning or you're instrumentalist, it is possible for us as researchers today to model that entity as doing structured learning because it's computationally efficient or elucidative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.747,
    "end": 1166.508,
    "text": " Or you go full utilitarian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.528,
    "end": 1169.53,
    "text": "You just say, disregard that whole realism, instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.91,
    "end": 1173.592,
    "text": "It's a useful approach and I'll follow utility wherever it goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.755,
    "end": 1185.201,
    "text": " For any number of those reasons, you might want to model the cognition of different entities without going into just the philosophy of what its cognitive process actually is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.941,
    "end": 1203.691,
    "text": "And so one approach that's going to get taken is using inference, either from the outside, describing instrumentally or realism as if it were happening, maybe with anatomical evidence, as if the hidden state could include not just parameters that were continuous about the world, but also structures of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.638,
    "end": 1221.348,
    "text": " However, it's difficult to imagine that that type of cognitive or even extremely metacognitive thought or action selection could happen, for example, in some early proto cell, however simple it may have been.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.229,
    "end": 1230.794,
    "text": "And so how do we get from that flagella changing bacterium to all the other kinds of cognition that we see today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.776,
    "end": 1234.457,
    "text": "Or should I say bacterium-like entity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.05,
    "end": 1238.471,
    "text": " relative or ancestor of today's bacteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.311,
    "end": 1259.175,
    "text": "So how can we think about this model, which is often described in the context of parameter learning, and then approach this as if it were maybe about parameter learning sometimes, but also could be about structure in terms of the good regulator and the requisite diversity, that kind of requisite variety, those kinds of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.219,
    "end": 1270.823,
    "text": " Okay, the next several sections are where they get to the specifics and some of the contributions of the paper that I think will be really cool to continue the discussion on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.763,
    "end": 1283.628,
    "text": "Section four is just short, and it's saying we're about to go into three examples of simple predictive motifs in ancestral brains, because one of the main claims of the paper is that these motifs are very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.588,
    "end": 1304.18,
    "text": " ancestral they're old motifs they're not johnny come lately to the cognitive scene these are features that one can think of as who knows how far back or how simple these cognitive mechanisms have existed but we'll evaluate that maybe when we get to talk together but first we'll just kind of go through how they define them and use them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.336,
    "end": 1310.118,
    "text": " The three predictive motifs are homeostasis, allostasis, and simple behavioral control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.458,
    "end": 1315.901,
    "text": "So first five, generative models for the homeostatic control of interoceptive variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.122,
    "end": 1333.87,
    "text": "They write, the generative models shown in figure three, which we'll look at after this slide, afford the homeostatic regulation of a single interoceptive variable, which we call here body temperature for illustrative purposes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.983,
    "end": 1353.039,
    "text": " Much like a thermostat, this model maintains the requisite body temperature by reporting the discrepancy between predicted and sensed thermoreceptor activation, given Bayesian beliefs about temperature, triggering an autonomic reflex, U, resulting in, for example, vasodilation, which resolves the prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.519,
    "end": 1368.955,
    "text": " So if the life of the organism were just to hang out on the beach and vasodilate to off heat when it needed to, and then to constrict and to save more heat when it needed to, that's the physiological task that this is going to be describing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.716,
    "end": 1376.041,
    "text": " which is just one facet of an organism's biology, but there are experiments that sometimes only measure temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.801,
    "end": 1388.87,
    "text": "And so thinking instrumentally, this single factor model, this single variable model on body temperature may be sufficient for some experiments, or it may be useful in certain cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.13,
    "end": 1398.096,
    "text": "So just because it's a simple model doesn't mean that it's not going to be very educational and provocative, but also even be sufficient in a lot of cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.877,
    "end": 1400.839,
    "text": " but no one's even claiming it's realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.299,
    "end": 1403.001,
    "text": "That's why it's written this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.802,
    "end": 1406.925,
    "text": "They say, see citation 20 for a fully specified example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.566,
    "end": 1414.252,
    "text": "And that is a citation to chance at all in March, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.372,
    "end": 1415.593,
    "text": "So still in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.774,
    "end": 1419.897,
    "text": "And they write, we start from the presence premise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.978,
    "end": 1422.84,
    "text": "And this is in the paper that again is from the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.7,
    "end": 1433.527,
    "text": " We start from the premise that the goal of interoceptive control is to minimize discrepancy between expected and actual interoceptive sensations, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.607,
    "end": 1436.049,
    "text": "a prediction error or free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.03,
    "end": 1444.736,
    "text": "Importantly, living organisms can achieve this goal by using various forms of interoceptive control, homeostatic, allostatic, and goal-directed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.839,
    "end": 1452.343,
    "text": " So there's more details in this paper, but here in figure three is where they're going to show it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.484,
    "end": 1460.409,
    "text": "So keep in mind this generative model structure, and now these are going to be in a different form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.149,
    "end": 1465.332,
    "text": "And here in the caption, I'll describe what they say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.793,
    "end": 1474.939,
    "text": "This is that homeostatic, the first, most ancestral, or just the simplest possible just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.932,
    "end": 1480.775,
    "text": " Go make it darker if it's too bright and make it brighter if it's too dark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.316,
    "end": 1484.138,
    "text": "Make it warmer if it's too cold, make it colder if it's too warm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1484.638,
    "end": 1487.36,
    "text": "That kind of first-order cybernetic loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.842,
    "end": 1497.248,
    "text": "This generative model includes an interoceptive thermoreceptor, Y, observations, and a belief about body temperature, X.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.397,
    "end": 1502.02,
    "text": " So that's the beliefs about how the body should be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.321,
    "end": 1512.914,
    "text": "And that's again, the beliefs playing that dual function that the paper 37 drew out, which is that on the left side of this equation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.404,
    "end": 1520.525,
    "text": " Failure to satisfy the preferences is dealing with this P distribution as a preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.205,
    "end": 1525.967,
    "text": "But then on the right side, P has to do with expectations that are being either fit well or poorly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.687,
    "end": 1531.928,
    "text": "And so this is where active inference has a slightly different architecture perhaps than some other theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.789,
    "end": 1535.749,
    "text": "The beliefs are about body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.989,
    "end": 1538.77,
    "text": "It's not an estimate merely of the external body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.926,
    "end": 1546.087,
    "text": " Crucially, the prior over x is kept fixed, and hence it acts as a cybernetic setpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.928,
    "end": 1550.328,
    "text": "Well, you can't just expect what's going to be best for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.548,
    "end": 1550.968,
    "text": "You'll die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.328,
    "end": 1551.529,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.689,
    "end": 1552.689,
    "text": "If you die, you die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.329,
    "end": 1559.17,
    "text": "But if you enact policy such that your expectations are realized, then you persist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.71,
    "end": 1562.211,
    "text": "That's why we're studying things that are persistent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.47,
    "end": 1573.332,
    "text": " Any discrepancy between the predicted thermoreceptor activity given beliefs about X and the measured Y is registered as a prediction error that is cancelled out by an autonomic response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.972,
    "end": 1576.133,
    "text": "For example, a thermoregulatory response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.853,
    "end": 1583.974,
    "text": "This is shown as an illustrative plot of the expectations of prior and posterior observation and autonomic actions over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.494,
    "end": 1587.335,
    "text": "So here is like the action policy, which is like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.935,
    "end": 1594.663,
    "text": " be at the baseline level of thermoregulation, and then kick in some sweating or cooling mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.624,
    "end": 1605.396,
    "text": "And then here it describes how the observations start at about 37.1, and then they steadily start climbing, and then the belief, which is initially like, things should be 37,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.389,
    "end": 1620.451,
    "text": " the posterior, the after evidence estimate starts creeping up and then it hits a certain value and it engages a critical threshold that turns on this thermoregulatory response and then that cools the temperature back down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.111,
    "end": 1628.273,
    "text": "So this is a basic architecture for doing first order cybernetics and that kind of first order logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.793,
    "end": 1635.534,
    "text": "Here in this figure, the red circles represent the expected values of X, which are used to make predictions about Y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.042,
    "end": 1643.364,
    "text": " These are subtracted from the measured y to form a prediction error , which is used to update the expectation and drive action .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.404,
    "end": 1645.824,
    "text": "That changes y such that the prediction error is resolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.902,
    "end": 1684.747,
    "text": " if it doesn't do it well then the system dies so we're talking about evolution where we've had like for the ants 120 million years allegedly for that to get pruned out and even longer at the cellular level note the lateral modulatory connections in the allostatic network which we'll get to in a second so just to take one little discourse they say c 24 for details what is pape 24",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.102,
    "end": 1692.706,
    "text": " It is Friston, Parr, and DeVries, 2017, The Graphical Brain, Belief Propagation, and Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.506,
    "end": 1695.808,
    "text": "Let's just look at a few parts of this awesome paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.648,
    "end": 1700.211,
    "text": "So first they have a table with definitions of the technical terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.091,
    "end": 1706.995,
    "text": "So just to kind of read a few, but it's kind of awesome to see the authors do this, and this is a great paper as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.575,
    "end": 1709.216,
    "text": "So how do they define generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.917,
    "end": 1713.059,
    "text": "Generative model or forward model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.708,
    "end": 1738.9,
    "text": " probabilistic mapping from causes to observed consequences data so from hyper parameter to the parameter it is usually specified in terms of the likelihood of getting some data given their causes parameters of a model and priors on the parameters so it's all relative in nested models but this is generating data like kind of cranking out like a music box",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.319,
    "end": 1751.609,
    "text": " possible or plausible data sets with similar summary statistics, like similar mean and variance of some distribution or similar parameters if there's a whole vector that describe it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.309,
    "end": 1755.112,
    "text": "And then the recognition model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.548,
    "end": 1775.459,
    "text": " is related to learning where new data are coming in and discrepancy is being minimized if the generative is outputting the exact same mean and variance that incoming data are having the discrepancy is low the predictions which are about preferences are being realized successfully action policy is working well or better than expected",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.417,
    "end": 1778.659,
    "text": " flip everything and you have the opposite situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.439,
    "end": 1788.706,
    "text": "And then just to give one more definition here, because the next slide will feature it, though the others are also good to read, factor graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.487,
    "end": 1801.796,
    "text": "A factor graph is a bipartite graph where two distinct sets of nodes are connected by edges, representing the factorization of a function, usually a probability distribution function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.148,
    "end": 1812.856,
    "text": " Formulating a Bayesian network or model as a factor graph enables the efficient computation of marginal distributions through the sum product algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.159,
    "end": 1821.923,
    "text": "What does a factor graph look like and how does it relate to the kinds of Bayesian graphs that we've been looking at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.684,
    "end": 1832.052,
    "text": "So on the top is not the Bayes graph that's distributed across this slide, but another variant that we've seen a bunch of times, which is the partially observable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.512,
    "end": 1833.713,
    "text": " Markov decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.033,
    "end": 1836.714,
    "text": "So G, expected free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.214,
    "end": 1843.577,
    "text": "Pi, policy selection is influencing B, which is how S, the latent state in the world, is changing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.098,
    "end": 1846.319,
    "text": "There's D, the prior on the hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.439,
    "end": 1850.281,
    "text": "And then A, the mapping of how the state is related to the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.104,
    "end": 1854.426,
    "text": " And so depending on how the model's framed, those can be learned or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.926,
    "end": 1875.136,
    "text": "But it turns out that because of how this is relatively sparsely connected within a timeframe, as well as across timeframes, there's a way to use this bipartite construction called a factor graph that splits up those unlabeled edges, which are statistical dependencies, and kind of interweaves",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.876,
    "end": 1892.702,
    "text": " functions which have a slightly different representation and it turns out that by interleaving these functions into the variables it's possible to make what's called a factor graph and that gives an order of operations to arbitrary or within a certain set",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.582,
    "end": 1920.894,
    "text": " any kind of bayes graph but it includes this one importantly and so here is the one two three time points and two policies are being selected and that's what this graph represents the organism comes in with a prior time step one two three there's two actions and then here's another figure from the paper where at each of those three time steps one two and three a little bigger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.344,
    "end": 1930.307,
    "text": " At time steps 1, 2, and 3, there's the inference happening on time steps 1, 2, and 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.007,
    "end": 1934.088,
    "text": "So at time step 1, that's like anticipation and planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.548,
    "end": 1938.489,
    "text": "At time step 2, it's like short-term anticipation as well as memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.889,
    "end": 1940.89,
    "text": "At time step 3, it's like memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.41,
    "end": 1942.991,
    "text": "And it's always now casting as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.291,
    "end": 1949.193,
    "text": "And so one can imagine that this is a really useful format because it's extremely composable on one hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.833,
    "end": 1954.797,
    "text": " So just like they said, okay, well, we kind of have this motif with the three time steps and the connectedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.357,
    "end": 1961.241,
    "text": "What if D from the top level came down and was S at a lower level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.621,
    "end": 1969.927,
    "text": "And we've seen that taken to a really elaborated extent as well as interpreted in, for example, the paper on mental action in Livestream 25.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.208,
    "end": 1978.794,
    "text": "And so factor graphs are awesome because they're basically needing to only be specified in the Bayes graph format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.707,
    "end": 1989.262,
    "text": " But then it provides not just a mesh connectivity, but a process algorithm and a heuristic and an approach that's actually tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.462,
    "end": 1995.091,
    "text": "So we get the composable analytical and graphical component, but it's an attractable algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.152,
    "end": 2025.212,
    "text": " next section is generative models for the allostatic control of interoceptive variables so this is going to be the first real modification of the homeostat that's introduced in three this is going to be the base case but it could be something else other than body temperature the homeostat is simple but limited as they write it can counter sensed changes of body temperature but cannot anticipate predictable changes of body temperature or other variables",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.717,
    "end": 2042.762,
    "text": " In nature, there are several regularities that can be easily incorporated to extend the above generative model as, technically speaking, empirical priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.362,
    "end": 2047.784,
    "text": "The obvious advantage of predicting how our bodily and interoceptive variables will change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.792,
    "end": 2052.294,
    "text": " is being able to exert some anticipatory or allostatic control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.835,
    "end": 2061.781,
    "text": "And so this is kind of getting into the second order or anticipatory cybernetics, also related to Rosen's anticipatory ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.922,
    "end": 2064.703,
    "text": "So here's figure 3C.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.543,
    "end": 2071.347,
    "text": "In A and B, there was just the homeostat returning us to a set point after something got triggered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.968,
    "end": 2075.57,
    "text": "And now there's going to be the affordance for anticipatory control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.191,
    "end": 2077.952,
    "text": "This generative model,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.965,
    "end": 2083.167,
    "text": " sketched out with the same scheme as the previous slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.528,
    "end": 2092.373,
    "text": "This generative model extends the homeostat by including a second set of exteroceptive variables that correspond to light intensity Y2",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.778,
    "end": 2096.519,
    "text": " and a belief about sunrise, x2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.28,
    "end": 2099.181,
    "text": "That's the sun visual side on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.682,
    "end": 2120.217,
    "text": "Furthermore, like the visual system, and the left side is still the temperature interoceptive system, furthermore, the model includes a predictive relationship between sunrise, x2, and body temperature, y. This edge isn't saying that the sun warms the body, it's saying that in this model there's an edge reflecting a statistical dependency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.757,
    "end": 2124.998,
    "text": " and that's where there's the degree of freedom with respect to the realism and instrumentalism, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.998,
    "end": 2136.86,
    "text": "In this way, inferring a sunrise can trigger the autonomic response U of thermoregulation in an anticipatory manner, that is, before the sunlight actually increases body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.84,
    "end": 2149.222,
    "text": "The upper part of A and C are Bayesian networks, highlighting that Y is conditionally dependent upon X with the directed arrow between the nodes, with more than one X and Y in the model for the allostat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.868,
    "end": 2155.83,
    "text": " The lower parts show the form of neuronal message passing that could be used to solve these generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.51,
    "end": 2162.472,
    "text": "So the Bayes graph is represented on the top, and then there's the message passing with respect to the neural population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.452,
    "end": 2164.453,
    "text": "So that's kind of the second",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.917,
    "end": 2192.258,
    "text": " aspect of figure three which is just bringing in multi-sensory integration or even it could be like two pixels for example with beliefs about each other or something like that but that's what allostasis is going to be enabled by is just by this duplication of a column and then this connection in a different way and then here's the third section of four seven generative models for simple behavioral control and so they write",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.834,
    "end": 2202.037,
    "text": " The homeostat and the allostat permit the control of simple forms of swimming, locomotion, reaching, and other movements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.877,
    "end": 2214.982,
    "text": "One biological example is provided by the zebrafish virtual reality study 30, which identified the neuronal underpinnings of error correction during escape behavior in the animal's telencephalon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.143,
    "end": 2215.783,
    "text": "It's a brain region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.443,
    "end": 2225.087,
    "text": "An evolutionary conserved set of brain circuits involved in action selection in other vertebrates, including mammals, such as the corticobasal ganglia circuit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.127,
    "end": 2245.931,
    "text": " that's about the evolutionary homology of the brain region and then here's just some pictures from the paper um by uh tori go at all 21 zebrafish capable of generating future state prediction error show improved active avoidance behavior in virtual reality so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.165,
    "end": 2254.408,
    "text": " They did a learning task that involved the fish being able to differentiate a signal, and then they studied the role of anticipation in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.728,
    "end": 2258.229,
    "text": "And the authors in this paper use that as an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.93,
    "end": 2263.811,
    "text": "Maybe we could talk about that or other examples in the dot one and the dot two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.432,
    "end": 2266.192,
    "text": "Section eight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.373,
    "end": 2272.515,
    "text": "Here's where we get to the very interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.17,
    "end": 2286.179,
    "text": " operations that are going to bring this sort of descriptive model of different kinds of homeostatic, allostatic, and intermodal, and then behavioral regulatory elements into the evolutionary context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.799,
    "end": 2302.611,
    "text": "So, our central argument is that evolution proceeded via gradual elaborations of the predictive motifs illustrated above, under genetic constraints and opportunities, and the selective pressure of novel problems to be solved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.393,
    "end": 2308.936,
    "text": " such as the control of more sophisticated bodies in the presence of richer ecological niches, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.976,
    "end": 2313.018,
    "text": "when vertebrates began to establish life on land some 400 million years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.199,
    "end": 2324.564,
    "text": "Over successive generations, generative models can remain stable or be elaborated along four key dimensions, strongly limiting the space of what is evolvable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.007,
    "end": 2329.19,
    "text": " So what are the four kinds of dimensions that are going to be changed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.873,
    "end": 2338.659,
    "text": "That is going to be discussed in terms of the changes that can happen to the specifics of the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.122,
    "end": 2343.084,
    "text": "We have introduced the first kind of elaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.241,
    "end": 2346.982,
    "text": " from the unimodal homeostat to the multimodal allostat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.202,
    "end": 2353.024,
    "text": "So they kind of secretly introduced this transformation between figure 3ab and figure 3c.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.284,
    "end": 2356.865,
    "text": "So that was secretly like one of the transformations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.346,
    "end": 2364.968,
    "text": "A second kind of elaboration is the duplication of predictive motifs, which enlarges the animal's behavioral repertoire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.109,
    "end": 2373.391,
    "text": "The third and fourth dimensions equip the generative model with temporal and or hierarchical depth, respectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.264,
    "end": 2379.196,
    "text": " These two expansions enable richer predictive motifs that endow a cognitive sophistication",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.646,
    "end": 2385.188,
    "text": " such as the possibility to plan or consider events that change on multiple time scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.868,
    "end": 2406.015,
    "text": "So it's the evolutionary algebra on structure learning, because we're outputting a structure, this graph G, which is gonna be like as if the species over evolutionary time is going to be implementing some graph in terms of the structure of its model, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.168,
    "end": 2432.303,
    "text": " there's a case where the ant is not integrating the polarization of light with the olfactory system and then there's some change in the model that actually integrates them and then some relationship is learned whatever that means from a realist or instrumentalist perspective and that is going to be like an evolutionary algebra so it's not going to be like 2x minus 3x but it's going to be more like that than not because there's going to be operations and they're going to happen in order",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.567,
    "end": 2437.45,
    "text": " So here's figure four, where they represent their evolutionary algebra.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2438.191,
    "end": 2443.215,
    "text": "Figure four, the five main dimensions of elaboration of generative models introduced in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.836,
    "end": 2448.14,
    "text": "So it was, you know, four dimensions, then it's five dimensions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.7,
    "end": 2452.504,
    "text": "There's evolution in 4D by Cheblonka and Lamb.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.524,
    "end": 2454.785,
    "text": "That would have been good to add to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.438,
    "end": 2478.975,
    "text": " the five main dimensions of elaboration of generative models introduced in the paper illustrated as operations of an evolutionary algebra so here's the five operations and so we're starting with on the left side that homeostat that simple corrective calibrative first order cybernetic model either what the system is actually doing or model of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.759,
    "end": 2483.382,
    "text": " Then there's going to be five transformations that can happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.542,
    "end": 2485.383,
    "text": "And then it's showing there's a second round.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.584,
    "end": 2496.254,
    "text": "Like once you go H, you can go H, T, A, I plus I or I. So you have five discrete options at the first time step, but one of them is no change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.594,
    "end": 2501.959,
    "text": "So it's kind of like no change or four different layers of excitement of the electron, like four quanta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.54,
    "end": 2506.743,
    "text": " but they're for discrete operations, like a deletion or an insertion in genomics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.284,
    "end": 2511.567,
    "text": "And then from there, it's just the state for the next time step of the model, and then something else happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.627,
    "end": 2512.568,
    "text": "So what are the operations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.348,
    "end": 2516.771,
    "text": "The bottom is I, which is the identity operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.071,
    "end": 2519.113,
    "text": "That leaves the generative model as is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.953,
    "end": 2525.938,
    "text": "So that can be interpreted as like a non-mutation or just a conservative mode, which is how most inheritance works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.079,
    "end": 2534.707,
    "text": " Then the second one is the duplication operation, I plus I. So it's like identity remains the same, but then there's a duplication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.947,
    "end": 2539.972,
    "text": "Literally, it's like a genomic duplication, but in this functional space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.673,
    "end": 2544.517,
    "text": "Replicates existing predictive motifs to form parallel sensory motor loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.991,
    "end": 2556.063,
    "text": " A is the operation that was described in figure 3C, the allostatic operation, endows the generative model with horizontal predictive relations between different modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.663,
    "end": 2559.386,
    "text": "And so the duplication would be like going from 1...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.948,
    "end": 2581.373,
    "text": " sensilla like one antenna to two antenna or going from one photoreceptor to two photoreceptors but the actual architecture of the column of the photosensory transduction cascade would basically be computationally or statistically unchanged and then the allostat is actually bringing in this horizontal aspect it's not just two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.833,
    "end": 2593.139,
    "text": " duplicated systems next to each other, now there's actually connections between them, and of the possible kinds of connections across columns, one of them is like this classic allostatic motif.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.139,
    "end": 2604.145,
    "text": "Then there's the ones that we haven't gone into as much, which are T, the temporal depth operation, extends the generative model with separate variables for past, present, and future states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.105,
    "end": 2611.889,
    "text": "So it's kind of, from a graphical perspective, what we looked at in the difference between the first factor graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2613.12,
    "end": 2626.224,
    "text": " which did take action at three time steps, three time steps, like the thermostat does to the one that actually has either prospectively looking anticipation about future time steps or retrospectively looking memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.925,
    "end": 2628.565,
    "text": "But that's how the factor graph comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.206,
    "end": 2632.046,
    "text": "That's temporal depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.307,
    "end": 2633.467,
    "text": "Then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.895,
    "end": 2642.594,
    "text": " The hierarchical depth, operation H, extends the generative model with separate variables for states of affairs that change at different time scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2643.649,
    "end": 2651.933,
    "text": " faster timescales at the bottom levels and slower timescales at the higher levels, hence modeling narratives such as music and language where nested timescales are relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.553,
    "end": 2666.54,
    "text": "So to kind of split that idea of temporal depth into two pieces, there's incrementing the number of steps you're looking in the model, that's increasing the time horizon on policy selection and increasing the temporal depth within a level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.1,
    "end": 2668.901,
    "text": "And then there's this notion of nesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.301,
    "end": 2675.455,
    "text": " levels within each other that's the nested generative model and therefore nested Markov blanket",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.584,
    "end": 2702.975,
    "text": " discussion that we've been having and that is going to be connected to cognitive activities like narrative and the reason why they're very similar is that the time scales can kind of blur into each other and so it's all about the model's structure as stated like this one is hierarchical and it has a depth of three it's a two-layer model and it has a depth of three three time steps are included",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.996,
    "end": 2705.097,
    "text": " And it could be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.137,
    "end": 2714.065,
    "text": "If there was always looking 2 ahead and always looking 2 in the back, then the model in the computer would need a minimum of five time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.606,
    "end": 2719.23,
    "text": "But the entity's model could still be restricted to s minus 2, s minus 1, and then s plus 1, s plus 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.27,
    "end": 2719.41,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.573,
    "end": 2734.605,
    "text": " Those are the two ways that it can expand in these two temporal and hierarchical ways, which is to nest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.089,
    "end": 2741.973,
    "text": " hierarchically, or to become temporally deeper with a longer horizon given the nesting structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.333,
    "end": 2744.094,
    "text": "So these are all structural changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.154,
    "end": 2751.559,
    "text": "That's why there was the whole piece about structure learning, because it's as if, or actually, like over evolutionary time, there's this structure learning happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.039,
    "end": 2761.846,
    "text": "And then if we use this partitioning and Bayes graph approach, then hypothetically, any kind of evolutionary starting point, if we go back far enough, and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.546,
    "end": 2767.848,
    "text": " final state, if we have all the transitions, could be modeled within a native active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.289,
    "end": 2775.271,
    "text": "Section 9, they're going to go into a little more detail about duplicating predictive motifs and enabling multiple behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.991,
    "end": 2787.216,
    "text": "So they're writing on how does this duplication of the model, looking at it from the outside, it's like as if they're acting as if there's two models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.26,
    "end": 2802.248,
    "text": " Looking at it from the realism in the inside, it's kind of like thinking about the real duplication of a cognitive function, that's functionalism, or like even a neuroanatomical region, like the earlier examples with the retinal cells, and that's like an anatomical realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.029,
    "end": 2816.437,
    "text": "So generative models can expand by duplicating simple predictive motifs to form a larger repertoire of species-specific behaviors, such as approach avoidance, the control of the vibrase, and visually guided grasping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.578,
    "end": 2830.427,
    "text": " The operator I plus I in figure four illustrates a generative model in which the same predictive motifs are duplicated and specialized to form a behavior-based architecture composed of multiple parallel sensory motor loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.087,
    "end": 2843.556,
    "text": "So they're suggesting that because these are your affordances, your operations in your evolutionary algebra, you can go from this starting point, it's kind of like Gödel, Escher, Bach, starting point and then doing operations to it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.457,
    "end": 2854.744,
    "text": " Because you have the starting point and the operations to it, it allows you to get to even relatively advanced motifs like approach avoidance, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.505,
    "end": 2857.826,
    "text": "But a key piece is duplication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.086,
    "end": 2867.973,
    "text": "Because duplication of something without changing it is how you are able to build more land to experiment in, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.414,
    "end": 2869.875,
    "text": "Build more space and...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.875,
    "end": 2881.84,
    "text": " I copied some images from genetics, specifically in the relationship of how gene duplication and divergence in the early evolution of vertebrates, this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.16,
    "end": 2897.867,
    "text": "And there's a huge amount of genetics and genomics works on the duplication and divergence and the neo-functionalization, the sub-functionalization, because if you have like an enzyme or a essential gene A, not to go into the whole gene thing, totally another time though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.707,
    "end": 2917.036,
    "text": " um you could have the function of the second copy in the genome be lost and then there is still like a continuous line of function so if you only needed one copy of a then this would be sufficient and then other times when you have a and it's dual functional like it binds to two different not exactly similar molecules",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.916,
    "end": 2945.795,
    "text": " then when there's a paralogy when there's this duplication it allows sub-functionalization or new functions to arise so that's how people talk about it and link it to realism in genomics and this is kind of approaching that from a cognitive perspective um there's probably more to say but we'll talk more about the duplicating of predictive motifs so how is duplicating predictive motifs enabling of multiple behaviors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.682,
    "end": 2959.453,
    "text": " Okay, they write, from a structure learning perspective, duplication is an efficient way of building generative models, and that's what it's all about, in the sense that the dynamics are conserved over different sensory motor domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.333,
    "end": 2973.545,
    "text": "This conservation is mathematically akin to factorizing probability distributions on the generative model that has been discussed in terms of modular architectures and functional segregation as a principle of functional brain architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.744,
    "end": 2980.55,
    "text": " In Bayesian statistics and physics, this kind of factorization is ubiquitous and known as a mean field approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.991,
    "end": 2987.277,
    "text": "Indeed, the free energy bound on model evidence is defined in terms of a mean field approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.684,
    "end": 2993.945,
    "text": " that affords an accurate and minimally complex explanation for sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.585,
    "end": 2995.906,
    "text": "And so what are some of these citations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.926,
    "end": 3003.288,
    "text": "44, modular architectures for factorization of probability distributions in the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.108,
    "end": 3006.709,
    "text": "Parr, Sajid, and Friston, 2020, entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.409,
    "end": 3008.69,
    "text": "So here's kind of a cool figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.13,
    "end": 3011.29,
    "text": "Nice graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3013.091,
    "end": 3014.251,
    "text": "And then there's the message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.412,
    "end": 3018.873,
    "text": "And then citation 48, the mean field approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.113,
    "end": 3019.453,
    "text": "What is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.851,
    "end": 3036.897,
    "text": " Here's a paper from 2001, and they wrote, algorithms that must deal with complicated global functions of many variables often exploit the manner in which the given functions factor as a product of local interactions, each of which depends on a subset of the variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.617,
    "end": 3047.161,
    "text": "Such a factorization can be visualized with a bipartite graph that we call a factor graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.519,
    "end": 3071.405,
    "text": " A wide variety of algorithms developed in artificial intelligence, signal processing, and digital communications can be derived as specific instances of the sum-product algorithm, including the forward-backward algorithm, the Viterbi algorithm, the iterative turbo-decoding algorithm, Perl's 1988 belief propagation algorithm for Bayesian networks ,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.905,
    "end": 3079.189,
    "text": " the Kalman filter, and certain fast Fourier transforms, FFT algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.95,
    "end": 3085.074,
    "text": "So it was 21 years ago when this was happening, and now we're here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.156,
    "end": 3087.896,
    "text": "Okay, section 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.477,
    "end": 3093.761,
    "text": "Endowing generative models with temporal depth supports perspective and retrospective inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.402,
    "end": 3098.025,
    "text": "So just like we looked at with that factor graph,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.4,
    "end": 3107.612,
    "text": " giving this operation over evolutionary time enables that factor graph to arise from something with a lower time horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.295,
    "end": 3133.889,
    "text": " generative models discussed so far only consider present states and observations however they can be expanded into temporally deep models whose variables explicitly represent future and past states and observations so this is what the operation looks like it takes xt and then at x t plus one or tau depending on how it's written and then now there's another time step appended to the end of this model either actually or as if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.916,
    "end": 3137.538,
    "text": " Here's something cool that they wrote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.798,
    "end": 3144.507,
    "text": "They wrote, various researchers have speculated that a major driving force for the development of deep temporal models was foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.988,
    "end": 3148.352,
    "text": "So why would this happen functionally?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.813,
    "end": 3151.697,
    "text": "Which is to say, why does the mutational spectra",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.032,
    "end": 3159.718,
    "text": " which does allow for this as an affordance, end up selecting for and retaining and enriching for temporally deep models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.958,
    "end": 3161.699,
    "text": "Otherwise we wouldn't observe it to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.68,
    "end": 3164.562,
    "text": "And they're connecting that to forging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.162,
    "end": 3174.43,
    "text": "Intriguingly, this is a vertebrate example, the same hippocampal circuits that support spatial navigation and forging are also involved in prospection and imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.024,
    "end": 3190.909,
    "text": " This has led Busaki and Mosser to propose that prospective functions have leveraged cognitive and predictive maps in the hippocampal entorhinal system, and hence mechanisms of memory and planning have evolved from mechanisms of navigation in the physical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.889,
    "end": 3194.45,
    "text": "So what are the cognitive demands of foraging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.211,
    "end": 3196.551,
    "text": "How about information foraging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.151,
    "end": 3198.612,
    "text": "How about mental foraging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.502,
    "end": 3208.355,
    "text": " Here's some awesome papers by Hills and Cousine and others, Foraging in Mind and Foraging in Semantic Fields, How We Search Through Memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.976,
    "end": 3210.658,
    "text": "So what about mental foraging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.98,
    "end": 3214.444,
    "text": "What about individual and collective foraging?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.609,
    "end": 3218.89,
    "text": " This is an awesome paper by Finerman and Corman in 2017.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.83,
    "end": 3227.913,
    "text": "And they talk about the continuum and the complementarity of individual and collective approaches to cognition, and so implicitly like foraging as a phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.593,
    "end": 3238.436,
    "text": "Some of the affordances and the neurophysiology of foraging in ants, it's the same materials and mechanism that any other insect that's not eusocial has.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.876,
    "end": 3240.177,
    "text": "So the detection of light,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.657,
    "end": 3251.461,
    "text": " the intensity, the wavelength, the polarization sometimes, the ability to do chemo sensation, like taste and smell, mechanoreception, et cetera, and the same action affordances too, like movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.841,
    "end": 3259.264,
    "text": "And so there definitely is nestmate level cognition in ants, but also there's things that are of a few different interesting types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.524,
    "end": 3259.865,
    "text": "One of them is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.138,
    "end": 3278.029,
    "text": " mesoscale like small group dynamic stochastic teams and larger scale like colony and even colony niche stigmergy and ecological scale cognitive processes like these two ants are interacting and modifying each other's foraging behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.253,
    "end": 3288.521,
    "text": " mechanistically and statistically, but also it wouldn't happen unless the niche were exactly this way, which they have also in their extended selves established for themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.142,
    "end": 3298.99,
    "text": "So how do we think about individual and collective foraging and stigmergy and complex systems and mental foraging and cognitive demands and cognitive security?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.984,
    "end": 3301.744,
    "text": " What about section 11?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.024,
    "end": 3306.385,
    "text": "Endowing generative models with hierarchical depth affords multiscale inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.725,
    "end": 3311.026,
    "text": "So now we get to the hierarchical operation that is going to give that multiscale inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.666,
    "end": 3317.747,
    "text": "So far, we have described generative models that can deal with aspects of the world that unfold at single timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.127,
    "end": 3325.189,
    "text": "So plus one, plus one, plus one timescale is temporal depth, but you're getting still only one extra per transformation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.129,
    "end": 3330.37,
    "text": "However, they can be expanded into hierarchically deep models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.391,
    "end": 3336.074,
    "text": " whose variables at different hierarchical levels encode latent states that unfold at different timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.574,
    "end": 3337.775,
    "text": "One example is a song.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.135,
    "end": 3341.918,
    "text": "The melody remains the same even though the notes we hear or sing change rapidly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.498,
    "end": 3342.898,
    "text": "And speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.759,
    "end": 3353.105,
    "text": "Similarly, a movie or narrative remains the same for several minutes, scenes remain the same for several seconds, but visual stimuli can change over hundreds of milliseconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.126,
    "end": 3358.949,
    "text": "Such models permit hierarchical models, permit modeling of narratives,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.859,
    "end": 3370.723,
    "text": " songs, movies, and other events that change at different temporal scales, by encoding variables that change more slowly, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.923,
    "end": 3377.065,
    "text": "melodies or movies, at higher hierarchical levels, and variables that change more rapidly, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.205,
    "end": 3380.467,
    "text": "notes or visual scenes, at lower hierarchical levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.704,
    "end": 3393.328,
    "text": " Two neurobiological examples of hierarchical organization are visual areas in mammals and areas that control vocal gestures in birdsong, which has been studied in active inference several times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.169,
    "end": 3395.649,
    "text": "And so here's another quote from the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.51,
    "end": 3404.393,
    "text": "In more advanced animals, the hierarchical control of action may have expanded into sophisticated forms of cognitive control and executive function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.993,
    "end": 3407.074,
    "text": "Layer one scare quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.311,
    "end": 3412.135,
    "text": " which help prioritize distal goals while inhibiting immediate affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3412.976,
    "end": 3421.125,
    "text": "So it's not just about seeing deeper within a timescale, but it's about being able to pull up to a higher timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.326,
    "end": 3423.548,
    "text": "And then from there, after the H operation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3424.522,
    "end": 3426.543,
    "text": " it can be followed up with a T operation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.343,
    "end": 3429.965,
    "text": "So here's the minute scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.665,
    "end": 3434.767,
    "text": "And then there's a hierarchical duplication that allows for the hour scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.468,
    "end": 3438.629,
    "text": "And then that can go into two hours and now two minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.089,
    "end": 3443.832,
    "text": "So now there's a two hour and two minute long model instead of a one minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.952,
    "end": 3445.513,
    "text": "And it was just two mutations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.033,
    "end": 3453.057,
    "text": "But if the two mutations had been, or the three mutations had been just going deeper within the minutes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.005,
    "end": 3455.245,
    "text": " it would be a different outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.026,
    "end": 3460.046,
    "text": "How is that functional?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.426,
    "end": 3462.887,
    "text": "So what is the function and the cost of temporal depth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.947,
    "end": 3474.809,
    "text": "Just instrumentally, when we're studying diverse cognitive systems, how can we detect temporal depth and slash versus hierarchical nesting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.109,
    "end": 3479.789,
    "text": "Then what is the meaning and the role of narrative in cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.329,
    "end": 3483.41,
    "text": "How does this relate to narrative information management?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.236,
    "end": 3487.998,
    "text": " All right, section 12, getting towards the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.839,
    "end": 3505.968,
    "text": "In the above, which was, again, the description of the simple motifs in 4, 5, 6, 7, and then the evolutionary algebra in 8, and then several of these finer scale discussions on 9 and 10 and 11, we then get to 12.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.169,
    "end": 3512.792,
    "text": "In the above, we formalize brain designs in terms of generative models that include predictive loops of various complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.733,
    "end": 3513.893,
    "text": "Read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.605,
    "end": 3525.073,
    "text": " and then discuss the five main ways in which generative model designs can be elaborated, green, or the five main operations of an algebra of evolutionary structure learning, figure four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3526.094,
    "end": 3534.32,
    "text": "This means that one can describe the evolutionary trajectory of brain designs in terms of a limited number of mutational operations over generative models, blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.661,
    "end": 3544.408,
    "text": "So here is a phylogenetic tree on the right side with a tree of life, one of the tree of lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.857,
    "end": 3551.538,
    "text": " What are alternative, complementary, or traditional ways to think about phylogenetic trees?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.099,
    "end": 3558.26,
    "text": "In evolutionary biology, are phylogenetic trees interpreted instrumentally?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.04,
    "end": 3562.041,
    "text": "Are they interpreted under a realism framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3562.141,
    "end": 3564.281,
    "text": "Is that what really happened to those species?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.941,
    "end": 3567.182,
    "text": "Or is it our model inference about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3569.042,
    "end": 3573.723,
    "text": "What is the relationship between active inference and the free energy principle and evolution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.684,
    "end": 3575.904,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.523,
    "end": 3580.285,
    "text": " They have figure five, which gets at their phylogenetic model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.946,
    "end": 3586.97,
    "text": "So this is a phylogenetic tree of generative model designs and putative correspondences with animal brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.13,
    "end": 3589.092,
    "text": "So here's the implied ancestral state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.492,
    "end": 3593.635,
    "text": "And then I is going to be the identity operator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.835,
    "end": 3596.057,
    "text": "So here the orange species has not mutated at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.385,
    "end": 3602.526,
    "text": " Now, sometimes this is conflated with simply being an outgroup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.966,
    "end": 3615.91,
    "text": "Just because it is that way doesn't mean they're making the conflation, but sometimes people will make the conflation that because a species is an outgroup to some other clade that has been included in the analysis, that it is the basal or primitive form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.19,
    "end": 3625.033,
    "text": "And so it does happen to be that way in this example, that the basal is the so-called least derived or most primitive or basal form, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3626.093,
    "end": 3634.609,
    "text": " My personal thought is that it should not be described, and Tim Linksfayer and others have awesome writing on that evolutionary fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.411,
    "end": 3637.615,
    "text": "So in the rest of the tree, which is being focused on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3638.88,
    "end": 3662.334,
    "text": " different kinds of operations happen so here's that i plus i duplication and then there's no change after that and then this one has a and so on so just like you could trace the phenotype changing through time on a tree inferred from trait or genomic data which is just another trait this maps up to certain changes that are seen neuro anatomically over vertebrate evolution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.783,
    "end": 3669.367,
    "text": " And it reminded me of this paper, which was Chakraborty and Jarvis 2015.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.956,
    "end": 3674.658,
    "text": " And so that is the paper Brain Evolution by Brain Pathway Duplication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.898,
    "end": 3682.822,
    "text": "So they don't connect it to, in the exact same way, the neurocognitive and the functional and the active inference and all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.922,
    "end": 3690.766,
    "text": "But this paper does get at some of the very similar ideas about the functional duplication arising as a result of pathway duplication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.108,
    "end": 3715.815,
    "text": " they have a section on brain complexity and pathway evolution they talk about some alternative hypotheses and then talk about distributed and duplicated morphological structures so it's a kind of interesting paper from about seven years ago another paper that's very related to this idea of doing like an evolutionary algebra with combinatorics but also a path dependence is this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.076,
    "end": 3721.861,
    "text": " pretty recently, just a couple days ago, by Ryan Smith, Maxwell Ramstad, and Alex Kiefer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.401,
    "end": 3727.646,
    "text": "The paper is Why Bayesian Brains Perform Poorly on Explicit Probabilistic Reasoning Problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.587,
    "end": 3730.329,
    "text": "So look at this tree that they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.629,
    "end": 3732.752,
    "text": "The starting point, and then three actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.412,
    "end": 3735.955,
    "text": "So here it's like divide, divide, multiply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.736,
    "end": 3738.697,
    "text": "Divide, add, divide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.378,
    "end": 3766.971,
    "text": " and then they study that in the context of bayesian brains and doing calculations why is it hard to multiply numbers together sometimes so then the authors of the paper 38 right interestingly the mutational operators are commutative the same generative model design can be obtained by executing the same operations but in a different order um the commutative property of mutational operators potentially sheds light on the convergent evolution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.032,
    "end": 3790.969,
    "text": " and the process by which unrelated organisms evolve similar traits independently and via different evolutionary histories when they need to adapt to similar ecological niches that's pretty cool all right so just the discussion and then a few last points so discussion and the authors summarize it in this article we suggest that brain structure or design could be formalized as generative models agree disagree",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.991,
    "end": 3798.393,
    "text": " that the brain generative models of our evolutionary ancestors included simple predictive motifs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.813,
    "end": 3800.053,
    "text": "Agree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.133,
    "end": 3800.473,
    "text": "Disagree?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3801.494,
    "end": 3809.696,
    "text": "And that the evolution proceeded via successive elaborations of these predictive motifs into more complex architectures that we observe in advanced animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.397,
    "end": 3813.618,
    "text": "They then talked about the ways that that can change through time functionally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3814.79,
    "end": 3827.878,
    "text": " And then they write, while the evolutionary trajectory of designs for predictive processing proposed here is certainly tentative and incomplete, we consider it a first step towards the alignment of predictive brains and evolutionary studies of neuroanatomy in different species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.879,
    "end": 3830.76,
    "text": "So if this is the first step, where are we headed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.241,
    "end": 3834.783,
    "text": "And why do we prefer and expect ourselves to be there or go there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.499,
    "end": 3840.58,
    "text": " Just a few more topics that we could talk about, like in the dot one and then the dot two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.881,
    "end": 3851.304,
    "text": "First would be, they write that the error correction mechanisms in their view encompass the simple and the complex forms of adaptive behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.144,
    "end": 3854.224,
    "text": "Hashtag integrative theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.005,
    "end": 3865.428,
    "text": "And they're gonna argue that that differs significantly from prevalent perspectives in psychology and neuroscience, which tend to separate sets of mechanism for sensory motor processing and simple cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.621,
    "end": 3870.964,
    "text": " So how is active inference similar and different to other frameworks for behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.064,
    "end": 3874.346,
    "text": "What are the building blocks of adaptive behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.847,
    "end": 3878.709,
    "text": "What are the basal blocks of just any kind of behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.869,
    "end": 3882.531,
    "text": "Where does sensory motor integration come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.892,
    "end": 3890.136,
    "text": "How about mental functions and cognitive functions like memory, anticipation, counterfactuals, et cetera?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.877,
    "end": 3900.286,
    "text": " Okay, another point to kind of think about or write your questions down and reflect on is the perspective, which is still speculative and not unchallenged,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.058,
    "end": 3907.923,
    "text": " suggests that the complexity of the ecological niche determines the level of complexity that the brain needs to have in order to be Bayes optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.603,
    "end": 3912.546,
    "text": "In other words, brains only increase their complexity with sufficient ecological demands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.267,
    "end": 3921.653,
    "text": "So not necessarily just that mutational direction and intensity will go towards increasing brain complexity from ecological demands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.373,
    "end": 3946.821,
    "text": " so-called anticipatory evolution that cognitive entities can have through self-modification and niche modification but even for those that aren't actually doing anticipation still it could be the case that when the ecological demands are such that a behavioral model increase in complexity is selected for and retained then evolution will go that way this is because having a more complicated brain does not help if you live in a simple niche",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.521,
    "end": 3952.545,
    "text": " So that's like a very costly model that's not giving you any more return on investment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.806,
    "end": 3967.475,
    "text": "They then talk about how the social brain hypothesis states that the necessity to predict and deal with sophisticated social dynamics was a main driver of the evolution of large brains and sophisticated cognitive abilities in our species, people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.246,
    "end": 3981.753,
    "text": " In short, the gradualism expressed as a progressive increase in complexity rests on the circular causality implicit in the modeling of an eco-niche that is in itself constituted and constructed by increasingly complicated phenotypes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.434,
    "end": 3982.574,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.314,
    "end": 4005.709,
    "text": " Because it's so important to think through other minds, first, just how you're going to materially avoid a spatial collision, but then so the social brain hypothesis goes, includes increasingly recursive levels of game theory, market theory, and all this kind of stuff, and related indirect cognitive phenotypes required like memory and recognition, narrative understanding, rhetorical understanding, governance, etc.,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4007.711,
    "end": 4018.799,
    "text": " That is being posited as compatible with the models the authors have written and a hypothesis that others have written about, not from an active inference perspective, though, in most cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.079,
    "end": 4021.841,
    "text": "So what is the cognitive niche for social entities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.221,
    "end": 4024.983,
    "text": "Our material niche and our social cognitive niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.244,
    "end": 4027.084,
    "text": "What is the social brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.225,
    "end": 4029.446,
    "text": "What is the eusocial brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.227,
    "end": 4030.947,
    "text": "How are they related?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.708,
    "end": 4033.029,
    "text": "So for example, the social brain...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4034.045,
    "end": 4038.086,
    "text": " is saying that the more social things are, the more sophisticated the brain has to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4038.587,
    "end": 4041.067,
    "text": "We need more narrative understanding and more memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.888,
    "end": 4046.409,
    "text": "But what if in the eusocial case, the brain is simpler on board?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.029,
    "end": 4055.632,
    "text": "For example, it's more role-based or temporal polyethism has allowed more reduction in each phase of the life cycles brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.032,
    "end": 4059.774,
    "text": "So does social lead to eusocial?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.494,
    "end": 4063.095,
    "text": "How does eusociality arise and how does it elaborate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.82,
    "end": 4081.664,
    "text": " how do different kinds of sociality arise and elaborate, and how is that associated with the different kinds of models structurally changing that we've been discussing in this paper, and then just genomics, all the other stuff, gene expression, and then just one last point, which is the closing piece of their paper too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.924,
    "end": 4089.806,
    "text": "Finally, it is important to acknowledge that brains, design, bodies, ecological and cultural niches co-evolved independently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.297,
    "end": 4092.638,
    "text": " Not sure if that was what they meant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.018,
    "end": 4095.359,
    "text": "It's kind of like they are codependent in their coevolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.499,
    "end": 4096.799,
    "text": "But they co-evolved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.52,
    "end": 4098.76,
    "text": "They were alone together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.041,
    "end": 4107.524,
    "text": "Given that here we were interested in the evolution of brain designs, we assumed a brain-centric perspective and conveniently focused on generative models in the animal's brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.545,
    "end": 4109.285,
    "text": "Hashtag realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.204,
    "end": 4123.733,
    "text": " in the brain not modeled as in the brain however cognition does not need to be confined in the skull to be it can be extended outside it to cover for example tools and social dimensions epistemic niche niche modification",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4124.943,
    "end": 4125.744,
    "text": " digital stigmacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4126.345,
    "end": 4131.771,
    "text": "Furthermore, the body design and not just brain design plays an important role in solving control problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.491,
    "end": 4144.805,
    "text": "Acknowledging that cognition can be extended and embodied and encultured, et cetera, all the E's, all the other letters, suggests that not all aspects of control need to be solved by or represented in a central generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.606,
    "end": 4149.507,
    "text": " tale of two densities, all the discussions we've been having about representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.107,
    "end": 4159.79,
    "text": "And so it was x and x star in the simple version that was presented in this paper, where it was actually trying to track x star in the world with the internal inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.39,
    "end": 4162.631,
    "text": "But this is the discussion that we've been having.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.752,
    "end": 4167.473,
    "text": " do those representations have to structurally resemble the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.013,
    "end": 4171.854,
    "text": "And there's other papers that we've discussed in the last several weeks that really touch on that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.394,
    "end": 4177.535,
    "text": "So how do we think about generative models and factor graphs for extended cognitive processes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.595,
    "end": 4183.176,
    "text": "So a couple of books to check out about extended mind and embodied cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.636,
    "end": 4189.777,
    "text": "And then here's a nice figure from touch points with the brain, the organs and the body",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.345,
    "end": 4200.947,
    "text": " The world, and the tools, and the epistemic niche, and the computers, like a calculator, and time, chronos, and food, and then other people, social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4201.208,
    "end": 4202.168,
    "text": "So that's like cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.208,
    "end": 4204.528,
    "text": "It's like a holistic integration of all these features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.749,
    "end": 4214.311,
    "text": "What does embodiment, this perspective, have to do with realism and instrumentalism, and utilitarianism, and other philosophical positions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.989,
    "end": 4220.99,
    "text": " Are people really taking those positions or is it just as if they're taking those positions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.971,
    "end": 4226.012,
    "text": "And then what else are you really curious about and motivated to explore?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.873,
    "end": 4229.654,
    "text": "And how will you modify and improve your epistemic niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.734,
    "end": 4233.115,
    "text": "So hope you enjoyed this kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.449,
    "end": 4252.78,
    "text": " solo dot zero video i think it's been a little bit since the solo dot zeros but just want to close as always with what might a good understanding enable what are the unique predictions and implications what are the next steps for free energy principle and active inference research and application",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.908,
    "end": 4270.846,
    "text": " are the goals of this research and what are you still curious about we're going to be talking about this paper in the coming weeks on february 16th and february 23rd and so if you'd like to participate in those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.607,
    "end": 4293.227,
    "text": " discussions through live chat or by joining the discussions live just get in contact with us hope you read this paper because it's very thought provocative and interesting so enjoy the pape and working through it i hope to see you in other active lab activities thanks for listening and your regime of attention goodbye",
    "speaker": "SPEAKER_00"
  }
]