[
  {
    "start": 30.247,
    "end": 33.488,
    "text": " Hello and welcome everyone to ACT-INF Lab live stream number 38.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.668,
    "end": 36.189,
    "text": "It's February 23rd, 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.009,
    "end": 39.49,
    "text": "Welcome to ACT-INF Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.75,
    "end": 44.552,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.932,
    "end": 46.653,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.473,
    "end": 52.275,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.255,
    "end": 58.377,
    "text": "All backgrounds and perspectives are welcome and will follow good video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.117,
    "end": 70.7,
    "text": " Go to ActiveInference.org to learn more about how to participate in any of these live streams, which are part of the comms communications organizational unit, or just any other part of the lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.1,
    "end": 78.042,
    "text": "All right, today in ACT-INF stream number 38.2, we're going to be having our third discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.402,
    "end": 87.124,
    "text": "There is the dot zero, the dot one, and now the dot two on this paper, the evolution of brain architectures for predictive coding and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.365,
    "end": 88.725,
    "text": "And, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.256,
    "end": 94.498,
    "text": " Maybe each of us have a few ideas in mind, and I'm sure we'll come up with a few other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.598,
    "end": 98.02,
    "text": "Plus, if anyone's watching live, they can write a comment in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.9,
    "end": 108.825,
    "text": "So we'll start with just introduction, saying anything if we want about the paper before just jumping in somewhere or somewhere else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.885,
    "end": 110.406,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.526,
    "end": 114.988,
    "text": "I'm a researcher in California, and I will pass it to Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.482,
    "end": 119.103,
    "text": " Hi, I'm Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.223,
    "end": 130.191,
    "text": "I'm up here in Calgary, and I'm not doing very much except trying to keep up with all the papers that we're looking at in active inference, and I'll pass it down to Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 132.933,
    "end": 133.473,
    "text": "I'm Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.593,
    "end": 141.239,
    "text": "I'm a research consultant in New Mexico, and I really enjoyed this paper for many reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.0,
    "end": 145.162,
    "text": "My background in neuroscience, not particularly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.414,
    "end": 148.515,
    "text": " being a priority, but yeah, it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.055,
    "end": 153.676,
    "text": "So I'm excited to get into it and to discuss some of the points that I picked up with you guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.017,
    "end": 156.297,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.697,
    "end": 172.463,
    "text": "Well, blue joining us today, what figure can we start with or start with a blank sheet and just any of the points that you'd like to raise or we can do something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.424,
    "end": 175.824,
    "text": "Uh, man,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.263,
    "end": 205.161,
    "text": " like figure four for me was like awesome um so maybe that was my favorite figure maybe that's the one we should start with okay all right so what was your just perspective on what figure four was and then what did it mean or why was it interesting for you so i was interested in this figure and maybe like even in how this figure could be expanded in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.141,
    "end": 210.666,
    "text": " hierarchical depth and temporal depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.786,
    "end": 219.576,
    "text": "And temporal depth like has more than one potential scale, which isn't really like mentioned here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.676,
    "end": 221.799,
    "text": "Like temporal depth can be thought of as like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.194,
    "end": 225.915,
    "text": " small time steps, like what am I going to do next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.935,
    "end": 227.176,
    "text": "What's my next action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.736,
    "end": 242.322,
    "text": "But also like in bigger time steps, like what is the next iteration of me and how like these hierarchical depths, like, cause that's obviously like a larger level hierarchy, like the next iteration of me as a species or the human species, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.722,
    "end": 248.965,
    "text": "Like what is the next iteration of the species versus what is the next action I'm going to perform as part of the species?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.445,
    "end": 251.686,
    "text": "So that was kind of an interesting, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.766,
    "end": 265.099,
    "text": " perspectival dance that they took and just really like the, yeah, multidimensionality of this and how to kind of think about it in like a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.636,
    "end": 270.999,
    "text": " maybe like a, is this like a multidimensional space, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.059,
    "end": 275.222,
    "text": "Like, is it like in terms of like my cells, what are my cells going to do next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.362,
    "end": 281.786,
    "text": "My tissues, my organs, me, my active inference lab, like what are all these things going to do next?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.986,
    "end": 287.25,
    "text": "And also like on that level, is that like a short timeframe or is it like a large timeframe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.71,
    "end": 294.235,
    "text": "And do the timeframes differ or can like the same hierarchical level have more than one timeframe or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.348,
    "end": 303.09,
    "text": " Okay, nice questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.691,
    "end": 313.363,
    "text": "Dean, what do you think about any of that as we start to look at figure four as a starting point for talking more about what Blue just mentioned?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.144,
    "end": 315.185,
    "text": "Well, I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.508,
    "end": 325.776,
    "text": " One of the things we touched on in the point one was the idea that within a frame, there's also an orthogonal mesh.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 326.017,
    "end": 341.731,
    "text": "So as we push through this representation from the bottom up, are we going from what might be described as an architectural existence to at the top, what we might describe as architectural learning?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 342.231,
    "end": 342.712,
    "text": "Now, of course,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.713,
    "end": 355.002,
    "text": " If we take that position, we have to be careful that we're not reinforcing the idea that it's all about constructivism all the time versus being creative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.303,
    "end": 358.105,
    "text": "I think you need to be a little bit of both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.605,
    "end": 366.993,
    "text": "And I'm not being creationist, like not one story that carries forward all the way through time, as Blue kind of reffed there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.653,
    "end": 370.155,
    "text": "But the idea that the updating",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.306,
    "end": 375.489,
    "text": " matters throughout the time scale that you choose to look at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 376.25,
    "end": 388.859,
    "text": "And so now the question is, is architecture the lens that we should be using to talk about how we advance from mere existence to a place that we would describe as learning?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 395.049,
    "end": 400.13,
    "text": " I mean, that's what was chosen here, but is that the one way now, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 400.771,
    "end": 401.271,
    "text": "It's a way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 401.371,
    "end": 401.931,
    "text": "It's a good way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 401.951,
    "end": 406.932,
    "text": "It certainly makes something super, super complex into something that's just complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 407.852,
    "end": 408.813,
    "text": "But is it the only way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 408.833,
    "end": 409.313,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 411.814,
    "end": 416.295,
    "text": "Just one question of clarification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 416.455,
    "end": 419.476,
    "text": "When you said this is the only way, what were you referring to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.556,
    "end": 421.256,
    "text": "This figure four or what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.596,
    "end": 424.357,
    "text": "Through architecture, the idea of an architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.405,
    "end": 441.372,
    "text": " the architectural lens, as opposed to other ways that we might build out this idea of going from homeostatic existence to going from unknowing to knowing, and whatever that means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 447.415,
    "end": 447.695,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.586,
    "end": 450.647,
    "text": " Thanks for sharing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 450.687,
    "end": 458.992,
    "text": "Just to kind of maybe connect this, you mentioned architectural distance, which is within the metered space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.673,
    "end": 467.118,
    "text": "Whatever the metric is or the measure or the grids that you draw, there's a distance within a map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.539,
    "end": 483.278,
    "text": " And that's like the ecological transect, that's the blueprint, that's the forensic analysis, and then that's like parametric learning, because it's a distortion of parameters in a given space, and then fully defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 484.119,
    "end": 510.465,
    "text": " not just like space for openness whereas the architectural learning is at the structural level architectural and then that was kind of like what you related to not just the homeostatic or even the allostatic perhaps but something that's like the sort of unknown unknown open-endedness biological open evolutionary trajectories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.018,
    "end": 514.0,
    "text": " Yeah, so not just sustaining it, but actually realizing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 522.926,
    "end": 532.772,
    "text": "So we'll just get a few notes on each of these transformations, then see what other ones or what are some situations that might model, then also return to the questions that were asked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.908,
    "end": 563.671,
    "text": " raised early by blue like with a multi-level self and like where are the where's mental action or thought in this model the examples were provided of like um for example the allostat that took the temperature homeostat and then added in in their example like the sunrise visual detector and modeler column and so that gave the anticipatory change in body temperature when the sun was viewed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.626,
    "end": 589.766,
    "text": " then is there a um similar structure for cognition is it just like linking together senses in more and more combinatoric way it's a very sense oriented perspective which from an evolutionary perspective which is what this paper is exploring that's the one to ground further elaborations and changes on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.888,
    "end": 595.471,
    "text": " rather than trying to reverse from something like engaging counterfactuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.271,
    "end": 608.059,
    "text": "So just using an active inference model, sometimes for a counterfactual agent, if the model says that, that's okay, or doing the bacteria without implying that it's doing the counterfactual explicitly, that might be possible too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.653,
    "end": 623.154,
    "text": " So we have thermal regulation in the paper, but then the question is, does that equate to feelings in a human being, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 625.592,
    "end": 632.137,
    "text": " Like, does all that feelings cover necessarily collapse down to the example of thermal regulation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 632.778,
    "end": 640.344,
    "text": "And at what point are we aware of the fact that there might be a difference between the example and the concept?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 641.145,
    "end": 646.689,
    "text": "Like, where in this figure four is that blurry line that we cross?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 647.69,
    "end": 648.51,
    "text": "It's a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 648.53,
    "end": 650.192,
    "text": "I don't know where it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 652.344,
    "end": 657.386,
    "text": " So Dean, are you talking about feelings like emotions or feelings like sensations or both?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.426,
    "end": 658.607,
    "text": "Yeah, all of that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 658.647,
    "end": 666.55,
    "text": "So feelings tends to take on a big sort of, it's more detached from the example of thermal regulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 667.331,
    "end": 678.456,
    "text": "And yet that's just the fact that you can ask that question proves out that maybe the one example doesn't cover all of the different aspects of the higher concept, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 678.476,
    "end": 678.816,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 679.411,
    "end": 681.772,
    "text": " And that's where the scaling part comes in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 682.193,
    "end": 686.215,
    "text": "So it's not just temporal depth that allows for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 686.255,
    "end": 689.037,
    "text": "You have to have the temporal depth and the hierarchical depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 692.699,
    "end": 694.7,
    "text": "What kind of feelings are you talking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 695.62,
    "end": 705.226,
    "text": "Implies that there's more than one way that has to exist for you to come at that, to ask that question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 705.486,
    "end": 707.067,
    "text": "Where do we draw the partition?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 708.708,
    "end": 708.908,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 710.094,
    "end": 714.078,
    "text": " So in here, they show duplication.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 714.739,
    "end": 721.785,
    "text": "But it kind of, I'm not going to say it misleads, but it could potentially mislead if you think that there's a linearity to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 722.506,
    "end": 723.087,
    "text": "But in fact,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 723.899,
    "end": 729.702,
    "text": " A couple of times Daniel talked in the point one about the fact that there is a step function moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 730.263,
    "end": 731.183,
    "text": "There is a jump.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 731.764,
    "end": 732.504,
    "text": "It's not a jump.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 733.124,
    "end": 741.93,
    "text": "I forget the example of one example where we can't say you just go from one eye to two just because.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 741.95,
    "end": 744.471,
    "text": "I think that was one of the examples you gave, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 745.031,
    "end": 750.955,
    "text": "But at some over evolutionary time, there is these little progressions where if you look back on it,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 751.388,
    "end": 756.431,
    "text": " it seems like a rather large jump took place, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 761.413,
    "end": 762.214,
    "text": "Let me give a few.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.434,
    "end": 782.595,
    "text": " So when you said like the big jumps, and so in one sense, that's related to the kind of discussion around complex patterns of evolution and some phenotypes or genotype regions that are very stable through long periods of time over many generations, like the ultra conserved elements in the genome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 783.135,
    "end": 801.472,
    "text": " that have very low mutation rates versus regions that have high mutation rates etc and then same as phenotypes like phenotypes that are very constant like the coelacanth fish or phenotypes that are very plastic or dynamic or ones that we just don't have the records of um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.142,
    "end": 826.178,
    "text": " then how to connect what is happening or the models that we want to make in humans especially with computer enabled and language enabled humans technology enabled humans with the continuum of cognitive processes and then you said like it's not linear and then that kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.045,
    "end": 838.906,
    "text": " made me think like there's like feelings which um was still it's still a rich qualitative area like you brought out like sensations but also experiences and emotions and then how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.425,
    "end": 851.974,
    "text": " quickly slash securely or unambiguously can we map just that cloud of concepts just to be like, it's a policy selection on attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.574,
    "end": 855.056,
    "text": "It's an uncertainty on valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.957,
    "end": 856.617,
    "text": "It's valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.078,
    "end": 865.625,
    "text": "Like we're doing the parametric cognitive model with this, but it's still even a little bit open what this represents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.205,
    "end": 868.828,
    "text": "Is this the evolutionary biologists",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 869.738,
    "end": 872.46,
    "text": " doing model testing on a phylogenetic tree?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.7,
    "end": 884.706,
    "text": "Or is this talking about the genomic or the neurophysiological components that have to be connected just anatomically for a certain function to arise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.647,
    "end": 891.33,
    "text": "And that is the rich area that there's so much to explore in too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.247,
    "end": 896.972,
    "text": " Well, I think the one thing we can agree on is, because we're talking about evolution, we're talking about history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 897.532,
    "end": 904.339,
    "text": "So it is backwards looking, and backwards looking is easier than looking into the future, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 905.0,
    "end": 907.302,
    "text": "So I think that's one thing we can agree on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 908.063,
    "end": 912.928,
    "text": "What this is trying to do is explain, perhaps, how the history came about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 915.828,
    "end": 930.776,
    "text": " So one thing that the authors mentioned as well, and that's kind of linked to the idea of feelings, this was a discussion about the evolution of brain architecture, but there's also the fact that brains are in bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.056,
    "end": 932.357,
    "text": "They don't just exist in jars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.277,
    "end": 936.299,
    "text": "And for me, at least, I feel like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.435,
    "end": 955.142,
    "text": " feel like emotions not necessarily sensations but i feel like emotions are driven in a large part by the body like we've we've made a huge kind of connection between like the gut and the brain um and like there's probably more connections to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.236,
    "end": 961.857,
    "text": " because I feel feelings like emotions deeply in my body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.898,
    "end": 965.439,
    "text": "Like I feel them in my heart or I feel them in my stomach or I feel them in my pinky toe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.999,
    "end": 973.981,
    "text": "So I really think that the idea of like emotions can't be separated from embodiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.981,
    "end": 980.863,
    "text": "But prediction, I think it's a mental activity or at least like I feel it in my brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.883,
    "end": 983.884,
    "text": "So I don't know if that's the same kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.569,
    "end": 994.455,
    "text": " sensation that everyone has, but like prediction is in my mind, a brain thing, but I know that it's also that's overridable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.535,
    "end": 997.697,
    "text": "Like if someone throws a ball at me, like I put my hand up, like that's a reflex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.437,
    "end": 1001.76,
    "text": "So, but that's, is that like my brain driving my body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.62,
    "end": 1012.486,
    "text": "I'm not sure really, but I know that there's, um, you know, some, some prediction that's maybe not mental, that's more like physical or that's more embodied is probably the right word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.506,
    "end": 1013.307,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1016.356,
    "end": 1019.397,
    "text": " And you kind of move into that intuitive space as well, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1019.437,
    "end": 1030.921,
    "text": "Like if you think about going to the beach, I can't tell whether you're going to think about the wetness aspect of that, the warmness part of that, the smell of the sunscreen part of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.961,
    "end": 1041.084,
    "text": "But that prediction is going to also generate embodied emotions, even though you may not articulate them, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1041.805,
    "end": 1043.065,
    "text": "You're still intuiting them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1044.107,
    "end": 1045.468,
    "text": " you're still anticipating them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.948,
    "end": 1061.215,
    "text": "And so I'm not sure how the architecture pulls that out, especially to Daniel's point where our form has adapted evolutionarily to the phenotypical situation that we find ourselves in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1062.036,
    "end": 1071.1,
    "text": "And going forward, let's say that sea levels rise and suddenly you have beachfront property where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1071.581,
    "end": 1073.283,
    "text": " For millions of years, you did not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.883,
    "end": 1076.526,
    "text": "How does that affect now your emotions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1077.707,
    "end": 1077.947,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.708,
    "end": 1090.279,
    "text": "So I like the architectural idea of being able to take something and look at the historicity of it and be able to try to explain it out with a little bit more confidence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1092.461,
    "end": 1093.381,
    "text": "I'm not sure, though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1094.574,
    "end": 1104.937,
    "text": " I'm still struggling with being able to figure out how, if we want to look ahead, we can necessarily set it up the layered way it was set up here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1104.977,
    "end": 1106.298,
    "text": "And I really like figure four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1108.038,
    "end": 1114.601,
    "text": "But I just have to categorize it and keep it where it's most useful, which is in the backwards-facing part of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1115.061,
    "end": 1115.461,
    "text": "That's all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.582,
    "end": 1118.682,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1119.382,
    "end": 1121.003,
    "text": "Let's return to how to use this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.259,
    "end": 1124.301,
    "text": " That sounds like a good question, but we'll get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.902,
    "end": 1138.676,
    "text": "Lou brought up the brain and complement with the body, and this was just the quote from the very final lines of the paper, or near the end, where they acknowledge that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.851,
    "end": 1162.596,
    "text": " partial perspective that they present in the paper partial meaning just a portion of but also partial like partial to a certain view because they're with a neuroscience regime of attention and that's the contribution that was made that helps apply to other systems and then there's another synthesis to be made and this is kind of like the opening where they just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1163.789,
    "end": 1186.923,
    "text": " uh acknowledge that cognition can be extended and embodied and it suggests that not all aspects of control need to be solved by or represented a central generative model so it's this point that we've come to from many different angles from like the ecological and the cognitive and then here from more of a structure learning perspective that like the representation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.277,
    "end": 1202.066,
    "text": " whether just in the model of a system or in the system's own self-representation, it doesn't have to be the exact same thing as some latent variable in the outside world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.966,
    "end": 1209.831,
    "text": "So it's possible to have an effective model of climate action without a perfectly accurate model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.104,
    "end": 1226.588,
    "text": " But that has to be understood within, like was brought up, a space of counterfactuals of what could happen from the outside world where we really never can eradicate the total distribution and also the introduction of like unknown unknowns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.128,
    "end": 1233.31,
    "text": "And so that's the fundamental openness of the external states and the modeler's view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.13,
    "end": 1235.191,
    "text": "And then there's...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.906,
    "end": 1260.937,
    "text": " still a lot to explore with the counterfactuals of the models that the system that like the agent is can implement but i think that gets a little bit to how to start to use it in a certain area but um yeah any thoughts or what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.618,
    "end": 1262.558,
    "text": " I've got a question for you, Dan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1262.618,
    "end": 1272.462,
    "text": "So when you studied ants, for example, and their foraging, and I think it's section eight or I forget what section that they say foraging really, really matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1273.002,
    "end": 1288.748,
    "text": "I think if we're point two-ing this now, I think that the sort of the go forward piece of this is now when you started looking at ants, did you start from a position, I don't know what your background is, but did you start from a position of sort of pulling apart the historicity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1290.174,
    "end": 1294.375,
    "text": " of why that thing is now sort of laid out the way it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1294.855,
    "end": 1304.678,
    "text": "I know there's a piece of that that's there, but is that the place where most people that begin a study start?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1305.898,
    "end": 1308.219,
    "text": "Which is kind of interesting about this paper, because to me,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.786,
    "end": 1315.567,
    "text": " going from existence to learning implies a certain history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.048,
    "end": 1330.993,
    "text": "And so I'm wondering how you sort of come at things when you see them foraging, where history fits in terms of that, you gaining some understanding of what's happening here, as opposed to then what happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1333.875,
    "end": 1334.595,
    "text": "Great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1336.192,
    "end": 1340.279,
    "text": " The topic is historiosity and foraging for 400 from Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.983,
    "end": 1344.066,
    "text": "Lou, what would you say on the topic first?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.307,
    "end": 1346.05,
    "text": "How would you bring that together?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.13,
    "end": 1347.452,
    "text": "What would be some important points?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.892,
    "end": 1357.435,
    "text": " So I really liked this idea also, and I have like a completely unrelated point and then an unrelated question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.515,
    "end": 1365.017,
    "text": "So it says mechanisms of memory and planning have evolved from mechanisms of navigation in the physical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.137,
    "end": 1372.499,
    "text": "And some super interesting that I thought side point was, if you've ever read the book, Deep Work by Cal Newport,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.483,
    "end": 1375.844,
    "text": " he talks about memorizing a deck of cards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.944,
    "end": 1377.545,
    "text": "And if you haven't read the book, read the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.065,
    "end": 1388.05,
    "text": "But it's interesting because he goes through a very elaborate way to memorize the deck of cards, and it's through building a memory palace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.59,
    "end": 1390.431,
    "text": "And so in this memory palace,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.531,
    "end": 1394.833,
    "text": " you have a place that you know very well, like your own house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.293,
    "end": 1397.434,
    "text": "You can imagine walking through your door.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.454,
    "end": 1399.895,
    "text": "You imagine the porch, the doorstep, how it looks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.375,
    "end": 1405.118,
    "text": "You imagine the doorway, all the rooms, all the closets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.238,
    "end": 1410.58,
    "text": "Imagine going through your house, taking a tour, and exploring each room in a very systematic way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.92,
    "end": 1413.482,
    "text": "So it's very easy to memorize a route you would take through your house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.722,
    "end": 1417.584,
    "text": "Say you're looking for a ghost in your closet or something hiding in your house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.744,
    "end": 1418.224,
    "text": "How would you look?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.724,
    "end": 1423.328,
    "text": " So you go through your house and you, so you have this palace, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.368,
    "end": 1424.189,
    "text": "That you have in your mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.649,
    "end": 1430.113,
    "text": "And then he talks about making every card a character, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.153,
    "end": 1439.421,
    "text": "Like, like, so, you know, the queen of hearts is, you know, queen Elizabeth or, or something like who is each character in the card deck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.921,
    "end": 1440.702,
    "text": "So each character,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.089,
    "end": 1443.632,
    "text": " character in the card deck becomes a character that you memorize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.953,
    "end": 1447.397,
    "text": "So you've memorized these 52 cards as people that you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.417,
    "end": 1453.725,
    "text": "And then, and so this is an interesting play also on the socio dynamics as well as the spatial",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.295,
    "end": 1454.875,
    "text": " dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.895,
    "end": 1457.417,
    "text": "So each character in the deck is the person that you know well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.777,
    "end": 1461.639,
    "text": "You memorize that 52 people correspond to these 52 cards and you know the layout of your house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.06,
    "end": 1465.642,
    "text": "So then when you can go through the order of the deck, anybody can do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.682,
    "end": 1467.103,
    "text": "You can repeat back the order right away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.483,
    "end": 1473.626,
    "text": "So like you go through the cards and you say, okay, you know, you can go through it three or four times and then you know the entire order of the deck of cards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.967,
    "end": 1480.35,
    "text": "So this is how to repeat back the order of a deck of cards in like just you memorize the order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.451,
    "end": 1481.791,
    "text": "Like, oh, there's the queen of hearts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.851,
    "end": 1482.752,
    "text": "She's in my closet and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.28,
    "end": 1486.662,
    "text": " you know, like all these, or who's standing in the doorway is like the first part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.702,
    "end": 1486.882,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.962,
    "end": 1492.905,
    "text": "And so, you know, the tour through the house and you place these people in this spatial orientation in your house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.625,
    "end": 1500.809,
    "text": "And so, and this is like a proven solid way, like the people that do these kinds of memory trips use by constructing this memory house.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1500.849,
    "end": 1508.253,
    "text": "And I thought that that was super interesting in relation to this paper, that memory and planning have evolved from mechanisms of navigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.914,
    "end": 1509.775,
    "text": " in the physical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.895,
    "end": 1522.026,
    "text": "And I also wonder if there is like a social role that also contributes to memory and could that social role be this kind of higher level allostat, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.046,
    "end": 1527.471,
    "text": "Like we talked about the homeostat and that's like, there's no other, like you've got one time step, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.531,
    "end": 1534.598,
    "text": "And then in the allostat, there's other ways to kind of modify, but how many, like in a social component,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.097,
    "end": 1538.3,
    "text": " you know, to succeed and function and to actively have memory and prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.76,
    "end": 1542.404,
    "text": "Like, does a tissue have memory because there's other cells in the tissue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.744,
    "end": 1545.987,
    "text": "Does an ant have memory because it can spatially navigate for food?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.107,
    "end": 1547.868,
    "text": "And also, it knows its friends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.229,
    "end": 1552.072,
    "text": "You know, like, I'm sure, like, ants have ways to distinguish one ant from another ant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.933,
    "end": 1554.574,
    "text": "Like, they're very social creatures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.695,
    "end": 1556.876,
    "text": "Like, I don't think that they all think they're all the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.937,
    "end": 1558.378,
    "text": "Like, my cats don't, definitely don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.991,
    "end": 1564.452,
    "text": " Like my cats know each other, but like if you showed them like a stray cat, like they'd be really upset at the stray cat, I'm sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.972,
    "end": 1566.613,
    "text": "So, you know, animals know each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.633,
    "end": 1568.613,
    "text": "I'm sure ants know each other also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.773,
    "end": 1571.934,
    "text": "And so what component of memory is also social?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.914,
    "end": 1576.455,
    "text": "And that just, yeah, Cal Newport spoke reminded me of that or brought that to light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.635,
    "end": 1577.875,
    "text": "Sorry, sorry if I remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.336,
    "end": 1581.636,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.992,
    "end": 1604.8,
    "text": " it brings up a lot of the aspects that i could add to now just from a specifically anti perspective so you mentioned the evolutionary aspect it's one of the themes of the paper that perhaps from forging but other processes too as key cognitive demands those early challenges or like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.132,
    "end": 1623.474,
    "text": " ancestral challenges giving rise to current life were faced in and met in this way so that was the evolutionary aspect you mentioned and then um thinking about the history at multiple nested scales so like there's the history of the ant colony as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.435,
    "end": 1640.841,
    "text": " a genuine modelable entity where the colony year after year kind of develops in its foraging territory as its colony personality or basically phenotype at the colony level um evolve and then asterisk one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.981,
    "end": 1651.331,
    "text": " Then at the nestmate level, it's the recent interactions of a nestmate that induce it to forage, locally meaning retrieving a seed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.831,
    "end": 1658.878,
    "text": "So like there might be an ant whose current neural or hormonal state is such that a lot of interactions with incoming foragers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1659.679,
    "end": 1661.001,
    "text": " don't stimulate more foraging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1661.502,
    "end": 1675.101,
    "text": "But then there might be another ant whose status is such that a certain reduced rate of interactions with other foragers, maybe even no interactions with other foragers in the entry chamber, cause it to go on a foraging trip.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.97,
    "end": 1680.553,
    "text": " That foraging biology is specific to this ant shown here, the harvester ant, but maybe other ants too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.573,
    "end": 1681.814,
    "text": "Okay, that's asterisk two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.314,
    "end": 1683.315,
    "text": "Then there's the ant tissue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.935,
    "end": 1701.886,
    "text": "And like each of the ant tissues, the brain, the different glands, the gut, they're all undergoing kind of stereotyped transitions that are called temporal polyethism, or they're going through like recent changes, like a leg was lost and then the rest of the body like adapts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.946,
    "end": 1704.188,
    "text": "So that's like the history of each nestmate tissue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.36,
    "end": 1726.913,
    "text": " The asterisks kind of combine for me personally, but also just more conceptually with thinking about the relational view on modeling the ants, like not taking too strong a view on where phenomena should be located in terms of nestmate versus collective cognitive behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.293,
    "end": 1731.574,
    "text": " And then also the place-based and the field and the long-term experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.214,
    "end": 1739.857,
    "text": "So my advisor, Professor Deborah Gordon has done like a 30 year plus field study in Arizona.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.517,
    "end": 1743.818,
    "text": "And so I was doing five years of field work there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.066,
    "end": 1759.958,
    "text": " But it was like year, I don't know, 20 something or 30 something to some other number five years later in this space where there was a lot known about this ant with a long lived colony, but with turnover of the foragers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1761.058,
    "end": 1762.7,
    "text": "And so the sort of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.215,
    "end": 1780.057,
    "text": " ecological and the place-based nature, and then also the specific biology of this ant, where the forager was just so clearly an expendable part of the process of the colony, like sloughed off, and some other features of the foraging biology of these ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.391,
    "end": 1807.354,
    "text": " pretty interesting system and it reveals a lot on like different cognitive demands and different foraging environments so that's not even getting into the whole mental foraging or affective component but just at the ant foraging level i think you brought up an important point though daniel and i'm not sure if people associate architecture with abduction but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.894,
    "end": 1823.637,
    "text": " your advisor, supervisor, whatever her title was, her 30-year window, and then where you stepped in for your five-year window as nested, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1823.757,
    "end": 1827.898,
    "text": "You were the one now nested within a larger timeframe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1828.358,
    "end": 1833.199,
    "text": "So back to Blue's earlier point, but you weren't historically looking back",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1834.008,
    "end": 1847.183,
    "text": " from the perspective, oh, okay, here's the evolutionary nature, you are now seeing yourself as relative to something that had a greater timestamp, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1847.223,
    "end": 1853.129,
    "text": "So you walked into the party, and you had to ask yourself, did these ants come from this colony?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1853.87,
    "end": 1855.072,
    "text": "So back to Peirce's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1856.634,
    "end": 1857.775,
    "text": " big question of, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.195,
    "end": 1871.266,
    "text": "So it's when I come into the situation that matters as much as if I can induce a skyscraper or deduce how much structural rigidity that requires, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1871.807,
    "end": 1875.57,
    "text": "So I think this is kind of interesting now because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1877.116,
    "end": 1891.261,
    "text": " I'm not sure if we should assume, like when you were talking about the phylogenetic trees, sometimes we just assume where we're stepping in on the branching, but I'm not sure we should make that assumption.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1891.501,
    "end": 1898.044,
    "text": "I think we have to be careful to be, as you said, very explicit, not just assumptive of where we come in in this history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1898.724,
    "end": 1903.206,
    "text": "Because if we don't, we can end up thinking that this is sort of a linear layering",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1904.226,
    "end": 1931.696,
    "text": " that figure four when when maybe it's more like identity it's it's both stable and dynamic so it's definitely related to almost the very first comments of blue of like where's multi-scale identity and multi-scale systems in this hierarchical depth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.006,
    "end": 1939.427,
    "text": " It may be related in some way to multi-scale systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.447,
    "end": 1940.368,
    "text": "We could draw that out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.488,
    "end": 1950.951,
    "text": "But where is that nesting that we're describing, the real physical enclosure sense, and this way that mental systems can almost be modeled as nested?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.371,
    "end": 1957.613,
    "text": "Just like we saw mental action as a nesting of a cognitive model with an action model inside of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.372,
    "end": 1967.075,
    "text": " It's like the mental is enclosing and even modeling through inclusion of the peripersonal space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.595,
    "end": 1977.279,
    "text": "But then with like a drop off going further out, then what is that modeling space and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.235,
    "end": 1980.616,
    "text": " Is there another operation here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.636,
    "end": 1982.617,
    "text": "Again, what are these graphs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.877,
    "end": 1983.597,
    "text": "What are we seeing here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.577,
    "end": 1984.798,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.278,
    "end": 2000.525,
    "text": "Well, my question is, to answer Blue's question, do we get closer to a satisfactory answer by looking at the mechanics of this, or do we get a better sense of it by seeing the relationship?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2000.565,
    "end": 2005.927,
    "text": "Like when you were explaining the ant part, you spent a lot of time talking about relationship.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2007.228,
    "end": 2007.988,
    "text": "And I think maybe...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2008.849,
    "end": 2019.615,
    "text": " one of the things we try to do is we try to apply the operation to it when in fact what we should be doing is seeing the relationship in its entirety.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2019.975,
    "end": 2028.92,
    "text": "I don't want to say zoom out because you can still zoom out and still get bogged down in the sequencing because that's kind of what this does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2028.981,
    "end": 2035.684,
    "text": "It says this layer of sequencing can now build out, fractal out into these other layers of sequencing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2035.984,
    "end": 2038.486,
    "text": "And I'm suggesting rather than seeing the layers,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2038.991,
    "end": 2041.833,
    "text": " Maybe it's the totality of the relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2043.094,
    "end": 2043.515,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2043.535,
    "end": 2050.5,
    "text": "Because Blue also pointed to the social piece, which is all relationship all the time, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2051.161,
    "end": 2062.79,
    "text": "So I'm just wondering if we help ourselves, if we collapse to, oh, well, this is now explainable because we have some way of showing the sequence, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2064.107,
    "end": 2080.702,
    "text": " Sometimes that helps, but maybe in this case, from an evolutionary standpoint, it doesn't matter whether we're talking about 100,000 years ago and today as much as the relationship of what 100,000 years ago and today represents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2082.683,
    "end": 2083.044,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.724,
    "end": 2084.605,
    "text": "Just throwing it out there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.047,
    "end": 2087.788,
    "text": "Thanks for sharing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.828,
    "end": 2090.19,
    "text": "Just one thought on that, and then we'll continue here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.486,
    "end": 2103.46,
    "text": " phylogenetic trees with genomic data are usually based upon sequence alignment followed by the fitting of a tree on the aligned sections of the sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.378,
    "end": 2113.366,
    "text": " And so there's a lot of ways and approaches of modeling from the sequence alignment itself, from unaligned to aligned sequences, a lot of ways you could do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.907,
    "end": 2119.912,
    "text": "And then from the aligned sequence matrix to the tree model, there's a lot of ways to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.932,
    "end": 2121.093,
    "text": "It could be a bifurcating tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.114,
    "end": 2124.276,
    "text": "It could be like a different kind of tree, different algorithms, Bayesian, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.998,
    "end": 2128.2,
    "text": "One interesting point that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.423,
    "end": 2136.374,
    "text": " many have raised, but it's very challenging to deal with is that depending on how stringently you align the sequences,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.657,
    "end": 2146.943,
    "text": " different sites with different histories or different information content, partially or in totality, are being filtered out in a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.643,
    "end": 2159.05,
    "text": "So if you have a mode of evolution where short chunks get interchanged so that locally the sequences are not changed, like domains of a protein aren't changed, but then they're swapped in order,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.103,
    "end": 2162.104,
    "text": " those might become non-alignable sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.145,
    "end": 2171.309,
    "text": "And so the hope is that those kinds of genomic changes are silent with respect to the long-term evolutionary history of a species.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2171.41,
    "end": 2173.991,
    "text": "But in the short term, other methods might be needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.471,
    "end": 2179.494,
    "text": "But in the long term, it's the hope that by pulling back to like the alignable sections, you can get a good signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.994,
    "end": 2185.498,
    "text": "And so that's a pretty satisfactory approach when multiple converging threads do exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.443,
    "end": 2202.615,
    "text": " overwhelmingly agree but it really shows that when there's like a signal processing filtering and then a model fitting this the information in the data can be extremely powerfully misleading",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.488,
    "end": 2225.532,
    "text": " because you're getting exactly the same post-normalized data, whether it was total noise in, total bias out, or whether your correction process over-normalized for one thing or another, those are kind of in that gray zone, unknown, unknown space, coming into the searchlight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.772,
    "end": 2230.393,
    "text": "And so there's the whole looking out of the searchlight story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.913,
    "end": 2231.233,
    "text": "So maybe...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.318,
    "end": 2235.342,
    "text": " Where do we situate active inference with respect to that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.744,
    "end": 2241.271,
    "text": "Looking where the light is, searching for one's keys, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.593,
    "end": 2248.401,
    "text": "So can I just say real quick, I'm not advocating for don't show your work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2249.898,
    "end": 2252.259,
    "text": " I believe that showing your work really matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2252.899,
    "end": 2265.144,
    "text": "And then when you're trying to explain what's happening at a certain point, don't get stuck in, well, this was the order of the steps that I took when I showed my work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2265.544,
    "end": 2269.266,
    "text": "Try and zoom out and try and understand what the relationship was well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2270.086,
    "end": 2278.91,
    "text": "That's all I'm, what I'm asking is that, does that help being able to toggle back and forth?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2280.471,
    "end": 2288.276,
    "text": " So can I just jump in here for a second and point out that we have phylogenetic trees or we had, yeah, I guess,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.28,
    "end": 2296.463,
    "text": " They weren't called phylogenetic trees at the time, but we've had speciation trees long before we had genetics, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.523,
    "end": 2300.605,
    "text": "And so we can construct them based on morphometric analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.445,
    "end": 2314.951,
    "text": "And something that I liked in this paper is that it really drew out the importance of the niche environment with respect to duplication, because we saw many instances of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.469,
    "end": 2320.611,
    "text": " species because we did these trees when we didn't have genetic information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.711,
    "end": 2324.713,
    "text": "And so we had all of these morphometric characteristics that we thought were similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.053,
    "end": 2331.975,
    "text": "And so we lumped these species together because they must be related because they share this morphometric feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.376,
    "end": 2334.677,
    "text": "But in many circumstances, that was not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.837,
    "end": 2340.679,
    "text": "And so because of the similarity of the niche environment or even existing in the same niche,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.172,
    "end": 2346.497,
    "text": " You know, we had evolution converge on this feature that was successful in that environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.937,
    "end": 2352.162,
    "text": "And so I think here, like the idea of duplication and the authors got into that, which I thought was really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.663,
    "end": 2360.17,
    "text": "So, so the same mechanism can evolve more than one time in parallel, just because of the fitting to the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.881,
    "end": 2363.621,
    "text": " Totally agree, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.701,
    "end": 2379.967,
    "text": "So when I said multiple conversion lines of evidence, like what I was totally thinking of was how genomics, the patterns that we get from those aligned sequences, do recapitulate and even discover unexpected but later verified relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.587,
    "end": 2383.828,
    "text": "And so that's sort of like a measure of the unique explanations and predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.169,
    "end": 2384.889,
    "text": "But this tree",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.669,
    "end": 2390.792,
    "text": " could have been fit with phenotypic characters, as you mentioned, as it was for a long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.872,
    "end": 2393.413,
    "text": "And then it was just a few sites in proteins.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.994,
    "end": 2399.256,
    "text": "And that was sort of like the 1960s and 70s was fitting with very reduced data sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.997,
    "end": 2404.699,
    "text": "And now the amount of genomic data is rapidly increasing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.1,
    "end": 2411.303,
    "text": "But out of the genomics analysis, the action state of phylogenetics is really just this tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.803,
    "end": 2414.164,
    "text": "Topology fit from a family of trees",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.285,
    "end": 2442.081,
    "text": " hopefully with an uncertainty associated whether they show it like with a bootstrap uncertainty or some other way but then that is an artifact now there's a few cases where like this is in and itself interesting like when people have resolved some deep relationships within insects or other groups and then it helps structure thinking that can later be brought out about different traits and ecologies but it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.061,
    "end": 2445.762,
    "text": " this is just a starting point for thinking about evolutionary histories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.802,
    "end": 2460.429,
    "text": "And like you said, similar ecological or generative processes dynamics might beget increased likelihood for a certain generative model to arise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.069,
    "end": 2470.174,
    "text": "And that's like kind of what ecosystem is, like a desert seed harvesting ant, whether it's in the Mediterranean or the Southwest U.S.,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.178,
    "end": 2479.48,
    "text": " like Pogonomyrmex in the US and then Cataglyphus in the Mediterranean regions, there's some similarities there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.501,
    "end": 2484.902,
    "text": "But then there's other species that are more closely related that have a different foraging ecology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.382,
    "end": 2493.124,
    "text": "So then how does the foraging strategy sometimes have extreme fidelity with the group?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2493.824,
    "end": 2498.766,
    "text": "Like leafcutter ants, where once they're committed to being a full leafcutter ant,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.103,
    "end": 2512.791,
    "text": " so to speak, evolutionarily, they don't, or they haven't been observed to revert back to some other mode versus other like foraging strategies at the group level, at the colony level, but it's the individual in the other sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.332,
    "end": 2515.713,
    "text": "That's like very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.054,
    "end": 2519.396,
    "text": "Like thinking about foraging phenotypes on this tree and why not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.004,
    "end": 2542.954,
    "text": " just like any other trait that you could study, like the evolution of first spatial foraging, and then the evolution of cognitive foraging, and then applying that to different search spaces, which was also explored a little in the citations here, the foraging in mind and foraging in semantic fields papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2543.535,
    "end": 2544.095,
    "text": "What would you say, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.966,
    "end": 2546.486,
    "text": " Well, so it's cool that you brought that up, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.586,
    "end": 2556.389,
    "text": "And just because in our past conversations, you've brought up that the same species of ant can have different foraging patterns based upon the colony that they live in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.849,
    "end": 2559.97,
    "text": "I think that that's super interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.99,
    "end": 2562.111,
    "text": "And I wonder how could you map",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.531,
    "end": 2591.248,
    "text": " foraging patterns like can you put foraging patterns into a phylogenetic tree right like is there a tree structure that we could use to describe foraging patterns and would that relate to or map on to this brain structure tree in some way like is there I mean even I mean there's a lot of diversity within the same brain structure also like the ants have the same brain structure but you know even humans have like some of us go to the grocery store some some humans out there are still like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.522,
    "end": 2595.484,
    "text": " hunting and gathering, you know, to make their food, so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.106,
    "end": 2597.666,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.766,
    "end": 2598.827,
    "text": "Oh yeah, Dean, go for it first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.336,
    "end": 2604.058,
    "text": " So you guys can learn me, school me on something here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2604.078,
    "end": 2623.126,
    "text": "So is there any evidence that ants all gather in the morning and the queen ant or whatever, the organizing ant, the principal ant pulls the map out and says, now I want you to take this thing that you've mapped and carry it out today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2624.011,
    "end": 2625.194,
    "text": " And I'm not being a smart aleck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2625.234,
    "end": 2632.053,
    "text": "I'm asking, is there some sort of analogous evidence that they do that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2634.628,
    "end": 2663.908,
    "text": " okay so to the um uh team huddle uh monday morning stand up no i hope that's not over generalizing because ants are also of course very diverse in their foraging strategies and a lot is unknown but just speaking to the first approximation the queen is not a central decision maker in information router hormonally and at a slower time scale for sure but at the behavioral regulation level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.908,
    "end": 2679.203,
    "text": " Now, in the morning for the Pogonomyrmex, they would like chill and some would slowly come out and like their walking speed is temperature dependent, like all insects and it just assessing maybe the humidity or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.25,
    "end": 2702.183,
    "text": " damage around the nest entrance so there's no reason why those archetypes like convergence before planning or rupture repair which of course cannot have a planning component directly different algorithms are going to have different levels there but because the ant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.883,
    "end": 2709.204,
    "text": " symbolic behavioral communication is pretty low bandwidth, probably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.024,
    "end": 2726.808,
    "text": "So unlike the waggle dance, which is conveying like quite a lot from an information theory perspective, using symbolic means like the direction and the distance and also chemical information like about the flowers, there's ants that like physically pull another of their nest mate to a foraging location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.068,
    "end": 2729.709,
    "text": "So using memory or pheromone or like tandem run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.868,
    "end": 2736.49,
    "text": " And there's probably some limited examples of being able to do some like a little bit higher order signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.75,
    "end": 2739.03,
    "text": "And also, of course, the smell of the food and the pheromone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.391,
    "end": 2740.891,
    "text": "And so a lot of the extended features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.172,
    "end": 2745.312,
    "text": "But they don't do a powwow with the queen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.613,
    "end": 2752.714,
    "text": "Okay, so let me take what you just said and sort of feed it back and maybe build on it a bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.515,
    "end": 2755.435,
    "text": "So you described a situation, it's morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2755.695,
    "end": 2758.336,
    "text": "If morning, then ant behaves differently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2758.877,
    "end": 2770.762,
    "text": " like so and in the last slide of this deck and the phylogenetic tree you had then to now or then if so what i'm wondering is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2771.892,
    "end": 2775.954,
    "text": " Can we exist in a sequential world of if-then?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2775.974,
    "end": 2780.796,
    "text": "As a homeostatic representation, is if-then all we need?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2781.216,
    "end": 2789.279,
    "text": "But if we want to include temporal depth and hierarchical depth, we actually incorporate the inversion of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2789.659,
    "end": 2792.58,
    "text": "We incorporate the then-if, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.401,
    "end": 2794.461,
    "text": "So that's my question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2794.561,
    "end": 2797.742,
    "text": "So to Blue's point earlier, where is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2800.043,
    "end": 2805.449,
    "text": " Where is this shift or this sense of what's going on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2805.489,
    "end": 2817.243,
    "text": "The relationship might be the discrepancy, the first representation, figure one, the discrepancy might be those people that are looking at things from an if-then perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2818.306,
    "end": 2825.589,
    "text": " If this, then we should expect that from a predictive standpoint versus the then if perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2827.39,
    "end": 2836.434,
    "text": "Then the critical call had to be made as the base runner was foraging for second base.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2837.314,
    "end": 2840.255,
    "text": "And a call was made now if.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.836,
    "end": 2846.678,
    "text": "Now a whole bunch of people chime in about what their interpretation of what just happened is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2848.55,
    "end": 2848.79,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2849.33,
    "end": 2860.557,
    "text": "So again, I'm not sure if only looking at it frontwards and backwards as a sequence is enough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2860.617,
    "end": 2867.5,
    "text": "I think we also have to be able to see the relationship of if-then and then-if from the historical view.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2868.021,
    "end": 2874.164,
    "text": "And I think when we do that, we go from architectural existence to architectural learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2877.605,
    "end": 2899.099,
    "text": " okay let me try to restate that but i've not lost the forging trail so yeah if the um outcome is like um the end point then that's the uh if then uh that's the if that if the person committed the crime you do the time and then um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.433,
    "end": 2907.919,
    "text": " the sort of then-if takes, it precludes if-then in multiple sequences of if-then and uncertainties on if-thens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.68,
    "end": 2911.422,
    "text": "And then it says, okay, then, or it's like if-then-if.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.482,
    "end": 2913.684,
    "text": "So we're kind of downplaying if.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2914.805,
    "end": 2917.587,
    "text": "And then that's where the outcome is a starting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.127,
    "end": 2921.35,
    "text": "And so that is, in one sense, it's teleological because it's end-directed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.37,
    "end": 2922.831,
    "text": "Like, where is this project going to go?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.232,
    "end": 2926.634,
    "text": "Do we really expect and prefer to publish this paper on February 28th?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2928.123,
    "end": 2930.845,
    "text": " And then also it includes the next steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2931.145,
    "end": 2941.633,
    "text": "So it creates a world model where there is a possible, which is say selectable set of policies that the team will achieve like that expected and preferred outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.174,
    "end": 2947.618,
    "text": "And then it sets it up for what would be the obvious next loop of policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.138,
    "end": 2955.684,
    "text": "And so if it's like, if things are this good or bad with the environment in 2030, then this is how much damage will go to this or this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2956.952,
    "end": 2961.876,
    "text": " even if you were right, it wouldn't involve the policy selection element.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.897,
    "end": 2978.268,
    "text": "And so that's probably a complex situation with the partitioning of estimation and world policy selection, which is clearly a separate discussion that's not only being invoked here as an example, but it just points to how those are different components of inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2978.889,
    "end": 2984.473,
    "text": "And then foraging, an example of if-then and then the as-if or then-if was like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2985.979,
    "end": 2993.15,
    "text": " Sometimes the colonies would pack their nest entrance with pebbles and then there'd be a thunderstorm in the afternoon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.261,
    "end": 3000.267,
    "text": " I don't think a study has ever... I mean, it's a totally widely observed behavior with many animals and there's no exception with harvester ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.127,
    "end": 3005.832,
    "text": "Now, maybe there's thunderstorms where they fail to make pebbles or it's not enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3006.752,
    "end": 3008.934,
    "text": "And there's probably some false positives too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.275,
    "end": 3012.518,
    "text": "So we don't really know the exact success ratio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3013.138,
    "end": 3016.221,
    "text": "Maybe it's better than the previous day's forecast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.241,
    "end": 3016.962,
    "text": "Maybe it's worse, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.809,
    "end": 3027.075,
    "text": " it's very clear to see that the nestmate doesn't need to have been inheriting from its evolutionary history and its niche",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.101,
    "end": 3051.1,
    "text": " rain cloud modeling software it's just picking up pebbles with a proclivity to interactions and humidity etc that help colonies that have that proclivity succeed in that niche which doesn't even mean that it was a popular phenotype like 20 years ago as things change in a region so that's like super interesting um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.952,
    "end": 3056.854,
    "text": " Let's return to foraging and the foraging variation question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.315,
    "end": 3061.617,
    "text": "But first let's see if we've completed the figure four discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.198,
    "end": 3070.642,
    "text": "And just like, is there anything else we want to add about like the main, because this is kind of what the paper works towards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.283,
    "end": 3077.827,
    "text": "And then there's like a little downhill roll is like, we could do this algebra on the tree, but this is sort of where things get led up to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.567,
    "end": 3106.982,
    "text": " through demonstration of the motifs and the connection between cognition and structures and structure learning and then like parameter learning at a behavioral or developmental time scale and then structure changes over evolutionary time scales so we have hierarchical depth temporal depth which we're also just kind of adding in a spatial component allostat which was used in the paper with the intermodality but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3107.887,
    "end": 3110.448,
    "text": " Maybe it could be other modalities or same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.569,
    "end": 3114.47,
    "text": "There's duplication, which is kind of like parallelization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.49,
    "end": 3120.392,
    "text": "That's like adding another nestmate or another unit to the compound I of an insect developmentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.472,
    "end": 3137.099,
    "text": "And then I is homeostasis, which is being used here as sort of the base or root or ancestral case, which is referring at the behavioral timescale to return to a stable point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.024,
    "end": 3144.972,
    "text": " And then also at the more evolutionary timescale, the I operator on the homeostat, it's like the homeostasis on homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.632,
    "end": 3148.415,
    "text": "It's keeping the structure of that model fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.298,
    "end": 3163.889,
    "text": " And then when the homeostasis at the evolutionary timescale is open, then the structural transformations here are like the affordances from that base case, which is what's being shown like with the main one on the left being broken into these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.609,
    "end": 3167.671,
    "text": "And then each of these become the prior for each of these next ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.655,
    "end": 3174.056,
    "text": "Anything to add or we go to foraging?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.697,
    "end": 3175.797,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3175.817,
    "end": 3175.917,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3178.22,
    "end": 3206.832,
    "text": " so great relevant question blue measuring foraging so one paper though there's a bunch that are really relevant but um michelle lenon 2014 did a lot of literature review and visualizations of foraging strategies in different ant species so um these are like some of the foraging approaches like foraging archetypes um and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3208.497,
    "end": 3232.152,
    "text": " uh categorized those into different traits on a tree and um so that's an awesome work and something that could and should be extended and integrated with like modern databases so that somebody could submit we just saw this one going in a trail and then that kind of reduces our uncertainty about a broader model of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.031,
    "end": 3254.541,
    "text": " ant foraging because it's like oh that's a surprising observation about this given what we already knew about that species for example but how do you actually measure foraging variation within or across a species so in this case these um in figure one these are like kind of like the structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.576,
    "end": 3257.356,
    "text": " at one level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.496,
    "end": 3258.957,
    "text": "They're like archetypes of structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.717,
    "end": 3262.598,
    "text": "Now, sometimes they probably blur within each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.958,
    "end": 3269.12,
    "text": "Like if it's two and it's tandem running, but if it's three, is it a group or is it still like pseudo tandem running?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.021,
    "end": 3273.382,
    "text": "So it could be a little blurriness and also there could be different modes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.614,
    "end": 3283.34,
    "text": " even within the same species or like a continuum between a foraging column with like a trunk and a spread versus like just a spread.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.76,
    "end": 3285.761,
    "text": "So this is sort of like, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.542,
    "end": 3294.947,
    "text": "I've got to like just jump in and say like how these look like neurons, like just with like differing axons and like dendritic arbors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.007,
    "end": 3298.009,
    "text": "Like I'm like, these are like different brain structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.309,
    "end": 3299.67,
    "text": "So I just had to like point that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.83,
    "end": 3301.031,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.111,
    "end": 3302.212,
    "text": "The bottom one definitely does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.272,
    "end": 3309.216,
    "text": " Even both of these and even this top one too, the trunk trails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.236,
    "end": 3310.276,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.257,
    "end": 3315.88,
    "text": "And let's just say that these are sort of archetypes within a broader space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.82,
    "end": 3320.142,
    "text": "And then within a given mode...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.439,
    "end": 3343.205,
    "text": " then the behavioral ecologist will tend to make like a more specific measure so let's just say it's a 100 a trail forager then having the counts to and from on the trail is a good measure so like in the harvester ants they most basically do this trunk trail on the top",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3344.165,
    "end": 3350.654,
    "text": " So there would be like one or two or three main avenues that they were leaving the colony in for that day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.135,
    "end": 3352.737,
    "text": "And then sometimes it'd be the same day to day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.237,
    "end": 3354.94,
    "text": "Other times it would be slightly different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.281,
    "end": 3359.546,
    "text": "But then what happens when one wanders off, not on a trail?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.606,
    "end": 3360.527,
    "text": "Is it still a forager?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.684,
    "end": 3366.328,
    "text": " And a lot of that space is really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.468,
    "end": 3382.783,
    "text": "But suffice to say that once a foraging definition has been selected, like not just the class that it's going to be, but also how it's going to be measured in that study, then there can be like quantitative parameter comparisons like this colony foraged at this rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.624,
    "end": 3386.207,
    "text": " in terms of number of outgoing foragers per minute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3386.587,
    "end": 3391.251,
    "text": "And then its neighboring colony of the same species was doing at this rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.452,
    "end": 3395.576,
    "text": "So you can do like parameter comparisons within the species kind of at the population level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.096,
    "end": 3400.5,
    "text": "And then there might be another ant species whose activity it doesn't really make to compare.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3401.181,
    "end": 3404.322,
    "text": " because it's like a different number of nest mates, it has a different foraging ecology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.802,
    "end": 3416.025,
    "text": "So that's kind of where like the structure learning would come into play with comparing the ants that are tending the scale insects versus foraging for seeds versus doing whatever else they do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.545,
    "end": 3425.588,
    "text": "And then within a species, or perhaps across a few species that have a similar foraging ecology, it's possible to do parametric comparisons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.618,
    "end": 3438.999,
    "text": " So I have a question for you, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3439.68,
    "end": 3441.942,
    "text": "How does forging fit architecture?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3444.104,
    "end": 3444.544,
    "text": "What do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.965,
    "end": 3448.488,
    "text": "No, I mean, I'm not trying to be a smart aleck here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.528,
    "end": 3455.634,
    "text": "I'm really curious because most architectural analogies result in some sort of an outcome that's static.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3455.995,
    "end": 3458.357,
    "text": "Like there's a lot of processing that went into the outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3459.226,
    "end": 3460.327,
    "text": " but the outcome is static.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3460.367,
    "end": 3474.537,
    "text": "And I don't think that any of the representations in the frame that you're moving right now, although the differences appear as static, they're supposed to be representing something that's quite dynamic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3476.478,
    "end": 3487.286,
    "text": "So that's where the question of the architecture piece, blended with evolution, might be helpful or it might be oxymoronic, depending upon",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3488.237,
    "end": 3492.239,
    "text": " how you interpret it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3492.439,
    "end": 3497.921,
    "text": "So having architecture implies there's an architect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.581,
    "end": 3499.301,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.321,
    "end": 3505.384,
    "text": "In an evolutionary sense, I'm not sure architecture is the right word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.444,
    "end": 3505.964,
    "text": "It's weird.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.984,
    "end": 3506.844,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3507.804,
    "end": 3509.065,
    "text": "And I'm not saying it's wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3509.405,
    "end": 3511.246,
    "text": "I'm just saying you have to be really, really careful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3511.326,
    "end": 3516.628,
    "text": "And then what assumptions you come in with based on what you think architecture is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3517.694,
    "end": 3520.375,
    "text": " Yeah, maybe you're thinking it the way I am.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3520.416,
    "end": 3521.416,
    "text": "I'm not saying it's wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3521.976,
    "end": 3529.921,
    "text": "I'm just saying, what baggage does that carry when we're talking about something that's actually quite dynamic?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3531.301,
    "end": 3536.985,
    "text": "Those ants, I mean, you can see the ants and the anthill as an architecture, yes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3537.485,
    "end": 3538.926,
    "text": "You can take a snapshot of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3539.606,
    "end": 3543.028,
    "text": "But is that what we're really talking about when we're talking about foraging?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3544.727,
    "end": 3547.308,
    "text": " So what's the difference between a structure and an architecture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3547.929,
    "end": 3548.429,
    "text": "I wonder that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.989,
    "end": 3549.269,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3551.75,
    "end": 3552.591,
    "text": "Is it just words?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.971,
    "end": 3553.871,
    "text": "It's just semantics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.532,
    "end": 3556.072,
    "text": "Yeah, I think it's more than that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3556.613,
    "end": 3563.516,
    "text": "But we just have to be careful that we don't insert one for the other, thinking that they're the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3563.536,
    "end": 3566.037,
    "text": "That's what the whole ontology exercise is about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3566.377,
    "end": 3568.038,
    "text": "I mean, I got my mind changed, OK?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3568.358,
    "end": 3572.5,
    "text": "Normally, I'm the one that argues, don't give somebody an owner's manual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3572.82,
    "end": 3573.781,
    "text": "Get them behind the wheel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3574.775,
    "end": 3575.015,
    "text": " right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3575.035,
    "end": 3577.357,
    "text": "They'll see their owner's manual later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3577.597,
    "end": 3582.782,
    "text": "But in this particular case, I'm kind of going, wait a second, we better all agree what we're talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3583.603,
    "end": 3584.223,
    "text": "So here it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.263,
    "end": 3586.325,
    "text": "What's the difference between structure and architecture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.445,
    "end": 3592.571,
    "text": "Structure tends to be the pieces and the parts of the design and how it goes together and the finished object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.351,
    "end": 3600.958,
    "text": "Architecture defines how the final object looks, behaves, and costs by designating how design choices",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.522,
    "end": 3629.111,
    "text": " are made so architecture implies that there's some kind of agency behind the design and that's kind of that was kind of my interpretation of it also okay okay bunch of stuff there that last point would like the definition of architecture involves the choices rather than structure involving just the uh description of parts so that's kind of like the perception variational free energy that's like structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3631.451,
    "end": 3634.375,
    "text": " It also means the entire thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3634.395,
    "end": 3635.476,
    "text": "So it's not just the parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3635.597,
    "end": 3637.099,
    "text": "It also means the entire object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.439,
    "end": 3637.619,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.06,
    "end": 3640.523,
    "text": "But it still doesn't involve preferences or choices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.923,
    "end": 3643.567,
    "text": "It's about description like perceptual processing is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.587,
    "end": 3646.29,
    "text": "And then the architectural definition has like choices in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3647.216,
    "end": 3648.958,
    "text": " And then that is what you brought to agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.478,
    "end": 3662.351,
    "text": "And also architecture, it's like a profession and an operational approach to modeling the process of building a building, though there's probably theoretical and basic architecture and all this other stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.431,
    "end": 3664.954,
    "text": "Okay, just a few thoughts here on the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3666.135,
    "end": 3667.176,
    "text": " engineering and designing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.077,
    "end": 3680.85,
    "text": "So I guess one ontology that can be helpful here is with Bucky Fuller talking about structural integrity, which is something that has static holding strength, like a metal cube.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.96,
    "end": 3703.415,
    "text": " has static holding strength um then there's process or the pattern integrity which is sort of like describing the life cycle of the butterfly and the caterpillar like a recapitulation of process and that is a lot more like this sort of dynamic systems approach to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3706.352,
    "end": 3713.977,
    "text": " rather than the build it and block it approach because these multi-scale systems always have things that are turning over at different timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.398,
    "end": 3721.702,
    "text": "And then there's just so many mechanisms that that can be modeled by or actually occurs by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3722.262,
    "end": 3734.17,
    "text": "Like just in the harvester ants, it's the historiosity of that colony over the years, then the nestmate and that day and its visual memory and just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.345,
    "end": 3744.152,
    "text": " how many factors come into play, then every foraging trip at the estimate level could be seen as unique and the exact combinations will just never be recapitulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3744.973,
    "end": 3759.103,
    "text": "Some of the major ones can be explored and then controlled for or tested for in a lab, but that's part of the open-endedness of dynamical systems because by changing the setting, you can study certain features,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.977,
    "end": 3769.924,
    "text": " But then it's another step that's impossible in practice to understand how those features that were in a different environment translate to the first environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.805,
    "end": 3786.916,
    "text": "So you can take the essential behavior of the traffic jam and then recapitulate it with the simulation and the lab experiment and all this, but it's a different thing to actually put it into the design time, which is happening at a different timescale than just building the skyscraper and leaving it there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3787.476,
    "end": 3789.638,
    "text": "But that's more like the dynamic organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.242,
    "end": 3796.882,
    "text": " So where's foraging on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3800.944,
    "end": 3816.248,
    "text": "And I would ask, is there a different kind of foraging if we're talking about sort of the machine learning type of foraging on this versus the wet foraging of an ant?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3817.645,
    "end": 3825.935,
    "text": " Like can we actually see those two things being quite different in terms of how those two foraging types plays out?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3825.975,
    "end": 3831.922,
    "text": "Or do we focus on the things that are different about those two things?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3831.982,
    "end": 3836.447,
    "text": "Or do we focus on the things that are the same about those two types of foraging?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3838.795,
    "end": 3848.0,
    "text": " Blue, also with your foraging from a more cultural and human perspective, what would you say about machine learning and foraging?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.543,
    "end": 3865.669,
    "text": "So machine learning and foraging, I mean, so yeah, so I've done some modeling of foraging with like agent-based modeling, but in machine learning, I wonder like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.349,
    "end": 3872.313,
    "text": " I mean, I know that there's information forging, but that's usually explored from the human context, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3872.333,
    "end": 3875.736,
    "text": "Like humans going out and looking for information and how long we stay on a website and whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3876.416,
    "end": 3886.364,
    "text": "So, but, um, I wonder about machine learning and like, you know, neural networks doing object classification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.584,
    "end": 3889.807,
    "text": "Like, is there a forging that they do there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.227,
    "end": 3892.229,
    "text": "Like, you know, they pick up things like, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.704,
    "end": 3902.649,
    "text": " Uh, Chris Ola wrote a really awesome publication about, um, you know, how we understand how neural networks work and they kind of deconstructed deep dream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.169,
    "end": 3905.39,
    "text": "Uh, that's on, on distill pub, which is really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.45,
    "end": 3912.374,
    "text": "It was like a 2018 paper, but you know, they look at how, how does a neural network recognize a dog?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.918,
    "end": 3915.44,
    "text": " you know, and a dog and a tennis ball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3915.46,
    "end": 3920.483,
    "text": "So they look for like round object and like, you know, floppy ear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3920.583,
    "end": 3928.068,
    "text": "Like, so there's like different neurons in the neural network that'll like learn what is a floppy ear or learn what is like a round object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.648,
    "end": 3940.135,
    "text": "And so like, it's this combination of different things that the neural network learns that's pieced together to form like this is a dog with a tennis ball, which is a super interesting way to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.215,
    "end": 3942.537,
    "text": "And I wonder like in training neural network,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3944.555,
    "end": 3948.496,
    "text": " can that be looked at as a type of information forging, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.516,
    "end": 3958.881,
    "text": "Like the network is setting out to learn distinct pieces of a pattern that it'll later like piece together to make its complete image recognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.761,
    "end": 3962.343,
    "text": "So, interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.704,
    "end": 3969.486,
    "text": "I'll give a thought on the machine learning and the bio forging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3970.74,
    "end": 3994.214,
    "text": " so you mentioned like what's well there's the question of should we approach it from a similarities or a different perspective and there's different reasons why you might approach different angles right like what is the most pedagogical to someone learning about the difference versus what is the best way to approach this to a certain stakeholder who is actually applying this question in a certain context but to get to the question outside of that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.703,
    "end": 4003.965,
    "text": " The idea of contrast came to mind because we recently had the model stream on contrastive active inference, which used machine learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4004.605,
    "end": 4013.748,
    "text": "So check out that stream, but it involved a contrasting step of processing inputs before doing policy selection, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.328,
    "end": 4014.868,
    "text": "So that helped.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4016.188,
    "end": 4023.673,
    "text": " scenes that are broadly similar, but have a key difference that's small, like where the ping pong ball is, can be learned better because there's a contrasting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.693,
    "end": 4028.937,
    "text": "And that reminds me of language learning when it's like, here's and here's.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.158,
    "end": 4034.721,
    "text": "And then that's a contrast that isn't going to come up in the language, but then it helps learn on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.621,
    "end": 4044.947,
    "text": "And that's not just a machine learning thing, because even in the parametric modeling of SPM, statistical parametric modeling,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.888,
    "end": 4048.453,
    "text": " mapping, but the model making of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4050.666,
    "end": 4053.487,
    "text": " the contrast matrix is the experimental design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.207,
    "end": 4060.049,
    "text": "And so if it's just condition A and condition B and you have 10 measurements, it's just five of A, you know, five zeros and five ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.789,
    "end": 4066.391,
    "text": "And that's like the true or false matrix that basically gets multiplied to do statistics on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4067.131,
    "end": 4079.415,
    "text": "So whether it's a very classical parametric sparse modeling approach, which was initially all that was had by statisticians or whether it is now things that are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.851,
    "end": 4097.739,
    "text": " highly parametric, or just all this other stuff with modern machine learning, the contrast is like this key piece, because it's always about what signal is being detected within a dataset, and then also how the difference between that sample and the population is being modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4098.598,
    "end": 4102.821,
    "text": " And so like in parametric statistics, that's about the sample standard deviation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.881,
    "end": 4108.124,
    "text": "And then there's a slightly different equation for like the population standard deviation if you would have kept on sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4108.704,
    "end": 4125.375,
    "text": "And then it's also sometimes hard to incorporate that kind of a reasoning into these more modern statistical systems where it's like very easy to overfit because there's a lot of data, but it's hard to model how that large chunk of data is related to even other segments of data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.317,
    "end": 4132.564,
    "text": " So it's similar to the phylogenetic challenge, but that is one that is like searching for contrast takes on a very different meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4136.267,
    "end": 4138.51,
    "text": "But how is it related to foraging?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.495,
    "end": 4145.977,
    "text": "There's the info foraging like Blue mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.108,
    "end": 4162.871,
    "text": " There's the path element of foraging, which might be related to like inferring the best info foraging path for somebody on their feed, because it has to balance the epistemic and the pragmatic, or at least it acts as if it balances the epistemic and the pragmatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.931,
    "end": 4167.952,
    "text": "So foraging could be maybe looked at in that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.972,
    "end": 4173.152,
    "text": "Yeah, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.252,
    "end": 4176.313,
    "text": "I think what this slide represents is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4176.889,
    "end": 4180.232,
    "text": " broadly speaking, not just or broadly identity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4182.494,
    "end": 4186.297,
    "text": "I think what we do is in that diagram, we tend to differentiate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4186.337,
    "end": 4189.34,
    "text": "We see the levels because we've created the partitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4191.562,
    "end": 4199.489,
    "text": "We see the dependencies because over on the far left, we have actual blue arrows that show what those dependencies are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4200.11,
    "end": 4201.251,
    "text": "And then we reintegrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4204.416,
    "end": 4216.626,
    "text": " I remember when I was doing, I always come back to the programming that I was doing, but I used to say to the kids, I mean, there's a migration piece to this that we have to develop, which I would consider to be the tactics, which would include foraging.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4217.446,
    "end": 4227.675,
    "text": "And then there's a tools use or a strategy piece, which is sort of the information covered as change, as measured, which is kind of the instrument piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4228.396,
    "end": 4229.797,
    "text": "And what I kept saying to them was,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4230.583,
    "end": 4233.143,
    "text": " you kind of need to have both all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4233.183,
    "end": 4252.247,
    "text": "You don't need to know the difference between something that's a migration or an inaction or a fulfillment in sort of the physical space and the tools, sort of the thinking instrumental parts where you can turn what you're seeing into these models and these representations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4253.207,
    "end": 4256.228,
    "text": "And you have to kind of be able to marry the two of them all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4256.248,
    "end": 4257.468,
    "text": "You have to be able to integrate them",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4258.422,
    "end": 4262.363,
    "text": " across these boundaries when you're trying to get into these professional settings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4262.804,
    "end": 4265.765,
    "text": "Now, that isn't a construction exercise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4266.645,
    "end": 4272.067,
    "text": "That's being creative because you really don't know at the end of the day how it's going to turn out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4273.067,
    "end": 4279.35,
    "text": "But the big point that we were trying to make was don't leave one of those two things behind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4279.39,
    "end": 4283.111,
    "text": "Don't get stuck because you can't go out and forage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4283.731,
    "end": 4288.073,
    "text": "Don't get stuck because you don't think you can draw the perfect representation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4288.661,
    "end": 4289.281,
    "text": " of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4289.721,
    "end": 4291.022,
    "text": "It's just an instrument, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4291.082,
    "end": 4297.644,
    "text": "It's, I mean, even a spoon can eventually drain an ocean if you're prepared to spend enough time on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4298.304,
    "end": 4316.511,
    "text": "So I think that's what this representation, I think that's one of the greatest gifts of this representation is it kind of lays out very clearly that there's two parts to this, how we differentiate on different, eventually on different duplication, parallelization,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4319.001,
    "end": 4333.456,
    "text": " dependency, predictability, preferential, time-based and spatial-based, and then scale-based, and then reintegrate it all back together into some sort of a coherency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4334.517,
    "end": 4336.379,
    "text": "For some people, though, I think it's kind of dense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4337.16,
    "end": 4338.582,
    "text": "I mean, if you walked in today and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4339.488,
    "end": 4345.309,
    "text": " Gee, I don't know what kind of prerequisites you would need, what kind of priors you would need to understand what the heck we're talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4345.929,
    "end": 4350.71,
    "text": "But as I said, for me, the entry point, the lowest level was, do you migrate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4351.511,
    "end": 4352.551,
    "text": "Do you tool use?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4353.291,
    "end": 4356.912,
    "text": "Most people already admit they can find examples of when they do both.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4357.592,
    "end": 4361.553,
    "text": "So my question then would be, so will you know that you're doing both?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4362.513,
    "end": 4382.699,
    "text": " Going forward and then and if you can do that, maybe it's not quite so quite so dance or quite so mystifying A few things there so great point that going foraging",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4383.735,
    "end": 4393.958,
    "text": " on your merry way without having all hidden states learned at the structural level or the parametric level, even conditioned on a structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4394.418,
    "end": 4395.938,
    "text": "So you don't even know what's out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.618,
    "end": 4398.139,
    "text": "No cognitive agent does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.959,
    "end": 4407.401,
    "text": "And at the structural and the parametric level, the inference challenge is about action selection under uncertainty of multiple types.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.141,
    "end": 4411.222,
    "text": "The inference challenge is of action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.392,
    "end": 4416.434,
    "text": " having sub-problems involving inference on perception and causal modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.474,
    "end": 4428.619,
    "text": "But those are like little sub-problems within a broader frame that active inference provides of like action orientation, action on policy selection, and then foraging is a great setting to study policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4429.399,
    "end": 4437.142,
    "text": "And then you brought up like that there's prerequisites that we hope to learn what different backgrounds can come to active inference from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4437.182,
    "end": 4441.504,
    "text": "But like, I think one takeaway from the paper would be that perhaps",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4443.999,
    "end": 4448.085,
    "text": " our cognitive foraging structure, whatever that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.158,
    "end": 4461.586,
    "text": " But the way that we forage through linguistic and idea space and solution space, strategy space can be modeled by some graph motifs and classes and transformations, which is what the contribution of this paper is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.727,
    "end": 4467.07,
    "text": "And they also describe some of the more basal or homeostatic ancestral structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4467.65,
    "end": 4475.155,
    "text": "So it's like you have a linear model that works for height data and it works for weight data and it works for height and weight together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.335,
    "end": 4478.718,
    "text": "It's just any numbers you pass to the linear model, the GLM, it's going to be,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4479.538,
    "end": 4494.83,
    "text": " Basically, okay, this is like another model class that can take or apply to cognitive modeling, homeostatic modeling, cognitive and homeostatic modeling, all these variations that are being described here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4495.35,
    "end": 4499.974,
    "text": "So that's just one way to put it with perhaps fewer prerequisites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.794,
    "end": 4502.856,
    "text": "And then these were interesting questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4503.916,
    "end": 4505.257,
    "text": "Is this what it was?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.438,
    "end": 4507.299,
    "text": "Do you migrate and do you use tools?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.14,
    "end": 4508.32,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4509.798,
    "end": 4514.064,
    "text": " So if you're doing, and when you're talking about tools, are you talking about provisions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4515.066,
    "end": 4521.455,
    "text": "And especially if you come to breakfast with a plan on how to build a spoon,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4522.813,
    "end": 4533.421,
    "text": " How is that going to help you eat your cereal when your foraging exercise was to be able to move the cereal from the bowl into your mouth?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4533.521,
    "end": 4544.889,
    "text": "So lots of times, especially in some of the more conventional ways we look at things, we tend to take the plan to the cereal bowl instead of the actual spoon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4545.569,
    "end": 4547.851,
    "text": "So the provisioning part is more than a plan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4549.121,
    "end": 4552.323,
    "text": " It's more than the words, and it's more than the representations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4552.703,
    "end": 4559.486,
    "text": "It's the actual implements that we carry with us when we do that migration that I think really counts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4559.646,
    "end": 4569.271,
    "text": "Because if you carry a, I guess you can origami a sheet of paper into a spoon, but then that's another process that you have to go through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4569.732,
    "end": 4574.154,
    "text": "And really what you wanted was just to have the implement, so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4578.553,
    "end": 4583.956,
    "text": " So when you talk about migration, like how far is the migration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.196,
    "end": 4591.841,
    "text": "Like if you're a single celled organism, like, you know, migrating through the ocean, like what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.861,
    "end": 4594.722,
    "text": "Maybe the migration in that case is moving around you, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4595.543,
    "end": 4603.107,
    "text": "Like you don't have to be, you don't have to think migration in terms of me from A to B if I'm stationary and A to B are passing by me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4608.092,
    "end": 4612.859,
    "text": " Like when the car beside me is pulling out of the parking lot, I feel like I'm moving forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4614.341,
    "end": 4614.581,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4614.701,
    "end": 4616.143,
    "text": "That's also a migration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4618.106,
    "end": 4620.489,
    "text": "So that is related to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4622.305,
    "end": 4641.287,
    "text": " we talked about with some of the geometry like the projective geometry and how there's the flipping between the egocentric geometric projection where it's like your peripersonal space and it's kind of like a distribution around you like there's me in the center or located somewhere and then there's like things closer to the eyes are generated to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.657,
    "end": 4658.476,
    "text": " bigger because they don't have to be because we know we're making the generative model anyway so why does it happen why can't i see it from grand theft auto perspective it is a certain way for a certain reason so then that is flipping that's flipping with the um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.651,
    "end": 4688.599,
    "text": " more like objective or depersonalized stance like the prior on the architecture structurally of my room with the right angle and even if it looks different than a 90 degree angle in the generative model that's perceived as normal or unsurprising because it's compatible with the underlying structural hypothesis that's unobserved and then the observed structural observation that has to do with the actual way that the angles look",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.004,
    "end": 4697.529,
    "text": " So here's just one other kind of Professor Gordon shout out slash angle to look into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.27,
    "end": 4701.311,
    "text": "Evolution of algorithms for collective behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4702.172,
    "end": 4709.257,
    "text": "So let's connect this to the cognitive foraging and then Dean's questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.497,
    "end": 4710.158,
    "text": "Do you migrate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4710.198,
    "end": 4711.979,
    "text": "Do you use tools and do you provision?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4712.66,
    "end": 4719.925,
    "text": "So that's like related questions to that one might be like, how do you adapt when things change and you can't,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.263,
    "end": 4744.349,
    "text": " adjust certain things or um also the difference between like let's just say i'm using a software i'm not very familiar with like photoshop between doing one move photoshop searching on a search engine how do i paste okay paste okay i do one move so it's like a one step model of function versus someone who just rolls out of bed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.009,
    "end": 4750.854,
    "text": " opens up Photoshop, and then they just open their mind to being creative and being in feedback with what they actually do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4751.575,
    "end": 4756.94,
    "text": "And maybe that does involve still using a search engine, but they're in a functional flow with respect to that tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.62,
    "end": 4764.006,
    "text": "And they've just set aside the time so that their regime of attention can be like productive or aligned with a project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.507,
    "end": 4767.369,
    "text": "But they're not going step by step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4767.449,
    "end": 4770.352,
    "text": "They're engaged in broader organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.771,
    "end": 4778.773,
    "text": " So we're talking about figuring out part rather than the finding out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4778.833,
    "end": 4780.094,
    "text": "That's what you just described.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4780.654,
    "end": 4782.176,
    "text": "The difference between those two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4783.456,
    "end": 4783.637,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4783.717,
    "end": 4785.878,
    "text": "Opening space for figuring out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4786.519,
    "end": 4787.299,
    "text": "For figuring out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4788.76,
    "end": 4800.488,
    "text": "And that's sort of like, it's a little bit like local and more meso or global foraging, which is like you can dig in a given patch of dirt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4800.829,
    "end": 4802.41,
    "text": "So it's super labor intensive and,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.319,
    "end": 4813.405,
    "text": " but it's a local finding of what is there versus trying to find a better patch of dirt and dig there for a seed, maybe even find an exposed seed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4814.046,
    "end": 4823.032,
    "text": "But whether one of those policies is like, has a higher risk reward or energy expenditure, that's gonna depend a lot on what one believes about the frequency of like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4823.937,
    "end": 4830.278,
    "text": " half emerged seeds and seeds in this location and the time cost of moving from location to location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4830.658,
    "end": 4831.719,
    "text": "There's just a ton of features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4831.819,
    "end": 4835.119,
    "text": "And it's not just like as simple as making a heat map of where the seeds are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4838.88,
    "end": 4844.201,
    "text": "We would describe it as mimic foraging and mimic foraging.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4844.561,
    "end": 4845.862,
    "text": "And what was the other one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4846.162,
    "end": 4847.942,
    "text": "Modify foraging.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4850.223,
    "end": 4852.003,
    "text": "Something like, oh, blue, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4852.725,
    "end": 4860.329,
    "text": " So it's interesting at the conference I was at last week that, you know, they talked about like how far can you get mimicking an expert?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.349,
    "end": 4868.113,
    "text": "And there were several like talks like so, you know, whether it's navigating a maze or, you know, figuring out whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.153,
    "end": 4871.955,
    "text": "So like, you know, they'll train a model on a whole bunch of expert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4872.275,
    "end": 4873.216,
    "text": "What would an expert do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.049,
    "end": 4877.871,
    "text": " And then they set them loose in like a novel circumstance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.911,
    "end": 4880.252,
    "text": "And if the novel circumstance is similar enough, it kind of works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.312,
    "end": 4886.415,
    "text": "But really like the better thing to do is to put some exploratory component in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4886.836,
    "end": 4901.383,
    "text": "So, you know, you have like the expert training, but if there's an explorer component about that doesn't have to do with an expert or like, you know, if we train it to navigate its own maze, also sometimes like alternating with its own maze or, you know, a maze with experts in it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4902.303,
    "end": 4904.784,
    "text": " So like following the experts only gets you so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.924,
    "end": 4930.415,
    "text": "And I wonder, and something that's come to really mean a lot to me in the field of intelligence is like when, it's when there's innovation, like when you can do something new, when you can generalize and solve any maze because you learned from a few experts, like that's innovative or, you know, like the ability to generalize, but also the ability to innovate and produce some new output rather than just do what the experts do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.619,
    "end": 4958.886,
    "text": " so one thought that's awesome comments blue like learning from examples and from experts usually learning by example when used not in a malicious way is referring to seeing somebody who's better or at least adequate if not far far better and then there's this question of like should it be shown only at the expert level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4960.305,
    "end": 4967.608,
    "text": " because the expert speaker would do tongue twisters and Russian sentences with five conjugations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.248,
    "end": 4980.272,
    "text": "But the expert in interaction is able to approach a zone of agreement and of like proximal development so that the example and the expertise as applied",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4981.34,
    "end": 4983.082,
    "text": " is in a very specific space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.863,
    "end": 4990.892,
    "text": "And that's like the order of examples and then knowledge, like this person is able to conjugate this thing, but they're having a challenge in conjugating this case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.493,
    "end": 4997.301,
    "text": "So then depending on their personality, maybe you lean more on the one that they are more familiar with, or maybe they...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4998.402,
    "end": 4999.363,
    "text": " come to you to be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4999.883,
    "end": 5012.774,
    "text": "So there's a lot of advanced cognitive modeling and parameters that could be in a full-fledged model because that's a super complex scenario, especially in a group and all of these relationships on relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5014.416,
    "end": 5017.919,
    "text": "And we don't need to have that whole",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5019.13,
    "end": 5028.076,
    "text": " generative process model to have a generative model of policy that can be effective at forging in that space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5029.577,
    "end": 5034.881,
    "text": "So it is a project and making that map is helpful for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5035.581,
    "end": 5043.747,
    "text": "But to make policy decisions in the cognitive space isn't the same as describing and mastering all the variables of the cognitive process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5045.39,
    "end": 5054.852,
    "text": " And so this mental forging and physical forging, and also what we talked about with a sensory motor detachment helps make that really clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.433,
    "end": 5066.915,
    "text": "So like, how does Active Inference model relevant expertise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5069.475,
    "end": 5072.416,
    "text": "Whether domain expertise or discipline?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.806,
    "end": 5092.601,
    "text": " like a set of affordances A versus a whole different set of affordances B or expertise like in that language learning example or some other example where it's not simply about like providing some advanced example and then having people asymptote to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5093.441,
    "end": 5099.146,
    "text": "It's about opening the space for figuring out in that setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.216,
    "end": 5110.62,
    "text": " I think you can find a structural adaptation in mimicking an expert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5111.921,
    "end": 5115.845,
    "text": "And that typically sort of plays itself out as instructionalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5116.586,
    "end": 5122.613,
    "text": "I think you can find yourself also modifying your niche and adapting in that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5123.871,
    "end": 5128.395,
    "text": " and then being able to go back and have an expert look at what you've done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5128.415,
    "end": 5147.91,
    "text": "And the reason why they're an expert in that particular case isn't because you're going to mimic them, but because you're going to ask them what they, how the process that they use to arrive at where they have a certain subject confidence, they are able to now diagnose",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5148.837,
    "end": 5163.88,
    "text": " where your confidences might exist and where you might want to re-examine what the probabilities and preferences were that got you to the conclusions that you drew.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5165.22,
    "end": 5169.421,
    "text": "So again, you're going to adapt either way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5170.421,
    "end": 5174.041,
    "text": "But I think that the path that you choose matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5174.261,
    "end": 5176.962,
    "text": "And knowing which path that you chose also matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5177.583,
    "end": 5178.684,
    "text": " So I adapted, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5178.744,
    "end": 5188.934,
    "text": "I adapted because I'm now trained up to be able to find the blue dot, the blue ball in the sea of plastic balls, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5190.195,
    "end": 5195.741,
    "text": "That's one form of adapting because I've never been in a ball pit before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5196.121,
    "end": 5197.883,
    "text": "And now I found the one that I was looking for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5198.68,
    "end": 5209.264,
    "text": " But another person could go in there and be able to maybe do something else with that blue ball because they modified the frame and the mesh.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5210.345,
    "end": 5221.89,
    "text": "And that, again, we just want to make sure that we know that there's a difference so that when we are reintegrating them at some point in the future, we know how we got there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5222.57,
    "end": 5222.89,
    "text": "That's all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5228.524,
    "end": 5228.744,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5233.405,
    "end": 5238.127,
    "text": "I like the throwback to instructionalism and interactionism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5239.007,
    "end": 5245.428,
    "text": "It's an example that was like latently there when talking about that niche dependence and the co-creation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.609,
    "end": 5254.111,
    "text": "So all these kinds of terms, digital stigmergy when working online, for example, become implicit when we're using a given",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.385,
    "end": 5258.987,
    "text": " sequence to be talking about like a certain thing that we want to call our attention to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.468,
    "end": 5271.656,
    "text": "We call our attention to some example or to some relationship and then that modifies our cognitive model so that we're thinking about things and doing things differently after.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5272.376,
    "end": 5285.025,
    "text": "And so it's kind of like quality of engagement rather than quantity because some people by reading a little change a lot and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5286.451,
    "end": 5288.232,
    "text": " Ty set up the relationship, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5289.333,
    "end": 5291.734,
    "text": "It's funny that you bring up reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5291.894,
    "end": 5298.038,
    "text": "So for a very long time, my PhD advisor never read anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5298.478,
    "end": 5299.579,
    "text": "She would never read anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5299.599,
    "end": 5299.979,
    "text": "Did you read it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.039,
    "end": 5300.88,
    "text": "Oh, yeah, I read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5301.816,
    "end": 5303.898,
    "text": " She does, like, speed reads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5304.138,
    "end": 5305.419,
    "text": "She speed reads, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.439,
    "end": 5308.742,
    "text": "Which means, like, she looked at every third word, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5309.322,
    "end": 5314.526,
    "text": "And then, like, when she really sits down to read it, she's got all these things to say about it and wants to, like, you know, wordsmith every sentence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5314.606,
    "end": 5315.747,
    "text": "And it's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5315.767,
    "end": 5317.609,
    "text": "Like, we've had a lot of fun working together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5317.649,
    "end": 5320.091,
    "text": "I don't mean to, like, make that sound evil in any way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5320.151,
    "end": 5323.253,
    "text": "But, I mean, I don't speed read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5323.353,
    "end": 5327.897,
    "text": "I read fast, but I'm totally incapable of speed reading because I feel like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5328.809,
    "end": 5330.349,
    "text": " I have to duplicate my efforts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5330.409,
    "end": 5337.551,
    "text": "Like if I skim it, like I can, you know, pick up some key, you know, headings or whatever, but, but I never really got to read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5337.631,
    "end": 5339.231,
    "text": "Like, like I want to read something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5339.271,
    "end": 5342.912,
    "text": "I want to really read it, like go through it line by line by line and look up things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.972,
    "end": 5344.932,
    "text": "I don't know what they mean and this kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5344.992,
    "end": 5350.854,
    "text": "So, so it's, it's a different, um, an interesting approach, how different people approach things in different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5350.874,
    "end": 5352.054,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5353.274,
    "end": 5353.514,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5353.974,
    "end": 5357.595,
    "text": "You know, talking about in this paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5359.338,
    "end": 5386.452,
    "text": " we've been going between the sort of physiological and biological substrate of cognition and the nervous system and the brain all of that and then this more cognitive modeling approach which can be sort of cut and dry or overly computational or so-called unrealistic with respect to biological foundations it's kind of like what dean pointed to with like the bifurcation and so now things are kind of coming together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5388.516,
    "end": 5392.698,
    "text": " not in the way that everyone might've expected, but at least in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5393.439,
    "end": 5396.621,
    "text": "And so that's a very interesting space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.641,
    "end": 5405.166,
    "text": "And then like blue with a fast and slow reading, it's almost like there are multi-scale dynamics associated with attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5406.803,
    "end": 5412.889,
    "text": " That can be measured with the EEG, but it's a hidden state, what is actually happening in the mind and brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5413.249,
    "end": 5415.011,
    "text": "But those are the kinds of experiments that people use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5415.451,
    "end": 5424.699,
    "text": "And there's some rhythms like the fast cycles, like gamma that are playing out at like kind of like the speed of perception and awareness of like words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5425.42,
    "end": 5431.746,
    "text": "And then there's also slower, like symbolic or semantic changes and all these different timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5431.886,
    "end": 5432.727,
    "text": "And it's just like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.713,
    "end": 5458.614,
    "text": " making the space to let the connections and the terms and the implications resonate and connect with the learner and the creator is like a lot more valuable than any amount of coefficient of low reading and so how to balance the information amount",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5460.345,
    "end": 5470.588,
    "text": " and type and sequence and all of these things with holding the space for just the slower transformative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5472.348,
    "end": 5474.249,
    "text": "And that's very related to, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5474.789,
    "end": 5482.811,
    "text": "That's huge, Daniel, because I think a lot of people that they get into the instructionalism, you'll hear the expression, and I'm not overgeneralizing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5483.291,
    "end": 5485.392,
    "text": "You'll hear, well, we're going to break this down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5486.832,
    "end": 5492.221,
    "text": " as opposed to the interactionism, which is we're going to slow this down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5494.202,
    "end": 5496.523,
    "text": " There's quite a difference between those two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5497.263,
    "end": 5504.165,
    "text": "Open up and slow down, or we're going to drill down, finish it out, get it done in the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5504.666,
    "end": 5509.807,
    "text": "And as we discuss, this is the archetypes or the dialectic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5509.847,
    "end": 5520.111,
    "text": "It's not like we're only taking one approach or another, but it's very easy to see how the range in at least education space, not even thinking of other areas, is like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5520.951,
    "end": 5525.274,
    "text": " it's the amount of content and then it projects down into how it's delivered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.115,
    "end": 5532.779,
    "text": "And then content gets slotted in or out or things get expanded or not, or the, you know, Monday's class gets canceled and it moves to Tuesday.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5533.54,
    "end": 5549.271,
    "text": "So that's like the sort of instruction projection approach, which is so different in multiple ways, especially in how it's applied to thinking more about the opening up a space and slowing down and the learner's journey and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.607,
    "end": 5564.055,
    "text": " And when you're in the huddle and you're calling out the shorthand before you actually line up at the scrimmage line and snap the football, it's interesting what you point out, Luke.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5564.075,
    "end": 5570.019,
    "text": "I, in my history, I was always prepared to slow down when it was math and the symbology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5570.68,
    "end": 5576.884,
    "text": "Like I have no problem slowing down for that, but trying to read out long sentences, it just about kills me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5576.944,
    "end": 5577.144,
    "text": "I mean,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5577.799,
    "end": 5586.062,
    "text": " My ADD, I have to interleave like every 20 to 30 minutes because if I don't, my skin starts to crawl.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5586.082,
    "end": 5593.745,
    "text": "So I mean, those sort of contextual factors that are literally weighing on you, you don't know those sorts of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5593.785,
    "end": 5599.747,
    "text": "And if you're an expert who's just trying to push out all this information in a 13-week window,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5600.54,
    "end": 5605.403,
    "text": " I'm not really sure whether or not you can sort of get down to that level of personalization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5605.463,
    "end": 5614.347,
    "text": "But if you're able to, it makes all the difference in the world in terms of what people take away from the exposure, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5615.208,
    "end": 5617.489,
    "text": "I find it way easier to do the shorthand thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5618.509,
    "end": 5624.152,
    "text": "You know, if a picture's worth a thousand words, I'm in full agreement with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5624.172,
    "end": 5626.414,
    "text": "You just can't do the thousand word thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5627.334,
    "end": 5629.015,
    "text": "So, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5631.206,
    "end": 5632.707,
    "text": " Yeah, really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5633.007,
    "end": 5645.695,
    "text": "And Steven wrote in the chat, good to see these questions about active modeling expertise being thought of in different ways, like the direction of travel, the distance to travel, the rate of travel, mode of transport.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5648.617,
    "end": 5650.378,
    "text": "Yeah, thanks for sharing it, Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.579,
    "end": 5656.002,
    "text": "Landscapes and sort of the sense making and the way finding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5657.375,
    "end": 5663.818,
    "text": " and being on this cognitive landscape versus or and being on this spatial foraging landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5663.898,
    "end": 5684.346,
    "text": "So going out for the mushroom forage with someone who's familiar with mushrooms and somebody else who's familiar with the biochemistry but hasn't seen the mushroom in the ground, and then someone else who's on a different perspective because of their background or people with different physical abilities and knowledge in the spatial setting, and then there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5685.307,
    "end": 5691.052,
    "text": " the cognitive foraging, and then just like, is it that the colony forges as a unit?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5692.213,
    "end": 5695.455,
    "text": "And then that's the sort of flip side of the nest mates forage collectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5696.336,
    "end": 5714.211,
    "text": "And so the team forges as a unit collectively, and the individual is sort of engaged at this level that we have experience at in the policy selection relevant to our participation in some either niche or team or project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5718.342,
    "end": 5724.508,
    "text": " Let's go back to the paper, see if there's any other pieces that we could kind of look at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5725.95,
    "end": 5726.73,
    "text": "Let's look at the roadmap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5733.817,
    "end": 5735.799,
    "text": "Can we talk a bit about the endowment part of this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5738.908,
    "end": 5740.329,
    "text": " Because we haven't really touched on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5740.809,
    "end": 5741.87,
    "text": "Well, just the endowment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5742.01,
    "end": 5742.951,
    "text": "What's the endowment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5742.991,
    "end": 5753.038,
    "text": "So in the point twos, essentially, now that we've built this base, this stable platform, what can we do with it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5753.298,
    "end": 5757.281,
    "text": "What leverage have we now potentially achieved?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5757.541,
    "end": 5759.342,
    "text": "So what's the endowment here in terms of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5760.0,
    "end": 5771.714,
    "text": " what the paper really, what's the new affordances that we didn't have before, that we didn't maybe necessarily have explicated quite so clearly prior to reading the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5772.695,
    "end": 5777.221,
    "text": "Maybe that's one, I don't want to put pressure on Blue, but what do you think, Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5778.576,
    "end": 5800.377,
    "text": " so i'm trying to remember maybe you guys can remind me in this figure oh wait wait wait so endowing with temporal depth um it's got to be an allostat right is that correct yeah yeah yeah um because in having a homeostat with temporal depth like isn't possible right or or like isn't like they just can they can only do um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5803.059,
    "end": 5810.804,
    "text": " And I wonder if that's like, you know, a single celled organism can only like do at that moment, like they're not planning for it to get cold later or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5811.464,
    "end": 5821.791,
    "text": "Um, and really the, so I wonder if it's not only temporal depths, but any kind of relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5822.211,
    "end": 5827.274,
    "text": "Like, I wonder if it's not necessarily temporal depth, if time is flat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5829.092,
    "end": 5833.174,
    "text": " I mean, I guess in order to modify your own behavior or thought, you would have to have some temporal depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5834.074,
    "end": 5850.181,
    "text": "But this allostatic idea is interesting with respect to my relationship to my future self or my relationship to my previous self or my relationship to other people in my community or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5852.082,
    "end": 5855.323,
    "text": "So I just wonder about...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.541,
    "end": 5860.482,
    "text": " If that's why this is the allostat and not the homeostat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5860.962,
    "end": 5869.704,
    "text": "Or can you endow a homeostat with temporal depth and get that same kind of ability for perspective and retrospective inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5869.724,
    "end": 5870.064,
    "text": "You can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5870.164,
    "end": 5870.684,
    "text": "But why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5871.285,
    "end": 5872.845,
    "text": "Maybe let's put some words to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5872.885,
    "end": 5875.166,
    "text": "Let me see if I can find some in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5875.886,
    "end": 5876.726,
    "text": "Nice point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5878.24,
    "end": 5884.562,
    "text": " I would say homeostatic function could be in a model with memory or anticipation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5884.842,
    "end": 5896.186,
    "text": "Like the thermometer could record the last 100 time points, or it could have a prediction for the next 100, but the function would be that it only turns on the heating once it gets too cold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5896.726,
    "end": 5906.59,
    "text": "So it still is the, on the action selection side, it still is making a one Markov chain decision based upon an instantaneous",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.986,
    "end": 5909.386,
    "text": " measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5910.326,
    "end": 5919.931,
    "text": "And so it can be implemented whether just for a computational parsimony or in a simple biological system with just one time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5920.612,
    "end": 5922.513,
    "text": "If it's this hot, then turn on the cooling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5923.593,
    "end": 5926.695,
    "text": "And so it's the ultimate if then, because it's like a threshold model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5927.543,
    "end": 5940.327,
    "text": " And so it gets pared down over evolutionary time, but then you're bringing up like to even engage with a counterfactual or some influence or something on future policy, there has to be like a depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5942.748,
    "end": 5945.409,
    "text": "And then this gets back to whether it's modeling the thing itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5947.594,
    "end": 5976.856,
    "text": " what do these represent are they the scientists testing a model of one two three or four five hour temporal depth for the ant forager or is this the foragers quote cognitive model as if that were somehow not model-based science or is it the neural architecture or the functional anatomy of the forager there's a lot of ways it could lean or be framed um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5979.062,
    "end": 5989.145,
    "text": " I think in a complimentary way, but one will have to be really careful where support for one domain super valid and where is one not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5990.706,
    "end": 5999.988,
    "text": "Like if it were a circuit board with that topology, then it seems like pretty good to go to use that as a pretty broad descriptor of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6000.608,
    "end": 6008.851,
    "text": "Whereas if this was a simplification of memory and there was an uncertainty parameter labeled uncertainty or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6009.284,
    "end": 6022.071,
    "text": " anxiety, like we discussed a little earlier, someone slaps a parameter on one of these edges and starts addressing complex real-world settings, how does that exactly work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.334,
    "end": 6033.798,
    "text": "So one of the things that I think that it endows us with is that the homeostat is the sort of the basic pattern of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6037.947,
    "end": 6041.029,
    "text": " there's a partition between the epsilon and the mu.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6041.729,
    "end": 6045.852,
    "text": "So the first thing that they did is they created a sort of horizontal partition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6046.533,
    "end": 6051.976,
    "text": "And then when they went to the parallelism, now there's two epsilons and two mus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6052.536,
    "end": 6056.299,
    "text": "And so now they added the vertical partition as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6056.939,
    "end": 6062.343,
    "text": "And I think that's really, really helpful in terms of at the basic level of the statistical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6062.683,
    "end": 6065.125,
    "text": "We talked last time that you have to kind of be a polymath.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6065.916,
    "end": 6075.443,
    "text": " But I think from a modeling perspective, it's getting that orthogonal mesh established that moves us up the chain of complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6076.424,
    "end": 6080.107,
    "text": "Because then all of a sudden, you can have diagonal dependencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6081.548,
    "end": 6091.416,
    "text": "And then you can actually add the Z plane going through this in terms of how the scale is built out on both distance and time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6092.056,
    "end": 6094.178,
    "text": "So I think that's one of the endowments that it provides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6097.287,
    "end": 6098.69,
    "text": " I could just restate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6098.891,
    "end": 6106.386,
    "text": "It's like when we say that one of the advantages potentially in application of active inference could be that models are composable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6107.296,
    "end": 6117.262,
    "text": " So they can be composed within a given scale, like spatially or temporally, and that has a visual representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6118.042,
    "end": 6133.651,
    "text": "It can also be composed in this nested way, which, as we've explored several times, can represent physical enclosure or temporal enclosure, as well as this cognitive architecture, like mental action, depending on how different variables are interpreted in nested modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6134.611,
    "end": 6156.48,
    "text": " And so it's composable in several dimensions of transformation, which they represented in figure four, in a way where each transformative step, even though the function might change a lot from the beginning to the end, each organizational or structural, architectural, cognitive step or morphological, if one is looking at that layer,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6158.447,
    "end": 6164.948,
    "text": " can be mapped into a certain space and direction of movement within that space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6166.669,
    "end": 6168.349,
    "text": "Do you think it can also be sculpted out?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6168.389,
    "end": 6173.11,
    "text": "I mean, because we're looking at this historically, we're looking at all the things that happened in the history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6173.63,
    "end": 6182.312,
    "text": "Was this the stuff that was kind of carved out and a lot of the stuff that doesn't matter removed in order for it to be more comprehensible?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6183.387,
    "end": 6192.951,
    "text": " because I agree with you, it can be composed, but I also think it's not decomposed, but I do think, or even deconstructed, I think it can be sculpted out of a greater history, a greater whole.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6196.312,
    "end": 6198.053,
    "text": "This, oh, yes, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6198.853,
    "end": 6209.477,
    "text": "So, sorry, like what, you know, when you talk about a greater history, and we talked about historicity in today, like during, in the last two hours,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6211.144,
    "end": 6214.907,
    "text": " And we've also talked about memory, and there's a difference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.927,
    "end": 6228.177,
    "text": "So historicity is like historically accurate, and memory is like what I remember, or like what any individual remembers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6228.917,
    "end": 6230.479,
    "text": "Yeah, we've talked about that before, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6230.499,
    "end": 6232.02,
    "text": "A few live streams ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6232.961,
    "end": 6238.725,
    "text": "All I'm thinking is that what this does is compare all the things that... Is it Axel Constant that said...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6240.858,
    "end": 6247.441,
    "text": " How did he frame it so that we can understand why we're here now versus all the things that didn't make it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6248.081,
    "end": 6252.483,
    "text": "That's essentially what I'm talking about in terms of explaining, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6252.523,
    "end": 6264.968,
    "text": "They're explaining why something got to the place that it did as opposed to the necessity of all the things you had to do, all the things you had to compose in order to realize the outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6265.109,
    "end": 6268.41,
    "text": "I'm trying to bring that back to a sculpting metaphor now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6269.648,
    "end": 6294.155,
    "text": " awesome so that's um the axel constant 2021 paper the title was the free energy principle it's not about what it takes it's about what took you there and so that's definitely an evolutionary perspective and it's partially because of axel's background in evolution and ecology because that's what we can say about evolution this is what got birds here right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6294.952,
    "end": 6307.105,
    "text": " And so the counterfactuals in evolution are a really interesting topic, and that's sort of explored in a variety of more popular as well as more mathematical treatments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6307.205,
    "end": 6316.294,
    "text": "Like, how do we go from the observed, which must have existed, so it's very easy to fall to them being the best of all possible worlds, optimal form, etc.,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.401,
    "end": 6320.622,
    "text": " But then we also recognize the changing environments and interactions and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6320.702,
    "end": 6327.705,
    "text": "And then blue, like with the historicity, facts and the impacts, which are like facts that aren't known.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6329.186,
    "end": 6331.947,
    "text": "And then there's the memory, which requires a perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6333.8,
    "end": 6340.802,
    "text": " People could use system memory or something to refer to a factor and impact on a system, but these are just being used loosely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6341.103,
    "end": 6348.585,
    "text": "Like some parts of how the past influences the present and the future have to do with systems that take a perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6349.665,
    "end": 6355.407,
    "text": "Other impacts are not through those adaptive active inference agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6356.308,
    "end": 6357.468,
    "text": "And so that's very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6357.828,
    "end": 6362.15,
    "text": "And so historicity is kind of like the stigmergy pheromone layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6363.303,
    "end": 6365.764,
    "text": " And then there's like memory with the forager.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6366.164,
    "end": 6375.728,
    "text": "So you could talk about the memory of the ground for the pheromone, but it makes sense to just remember that it's a different thing with the pheromone on the ground than the cognitive in for ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6376.748,
    "end": 6386.612,
    "text": "And no Nesme is going to have all the knowledge or the onboard modeling to make decisions, say for the ones that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6389.409,
    "end": 6414.755,
    "text": " not to complicate it too much but it's stuck in the dialectic between doing exactly what worked in the past which is to say recently succeeded but might not work in the future and changing things but once you move into changing things the space of the adjacency of changing is sometimes like daunting and you still haven't really addressed the problem of changing world so origins very deep entry point like into a lot of these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6415.862,
    "end": 6444.919,
    "text": " questions in active inference and in other areas because it really connects to the egocentric hopefully not in the um solipsistic or narcissistic sense but just in the way finding sense making paradigm that actually accommodates for others through modeling them explicitly and prioritizing the environment and things like that so pretty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6446.007,
    "end": 6446.327,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6446.947,
    "end": 6467.232,
    "text": "And this paper, just to kind of restate what they brought to the picture, they looked at evolutionary timescales and they framed cognition as structural change, which in a Bayesian modeling framework is sometimes called structural learning, as opposed to like parameter learning, fine tuning, given the model structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6468.692,
    "end": 6475.194,
    "text": "And they connected that to the Bayesian graph model of the active inference partitioning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6476.4,
    "end": 6505.495,
    "text": " then connected that to the factor graphs and then using the homeostat example talked about how there could be like elaborations into other structures so from structures to each other that might be enabling the rise of phenotypes or enabling the modeling of phenotypes that are interesting okay any final thoughts or like where does this pape take us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6506.906,
    "end": 6507.927,
    "text": " What is different now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6507.947,
    "end": 6510.128,
    "text": "What are we going to be talking about soon?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6513.17,
    "end": 6524.458,
    "text": "So I'm excited to really delve into the math that is going to get behind the models that were elucidated out in figure four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6524.478,
    "end": 6535.265,
    "text": "How do we go through time and through relationality and hierarchical dimensions and so forth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6539.315,
    "end": 6539.595,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6539.815,
    "end": 6540.356,
    "text": "Thank you, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6540.916,
    "end": 6542.918,
    "text": "Dean, you won't have the last word, but what do you think?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6546.281,
    "end": 6550.964,
    "text": "Well, I'm still trying to figure out how this sort of ties in with the whole identity piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6551.965,
    "end": 6556.569,
    "text": "I left that because I thought that was just a rabbit hole that went way too far and too deep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6556.609,
    "end": 6561.433,
    "text": "But I know that when you do get that parallelism and when you can sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6563.385,
    "end": 6591.256,
    "text": " create a dimensional grid that has negative space as well so like you can be as units going positively or negatively and passing through zero and how that fits with identity that's that's sort of a neck that's a kind of a personal thing that i got to do and then the other thing that i really but the thing that i really liked about this paper is that i think it took something that's really as you said over over huge time scales and sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6592.615,
    "end": 6615.204,
    "text": " took it back down to something that might be digestible for a lot of people that otherwise they kind of go, okay, so here's 100,000 years ago or a million years ago or whatever, from the bacteria to now, what are the sort of basic building blocks that we say might have played a part in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6615.902,
    "end": 6619.565,
    "text": " getting to the kind of sophistication where we are now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6619.765,
    "end": 6621.967,
    "text": "And again, I think it's about learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6622.487,
    "end": 6624.469,
    "text": "I always think that evolution is about learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6626.07,
    "end": 6642.983,
    "text": "And so, as I said in the point one, this affirmed a lot of the stuff that I think we need to be bringing into some of the more formal ways that we structure learning, because I think it's learning sort of unleashed as opposed to all tied up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6646.101,
    "end": 6646.441,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6647.442,
    "end": 6652.886,
    "text": "Thanks both and everybody who was helping in all the ways for the previous videos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6653.106,
    "end": 6656.068,
    "text": "Just some last thoughts would be from both of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6658.089,
    "end": 6672.759,
    "text": "And hopefully all together, there's really some interesting insights into learning and education for active inference learning, which is kind of like our meta regime of attention in Active Inference Lab when we're in that regime of attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6674.221,
    "end": 6697.551,
    "text": " many people have other regimes of attention where it would certainly apply to bring some of these methods and ideas in and also bring pieces from outside into our cognitive modeling of attention and collaboration and communication like those topics and how those are the pillars of education and research",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6698.937,
    "end": 6707.3,
    "text": " during a time when education and research and participation are evolving is some of the most interesting things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6707.44,
    "end": 6725.968,
    "text": "And so to be able to read evolutionary papers that take a cool scope and approach and then connect it to how we're hopefully organizing together and including the affordance to participate with anyone who's listening now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6728.28,
    "end": 6733.964,
    "text": " It's an interesting mixture, so I hope that we all can just keep on learning and applying together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6733.984,
    "end": 6736.906,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6737.566,
    "end": 6737.786,
    "text": "Peace.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6739.087,
    "end": 6739.587,
    "text": "Thanks, guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6739.988,
    "end": 6740.428,
    "text": "Thanks again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6740.448,
    "end": 6740.628,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]