[
  {
    "start": 9.892,
    "end": 10.753,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 11.133,
    "end": 12.774,
    "text": "Welcome to Act-Inf Lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 13.175,
    "end": 17.078,
    "text": "This is Act-Inf Lab model stream number 3.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 17.778,
    "end": 20.781,
    "text": "It's May 27th, 2021.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 21.501,
    "end": 24.664,
    "text": "And we're here with Tim Verbellen and Ozan Katal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.204,
    "end": 33.191,
    "text": "Today, we're going to have a model stream on some of their recent work on learning generative state space models for active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 33.571,
    "end": 38.135,
    "text": "We're going to have a presentation followed by some time for question and answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.795,
    "end": 58.039,
    "text": " so please feel free to write any questions in the chat and we will get to them in the conversation so thanks again to tim and ozon for joining us today we're really looking forward to what you have to share so please take it away and thanks again so thank you daniel for having us um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.906,
    "end": 68.813,
    "text": " So I'm Tim Verbeelen and together with Rozan Katel we will talk a bit on our paper on learning alternative state space models for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.493,
    "end": 74.797,
    "text": "So we are both researchers at IMech Kent University in Belgium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.038,
    "end": 85.345,
    "text": "If you want to know more about what we do you can read about it on our blog or follow us on twitter under the smart robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.565,
    "end": 86.705,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.061,
    "end": 116.758,
    "text": " before we dive in maybe a short introduction on what we do what our goal is so basically we want to build intelligent robots so in our lab here in Ghent we have a pretty big pretty pretty large space where we have some room for robot manipulators on the one hand but also driving and flying robots on the other hand and we typically attach all kinds of sensors on these things and then we want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.776,
    "end": 123.519,
    "text": " process the sensor information and infer some useful actions for these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.759,
    "end": 134.084,
    "text": "And of course, active inference is a cool methodology to try out and to further investigate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.145,
    "end": 140.227,
    "text": "And it's in this context that basically this work is being done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.27,
    "end": 145.318,
    "text": " So why would you bother learning the state space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.338,
    "end": 151.533,
    "text": "So if you look at active inference papers from the recent years,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.575,
    "end": 173.437,
    "text": " then typically you will find a figure like the ones that are on the slide so you have this figure of what is the kind of environments that you're modeling that you're investigating and then a whole description on how the model should look like so you define the state space and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.708,
    "end": 186.338,
    "text": " Possibly, in the case of discrete state spaces, you define the so-called A, B, C, and D matrix that defines the likelihood model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.378,
    "end": 190.962,
    "text": "So what is the likelihood to see a certain observation when you're in a certain state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.463,
    "end": 193.024,
    "text": "Or what are the transition models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.324,
    "end": 196.847,
    "text": "How do you transition from one state to another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.668,
    "end": 198.369,
    "text": "And so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.802,
    "end": 208.814,
    "text": " um and recently while we were doing this research research we saw some other people also thinking about yeah um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.453,
    "end": 219.28,
    "text": " can we do more learning using these kind of novel deep learning techniques in these active inference methods?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.58,
    "end": 233.791,
    "text": "So you had, for example, Kai Ulshofer, who proposed to basically learn kind of a state space for the mountain car, but then still he needed to explicitly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.935,
    "end": 238.656,
    "text": " in the state factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.377,
    "end": 252.662,
    "text": "There was also some work from Baron Millich, who basically did some learning, but more on learning the policy rather than the state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.742,
    "end": 265.968,
    "text": "So he basically used Markov decision process with small state spaces where you could basically just deal with the raw state space, the raw observations that the environment gave you where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.488,
    "end": 290.679,
    "text": " where we're basically suited as a state space and you could then you would then investigate how to learn the actions given given these states but so our work is basically on what if you don't know the state space what if your observations are high dimensional and you cannot really use these directly as your state space how do you define the model how you can come up with it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.508,
    "end": 296.152,
    "text": " And maybe as a concrete example, suppose we have one of our driving robots in the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.172,
    "end": 299.394,
    "text": "So this is the first person view of the robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.835,
    "end": 301.636,
    "text": "This is the kind of observation that you get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.656,
    "end": 303.298,
    "text": "It's just a square of pixels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.858,
    "end": 306.861,
    "text": "And then, yeah, what is your state space in this case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.521,
    "end": 310.684,
    "text": "It might be an XY position on the map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.784,
    "end": 314.527,
    "text": "That might be something relevant for a robot as a state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.418,
    "end": 318.981,
    "text": " It might also be, watch out, you're approaching a cable gutter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.061,
    "end": 320.482,
    "text": "So there might be a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.602,
    "end": 322.263,
    "text": "That might also be something useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.504,
    "end": 328.628,
    "text": "Maybe the items that are stored in the racks are relevant for whatever task you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.648,
    "end": 330.749,
    "text": "So that might also be part of the state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.53,
    "end": 335.193,
    "text": "Maybe there are human workers that walk around that you also need to model these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 335.233,
    "end": 341.477,
    "text": "So depending on your robot and the use case you have, it does get hands and what can happen in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 343.119,
    "end": 358.961,
    "text": " It becomes non-trivial to define a concise set of states that you want to track, let alone that you need some model that models this, like how do you get from pixels to your x, y position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.642,
    "end": 375.173,
    "text": " There are certain methods in robotics that do part of these things, but none of them really just figure out what is the complete state space that you need for whatever you want to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.033,
    "end": 379.956,
    "text": "And especially not in kind of an active inference system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.256,
    "end": 389.261,
    "text": " So before we go into our methods, I'll briefly talk about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.442,
    "end": 411.836,
    "text": "Probably most of you are already familiar with the topic, but I'll just rehearse some of that stuff, even if it's just to get accustomed to our way of notation, let's say, because everybody has his own notation, and at least it will put us all on the same page for the next part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.757,
    "end": 425.01,
    "text": " So, it all starts with having an agent that needs to interact with the environment, and the agent is assumed to be kind of separated from the environment from the so-called Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.655,
    "end": 429.198,
    "text": " So on the one hand, the agents can perform actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.179,
    "end": 445.791,
    "text": "These actions, these will impact the environment, which is kind of a generative process that has some hidden states that provide you, given your action, it provides you with some sensory observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.851,
    "end": 450.015,
    "text": "So in this case, an action could be for the robot to drive around,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.675,
    "end": 457.078,
    "text": " and put some currents on the motors and observation could be some pixels from the camera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.739,
    "end": 475.228,
    "text": "And then the goal of the agent is to build a generative model where he has his own, he builds his own state space basically, he derives how actions have effect on the states and how these states then would generate these observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.108,
    "end": 486.557,
    "text": " So the question is, how can we build a generative model that actually comes up automatically with kind of a proper state space to learn this model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.749,
    "end": 495.634,
    "text": " So basically, the generative model then looks like a POMDP, a partially observable Markov decision process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.694,
    "end": 508.383,
    "text": "So it just means that we assume that a state at a given time step, it only depends on the previous states and the action that you were doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.904,
    "end": 514.528,
    "text": "And each state gives rise to a certain observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.929,
    "end": 521.916,
    "text": " And so then we end up with the so-called free energy principle that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.791,
    "end": 528.696,
    "text": " basically what we want to do is we want to build a model that maximizes log evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.776,
    "end": 535.421,
    "text": "So here you see the formula for the free energy and you can unpack it in several ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.941,
    "end": 545.569,
    "text": "So the first way is basically by stating that minimizing free energy is actually maximizing the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.88,
    "end": 561.114,
    "text": " evidence lower bound let's say and if you're at this free energy minimum then basically you have your approximate posterior that this is actually equals to your or very close to your your crew posterior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.051,
    "end": 571.02,
    "text": " But then the third line is basically what we typically use for optimizing our model, which is basically, on the one hand, a complexity term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.4,
    "end": 582.931,
    "text": "You want to have your states explain the way as simple as possible, whereas you want to have the highest accuracy to predict whatever",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.732,
    "end": 595.774,
    "text": " So in this case, our variational approximate posterior is something that maps observations and actions into inferring your current state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.188,
    "end": 599.229,
    "text": " But what about the future?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.369,
    "end": 606.695,
    "text": "So in the past, you basically knew which actions you were doing and you saw the observations that came in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.775,
    "end": 613.36,
    "text": "So you could kind of infer which states would have given rise to the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.42,
    "end": 615.902,
    "text": "So that's basically the reality of the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.382,
    "end": 621.766,
    "text": "But then in the future, things change a bit because now you don't know what you will observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.306,
    "end": 624.908,
    "text": "And also you have to select the actions you will do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.889,
    "end": 651.479,
    "text": " so the actions we will basically denote them as being generated by so-called policy but in in this case the policy is basically just yeah what is a certain sequence of actions basically and you now have to create some expectations not only on future states but also on future observations so what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.259,
    "end": 670.314,
    "text": " which states do i think i will visit by doing some actions but also what kind of observations do i think that i will see if i visit these states so then the free energy becomes the so-called expected free energy and again you can unpack this thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.318,
    "end": 673.859,
    "text": " as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.16,
    "end": 684.537,
    "text": "So basically what happens is again you have on the one hand the log probability of your posterior model minus log probability of your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.23,
    "end": 707.041,
    "text": " of your kind of model and now the difference is that that you don't know yet the observations in the future so yet you condition it on the policy so everything will depend on the actions you will do and you also have to take the expectation over all kinds of of outcomes you expect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.362,
    "end": 728.218,
    "text": " And then going to the second line, you basically make the move that if your model is sufficiently trained, then basically your approximate posterior will be very close to the true posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.639,
    "end": 732.522,
    "text": "And this then basically allows you to rewrite the final term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.083,
    "end": 749.295,
    "text": " I see now that I wrote it in a different way, but you can rewrite this either as an information gain on your states and moving towards preferred outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.695,
    "end": 757.201,
    "text": "You can also rewrite it the way we did here, where you basically state, okay, at some point in the future, I will visit some states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.241,
    "end": 761.064,
    "text": "So this is this log P of S star given the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.764,
    "end": 773.131,
    "text": " And you basically replace this by some prior belief that regardless which policy I'm actually choosing, I believe that some point in the future I will realize my preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.211,
    "end": 779.956,
    "text": "So that's why you lose the conditioning on the policy in the last equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.276,
    "end": 791.183,
    "text": "So this then basically becomes a KL divergence that says, okay, I want to find the policies that actually bring me close to the states that I prefer, that I like to be into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.298,
    "end": 801.426,
    "text": " And then on the other hand, you have this ambiguity term that says, okay, what I don't like is to visit states that can give me any observation that I cannot predict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.946,
    "end": 807.191,
    "text": "So I don't like these ambiguous states where I don't really understand basically what's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.914,
    "end": 823.5,
    "text": " so that that brings us to the the whole active influence scheme so at each time step you basically evaluate your expected free energy for each of your policies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.08,
    "end": 832.326,
    "text": " And you then basically assume that you will choose the policy that will actually minimize your expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.366,
    "end": 841.012,
    "text": "So you take the softmax over minus g, and you also weigh this with this gamma parameter, which is just like the precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.072,
    "end": 848.858,
    "text": "So if you have a high precision, then basically you will have a very peaked output of the softmax function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 848.898,
    "end": 854.002,
    "text": "So the softmax will basically become a max.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 854.062,
    "end": 854.963,
    "text": "So you then definitely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.403,
    "end": 879.308,
    "text": " choose the policy with lowest expected free energy if you relax the precision a bit then basically you allow for some more randomness in the system and then basically you end up inferring the next action according to what is the next action that I should take according to this policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.748,
    "end": 907.551,
    "text": " but so in the word follows the actual the action selection given the policy is basically just a deterministic mapping so so the policies are just like certain sequence of actions so given once you choose the policy the action is basically fixed but in theory you could also make this a probabilistic mapping so let's now go to the the real interesting parts of the work and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.293,
    "end": 918.668,
    "text": " spaces with with deep neural networks in such an an active inference key well basically um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.356,
    "end": 946.121,
    "text": " have two components one is the generative model that i rehearsed from the first slide and we have our approximate posterior model and basically you can see that there are three parts in these equations and the first part is basically a transition model so it outputs the probability of your state",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.821,
    "end": 974.268,
    "text": " given your previous states and the action you did in that state second part oh yeah and also the the initial state is basically also part of the transition model but then you just provide with a zero action for example just to bootstrap it the second part is then the likelihood model so given state you want to have a model that that predicts what kind of observation you will you will see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.984,
    "end": 989.489,
    "text": " And then finally, you have the posterior model that, given the previous state action and your current observation, also has to predict which state you're in, or also has to infer which state you're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.85,
    "end": 998.293,
    "text": "So basically, the posterior model has to come up with the same thing as the transition model, but in addition, it has access to your observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.509,
    "end": 1009.934,
    "text": " And again, similar to a transition model, to bootstrap this for the initial observation, you don't have any action, but it can be modeled by the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.334,
    "end": 1026.143,
    "text": "So all these three components, we basically instantiate these as deep neural nets where they have to basically be trained to come up with these three modes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.311,
    "end": 1033.777,
    "text": " So if we put it in a schematic, we basically have something like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.837,
    "end": 1046.35,
    "text": "So given your state and action from the previous time step and the observation from the current time step, you on the one hand provide the previous state and action to your transition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.139,
    "end": 1053.544,
    "text": " which will then output a distribution over the current state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.984,
    "end": 1060.069,
    "text": "And in this case, this distribution is basically modeled as a multivariate Gaussian distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.109,
    "end": 1067.895,
    "text": "So basically, the output of the neural net will be the means and the standard deviations of a Gaussian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.515,
    "end": 1073.94,
    "text": "And then we basically use this distribution to then generate samples for the next time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.68,
    "end": 1091.992,
    "text": " so the posterior model gets also as input the state and the action from the previous time step but also in addition the current observation it also does a prediction on the the current time step and after sampling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.884,
    "end": 1099.547,
    "text": " you basically have the likelihood model that can then generate a prediction of the outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.207,
    "end": 1106.649,
    "text": "And then this state is put to the next time step, and the story repeats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.089,
    "end": 1119.534,
    "text": "So as I already mentioned, the output of each of our neural nets is basically some mean and some deviation of a multivariate Gaussian with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.384,
    "end": 1124.346,
    "text": " with a diagonal covariance matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.126,
    "end": 1129.99,
    "text": "And we use the reparameterization trick to generate samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.05,
    "end": 1140.417,
    "text": "So basically, we generate a sample by having the means and then add the standard deviation times some standard normal noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.557,
    "end": 1150.665,
    "text": "And this basically allows you to backpropagate gradients all the way through this neural net also if you draw samples from the models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.465,
    "end": 1160.052,
    "text": " And then, of course, for the next time step, you just propagate a sample and then the story repeats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.576,
    "end": 1171.468,
    "text": "So creating such a model is then basically first collecting data sets of action observation sequences, so you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.092,
    "end": 1189.082,
    "text": " You take your agent, you either let it randomly generate sequences in the environment, or in the case of a real robot, for example, you drive it around yourself in the environment while you record the actions and the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.569,
    "end": 1205.348,
    "text": " And while the models aren't converged, you sample some sub-sequences from your data sets, you estimate the states that are visited, and you reconstruct all the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.309,
    "end": 1221.749,
    "text": " and then you basically back propagate the free energy loss so this is the the same formula as the free energy in the start so on the one hand you have the kl divergence between the output of your posterior neural net and your prior neural net",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.771,
    "end": 1243.073,
    "text": " and on the other hand you have this reconstruction error that basically scores how how good you're reconstructing the actual observation and using this loss function you just update the parameters of your neural nets and you basically build a model that is able on the one hand to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.421,
    "end": 1260.332,
    "text": " To infer your current state, given your observation that is able to generate new observations, if you know which state you're in you can reconstruct these observations, but also you have the transition model that you can then just use to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.673,
    "end": 1271.68,
    "text": "In the state space plan ahead what would happen if I if I would do this action and it will give you distribution over over the next state is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.122,
    "end": 1277.043,
    "text": " So then we come to the planning part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.783,
    "end": 1283.484,
    "text": "So once you have this model, how can you use it to let your agent do useful things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.285,
    "end": 1286.965,
    "text": "So there we will use Monte Carlo sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.545,
    "end": 1293.507,
    "text": "So one of the things, one of the limitations of these kind of architectures is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1294.207,
    "end": 1315.09,
    "text": " basically only approximate the distribution for the next state so given the sample from uh from the previous state and given the action we approximate the distribution for the next state but then we sample during training as well so we will never have like a good distribution for let's say 10 steps ahead",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.313,
    "end": 1324.712,
    "text": " So to predict them in distributions for further in the future, we approximate these by doing multi-carrier sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.649,
    "end": 1343.314,
    "text": " So for each of the policies we want to evaluate, we sample n trajectories that all do the same actions, but that due to the sampling might give us different results in terms of future states and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.874,
    "end": 1348.575,
    "text": "So for each time step, we then have a bunch of states and a bunch of predicted observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.636,
    "end": 1354.037,
    "text": "We then fit a Gaussian distribution using the sample means and variances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.146,
    "end": 1358.949,
    "text": " And then we estimate the expected free energy as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.049,
    "end": 1364.933,
    "text": "So on the one hand, we have this KL divergence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.413,
    "end": 1375.68,
    "text": "If you remember that scores, how good your distribution of states is according to some prior preferences of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.18,
    "end": 1383.025,
    "text": "So you use this normal, this Gaussian distribution to calculate the KL divergence with respect to these priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.837,
    "end": 1390.482,
    "text": " On the other hand, you have this entropy term that scores the ambiguity of these states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.902,
    "end": 1399.529,
    "text": "So here we basically use the entropy of the observations generated in our trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.209,
    "end": 1407.655,
    "text": "We also added a scale factor row to just kind of weigh two terms from one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.9,
    "end": 1435.382,
    "text": " which allows you to make an agent more risky let's say if it's it's more weight on realizing preferences early whether you could also make a more cautious agent let's say that's that's really does not want to end up in some some ambiguous states and crucially here we also have kind of this recursive notion in here so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.155,
    "end": 1439.657,
    "text": " We do this rollout for K time steps ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.598,
    "end": 1453.572,
    "text": "And then for the future, you could kind of recursively look further into the future, let's say, and aggregate also expectatory energies from that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.431,
    "end": 1461.577,
    "text": " And to make it a bit more clear, let's try to visualize it a bit better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.437,
    "end": 1467.261,
    "text": "So suppose at some current time, step t, you're in this state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.822,
    "end": 1474.707,
    "text": "Then basically what you do is you use your transition model to say, OK, given that I follow C1,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.648,
    "end": 1482.112,
    "text": " what will be the next state, and you draw a sample from the distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.152,
    "end": 1485.876,
    "text": "So this is then s by following policy 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.596,
    "end": 1489.159,
    "text": "And this thing you can repeat for k times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.339,
    "end": 1493.303,
    "text": "So we put in this k to just have some kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.205,
    "end": 1498.246,
    "text": " course grading of actions, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.607,
    "end": 1508.113,
    "text": "For example, in the case of a driving robot, it might not make sense to switch action every 10 milliseconds, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.133,
    "end": 1513.157,
    "text": "So if you decide to drive forward, you want to keep on driving forward for at least some time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.177,
    "end": 1516.019,
    "text": "So that's basically where this K comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.039,
    "end": 1520.362,
    "text": "So you follow the same policy for some time steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.533,
    "end": 1524.494,
    "text": " And you basically sample this n times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.534,
    "end": 1530.697,
    "text": "So you repeat this process n times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.737,
    "end": 1541.201,
    "text": "So you have now at each time step n samples for the kind of states you think you will visit after following the first policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.366,
    "end": 1546.488,
    "text": " And then if you have a second policy, you can do the same thing for that policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.449,
    "end": 1552.772,
    "text": "So in this case, we only consider two potential policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.512,
    "end": 1556.654,
    "text": "For instance, go left or go right, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.581,
    "end": 1571.853,
    "text": " And then at this point, so at time step E plus K, we can basically repeat this procedure and say, OK, what if after K time steps I switch policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1572.634,
    "end": 1575.837,
    "text": "Maybe I first have to go left and before turning right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.084,
    "end": 1579.926,
    "text": " Or maybe I should turn left twice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.087,
    "end": 1582.929,
    "text": "So then basically you repeat this process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.93,
    "end": 1593.68,
    "text": "And this you can basically keep on adding to the search tree for as long as your computation power allows you, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.369,
    "end": 1600.692,
    "text": " So then how do we calculate the expected free energy from this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.852,
    "end": 1604.375,
    "text": "So we take our formula.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.755,
    "end": 1614.524,
    "text": "So basically what we do is that each time step, we first use likelihood model to also predict what are the observations that I expect in these states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.933,
    "end": 1628.603,
    "text": " And you then look at all your state samples from a certain time step, and this then gives you this approximate Gaussian distribution for both the states and the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.123,
    "end": 1645.536,
    "text": "So you plug these into the formula, and this then gives you kind of a number that says this is the expected free energy if I think I am in states t plus k, and I will follow along with policy 1 from thereafter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.846,
    "end": 1651.049,
    "text": " And then basically you can do this for each of these sub-branches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.07,
    "end": 1654.272,
    "text": "And this is then where the recursion comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.872,
    "end": 1670.484,
    "text": "So then we basically state, well, I assume that my active inference agent also at that time step will most likely choose the policy with the lowest free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.945,
    "end": 1672.226,
    "text": "So basically we combine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.018,
    "end": 1693.434,
    "text": " uh the the free energy for policy one and policy two according to uh the rates that that are provided using the softmax function so if one of the uh if policy one has a very very low um expected free energy compared to policy two then basically only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.954,
    "end": 1720.128,
    "text": " the expected free energy of policy one will be added um thereafter if they are kind of the same then they they will both have kind of 0.5 weight or if the other one is the clear winner that will mainly be the contribution of this thing but so we basically combine these assuming that your agent will at that point also select the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.667,
    "end": 1723.189,
    "text": " policy with the least free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.569,
    "end": 1731.398,
    "text": "So now we basically have an estimate of what will be the expected free energy for the future given that we are at time step e plus three",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.731,
    "end": 1735.893,
    "text": " And then we can further go up the tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.413,
    "end": 1756.107,
    "text": "And so then for each branch, again, we will use the first part of the formula to estimate these gaussians, to calculate the KL divergence and the entropy term, and then add this together with what we already had for the remaining part of the tree, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.011,
    "end": 1766.976,
    "text": " And this is very similar, I think, to what Paul Friston proposed in his sophisticated inference paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.316,
    "end": 1780.203,
    "text": "So basically, at each step in the future, you kind of only consider the free energy of the branches that you think will basically be the best ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.493,
    "end": 1792.256,
    "text": " So in the end, you'll end up with an expected free energy for both of your policies, and you then select the best one and start acting accordingly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.096,
    "end": 1805.279,
    "text": "So I'll now turn to Ozan, who will give some more details on the various experiments that we did that hopefully give some more insights on how this can work in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.359,
    "end": 1806.759,
    "text": "So take it away, Ozan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.339,
    "end": 1808.88,
    "text": "Yeah, hi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.576,
    "end": 1815.298,
    "text": " I have some echo on my end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1815.878,
    "end": 1816.978,
    "text": "Maybe it's resolved now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1817.558,
    "end": 1818.219,
    "text": "Yeah, sounds fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1818.259,
    "end": 1818.579,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1819.059,
    "end": 1820.46,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1821.08,
    "end": 1825.162,
    "text": "So I'll go briefly through our initial experiments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1825.402,
    "end": 1832.425,
    "text": "So these are the experiments we did in the past one or two years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1833.805,
    "end": 1837.867,
    "text": "And so one of the first experiments we did and reported on was the mountain car.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1838.649,
    "end": 1842.231,
    "text": " which is a fairly well-known benchmark, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1842.651,
    "end": 1851.416,
    "text": "So the goal is to have this undirectuated car, so it does not have enough power to reach the top of the right-hand mountain, but you want to reach it anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1852.336,
    "end": 1865.223,
    "text": "So ideally, your agent should learn here that it should first go back a bit to the left to gain enough momentum so it can climb the steeper mountain on the right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1866.73,
    "end": 1871.191,
    "text": " And even though this is such a low dimensional problem, it only has positions and velocities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1871.751,
    "end": 1877.592,
    "text": "It is actually a very interesting benchmark to experiment upon because there's no greedy solution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1877.812,
    "end": 1885.274,
    "text": "So any agent that is just wants to realize its preferences immediately will fail at this because it will always fail to drive up the mountain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1888.154,
    "end": 1890.495,
    "text": "Now for our experiments, we made it a bit more difficult.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1892.254,
    "end": 1896.156,
    "text": " we made the fully observable mountain car partially observable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1897.016,
    "end": 1904.338,
    "text": "So what we did was we omitted the velocity information and only provided some noisy estimates of the actual position.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1904.859,
    "end": 1907.7,
    "text": "So the agent actually had to learn two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1907.78,
    "end": 1917.783,
    "text": "It had to learn, first of all, what its precise position was, and then also how this position relates to the momentum by its velocity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1919.175,
    "end": 1939.354,
    "text": " And then if we start from the setup and we train the model that Tim explained a bit earlier in its most basic form, you can actually learn a state space that closely mimics these physical constraints of the system by minimizing energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1939.394,
    "end": 1944.518,
    "text": "So if you look at the right utmost figure, you'll see that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1945.564,
    "end": 1958.694,
    "text": " And you see these sinusoidal state space dimensions, and these closely mimic the actual observations of the real world in the lower image.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1958.734,
    "end": 1966.119,
    "text": "So as you can see in the lower image, we have the ground truth in green, which is an actual trajectory through its position of the cards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.88,
    "end": 1969.321,
    "text": "And then also our state transition model estimates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1969.341,
    "end": 1972.384,
    "text": "So our prior estimates on the position",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1974.303,
    "end": 1975.184,
    "text": " without observing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1975.784,
    "end": 1984.768,
    "text": "And then also in the blue line, which is a bit harder to see, you can see the same estimate, but now corrected with the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1984.888,
    "end": 1987.149,
    "text": "So it's actually just the posterior model outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1988.53,
    "end": 2001.676,
    "text": "And you can see these shapes returning in the state space, which in itself does not say that much, but it gives you at least an kind of vague idea that at least the state space is capturing something relevant for the problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2002.176,
    "end": 2004.818,
    "text": " And I think there is one more animation on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2006.299,
    "end": 2008.44,
    "text": "So yeah, it's the same conclusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2008.5,
    "end": 2018.087,
    "text": "As I said, right now you can predict the future as you can see in the orange line and it appears to learn the velocity in its state space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2018.927,
    "end": 2020.428,
    "text": "Now, if you can go to the next slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.691,
    "end": 2025.132,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2026.112,
    "end": 2028.234,
    "text": "Now we want to actually figure out how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2029.537,
    "end": 2033.64,
    "text": " how we can use this model that we learned for active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2034.0,
    "end": 2038.924,
    "text": "And typically in RL, you would get some sparse reward for driving up the mountain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2039.845,
    "end": 2046.97,
    "text": "But in our initial experiments, we were more interested in how an agent could learn from human demonstrations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2049.013,
    "end": 2059.648,
    "text": " so we recorded seven i think yeah five sorry five um human rollouts in the environment just like driving around with the cards so you go first left and right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2060.953,
    "end": 2069.7,
    "text": " And then we, uh, push these trajectories through our models together to our, through our, um, posterior model to get a preferred state distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2070.32,
    "end": 2076.965,
    "text": "So here on this figure, you can see the eight different dimensions, how these evolve through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2077.406,
    "end": 2079.027,
    "text": "If you follow these trajectories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2079.748,
    "end": 2086.453,
    "text": "So in the spread, of course, give you, gives you the standard deviation at each time point for, for that state value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.594,
    "end": 2087.834,
    "text": "And then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2089.716,
    "end": 2108.15,
    "text": " If you use this preferred state distribution and you calculated the G or even only the KL divergence between your posterior and your preferred distribution for different trajectories through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2108.49,
    "end": 2114.495,
    "text": "So here every different color, every different trajectory is a different rollout in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2115.672,
    "end": 2126.739,
    "text": " or imaginary rollout through the environment, you can see that you can actually use this preferred distribution to rank trajectories according to lowest free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.919,
    "end": 2134.304,
    "text": "So you see that the blue curve is the only one that reaches the top and is also the one that the model seems to prefer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2137.086,
    "end": 2138.887,
    "text": "And then in the next slide, yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2141.178,
    "end": 2144.66,
    "text": " We experiment a bit what this means in terms of the actual free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2144.7,
    "end": 2146.861,
    "text": "So also compensated with the entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.342,
    "end": 2155.845,
    "text": "And what we did here was we had the agent observe the world for one time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2155.945,
    "end": 2161.467,
    "text": "So we give it an initial observation to get a sort of bootstrap latent sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2162.328,
    "end": 2169.691,
    "text": "And then we will only use the prior model to imagine what will happen if you follow certain policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2170.782,
    "end": 2176.624,
    "text": " So here we considered three policies or like two possible policies that you can switch at three time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2177.364,
    "end": 2184.627,
    "text": "So you either go left, right, right, left, right, left, et cetera, or you can start with right and then these are the blue curves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.387,
    "end": 2197.231,
    "text": "And what we see that if there is no initial velocity, then you see that agent imagines that the optimal policy, which is left, right, right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.531,
    "end": 2199.772,
    "text": "So first go as far up left and then just,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2200.612,
    "end": 2209.998,
    "text": " blast your way to the top, gives actually the least amount of spread, and also he believes that this will reach the top earlier than any other policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.519,
    "end": 2228.571,
    "text": "Inversely, if you look at the policies that first go right, then you see that there is still a little, there's close to no spread due to the lack of initial velocity, but the agent already knows that it's impossible to reach the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.017,
    "end": 2233.878,
    "text": " Now, if you go to the next slides, the site.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2234.159,
    "end": 2238.72,
    "text": "So here we do the same experiments, but we add some random initial velocity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2239.5,
    "end": 2246.043,
    "text": "And again, we let the agent observe the world for one time step, and then let plan according to the same policies as before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2247.183,
    "end": 2253.465,
    "text": "And first of all, you see that the agents has a lot of much larger spread on its believed outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2253.786,
    "end": 2257.127,
    "text": "This is due to this external extra uncertainty on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2258.348,
    "end": 2259.649,
    "text": " what the initial velocity is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2260.189,
    "end": 2279.244,
    "text": "And also, this initial velocity might render previously infeasible policies feasible, as you can see at the bottom, because now if the agent thinks, yes, my initial velocity is high enough, even with one of the more suboptimal policies, it might still be possible for me to reach the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.006,
    "end": 2284.888,
    "text": "And if you go to the next slide, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.479,
    "end": 2288.28,
    "text": " Here we can then see this in action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2288.38,
    "end": 2295.182,
    "text": "So this animation, we collapse the imagined trajectories to the actual trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2296.223,
    "end": 2305.106,
    "text": "And you see that in the beginning, if we can maybe play it again, in the beginning, it believes that more red policies will reach the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2305.246,
    "end": 2307.587,
    "text": "And then as it gains more momentum,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2308.8,
    "end": 2311.721,
    "text": " Oh, it will believe that all blue policies will reach the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2311.761,
    "end": 2318.423,
    "text": "And even it will know that if I now go left, so I decelerate, then I will less likely reach the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2320.524,
    "end": 2321.264,
    "text": "So I think, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2321.945,
    "end": 2327.207,
    "text": "So as you can see now, he knows that red will not reach the top and yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2330.709,
    "end": 2341.056,
    "text": " And then another experiment we did building upon this was, what if we take this same approach, but now we move to the task, the kind of problems we want to solve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2341.316,
    "end": 2346.439,
    "text": "So the high dimensional observations that you cannot model by hands.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2347.48,
    "end": 2355.585,
    "text": "So we took another OpenAHM environment, the car racer, and here the goal is to drive the red car.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2356.205,
    "end": 2358.407,
    "text": "As you can see on the high resolution image on the left,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2361.0,
    "end": 2362.641,
    "text": " on the road for as long as you can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2364.461,
    "end": 2369.602,
    "text": "And then we trained our model on a handful of human demonstrations of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2369.622,
    "end": 2379.565,
    "text": "And then you can see that in the reconstructed image on the right, even on a handful of observations, it can learn to predict this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2381.105,
    "end": 2383.005,
    "text": "So we did exactly the same thing as before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2383.025,
    "end": 2385.166,
    "text": "And I think this is an animation now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.854,
    "end": 2400.102,
    "text": " Yeah, so if you then use the planning tree that Tim explained on this little card, it will have learned that the road, so the gray area is important and it should stay on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2401.343,
    "end": 2409.968,
    "text": "Now, this agent is a bit more greedy and it tries to shortcut corners to get quicker on the gray part as you can see here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2412.79,
    "end": 2415.812,
    "text": "Okay, if we can go to the next slide maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2417.29,
    "end": 2436.18,
    "text": " Now, and also an important point here is that our active inference approach, which is model-based, seems to be a lot more data efficient than, for example, a baseline RL agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2436.2,
    "end": 2445.245,
    "text": "So we took DQN, since this is also an off-policy algorithm, to be able to compare it kind of similar to our approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2446.32,
    "end": 2460.961,
    "text": " as you can see in the first graph so for the mountain car um our model quickly um so sorry our models are in is the orange our model quickly learns that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2461.929,
    "end": 2464.331,
    "text": " at least some method to reach the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.611,
    "end": 2466.332,
    "text": "And then afterwards it just improves upon this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.352,
    "end": 2471.916,
    "text": "Whilst due to the sparseness of the rewards, DQN is not able to learn as quickly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2472.437,
    "end": 2479.442,
    "text": "And even after having thousand times more, thousand times more observations, it still isn't capable of climbing the mountain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2480.403,
    "end": 2482.444,
    "text": "And even for the car racer, it's even worse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2482.745,
    "end": 2490.31,
    "text": "So here we trained on seven or 10 rollouts and immediately we're able to get a reward of 600.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2491.94,
    "end": 2500.504,
    "text": " whilst DQN just fails to get that same level of performance even after thousands of rollouts in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2502.245,
    "end": 2503.686,
    "text": "So if we can go to the next slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.027,
    "end": 2514.832,
    "text": "And then a final experiment I want to discuss today is the robotic navigation or like maybe more accurately robotic control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2515.672,
    "end": 2520.415,
    "text": "So here we took our KUKA platform and we mounted some sensors on top of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2521.677,
    "end": 2525.138,
    "text": " and then also put it on a laptop for good measure to have some compute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.158,
    "end": 2531.499,
    "text": "I don't think the sensors are really relevant for what we're going to discuss now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2531.559,
    "end": 2540.361,
    "text": "So then we drove around with the robot in our lap, as you can see on this movie, just like with the joystick and captured a lot of data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2541.702,
    "end": 2546.383,
    "text": "And we just drove up and down the aisles with the robot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2547.301,
    "end": 2553.886,
    "text": " Now this environment is also a bit challenging for robots since all these aisles are super similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2554.246,
    "end": 2559.43,
    "text": "Like for a robot, knowing if it's an aisle one or two, it's nearly the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2559.49,
    "end": 2561.852,
    "text": "It's very difficult to comprehend for the machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.193,
    "end": 2567.196,
    "text": "So then in this slide, you see what a recording might look like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.236,
    "end": 2571.28,
    "text": "So you have LiDAR and radar feed and some images.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.601,
    "end": 2573.722,
    "text": "Yeah, sorry, Tim.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2574.382,
    "end": 2575.323,
    "text": "This is not a correct slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.574,
    "end": 2587.0,
    "text": " And then the goal is to, again, train a model that will be able to generate future observations for the robots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.3,
    "end": 2588.901,
    "text": "I don't know if there's an animation on the slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2589.421,
    "end": 2601.028,
    "text": "So yeah, so you saw the first, the high resolution image was the real observation, and this is then what the model thinks will happen if the robot first turns right and then continues to drive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.554,
    "end": 2606.799,
    "text": " The little ghost artifact you saw a bit, a couple of frames ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.819,
    "end": 2609.762,
    "text": "So yeah, we'll firstly look at it again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2609.822,
    "end": 2614.928,
    "text": "So we drive and then it will turn and suddenly you will see a ghost theme appear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.948,
    "end": 2614.988,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2619.045,
    "end": 2623.409,
    "text": " This is because the model doesn't actually know what will happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2623.449,
    "end": 2629.034,
    "text": "It can only try to guess based on its previously learned experiences in the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2629.574,
    "end": 2631.916,
    "text": "And there's a lot of people walking around in the dataset.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.256,
    "end": 2635.88,
    "text": "So there was some chance that somebody would be walking there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2636.34,
    "end": 2639.523,
    "text": "So it just might imagine that there's somebody there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2640.644,
    "end": 2642.325,
    "text": "Then maybe if we go to the next slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.428,
    "end": 2646.389,
    "text": "This is also an animation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2647.674,
    "end": 2651.416,
    "text": " So here you can see, for example, how these imaginary samples deviate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.357,
    "end": 2654.578,
    "text": "And this is also the reason why we need this sampling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.438,
    "end": 2659.36,
    "text": "So the different sampling in the planning tree for different outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.4,
    "end": 2671.247,
    "text": "So you see that given the same starting position and observation, the model learns that turning left might have different outcomes depending where it is in there, in which aisle it is and where it is in the aisle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2671.347,
    "end": 2672.488,
    "text": "For example, the top right,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2673.433,
    "end": 2682.979,
    "text": " then the robot imagines that it is at the end of the aisle, whilst in the bottom two, it imagines that it is in the aisle, so it just imagines some stuff on the racks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2685.881,
    "end": 2689.683,
    "text": "And here is then how we can evaluate policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.603,
    "end": 2694.786,
    "text": "So we typically, we provided three possible policies, turn left, forth, and turn right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2695.226,
    "end": 2698.768,
    "text": "And then you can imagine what all these things will do in the environments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2700.049,
    "end": 2702.611,
    "text": "And then similarly as before, you can,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2705.578,
    "end": 2713.024,
    "text": " calculate the G and select the one that will most likely bring you to your preferred sequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2718.888,
    "end": 2719.429,
    "text": "Yeah, right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2720.51,
    "end": 2723.412,
    "text": "Also the nice thing of our model is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2725.467,
    "end": 2734.191,
    "text": " You can, because it's a neural network, you can put multiple types of observation into a posterior model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2734.231,
    "end": 2736.112,
    "text": "You can fuse them in various ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2737.153,
    "end": 2750.559,
    "text": "So what you can see here is that, similar to the camera feed, the robot will also learn the effect, for example, in a LiDAR scan, and also it will learn the effect on the velocity bands in a radar scan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.455,
    "end": 2759.121,
    "text": " And this gives you, of course, extra robustness in your planning because you can now reason on multiple modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2760.743,
    "end": 2764.025,
    "text": "That may be in the next slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2764.806,
    "end": 2770.691,
    "text": "There are, of course, still some limitations to doing robotic control this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2771.632,
    "end": 2778.318,
    "text": "First of all, our robot is extremely short-sighted in time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.238,
    "end": 2785.521,
    "text": " It can only learn to predict as far as the length of the sequences we provided during training.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2786.622,
    "end": 2794.726,
    "text": "And also the longer you roll out, the larger your search tree becomes, the more computational limits you will reach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2796.667,
    "end": 2800.409,
    "text": "So this is also then an area we are now actively working on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2803.147,
    "end": 2808.429,
    "text": " And then currently our models still require that we prerecord the data set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2808.449,
    "end": 2813.371,
    "text": "So our models require that we drive around ourselves and then fit the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2813.391,
    "end": 2817.573,
    "text": "So there's also a point we're currently at this moment working on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2818.834,
    "end": 2830.479,
    "text": "And then tying into this, our models currently do not really know how to explore whilst there's probably a sensible way to do exploration based on the free energy principle since",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.658,
    "end": 2833.799,
    "text": " your model uncertainty can be baked in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2833.819,
    "end": 2839.501,
    "text": "I think, I don't know if we have any more slides actually now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2839.521,
    "end": 2842.503,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.277,
    "end": 2865.618,
    "text": " can um unshare and we can ask some questions so i wrote down a bunch of stuff and also anybody who's watching live please ask some questions so nice presentation though and awesome very instructive videos",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.219,
    "end": 2870.96,
    "text": " hopefully made us think made us laugh a little bit when it cut corners.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.241,
    "end": 2874.982,
    "text": "So maybe just a starting question while people are writing their question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2876.442,
    "end": 2880.804,
    "text": "What brought you to be studying this topic in this way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.524,
    "end": 2885.846,
    "text": "Were you coming from active inference and saw robotics as an interesting application?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2886.426,
    "end": 2891.108,
    "text": "Or were you in the area of robotics and then found active inference to be a useful model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.553,
    "end": 2899.515,
    "text": " Yeah, so basically we were in the area of robotics and reinforcement learning, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.675,
    "end": 2912.798,
    "text": "And we were working on building better low-dimensional state representations to feed into a reinforcement learning algorithm, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.219,
    "end": 2914.819,
    "text": "That was our initial idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.139,
    "end": 2917.7,
    "text": "So just building representations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.676,
    "end": 2936.928,
    "text": " or or better reinforcement learning and then we stumbled upon the active inference framework which which basically not only gave us a way of um of how to uh to build degenerative models because basically we need",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.518,
    "end": 2941.462,
    "text": " We found ourselves, let's say, the free energy of the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.502,
    "end": 2943.484,
    "text": "We were basically already doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.165,
    "end": 2953.554,
    "text": "But we saw that it also gives us, in the same mathematical framework, a way of how to project these things to the future and use these for planning, for...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.035,
    "end": 2963.719,
    "text": " resolving ambiguity and also for scoring novelty and all these nice properties that are basically lacking in RL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.239,
    "end": 2980.846,
    "text": "So that's why we basically started digging into this mathematical framework to go through all the papers of call and see how all the ends are tied together and see whether this would still work if you don't have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.522,
    "end": 2986.189,
    "text": " your state space defined prompt, but you just learn it from data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.63,
    "end": 2994.822,
    "text": "So that's how we started this endeavor and that's pretty much where we are at this point and still investigating it further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.17,
    "end": 2997.47,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.49,
    "end": 3008.076,
    "text": "That was going to be my second question was like, what differences or advantages would you describe for active inference over reinforcement learning or other machine learning frameworks?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3008.516,
    "end": 3010.257,
    "text": "If you answered it previously, that's great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3010.337,
    "end": 3011.958,
    "text": "Or do you want to add any other thoughts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3014.5,
    "end": 3023.465,
    "text": "I think the nice part is that you automatically get the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.676,
    "end": 3036.501,
    "text": " the nice properties of resolving ambiguity and of potential exploration if you also estimate posterior distributions over your parameters, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.841,
    "end": 3041.803,
    "text": "So these are very interesting properties mathematically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.663,
    "end": 3069.288,
    "text": " however it's still um it's there's still a gap to to actually um get this out of um these real world cases if you if you if you don't have the degenerative model uh predefined let's say so there are still some challenges but the theory at least this is is very much appealing um and i but i think if you look at what's going on at the rl site that we report during sites then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.492,
    "end": 3086.785,
    "text": " there's not that big of a gap between the two fields, I think, because you look at all the curiosity bonuses that they tried to come up with in reinforcement learning, and if you look at the model-based stuff from Danny J. Hafner with his Dreamer approach, then everything is kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.666,
    "end": 3109.683,
    "text": " similarly converging to it's a good idea to build a model of your world and get more sample efficiency and it seems like a good idea to have some planning in there and maybe there is some gaining curiosity and so you see that a lot in a lot of different independent research tracks we all converge along the same lines",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.775,
    "end": 3133.784,
    "text": " and i think what's what is so appealing to active inference is that basically it brings this all together from from a single principle which makes it a very nice framework to to to work with i think anything to add on that i was on no yeah i was before tim mentioned that i was already thinking along the lines of the work of the ninja helper so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.137,
    "end": 3150.884,
    "text": " I mean, if you look at his models, and I think that is currently almost state-of-the-art and model-based RL, then you'll find that the models they are building are very similar to the models we are building or other active inference researchers are building.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3152.004,
    "end": 3159.748,
    "text": "So yeah, I mean, it makes sense that all these approaches converge on a single idea if the idea works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3162.338,
    "end": 3180.532,
    "text": " yep very interesting that like plan to dream and dream or imagine so that you can sample appropriately why put that as a second layer on the model or have to incentivize it in a sort of ad hoc way why not have that be the basis of the model so that's a very nice point",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3181.272,
    "end": 3202.695,
    "text": " so dean in the chat asks have the authors heard of the missionary and cannibals game slash problem which is moving um two kinds of mutually incompatible agents back and forth from two sides of a river and um if they have heard of this or thought of any kind of analogous cases do you see any applications",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3207.116,
    "end": 3209.378,
    "text": " Yeah, I haven't heard of the game before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3209.418,
    "end": 3216.442,
    "text": "I think it's probably similar to crossing the river with a chicken, a fox, and a goat, or what was it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3216.522,
    "end": 3217.983,
    "text": "Yeah, there's animal versions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.043,
    "end": 3219.464,
    "text": "There's all kinds of versions of this one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.524,
    "end": 3228.791,
    "text": "But going back and forth with different kinds of incompatible agents, and you need to sort of go to the left before you can make it up the hill, but it's a little bit of a different setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3228.851,
    "end": 3230.092,
    "text": "So what does that make you think of?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3232.893,
    "end": 3236.316,
    "text": "I haven't actually really considered it for our models, but it might be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.237,
    "end": 3255.462,
    "text": " we find a way to mold it in an environment and then maybe collect some data on it yeah i think this is a problem that is is very nicely suited for for doing it let's say the the vanilla way where you basically write out all the different states that can happen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.607,
    "end": 3258.627,
    "text": " kind of observe the outcomes that you can have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.348,
    "end": 3271.25,
    "text": "So I think you could actually formalize it in such a way and then run an active instrument simulation on that and see what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.851,
    "end": 3282.193,
    "text": "So that's less of our interest because in our cases, we are mainly interested in what if your observations are so high dimension",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.393,
    "end": 3288.175,
    "text": " that you can't even start thinking about writing out the joint model, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.576,
    "end": 3303.841,
    "text": "The only thing you can do is interact with your environment and try to learn it from the data, which is a slightly different take on the active inference problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.458,
    "end": 3305.718,
    "text": " Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.239,
    "end": 3316.107,
    "text": "Another question is you are all deploying these models sort of real time with physical agents, embodied agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3316.727,
    "end": 3322.712,
    "text": "So what surprised you or what was interesting to note as far as going from the simulation only",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.332,
    "end": 3334.385,
    "text": " Where you can sort of put everything in a box and know exactly what's going to influence what to the world of embodiment where, I don't know, some dust could get into the robot or I saw a person walk by.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.766,
    "end": 3341.754,
    "text": "So what comes into play when you actually deploy physically and how does the model deal with that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3344.023,
    "end": 3350.307,
    "text": " For me, it's actually the thing I... Well, first, I played around a lot with the mountain car and the car racer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.688,
    "end": 3355.811,
    "text": "But the first thing actually was a real hurdle for me personally, was deploying it on a real robot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3356.232,
    "end": 3359.634,
    "text": "You suddenly have all these hardware constraints.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3359.654,
    "end": 3361.395,
    "text": "You don't have infinite memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3361.415,
    "end": 3363.376,
    "text": "You don't have server-grade compute anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3364.037,
    "end": 3365.358,
    "text": "And you all have to... Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3366.579,
    "end": 3366.739,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3367.776,
    "end": 3374.959,
    "text": " Fitted, for example, I think Tim and I spent a lot of time to make a demo working where we could roll this out real time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3374.979,
    "end": 3385.303,
    "text": "And just the hardware constraints of doing something as complex as Active Infants real time on a real power constraint robot is another challenge in and of itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3387.358,
    "end": 3395.705,
    "text": " Yeah, so I think if the question was, what do you get from doing it on the real system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.725,
    "end": 3398.687,
    "text": "Well, a lot of frustration and pain, I think, is the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.288,
    "end": 3406.454,
    "text": "But likewise, if it then works, then the satisfaction is so much higher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.594,
    "end": 3411.198,
    "text": "So I still remember Ozan and me cheering in the lab because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.698,
    "end": 3415.983,
    "text": " He gave the robot a preferred state of being nicely in the center of the ale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.424,
    "end": 3418.827,
    "text": "And it was actually moving along the ale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3418.967,
    "end": 3423.512,
    "text": "And then at the very end, it decided, hmm, this is not the center of the ale anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.592,
    "end": 3426.756,
    "text": "And it just made a 360 degree turn and started driving back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.977,
    "end": 3428.538,
    "text": "And we were like, oh, this is awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.103,
    "end": 3441.627,
    "text": " So I think there's lots of pain and frustration to get it to work, but then once something comes out, then the satisfaction is so much higher than when you see a mountain car reach the software.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.767,
    "end": 3443.268,
    "text": "Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.368,
    "end": 3455.992,
    "text": "You could set up a physical valley, maybe make a physical mountain car, because there's so much comparison of the software realization, but maybe that would be even taking it to the next level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3456.892,
    "end": 3457.293,
    "text": "So another...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.513,
    "end": 3468.001,
    "text": " thing that you talked about repeatedly, maybe even in every example was actually training the model from just a handful of human cases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3468.061,
    "end": 3471.844,
    "text": "Like you drove the car, you had people play the mountain car game.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3472.384,
    "end": 3479.29,
    "text": "So what exactly is happening there and how does the model like not overfit to the few trajectories you show",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3480.01,
    "end": 3498.843,
    "text": " or not just say hey you only gave me three what's the deal with these three totally different trajectories like what exactly is being learnt or updated in the model when you provide just a handful of human examples i thought them was going to answer this one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3502.814,
    "end": 3512.837,
    "text": " So basically, I think overfitting is clearly an issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.377,
    "end": 3517.318,
    "text": "No matter what you do, you're constrained to the data you provide to the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.338,
    "end": 3521.18,
    "text": "So it cannot really learn anything else than what it discovers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.58,
    "end": 3525.281,
    "text": "So that's also what we pointed out at the last slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3525.361,
    "end": 3529.482,
    "text": "It's a severe limitation of our current work, clearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.823,
    "end": 3539.566,
    "text": " There is no other way when there's a real robot involved to get started, say, that is the easier way to get started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.646,
    "end": 3541.647,
    "text": "So that's mainly the driver.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.167,
    "end": 3554.592,
    "text": "But at the moment, we're actually working both in simulation but also on real robots to see, can we actually get these systems to decide how to gather their own experience, what is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3554.872,
    "end": 3571.318,
    "text": " interesting to learn from, because that's actually one of the, to shortcut to one of your previous questions, what does active inference give you, well, that it actually can deal with these kind of things, like my robot needs to collect its own experience, what will it do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.338,
    "end": 3574.859,
    "text": "Will it explore, or these kind of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.879,
    "end": 3578.761,
    "text": "So these are really some active areas of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3579.261,
    "end": 3581.942,
    "text": "But then, so to come back to the overfitting problem,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.904,
    "end": 3588.749,
    "text": " So one thing that mitigates overfitting a bit is the fact that you have all this stochasticism in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.769,
    "end": 3598.157,
    "text": "It becomes in sample states, which makes it a bit more... It's not like a classifier that overfits to the test set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.197,
    "end": 3601.68,
    "text": "Let's say there's always some kind of noise in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.648,
    "end": 3614.414,
    "text": " But you're right, it is in some sense overfitted to the data in the sense that it cannot predict scenarios that it clearly hasn't seen before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.094,
    "end": 3623.038,
    "text": "But so one of the nice things of having this expected energy formulation is that you actually punish",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.44,
    "end": 3639.291,
    "text": " you're planning with this entropy term, which basically means that if you plan ahead in some space that the model wasn't trained on, then typically you will have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.907,
    "end": 3659.879,
    "text": " some more variation some higher entropy for that area because typically your your observation becomes very bad or very blurry or out of distribution and so so in some sense the the model is kind of robust against that and it will also if you then deploy a policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.68,
    "end": 3680.31,
    "text": " or like do the planning it will kind of try to stay close to where the model to the regime where the model was was trained okay because there you basically get the the better predictions so in some sense that also mitigates the the problem also i want to add that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.375,
    "end": 3703.275,
    "text": " the by we we could use as little of the rollouts as we did because actually if you let a human do the rollout you solve the exploration problem for the agent you already get a very good coverage of the relevant feasible state space you get like for the car racer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3704.147,
    "end": 3712.637,
    "text": " If you let a random agent drive around as exploration, 99% of your day is still just be grass and the agent will learn nothing about roads.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3713.458,
    "end": 3721.028,
    "text": "So by having a human drive it, you know, okay, this is a road and apparently this is important because it's in every observation I've had.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3722.918,
    "end": 3733.023,
    "text": " That almost makes me think of two ways that we're seeing these large models be trained with a sort of mentor, like a human who says, you know, here's the first places you want to be sampling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3733.063,
    "end": 3734.563,
    "text": "Here's how you drive the first time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3734.943,
    "end": 3737.605,
    "text": "That's the driving instructor side by side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3738.185,
    "end": 3743.867,
    "text": "And then there's the degenerative adversarial approach, which is just the almost opposite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3743.987,
    "end": 3749.01,
    "text": "Like we're going to be passing the model the most confusing possible data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3749.75,
    "end": 3761.379,
    "text": " And so it's sort of like with this carrot and the stick or the push and the pull, these models from both of them, maybe one or maybe both, they figure out how to be on that razor's edge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3761.839,
    "end": 3763.581,
    "text": "And then in the race car example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3765.187,
    "end": 3766.128,
    "text": " it was cutting corners.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3766.728,
    "end": 3769.85,
    "text": "So that just made me wonder about autonomous vehicles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3770.27,
    "end": 3774.133,
    "text": "And you'd say, okay, well, the goal is to stay on the road and to get there fast.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3774.653,
    "end": 3778.715,
    "text": "But then sometimes get there fast is going to take priority.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3778.956,
    "end": 3783.819,
    "text": "And then all of a sudden you're way off the road and maybe now your car is ruined or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3784.199,
    "end": 3794.245,
    "text": "So if these were to be deployed, like how will we even know what kind of preferences to instantiate the model with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3797.011,
    "end": 3820.158,
    "text": " Yeah, and that's a very good point, in fact, because how nice active inference might look in theory, I think it's not a silver bullet to autonomous agents because a lot of the subtlety is still in how do you provide it with the preferred prior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.678,
    "end": 3824.079,
    "text": "And that will be crucial in a real-world system of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3826.02,
    "end": 3830.583,
    "text": " It's similar to a reward, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.643,
    "end": 3834.385,
    "text": "It's a bit more informative than just a scalar reward signal, let's say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3834.726,
    "end": 3842.391,
    "text": "But it suffers from the same issues as in if it gets away to shortcuts,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.392,
    "end": 3850.355,
    "text": " you get this preferred state that you didn't envision before as a designer of the experimented state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.896,
    "end": 3853.977,
    "text": "It basically has the same issues as reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.357,
    "end": 3861.661,
    "text": "So I don't see it as a silver bullet of solving autonomy, but at least it has some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.833,
    "end": 3881.281,
    "text": " turning knobs that you can use to at least avoid some cases like avoid these ambiguous states or at least make it first learn the model properly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.262,
    "end": 3888.606,
    "text": "So it has some nice properties, but it's not a silver bullet to solving autonomous systems, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.307,
    "end": 3892.368,
    "text": "Anything to add on that, Ozan?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3893.303,
    "end": 3894.804,
    "text": " I think Tim said it very well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3895.284,
    "end": 3897.864,
    "text": "Yes, the model is not a silver bullet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3897.964,
    "end": 3899.385,
    "text": "Definitely recognized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3899.905,
    "end": 3904.226,
    "text": "What areas might be interesting shooting ranges?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3904.847,
    "end": 3907.907,
    "text": "First applications where we can at least explore it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3908.828,
    "end": 3912.529,
    "text": "Are those the same use cases that people have been talking about before?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3913.129,
    "end": 3925.764,
    "text": " just more broadly in terms of autonomous vehicles or might there be a sort of divisional labor where active inference is going to specialize like in those ambiguous scenarios or i just was curious about that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3936.993,
    "end": 3947.177,
    "text": " I was also still thinking, but for us, I think the real next application we're targeting is just still the constrained navigation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3947.397,
    "end": 3954.72,
    "text": "For example, a warehouse where the impact of misplanning is still fairly limited.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3955.16,
    "end": 3959.622,
    "text": "So actually more realistic versions of the situation we have in our lab maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3960.472,
    "end": 3964.636,
    "text": " It's also the trajectory we're currently still on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3965.437,
    "end": 3982.294,
    "text": "So I think we still believe that there is some value in developing autonomous active interest agents for this more industry-like settings where you can at least separate it from general public and more, where you have also some level of control of the environments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3984.56,
    "end": 3991.547,
    "text": " Yeah, I think it's similar to mitigating the same problem in reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.567,
    "end": 3998.734,
    "text": "It's basically that before you just let the system randomly pick actions or pick any action it wants, you kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.662,
    "end": 4024.868,
    "text": " or an environment where at least as a human you can you can shortcut the system and say okay you want to drive forward into this rack that's not a good idea so you have at least some some ways of defining some rules to keep it within some safety range let's say and within this boundary it can it can for example move autonomously but still then you you might have the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.068,
    "end": 4050.064,
    "text": " nicer properties of the active inference agent that if you're driving around in some ales and somebody just dropped off a box in the middle of the ale, it will not freak out because the SLAM map is no longer consistent with how the robot was programmed, for example, but will just say, okay, this is another case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4050.624,
    "end": 4068.062,
    "text": " either it experienced this before and it has in its in its world model an idea how to cope with this or it will just be intrigued and start learning on about this new situation so i think these are the nice properties you have in this agent and you kind of bypass the all um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.523,
    "end": 4087.739,
    "text": " It's getting too greedy to realize its preferences because you kind of shortcut these situations by having this more rule-based system in place that kind of limits the choice of action in this space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.96,
    "end": 4089.801,
    "text": "Thanks for the answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4090.081,
    "end": 4091.843,
    "text": "Here's a question from the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4093.217,
    "end": 4104.585,
    "text": " As the code is not disclosed, would you say sticking to what you write in your paper is sufficient to reproduce your results, or are there any further tricks you use in designing and training the models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4104.605,
    "end": 4111.69,
    "text": "Sorry, go ahead, Tim, first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4113.069,
    "end": 4116.95,
    "text": " Yeah, I think that together with the appendages, it should be sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4117.31,
    "end": 4119.611,
    "text": "What do you think, Ozan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4119.891,
    "end": 4125.232,
    "text": "Well, we had some experience where I tried to help somebody out who was trying to replicate our results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4128.033,
    "end": 4131.374,
    "text": "I think we had some tricks for the planning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4132.954,
    "end": 4137.075,
    "text": "That isn't as straightforward to replicate, but the model prediction part...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4138.539,
    "end": 4143.322,
    "text": " we explained the architectures and pretty detailed in the appendishes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4143.923,
    "end": 4151.728,
    "text": "So I think, and we don't do any extra tricks, for example, on data processing or our loss terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4151.848,
    "end": 4160.214,
    "text": "So these should be easy to mimic, but I think the planning is a bit more involved as we sometimes ourselves have difficulties replicating it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4162.536,
    "end": 4163.296,
    "text": "Planning is hard.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4164.077,
    "end": 4164.297,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4166.309,
    "end": 4191.592,
    "text": " um okay if anyone else has questions in the live chat they can type that um another piece that i thought was really fascinating in the mountain car example at least was how you talked about the noise allowing for the previously implausible policies to become possible like we saw a broader spread of the of the trajectories when there was noise um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4192.816,
    "end": 4217.413,
    "text": " how how is that being like integrated in real time or how are the noise which are often very small how does that change the model's understanding of where it can go and what it should do yeah so in the mountain car example there are basically two sources of noise let's say one is on on the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4218.789,
    "end": 4235.143,
    "text": " noise on your observation that you get so you get a noisy estimate of your position and so this is typically not not so large because yeah you need to have a sufficient signal to noise ratio just to to learn anything let's say um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.638,
    "end": 4245.385,
    "text": " but the second part was whether your agent starts with a zero velocity or with a random velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.025,
    "end": 4250.168,
    "text": "And these are basically two separately trained models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4250.568,
    "end": 4265.74,
    "text": "So either you have an agent always starts with a zero initial velocity, and then basically the model learns that the initial observation has zero velocity and it basically knows how to properly predict",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.576,
    "end": 4285.71,
    "text": " from from the first observation on let's say if you train the model where the agent constantly has a random velocity then it basically learns yeah from the first observation still a lot of options can happen depending on my velocity and the more observations get in you see how the model kinds of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.583,
    "end": 4305.704,
    "text": " um picks up okay this is now my velocity and from then on you see how the the wide range of options collapses to the most uh the most likely ones anything on that ozon well i was just also thinking for example in the robotic planning example we gave",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4306.83,
    "end": 4334.147,
    "text": " um there you also see this spread but then it's more as in that the model learned that at different at similar state values different outcomes are possible so it will try to maybe make the gaussian and the latent speeds a bit wider so that if you sample from it you might get a slightly different sample value and that will then generate the different outcome you want you want to visualize",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4334.943,
    "end": 4351.611,
    "text": " So that's also, so even though the standard normal you're sampling from initially for your reprioritization trick is very as just standard normal, the model can learn to inflate or deflate this distribution so that you get a wider coverage",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4353.668,
    "end": 4375.635,
    "text": " For example, what you also saw in the navigation example is that basically the model, since we train it on pretty short temporal sub-sequences of like I think one or two seconds in real time, so it's not able to have a very consistent prediction for longer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4378.717,
    "end": 4401.136,
    "text": " and also given the fact that every ale in the lab looks very similar it learns the general structure like there are racks left and right and there might be boxes or you saw that kind of the boxes or the stuff in the actually in the racks is kind of very blurry and it's kind of brownish blackish but there's no real",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.219,
    "end": 4418.785,
    "text": " you don't really can identify what is in that wreck for example and it's so it has basically no spatial awareness of where in the wreck where in the ale am i am i at the very end or in the beginning or in the middle it has no idea and that's why you saw if you then say okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.375,
    "end": 4439.814,
    "text": " turn right for a certain amount of time then it will either predict i'm in the middle so the next if i turn 360 it will still be ale after me or i'm at the very end so if i turn around i will see a wall um so it it basically has no um consistent knowledge of of where it is and so the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.875,
    "end": 4446.536,
    "text": " This is basically modeled as kind of noise in the solutions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.596,
    "end": 4455.519,
    "text": "And if you draw different trajectories, it will either think it's at the wall or it's facing the other ale or there's a human passing by.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.559,
    "end": 4459.099,
    "text": "So I see some shady people-like structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.519,
    "end": 4470.062,
    "text": "So all these kind of things are then modeled as kind of noise in your distribution that just appears to be happening there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4472.133,
    "end": 4478.134,
    "text": " makes sense, what might be helpful or required for long-term planning?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4478.294,
    "end": 4495.639,
    "text": "Because the tree that you had with the multiple, I guess bifurcations or whatever they represented, that was very interesting how you had a very fully fleshed out tree and then you showed kind of how you recursed to prune back down to make a policy selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4496.139,
    "end": 4501.32,
    "text": "So as you suggested that exponentially explodes the computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4502.569,
    "end": 4526.267,
    "text": " what might be helpful or how can long-term planning be achieved with reasonable hardware yeah so so the the key thing here is is hierarchical models i think and that's what we're uh we're pushing very hard on now is basically that you given your given a model like we trade now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4527.205,
    "end": 4538.293,
    "text": " You basically put a new model on top of that, that now as observations does not get pixels, but it gets state samples from this model basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4539.162,
    "end": 4566.406,
    "text": " and the the time step now is not to predict the next time step ahead but like to predict 10 times of the head or 20 or whatever or however you want to course green basically and once you're at that point then you have basically a system that can can plan um if you plan 10 time steps you're actually planning 100 time steps for the lower level model and so this way you can keep on course draining that uh you only have to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.226,
    "end": 4589.896,
    "text": " um explore a few policies at each level and then down below again you only have to predict for like one second the apps because the other plan was made for the by the models on top and so this way you can you can easily uh bypass the and scale down the complexity of the planning procedure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.117,
    "end": 4597.963,
    "text": " It reminds me a lot of driving where it will be like, okay, in five streets, take a right turn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4598.363,
    "end": 4601.867,
    "text": "So you're not pre-saging the right turn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4602.367,
    "end": 4604.649,
    "text": "Okay, one, two, three, four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4604.91,
    "end": 4606.031,
    "text": "All right, now I should get ready.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4607.372,
    "end": 4609.254,
    "text": "What about symbolic information?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4609.694,
    "end": 4614.899,
    "text": "Like what if the aisle had a color gradient or if it had one dot, two dot, three dot?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4615.834,
    "end": 4623.078,
    "text": " Could that be learnt in an unsupervised way, a symbol in that pixel-level model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4623.478,
    "end": 4626.4,
    "text": "Or is that where a hierarchical model would come into play?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4628.701,
    "end": 4642.048,
    "text": "Well, I think the problem currently is for us, architecture-wise, our model isn't capable of capturing very low-level details about the environments just because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4642.952,
    "end": 4655.695,
    "text": " We are based on a VA approach and then the mean squared error objective we use for reconstruction and the way we sample is already inhibiting, for example, recognizing dots in your inputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4658.315,
    "end": 4667.957,
    "text": "Maybe, I don't know what Tim thinks about it, but I think color gradients is something like the model might learn if given enough data and incentive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.693,
    "end": 4693.642,
    "text": " Yeah, so I think there's a number of problems with the approach in the sense that we're now doing prediction in pixel space, let's say, and the way you calculate the likelihoods, you evaluate the likelihoods and you calculate the reconstruction error, it basically means that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4694.392,
    "end": 4720.457,
    "text": " you want to have each pixel independently predicted on average quite right which means that if you have very fine grained details it easily ignores these you also have the the complexity term that basically says okay i want to have the the the least complex representation for for reconstruction for reconstruction but this basically also means that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.423,
    "end": 4736.328,
    "text": " depending on how much you put pressure on restricting the complexity, the less information you will actually encode and the more blurrier basically your reconstruction will become.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4736.368,
    "end": 4748.352,
    "text": "So it's very similar to the beta VIE, for those familiar, where you have this beta parameter that attunes how much weight you put on the GAL divergence term versus the reconstruction term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4749.995,
    "end": 4759.324,
    "text": " And this also has an impact on what the model will actually put in the state representation and which details will be ignored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4760.965,
    "end": 4769.874,
    "text": "So yeah, I think a lot of these things are very difficult for the model that's straight now, just because of the way we built and parameterized the likelihood model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.898,
    "end": 4793.876,
    "text": " very interesting um how might somebody go about learning or exploring this like is there a textbook or the citations that are in your paper or hands-on what would you encourage somebody who is curious about this and wanted to over the next maybe few years be following",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4799.56,
    "end": 4799.76,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4799.78,
    "end": 4807.882,
    "text": "I mean, we had a lot of like in the active inference parts, I think when we started out, there wasn't that much information on how to do active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4807.942,
    "end": 4812.324,
    "text": "So we had to figure it out the hard way by trying a lot and failing a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4813.164,
    "end": 4820.226,
    "text": "But now currently I think even in this model stream, there was some cool information and accessible information on active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4821.586,
    "end": 4827.308,
    "text": "So, and I mean, specific implementation wise, if you want to build a model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4829.235,
    "end": 4838.126,
    "text": " like this, I think the current state of the art in RL and active inference, I learned active inference is all pretty similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4838.146,
    "end": 4842.13,
    "text": "Yeah, I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.21,
    "end": 4842.371,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.374,
    "end": 4851.323,
    "text": " A lot of things have changed regarding how accessible the information on active inference has become.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.744,
    "end": 4859.174,
    "text": "If you look now at the tutorial from Ryan Smith, for example, which was also extensively covered in one of your videos,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.694,
    "end": 4878.608,
    "text": " so i think that really really knows the the the entry uh bar to just get to know the theory and how everything works or should work and to play around with some small toy examples and simulations that you can get some insights on on what does this thing do and how does it work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.665,
    "end": 4890.522,
    "text": " the deep learning part, let's say, to build these models, then probably the resources to go to are just like tutorials on variational autoencoders.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.582,
    "end": 4891.263,
    "text": "I think these are the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.7,
    "end": 4899.962,
    "text": " the things in deep learning that are most relevant for the active inference work we discuss here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.462,
    "end": 4914.166,
    "text": "And if you can build a variational autoencoder, and you know how active inference work, and you put the two together, together with some details from our paper, for example, I think it should be pretty straightforward to get to the first working example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.049,
    "end": 4916.369,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4917.289,
    "end": 4929.713,
    "text": "Any closing thoughts or even questions for our lab or just to leave for people to be thinking about as they dream in preparation for action?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4934.755,
    "end": 4935.195,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4936.315,
    "end": 4944.338,
    "text": "Maybe I just want to continue a bit on what Tim said earlier that, for example, if you want to build hierarchical models,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4946.155,
    "end": 4950.038,
    "text": " you don't have to build an active inference model on top of an active inference model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4950.338,
    "end": 4959.445,
    "text": "We did some preliminary experiments on, for example, just using our active inference model as dynamics model for a SLAM algorithm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4960.186,
    "end": 4967.231,
    "text": "And then you also already get hierarchical modeling and some of the long-term benefits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4967.291,
    "end": 4975.578,
    "text": "So maybe that's also interesting to think about is how this active inference model fits in in already existing techniques.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4977.219,
    "end": 4982.012,
    "text": " Yeah, so I think what Ozan wants to say is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4983.454,
    "end": 4992.557,
    "text": " In this case, we use these deep neural nets to parameterize this transition model, likelihood model, and posterior model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.297,
    "end": 4999.399,
    "text": "But you shouldn't always revert automatically to these deep learning techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.419,
    "end": 5003.121,
    "text": "So these are kind of very popular right now and very cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.801,
    "end": 5010.103,
    "text": "But in some cases, it might be sufficient if you know your environments, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5010.743,
    "end": 5013.044,
    "text": " Yeah, you shouldn't bother learning the state space model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.064,
    "end": 5015.804,
    "text": "If you know the state space model, just use it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5017.125,
    "end": 5019.426,
    "text": "I know we used the mountain car example here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.446,
    "end": 5026.387,
    "text": "This would be a good example of why we shouldn't just use the deep learning approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.448,
    "end": 5031.609,
    "text": "This was basically just to have a proof of principle for us to get some simple example working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5033.189,
    "end": 5053.872,
    "text": " off i think if you have like these real high dimensional observations uh and you don't you have no clue how to parameterize your state space model but it's not that this is like the the default way to go let's say and we're also like kind of evolving especially uh if you move to these hierarchical models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.597,
    "end": 5065.242,
    "text": " that we're kind of looking at how can we make a more kind of discrete style parameterized state-based model on top where we basically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.389,
    "end": 5074.194,
    "text": " try to put the whole state space into discrete parts and then have a simple transition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.695,
    "end": 5077.036,
    "text": "You gave the example yourself, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.116,
    "end": 5091.047,
    "text": "If you think about navigating yourself, you're not thinking about predicting all the pixels of all the houses, but you just think about, I need to go forward now, and then the second street to the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5091.127,
    "end": 5092.268,
    "text": "So you basically chunk up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5092.768,
    "end": 5105.012,
    "text": " the whole continuously state space into some relevant parts and then your transition model also becomes like a very simple matrix with transition probabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.572,
    "end": 5121.077,
    "text": "So I think the future is in hierarchical models and the future is in a mixture of some learned parts but also some very discretized intuitively comprehensible parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5122.725,
    "end": 5124.727,
    "text": " Just two points on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5125.288,
    "end": 5132.055,
    "text": "One is something that's always drawn me to Active Inference is that it's inference conditioned and about action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5132.716,
    "end": 5138.321,
    "text": "So you're not going for that 4K Google Street View, what does every house look like?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5139.002,
    "end": 5144.224,
    "text": " And again, when that's the input data, even if you have a generative model, that's the output data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5144.644,
    "end": 5151.586,
    "text": "So active inference is a really principled way to just sort of reduce what you're predicting to like, which way should my elbow move?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5152.026,
    "end": 5160.389,
    "text": "Not what will the pixels look like when my elbow moves, which may be just taking gigabytes of data, but if it's just reduced to the state space,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5161.289,
    "end": 5162.59,
    "text": " then it's easier to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5162.61,
    "end": 5175.061,
    "text": "And that's why it was such an interesting contribution with your paper to actually learn that state space in the context of high resolution and real time and heterogeneous sensors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5175.521,
    "end": 5185.55,
    "text": "And then also it's something that we've seen many perspectives on in the lab and in these discussions is there's the philosophical discussion map and territory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5185.83,
    "end": 5187.752,
    "text": "Who's really an active inference agent?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5187.832,
    "end": 5187.992,
    "text": "Is it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5188.152,
    "end": 5203.492,
    "text": " everything a dust particle bacteria you know is the world built this way and then there's this sort of engineering approach where you have your preferences for how you want to see the robot work and then whatever you can tinker and cobble together",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5204.966,
    "end": 5210.21,
    "text": " that satisfies you and it reduced your uncertainty about performing the task you're trying to perform.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5210.67,
    "end": 5218.916,
    "text": "So it's sort of sidesteps, but then it sidesteps those questions in a way that actually brings us to a higher level of understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5218.996,
    "end": 5230.185,
    "text": "Because I know that many listeners who are not as advanced in the machine learning will be inspired and have qualitative thoughts based upon what you brought here today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5230.965,
    "end": 5235.286,
    "text": " So thanks again for this awesome presentation and conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5235.807,
    "end": 5239.328,
    "text": "And we'll always appreciate hearing any follow-up whenever the time is right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5241.228,
    "end": 5241.448,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.488,
    "end": 5242.909,
    "text": "Thank you, Daniel, for having us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5243.489,
    "end": 5244.509,
    "text": "It was really nice discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5245.33,
    "end": 5245.59,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5246.37,
    "end": 5246.63,
    "text": "Peace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5247.01,
    "end": 5247.37,
    "text": "See you later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5248.311,
    "end": 5248.651,
    "text": "See ya.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5248.711,
    "end": 5248.911,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5249.151,
    "end": 5249.311,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]