[
  {
    "start": 7.591,
    "end": 8.432,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.033,
    "end": 11.596,
    "text": "This is Active Inference Model Stream 16.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.678,
    "end": 14.48,
    "text": "It's December 6th, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 14.56,
    "end": 22.49,
    "text": "We're here with Eli Sinesh and Tomaso Salvatore discussing Divide and Conquer Predictive Coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.811,
    "end": 25.114,
    "text": "So thank you both for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 25.955,
    "end": 27.417,
    "text": "Eli, to you for the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.279,
    "end": 29.9,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.92,
    "end": 31.422,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.853,
    "end": 40.444,
    "text": " I recall being here once before, presenting that old paper, Interoceptionist Modeling Allostasis as Control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.504,
    "end": 52.662,
    "text": "And I think at the time I even mentioned that there wasn't really an inference algorithm that I could just go and apply to all of these kinds of active inference and predictive coding problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.923,
    "end": 62.016,
    "text": "And over roughly the last year, let's say, we've started work, this whole team of myself,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 62.148,
    "end": 71.498,
    "text": " Hao Wu, who is unfortunately not on the stream due to having a 9 to 5, and Tommaso Salvatore, who's here with us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 72.679,
    "end": 74.581,
    "text": "We've actually been working on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 75.743,
    "end": 84.032,
    "text": "How would we take these theories and this predictive coding idea and just turn it into a Bayesian inference algorithm you can use for stuff?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.354,
    "end": 89.978,
    "text": "So as background, to really refresh ourselves,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.38,
    "end": 93.085,
    "text": " This is the super short, you know, NeurIPS version of our talk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 95.088,
    "end": 104.685,
    "text": "You know, there's like basically theoretical neuroscience, neuro AI, or now, I don't know, Tommaso, like what keyword do you guys use it versus?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 104.926,
    "end": 106.028,
    "text": "I should have asked you maybe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 106.048,
    "end": 112.138,
    "text": "We do use neuro AI actually, bioplausible deep learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.22,
    "end": 115.324,
    "text": "That's a sentence I often use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.755,
    "end": 121.182,
    "text": " I think that dates back from even before my versus times, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.724,
    "end": 133.62,
    "text": "Yeah, so the broad theory is that predictive coding sort of solves two tasks for the brain, and that's credit assignment and Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 136.304,
    "end": 140.471,
    "text": "Now, predictive coding is also a thing in machine learning now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 141.132,
    "end": 143.135,
    "text": "They do a lot of it at versus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.235,
    "end": 145.378,
    "text": "Tommaso's done a bunch with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.08,
    "end": 158.271,
    "text": " But it doesn't always, for various reasons we can go into, it sometimes doesn't always scale as well as back prop, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 158.312,
    "end": 172.446,
    "text": "And so we basically started over again, I guess you could say, with the concept of predictive coding to build our divide and conquer PC algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.185,
    "end": 178.995,
    "text": " And we basically find that you can use this at roughly the same scale you would with VAEs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 183.483,
    "end": 190.035,
    "text": "So of course, in order to test it out, we had this deep latent Gaussian model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 190.095,
    "end": 197.809,
    "text": "It's actually the same one from, I think, the Monte Carlo predictive coding paper out this year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.97,
    "end": 222.803,
    "text": " We really did this a lot, like, leaning on, you know, comparing to other predictive coding papers rather than to some arbitrary baseline, because, you know, we figured, if we pitch this as being about bioplausibility, then we can sort of maybe actually get results that are good enough to publish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.167,
    "end": 227.61,
    "text": "Anyway, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.945,
    "end": 253.142,
    "text": " so you know we racked up our first win there you know we went into other algorithms that were related or inspired us really",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.43,
    "end": 285.778,
    "text": " actually interesting is you know basically we would say all right you have yeah oh um you know after you know demonstrating that this quote unquote wins like okay it works well enough the which",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.973,
    "end": 293.215,
    "text": " Oh, this entire slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.255,
    "end": 293.475,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.595,
    "end": 296.058,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 296.078,
    "end": 296.918,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 296.938,
    "end": 303.845,
    "text": "So our DCPC, in addition to being a predictive coding algorithm, is a particle algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.766,
    "end": 311.752,
    "text": "So it's training a particle cloud, so to speak, to approximate the posterior distribution in a Bayesian inference problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 312.933,
    "end": 318.178,
    "text": "So as such, we compared it to this algorithm particle gradient descent, PGD,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 318.597,
    "end": 342.664,
    "text": " which we were drawing pretty direct inspiration and then we also compared it to you know langevin predictive coding out at icml this year and so we compared on you know the fresh at inception distance that people use in deep learning rather than on you know the um variational bound to the surprise",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 344.517,
    "end": 353.891,
    "text": " You know, we didn't compare on log evidence because that's, you know, you can often get very bad visual samples from a model that has a very good log evidence, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 353.951,
    "end": 366.689,
    "text": "So in order to, you know, sort of say, like, okay, that, you know, log evidence is not the only thing that counts, we, you know, compared on this fresh at inception distance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 368.131,
    "end": 374.22,
    "text": "Over here, we've got some samples from our pseudo-posterior predictive distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 375.196,
    "end": 379.888,
    "text": " So it's a proper predictive distribution, but constructed from a pseudo-posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.928,
    "end": 392.158,
    "text": "Pseudo in the sense that we're fitting, I think, a small Gaussian mixture model to our big particle cloud of the actual posterior distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 393.083,
    "end": 406.18,
    "text": " And then having done that, we say, all right, now we'll draw samples from this GMM as a pseudoposterior, then pass those latents through the generative model again to generate samples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.344,
    "end": 416.113,
    "text": "And the actual neural architecture here is basically a one-level VAE.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.735,
    "end": 419.918,
    "text": "You just chop off the encoder.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 420.235,
    "end": 438.868,
    "text": " from a one-level VAE that would be used in these baseline papers, use the same neural architecture in PyTorch, and then basically just got slightly better results visually by just improving the inference algorithm and the training.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 448.889,
    "end": 451.052,
    "text": " Okay, did you manage not to lose that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 452.394,
    "end": 452.574,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 454.377,
    "end": 462.269,
    "text": "Okay, so sort of the interesting stuff about it, you know, especially compared to previous work, is how this actually works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.471,
    "end": 467.356,
    "text": "As I said, it's a particle algorithm, so we're actually drawing samples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.117,
    "end": 473.646,
    "text": "I think I said before we went live, you know, this is sort of the year of Monte Carlo predictive coding methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 474.647,
    "end": 478.052,
    "text": "We're one of maybe, you know, three or four that are out this year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 479.855,
    "end": 495.759,
    "text": " So after you've initialized your graphical model by just doing ancestor sampling to get yourself some initial cloud, what you can do during every inference pass is start from the bottom up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.061,
    "end": 502.69,
    "text": "So that's the right over here would be the quote unquote bottom of the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 504.222,
    "end": 529.116,
    "text": " can calculate you know your prediction errors which are the same kind of thing as in previous predictive coding work you know there's score functions with respect to the latent variable and the thing that we actually do differently from other work is that rather than just taking like a score function as a local gradient of the event of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 531.138,
    "end": 553.45,
    "text": " let's say rather than taking a score function as like a direct gradient of the variational free energy we take score functions with respect to the log complete conditional distribution so like a coordinate update distribution if you have you know this variable z1",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 553.683,
    "end": 561.231,
    "text": " then its complete conditional is the distribution of this variable Z1 given its entire Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 562.873,
    "end": 570.361,
    "text": "So given both the predictions coming in from above it and the observations coming in from below.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.203,
    "end": 582.795,
    "text": "So that's why rather than one error unit here, we have an error unit that connects Z1 to the observation below it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 583.771,
    "end": 596.923,
    "text": " We also have an error unit that sort of recurrently tries to draw Z1 back towards its local prior until that prior is changed by an update at Z2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.15,
    "end": 613.018,
    "text": "But if you think about how Bayesian inference works, Bayesian inference is just what you get when you have one distribution and it has to be normalized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 613.741,
    "end": 634.483,
    "text": " but you're trying to fit it as closely as you can to both the likelihood and the prior at the same time and so when you try to do that locally within a big structured graphical model you know the logical posterior to go after is the complete conditional and that's what we actually did",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 635.375,
    "end": 657.675,
    "text": " And I want to shout out Hal here because he's not on the stream, but his previous work on amortized population Gibbs samplers is really what showed that this kind of sampling from the complete conditionals could work at scale and inspired this project pretty directly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 657.715,
    "end": 664.521,
    "text": "This is kind of follow-up work to his paper on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.943,
    "end": 684.123,
    "text": " And the way that we sort of make this work in terms of constructing a free energy or in terms of making sure we target the correct joint distribution is that we can use Langevin proposals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 686.747,
    "end": 696.499,
    "text": "If you have a prediction error from E sub zero and another E down sub one, add them together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.58,
    "end": 700.205,
    "text": " you have the gradient of the log complete conditional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.245,
    "end": 715.584,
    "text": "Now it's the log unnormalized complete conditional, but that's fine because, you know, the gradient doesn't like, you know, when you take a gradient of a log density, the normalizing constant falls out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 716.785,
    "end": 724.495,
    "text": "And so you can target that with, you know, a Langevin dynamics proposal, which just says, take your previous prediction,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.483,
    "end": 736.976,
    "text": " you know, multiply your prediction error by a learning rate, add the prediction error to the previous prediction, and then add some Gaussian noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.898,
    "end": 746.988,
    "text": "You know, you have to balance like the, you have to balance the magnitude of the Gaussian noise with the learning rate in a certain way, but like that's a detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.869,
    "end": 755.258,
    "text": "Really it's saying let's be in the latent space, then let's follow the gradient, and then let's inject a little bit of noise so we explore most of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.503,
    "end": 784.401,
    "text": " rather sorry so we explore some of the time while exploiting whenever the gradient signal is strong enough and then you know i note that we use sequential monte carlo here and what that's actually for is that sequential monte carlo algorithms give you a whole set of rules for how you can start from you know the proposal that you sample from then go to the local target",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 784.988,
    "end": 800.254,
    "text": " that you are actually trying to sample from, and then combine those in a neat way to get samples from the complete joint distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.396,
    "end": 808.228,
    "text": "So you would start here from the data on the right, do this predictive coding step for Z1,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 809.137,
    "end": 831.317,
    "text": " be done with it, repeat the same predictive coding step for Z2, but now with a new prediction error from Z1 down here, repeat all the way up here, and then you have a bunch of samples from different complete conditionals, and you have to come up with some way to say, well, what's my free energy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.337,
    "end": 835.381,
    "text": "Or in SMC terms, what's my importance weight?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 836.362,
    "end": 837.743,
    "text": "And that's really where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.377,
    "end": 845.724,
    "text": " you know, that's really where like the SMC technique becomes helpful is for proving the whole thing is correct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.166,
    "end": 857.797,
    "text": "So if you think, you know, we named it divide and conquer because, you know, what we're essentially doing is we divide the graphical model into these complete conditional units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 859.039,
    "end": 866.667,
    "text": "Then we conquer each of them with, you know, basically a Monte Carlo predictive coding proposal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.672,
    "end": 871.716,
    "text": " And then we conquer the whole thing by recombining them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.879,
    "end": 877.503,
    "text": "So it really is like a divide and conquer algorithm in the classic sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 879.345,
    "end": 883.811,
    "text": "Also, the reviewers wanted us to name it something clearer than the old name.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.312,
    "end": 887.596,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 887.716,
    "end": 892.562,
    "text": "So then, you know, that's a summary of the talk, really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.762,
    "end": 898.189,
    "text": "And then we can go into like details of the paper and, you know, anything else we want to talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.262,
    "end": 915.69,
    "text": " But broadly, the idea here is that predictive coding as a theory enjoys biological plausibility for approximate Bayesian inference, which is actually this really hard task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 915.89,
    "end": 920.599,
    "text": "In deep learning world, people use all of these awkward neural network",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.203,
    "end": 950.535,
    "text": " arrangements to try and amortize inference and then the people who are real purists are just doing markov chain monte carlo because amortized inference isn't good enough for them and to be fair it's often not very good if you don't you know structure your amortized posterior like just so and more to the point in neuroscience you know like predictive coding theories",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.819,
    "end": 973.789,
    "text": " have often been you know built on like mean field assumptions about the approximate posterior so then you just have a coordinate wise representation of the approximate posterior and it's pretty well known that like this can't actually get you a very close approximation to a correlated structured posterior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 977.11,
    "end": 978.593,
    "text": " So that was where the trouble was.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.653,
    "end": 983.501,
    "text": "That was the problem that we took a first step on solving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.521,
    "end": 993.699,
    "text": "And we got it to work well enough that you can substitute it for neural networks in some of these cases where people use neural networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 994.821,
    "end": 1000.03,
    "text": "And we're going to be at the poster session next Friday at NeurIPS if anyone wants to come and talk to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.625,
    "end": 1007.009,
    "text": " You know, and of course, we have to mention the places that we work and our affiliations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1012.674,
    "end": 1012.874,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.894,
    "end": 1013.895,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.915,
    "end": 1014.355,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.176,
    "end": 1015.617,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.377,
    "end": 1018.099,
    "text": "I'll stop the screen share.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.16,
    "end": 1021.041,
    "text": "Yeah, I'll ask some questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.101,
    "end": 1024.985,
    "text": "And if anyone in the live chat has questions, they can write.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1025.345,
    "end": 1030.229,
    "text": "Maybe just starting with the structured part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.53,
    "end": 1031.991,
    "text": "What do you mean that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.114,
    "end": 1035.777,
    "text": " It's a structured problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.403,
    "end": 1038.904,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1039.004,
    "end": 1055.498,
    "text": "So, like, this is the experiment, you know, originally, I looked at this and said, well, how do we actually replicate how's results from amortized population Gibbs, and that was like a full on time series model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1055.815,
    "end": 1083.865,
    "text": " in which there were you know like some local variables that were updated at each time step but also some global random variables that were standing you know at the hierarchical level above so you know that was really like I thought okay we need to tackle these kinds of structured problems because you know if you I mean go look at I'm trying to think like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1084.402,
    "end": 1090.091,
    "text": " You know, honestly, most of the time, most interesting generative models are going to be kind of structured.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1091.293,
    "end": 1113.126,
    "text": "If there's more than one latent variable, and it's not just IID sampling, so any kind of hierarchical Bayes, you know, time series structure, dynamical system structure, like all of this stuff that you find in cognitive science and neuroscience, so, so commonly,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1114.591,
    "end": 1127.267,
    "text": " And yet, which is often, you know, we've often sort of given up on doing anything better than particle filtering or amortized inference if you look in the machine learning world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1131.28,
    "end": 1161.034,
    "text": " okay and the graphical structure you showed was a linear hierarchical model or it was going from side to side but that's just graphical convention so do you ever need to account for branching or any other kinds of structures or how do you divide and conquer when there's also splitting and merging so i mentioned about markov blankets right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.807,
    "end": 1169.259,
    "text": " As long as you're in a directed acyclic graphical model, then there's still a notion of a Markov blanket for every single random variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1169.9,
    "end": 1180.296,
    "text": "That's the thing that you divide the graphical model into, is variables with their Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1180.316,
    "end": 1184.963,
    "text": "And this is sort of intended to be a bit free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1189.263,
    "end": 1194.227,
    "text": " perhaps bringing the notebook up would help",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.102,
    "end": 1198.565,
    "text": " I'll ask the two questions, so return to them as you see fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1198.625,
    "end": 1201.969,
    "text": "The first is, how do you specify the model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.449,
    "end": 1207.694,
    "text": "What does it look like before training and what does get updated during training?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.355,
    "end": 1222.088,
    "text": "And the second question is, how do you take that step as a modeler between the structure of a given problem, like the handwriting digits and adapting that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.253,
    "end": 1241.95,
    "text": " to what is that something more generic or does that graph need to already from some other source have structure that's amenable to the target",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.545,
    "end": 1255.153,
    "text": " So the target density that we would try to sample from is defined by the graphical model structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.976,
    "end": 1259.319,
    "text": "And yeah, that has to come from somewhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.359,
    "end": 1270.773,
    "text": "So conventionally, if you're doing machine learning engineering, then that's sort of up to your choice as the user of our algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1272.055,
    "end": 1276.02,
    "text": "It depends on what domain knowledge you have about your application.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1276.996,
    "end": 1301.957,
    "text": " and if we were talking about brains then that structure of the generative model is something that evolved you know and there could be you know and I should mention you know the recent verses work like of course you can also have you know structure learning problems you know throughout like development but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.047,
    "end": 1307.431,
    "text": " throughout development and through certain behavioral tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.773,
    "end": 1313.096,
    "text": "But that gets you a bit beyond the realm of just graphical models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1313.437,
    "end": 1320.604,
    "text": "And so we basically aimed at just a given graphical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1321.465,
    "end": 1324.849,
    "text": "Take a graphical model as given and try to do inference in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.97,
    "end": 1328.072,
    "text": "You can work your way up to the harder stuff later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1328.132,
    "end": 1332.957,
    "text": "In practice, we often use deep neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.325,
    "end": 1336.15,
    "text": " because we tried to replicate the experiments of other papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.531,
    "end": 1339.656,
    "text": "So we had multilayers and the convolutional models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.925,
    "end": 1348.992,
    "text": "Yeah, maybe share the notebook and or the repo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1349.734,
    "end": 1350.675,
    "text": "Working out, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.737,
    "end": 1356.345,
    "text": "Oh, the GitHub repo is like, yeah, we can share that pretty easily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1363.801,
    "end": 1367.545,
    "text": " I'm going to put this first in the Zoom chat, then share my screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.477,
    "end": 1386.244,
    "text": "Yeah, so in the GitHub repo, we try, we attempt.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1388.186,
    "end": 1389.567,
    "text": "Just zoom in a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1389.667,
    "end": 1391.449,
    "text": "That's actually, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1391.609,
    "end": 1393.011,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.031,
    "end": 1393.251,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.665,
    "end": 1404.077,
    "text": " So in the GitHub repo minus a requirements file, we try to share enough that you could hypothetically download and run this like just from your command line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1405.98,
    "end": 1412.108,
    "text": "You would need, you know, a Python environment that's got the necessary stuff installed, but all of that is standard stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1413.79,
    "end": 1420.639,
    "text": "So if you wanted to just rerun the MNIST experiment, you would literally run this command on your command line.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1421.716,
    "end": 1425.541,
    "text": " And then you could also start your tensor board and watch it train.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.601,
    "end": 1441.202,
    "text": "Then we include evaluation notebooks that basically would help you to replicate the figures from the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1445.507,
    "end": 1447.47,
    "text": "And yeah, we actually have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1451.585,
    "end": 1456.873,
    "text": " Yeah, we also share some pre-trained weights and particles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1458.996,
    "end": 1464.904,
    "text": "I know that's probably a bit of a colliding name with weights and biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.307,
    "end": 1468.81,
    "text": "In this case, the weights include the biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.85,
    "end": 1478.284,
    "text": "Weights would mean neural network weights, and then particles would mean the frozen samples from the posterior distribution for random variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1482.584,
    "end": 1488.213,
    "text": " And then, of course, we just give, you know, the paper or sorry, the table of results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1490.677,
    "end": 1505.721,
    "text": "And as a small bonus to everyone else who has to try and replicate our results, we include an implementation of the discretized Gaussian distribution, which is otherwise like buried in the diffusion models literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1505.761,
    "end": 1508.085,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1511.423,
    "end": 1519.132,
    "text": " Yeah, and it's under MIT license, so you can pretty much go ahead and fork this, contribute that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1520.553,
    "end": 1530.104,
    "text": "It's in the universal probabilistic programming language, Pyro, since that's basically the largest deep probabilistic programming language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.486,
    "end": 1533.248,
    "text": "Let's take a look at some of the notebooks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.249,
    "end": 1535.17,
    "text": "Let's see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1537.715,
    "end": 1539.777,
    "text": " That one's going to look like garbage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.058,
    "end": 1542.94,
    "text": "This one's going to look like not garbage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1549.487,
    "end": 1549.747,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1549.907,
    "end": 1567.485,
    "text": "So what this does is, you know, it's basically like PyTorch and PyTorch lightning, you know, so you're going to like read some JSON file and that's going to give you, you know, your data, your model and your trainer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1569.676,
    "end": 1575.641,
    "text": " then you're going to remind the trainer to just load the weights and particles from a checkpoint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1577.223,
    "end": 1581.146,
    "text": "The random variables are saved as part of the PyTorch light and checkpoints.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1584.75,
    "end": 1587.412,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.432,
    "end": 1589.994,
    "text": "It loads them, blah, blah, blah, blah, blah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1590.775,
    "end": 1598.502,
    "text": "Right there when it says 357,000 trainable parameters, what is that number coming from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.393,
    "end": 1601.535,
    "text": " That is the number of neural network weight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.635,
    "end": 1605.84,
    "text": "Like that's the number of float 64s in the neural network weights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1607.721,
    "end": 1611.445,
    "text": "So that's actually a relatively small number because this was sort of a toy problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1611.465,
    "end": 1615.269,
    "text": "And normally it would be more in the millions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.852,
    "end": 1623.337,
    "text": "And where were those combinatorics specified?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.781,
    "end": 1628.843,
    "text": "Right here in the architecture specification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.548,
    "end": 1634.63,
    "text": " That's after it, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.254,
    "end": 1639.618,
    "text": "Yeah, because you have to load the thing to print the thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1641.742,
    "end": 1642.163,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1642.183,
    "end": 1644.026,
    "text": "That's just printing it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.046,
    "end": 1647.853,
    "text": "But you specified it elsewhere, what the structure would actually be, loaded it in, printed it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.933,
    "end": 1651.258,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.278,
    "end": 1657.429,
    "text": "Yeah, the JSON file tells you which modules in the Python code you have to load and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.598,
    "end": 1684.007,
    "text": " So if we go look at what is the actual training file that we were loading here, it tells you load this model module, pass it these hyperparams, checkpoint this often, load this data set with this hyperparameter and batch size.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1686.721,
    "end": 1709.05,
    "text": " you know here's like learning rates and the number of particles you know the number of sweeps meaning like passes over the graphical model you know that you do per training step yeah this is like a relatively standard deep learning type stuff",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.379,
    "end": 1717.445,
    "text": " Yeah, and when we've loaded the architecture, we actually print it out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.57,
    "end": 1723.396,
    "text": "So it's a simple isotropic Gaussian prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1723.436,
    "end": 1737.602,
    "text": "And then we're running it through a linear layer, an activation function, a deconvolution layer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.882,
    "end": 1764.67,
    "text": " some batch you know the then you know each layer includes batch normalization you know two more convolutional layers with their batch normalization and non-linearity two more convolutional layers again and then finally a deconvolutional layer that gives you the correct image size and channel number",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.007,
    "end": 1772.788,
    "text": " Well, that's rude.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1777.836,
    "end": 1794.403,
    "text": "Anyway, yeah, so then we have this method we call load particles, which just tells you that's really for loading the particles into GPU memory, once you know which data items you're testing on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1796.948,
    "end": 1818.692,
    "text": " again like relatively standard deep learning stuff, then here we say we're going to open a Python context handler by clamping the graphical model to the pre-trained particles that we loaded from disk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1821.656,
    "end": 1823.698,
    "text": "So if you load your",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1824.269,
    "end": 1826.431,
    "text": " posterior particle cloud from disk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1827.172,
    "end": 1830.756,
    "text": "Then you have to say to the graphical model, I'm testing right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1830.816,
    "end": 1832.839,
    "text": "Don't do any additional inference steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.919,
    "end": 1837.764,
    "text": "Just use these samples as your distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1840.687,
    "end": 1841.428,
    "text": "So then we run.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1841.488,
    "end": 1847.815,
    "text": "We average over particles to get our reconstructions of training images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1847.875,
    "end": 1851.019,
    "text": "Now we're going to plot them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1853.007,
    "end": 1882.305,
    "text": " here's the actual reconstructions so like they're you know kind of blurry like you expect from a VAE but it shows that you know things did actually work then you say okay I don't want to look at reconstructions of training images you know I want to know do I have a trained generative model so you clear all that stuff out and you're going to get",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.332,
    "end": 1896.988,
    "text": " all of the training and validation particles from disk for fitting your pseudoposterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1897.048,
    "end": 1902.274,
    "text": "And you're going to predict some new images using the pseudoposterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.315,
    "end": 1911.145,
    "text": "Then lo and behold, you plot out the samples from the pseudoposterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.711,
    "end": 1942.617,
    "text": " kind of blurry and they're not as varied as you would sort of like them to be but that is what happens when you have a very simple generative model like you know if you go back to this neural architecture here this is nothing like a state-of-the-art you know diffusion model or whatever that you would use for image generation it's really just a bunch of neural layers stuck together mapping a latent variable to an observation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1945.786,
    "end": 1960.519,
    "text": " Yeah, and then we're gonna, you know, having generated those, we go through, we calculate, you know, some metrics across the validation data under a series of different random seeds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.581,
    "end": 1974.392,
    "text": "We can also sample from the prior rather than the pseudo-posterior, and that gives us lower visual quality, but more variation, more realistic variation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.667,
    "end": 1980.693,
    "text": " And then, you know, we calculate the statistics that we reported in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1989.107,
    "end": 1992.452,
    "text": "Plus some statistics we don't report in the paper now that I think of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.797,
    "end": 1997.901,
    "text": "Like the effective sample size.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1997.941,
    "end": 2000.565,
    "text": "That one's a good one for inference nerds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2001.811,
    "end": 2013.588,
    "text": " You divide that by the number of particles you're using, and it gives you a sort of percentage that tells you how well are you actually fitting the true posterior distribution with this batch of samples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2015.371,
    "end": 2021.119,
    "text": "And in our case, the answer is, yeah, about 92% effective samples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2027.275,
    "end": 2027.635,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.956,
    "end": 2032.602,
    "text": "Maybe could we walk through a similar logic for the MNIST handwriting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.024,
    "end": 2034.645,
    "text": "Yeah, totally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2035.386,
    "end": 2036.047,
    "text": "Let's see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2036.067,
    "end": 2042.155,
    "text": "I think it would be almost equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.175,
    "end": 2043.597,
    "text": "It's just that we use a different model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.884,
    "end": 2056.995,
    "text": "Yeah, it's pretty much the same, but with, you'll notice there's quote unquote three decoders here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2058.089,
    "end": 2065.599,
    "text": " So each of these is actually performing a random Gaussian sampling step in between.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2065.76,
    "end": 2068.604,
    "text": "So this is a proper hierarchical Bayesian problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2073.39,
    "end": 2074.292,
    "text": "So you have a prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2074.332,
    "end": 2080.16,
    "text": "Then you have a forward conditional and a forward conditional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2080.981,
    "end": 2083.304,
    "text": "So you have three levels of latent variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.746,
    "end": 2086.729,
    "text": "And then finally, you have your likelihood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.712,
    "end": 2096.937,
    "text": " What leads you to use those here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.538,
    "end": 2102.727,
    "text": "Like do you sweep or scan over two, three, four layers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.867,
    "end": 2106.933,
    "text": "Do you explore out features equals other multipliers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.755,
    "end": 2114.185,
    "text": "Or what led you to this specification for the Lightning DCPC?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.152,
    "end": 2132.194,
    "text": " So in this case, we took this exact specification from Monte Carlo predictive coding, which is over here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2136.461,
    "end": 2141.488,
    "text": "So we wanted to compare inference algorithms head to head.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2142.869,
    "end": 2149.683,
    "text": " So we picked exactly the same generative model structure and replicated it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2153.45,
    "end": 2153.831,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.851,
    "end": 2162.989,
    "text": "Yeah, that makes a lot of sense and it helps with the continuity and isolating the inference algorithmic component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.711,
    "end": 2164.472,
    "text": "Is there a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.055,
    "end": 2194.29,
    "text": " in a methods or a procedural step anywhere other than these or or all that are needed these json configs and the notebooks like this so this is runnable like this should be runnable if you actually just download it and you know if you download it and follow the links to download you know the pre-trained weights put them in the path that the notebook expects here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.62,
    "end": 2197.262,
    "text": " then you should just be able to run this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2197.683,
    "end": 2198.684,
    "text": "It should be point and click.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.427,
    "end": 2206.896,
    "text": "I say should because, you know, like I've tried it, but I've tried it once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2210.001,
    "end": 2210.301,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.562,
    "end": 2213.266,
    "text": "Definitely opportunities for people to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.326,
    "end": 2217.251,
    "text": "And then what about the training step?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.596,
    "end": 2225.323,
    "text": "So that would be done from the command line as the repo readme tells us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.582,
    "end": 2234.034,
    "text": " That's this step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.054,
    "end": 2239.585,
    "text": "And you watch on TensorBoard and make a manual call based on diagnostics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.966,
    "end": 2242.611,
    "text": "Or how else do you determine?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2242.631,
    "end": 2249.404,
    "text": "I mean, I would generally say let it run, at least for these experiments, let it run to completion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2251.477,
    "end": 2267.835,
    "text": " Like, you know, I know that if I'm stopping something partway in because of the diagnostics I see on TensorFlow, you know, like, for instance, a very noisy, staticky, like, loss curve, well, that's how I know when it's not working.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.458,
    "end": 2276.064,
    "text": "You know, the experiments that are mentioned in the paper are actually, you know, known to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.485,
    "end": 2279.408,
    "text": "Like, you can just leave that running until it's done,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2279.658,
    "end": 2286.747,
    "text": " and you will get, subject to differences in your random number generator, more or less the result we got in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2291.733,
    "end": 2306.391,
    "text": "I actually want to say this is one of the nice things about the culture of machine learning these days, is that everything is really expected to be not just replicable, but idiot-proof replicable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2307.164,
    "end": 2313.642,
    "text": " As in, if you cannot just run this by rote and get the same result, then reviewers don't believe the result is real.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2316.269,
    "end": 2320.802,
    "text": "Which is very much for replicability of science the way it actually should be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2327.735,
    "end": 2330.899,
    "text": " So we looked at faces and digits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.24,
    "end": 2340.071,
    "text": "Let's say somebody were looking at another kind of image classification problem, cats and dogs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.091,
    "end": 2343.175,
    "text": "So what would need to be adapted?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.235,
    "end": 2350.344,
    "text": "What kind of data would be in for the training step?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.045,
    "end": 2357.674,
    "text": "And then to what extent do these same lightning DCPC specs structures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.072,
    "end": 2365.781,
    "text": " work or to what extent do the first or the secondary layers need to be adapted to alternative cases?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.784,
    "end": 2379.74,
    "text": "So this thing that gets called a graph inside the Lightning DCPC, you'd have to write a new one of these classes for a new problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2380.721,
    "end": 2386.429,
    "text": "So let's say, for instance, that you want to do semi-supervised Bayesian learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2386.763,
    "end": 2390.049,
    "text": " My old advisor from my PhD had a paper about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2391.651,
    "end": 2400.206,
    "text": "So if you're doing, say, cats or dogs, then you're going to want to specify a new graphical structure that's rooted in a prior over your latent embedding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2400.246,
    "end": 2405.515,
    "text": "And then it should have a pair of likelihoods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2407.486,
    "end": 2437.037,
    "text": " essentially you know one being to the class label which is going to be it's semi-supervised so let's say you only get class labels on about half the samples and the other is going to be you know for the actual image which is going to be fully observed you know and then after writing what is it a um a high torch lightning data module for your data set",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2438.215,
    "end": 2465.505,
    "text": " which like tells you you know when which sorry it handles figuring out which data points are semi are supervised versus unsupervised because it's a semi-supervised problem and then yeah you would put that together and run it more or less you know you would write another little json file and just run it and hopefully you would get",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2466.7,
    "end": 2484.376,
    "text": " hopefully if your architecture for the generative model is rich enough, then your latent embedding space should begin to capture differences between the supervised classes and give you good prediction on classification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.416,
    "end": 2496.707,
    "text": "And then if you wanted to do classification style testing or evaluation, you would present a whole new image as the observation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2497.632,
    "end": 2519.877,
    "text": " then just perform joint Bayesian inference on both the latent embedding and the class label and then check that your class labels are good so to speak you know for an unobserved class label you're not getting a one hot vector you're getting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.447,
    "end": 2529.023,
    "text": " you know, a series of logits or like an element on the simplex that specifies probabilities of class membership.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2529.424,
    "end": 2533.431,
    "text": "So, hence my saying good rather than absolutely correct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2535.155,
    "end": 2539.062,
    "text": "You never get a completely absolute yes-no answer out of a classifier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2541.847,
    "end": 2543.35,
    "text": "At test time, at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.443,
    "end": 2549.307,
    "text": " I think in general, you could also generalize it to different kinds of data types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.327,
    "end": 2553.311,
    "text": "So it does not have to be, for example, continuous data as images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.091,
    "end": 2559.296,
    "text": "You could generate discrete distribution, or you can also generate time series distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.676,
    "end": 2566.202,
    "text": "This is something that has not been tested in this paper, but in theory, the theoretical framework would allow to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2567.503,
    "end": 2573.488,
    "text": "Yeah, like we have an appendix in the paper that extends the math to discrete distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2576.523,
    "end": 2581.359,
    "text": " That does take a mathematical extension, and then that would take some more coding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.603,
    "end": 2585.773,
    "text": "So we don't make any promises there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2589.027,
    "end": 2616.098,
    "text": " so in in past dreams and and journeys eli as you mentioned we discussed with dean and others the anticipatory allostasis and then tomaso we discussed the causal modeling so where would you triangulate this work or how do you see it as sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.799,
    "end": 2630.796,
    "text": " drawing on or complementing or or not but just interesting that it's it's not a homeostatic model often in the organismal ethological active inference there's a lot of focus on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.721,
    "end": 2660.023,
    "text": " organismal behavior in these kinds of topics homeostasis allostasis being critical there and then in the bayesian modeling space often there's a focus on the interpretability of smaller models and carving nature at the joints and all of that not this more machine learning sort of specify it in a sequence of convolutional layers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.134,
    "end": 2679.373,
    "text": " So how do you see all, just having worked on those different areas, how do each of you see, because clearly this is a relevant contribution and advance, so in what direction or how do you relate it with those prior pieces?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.535,
    "end": 2685.499,
    "text": "I think it depends in which direction you want to push this work a little bit forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.86,
    "end": 2688.002,
    "text": "So for example, if we're looking at the machine learning side,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.809,
    "end": 2697.822,
    "text": " and we want to scale it up to larger models, larger convolutional networks, you don't get interpretability because of this method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.962,
    "end": 2704.131,
    "text": "I think the same interpretability you would have with the old algorithms, you have them with this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.313,
    "end": 2709.94,
    "text": "What you gain, apparently, what this work shows, is that you get better performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.438,
    "end": 2737.699,
    "text": " but then of course if you apply if you apply to for example uh directed graphical models or vision networks that have a specific causal structure that you can observe in that case you have the you're able to to stay you can do for example the the intervention kind uh queries that i that i presented here like a year ago or something like that and uh but i think i think that's not in the algorithm is more in the kind of model you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.388,
    "end": 2743.976,
    "text": " you pick up is the kind of task that you want to solve and whether you care about it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.256,
    "end": 2750.325,
    "text": "So let's say maybe for generating faces for now, we did not care about having an interpretable model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.615,
    "end": 2758.336,
    "text": "What would you say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.636,
    "end": 2759.457,
    "text": "Yeah, Eli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2761.5,
    "end": 2764.885,
    "text": "I would sort of compare it to something like a car engine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.219,
    "end": 2774.451,
    "text": " You need to design a car engine of a certain size and power in order to put in a certain weight class of vehicle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.013,
    "end": 2781.84,
    "text": "But that doesn't actually determine whether that vehicle is a Honda or a Jaguar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.86,
    "end": 2789.81,
    "text": "If it's the same size and weight class, then you can actually use a very similar engine inside both of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2790.811,
    "end": 2792.914,
    "text": "And I think that's sort of, on the one hand,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.025,
    "end": 2821.635,
    "text": " the both the beauty and the pain in the ass of working with Bayesian methods is that you know the promise on the sticker is that here's Bayesian methods and you're going to solve a very broad range of problems with by reducing them to the same problem which is Bayesian inference and that's you know sort of what the free energy principle is all about is saying it's all really just reducible to variational inference right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2823.1,
    "end": 2849.04,
    "text": " now what you do find if you go look at like pi mdp or a lot of you know free energy type papers is that they'll design a model for the paper in order to model some piece of interesting organismic behavior but they'll include some real restrictions on the expressivity of that model which is that it has to be solvable by something like say variational message passing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.062,
    "end": 2858.99,
    "text": " So then there's the question of, well, how do you stop restricting the model class according to what inference algorithm you're going to use?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2860.172,
    "end": 2871.744,
    "text": "And that was really like the dirty secret of Bayesian methods that I learned in grad school was you're always restricting the model class to what you have a good inference algorithm for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.804,
    "end": 2878.791,
    "text": "Or at absolutely last resort, running something like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2879.362,
    "end": 2908.153,
    "text": " plain old metropolis hastings with a gaussian random walk proposal and just waiting for like three weeks of compute and hoping so you know what we actually want to do here is to say we have a better engine like literally we have a better inference engine you don't have to you know now structure an entire neural network architecture of inference proposals",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.268,
    "end": 2914.414,
    "text": " You don't have to play graduate student descent with your inference algorithm too much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2916.316,
    "end": 2935.795,
    "text": "Assuming that brains have some kind of wondrous generic inference algorithm that solves so many different Bayesian problems all at once, let's try to model that and then just use it because it'll be more powerful and more efficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2936.078,
    "end": 2960.5,
    "text": " than you know customizing to the particular generative model you want and you know really it's like first baby steps but it is encouraging that you know if you i think we show in the table yes like we trained a variational auto encoder you know as a baseline",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2960.75,
    "end": 2966.917,
    "text": " To say, well, what if you're doing variational inference by actually, you know, training a neural network to do it, to do it for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.938,
    "end": 2976.489,
    "text": "And it's encouraging to show that we can do a little bit better with like a generic inference algorithm that doesn't need a separate neural architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.529,
    "end": 2983.838,
    "text": "You know, compared to like build a second neural network and train it jointly with the first one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2987.328,
    "end": 3017.267,
    "text": " think something that is also exciting about this i mean at least for me is that we like we've been we've been working a lot with creative coding algorithms for machine learning in and i guess you can clearly separate them in like supervised learning and unsupervised learning and in supervised learning for example you train like large convolutional models on c410 c400 or tiny image net it seems that we've kind of like hit a momentary wall so it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.703,
    "end": 3021.069,
    "text": " up to a certain point, it's becoming really hard to scale up those algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.652,
    "end": 3034.615,
    "text": "And I think like the old community and it's not it's not only predictive coding, like when I talk with, for example, the equilibrium propagation, three people with all the life by a plausible deep learning community, there's a there's a kind of similar",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.236,
    "end": 3061.227,
    "text": " problem that is a when the model is more than seven eight layers deep it doesn't perform well and for example scaling it up to image net is a pain so a lot of people are taking a step back and say okay let's do a little bit more research to find out why and generalize and try to improve the performance in when using for example predictive coding for generative ai so to generate images to sample data points in an unsupervised way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.0,
    "end": 3087.045,
    "text": " the first problem that we had is that like in machine learning we had a couple of until like two years ago it was a mostly a deterministic algorithm so we were taking mostly raw and ballard's version which was the classification one there was no stochasticity so a bunch of people including me started publishing like associative memory papers it's like i give it a data set and i can by giving it a little bit of information you can regenerate exactly the same data points",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.392,
    "end": 3095.042,
    "text": " And then in the last year and a half, as Eli said, some people started developing sampling algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3095.063,
    "end": 3107.282,
    "text": "And basically, the papers before ours, a little bit, either they do it on MNIST and Fashion MNIST, or they do it on colored images like C410, C400.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.303,
    "end": 3113.792,
    "text": "But they use some kind of gradient descent, so it's not a completely local message passing algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.088,
    "end": 3125.037,
    "text": " And what we did in our paper is that we have a local message passing algorithm and we compare against theirs by using basically exactly the same architectures, exactly the same number of epochs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.578,
    "end": 3128.34,
    "text": "I think in some cases even exactly the same learning rate and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.401,
    "end": 3134.646,
    "text": "As a small correction, we aren't actually a message passing algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3136.728,
    "end": 3141.973,
    "text": "We're not technically any form of some product message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3142.797,
    "end": 3169.041,
    "text": " that's a local algorithm let's say yes local algorithm yes and uh and and we do well like for example the images of faces you've seen may not be may not seem perfect but they are at least from my perspective better than expected and the thing is we haven't i don't i don't feel like we have reached a wall in terms of performance like we've tested only on the architectures that other people have used before and we do well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.645,
    "end": 3174.009,
    "text": " And for now, there's little knowledge on how much this can scale up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.75,
    "end": 3177.793,
    "text": "Maybe you scale it up like two layers more and it doesn't work anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.973,
    "end": 3179.495,
    "text": "That's something that we don't know yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.175,
    "end": 3191.547,
    "text": "But potentially, it would be interesting to, for example, something I was messaging with Eli earlier this week is, can we scale it up to larger decoder-only transformer models, for example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.488,
    "end": 3198.994,
    "text": "Not like, of course, LLMs or things like that, but for example, something that is like a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.463,
    "end": 3208.679,
    "text": " four, five, six layers deep transformer model, that would already be quite an interesting result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.699,
    "end": 3210.442,
    "text": "Definitely not an easy one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.923,
    "end": 3217.033,
    "text": "But I think there is definitely room to improve the results of this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.051,
    "end": 3231.885,
    "text": " Could you also maybe highlight, how do you see local update rules as superset, subset, what have you, of message passing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.506,
    "end": 3243.139,
    "text": "What differentiates the local locality of connectivity from something that you would explicitly, Eli, call a message as passed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.047,
    "end": 3249.308,
    "text": " That's an interesting question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.348,
    "end": 3266.164,
    "text": "I guess there's a I think for message passing, you could call like all the belief propagation algorithms, or at least basically some kind of this class of algorithms where you clearly state which information has to be passed from from basically one latent variable to the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.606,
    "end": 3274.371,
    "text": "While local message passing, and they're in those kinds of algorithms, they're all local.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.392,
    "end": 3274.932,
    "text": "So it's a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.266,
    "end": 3280.615,
    "text": " Since you define them to be this way, they must have local information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.356,
    "end": 3291.213,
    "text": "Well, probably if you generalize to local message passing in general, there are some proposals, maybe including this one, in which maybe things are not supposed to be local.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.954,
    "end": 3301.51,
    "text": "Like maybe you can, like since it's a structured learning algorithm, you may, in theory, get information from other, from latent variables that are more far away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.367,
    "end": 3328.594,
    "text": " but is that but then when you actually do the computation they are local but that's that's an answer and giving now to the spot maybe like as a better thought on this so i would say that message passing algorithms differ from ours in both their means and their goals and really it's the goals actually that they're starting from so that family of algorithms",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3329.89,
    "end": 3343.631,
    "text": " When people were working on it maybe, I don't know, 20 years ago, what they were really trying to do was to get a summary of a posterior marginal distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3343.651,
    "end": 3351.223,
    "text": "So they just wanted to be able to pick out one latent variable for an inference query.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3351.76,
    "end": 3369.617,
    "text": " or a decision they needed to make say what is the posterior on this variable given the data not given any settings for all the other latent variables and that sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3370.728,
    "end": 3386.762,
    "text": " restricts you know the space of tasks that you can really address with message passing and it also you know does end up meaning that you know what you're basically doing is some form of some product or really integral product you know algorithm",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3388.531,
    "end": 3401.366,
    "text": " And that gets you all the way out to, I think, probabilistic circuits are the most current and advanced form of some product-based exact inference algorithm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3403.088,
    "end": 3413.401,
    "text": "And they only support tree-shaped generative models rather than those that are directed acyclic graphs in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3414.462,
    "end": 3416.344,
    "text": "So trees rather than forests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3418.163,
    "end": 3430.876,
    "text": " And we said, well, let's try targeting, you know, the full joint distribution of all the latent variables together, partly because that's the most general form of evasion inference problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.996,
    "end": 3441.606,
    "text": "And partially because, you know, if you have something like a hierarchical time series model from the active inference literature, you might need several levels of the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3441.686,
    "end": 3447.512,
    "text": "You might need the latent variables across those levels in order to make an action decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3451.154,
    "end": 3462.008,
    "text": " several levels of hierarchy might actually parameterize your policy or the thing that defines the inference problem you care about solving as a modeler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3469.7,
    "end": 3479.113,
    "text": " That's very interesting, again, to the sort of settings that a lot of active inference literature has tackled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.314,
    "end": 3492.752,
    "text": "In these cases, it's like digit in, pixel intensities, et cetera, digit classification, generativity of digits out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3493.153,
    "end": 3495.977,
    "text": "How would it be similar or different with something like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.425,
    "end": 3514.607,
    "text": " digit pixels in teammate's behavior out or robot arm out are you leveraging this uh identity or or at least uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.752,
    "end": 3520.039,
    "text": " structural congruence with the recognition and the generativity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.059,
    "end": 3537.688,
    "text": "Or like a VAE, can you have something different coming in and have the output be something that's categorically different than the type that was used as input?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3537.708,
    "end": 3540.713,
    "text": "Like action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3542.397,
    "end": 3553.351,
    "text": " So I think one of the advantages of defining anything as a Bayesian inference problem is that it really changes your conception of what's an input versus an output variable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.553,
    "end": 3557.156,
    "text": "For a Bayesian inference problem, you start with a graphical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3557.657,
    "end": 3560.721,
    "text": "You clamp several variables to be observed data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3560.761,
    "end": 3563.885,
    "text": "Those observed data are now your inputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3565.106,
    "end": 3570.413,
    "text": "Your output is any aspect of the posterior distribution that you care to examine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3575.658,
    "end": 3580.244,
    "text": " So we don't have to be outputting classification logits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3581.265,
    "end": 3588.915,
    "text": "We could also be outputting functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3592.34,
    "end": 3602.593,
    "text": "You could have, say, an active inference time series module where your agent gets some data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3604.092,
    "end": 3622.708,
    "text": " at every step of computation, performs a full sweep over the entire history of latent variables, and then and only then actually makes a decision about what action it's going to take.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3630.164,
    "end": 3657.032,
    "text": " which really highlights the importance of being able to specify the full joint distribution and then clamp down with nuance on what you want to be taking as observable, but kind of clamping down from the full joint and then just specifying and then having an inference algorithm that will facilitate that locally operationally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.974,
    "end": 3675.004,
    "text": " rather than trying to, amidst the constraints of which inference procedures you can perform, work within subclasses of graphical models that abide by those constraints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.515,
    "end": 3709.024,
    "text": " It's almost like it's a far cry in some ways from 2022 textbook figure 4.3, the kind of POMDPs and the matrix multiplication that it gets implemented in PyMDP, the sorts of pedagogical cases that do highlight certain key moves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.012,
    "end": 3718.901,
    "text": " This, though, looks and feels so much more like a machine learning work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3721.403,
    "end": 3729.752,
    "text": "And it's really interesting, though, what this enables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.792,
    "end": 3733.256,
    "text": "I think you also shaped the work with respect to the venue you want to submit to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.217,
    "end": 3739.703,
    "text": "Yes, I was just going to say, now that I've found... When we were discussing which experiments to run,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.02,
    "end": 3742.663,
    "text": " The first question is, are we going to submit a new REAPS?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.703,
    "end": 3742.923,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3743.324,
    "end": 3743.945,
    "text": "It's going to be OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.005,
    "end": 3752.455,
    "text": "Then it's going to be mostly image generation and also a little bit the venue and a little bit what did prior work do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3756.34,
    "end": 3767.513,
    "text": "We picked out image generation because predictive coding networks had not yet been used to get this quality of result on unconditional image generation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3777.145,
    "end": 3786.015,
    "text": " So other than the conference next week, what ways might you be taking it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.121,
    "end": 3795.486,
    "text": "I mean, probably there are many future directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.768,
    "end": 3804.857,
    "text": "I guess from the perspective that interests me the most, I would be really curious about doing what I mentioned earlier about scaling it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.259,
    "end": 3811.285,
    "text": " So for example, how much can we push this kind of algorithm?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.305,
    "end": 3832.566,
    "text": "So I think at some point, if we're going to have enough compute and maybe a faster, this is like some fast training, but probably if it's implemented in a parallelizable library or things like that, you can run larger models, you can run a huge number of hyperparameter search, and you can see at some point where it scales up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.883,
    "end": 3840.071,
    "text": " Because it's also true, we didn't do a huge hyperparameter search at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.172,
    "end": 3851.504,
    "text": "We did some, but it's definitely not comparable to what's standard in a machine learning paper in which they try thousands of combination of hyperparameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3851.644,
    "end": 3854.788,
    "text": "No, we did not do grid sweeps of hyperparameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3854.808,
    "end": 3855.528,
    "text": "Yeah, yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3856.009,
    "end": 3861.355,
    "text": "So I think there's room for pushing this a little bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3862.01,
    "end": 3870.741,
    "text": " and may hopefully much more but this is I think scalability is something that is really hard to intuitively predict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.442,
    "end": 3882.136,
    "text": "Like why some models work well on seven layers and then attend they collapse is you just just do it and notice that and then I guess you can do some interpretability afterwards and understand the reason.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.597,
    "end": 3886.722,
    "text": "But doing it before is always a tricky thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.742,
    "end": 3889.165,
    "text": "And so I guess trying it is probably the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.938,
    "end": 3894.886,
    "text": " If you have a method that allows you to try fast and fail fast is the best way of scaling it up, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.768,
    "end": 3918.882,
    "text": "Yeah, so I would also say, based on some of the not so publishable results that I've seen in, for instance, trying to replicate Howe's work with bouncing MNIST digits, how well this works often does seem to depend on exactly how much structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3919.081,
    "end": 3944.717,
    "text": " the generative model provides you you know to give like prediction errors that point in the right direction rather than well in exactly the right direction rather than just vaguely the right direction right so you know what is sort of how smooth versus how peaked tightly peaked is the landscape of your like is your free energy landscape",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3946.402,
    "end": 3950.908,
    "text": " And when it's more tightly peaked, this algorithm seems to work significantly better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.09,
    "end": 3970.654,
    "text": "Versus when it's not so tightly peaked, it'll often sort of get into the region of valid solutions and then get very noisy as it becomes unable to decide which of the potentially valid solutions is really the best one to converge on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3976.895,
    "end": 3985.81,
    "text": " I would say it's not so good yet at dealing with multimodal posterior distributions once a good generative model has been learned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3987.312,
    "end": 3988.715,
    "text": "So they're scaling it up to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3989.636,
    "end": 4003.459,
    "text": "I'm also interested to see how far could we take this on a fairly standard machine learning problem by just saying every time we have more layers than would be biologically plausible to differentiate,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4003.912,
    "end": 4018.631,
    "text": " just insert a random variable, like parameterize a Gaussian right there, and then just say, okay, now, you know, the amount of gradient calculation you have to do between layers is biologically plausible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4018.791,
    "end": 4031.708,
    "text": "And we'll use the predictive coding math to actually, you know, effectively solve like the, we'll have the random variables substitute for back propagation in a certain way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4034.945,
    "end": 4035.886,
    "text": " What do you mean by that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4038.329,
    "end": 4048.543,
    "text": "So if you have like a 12-layer, I think, Tommaso, you said like a 12-layer energy-based transformer or something?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4050.485,
    "end": 4060.598,
    "text": "So I think the general concept about biological plausibility is that you have a latent variable, another latent variable,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4061.168,
    "end": 4071.081,
    "text": " anyone, anyone that is basically computing the gradients of the parameters to depend on both latent variables, and not on other stuff that are in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.982,
    "end": 4080.173,
    "text": "So for example, if you consider the function that goes from one latent latent variable to the to the first from the first to the second, to be a three layer network,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.081,
    "end": 4100.642,
    "text": " the gradients of the weights of the intermediate layer or of the first they would depend on the last latent variable and this would make it basically make you break the locality assumption and biologically biological plausibility while if you consider like a function to be the function to be a single feed forward or convolutional layers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4101.095,
    "end": 4104.48,
    "text": " It means that for every weight, you have a latent variable before it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.821,
    "end": 4107.966,
    "text": "So you have a presynaptic neuron and a postsynaptic neuron actually in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.587,
    "end": 4118.063,
    "text": "And this will basically allow you to, once you compute the gradients of the free energy, to have everything that depends on presynaptic and postsynaptic neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4119.485,
    "end": 4122.79,
    "text": "So this is the concept of biological plausibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4124.112,
    "end": 4128.84,
    "text": "The problem that, for example, I'm noticing when you do classification,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.259,
    "end": 4152.786,
    "text": " is that doing this allows you to propagate the error a little bit less regularly than backprop does because backprop is sequential so it shines a little bit for very deep models especially if you have the right activation function so as a so i guess that's what eli was mentioning when he was saying about yeah so if you have for instance 12",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.15,
    "end": 4174.786,
    "text": " If you have, for instance, image, 12 layers, classification, then roughly speaking, getting a gradient for the activations of the middle layer of the neural network depends on all the way on the final observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4177.009,
    "end": 4179.634,
    "text": "Now, what we'd like to say is, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4180.508,
    "end": 4188.038,
    "text": " Ultimately, it's been proved that predictive coding in the limit implements backprop, just very slowly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4188.078,
    "end": 4193.505,
    "text": "But what we'd like to do is to calculate gradients a bit more quickly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4193.525,
    "end": 4203.357,
    "text": "And so what I was saying is that what you could do is take the middle layer and just say, well, this is going to be a random variable now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4203.477,
    "end": 4209.385,
    "text": "Instead of a single deterministic activation that has to be exactly right,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4209.466,
    "end": 4214.591,
    "text": " in order to pass gradients through, this is now going to be a Gaussian distribution over activations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.914,
    "end": 4227.745,
    "text": "And having done that, you can then use our predictive coding algorithm to say, I'll try and propagate through the latent space of possible weights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4230.027,
    "end": 4230.988,
    "text": "Or actually, no, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4231.809,
    "end": 4236.334,
    "text": "I'll try to propagate through the latent space of layer activations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4238.221,
    "end": 4254.041,
    "text": " find a relatively good solution, or rather a particle cloud of relatively good solutions for those, and then update the weights in order to make those activations more likely without depending on the final classification.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4255.082,
    "end": 4260.769,
    "text": "So without depending on the entire backwards computation tape of backcrop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4266.537,
    "end": 4270.162,
    "text": " But at the cost of being a little bit random, let's say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4275.309,
    "end": 4276.07,
    "text": "What's wrong with that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.894,
    "end": 4294.215,
    "text": "Well, nothing say probabilistic machine learners and say free energy principle people and active inference people, but currently the machine learning world doesn't like it very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4295.039,
    "end": 4296.622,
    "text": " They say Bayes doesn't scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4296.662,
    "end": 4300.368,
    "text": "We're going to teach them they're wrong about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4303.613,
    "end": 4305.135,
    "text": "Well, it's super cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4306.097,
    "end": 4315.592,
    "text": "If you have any other things you want to add, otherwise, good luck with the conference and with proceeding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4315.633,
    "end": 4320.861,
    "text": "It's super exciting, and I hope people watching this go to the repo",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4321.803,
    "end": 4326.988,
    "text": " continue on some of the explorations that you've mentioned and explore it in their own ways too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4330.031,
    "end": 4337.478,
    "text": "Yeah, I mean, feel free to send questions to our email addresses that are listed on the paper if you are not able to get the repo to work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4340.121,
    "end": 4343.364,
    "text": "Or if you make the repo work and you have ideas for follow-ups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.905,
    "end": 4345.046,
    "text": "Yes, that too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.308,
    "end": 4350.291,
    "text": "Yeah, we've got a few ideas already, like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4350.929,
    "end": 4368.826,
    "text": " You know, I think I was talking to Tommaso and saying, like, I've been meaning to write some code that will allow you to sort of pass a deterministic output between random variables so that we would, you know, not just be able to do like graphical models, but proper stochastic computation graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4372.309,
    "end": 4373.49,
    "text": "Divide and contribute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.792,
    "end": 4376.233,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.873,
    "end": 4378.675,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.363,
    "end": 4379.724,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.565,
    "end": 4381.266,
    "text": "Thank you, fellas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4382.508,
    "end": 4382.868,
    "text": "Until next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.888,
    "end": 4384.711,
    "text": "Thank you very much, Daniel, for organizing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.833,
    "end": 4387.135,
    "text": "Yeah, thanks for running these.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4387.996,
    "end": 4398.312,
    "text": "Like, every time a new one comes out, it goes on my Watch Later list, which, admittedly, I never work through, but they do go on it, and sometimes, sometimes, one or two videos.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4399.634,
    "end": 4399.955,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.395,
    "end": 4400.916,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.997,
    "end": 4409.691,
    "text": " when I get the opportunity to binge you are what I'm binging thank you see you guys bye have a nice day bye",
    "speaker": "SPEAKER_02"
  }
]