[
  {
    "start": 10.595,
    "end": 10.915,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.237,
    "end": 12.858,
    "text": "Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.319,
    "end": 21.43,
    "text": "It is April 8th, 2025, and we're an active guest stream 101.1 with Mohsin Jafari and Yuli Li.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.851,
    "end": 26.697,
    "text": "So thank you both for joining and looking forward to this presentation and discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.261,
    "end": 32.125,
    "text": "Well, Daniel, thank you so much for having us here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 32.525,
    "end": 34.408,
    "text": "It's really great pleasure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.642,
    "end": 38.146,
    "text": " What I'm going to do is I'll have, I have few slides for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.166,
    "end": 42.07,
    "text": "I'll present my slides and it's an open discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.151,
    "end": 44.473,
    "text": "So please stop me whenever you have questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.715,
    "end": 47.797,
    "text": "And that's about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.857,
    "end": 48.838,
    "text": "So let me start.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.058,
    "end": 50.961,
    "text": "Again, my name is Mohsen Jafari.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.002,
    "end": 54.925,
    "text": "I am professor at Rutgers University of Engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 56.627,
    "end": 62.674,
    "text": "This work, we have been working in this area for the last, I would say, four to five years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.211,
    "end": 68.677,
    "text": " And this is a joint work with Professor Andrea Mata from Politecnico Milano.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 69.858,
    "end": 73.021,
    "text": "There are four PhD students currently working on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 73.121,
    "end": 82.191,
    "text": "Actually, one of them, Yufei Hong, the last one, he graduated about a year ago, but the rest are in the program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.311,
    "end": 84.173,
    "text": "They are working in the program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.315,
    "end": 89.438,
    "text": "So what I'm going to do, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.84,
    "end": 93.828,
    "text": " Again, it took us a while to understand active influencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 93.848,
    "end": 97.656,
    "text": "I am myself coming from automation background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.797,
    "end": 106.735,
    "text": "I have computer science, half engineering, so I'm very familiar with modeling, with the stochastic systems and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 107.17,
    "end": 126.583,
    "text": " Definitely in terms of active influencing, it was a little bit different for me to get acquainted with, but that's why it took a while to basically understand the terms, the jargons and the underlying assumptions and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.603,
    "end": 132.773,
    "text": "But we feel that we are quite comfortable with the theory and the framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.445,
    "end": 140.724,
    "text": " Our background is engineering, so we like to see that we can apply active influencing to engineering systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 140.744,
    "end": 146.318,
    "text": "So that is really the main theme, the main trust of our group's work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 146.338,
    "end": 149.125,
    "text": "And for that reason, we are looking at engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 149.257,
    "end": 176.8,
    "text": " know large complex human machine systems where you have physical systems machinery buildings communities and so on and at the same time you have humans so there are both aspects of it and these are large systems so one example here is like a building community or a smart community i'm sure many of us have heard about this where you have some buildings each building has zones",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 176.982,
    "end": 205.757,
    "text": " and and then you have the community which has many buildings in it and these communities are part of a larger network sometimes called distribution network if you are looking at from energy perspective then you can connect to the power grid or any other type of network so they're different how you know there's a hierarchy of hierarchy of different layers in the system and it's quite complex it's the way that information is being",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.737,
    "end": 222.075,
    "text": " and passed up and down and being processed there are many issues in terms of privacy confidentiality abstract abstraction of information and so on so that's one example and i'm going to talk more about this as we move on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.477,
    "end": 227.605,
    "text": " Another example is in the top, in the production systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.886,
    "end": 232.854,
    "text": "The production systems, manufacturing systems are usually complex systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.874,
    "end": 237.441,
    "text": "There are many, many stations, robotics, and you name it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.641,
    "end": 248.839,
    "text": "And there are many examples where you have hundreds or thousands of this machinery in the same area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 249.157,
    "end": 257.563,
    "text": " And of course, these systems interact with the environment, with the outside, and there are lots of complex interactions inside the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 257.932,
    "end": 285.508,
    "text": " another system of the same complexity that involves again machinery and human is is roadways you know navigation in the roadways you have cars and and these days we have mixed traffic you have smart cars you have not so smart cars and and of course the interaction between all this you know vehicles in the system uh in terms of navigation is a quite complex problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 286.349,
    "end": 294.218,
    "text": " Along the same line, you can look at the simpler systems, but you can look at very complex dynamics in this system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.238,
    "end": 309.956,
    "text": "I'm borrowing this picture from the literature, but basically think about this table with a robot that tries to push the ball, but the table has a complex dynamics in terms of tilting, in terms of friction on the table.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.637,
    "end": 316.103,
    "text": "So exactly what you do and what you see may not be exactly what you are trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 316.083,
    "end": 322.5,
    "text": " And this is another type of system that we are trying to look into and study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.56,
    "end": 325.968,
    "text": "And again, if time allows, we will discuss this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.954,
    "end": 330.48,
    "text": "Let me just go back a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 330.983,
    "end": 359.59,
    "text": " the whole idea of looking at degenerative modeling is not new for us i would say about 15 to 20 years ago i i have i i did some work in this in this topic again for large complex systems the whole problem there is that to build this like in this case this automata models for distributed systems and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 359.57,
    "end": 378.49,
    "text": " our work research was to build algorithms where you can actually generate this the automata model for the whole system in some smart in some automated way so this is a this is something that we have been doing for for some time and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 378.47,
    "end": 407.397,
    "text": " it did not directly relate to active inferencing but again the whole idea of creating generative models for the purpose of creating perception of how the system works has been there in the past you know in the past this is another example of a manufacturing system actually this is a real manufacturing system where the idea is you want to build this graph model on the right hand side which happens to be a petri net",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 407.967,
    "end": 415.597,
    "text": " And you want to be able to develop this Petri Net based on the information that you collect from the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 415.677,
    "end": 431.477,
    "text": "And again, this could be a very complex system and the problem of interest here becomes, okay, how do I create this graph model that describes the logic of how the system works in some smart automated way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 431.778,
    "end": 434.881,
    "text": " This is another example we did in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 435.201,
    "end": 437.924,
    "text": "Here you have a simple chemical process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 438.524,
    "end": 446.032,
    "text": "You are receiving sensory information from the process and the idea is to build a state transition model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 447.053,
    "end": 457.603,
    "text": "Daniel, I know that one of you, you know in your email to me, you asked the question, how do you incorporate the sensory information to building your models?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.683,
    "end": 459.945,
    "text": "And actually this is one example of it that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 459.925,
    "end": 479.419,
    "text": " you directly use the sensory data to create the state transition model and these state transition models basically describe the behavior of the process again I'm not going to go into detail of it but what I'm trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 479.399,
    "end": 490.557,
    "text": " The point I'm trying to make is that, you know, the whole idea of generative modeling and automation has been around for some time, but not within the context of active influencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.14,
    "end": 501.555,
    "text": " So when we are looking at this type of, you know, human machine systems, we are talking about really complexity in terms of the physical systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.595,
    "end": 504.94,
    "text": "There is a lot of physics behind the systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 504.98,
    "end": 510.669,
    "text": "And of course, there is human and all the, you know, complexities that comes with the human behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.47,
    "end": 515.076,
    "text": "Usually with this system, state spaces are very large.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 515.056,
    "end": 523.834,
    "text": " And especially if you shuffle the states together because of the dependencies, then the problem becomes quite complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.978,
    "end": 534.828,
    "text": " In many cases, you have hybrid systems in terms of some of the activities, functions are time-based.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 534.868,
    "end": 536.95,
    "text": "So you have to have a continuous model for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.751,
    "end": 540.094,
    "text": "And some of the activities are event-based.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.114,
    "end": 542.897,
    "text": "So you have time-based and event-based dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 543.637,
    "end": 550.124,
    "text": "And that definitely makes the problem more interesting and more complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.445,
    "end": 554.749,
    "text": "Again, we have many sources of uncertainties in these systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 555.067,
    "end": 579.538,
    "text": " usually what you do and this is this practice this has been the practice in the past and now is to create some layer by layer decomposition of this type of systems in terms of states variables outcomes data and so on and of course nowadays we have all the issues with the data confidentiality and privacy and so on that you need to consider in these systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 579.518,
    "end": 601.898,
    "text": " so before we get into too much of detail let's just look at a very simple case suppose i have this building and suppose that this building has only a single zone and what i'm trying to do is i want to basically control the the temperature in this building so the or in the zone so the problem of interest here is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.418,
    "end": 626.957,
    "text": " can i build an active inference model to do this so i want to create an agent that can actually control this this zone and for that reason what you need to do is you need to create of course your hidden states your controls actions your observations outcomes and preferences all of it together i'm not going to go to details of it but in a zone like this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 627.882,
    "end": 647.747,
    "text": " It makes a lot of sense to assume that the occupancy level in the zone is hidden from the controller, because either you have to have very sophisticated sensory network in the zone to know exactly how many people are there, because as you know, the occupancy impacts the temperature, humidity in the zone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.727,
    "end": 668.537,
    "text": " and also infiltration external infiltration if you somebody keeps the window open or the door open it will definitely impact the quality temperature inside the zone so these could be you can consider these as hidden variables and in terms of actions excuse me in terms of actions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 669.226,
    "end": 684.17,
    "text": " the amount of air that you supply to the zone, as well as the flow rate and the temperature, both in terms of rate and the temperature, is something that you can control.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 684.551,
    "end": 687.876,
    "text": "And for the observations,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.856,
    "end": 710.539,
    "text": " suppose that you have the thermostat or some sort of sensor that you can see the temperature in the zone or average temperature in the zone and let's show it by phi t so basically i have my hidden states i have my outcomes or phi t and i have my actions now within this context you can actually build a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.873,
    "end": 729.591,
    "text": " an active continuous active inference model for this without getting it too much into the dynamics of the of the system actually this is quite complex dynamics in terms of you know the thermal flow but by using the active inference you basically avoid that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.571,
    "end": 747.293,
    "text": " and you use this probabilistic model to control to basically build your model i'm not going to go through the details of this but you can actually do it you can create your your the elements of your active influencing and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.577,
    "end": 756.148,
    "text": " And one thing that I like to mention is that, let me just go through this and basically explain the details of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 757.37,
    "end": 768.345,
    "text": "We said that the temperature in the zone is phi, but we define a g function that describes the outcome in terms of the hidden states and actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 768.405,
    "end": 772.65,
    "text": "Very normal, very regular in active influencing literature, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 773.091,
    "end": 776.976,
    "text": "And we are going to assume that it is Gaussian with some sort of a noise level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.103,
    "end": 784.95,
    "text": " Now from thermodynamics, we know that we can describe the temperature in the zone through this time series function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 786.132,
    "end": 794.201,
    "text": "And it just happens that here, this time series function is a function of control actions as well as hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.621,
    "end": 796.463,
    "text": "That makes life much easier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 797.044,
    "end": 807.435,
    "text": "So that basically describes your g function through which you can describe your outcomes in terms of the hidden states and actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.732,
    "end": 813.038,
    "text": " You can continue the formulation and active influencing on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 813.959,
    "end": 821.61,
    "text": "Formulate your variational free energy and one idea that you may want to have here is that you define a target.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 822.03,
    "end": 836.41,
    "text": "The target is very interesting here because as a as a owner of the zone, you may actually set some the band gap for the temperature and what you want this active influencing agent to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 836.39,
    "end": 854.365,
    "text": " to make sure that the temperature stays within within this target band gap so it is very doable and again that is what i'm showing here and of course you can use your variational free energy you can",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 854.345,
    "end": 879.728,
    "text": " look at the gradients in terms of the inferencing and in terms of control so again i'm not going to go through these details we can always come back to this if you have questions later on but i'm just following the normal literature in active inferencing to do this formulation of course you can generalize this to much more complex and more general and here i have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.231,
    "end": 896.08,
    "text": " some general formulation of it in terms of different variables that has to go to this type of continuous active influencing function and and and how you define the targets because usually the target",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 896.06,
    "end": 901.425,
    "text": " for an active influencing agent in this type of systems comes from a higher level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.965,
    "end": 908.271,
    "text": "And the way this target is defined depends on the dynamics at the higher level and the lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 908.771,
    "end": 913.736,
    "text": "And definition of this type of target is very interesting in this type of system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 914.076,
    "end": 926.067,
    "text": "That is one of the areas that right now we are doing some research on to see how we can actually do that type of formulation and build this hierarchical model in this context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.047,
    "end": 930.551,
    "text": " Again, I'm just not going to go through the details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 931.012,
    "end": 932.753,
    "text": "Let me move to another layer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 932.813,
    "end": 934.895,
    "text": "Suppose that you have a community now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.935,
    "end": 937.678,
    "text": "So within the community, you have different agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.838,
    "end": 940.561,
    "text": "Each agent could be a zone or a building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 941.061,
    "end": 947.988,
    "text": "I just showed you how you can do the zone, but you can extend it to a building, assuming that the zones are independent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.008,
    "end": 955.615,
    "text": "If the zones are dependent, of course, it just makes your model much more complex, but it's still very doable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 955.595,
    "end": 974.363,
    "text": " now when you are looking at the from the community level of course there are lots of confidentiality and the privacy issues and the active influencing agents at the lower level are not going to give all the detailed information about their what's going on there to the higher level",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.343,
    "end": 980.057,
    "text": " So there is some abstraction of information that will go from the lower level to the higher level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 980.438,
    "end": 984.067,
    "text": "And that is exactly what we are trying to model in this case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 984.248,
    "end": 989.922,
    "text": "Again, let's move on with, and if you have questions, we can always come back to the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 989.902,
    "end": 993.086,
    "text": " to the detailed formulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.166,
    "end": 1001.676,
    "text": "But without going through details, you can actually define the hidden states in some abstract level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.017,
    "end": 1005.101,
    "text": "You can define observations in some abstract level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.461,
    "end": 1011.268,
    "text": "You can define actions in some abstract level at the community layer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1011.248,
    "end": 1031.822,
    "text": " remember you have the building you have the zone you have the building you have community and as you move on the abstraction level becomes more and more and you can form all the matrices and all the relationship at the community level we are assuming that your active inference model is discrete",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.887,
    "end": 1035.451,
    "text": " So at the zone level, we are trying to control temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1035.631,
    "end": 1047.565,
    "text": "Clearly it is time-based, whereas in the community level, we are trying to basically set some commands between the, or define some commands to the lower levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1047.886,
    "end": 1050.709,
    "text": "So we deal with it in discrete way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1051.41,
    "end": 1058.518,
    "text": "Let me just add here that if I may go back to here, when you are looking at this higher level community layer,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.498,
    "end": 1079.983,
    "text": " or level you are dealing with the distribution network much you know another higher level i am assuming that the distribution layer is going to set some targets and also it is going to give some information to the community for example market price and or the day head plan which is very usual in the sense that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1080.267,
    "end": 1085.875,
    "text": " You define your schedule of how you are going to consume energy for tomorrow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1085.895,
    "end": 1093.025,
    "text": "So this is the target that the community level active influence has to respect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1093.045,
    "end": 1096.63,
    "text": "So you can set all these targets at different levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.811,
    "end": 1102.499,
    "text": "And our formulation, again, we are going through the same active influencing formulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1102.959,
    "end": 1104.602,
    "text": "You can use Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1104.622,
    "end": 1106.865,
    "text": "You can use different forms of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1106.845,
    "end": 1126.288,
    "text": " to to do the formulation here I'm just showing you some simple examples and again you will have my slides but active influencing is doing amazing it is at the community level it is able to to follow the target very well it is able to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1126.268,
    "end": 1146.268,
    "text": " minimize the pricing system and also the use of I am assuming that your community for example has solar panels and energy storage and it tries to optimize the usage of all this together so that is really very exciting and very interesting to see that without",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.248,
    "end": 1171.362,
    "text": " truly understanding the inner dynamics of these complex systems i can actually employ active influencing to come out with with the controls which otherwise you have to either use some reinforcement learning or some exact models which sometimes is not even possible because the flow of information and the flow of the physical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.443,
    "end": 1176.913,
    "text": " elements such as you know thermal flow and all that is is very complex",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.155,
    "end": 1208.841,
    "text": " so let's move on and now this brings us to another example in the production system and I'll tell you where is it that we bring the probabilistic diffusion to this and where it is we are expanding our research to and how it came about first of all I showed you a hierarchical system in terms of community the fact is that if you really want to do this for a real complex system the number of states and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1208.821,
    "end": 1232.635,
    "text": " and the models will be very very complex and we know that in active inferencing one of the issues there is to compute expected free energy for the future to define your you know plans strategies optimize your strategies that's a major issue in large complex systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1232.615,
    "end": 1255.737,
    "text": " because computation of these expected free energies is not easy if not impossible is not easy we tried it for this production system actually this is a work we are doing in Italy and it's huge if you are using month colors search all that and creating this habitual networks and so on in order to calculate the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.088,
    "end": 1260.718,
    "text": " the expected free energy problem becomes extremely difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.319,
    "end": 1272.021,
    "text": "So that was one reason for us to start looking for maybe different solutions to deal with expected free energy problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1272.608,
    "end": 1285.714,
    "text": " Now I'm not going to go through this, but I'm just showing you some of the elements of how you can use the traditional active influencing in terms of Monte Carlo search and all of it for expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.734,
    "end": 1293.469,
    "text": "But again, when you go for large complex systems, these become really big issues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1294.613,
    "end": 1296.975,
    "text": " Let me just stop here for a sec.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.496,
    "end": 1305.323,
    "text": "What I did was I basically showed you some examples of real complex human machine systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1305.383,
    "end": 1307.125,
    "text": "I would say I showed you community.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.906,
    "end": 1313.251,
    "text": "We have done some work in that area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1314.032,
    "end": 1320.638,
    "text": "We are trying to expand our work and really bring to more real problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.888,
    "end": 1343.892,
    "text": " we also did in production systems quite complex problem in terms of state space explosion and so on so forth so we have been searching for some different ways of dealing with this expected free energy problem how do you really do this what is the organic way of really doing it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.682,
    "end": 1374.233,
    "text": " i feel that as human we don't do it that way we don't search for different solutions for the future active influencing is really it has its roots in predictive mind so to me it is very organic so we we have been trying to find some organic ways of dealing with expected free energy so let me put it that way so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1374.432,
    "end": 1379.159,
    "text": " This brought us to problem of probabilistic diffusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1380.642,
    "end": 1381.182,
    "text": "What is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.384,
    "end": 1393.381,
    "text": "Well, I don't know if you are familiar, Daniel, with probabilistic diffusion, but basically the problem is that you start from initial data, in this case image of a cat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1394.823,
    "end": 1401.874,
    "text": "You bring noise and perturbation to it until you make a total noise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1402.9,
    "end": 1430.14,
    "text": " and then you basically recreate the image from that right sounds very simple it just happens that when you go from your initial data in this case again the image of this cat to total noise you are basically going through this Markovian step and in each step you have discussion approximations for your state variables",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.12,
    "end": 1458.692,
    "text": " now in this case your state variables are you know pixels of the image and you just keep on applying it to these pixels until you can create this total noise so it's fully corrupted and then you create a reverse process which is also gaussian but then you have to use some sort of approximation neural net approximation or any other sort of approximation to build the original image the original data set",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.617,
    "end": 1479.313,
    "text": " so this has been in the literature i would say for five six years now this is called probabilistic diffusion looking at it from engineering perspective i like to call it reverse engineering because what it tells me is that i can start from some ordered structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1479.293,
    "end": 1503.748,
    "text": " i can totally uh destroy it which is my noise totally corrupted and then from total disorder i can recreate order again right so this is basically what this diffusion is about any questions i understand or should i continue yeah continue thank you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.893,
    "end": 1527.559,
    "text": " so without going through the the whole process of how you do this again this is a Markovian in each step you have Gaussian assumptions as you're going forward as you're going backward again you have Gaussian it's Markovian but you really have to compute your noise levels as you're going backward",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1527.539,
    "end": 1554.559,
    "text": " and it just happens that again there are a number of papers recent papers in the literature that going back you can look at this score function which i have it here as the gradient of log of q now one point here when you are going forward you can assume that you are using the original distribution even though you have to approximate it and when you are going backward you are trying to get to that original distribution",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.539,
    "end": 1582.808,
    "text": " so when you are going forward i have q i'm using q for my transitions and when i'm going backward i'm going to introduce some parameter theta and use p because i want to come to back to this original distribution it just happens that usually backward reverse or the backward process you have to use some sort of a neural net but it is based on this score function which is gradient of this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1582.788,
    "end": 1588.427,
    "text": " log of Qt Xt given X0 it's a very important point here",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1588.88,
    "end": 1613.655,
    "text": " if for my reverse process it is important that i keep my original data set my original painting accessible because without that information this reverse may not be tractable again we can always go back to details of it but this is already in the literature there is nothing new on that one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1613.635,
    "end": 1637.972,
    "text": " and the beauty of this methodology is that you can actually do sampling conditional sampling and by this conditional sampling you can actually define where you want to go back because you may not actually go back to the same origin you may add few things to it or you may actually change your original design and that is very useful when you are looking at reverse engineering problems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1638.948,
    "end": 1640.656,
    "text": " There is a discrete version of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.816,
    "end": 1648.671,
    "text": "And to us, this is very interesting because we think many engineering processes can be described by graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.09,
    "end": 1656.899,
    "text": " And this graph diffusion, it has been around again for a few years, only a few years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1657.6,
    "end": 1659.382,
    "text": "And there are a number of works on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.023,
    "end": 1663.107,
    "text": "We are also trying to use this for engineering processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.008,
    "end": 1672.338,
    "text": "And the way you use the graph diffusion is, again, you start from a graph, you totally destroy it, and then you build it back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.079,
    "end": 1679.046,
    "text": "There are some very interesting applications of this in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1679.549,
    "end": 1691.583,
    "text": " In the literature, there are two ways that people have used so far in terms of using the diffusion together with reinforcement learning in control actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.604,
    "end": 1693.266,
    "text": "They don't use active inferencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.826,
    "end": 1696.75,
    "text": "They use the diffusion with reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1697.13,
    "end": 1698.312,
    "text": "Here is one example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.352,
    "end": 1701.996,
    "text": "This is by a group from 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.09,
    "end": 1731.072,
    "text": " so basically think about this you define your control actions you have control actions you have your states as i have done here like a's are your control actions it's s are your states so if you combine look at the combination of actions and states you have that you know the small square or rectangle there and then you put them next to each other so you have the whole sequence going from time zero to whatever time it is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.136,
    "end": 1756.789,
    "text": " so if I create this table this looks more like an image and then of course actions are states there are multi-variables there are many elements inside each so I have this like a image type structure and then I apply on a noising and denoising to it and when I am going back when I'm doing my reverse process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1757.512,
    "end": 1766.526,
    "text": " reinforcement learning in terms of some reward function to find the best sequence of actions, the best trajectories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.827,
    "end": 1774.518,
    "text": " This is a very interesting concept and quite useful or close to what we are trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1775.459,
    "end": 1777.462,
    "text": "There is another example of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1777.622,
    "end": 1790.1,
    "text": "By the way, we have taken this methodology and done some improvement on this because when the number of time steps increases, this problem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.08,
    "end": 1807.195,
    "text": " may not actually converge so we are looking at some what we call window stitching and some adaptive planning of doing the same thing and we have some preliminary results on that again I'm not going to go to the details",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.175,
    "end": 1833.621,
    "text": " another work of the similar sort rather than looking at the actions and states together they apply the same methodology to the states and then they use inverse dynamics to define the actions okay but pretty much it is the same approach and with this you can use reinforcement learning to try to optimize you know your trajectory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1834.175,
    "end": 1861.903,
    "text": " now i call these model one these two model one because they are not actually using they use reinforcement learning they have some reward function but they are not actually formalizing how this optimization or optimal control should be the model 2 which is our model actually puts active influencing and diffusion together",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1863.149,
    "end": 1883.976,
    "text": " in the following sense so think about it this way the diffusion is going to teach me how to go from point a to point b okay so from diffusion i can create many different samples of going from point a to point b avoiding many obstacles and all of it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1884.091,
    "end": 1888.277,
    "text": " So I already learned how to go from one point to another point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1888.878,
    "end": 1890.681,
    "text": "I look at it as a predictor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1890.721,
    "end": 1896.309,
    "text": "So actually probabilistic diffusion creates a motion prediction for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1897.571,
    "end": 1898.452,
    "text": "Very organic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1899.654,
    "end": 1909.609,
    "text": "And then I can actually use active inferencing together with this to find my best sequence of motions going from one point to another point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.939,
    "end": 1923.332,
    "text": " So that is basically the whole, you know, this is the whole theme or whole philosophy behind our methodology of combining active influencing and diffusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1923.792,
    "end": 1939.849,
    "text": "So the forward process is the same as, exactly the same as diffusion, but the backward process, every time that you start from a state in the reverse process, diffusion process, you start from a, you know, state,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.403,
    "end": 1969.127,
    "text": " and you have again you have all these different samples of going from this point to this point but for each of them you can apply the expected free energy from active influencing to find which one of them will give you the best sequence of actions and that is the overall model that we have here let me show you this in terms of let me just jump through this for a sec",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.795,
    "end": 1990.018,
    "text": " uh to this uh parking model a lot model so here suppose i have in the first in the top graph on the left hand side i have only five six parking slots in the other one i have more so you have some parked cars",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1990.454,
    "end": 2010.792,
    "text": " want to teach these cars how to go and park themselves in the best possible way so there are some empty slots and these cars starting from some random place they should go and park okay so there are two problems here one is that first i have to know how to drive in such an environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.772,
    "end": 2022.537,
    "text": " going from point a which is some random point to a parking slot that is one problem the second problem is that i have to go to the best slot to the best place right so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2023.057,
    "end": 2047.495,
    "text": " what we do is the first problem we solve it with probably probabilistic diffusion how do i do it i start suppose that i take a car one of these green cars i take it from there suppose it is parked in a slot in a parking slot i take it from there and i apply this forward process to it until i bring it to total noise somewhere out there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.639,
    "end": 2050.321,
    "text": " then I reverse this process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.742,
    "end": 2053.927,
    "text": "And I create different samples of this reverse process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2054.428,
    "end": 2064.883,
    "text": "So basically by doing so, I know how to start from a, how to go from some random location to a parking slot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2064.903,
    "end": 2068.629,
    "text": "So I have learned that through my diffusion process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.189,
    "end": 2078.443,
    "text": "Now that I have that, then I apply my active inferencing to see which one of them is gonna be my best choice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.727,
    "end": 2108.262,
    "text": " one thing here is that as i am doing my problems the diffusion at any point that i'm look using what i have learned to find my eye you know to find my projection for the future i can use variational free energy to inject what i am observing to my diffusion process so in a way we are updating our diffusion process by the observations that i am actually receiving in real time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2108.883,
    "end": 2119.821,
    "text": " again I have applied my diffusion I have set up samples of how to go from some random point to a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2120.257,
    "end": 2142.18,
    "text": " parking slot i have many samples but now that i am doing active influencing i am actually applying in real time so now i make an observation diffusion tells me go this way it for the next step it gives me an estimate but when i actually apply it the result is a little bit different different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2142.16,
    "end": 2161.553,
    "text": " so i am going to use variational free energy to make a correction find a new point and apply my diffusion again until i get to my best location so that is basically the whole idea behind this now in in here the inverse dynamics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2162.41,
    "end": 2188.182,
    "text": " is you know bicycle model it's a very say from the literature there's nothing new about it so given that i have my actions or states i can find the other one in this example we are applying the diffusion to the actions but you can do both again but remember actions and the states are related through this inverse dynamics model so that's not an issue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.377,
    "end": 2211.368,
    "text": " one last item here is that really a contribution that we are making here is actually i will say there are two contributions one is how to deal with expected free energy in really complex systems in some organic way that's number one and again reverse engineering is something that we do a lot in engineering",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2211.938,
    "end": 2223.72,
    "text": " number two is that how to integrate the elements of active influencing especially the variational free energy to update my diffusion process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2224.392,
    "end": 2232.14,
    "text": " And in this work that we did for the parking model, we were actually able to demonstrate that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2233.541,
    "end": 2243.371,
    "text": "Before getting into any, and maybe Yulin can help me here, now we are trying to use this idea for many different applications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2243.832,
    "end": 2253.842,
    "text": "And we are also trying to expand our parking model to more navigation on the road by looking at stitching these windows together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.902,
    "end": 2264.016,
    "text": " One of the areas that we are trying to work on is, how to actually navigate a ball, for example on a table, which is very dynamic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2264.056,
    "end": 2269.765,
    "text": "So it is tilting, there are frictions, and it has to be able to find its way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.526,
    "end": 2275.874,
    "text": "So we are thinking that this ball is looking for food, but we don't know if there is a food or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2275.894,
    "end": 2281.483,
    "text": "So the ball has to go, or this organism has to go and find",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.463,
    "end": 2287.009,
    "text": " has to survive, but in order to survive it has to find food, but it doesn't know if there is a food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2287.349,
    "end": 2292.775,
    "text": "So it has to explore this in a very dynamic environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2292.795,
    "end": 2302.045,
    "text": "And again Yulin, is there anything you want to mention here, before we start our conversation about all this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.072,
    "end": 2310.053,
    "text": "Yulin, are you there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2315.467,
    "end": 2323.996,
    "text": " Well, can you say a few words on this unit?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2324.016,
    "end": 2326.238,
    "text": "Sorry, I just lost audio for a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2327.299,
    "end": 2327.539,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.38,
    "end": 2332.164,
    "text": "So this is the most recent work we're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.465,
    "end": 2345.457,
    "text": "So again, as Dr. Jafari described, this is similar to Tim Snyder, Dr. Snyder's work about active exploration for robotic manipulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.437,
    "end": 2373.79,
    "text": " right and as as Christopher described this environment is extremely challenging and almost impossible for reinforcement learning and we add extra layer of challenge just tilting the table such that that the table is dynamic during the learning exploration task so our idea is to solve this problem with a hierarchical setting right so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.985,
    "end": 2377.991,
    "text": " Right now, we're experimenting with three layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.051,
    "end": 2386.126,
    "text": "The top layer is a high-level planner using active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.168,
    "end": 2396.065,
    "text": "Using the active inference controller, this layer updates belief using variation of free energy and performs planning using the expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.045,
    "end": 2404.46,
    "text": " where does the expected free energy, all those information comes, we need to sample many different possible trajectories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.921,
    "end": 2411.252,
    "text": "So that's how we move to the second layer, the diffusion projector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.232,
    "end": 2419.044,
    "text": " Our diffusion projector learns from dataset and from past experience to generate possible paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2419.504,
    "end": 2430.0,
    "text": "The high-level active inference layer will select a preferred region, some kind of points or area or distribution, as we refer to G-distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.875,
    "end": 2434.159,
    "text": " that belief gets passed on to the diffusion planner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.179,
    "end": 2438.625,
    "text": "And the diffusion planner generates many possible trajectories to that region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.846,
    "end": 2442.631,
    "text": "And at this point, the actual goal hasn't been found yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.971,
    "end": 2444.253,
    "text": "We are still looking for the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.774,
    "end": 2451.162,
    "text": "But we are generating diverse trajectory towards that most probable region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.361,
    "end": 2461.506,
    "text": " And these trajectories consist of a sequence of waypoints and corresponding states that represent the possible paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.739,
    "end": 2471.071,
    "text": " And then, obviously, we calculate the expected free energy and then select the best possible trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.852,
    "end": 2476.739,
    "text": "And once we have the trajectory, now we have the low-level controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.58,
    "end": 2489.215,
    "text": "The low-level controller is just a lightweight, small-scale reinforcement learning controller that generates actions to connect the small waypoints.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.482,
    "end": 2505.981,
    "text": " So by having this hierarchical structure, we believe we can solve this problem much faster than the original literature, where Dr. Snyder solved this problem with model predictive control with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.902,
    "end": 2513.65,
    "text": "If you run that, it takes tremendous amounts of planning time and learning time, and we believe by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.63,
    "end": 2520.019,
    "text": " because of the nature of diffusion process, we can make this learning process and planning process much faster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.402,
    "end": 2524.104,
    "text": "Thank you, Yulin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.124,
    "end": 2525.867,
    "text": "Well, Daniel, I think we are done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.887,
    "end": 2528.39,
    "text": "Sorry, I don't know how long it took, but it was long.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2528.831,
    "end": 2529.291,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.893,
    "end": 2531.875,
    "text": "It was awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.895,
    "end": 2533.297,
    "text": "Yeah, I'll ask some questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.837,
    "end": 2536.401,
    "text": "Is that okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.763,
    "end": 2538.103,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.323,
    "end": 2540.987,
    "text": "Well, I think there is some sort of fact",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2542.148,
    "end": 2562.03,
    "text": " i know i think it might be on your side oh it sounds cool though okay but is there any way to like maybe mute but it's it's minimal when you're talking oh it's okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.647,
    "end": 2582.803,
    "text": " okay um all right i'll read some of the pre-submitted questions some of them are cool to maybe get your uh short short takes on so could i should i keep the should i share or should i just you can keep it up you know it's it's yeah you can keep it up and i'll just if in case you want to show a slide um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.783,
    "end": 2609.247,
    "text": " how did you incorporate physics like friction forces or air resistance into the model so when you're and and just thinking from your engineering expertise more broadly how do you bring in these physical features and constraints into the model's dynamics to what extent do you encode them symbolically um core screen them how do you include those in the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.184,
    "end": 2636.449,
    "text": " well again there are two aspects of the model here so let me just go back one thing i want to make sure that we are on the same page there are two things we are looking at one is this hierarchical models right large complex hierarchical models and one example is here this is one example this is physics this is total i mean this is a time series model from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2636.53,
    "end": 2652.835,
    "text": " from the temperature in a zone and in this in this case for a given zone we have this type of physics model right and and it is easy to incorporate it both in terms of states and actions and so on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2653.321,
    "end": 2680.29,
    "text": " But in all honesty, when you enlarge the system, if you look at the complex zones, if you look at many different factors, it will be very difficult to find a physics-based, tractable model to actually to use, in which case you have to use some sort of neural nets or some sort of approximation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2680.625,
    "end": 2703.797,
    "text": " this is one example where you bring physics another example which I showed you is is here where um this is it this is the bicycle model again this comes from physics in terms of doing the inverse Dynamics uh kinematics so um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2705.313,
    "end": 2727.473,
    "text": " think that's a great question we have done some of it i don't know the answer to all of it how it is going to be done how it can be done but depending on the system i think it is very possible to incorporate physics but again when the system becomes complex it may not be very attractive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2729.917,
    "end": 2730.277,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.638,
    "end": 2734.221,
    "text": "Sorry, just add a small point to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.603,
    "end": 2741.189,
    "text": "So in training the diffusion model, we are using the data from the physical simulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.269,
    "end": 2754.422,
    "text": "So I think that was incorporated as a noise to the physical simulation where the diffusion model learns from data, the frictions and the physical properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.651,
    "end": 2760.237,
    "text": " And that was a very good point, Yulin, because there is another point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2760.257,
    "end": 2767.267,
    "text": "For example, when you are training it for buildings, for instance, you use some digital twin of the building, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2768.028,
    "end": 2781.166,
    "text": "And for that, again, that digital twin incorporates many of the physics elements of that building in the backend, not directly using the active influencing or diffusion, but in the backend it is using it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.247,
    "end": 2785.152,
    "text": "So there are different ways of using physics,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.132,
    "end": 2789.736,
    "text": " But again, assuming that it is tractable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.756,
    "end": 2790.076,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.997,
    "end": 2797.823,
    "text": "How did you handle perception through sensors and sensor fusion and feature extraction of the data from these sensors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.523,
    "end": 2814.717,
    "text": "So how do you do structured learning on everything from which of the kind of layers of the system to model on through which kinds of model architectures you used for the neural network mediated steps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.435,
    "end": 2840.316,
    "text": " well let's step back on it so if you are looking at from active influencing perspective well if you have a continuous systems then again you look at the dynamics continuous dynamics of the system if it is too complex of course you use this probabilistic framework to describe it if it is discrete more than likely you are using some sort of a markov or state transition",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2840.296,
    "end": 2853.58,
    "text": " behaviors so having said that let me just go back to this i'm glad that first of all let me also stop here there are many engineering systems that can be described by graphs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2854.302,
    "end": 2880.529,
    "text": " uh perhaps you can call them automata in in terms of the if you look at it from computer science perspective but the graph models are very usual but let me go back to this to answer that question and i'm glad that i have that slide in here um actually i kept that side looking at the questions that you have this is one good example of how i can use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.509,
    "end": 2903.901,
    "text": " the sensor information so if i'm looking looking at these tables you can think about lambda so think about it this way that you define a time a time unit and again i'm talking very engineering define a time unit one second two seconds five seconds whatever milliseconds and if you don't receive any information or any data you call it lambda",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2904.218,
    "end": 2912.87,
    "text": " P arrow up could be that temperature is going up, arrow down means temperature is coming up, coming down and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.89,
    "end": 2914.653,
    "text": "The same for the P pressure and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.093,
    "end": 2919.219,
    "text": "So basically what you see on this table, that's a process data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2919.259,
    "end": 2922.083,
    "text": "These are actual data you're receiving from the process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2922.764,
    "end": 2934.04,
    "text": "But there is a methodology that you can take this and from that, you can create the automata or the state transition graph on the right-hand side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2934.02,
    "end": 2958.525,
    "text": " and as this sensor information or data is increasing and becoming more and more you can keep on updating your model so there are already ways of creating this type of structures now again in active influencing the underlying assumption is that if you are using a discrete model it is some sort of state transition diagram",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2958.877,
    "end": 2965.145,
    "text": " Okay, you use Markov blankets or you use state transition diagrams and there are ways to build it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2965.165,
    "end": 2968.63,
    "text": "I mean, it's not, we have done a lot of work on this in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2969.091,
    "end": 2973.156,
    "text": "This is an existing work in the literature for almost from 20 years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.897,
    "end": 2975.6,
    "text": "So there are ways to build that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.301,
    "end": 2982.589,
    "text": "But when you come to the active influencing or diffusion, you already assume that you have that structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2984.02,
    "end": 2988.227,
    "text": " Okay, so to us, it's not part of active influencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.267,
    "end": 2991.092,
    "text": "Active influencing, you already have it in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2991.513,
    "end": 2994.598,
    "text": "But again, of course, you can combine all of them together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2996.16,
    "end": 3001.93,
    "text": "Yeah, that was a really interesting angle with the noising process as sequential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.211,
    "end": 3006.778,
    "text": "Sorry, I'm getting a little bit of an echo from you still.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.919,
    "end": 3008.982,
    "text": "Could you just mute, Wilson?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.531,
    "end": 3011.152,
    "text": " Okay, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.612,
    "end": 3011.932,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.533,
    "end": 3024.085,
    "text": "Yeah, the sequential application of the Gaussian process, which also has kind of analogy in if you're 90% confident, each time step, then there's a decay in the confidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.726,
    "end": 3026.888,
    "text": "So it's kind of like projecting out through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.01,
    "end": 3039.542,
    "text": "And then planning backwards in time with increasing precision is like moving forward in reducing uncertainty about a path to take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.349,
    "end": 3059.235,
    "text": " in a planning space but it was the other direction from a diffusive information neutralizing direction and so it's a it's a algorithmic way to kind of talk about the forward and the backwards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.941,
    "end": 3080.768,
    "text": " aspect of gaining and removing information and um how do you plug this into existing engineering tools or what kinds of toolkits are you using for specifying and for running these models unmute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.52,
    "end": 3110.012,
    "text": " two models that we have tried so far one is that parking lot model in a simulated environment we have created the simulated environment for it we are planning to expand it of course and so that is one model and and and again the diffusion there well as you said it is a it's a it's a predictor it predicts and first it by going forward it tries to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3109.992,
    "end": 3135.814,
    "text": " uh lose information totally and then by going uh backward it tries to gain the information and by doing so it finds the its way of how to go from one random location in this parking area whatever that is to a to a to a specific um you know parking spot and by doing so then you you use this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3135.794,
    "end": 3142.446,
    "text": " into your optimization because you want to find which spot is really your best spot and you have to go and park there",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3142.662,
    "end": 3149.672,
    "text": " Honestly, it is so organic in engineering system because the engineering system works like this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3150.774,
    "end": 3153.478,
    "text": "In engineering system, you always have some organic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3153.798,
    "end": 3161.209,
    "text": "If you look at the human-like systems, and that is why I'm so interested in active influencing because it's so organic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3162.11,
    "end": 3163.672,
    "text": "We always do it that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3163.793,
    "end": 3166.797,
    "text": "You always have a process defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3166.777,
    "end": 3196.783,
    "text": " okay there is always a structure and you want to always use that structure to find the solution so to me it is very organic in engineering like systems and as i said many engineering systems you can use graphs to describe them many engineering systems are hierarchical you can decompose it and look at the you know simpler cases you can create abstractions but to me it is very natural that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3196.763,
    "end": 3224.07,
    "text": " you organically learn how to do things and then you use your expertise to find the best way of doing it you don't mix the two you basically well you you integrate the two but you understand that first you have to know how to build one piece but then you think about okay how am I going to optimize this so you use that knowledge to optimize it and that's exactly what we are trying to do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.35,
    "end": 3250.902,
    "text": " awesome all right in closing just give your thoughts on this it'll be awesome and and thanks again for this great work so what would be the obstacles to advancing this approach to more complex autonomous navigation scenarios and agents well honestly i don't know this may",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.708,
    "end": 3254.15,
    "text": " Again, see, there are two elements here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3254.17,
    "end": 3261.197,
    "text": "One is the diffusion or the projector, and the other one is the optimizer, which is active influencing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.218,
    "end": 3263.66,
    "text": "So we have a projector, we have an optimizer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3263.7,
    "end": 3265.362,
    "text": "These two are integrated together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.363,
    "end": 3268.325,
    "text": "I'm sure there will be complexities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3268.525,
    "end": 3275.412,
    "text": "And, you know, as we move on in this direction, I'm sure we will find many complexities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3275.492,
    "end": 3278.955,
    "text": "But let's just look at the projector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.035,
    "end": 3281.698,
    "text": "The projector, which is a diffusion,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3281.881,
    "end": 3310.842,
    "text": " it has to um i forgot to say that the two examples i showed you on the diffusion from the literature they both assume that the initial data sample is uh there is an expert so there is some expert information sitting there meaning that on the driving in the parking lot example i already know where i should be going i am expert in going from one point to a parking spot",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3311.26,
    "end": 3327.463,
    "text": " we don't want to make that assumption we are looking at cases that there is no expert information on this so you really have to learn from almost nothing when you do it that way then you have to somehow find ways of doing a lot of sampling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3328.237,
    "end": 3352.54,
    "text": " well the sampling with diffusion is much much easier than and much more efficient than doing Monte Carlo searches much much easier than that but still you have to create that type of knowledge base and then you use that knowledge base in your optimization so I personally think that that may be an area that needs some attention",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3352.52,
    "end": 3370.815,
    "text": " and the second area is of course the complexity of active influencing an engineering system itself because you know engineering systems are big it's huge i mean if you want to look at real applications you're really looking at large systems i mean a production system there may be hundreds",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3370.795,
    "end": 3395.335,
    "text": " thousands of machines and processes that you have to integrate all together how do you incorporate all this into this fusion diffusion and active influencing framework well remains to be seen but definitely a very interesting problem awesome yulin do you have any last words or or what what stage are you in in europe where are you going where are you going with that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3395.939,
    "end": 3414.606,
    "text": " well uh just to answer your last question um i think the biggest challenging is growing state space right if if the problem if the like the driving navigation problem gets extremely complex if we introduce a bigger map then space space a state space will just explode",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.835,
    "end": 3419.378,
    "text": " It will introduce a very big computational challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.819,
    "end": 3427.946,
    "text": "That's why we want to use diffusion and we want to use the window stitch method to separate a big problem into smaller problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.428,
    "end": 3430.989,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3431.009,
    "end": 3431.389,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.031,
    "end": 3434.192,
    "text": "Thank you again for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.412,
    "end": 3437.995,
    "text": "Looking forward to hearing more about this work in due time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.497,
    "end": 3440.297,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3440.338,
    "end": 3441.218,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3441.459,
    "end": 3441.979,
    "text": "Thanks so much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3442.199,
    "end": 3443.04,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]