[
  {
    "start": 3.22,
    "end": 29.329,
    "text": " okay welcome back cohort six we're in our first discussion of chapter four so andrew however you'd like to begin and for everyone else any questions in the chat or raise your hand or however and let's jump into four perfect um yeah welcome everyone we're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.917,
    "end": 35.995,
    "text": " going over chapter four for the first time with cohort six.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.139,
    "end": 45.05,
    "text": " For warning, for anyone new to active inference, this chapter is a bit more mathematically involved than the preceding chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 46.012,
    "end": 54.103,
    "text": "But this is where we actually start to relate a lot of the concepts and kind of overview ideas that we've already been introduced to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 54.123,
    "end": 60.312,
    "text": "We begin to kind of map these more mathematically to understand the computations involved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 60.292,
    "end": 61.895,
    "text": " in active inference models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 63.978,
    "end": 77.001,
    "text": "So more specifically, this chapter goes through the typical forms of active inference generative models we'll see, both in discrete and continuous time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 76.981,
    "end": 103.09,
    "text": " um the relationship between those models and uh the dynamics of minimizing their free energy um at the very end we're also briefly introduced to other things that we'll see in later chapters including inferential message passing so um i would like to i i think this chapter does well at highlighting the importance of approximate inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 103.475,
    "end": 113.923,
    "text": " We've seen before that a lot of the underlying assumptions in active inference involves the minimization of free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 113.943,
    "end": 115.527,
    "text": "Now really,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 115.591,
    "end": 122.482,
    "text": " The idea is that agents would want to, quote unquote, want to minimize surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.243,
    "end": 132.739,
    "text": "But because we need to actually render the computation tractable, we instead are minimizing a quantity known as free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 135.443,
    "end": 138.628,
    "text": "Quick note that the mathematics involved here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 139.047,
    "end": 151.22,
    "text": " draw from different mathematical fields, primarily linear algebra, differentiation and multivariate calculus, and the use of Taylor series expansions and some others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.061,
    "end": 168.379,
    "text": "There are some nice appendices in the back of the textbook for anyone who's either new to those areas of maths or need some kind of refresher and would like to get a closer look on their relationships specifically with the computations involved here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.118,
    "end": 174.663,
    "text": " And so sort of the core here is that we're introduced with the equation 4.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 175.744,
    "end": 183.732,
    "text": "We already know from previous chapters, a generative model in a certain way can be reduced to a prior and a likelihood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 183.752,
    "end": 187.896,
    "text": "Those fit right into Bayes' theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 188.196,
    "end": 189.037,
    "text": "That's equation 4.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.278,
    "end": 196.324,
    "text": "And so it relates the prior and the likelihood on the left-hand side, which you could just replace with, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 196.304,
    "end": 201.432,
    "text": " oftentimes there's a notation, the letter M to denote a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.852,
    "end": 219.019,
    "text": "And then on the right side, those end up equaling a posterior distribution, which is your hidden states conditioned on your observations times Y or your observations, so your evidence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 219.479,
    "end": 223.746,
    "text": "And so you can imagine whenever the agent basically",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 224.249,
    "end": 228.579,
    "text": " takes in new observations, all these quantities can be updated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 229.361,
    "end": 235.094,
    "text": "And that's the kind of nice, easier kind of introductory view of how this works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 235.896,
    "end": 240.908,
    "text": "As far as rendering everything tractable,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.888,
    "end": 255.49,
    "text": " Um, we also exploit something called Jensen's inequality, um, put in simple terms, Jensen's inequality says the log of an average is always greater than or equal to the average of a log.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 256.492,
    "end": 257.293,
    "text": "Um, so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 257.695,
    "end": 262.523,
    "text": " We can exploit that and rewrite Bayes' theorem using logs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 264.065,
    "end": 272.359,
    "text": "And we use a different notation rather than a capital P that might be used to denote an exact distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 272.419,
    "end": 278.809,
    "text": "We can use a Q, which is used to denote an approximate distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.38,
    "end": 281.121,
    "text": " and replace that in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 281.222,
    "end": 298.236,
    "text": "And so the whole idea is by minimizing free energy as a kind of proxy that is always greater than or equal to surprise, the agent, again, quote unquote, wants to minimize free energy in order to minimize its surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 298.396,
    "end": 308.745,
    "text": "If you can get those two quantities to be virtually zero and virtually equal to one another, that would be kind of the general overall goal",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 308.995,
    "end": 325.047,
    "text": " um and to kind of zoom through a bit more of the rest of what happens in this chapter we get a further breakdown of what comprises free energy um it involves um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 325.651,
    "end": 343.643,
    "text": " using Colbeck-Liebler divergence between that approximate distribution, the Q I mentioned earlier, and an exact inference P, and then subtracting log model evidence from that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.348,
    "end": 356.35,
    "text": " Michael Prast- figure 4.3 or excuse me 4.2 were introduced to the kind of factor graph notation that's often used in act building active inference models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 356.802,
    "end": 359.686,
    "text": " Um, these are not yet active inference models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 359.826,
    "end": 367.375,
    "text": "There's simpler static perception models, but they give a nice kind of quick view of here are the kinds of things we'll be getting into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.536,
    "end": 376.887,
    "text": "We have variables, uh, every single one of these involves something we're already familiar with, which is, uh, for a generative model, we have a prior, we have a likelihood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 377.168,
    "end": 383.175,
    "text": "So all of those models involve the core components of a, of a generative model or agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 383.656,
    "end": 383.896,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 384.137,
    "end": 384.497,
    "text": "So.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 385.237,
    "end": 407.751,
    "text": " Um, from there, we, it, it shifts into figure 4.3, um, which will have very similar components, but we're now introduced to active inference in that, uh, we now have actions that the agent takes, which then impact, uh, state transitions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 408.136,
    "end": 416.044,
    "text": " So we've moved from figure 4.2 of just none of the models in 4.2 have action involved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.224,
    "end": 423.411,
    "text": "None of them have like necessarily show some kind of temporal sequence of things playing out over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.971,
    "end": 434.802,
    "text": "You know, it's simply just these more static perceptual models that there's a nice example there where the one in the top left can be modeled as like, um, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 435.102,
    "end": 458.477,
    "text": " a disease and uh taking a diagnostic test that then computes like the the result of you know if if you uh administer a test on a person who has a hit we're trying to derive a hidden state here marked as x do they have disease like what is it or do they have it or not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.643,
    "end": 462.767,
    "text": " why is the result of the test, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 462.788,
    "end": 467.653,
    "text": "So that's kind of a way of looking at how these things are linked together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.213,
    "end": 470.896,
    "text": "We have a prior, which is the prevalence of the disease.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.037,
    "end": 476.482,
    "text": "We have a likelihood, which is, you know, what is the result of the test given the disease?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 476.943,
    "end": 487.114,
    "text": "We can use Bayes' theorem and what could be called model inversion to switch around, see, okay, what is the,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 487.094,
    "end": 490.621,
    "text": " is there a disease given the particular result of the test?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 491.924,
    "end": 502.605,
    "text": "Strongly recommend just kind of reading through those couple of paragraphs to get a better sense of what's going on there, because it's much more descriptively clear than probably how I'm describing it here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 502.906,
    "end": 508.056,
    "text": "But in any case, yeah, it's a good resource for getting started on these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 508.525,
    "end": 520.758,
    "text": " And then figure 4.3, the difference where we now have active inference models is that we actually have a temporal dimension, which is we're now including state transitions over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 521.559,
    "end": 535.815,
    "text": "So you can read those graphs in figure 4.3 from left to right, t minus 1 to t, the current time step, to t plus 1, which is the next time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 535.795,
    "end": 544.187,
    "text": " So the agent is basically taking in those observations at the bottom of that particular graph that Daniel has zoomed in on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 546.11,
    "end": 553.18,
    "text": "We have these linkages with the hidden states as we saw before, but now we have policies impacting the state transition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 553.16,
    "end": 567.783,
    "text": " as the agent engages in actions or sequences of actions, which is another way of saying what a policy is, in order to try and the agent tries to impact the changes in the states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 568.284,
    "end": 573.632,
    "text": "So that is kind of the active part of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 575.283,
    "end": 580.553,
    "text": " And then from there, section 4.4, it's a little bit more involved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 581.454,
    "end": 588.627,
    "text": "We can take all of these ideas that we've been introduced to, likelihoods, transitions, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.028,
    "end": 593.456,
    "text": "We can map those out to different components of our models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 593.556,
    "end": 595.62,
    "text": "So now a likelihood model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 595.685,
    "end": 599.898,
    "text": " is now called an A matrix or A tensor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 601.282,
    "end": 606.538,
    "text": "The transitions model is now the B matrix or B tensor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 606.856,
    "end": 632.408,
    "text": " The priors over states are now a vector called D. We also now have preferences that the model has, which are in a C vector, super important for the agent actually realizing its preferences or expected observations, which is an idea we were already introduced to in previous chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 632.742,
    "end": 650.953,
    "text": " So the idea here is that we're able to just kind of map a lot of the more verbally described ideas that we've already seen in preceding chapters to these different components of a model, and then seeing how computationally we can minimize free energy over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 652.115,
    "end": 668.7,
    "text": " A couple other ideas that are brought up, but I won't go into too strongly right now because I want to allow time for questions and discussion are expected free energy or otherwise known as G that's related to planning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 669.261,
    "end": 677.093,
    "text": "This is where the agent doesn't just look at past observations or current observations to minimize its free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 677.073,
    "end": 680.617,
    "text": " but it also wants to realize its preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 680.938,
    "end": 690.269,
    "text": "And so it has to kind of plan what it will do in order to realize those preferences or goals that it already has, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 690.75,
    "end": 697.278,
    "text": "So G plays in that the agent actually wants to kind of plan ahead of time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 697.458,
    "end": 698.479,
    "text": "What should it do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 699.781,
    "end": 703.806,
    "text": "So the C vector of preferences plays into that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.904,
    "end": 716.901,
    "text": " You can look at the way that the agent chooses different actions or policies to take as it's actually computing expected free energy for each policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 717.286,
    "end": 719.589,
    "text": " And then it scores the policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 719.669,
    "end": 720.27,
    "text": "Should I do X?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 721.352,
    "end": 722.253,
    "text": "Should I do Y?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 722.273,
    "end": 727.52,
    "text": "Or let me revise that because the notation, I don't want it to get mixed up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 727.54,
    "end": 731.326,
    "text": "Should I do policy number one, policy number two, policy number three?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 731.786,
    "end": 737.134,
    "text": "Well, let's score the expected free energy for each of those policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 737.114,
    "end": 765.653,
    "text": " And whichever one has the lowest expected free energy at the end, you go with that policy and you go with the actions that that policy entails in order to impact the environment, in order to impact the state transitions based on your transitions model, which basically is how do you think your actions are going to impact the environment around you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 765.633,
    "end": 771.386,
    "text": " Even more quickly, some other top line topics that were introduced to Markov blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 771.707,
    "end": 775.857,
    "text": "We've already seen some references to those in previous chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 776.679,
    "end": 784.637,
    "text": "There's a nice box that describes more on Markov blankets and not just how Markov blankets are kind of conceptual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.617,
    "end": 798.272,
    "text": " concept that separates an agent from its environment, but furthermore, kind of the maths underlying what a Markov blanket is about statistical independencies and dependencies between variables and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.59,
    "end": 803.979,
    "text": " We get more on continuous time models, which are frankly much more mathematically involved, I would say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 804.019,
    "end": 813.335,
    "text": "Involves more in the way of differentiation and looking at temporal derivatives and applying Taylor series expansions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 814.417,
    "end": 820.648,
    "text": "A concept called generalized coordinates of motion that's involved, as well as Laplace approximation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 821.017,
    "end": 839.907,
    "text": " And finally, at the very end of the chapter, we're briefly introduced to what's called Bayesian message passing, just kind of how, if we think about these models as graphs, as we've already seen, messages are being passed around between nodes via edges.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.768,
    "end": 846.197,
    "text": "And that has a significant amount of neurobiological",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 846.532,
    "end": 851.44,
    "text": " plausibility behind it theoretically and through continued empirical study.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 851.941,
    "end": 861.636,
    "text": "And so that's the kind of neuroscientific or neurobiological backing to being able to say how a lot of this works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.916,
    "end": 869.869,
    "text": "And for anyone's especially interested in message passing, we'll see a lot more of that in chapter five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 871.632,
    "end": 873.855,
    "text": "I would also recommend to anyone",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 874.223,
    "end": 884.18,
    "text": " more interested in planning in these discrete time models with the A and B and C and D components and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.58,
    "end": 892.333,
    "text": "If you want to skip ahead to chapter seven, that chapter is entirely centered on discrete time models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 892.313,
    "end": 902.177,
    "text": " It'll have more breakdowns of these different terms that are involved in computing G like we see terms like expected ambiguity and risk in this chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 902.217,
    "end": 906.728,
    "text": "There are other ways that you can break down how we compute G.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 907.028,
    "end": 923.637,
    "text": " And it's nice to have these kind of words like risk or expected ambiguity that maybe gives a better intuitive sense of the maths involved and how it's useful, how it plays into the explore, exploit, trade off model behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 924.106,
    "end": 931.72,
    "text": " Anyway, I feel like I've already covered the gist of what's going on in this chapter and maybe even overspoken.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 931.74,
    "end": 947.008,
    "text": "So if anyone has any questions, thoughts on any of this or any other particular topic they want to get into, please feel free to raise your hand or just unmute yourself and go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.498,
    "end": 958.025,
    "text": " Yeah, I have a couple of questions related to the statistical side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 958.085,
    "end": 967.984,
    "text": "How would this relate to calculating something like the R0, like we look at in epidemiology, where you're looking at a predictive state with an n value of 0?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 970.816,
    "end": 971.757,
    "text": " I'll give a short answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.798,
    "end": 973.64,
    "text": "There's probably multiple ways you could do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.141,
    "end": 980.591,
    "text": "But I mean, one way to handle it would be treat the true R0 as a hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.332,
    "end": 983.315,
    "text": "And then you make observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.936,
    "end": 989.806,
    "text": "So you have an epidemiological inference trying to estimate an underlying parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.306,
    "end": 992.77,
    "text": "That could be the temperature in the room with a thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.79,
    "end": 995.895,
    "text": "It could be the R0 with a sampling from the noisy tests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.124,
    "end": 999.207,
    "text": " That's kind of the general approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.547,
    "end": 1000.829,
    "text": "It's what SPM does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.189,
    "end": 1013.044,
    "text": "You have the underlying neural activity unobserved, and then you have neuroimaging data, which is being caused by very nonlinear relationship with neural activity, like with the blood flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.845,
    "end": 1024.718,
    "text": "That's the general process of perceptual inference is pretty much separate out what you're really, the underlying variable hidden state that you're trying to estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1025.002,
    "end": 1027.606,
    "text": " and then separate that out from the observations you're getting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.626,
    "end": 1034.976,
    "text": "And then you load up onto the A, how the hidden state is related to the observation synchronously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.996,
    "end": 1039.823,
    "text": "Then you load up onto the B, how that hidden state changes through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.863,
    "end": 1043.428,
    "text": "And then you can layer in the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1044.43,
    "end": 1044.75,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.331,
    "end": 1047.474,
    "text": "Can you do that recursively with elliptic curve then?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1048.616,
    "end": 1050.418,
    "text": "So would you step back over?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1050.579,
    "end": 1053.743,
    "text": "So you would have to do linear step function back over through, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.693,
    "end": 1059.696,
    "text": " Again, not sure how the curve, you mean like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.859,
    "end": 1066.242,
    "text": "So I'm just thinking of it in terms of the math with like the heavy side step function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1066.282,
    "end": 1086.582,
    "text": "So if you're going down from a three state to a two state, see how you have, like, you're almost jumping that zero state, but really what you're doing is sinusoidally passing through it with an elliptic curve in a way, but you're passing through a negative with a positive direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1090.46,
    "end": 1098.358,
    "text": " sketch out an agent that's doing that or having it done to them and then try to make it look like figure 4.3 and then you'll probably be close to an answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.182,
    "end": 1099.423,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.615,
    "end": 1122.137,
    "text": " Thanks for the summary, Andrew.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.099,
    "end": 1125.442,
    "text": "This is a dense chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.408,
    "end": 1132.372,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1132.513,
    "end": 1132.633,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1134.495,
    "end": 1134.836,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.717,
    "end": 1136.859,
    "text": "Chapter one, introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.28,
    "end": 1140.725,
    "text": "Two and three, low road and high road, getting to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.865,
    "end": 1142.648,
    "text": "Chapter four, it's active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.268,
    "end": 1147.755,
    "text": "Chapter five, neurobiology case studies of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.516,
    "end": 1149.778,
    "text": "That's the first half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.998,
    "end": 1157.324,
    "text": " And then chapter six, recipe for making it yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1157.484,
    "end": 1159.247,
    "text": "Chapter seven and eight, revisit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.868,
    "end": 1161.63,
    "text": "Sections 4.4 and 4.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1161.65,
    "end": 1164.794,
    "text": "Nine, bringing in data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1165.195,
    "end": 1166.397,
    "text": "Chapter 10, summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.565,
    "end": 1180.356,
    "text": "So we get a significant amount of kind of back and forth between kind of more verbal descriptions of the ideas and concepts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1181.197,
    "end": 1183.381,
    "text": " But we have to come back to the maths, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1183.401,
    "end": 1185.624,
    "text": "That's essential.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1185.705,
    "end": 1198.446,
    "text": "And I think that's what chapter four does, is just quickly give you a broad stroke of here are the maths underlying a lot of these ideas and how the dynamics play out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1206.172,
    "end": 1210.416,
    "text": " JR made a really nice comment in the Discord a few days ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.456,
    "end": 1214.159,
    "text": "This is a new paper, Active Data Selection Information Seeking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.96,
    "end": 1219.744,
    "text": "And here there's a slightly new and different notation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.186,
    "end": 1229.312,
    "text": "Lambda operator introduced to indicate either summation or integration, depending on whether we're dealing with continuous or discrete variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.393,
    "end": 1234.997,
    "text": "So here we're approaching that in the time setting, but it's kind of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.277,
    "end": 1243.048,
    "text": " This comes up a lot, like whether the variable is continuous or discrete, and then whether time is being treated continuously or discreetly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.068,
    "end": 1248.857,
    "text": "Those are options under the umbrella of active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.28,
    "end": 1257.31,
    "text": "So the actual kind of pseudocode is not predicated on the variables being continuous or discrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.376,
    "end": 1264.461,
    "text": "That, to me, intuitively just seems...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1265.285,
    "end": 1272.14,
    "text": " really nice and allows for a more direct relationship between the continuous and discrete variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.241,
    "end": 1279.497,
    "text": "Because you have this chapter four here, as well as comparing chapter seven and chapter eight,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1279.763,
    "end": 1284.19,
    "text": " It's like the textbook kind of presents discrete and continuous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1284.21,
    "end": 1291.901,
    "text": "I mean, of course, free energy minimization and a lot of other concepts are shared between the two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1291.981,
    "end": 1299.072,
    "text": "But I mean, we get a kind of sharp distinction between using discrete and continuous variables all the way down to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.372,
    "end": 1307.693,
    "text": " the very notation being different, your S's and O's for discrete versus X's and Y's for continuous and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1307.713,
    "end": 1313.888,
    "text": "So it's nice to see an equation that can kind of relate or compound the two",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1314.239,
    "end": 1332.32,
    "text": " to where you just need to kind of know if it's discrete or continuous, and then similar process for each while knowing, of course, that discrete variables you're working with point masses and summations as opposed to integrations and so on with continuous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.324,
    "end": 1340.289,
    "text": "That's another point to be taken for the ontology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1340.91,
    "end": 1341.31,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.677,
    "end": 1352.565,
    "text": " Um, Peter or, or anyone?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.018,
    "end": 1355.16,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.68,
    "end": 1358.283,
    "text": "So I loved this chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.303,
    "end": 1359.624,
    "text": "I thought it was really cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.084,
    "end": 1364.088,
    "text": "I'm pretty excited by the lambda notation that was just described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.128,
    "end": 1367.691,
    "text": "I was unaware of that, and there's a lot to think about there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.492,
    "end": 1376.719,
    "text": "In some ways, this was the chapter that I was personally least comfortable with in terms of my ability to sort of grok everything that I needed to get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.64,
    "end": 1383.025,
    "text": "My personal background is mostly on the neurobio side, and I have much less in the way of mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.005,
    "end": 1406.686,
    "text": " I was wondering, so I haven't checked out the references at the back yet, so maybe that's actually gonna answer my question, but I was wondering, does the active infants group have any kind of like a learning path for the supporting mathematics that you would need to really be able to be really kind of fluent with this chapter and like, for example, be able to plug in values and do things with the model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.766,
    "end": 1411.29,
    "text": "Like, do we have any kind of a guide of like, hey, if you wanna learn, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1411.54,
    "end": 1420.275,
    "text": " Taylor series expansion here's where to get it, if you want to learn linear algebra like here's a particularly good text because i'd be interested to sort of take that stuff on over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.66,
    "end": 1433.599,
    "text": "Thanks yeah i'm in the math learning kind of subsection, this is, you know quiescence till or when people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.946,
    "end": 1440.194,
    "text": " don't want to do it, but then as people want to do it, like anyone's welcome to just say, this time UTC, I'm going to do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.436,
    "end": 1445.402,
    "text": "Like in Discord or however, or just make the edits directly here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.462,
    "end": 1452.873,
    "text": "This math learning and resources has at least many.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.893,
    "end": 1460.445,
    "text": "I think the language models are really good at this right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.505,
    "end": 1462.067,
    "text": "This kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.402,
    "end": 1465.946,
    "text": " like undergraduate level math, which is hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.067,
    "end": 1469.81,
    "text": "That is a good specialty of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.611,
    "end": 1476.357,
    "text": "And then another possibility with the learning is from the equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.138,
    "end": 1480.521,
    "text": "Here, all the equations have been put into LaTeX.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1482.963,
    "end": 1489.27,
    "text": "Then this can just be, so even if you're working with a language model that doesn't have the ability to put in a screenshot,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.672,
    "end": 1511.292,
    "text": " can just put in this or look at what we have here and then look at the explanation why would a high schooler be interested what's the pseudocode where is it important what are the variables these are just tentative but they do um even where they contain like some like i guess factual you know omissions or or errors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.272,
    "end": 1517.402,
    "text": " they give it the style of what information is in the equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.442,
    "end": 1525.695,
    "text": "And just like one plus one equals two, one plus one equals question mark, like you could spend the rest of your life truly pondering it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.376,
    "end": 1530.362,
    "text": "So there's never going to be a moment, okay, I'm done with Bayes' equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.382,
    "end": 1533.086,
    "text": "I finally, you know, don't need to wonder about it anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.126,
    "end": 1538.595,
    "text": "But then knowing that it will never be fully resolved",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.744,
    "end": 1544.317,
    "text": " getting to kind of just like a stopping point with feeling like you don't know at all what it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.62,
    "end": 1550.712,
    "text": "And then just seeing a bunch of related natural language descriptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.534,
    "end": 1557.107,
    "text": "And then also our handwritten natural language descriptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.425,
    "end": 1559.187,
    "text": " which anyone can also add to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.247,
    "end": 1571.261,
    "text": "Sometimes just seeing it written out linguistically instead of only symbolically can help, especially because then you can replace X with hidden state and Y with observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.023,
    "end": 1580.412,
    "text": "And then from there, that can translate to other languages, but also you could replace, okay, hidden state with temperature, observation with thermometer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.493,
    "end": 1587.06,
    "text": "And then this starts to look more like the probability of the temperature times the temperature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.125,
    "end": 1616.845,
    "text": " thermometer given the temperature and so then it's like easier to jump between a tangible example and all these other like kind of aspects of the holistic math understanding and like Jonathan Schock and Ali Blue others have like also thought about how to what kind of math is important to lead up to the textbook group",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.095,
    "end": 1623.27,
    "text": " And in the appendices, they do mention what they see as the important background areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.613,
    "end": 1627.74,
    "text": "I think it's A, linear algebra.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.622,
    "end": 1631.83,
    "text": "So doing operations on matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.755,
    "end": 1636.08,
    "text": " adding and multiplying products on matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.881,
    "end": 1640.927,
    "text": "Taylor series approximations, this is important for the continuous time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.608,
    "end": 1645.914,
    "text": "This is where you take a point and then you try to extrapolate a continuation around that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.716,
    "end": 1649.7,
    "text": "Variational calculus and stochastic dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.338,
    "end": 1670.305,
    "text": " This appendix may still not be the perfect resource to learn those four topics, but the fact that they listed them out as the four topics, then going to any like highly rated online course or like popular videos on these topics is probably pretty helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.078,
    "end": 1700.14,
    "text": " linear algebra very much is and stochastic dynamics or just statistics i think also is critically important it's fantastic thank you it's uh beyond helpful really appreciate it peter i'm in the process of learning all of this myself so i'd be willing to work with you if you wanted to do something as well within discord or something through coda",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1701.385,
    "end": 1702.426,
    "text": " Sure, that'd be great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.75,
    "end": 1707.872,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.512,
    "end": 1711.135,
    "text": "Are you on the Discord?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1711.155,
    "end": 1713.617,
    "text": "Yeah, I just joined a couple days ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.739,
    "end": 1715.299,
    "text": "Okay, great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.122,
    "end": 1720.324,
    "text": "There is a textbook group channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.946,
    "end": 1727.832,
    "text": "You can try to join in or just post somewhere if you can't find it or anything, but then we can just kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.364,
    "end": 1738.673,
    "text": " keep that discussion alive and, um, like, yeah, knowing, knowing what this symbolizes helps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.634,
    "end": 1747.783,
    "text": "There probably is a point of diminishing return with learning any of the background maths, but also they're their own reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.223,
    "end": 1749.084,
    "text": "So they're fun to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.269,
    "end": 1756.131,
    "text": "I might throw this into the, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1757.225,
    "end": 1764.327,
    "text": " CODA as well, but just sharing if anyone is familiar with Coursera courses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1764.467,
    "end": 1769.462,
    "text": "For me, I've had to do a lot of learning asynchronously from the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1769.847,
    "end": 1792.21,
    "text": " institute and i really like this one um just because um you know it has a couple courses there it's very intuitive and especially for anyone who wants to move in the direction of like implementing and learning with um python it mainly focuses on that but yeah the first course is linear algebra but in the context of like we're learning matrices we're learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1792.19,
    "end": 1818.501,
    "text": " how to multiply them and so on um and then by time we get to the second course it's multivariate calculus and so all of a sudden you're learning about like gradient descent uh with multiple variables involved so just the first two courses of of that link i shared um i find immensely helpful for at least as a starting point it just walks you through everything so yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.713,
    "end": 1845.889,
    "text": " depending on where someone's at with their programming or engineering or anything it can help just to think of these as variables like s can be kind of treated with one handle as like a mathematical variable and if you want to go into the um like the abstraction and the analysis and the category theory then it is going to be helpful to just pick up s of t with one handle and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.869,
    "end": 1852.978,
    "text": " But then at the same time, when you actually write the PyMDP code, S is going to be like a matrix of a defined shape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.899,
    "end": 1859.666,
    "text": "So then going to the PyMDP documentation and examples and just seeing like, okay, what shape is A, B, C, D?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.087,
    "end": 1860.347,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.128,
    "end": 1861.969,
    "text": "That's the whole agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.37,
    "end": 1863.611,
    "text": "That's the active inference agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.652,
    "end": 1865.994,
    "text": "That can help ground it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.855,
    "end": 1873.243,
    "text": "That's not the general case, but seeing how minimal...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.287,
    "end": 1887.401,
    "text": " a small case can be is helpful to know like what a complete generative model is and kind of calibrate how challenging different kinds of phenomena might be to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.249,
    "end": 1895.349,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.369,
    "end": 1901.475,
    "text": "PyMDP, open source package, discrete time, but this is a good...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.607,
    "end": 1910.055,
    "text": " package that's really focused to like getting as fast as possible to the discrete time agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.457,
    "end": 1919.805,
    "text": "Whereas RxInfer as we're exploring week after week is general and continuous and all these other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.406,
    "end": 1924.13,
    "text": "POMDP gets you really fast to the POMDP like chapter seven model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.731,
    "end": 1926.552,
    "text": "There are great",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.877,
    "end": 1949.299,
    "text": " demos including that you can just open it up in a notebook you can copy the notebook or use this version and just like run it right here and see the full active inference model you can also clone it locally into like cursor.sh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.562,
    "end": 1953.33,
    "text": " with a code enabled development environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.391,
    "end": 1959.649,
    "text": "And then you can chat with the code base and ask questions about like PyMDP or any other package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.214,
    "end": 1964.183,
    "text": "So this can be extremely helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.337,
    "end": 2005.847,
    "text": " yeah i think that's great um i would say for for people who are just getting into this and thinking about how to set up a model as well some things uh if you want to start with py mdp or otherwise um and again if you want to jump to modeling i would strongly recommend having uh and you have the time for it have a look at chapters seven and eight that'll definitely go over more like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2005.827,
    "end": 2008.25,
    "text": " more specifically how to construct models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2008.931,
    "end": 2016.319,
    "text": "For anyone who's thinking like, okay, I have a particular project, how do I map the variables to these different components of a POMDP?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2016.339,
    "end": 2018.361,
    "text": "For example, you can have a look at chapter seven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2018.942,
    "end": 2027.412,
    "text": "It'll get into things like, okay, we have states, we have observations, like two crucial parts of a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2028.473,
    "end": 2031.496,
    "text": "Well, maybe I have different forms of data that I'm bringing in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2031.556,
    "end": 2032.898,
    "text": "Like for example, someone,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2032.878,
    "end": 2039.793,
    "text": " doing something more physiological and clinically based in a lab or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2039.813,
    "end": 2046.527,
    "text": "Maybe you're collecting neuroimaging data in addition to heart monitor data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2046.948,
    "end": 2051.578,
    "text": "So suddenly you have two different data streams coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2051.558,
    "end": 2057.327,
    "text": " you can map those as different like observation modalities is what they'd be called.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2057.367,
    "end": 2069.567,
    "text": "And basically you'll just be constructing your matrices, the A and the B and so on that account for like these different data streams that account for different hidden states that you're trying to inferring.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2069.547,
    "end": 2071.792,
    "text": " Trying to infer so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2073.215,
    "end": 2075.279,
    "text": "PyMDP is great for that too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2075.419,
    "end": 2084.759,
    "text": "If you are wanting to use Python or at least using it as a learning tool, because all of these examples, there's the teammates one that Daniel scrolling through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2084.799,
    "end": 2088.467,
    "text": "There's another one that sets up a two armed tool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2088.447,
    "end": 2100.246,
    "text": " bandit model just like uh an agent who um you know picks from one of two like kind of slot conceptually what are like slot machines and um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2100.563,
    "end": 2108.231,
    "text": " So you have, it shows you how to like, oh, you have multiple forms of data or observations that are coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2108.271,
    "end": 2111.174,
    "text": "You have multiple hidden states that the agent is trying to infer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2111.694,
    "end": 2115.038,
    "text": "You will set those up as like matrices or tensors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2115.759,
    "end": 2123.947,
    "text": "And that's kind of where the linear algebra plays in and being familiar with matrix operations becomes really important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2124.087,
    "end": 2125.689,
    "text": "But it's really nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.709,
    "end": 2127.01,
    "text": "Yeah, David, you have your hand up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2127.648,
    "end": 2136.162,
    "text": " Yeah, in regards to the choice function there, would that apply to what we covered earlier in terms of the lambda function or the lambda operator rather?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2136.202,
    "end": 2141.37,
    "text": "Let's see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.811,
    "end": 2149.342,
    "text": "Okay, we can look back at the lambda, but about like the behavioral selection itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.084,
    "end": 2152.828,
    "text": "Let's find kind of exactly where it comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.402,
    "end": 2162.486,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.506,
    "end": 2163.668,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.688,
    "end": 2167.615,
    "text": "So in this, this is the tutorial one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.698,
    "end": 2176.029,
    "text": "There's going to be, they first have a simpler version with no planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.191,
    "end": 2179.595,
    "text": "So here's an active inference loop with no planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.899,
    "end": 2183.963,
    "text": "Then planning comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.567,
    "end": 2192.53,
    "text": " So a big, big question arising when doing the modeling is like, are we working with something that plants?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2194.315,
    "end": 2196.602,
    "text": "And even behavior that kind of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.696,
    "end": 2203.984,
    "text": " seems plan-like might be underpinned by simply heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.004,
    "end": 2210.914,
    "text": "Like a flock of birds, you might not need to appeal to it doing a long-term planning for its coordinated movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.755,
    "end": 2216.481,
    "text": "You might just be able to explain that with single time step behavior of the birds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.461,
    "end": 2224.855,
    "text": " So just because something is acting adaptively through multiple timescales doesn't mean that it needs to be planned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.737,
    "end": 2232.428,
    "text": "But you may still model something from the outside as if it's doing planning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.408,
    "end": 2246.637,
    "text": " um whether or not it is map and territory and all that okay now given that here's here's where when you're in um the planning setting here's where the the choice comes into play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.312,
    "end": 2252.839,
    "text": " Calculate expected free energy of actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.3,
    "end": 2265.874,
    "text": "So here we actually are using expected free energy G, and it is calculating the expected free energy based upon essentially all the variables that come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.985,
    "end": 2279.157,
    "text": " And then they, so it takes in the policy prior, which is like E or habit, which is just your before thinking about planning, what is your habit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.837,
    "end": 2282.88,
    "text": "So if you're doing like a fair teammates rat, it might just be 50-50.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.561,
    "end": 2288.566,
    "text": "Or if it's a teammates rat, but it has like an 80-20 bias for one direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.367,
    "end": 2296.013,
    "text": "Then each of the policies get reweighted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.752,
    "end": 2307.729,
    "text": " The policy variable sums up to one, and then here they're reweighted to update to a policy posterior, and then here chosen action is sampled from the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.33,
    "end": 2314.821,
    "text": "Earlier, Andrew also said you could just pick the lowest one, or you can sample from this distribution, and there's other things you can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.302,
    "end": 2320.009,
    "text": "So expected free energy isn't a choice function itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2319.989,
    "end": 2328.539,
    "text": " It's a reweighting of the likelihood of policies that then enables you to take different kinds of choice functions secondarily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2329.16,
    "end": 2333.164,
    "text": "So would policy Q be, in essence, the quiescent point of pi?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2335.487,
    "end": 2336.688,
    "text": "Which one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2336.809,
    "end": 2348.342,
    "text": "So where you have Q underscore pi is the softmax at negative G. So would that be like a horizon point, essentially, where you're measuring at?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.841,
    "end": 2354.266,
    "text": " Or measure it to a distance at softmax?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2354.947,
    "end": 2362.155,
    "text": "The time horizon is big T. So here, this is a five-time step simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.956,
    "end": 2370.505,
    "text": "And here, policy length is considering all combinations of policies of two affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.725,
    "end": 2376.231,
    "text": "So if you can go up, down, left, right, four affordances, then there's 16 policies of length two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.772,
    "end": 2378.734,
    "text": "And you have a range of four values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.085,
    "end": 2403.017,
    "text": " with the actions as the okay yeah the actions at each moment are the affordances policies are sequences of affordances for a given time um and then playing around with these variables is sweeping across them and making like summary diagnostic statistics about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.385,
    "end": 2432.363,
    "text": " portfolios of simulations is when you start to see interesting things okay great yeah i've been kind of modeling similar to this and i've been seeing similar things so i'll start working with this a bit more to solidify things perfect thank you cool and yeah it's uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2433.068,
    "end": 2438.758,
    "text": " As Daniel mentioned earlier, for anyone who's more directly interested in modeling,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2439.532,
    "end": 2445.201,
    "text": " Again, I'm personally trying to learn both PyMDP as well as RxInfer at the same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.241,
    "end": 2449.688,
    "text": "Two different programming languages because RxInfer is based in Julia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2450.169,
    "end": 2453.554,
    "text": "But we do have an ongoing institute project Thursday mornings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2454.676,
    "end": 2456.458,
    "text": "It's the RxInfer project.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2456.919,
    "end": 2464.611,
    "text": "And what's great is that one of the folks from BIAS Labs who's developing the RxInfer package",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.591,
    "end": 2467.635,
    "text": " um, is actually directly involved with that group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2467.755,
    "end": 2473.022,
    "text": "So we, we have some, some nice, uh, communication with one of the developers basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2473.443,
    "end": 2486.44,
    "text": "Um, and there we are, um, going through different examples right now that RxInfer, like those folks have directly made available, just like we were going through an example for PyMDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2486.52,
    "end": 2488.843,
    "text": "So they've done the same for RxInfer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2488.903,
    "end": 2490.345,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.325,
    "end": 2506.245,
    "text": " There's a nice kind of reciprocal relationship going on because we have the opportunity to tell the representative from BIAS Labs like, hey, we think you should, you know, maybe update your documentation to make it clearer on this particular point or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2506.265,
    "end": 2508.427,
    "text": "And then they help us with the learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2508.868,
    "end": 2512.873,
    "text": "But yeah, anyone who wants to kind of get more involved with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2512.853,
    "end": 2535.283,
    "text": " not to mention the the rx infer package seems to offer some capabilities beyond uh maybe what other methods allow for so um we were able to look more at like continuous time models which are certainly uh in certain ways more mathematically involved with all the integrations and so on so yeah this is a nice um example here like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.263,
    "end": 2557.828,
    "text": " This is trying to model a car that needs to take the right actions to exploit its velocity and acceleration in order to move up a hill landscape to reach a goal that it otherwise couldn't if it just put the pedal to the floor, so to speak.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2557.808,
    "end": 2563.018,
    "text": " And so the agent like learns what what it should do in order to reach that goal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.819,
    "end": 2565.903,
    "text": "But yeah, so they're just like toy examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.043,
    "end": 2568.968,
    "text": "But yeah, super cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.389,
    "end": 2569.75,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2570.09,
    "end": 2576.282,
    "text": "And I think useful for you if you have your own project that you under want to undertake using this is kind of like a foundation for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.602,
    "end": 2577.684,
    "text": "Daniel, you're going to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.945,
    "end": 2578.045,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.025,
    "end": 2584.956,
    "text": " Yeah, this is a different syntax, different language, Julia, than Python, but with many similarities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.738,
    "end": 2591.908,
    "text": "And again, like even with limited code familiarity, it helps calibrate like where someone is at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.248,
    "end": 2593.731,
    "text": "Like this is just a coin toss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.071,
    "end": 2596.836,
    "text": "This isn't even like, it's not a coin tossing quantum agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.876,
    "end": 2600.261,
    "text": "This is just like literally a coin being tossed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.281,
    "end": 2604.488,
    "text": "But this can help calibrate learning in terms of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.902,
    "end": 2607.143,
    "text": " what does it take to make a coin toss?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.824,
    "end": 2613.289,
    "text": "And then, okay, here's a slightly more involved example with a hidden Markov model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.391,
    "end": 2630.847,
    "text": "And then we're also gonna bring this back into the textbook group by looking to replicate PyMDP and textbook examples in Rx and Fur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.379,
    "end": 2648.717,
    "text": " Because although it can feel, and it is true on one hand, that it's more flavors or more material or more variants, it's actually a very important decision that they took in the textbook to have figure 4.3",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.697,
    "end": 2664.799,
    "text": " like they're not in they don't introduce just the discrete time and then later go to continuous time they introduce them jointly to emphasize that there isn't only one way to treat time in active inference so then that's how i've been approaching it too so that's awesome",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.779,
    "end": 2688.711,
    "text": " cool yeah i mean it's like there's base i don't know if there's any um any one-way streets like if there's one there's another one and so having there be multiple languages it's like not about one person being able to generate all the scripts for all the languages for all the cases you know in a moment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.91,
    "end": 2691.794,
    "text": " but basically code models can already do that first off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.555,
    "end": 2708.698,
    "text": "And then, so we're just able to look at that and then try to connect the dots and think what's this deeper space that's able to have multiple Julia and multiple Python scripts corresponding to a T maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.88,
    "end": 2718.833,
    "text": "And then how do we make sure that that kind of like broader latent or dark space that we're thinking about is active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.302,
    "end": 2732.702,
    "text": " And what makes something actually an active inference model as opposed to just like any other kind of broader input output cybernetics or control or reinforcement model, which might be totally valid and adequate for a setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.183,
    "end": 2735.847,
    "text": "So there's nothing wrong with like not making an active inference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.829,
    "end": 2742.357,
    "text": "It's just that there is a difference between it being an active inference model versus being like a reward learning model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.294,
    "end": 2746.177,
    "text": " Gareth J. And right, so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.198,
    "end": 2764.952,
    "text": "Gareth J. Sorry, no good, so I kind of see that also is like being a parameter of the time frame or the frame that that constraint is saying, so if you're using the language in that sense as a filter, it would be applicable to that model, for example, in that discrete time range.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.109,
    "end": 2775.498,
    "text": " where it may not fit to another model with the same kind of parameters due to other separate constraints, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.303,
    "end": 2791.294,
    "text": "You mean like kind of using the validity of the active inference ontology to kind of check whether the script is an active inference model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.595,
    "end": 2799.85,
    "text": " Yeah, but in a way by being able to apply it as a filtering model without energy, it kind of reduces the friction on the surface, doesn't it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2801.814,
    "end": 2806.903,
    "text": "So if the language that you're using within that frame works with the frame,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2807.93,
    "end": 2817.863,
    "text": " without it adding too much context because of the parameterization versus dragging and dropping that filter into another model where the language doesn't fit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.386,
    "end": 2823.992,
    "text": "You would have to use a different model, but that doesn't make the first model not valid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2824.833,
    "end": 2827.096,
    "text": "Would that be a correct statement in that context?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2829.159,
    "end": 2830.06,
    "text": "I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2830.2,
    "end": 2837.43,
    "text": "I mean, I don't know if this is too broad, but making model two cannot make model one invalid, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.579,
    "end": 2838.901,
    "text": " model two can yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.102,
    "end": 2846.875,
    "text": "And it might be, yeah, it might be fewer parameters or more or more or less accurate, but, but it can't invalidate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.955,
    "end": 2850.301,
    "text": "It's just merely another addition, like into the blockchain of everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.042,
    "end": 2857.653,
    "text": "And then in terms of the ontology and the variables, I mean, you can just look at the variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.358,
    "end": 2860.498,
    "text": "Oh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.217,
    "end": 2863.96,
    "text": " added more comments here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.98,
    "end": 2877.444,
    "text": "But if you've defined, if you've looked at figure 4.3, and this is the rough setup of your set, then you can ask, is there something that is here that I don't have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.006,
    "end": 2880.87,
    "text": "And then is there something else that I have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.31,
    "end": 2886.84,
    "text": "And either of those, if you make it simpler than this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.137,
    "end": 2892.144,
    "text": " You might be dealing with a special reduced case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.767,
    "end": 2899.597,
    "text": "If you add more things, I mean, that is pretty much all of the research advances in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.617,
    "end": 2902.942,
    "text": "It's like, well, what if we added a variance parameter here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.423,
    "end": 2904.826,
    "text": "Or what if we added a nesting here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.886,
    "end": 2908.592,
    "text": "So it's like more can be added here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.247,
    "end": 2919.758,
    "text": " And hence the textbook just like tried to throw the fastball down the middle and show it in its like plain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.939,
    "end": 2936.976,
    "text": "And then to be able to map anything to the plain version, if you can bring it back and if it's a valid return to the kernel, you know, then it's like, oh, it's a heavily modified Linux kernel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.108,
    "end": 2939.391,
    "text": " But not everything is a heavily modified Linux kernel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.912,
    "end": 2942.355,
    "text": "Something else might just be a totally different construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.975,
    "end": 2954.67,
    "text": "So it might be better, might work well with in a computer system, but it wouldn't make sense to say that it was a modified Linux kernel unless you had started with either pruning down or adding to the Linux kernel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.992,
    "end": 2956.593,
    "text": "Okay, perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2956.873,
    "end": 2959.477,
    "text": "Yeah, you don't want to end up in Temple OS when you're looking at Linux.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2960.518,
    "end": 2960.618,
    "text": "Okay."
  },
  {
    "start": 2967.162,
    "end": 2971.198,
    "text": " I would just also briefly add to that point if, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2971.482,
    "end": 2973.764,
    "text": " just for inspiration or otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2973.864,
    "end": 2984.695,
    "text": "But if you wanted to kind of just literally just flip through, not even necessarily read, but for the time being, flip through chapters seven and eight and just look at the other figures going on in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2984.715,
    "end": 2994.184,
    "text": "They give many more ideas of like how you could construct this from the standpoint of like looking directly at these, this kind of like graphical notation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2994.264,
    "end": 3000.27,
    "text": "We've been talking in the RX and for how it seems great to be able to use graphical notation in the first place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3000.49,
    "end": 3001.371,
    "text": "One, just for,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3001.351,
    "end": 3025.283,
    "text": " being able to track all the different variables and how you're setting up the model but then also too just like scheming on like what what do you need how does the model need to be changed or or otherwise um like in seven chapters seven and eight we get more into discrete and continuous time models we also are introduced to hierarchical models where you can add a second level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3025.263,
    "end": 3035.577,
    "text": " Probably one of the most involved graphs is, yeah, these, like Daniel has pulled up, I would say especially figure 8.6.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3035.708,
    "end": 3036.889,
    "text": " is pretty great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3037.089,
    "end": 3040.713,
    "text": "What it does is that you have a hierarchical model at the top level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3040.773,
    "end": 3046.86,
    "text": "You have the POMDP, like discrete time model setup.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.38,
    "end": 3053.207,
    "text": "And then the bottom half of that graph is actually using continuous variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3053.467,
    "end": 3056.25,
    "text": "So it's not just hierarchical, it's also like a hybrid model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.29,
    "end": 3058.592,
    "text": "So you're including both types of variables in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3059.333,
    "end": 3064.939,
    "text": "You could almost think of this as like at the lower level, that bottom half, you could have something like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3064.919,
    "end": 3068.382,
    "text": " um, uh, continuous time neuroimaging data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.883,
    "end": 3092.146,
    "text": "And then at the higher level, there's some kind of discreet, uh, hidden state that you're using that, that real time observational data to then, uh, infer like, you know, so it's, uh, yeah, it's just steaming, modeling, doing the mapping from, uh, you know, reality to variables on a graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3092.166,
    "end": 3092.226,
    "text": "Um,"
  },
  {
    "start": 3092.206,
    "end": 3117.572,
    "text": " awesome yeah this all uh all fits together so yeah i might have to uh join you guys on thursday so it'll be interesting thank you yeah or or um or the the rx infer code is in the chat also on the math background so the spm statistical parametric mapping this is what carl friston at all we're working on in the neuroimaging group",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.974,
    "end": 3123.125,
    "text": " at UCL in the pre-ACT-INF and FEP days and continuing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.328,
    "end": 3125.43,
    "text": "It's a MATLAB toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.911,
    "end": 3130.401,
    "text": "It continues to be developed and the documentation is all online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.303,
    "end": 3134.65,
    "text": "That being said, this 2007 textbook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.63,
    "end": 3135.973,
    "text": " is very informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3136.594,
    "end": 3154.748,
    "text": "It has like 40 or 50 chapters, but they're standalone short chapters that don't really reference each other because they're focused on like the neuroimaging setting of taking in multi-sensor data, doing the sensor fusion, doing the dynamic causal modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.981,
    "end": 3167.856,
    "text": " I find it really informative because it quickly reviews and uses parametric statistics, non-parametric statistics, and Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.077,
    "end": 3184.195,
    "text": "So it's very, very strong for learning about this setting, which is where you have a prior on a hidden variable, and then you're getting observations, and then the hidden variable is changing through time, like neural activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.305,
    "end": 3192.315,
    "text": " Control theory then injects into, selects out a slice of B to control how the system evolves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.237,
    "end": 3201.089,
    "text": "And so that's why that was brought into play because if you're only observing the neural system, then you only need this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.689,
    "end": 3206.757,
    "text": "But then if you're gonna be selecting behavioral stimuli,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.737,
    "end": 3213.485,
    "text": " or you're going to be doing transcranial stimulation or something like that, you need to have a bidirectional interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.226,
    "end": 3223.938,
    "text": "But in terms of the basic statistics and weaving together parametric, non-parametric Bayesian, this is one of the best textbooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.779,
    "end": 3225.52,
    "text": "Okay, awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.54,
    "end": 3229.825,
    "text": "I think I've read some selections from it, but I definitely need to pick up a copy of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3230.615,
    "end": 3237.773,
    "text": " I don't know how much the physical version costs, but I'm sure that there's a PDF of this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.833,
    "end": 3238.996,
    "text": "We probably have it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.657,
    "end": 3243.286,
    "text": "And also the online documentation is more updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.326,
    "end": 3247.797,
    "text": "And there's also tutorials for SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.688,
    "end": 3264.477,
    "text": " So, even if you don't do neuroimaging, I've never been on an MRI slash analyze the data, but still just reading through this, because these machines are creating a lot of data, and it's a very transferable setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.561,
    "end": 3267.082,
    "text": "Okay, great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3267.122,
    "end": 3269.667,
    "text": "Yeah, I'm interested in the noise parameters on that, too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.642,
    "end": 3285.816,
    "text": " Yeah, and comparisons, the kinds of statistics that you need to account for, like within and among participants in a clinical study, and statistical power calculations, like...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.37,
    "end": 3287.832,
    "text": " That's really where it comes down to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.912,
    "end": 3304.758,
    "text": "Like trying to understand the statistical formalisms in their N equals one setting is almost like, I don't know if ironic is the right word, but the whole point is we're using distributions so that we can take in multiple data points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.859,
    "end": 3309.525,
    "text": "So it's not meant to just be like kind of looked at on the shelf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3310.585,
    "end": 3315.955,
    "text": " It's meant to be like played around with different priors and testing how different observation sequences lead to different updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.857,
    "end": 3325.915,
    "text": "So that's kind of how I've been approaching it as well as testing as n equals zero is equivalent to one, which is why I asked the question in regards to the lambda.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3325.935,
    "end": 3328.78,
    "text": "It's a choice function of zero or one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3328.76,
    "end": 3350.025,
    "text": " Um, but that would, so I've kind of been approaching in terms of like at T zero and zero at T one and one, and you have expansion from that set back to, and it will always still be the N one plus or N minus two in that sense, back to just what we had started talking about earlier, but.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3352.604,
    "end": 3376.452,
    "text": " yeah there's a lot there that's kind of like when when the when the when the mouse is planning it's it's now it's t equals zero but also it's the next time step but also it's an arbitrary time step but to get lost in the fact that it could be an arbitrary time step it also has to be through other frames right well um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.495,
    "end": 3391.593,
    "text": " Next time later in the day, let's just begin with whatever questions people have or other added questions to the table and upvote the questions that you like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.793,
    "end": 3393.295,
    "text": "And we'll start from the top next week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.999,
    "end": 3396.259,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.901,
    "end": 3398.442,
    "text": "Thank you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.063,
    "end": 3399.263,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.343,
    "end": 3399.824,
    "text": "Thanks everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.565,
    "end": 3401.626,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.646,
    "end": 3401.967,
    "text": "Thanks folks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.987,
    "end": 3402.287,
    "text": "Take care."
  }
]