[
  {
    "start": 2.967,
    "end": 3.207,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.089,
    "end": 4.75,
    "text": "Greetings, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.93,
    "end": 7.294,
    "text": "Thanks for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.795,
    "end": 12.403,
    "text": "We're on 8.8 in our second discussion on Chapter 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.745,
    "end": 29.751,
    "text": "So one question was brought up that we'll definitely come to, but is there just anything else that anyone else wants to add about for any just reflection or any question that's kind of surfacing that we want to add to the stack?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.455,
    "end": 43.997,
    "text": " All right, let's go to the message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.043,
    "end": 50.263,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.324,
    "end": 58.592,
    "text": "So in message passing, is there a decay of information as the distance between the variable X and individual Markov blanket constituents increases?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.435,
    "end": 65.88,
    "text": "Is implementation of information decay in message passing an option for model implementation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.21,
    "end": 77.438,
    "text": " Who wants to give a first thought on that or any other kind of curiosity around it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.81,
    "end": 95.58,
    "text": "I'm not sure if I'm understanding it very well other than intuitively, but what it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 96.151,
    "end": 111.209,
    "text": " I mean, would it be the case that, like, information decay wouldn't necessarily, I suppose, make sense here given the models that are already working in terms of, like, time steps?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 111.57,
    "end": 124.926,
    "text": "And so you're already kind of, you know, you're recomputing your gradients and your posteriors and so on in every given time step such that,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.429,
    "end": 135.666,
    "text": " you know, the idea of some kind of holistic piece of information that's being carried from time step to time step doesn't quite make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 135.766,
    "end": 140.253,
    "text": "That is each time step involves an entire set of like recalculations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 140.674,
    "end": 142.096,
    "text": "Does that make any kind of sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 146.323,
    "end": 147.505,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.122,
    "end": 157.956,
    "text": " So just to start with, one uncertainty is I'm not exactly sure about message passing in the continuous versus discrete time setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.879,
    "end": 169.894,
    "text": "Again, hopefully something that we can unpack and talk to Magnus Kudal at all, since I know that he's an expert on the continuous time setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.176,
    "end": 173.54,
    "text": "But any other thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.782,
    "end": 176.985,
    "text": "Or I'll try to give...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.349,
    "end": 178.79,
    "text": " an answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.03,
    "end": 179.27,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.315,
    "end": 205.47,
    "text": "Yeah, just one quick note about message passing is, I mean, before going into the details of how exactly message passing happens in Active Inference Framework, it's probably worth noting that it's inversely proportional to the robustness of any self-organization systems because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 206.564,
    "end": 231.137,
    "text": " You see, if we consider an agent and its peripheral systems or peripheral, let's say, limbs as a kind of fully centralized system in which the message passing happens almost",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 231.117,
    "end": 255.64,
    "text": " in a fully centralized way from the brain or, I don't know, the central processing unit onto the lens, then this system would not be as robust as the system in which this kind of message passing is distributed among the elements of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 256.227,
    "end": 270.161,
    "text": " I think that's one of the reasons why we see signal decay or the loss of information as we go up to the hierarchy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 270.201,
    "end": 276.268,
    "text": "The more we go up to the hierarchy, the less precise the information becomes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 277.349,
    "end": 285.357,
    "text": "But in order to have more and more precise information, we need to somehow",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 285.995,
    "end": 296.528,
    "text": " acknowledge a kind of autonomy onto the peripheral nervous system as opposed to central nervous system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 297.009,
    "end": 312.508,
    "text": "So that's one of the ways, I mean, in humans, nervous system is organized in which this kind of distribution of agency, I mean, autonomous",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 312.91,
    "end": 320.259,
    "text": " agency is distributed among both peripheral system and the central system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 321.221,
    "end": 337.922,
    "text": "And coming back to active inference framework, I also believe in this framework, it beautifully captures this kind of hierarchical model because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 337.902,
    "end": 363.685,
    "text": " Obviously, as we move farther away from the peripheral elements of any system, the elements which have direct access to the environment, not direct access, but closer access to environment, then the accumulation of probabilistic errors becomes larger and larger.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 363.725,
    "end": 366.407,
    "text": "And that's why",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 366.708,
    "end": 387.214,
    "text": " In order to have reliable information, we need to discretize these kinds of information at some point without necessarily having to take into account every single bit of information that we receive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 388.392,
    "end": 408.644,
    "text": " on the lower levels of the I mean, when we're dealing with the lower level systems, we mostly deal with continuous time models, which allow for more precise kind of formulation of message passing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 409.024,
    "end": 410.687,
    "text": "But as we go up to the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 411.511,
    "end": 426.846,
    "text": " central nervous system and conceive discretized elements of organizations such as cognition, emotion, and so on, or decision-making, this process becomes much more discretized.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 427.526,
    "end": 439.898,
    "text": "So that's basically the idea behind the hybrid models of active inference in which we can incorporate both continuous time and discrete time elements into a single system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 443.236,
    "end": 443.857,
    "text": " That's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.877,
    "end": 444.417,
    "text": "Thank you, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.477,
    "end": 444.838,
    "text": "Alexi?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.72,
    "end": 448.902,
    "text": "I wonder if I can ask you, Ali, to clarify.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 448.982,
    "end": 451.805,
    "text": "So let's imagine that I'm a shark, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 452.506,
    "end": 460.754,
    "text": "And if I go up the hierarchy of beliefs, then perhaps the most firm, coarse-grained belief is that I will survive.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 461.655,
    "end": 464.758,
    "text": "One step down from that is that I can breathe in water, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 465.98,
    "end": 472.146,
    "text": "So as the message comes up in the hierarchy, I don't need as many details like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 472.582,
    "end": 475.142,
    "text": " because these are not going to change.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 475.202,
    "end": 476.23,
    "text": "If they change, I die.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 477.29,
    "end": 478.492,
    "text": " Is that kind of what you're saying?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 479.193,
    "end": 479.773,
    "text": "Exactly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 480.134,
    "end": 480.555,
    "text": "Exactly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 480.595,
    "end": 480.895,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 482.057,
    "end": 488.706,
    "text": "Because as you said, as we go up to the hierarchy, we'll need much, much less detail.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 489.547,
    "end": 500.683,
    "text": "And we just need to take into account, I mean, the general gist of the information we get in order to survive or I don't know, achieve a goal or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 501.544,
    "end": 507.212,
    "text": "But obviously, if we want to, I mean,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 507.192,
    "end": 517.268,
    "text": " take into account every single detail of every endeavor, we'll need much more precise channels for information passing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 519.552,
    "end": 521.014,
    "text": "And if I may, one more quick question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 521.174,
    "end": 532.272,
    "text": "In Chapter 5, they make a point to say that ascending messages, which are prediction errors, are usually higher frequency than descending messages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 532.403,
    "end": 535.887,
    "text": " I mean, they declare it, but I didn't exactly see where they take it from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 535.907,
    "end": 539.772,
    "text": "And so I was trying to, they illustrated with a cortical column.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 540.293,
    "end": 549.304,
    "text": "And I was thinking that, you know, indeed, this is very interesting research that we have top-down messages that are, you know, beta, rhythm, or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 549.505,
    "end": 552.428,
    "text": "And they govern the gamma, which is higher frequency.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 552.789,
    "end": 559.457,
    "text": "Could you talk a little bit about why prediction errors and ascending messages are higher frequency nonlinear functions?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 563.268,
    "end": 586.609,
    "text": " OK, I mean, on this question, I can only take a guess because I don't honestly know the exact answer, but I believe the reason that the ascending information is I mean, they're on a higher frequency level than I mean, the descending information is because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 587.534,
    "end": 604.425,
    "text": " Again, coming back to this hybrid model of continuous time and discrete time, ascending information deals with, let's say, a continuous discretization of information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 604.485,
    "end": 610.977,
    "text": "And that's why, as we go up in the hierarchy,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 611.446,
    "end": 634.703,
    "text": " we'll need to have much higher frequency for the information gain because we need to construct those discrete information as quickly as possible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 634.683,
    "end": 659.481,
    "text": " Based on those discrete elements of our information, we can then infer any necessary prediction, any necessary information about the error that we get or any other kinds of manipulation or optimization we need to take into account.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 659.982,
    "end": 662.125,
    "text": "And I believe this kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 662.763,
    "end": 687.96,
    "text": " bidirectionality maps quite well on adaptive resonance theory, Grossberg's adaptive resonance theory, because in that theory as well, this kind of bidirectionality between the ascending information and descending information comes in a kind of resonance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 688.582,
    "end": 701.025,
    "text": " they adjust their frequency as to become the resonance fully cyclic passage for information, both going up and going down.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 701.627,
    "end": 709.341,
    "text": "So that's why I believe in this kind of framework also it's necessary to take into account",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 709.321,
    "end": 724.129,
    "text": " different rates of frequency for both ascending information and descending information in order to allow for this kind of resonance to happen between those two lanes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 729.258,
    "end": 730.16,
    "text": "This is awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.18,
    "end": 732.865,
    "text": "It's a lot of great information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.077,
    "end": 737.523,
    "text": " Let's try to add a few pieces because I think there's different aspects here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.224,
    "end": 743.612,
    "text": "So first, I'll let you point into the topology of message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.754,
    "end": 748.1,
    "text": "Messages are being passed on the topology of the variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.16,
    "end": 753.148,
    "text": "So how the variables are connected is how the messages are being passed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.608,
    "end": 760.86,
    "text": "Sounds kind of circular, but that's the whole reason why this box discusses basically the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.06,
    "end": 766.505,
    "text": " which is just describing any given node is going to be surrounded by a blanket for that node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.545,
    "end": 770.589,
    "text": "There's an absolute tag on a given node.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.969,
    "end": 777.635,
    "text": "So it can't be said just singularly, this node is an internal state or a blanket state only with respect to the whole partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.316,
    "end": 787.044,
    "text": "But that's why two message passing strategies are being described directly alongside the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.164,
    "end": 790.847,
    "text": "So a lot of times we see that particular partition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.35,
    "end": 796.617,
    "text": " in active inference, or just more broadly, we see a Bayesian graph and how the variables are connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.658,
    "end": 811.857,
    "text": "And this is going to be an implementational or operational procedure that's going to compute what it's going to turn the crank one gear for a given",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.815,
    "end": 836.494,
    "text": " topology of connectivity um so this point about the robustness is similar to to the robustness of a distributed system i mean if you have a fabric with only local connections then it may take some time to propagate or percolate with the information but on the other hand there's not a single note of failure and all these other um features um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.436,
    "end": 866.683,
    "text": " message passing graphs can include discrete and continuous time and street continuous state spaces like all of these different variants that we've been discussing play nicely together chapter 8 comes back with a hybrid model and Livestream 46 on the folk psychology where in the periphery it's more like continuous sensation and action and then as you um get towards like the cognitive decision-making states you're dealing with discretization um okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.642,
    "end": 894.983,
    "text": " uh another point is about like the computational tractability so there are um works like this one from 2019 with par at all where let's learn more about the technical details but basically there's a few different flavors of this message passing implementation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.368,
    "end": 923.822,
    "text": " that are also kind of hinted at in the um in the box but suffice to say that like for a given topology of a bayesian graph which might be describing a cybernetic system active agent or it could just be any other bayesian graph this isn't about perception action specifically but on any base graph you can basically define an implementational procedural pseudocode for how to just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.207,
    "end": 933.521,
    "text": " bring it that much closer towards harmonization, where if it's kind of the ball is already at the bottom of the bowl, it's not going to go anywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.282,
    "end": 940.291,
    "text": "But then if it's not at the bottom of the bowl, from like a variational inference perspective, it will go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.972,
    "end": 945.358,
    "text": "And there's a procedure for doing that that's tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.28,
    "end": 950.085,
    "text": "Why is the frequency higher on ascending messages than descending?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.766,
    "end": 953.37,
    "text": "So first, these kinds of phenomena",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.498,
    "end": 980.353,
    "text": " constitute empirical evidence for hierarchical predictive processing architectures but but the framework doesn't depend on these phenomena being the case for our real nervous systems but but they're always nice to find and there's a few ways to go here um one connections with the nyquist frequency so this is um if you're going to be sampling from vinyl from analog",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.806,
    "end": 983.191,
    "text": " Then that's a smooth curve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.712,
    "end": 984.694,
    "text": "That's the continuous time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.754,
    "end": 986.658,
    "text": "That's like the motor perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.52,
    "end": 988.843,
    "text": "That's the peripheral nervous system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.063,
    "end": 989.764,
    "text": "That's the record.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.566,
    "end": 993.612,
    "text": "That's like a clock with a smooth moving minute hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.775,
    "end": 999.044,
    "text": "And then you're gonna have it translate to digitization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.364,
    "end": 1001.228,
    "text": "Like you're digitizing the record.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.035,
    "end": 1019.858,
    "text": " So if there are top-down predictions, like about the hour in the clock metaphor, we could have ascending predictions about minutes and descending predictions about hours happening every clock cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.04,
    "end": 1022.522,
    "text": "There's no reason why you wouldn't do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.762,
    "end": 1031.333,
    "text": "But at the same time, you can bake in this structural understanding that hours are top-down and slower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.819,
    "end": 1041.233,
    "text": " which is consistent with more broadly in nested outer layers, deeper, however you want to think about it, they are slower and bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.295,
    "end": 1049.946,
    "text": "So you only need to send down that hour expectation more infrequently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.179,
    "end": 1053.003,
    "text": " And then just lastly, like signal decay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.884,
    "end": 1069.926,
    "text": "If you have a Markov chain, so just think really simply about some, just without bringing action too much into it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1070.243,
    "end": 1073.008,
    "text": " think about just the perceptual part here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.469,
    "end": 1078.078,
    "text": "So just like the music listening example that I think is in seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.098,
    "end": 1085.112,
    "text": "So here we are, this is a partially observable Markov process happening through time, emitting an observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.152,
    "end": 1089.881,
    "text": "So it could be the temperature changing in the room through time, but we're not intervening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.002,
    "end": 1091.745,
    "text": "So no action yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.843,
    "end": 1105.093,
    "text": " Imagine if B were the identity matrix, like all ones on the diagonal, you would just be carrying S forward with perfect fidelity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.428,
    "end": 1130.507,
    "text": " but if b were like 0.7 on the diagonal and then 0.1 on the off diagonal which is like what the case that it was in the music example then you you can if you set up a hundred of those runs next to each other it'd be like the signal was kind of like blurring by ten percent um each time so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.605,
    "end": 1136.599,
    "text": " The signal, it depends on like if there's a degradation of the signal as it's being passed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.62,
    "end": 1138.043,
    "text": "Here it's being passed in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.083,
    "end": 1148.428,
    "text": "If it's being passed noiselessly, then the signal propagates more distantly in space and or time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.813,
    "end": 1170.619,
    "text": " Whereas if the insulation around a node is such that it blurs half the information upon its immediate exit, then that information, like that perturbation of the Bayes graph, it just dampens more rapidly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.171,
    "end": 1183.451,
    "text": " Ali?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1187.656,
    "end": 1188.117,
    "text": "Thanks, Steph.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1188.137,
    "end": 1191.26,
    "text": "Connection to Nyquist frequency was really insightful and helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1191.301,
    "end": 1213.026,
    "text": "But to add to your point here, I also believe that if there wasn't any gradation of frequency between those two paths of information passing, I believe something like an aliasing effect would happen if the brain or any",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1213.327,
    "end": 1227.184,
    "text": " kind of agent wanted to reconstruct the information from the input system and then produce the necessary output system because I mean it's necessary to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1227.704,
    "end": 1252.665,
    "text": " somehow distinguish between the frequency of incoming information as opposed to the frequency of the reconstructed information in order to evade these kinds of aliasing type effects, which obviously would be undesirable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1256.307,
    "end": 1286.162,
    "text": " yeah cool and also ties to the um ultimately the audio visual roots of predictive processing it was not generated to describe or explain biological phenomena it it arose in the 70s 20 years before round ballard 1999 in the context of maximum information compression for audio visual and then the other um sort of connection back to the more like bodily",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.378,
    "end": 1316.318,
    "text": " maybe a book that that some of you are are more familiar than than i but the body has a head it's kind of like a exploratory narrative um biology physiology book but but of course the title is the provocation about the body's primacy in i guess what we would say action inference alexi yeah i wanted to reflect on what you and ali said um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.007,
    "end": 1325.198,
    "text": " about the Nyquist frequency and also going back to, please forgive me, ascending messages, prediction errors, higher frequency.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1325.858,
    "end": 1335.231,
    "text": "If we take this evolutionary kind of thought that the higher in the hierarchy I go, the more difficult it is to update a prediction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1335.251,
    "end": 1336.552,
    "text": "They're more well entrenched, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1337.133,
    "end": 1341.879,
    "text": "So let's imagine that I'm a rat and I have an inborn phobia of cats.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1342.58,
    "end": 1344.162,
    "text": "One strand of cat hair",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1344.563,
    "end": 1345.644,
    "text": " you know, causes freezing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1346.025,
    "end": 1357.758,
    "text": "But if I'm in the environment where there's mortal danger, like a trap, and the only escape route smells like cats, then I have to update that very firm prediction to get out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1358.478,
    "end": 1364.065,
    "text": "So it takes high energy, which in like Planck's equation means high frequency to update the high level predictions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1364.926,
    "end": 1367.128,
    "text": "I know it's very speculative, but what do you think about that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1368.779,
    "end": 1371.403,
    "text": " Yeah, I think there's a few ways that you could model that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.444,
    "end": 1377.291,
    "text": "Let's just say we have an aversion to cat smell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.352,
    "end": 1384.32,
    "text": "It's a negative value in C, or it's a lower value in the C vector, just to be clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.401,
    "end": 1386.123,
    "text": "We're talking about some sensory vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.784,
    "end": 1391.731,
    "text": "And in our generative model, we have some value that just is called cat smell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.412,
    "end": 1397.098,
    "text": "And we prefer it to be lower.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1397.517,
    "end": 1407.29,
    "text": " Well, if there are two paths on the maze, then to take the path with the cat smell, it has to have pragmatic or epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.191,
    "end": 1424.672,
    "text": "So if we have a 10 to one aversion to the cat smell, but then the expected free energy of the cat path is greater than 10 to one, then you could think about that as like the circumstances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.002,
    "end": 1434.856,
    "text": " reflected by the epistemic or the pragmatic value of a course of action, but the circumstances would lead to selection against that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.599,
    "end": 1438.782,
    "text": "There's probably other ways that it could be explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.822,
    "end": 1448.618,
    "text": "One would, yeah, but yeah, higher, and there may or may not be these kind of, it may or may not be in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.847,
    "end": 1475.365,
    "text": " option like i'm thinking about trying to trying just like trying to see two colors as indifferent when you can clearly see them as different or something like that like you're gonna butt up against some fundamental like the wavelength of light or like maybe there's a sound that maybe you know some sounds are maybe culturally aversive or not or pleasant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1475.665,
    "end": 1498.652,
    "text": " maybe there's also just a volume or some type of sound that that it's like yeah probably you can't can't but then again if that was the only path to escape a burning building then that kind of stuff would happen so then i think it you gotta zoom out beyond the single dimensional generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.56,
    "end": 1502.064,
    "text": " And then consider more holistic generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.084,
    "end": 1507.952,
    "text": "Like we have 10 to one preference against cat, but we have a hundred to one preference for blood glucose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.934,
    "end": 1515.303,
    "text": "So then right there, you've constructed a generative model that enables you to make risky decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.93,
    "end": 1520.33,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1520.35,
    "end": 1521.452,
    "text": "That's very, very useful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1522.393,
    "end": 1522.694,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.937,
    "end": 1526.559,
    "text": "And in the end, it's not about the rat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.799,
    "end": 1527.581,
    "text": "That's the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.961,
    "end": 1529.263,
    "text": "It's about the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.205,
    "end": 1538.296,
    "text": " So different modelers may construct different generative models that display certain kinds of behavior or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.016,
    "end": 1548.108,
    "text": "So we have the portfolio of models, and then we ask, well, what experiment is going to help us update our attention to these different models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.63,
    "end": 1553.275,
    "text": "And someone has one where there's only, you know, cat smell, yes or no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1553.315,
    "end": 1556.319,
    "text": "Somebody else has no, a little bit and a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.16,
    "end": 1559.503,
    "text": "Somebody else treats it like a continuous variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.277,
    "end": 1564.148,
    "text": " none of those are the true map, but we have all the maps on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1565.031,
    "end": 1574.238,
    "text": "And then that allows us to design the experiments or the circumstances that would differentiate the unique predictions and explanations from those maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.559,
    "end": 1574.86,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.118,
    "end": 1582.486,
    "text": " It also reminds me of Terence Deacon's nested conceptions of information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1582.566,
    "end": 1595.464,
    "text": "So instead of representing these kinds of relations, hierarchical relations as higher order or lower level, lower order processing of information,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1595.748,
    "end": 1607.383,
    "text": " Uh, he represents them as three nested, um, kinds of information, uh, in which the Shannon information is, would be the most basic one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1607.904,
    "end": 1623.645,
    "text": "And then, uh, referential information, uh, which is, um, he also refers to as aboutness information, uh, incorporates a kind of medium susceptibility to, um, any error.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1624.047,
    "end": 1629.936,
    "text": " And it is an emergent information rising from those Shannon information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1630.537,
    "end": 1648.485,
    "text": "And ultimately, we come to significant information, or in other words, information about usefulness, which is what actually dictates how the survival of the species ultimately is determined",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1648.769,
    "end": 1666.069,
    "text": " I mean, through the evolution and so on, and it incorporates a kind of, I mean, the connection or association between the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1666.606,
    "end": 1681.915,
    "text": " Reference of that usefulness information and the teleodynamic requirements of the species is what dictates what would happen in the significant information or in terms of FEP, the minimization of free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1683.413,
    "end": 1684.914,
    "text": " Nice, that's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.535,
    "end": 1701.089,
    "text": "Yeah, information's like one of the most overloaded terms or just loaded terms, but Shannon, 1948, studying signal transmission in the telegraph networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.109,
    "end": 1713.1,
    "text": "So it has to do with that pure Morse code level of being able to distinguish like a signal from noise and then projecting all that down to the Shannon entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.4,
    "end": 1728.8,
    "text": " And then to the extent that a signal can be detected from noise, which is about the observer, not the system in itself already, then there's this like semantic or symbolic information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.781,
    "end": 1736.29,
    "text": "But symbolic or semantic information, if we're going to continue with this evolutionary line, like, okay, so here are the photons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.33,
    "end": 1740.315,
    "text": "We can pick out the signal in the photons, a signal in photons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.335,
    "end": 1742.378,
    "text": "It looks like it's yellow and red.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.455,
    "end": 1745.578,
    "text": " is that a good caterpillar to eat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.42,
    "end": 1754.489,
    "text": "So one has to go beyond the kind of Shannon information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.509,
    "end": 1772.652,
    "text": "If you just had the entropy, Shannon entropy of different natural settings as a bird, that's still two structured jumps away from like, should I go for this caterpillar or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.943,
    "end": 1784.493,
    "text": " But a lot of times this is taught as information theory, kind of the beginning and the end of information theory, when this is the syntactic information and then the semantic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.033,
    "end": 1791.22,
    "text": "But the abstract semantic is still not the actionable information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.707,
    "end": 1802.571,
    "text": "Let's see, someone has added, the key things, how you define the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.428,
    "end": 1808.373,
    "text": " I mean, yeah, but we're not playing with the definition of what a Markov blanket is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.994,
    "end": 1821.368,
    "text": "Maybe this could be rephrased as the key thing is around which node you choose to highlight as your system of interest, call it internal states, and then the Markov blanket is trivially defined around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.869,
    "end": 1827.174,
    "text": "IE, there's a partition between whatever, or there's no partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.735,
    "end": 1830.718,
    "text": "Well, again, if you're using a plural definition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.42,
    "end": 1833.722,
    "text": " There is a partition between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.202,
    "end": 1836.385,
    "text": "That's what makes you think that they're two different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.928,
    "end": 1843.234,
    "text": "Or there's no partition and everything under the blanket is conditionally dependent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.955,
    "end": 1855.089,
    "text": "Well, the fact that you have modeled a blanket or a partition at a given scale doesn't preclude there from being, as they say, message passing within the same blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.289,
    "end": 1856.931,
    "text": "Because blankets are not something fundamental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.971,
    "end": 1861.016,
    "text": "It's like saying, could messages be passed inside of California?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.958,
    "end": 1862.258,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.723,
    "end": 1886.119,
    "text": " but but then also you could go to the county level and there can be messages between the counties or between the cities or or you know between the agricultural objects within the the region I've not seen this with love of so many point references I'm not sure exactly which exact reference but more broadly nested um Markov blankets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.867,
    "end": 1907.82,
    "text": " could look to the kind of earth systems modeling or our uh variational eco evo devo paper nested markup blankets they're having message passing within and across and the kind of like lateral same type of thing same scale message passing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.087,
    "end": 1934.82,
    "text": " then now that you're you know you you passed all the messages amongst the states and now we're in california and then you pass all the messages amongst the counties and then but i don't have a specific reference where that is is written out but yeah what an interesting question and and message passing is so cool because it really connects like this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.745,
    "end": 1940.993,
    "text": " But what if this was just an abstraction and there wasn't any procedure known for how to compute it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1942.656,
    "end": 1949.206,
    "text": "Then you'd have kind of like the blueprint of a building, but it'd be awesome if you could build it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.147,
    "end": 1959.542,
    "text": "But in fact, this is the blueprint and the blueprint can basically be rendered or operationalized into a procedure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.362,
    "end": 1967.167,
    "text": " So that is a super, super strong connection and also one that's not unique to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.868,
    "end": 1980.499,
    "text": "Although as far as I know, the 2017, this paper, I believe is far more general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.22,
    "end": 1990.828,
    "text": "Somebody can add more here, but basically here's the continuous and the discrete representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.479,
    "end": 2004.881,
    "text": " And in this paper or some other one from this era, like they showed that every Bayes graph has a Forney factor representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.923,
    "end": 2010.832,
    "text": "And then previously it had been shown that every Forney graph had a message passing implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.893,
    "end": 2013.897,
    "text": "So in this paper or some other one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.855,
    "end": 2035.564,
    "text": " um like it kind of connected all the pieces up and said yeah now there is a message passing procedure on arbitrary bayesian graphs again that doesn't have to be about even a perception action system i'm i think it just made the general case um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.025,
    "end": 2039.507,
    "text": " So message passing is definitely important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.707,
    "end": 2053.423,
    "text": "And also it's another example of like perhaps even a difference in practice between like deep learning, reinforcement learning, machine learning, AI, and active inference to the extent that the distinctions can be drawn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.308,
    "end": 2066.479,
    "text": "Just to highlight, because there's of course multiple differences that we've talked about, but a lot of the work in AI and ML goes into like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.459,
    "end": 2093.749,
    "text": " figuring out the implementational detail like kind of getting um getting in there with the specifics of the model whereas once something is stated as a base graph then it's kind of like standard methods like you don't need to intervene in how your source code is compiled",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.18,
    "end": 2100.25,
    "text": " And so, similarly, the message passing step kind of compiles it into a procedure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.352,
    "end": 2107.926,
    "text": "But you don't need to step in to fine tune how the blueprint goes to the construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.571,
    "end": 2112.615,
    "text": "Which I believe is a great advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.033,
    "end": 2149.723,
    "text": " anyone want to want to go to the specific question or we'll just try to look there's so many questions on on chapter four so anyone can just like bring up one or or some topic that they thought was cool in the chapter um actually i did want to briefly just kind of harken back very quickly to something ali brought up earlier um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.176,
    "end": 2160.79,
    "text": " which is adaptive resonance theory and maybe how it relates to the asymmetrical frequencies found in message passing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2160.81,
    "end": 2174.749,
    "text": "And I know in chapter five, where we start discussing kind of, or we start seeing more discussion of like neurobiological correlates and things like that, you know, there are these references to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2175.961,
    "end": 2190.917,
    "text": " nonlinear functions being involved in the computation of prediction errors such that, what is it, sending messages tend to be much higher in frequency or faster than descending messages?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.238,
    "end": 2199.887,
    "text": "I mean, are all of these things kind of related, you know, as far as message passing goes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2201.108,
    "end": 2205.293,
    "text": "I'm rather into things like fMRI and EEG analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.695,
    "end": 2214.748,
    "text": " I kind of have a personal interest in the asymmetrical frequencies question, if all of that tracks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2216.57,
    "end": 2216.871,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.732,
    "end": 2233.474,
    "text": "Well, I think that the sensor fusion neuroimaging world is where a lot of these statistical methods can be traced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.652,
    "end": 2237.366,
    "text": " by virtue of the SPM origins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.995,
    "end": 2242.553,
    "text": "And here, this live stream",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.647,
    "end": 2269.3,
    "text": " was um excellently prepared for by ali uh professor grossberg was one of the uh relatively small fraction of guests who prefer full-sighted referenced questions before joining but also he prepared excellent answers and there was a great discussions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.95,
    "end": 2295.507,
    "text": " about the uh compatibility or or reconcilability of of art fep active everything alexi yeah i'm just grateful for your question again going back to it and i have the same interest but um you know come come join us on august 23rd if you can on uh the chaos theory paper i mean i think i'll try to talk about how",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2295.858,
    "end": 2301.726,
    "text": " the higher the frequency of the EEG, the higher the Kolmogorov-Sinai entropy, the higher the level of chaoticity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2302.247,
    "end": 2304.751,
    "text": "And there's much evidence kind of converging on that stuff.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2305.171,
    "end": 2313.563,
    "text": "Today on Twitter, of all places, Earl Miller from MIT was talking about better frequencies governing the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2313.847,
    "end": 2320.454,
    "text": " exchange between medial prefrontal cortex and right hippocampus for spatial work in memory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2320.975,
    "end": 2329.545,
    "text": "So that does seem to kind of not only be theoretical, but also confirmed empirically that we have kind of control signals are slower.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2330.246,
    "end": 2340.457,
    "text": "Think about the brain, you know, subcortical neurons are firing one at one tenth of the frequency of cortical neurons and subcortical neurons and brainstem are arousing the cortex.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2340.737,
    "end": 2341.238,
    "text": "They are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2341.69,
    "end": 2347.555,
    "text": " kind of the blood and the energy, the arousal, generalized arousal comes, you know, that way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2348.376,
    "end": 2363.83,
    "text": "And another thing I wanted to mention is about the prioritization of sort of, Mark Solms talks in his book about how working memory is a very small space, like seven chunks of information plus minus two.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2363.85,
    "end": 2366.352,
    "text": "And when we feel something, it has to get into working memory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2366.412,
    "end": 2369.195,
    "text": "Otherwise, you know, we have to be conscious of an intense feeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2369.836,
    "end": 2371.377,
    "text": "And ordinarily, for example,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2371.694,
    "end": 2374.777,
    "text": " We don't like urinate or defecate in public.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2374.837,
    "end": 2375.818,
    "text": "This is embarrassing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2375.978,
    "end": 2376.679,
    "text": "So we hold it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2376.839,
    "end": 2377.72,
    "text": "We inhibit the wish.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2378.5,
    "end": 2385.827,
    "text": "But when people go through like public execution or hanging, that wish is completely released because there is a higher priority.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2385.867,
    "end": 2388.33,
    "text": "There's an existential catastrophic threat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2388.93,
    "end": 2392.694,
    "text": "And then this sort of fear of social embarrassment is completely deprioritized.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2392.734,
    "end": 2398.96,
    "text": "So it does suggest that we need a very high energy signal to kind of overcome very well entrenched predictions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2398.98,
    "end": 2399.22,
    "text": "So",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2399.538,
    "end": 2401.801,
    "text": " It's a vast topic and I'm highly interested in it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2401.821,
    "end": 2406.006,
    "text": "So if you're interested, maybe we can talk and collaborate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2407.267,
    "end": 2407.588,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.989,
    "end": 2409.25,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.27,
    "end": 2409.931,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.951,
    "end": 2415.798,
    "text": "And again, to connect that to the Terrence Deakins, like a high energy signal, are we talking about an informative signal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2416.018,
    "end": 2423.487,
    "text": "Because an informative signal could just be 10101010 cleanly or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2423.77,
    "end": 2435.207,
    "text": " Are we talking about a powerful, meaningful, just some cultural landmark that has a specific aboutness but isn't situationally relevant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.128,
    "end": 2441.496,
    "text": "Now, the high energy is happening at this higher cognitive level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.516,
    "end": 2449.508,
    "text": "It might even be a subtle signal informationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.893,
    "end": 2453.797,
    "text": " or it might even be a subtle signal symbolically or semantically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.738,
    "end": 2468.492,
    "text": "But that's the whole thing with like early warning systems and like, you know, just the movement of a shadow or the rope coiled up on the ground might convey extreme actionable information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.434,
    "end": 2478.482,
    "text": "Whereas there might be something in a different quadrant that's like very clear, but not survival relevant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.803,
    "end": 2505.364,
    "text": " exactly i mean i think that if you go into like ecological evolutionary goal of mammals to survive and reproduce then okay so survive means eat and don't get killed and so uh sexual functioning and uh gastrointestinal functioning is disabled when we are in a state of acute fear acute fear takes precedent because if i'm dead it doesn't matter",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2505.8,
    "end": 2507.524,
    "text": " you know, I will not be able to reproduce.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2507.544,
    "end": 2517.208,
    "text": "So my first job is to sort of, there's a prioritization happening and that's going to be an intense single that just, you know, uh, occupies the entire mind and just casts everything else out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2517.93,
    "end": 2518.131,
    "text": "Right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2518.973,
    "end": 2519.033,
    "text": "Um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2519.789,
    "end": 2539.266,
    "text": " yeah I mean a lot of these um whether we approach it from like a circulatory system or like a more abstract information like a lot of these um patterns are explained or predicted or or so-called paradoxes are are um kind of shown to be otherwise when it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.246,
    "end": 2542.71,
    "text": " yeah, you can't have max blood flow to every region at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.11,
    "end": 2547.695,
    "text": "Like if you could do that, then you would just have some higher level of allocation to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.855,
    "end": 2551.219,
    "text": "So yeah, when you're running, your gastrointestinal tract slows down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.82,
    "end": 2558.727,
    "text": "Like there's just a shunting of resources and there's a shunting of attention as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.929,
    "end": 2568.358,
    "text": "So it doesn't make sense to have a system where equal maximal attention is being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.874,
    "end": 2594.245,
    "text": " uh deployed it it it's just not viable but we can describe it so that's like why the the active motifs and and all these like like concepts these are our grammar or our ontology that gives us the expressivity that we need to do the modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.967,
    "end": 2604.079,
    "text": " But so we can describe systems that, yeah, maybe there is a system that pays equal attention to all of its 10 ideas, but or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.16,
    "end": 2615.574,
    "text": "Or, you know, it doesn't have any ability, an organism that doesn't have the ability to shunt or redirect blood flow or attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.395,
    "end": 2620.46,
    "text": "Or it doesn't have the ability to do sensory attenuation or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.761,
    "end": 2622.443,
    "text": "I mean, you can build it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.882,
    "end": 2633.772,
    "text": " Okay, a lot of these questions are about specific variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.78,
    "end": 2641.181,
    "text": "We may have come to this one last week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.567,
    "end": 2647.63,
    "text": "Why is the marginal likelihood called marginal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.831,
    "end": 2652.215,
    "text": "Does anyone know this or have a thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.258,
    "end": 2655.079,
    "text": "Yeah, Ali, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.303,
    "end": 2676.569,
    "text": " It's a remnant of statistical theory, because you see, when we sum the probabilities of a given event in a tabular form, the ultimate sum would be written in the margin of the table.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2676.95,
    "end": 2680.915,
    "text": "So that's where this marginal probability term comes from.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2682.228,
    "end": 2682.689,
    "text": " Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.31,
    "end": 2683.51,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.53,
    "end": 2703.679,
    "text": "What a great, what a great term in the margin of the spreadsheet when they summed across, um, kind of collapsing on one thing, conditioning on one thing happening, you can collapse across the other dimension on the spreadsheet and then it's in the margin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.287,
    "end": 2737.868,
    "text": " um yeah so so many questions um another another kind of uh uh clear one uh belief updating about policies to update beliefs about policies we find the posterior that minimizes the free energy does the posterior at time t become a prior at time t plus one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.017,
    "end": 2738.678,
    "text": " Yes, it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.138,
    "end": 2748.888,
    "text": "So like D, we call that variable in the generative model, the prior, because it gets the whole chain rolling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.748,
    "end": 2754.793,
    "text": "But you could also think of this as just like kind of being like a starting position on this unfolding sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.294,
    "end": 2763.602,
    "text": "So there's a temperature in the room and we're just gonna say, well, our data or our modeling started at midnight and it was 30 degrees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.763,
    "end": 2768.307,
    "text": " We're just going to inherit 30 degrees if it was a precise prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.367,
    "end": 2774.434,
    "text": "Or you could say we're going to start the chain by pulling from a prior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.034,
    "end": 2777.477,
    "text": "So we're going to start the chain with 30 plus or minus 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.278,
    "end": 2780.58,
    "text": "And then we're just going to let it play on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.6,
    "end": 2789.911,
    "text": "And then in that situation, with respect to the present moment, S sub T, this is a posterior with respect to what just happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.732,
    "end": 2792.914,
    "text": "But it's a prior for what is about to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.611,
    "end": 2801.558,
    "text": " So just like Markov blanket is not kind of absolute, it's about which variable you're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.578,
    "end": 2807.566,
    "text": "Also prior and posterior are relative to the incoming observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.587,
    "end": 2814.174,
    "text": "So one, after you've updated to the posterior, it's not like you just stop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.194,
    "end": 2825.348,
    "text": "Then that updated value for the hidden state becomes the prior for the next incoming piece of sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2833.85,
    "end": 2862.591,
    "text": " a lot of equations that I hope we can unpack and develop in in math group and and otherwise um and and like annotate richly and make sure that for all the equations that we have those um descriptions and yeah chapter four's a big one I mean there's a lot to it and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.933,
    "end": 2868.338,
    "text": " Brings up a lot of big topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.3,
    "end": 2871.042,
    "text": "That was our second discussion on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.566,
    "end": 2876.631,
    "text": "We are close to the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.514,
    "end": 2880.597,
    "text": "We'll go into chapter five next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.859,
    "end": 2882.62,
    "text": "Also, I remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.68,
    "end": 2883.702,
    "text": "Thank you, Lexi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.082,
    "end": 2894.955,
    "text": " Bronwyn, I think you, some discussions that we had, what is the specific message passing neurobiology in the setting of chapter five?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.616,
    "end": 2899.141,
    "text": "So how should we prepare ourselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.864,
    "end": 2902.786,
    "text": "Yeah, that was a while ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2907.212,
    "end": 2908.373,
    "text": "Yeah, it's a tricky subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.954,
    "end": 2913.52,
    "text": "I've been listening and thinking through today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.922,
    "end": 2920.691,
    "text": " I've just gone back to equation 2.6 because I got a bit confused.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2923.716,
    "end": 2931.686,
    "text": "But it was just about, you know, message passing in the relationship to the reduction of free energy and expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2933.229,
    "end": 2934.23,
    "text": "But I'm still thinking about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2934.25,
    "end": 2936.493,
    "text": "So I might discuss it next week if I come up with something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.474,
    "end": 2938.596,
    "text": "But I think it's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.977,
    "end": 2940.918,
    "text": " It's very complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2940.958,
    "end": 2944.381,
    "text": "And then you've got the hierarchical thing happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2944.481,
    "end": 2948.986,
    "text": "But one question I had was that over a synapse, there's sort of two functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2949.666,
    "end": 2952.93,
    "text": "One is a facilitation, one's an inhibitory process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2952.99,
    "end": 2961.017,
    "text": "And I think we don't consider the inhibitory process or ability to inhibit very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.498,
    "end": 2963.24,
    "text": "It's sort of all about action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.401,
    "end": 2968.785,
    "text": "Yeah, I have to think about all that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2968.985,
    "end": 2997.355,
    "text": " that's um i mean in this yeah in that in that equation you've got all of your um all of what you were talking about taking risk um you know that that that thing about the cat the cat smell example but within that selection of a policy for the uh reducing expected free energy um you want the one with the least expected free energy but you're also balancing up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2997.52,
    "end": 3001.606,
    "text": " other factors in terms of the three nest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.646,
    "end": 3016.508,
    "text": "I think the three nested thing was really interesting because it gave you that hierarchy of habitual responses as opposed to considered ones and higher referential or significant evolutionary considerations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3017.33,
    "end": 3019.653,
    "text": "But underneath it is this equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3020.935,
    "end": 3026.363,
    "text": "I think the relationships between these things in that moment when someone makes a decision,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3027.541,
    "end": 3032.328,
    "text": " Yeah, it's quite a complex thing that the brain does, really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.368,
    "end": 3034.631,
    "text": "That's my thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3034.931,
    "end": 3035.752,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.396,
    "end": 3040.579,
    "text": "Very basic, but here I sit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.22,
    "end": 3051.895,
    "text": "So anyway, I've been doing other things lately, so I'm a little bit lost and I haven't had a good re-look at Chapter 4, but I will between now and next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.613,
    "end": 3071.757,
    "text": " awesome yeah a lot of ways to go there this um functional this this um can apply to a nested system it's just all kind of abstracted there and again this is kind of like that blueprint view message passing helps us get there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.99,
    "end": 3088.075,
    "text": " with the how so it's kind of like the low road which is where this equation comes from chapter two yeah this is it's it's like it's explaining the how and then the message passing is like the how on the how and then also like what you said about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.055,
    "end": 3116.357,
    "text": " um you know one one uh world view is like the central uh operator central governor is kind of being like spurred into action it's all about like excitatory signaling from the outside um or um it having to stimulate a passive exterior through like um you know carrot and stick or just stimulus in general um and then that reminds me of tom froze um with his guest stream on the eruption",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.337,
    "end": 3127.324,
    "text": " which is like, yeah, what if it's like, there's just this like seething activity and then what's happening is like inhibition and breaking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.385,
    "end": 3133.941,
    "text": "And then like in those spaces that are opened up through inhibitions and breaks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.545,
    "end": 3151.828,
    "text": " things unfold so it's not like the decision making was was like you know shining the laser on where to go it's like no there's there's more than enough energy to go around mental energy and it's just about um knowing when to inhibit when to break",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.247,
    "end": 3154.172,
    "text": " Yeah absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3154.192,
    "end": 3166.122,
    "text": "I think the problem is it's not about making a decision it's knowing when to inhibit and that's from the work that I do really is a strong point of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3167.57,
    "end": 3168.091,
    "text": " Summit HQ.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3168.071,
    "end": 3174.445,
    "text": ": inhibition as a very important part of decision making and action in the world, just how we behave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.507,
    "end": 3175.727,
    "text": "Summit HQ.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.707,
    "end": 3186.49,
    "text": ": Really, I mean you know, if you look at the basis of the sign up so you're in facilitating or inhibiting and that's the balance between those two in terms of message passing but nobody talks about inhibition very often.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3188.528,
    "end": 3189.769,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3190.23,
    "end": 3190.65,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.67,
    "end": 3192.352,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.372,
    "end": 3197.117,
    "text": "I mean, in the number go up world, reward is good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.337,
    "end": 3198.138,
    "text": "More reward is better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.198,
    "end": 3199.219,
    "text": "Stimulate reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.319,
    "end": 3200.32,
    "text": "Reward is stimulating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.76,
    "end": 3201.541,
    "text": "Sugar is good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.561,
    "end": 3202.022,
    "text": "All that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.842,
    "end": 3214.534,
    "text": "Versus in the predictive processing, at least we open the discussion to both hands of up and down and stimulate and inhibit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.215,
    "end": 3218.518,
    "text": "Or maybe neither stimulate nor inhibit, just different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.157,
    "end": 3246.092,
    "text": " yeah yeah so it's it we have all the axes we need and and that's why chapter six exists because so much of the challenge is like what building do you want to build so if we said okay well from this we can optimize it super tractably it's not going to be an issue but what is it what is that model going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.983,
    "end": 3249.666,
    "text": " And how are you gonna iterate on that in a real setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.232,
    "end": 3259.158,
    "text": "Which brings the whole understanding into action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.559,
    "end": 3267.008,
    "text": "And earlier, yeah, this was just the last paragraph of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.93,
    "end": 3271.293,
    "text": "Active inference is not something that can be learned purely in theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.274,
    "end": 3272.394,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.796,
    "end": 3276.94,
    "text": "Boom, boom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.595,
    "end": 3302.134,
    "text": " that's the action people keep forgetting about the action the two are entwined you can't separate any of it uh so yeah awesome yeah well fun fun discussion thanks andrew for for highlighting the message passing um angle and it's going to be a perfect lead-in to um chapter five",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.435,
    "end": 3318.098,
    "text": " where we will revisit message passing again from this like nervous system angle yeah great okay thank you all until next time thank you thanks everyone so much bye",
    "speaker": "SPEAKER_00"
  }
]