[
  {
    "start": 2.63,
    "end": 2.931,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3.031,
    "end": 4.153,
    "text": "Welcome back, Cohort 6.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5.535,
    "end": 11.627,
    "text": "Andrew, however you want to begin this discussion on Chapter 2, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 11.647,
    "end": 12.569,
    "text": "Sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 13.771,
    "end": 17.438,
    "text": "Probably pulling up the textbook might be a good move.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 20.343,
    "end": 24.351,
    "text": "I know that this is Week 2 of Chapter 2, so I don't want to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 24.719,
    "end": 48.853,
    "text": " uh reintroduce the entire chapters if you haven't already spent a week on it but i thought it'd be nice for anyone who wasn't able to attend last week to just kind of quickly skim what's going on um so yeah this is chapter two the low road to active inference in chapter one we were introduced to the idea that there's a high and low road to inference so um the low road is more about the um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 48.833,
    "end": 64.448,
    "text": " sort of the what or the how of active inference and as opposed to the high road where there will be more discussion on the why and the why of like, why is this happening?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 64.569,
    "end": 66.21,
    "text": "Why are agents doing this?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 66.47,
    "end": 67.592,
    "text": "How do they survive?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 67.612,
    "end": 70.454,
    "text": "That's kind of the questions getting at here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 70.514,
    "end": 76.14,
    "text": "This is getting much more into sort of something like the mechanics of the process.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 76.12,
    "end": 90.449,
    "text": " And it picks up with the Helmholtzian perspective, which is a 19th century, late 19th century tradition that just began on viewing perception as unconscious inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 91.29,
    "end": 97.082,
    "text": "This idea is picked up more in ideas such as the Bayesian brain hypothesis later on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 97.062,
    "end": 119.796,
    "text": " in the 20th century and from just an active active inference perspective we're treating not just perception but also action planning and learning all as bayesian inference problems as well as deriving a variational approximation for these problems to overcome intractability problems",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 120.772,
    "end": 141.632,
    "text": " with the Helmholtzian tradition, the kind of distinction about this versus other historical cognitive science traditions is that rather than viewing perception as only a bottom-up process of sensory states being fed into, being turned into internal representations of the outside or some such thing like that, instead,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 141.612,
    "end": 154.033,
    "text": " Dr. J. Corey A. perception is viewed as an inferential process that combines top down prior information about the most likely causes of sensations with bottom up sensory stimuli so we actually have this as opposed to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 154.073,
    "end": 162.928,
    "text": "Dr. J. Corey A. perception being more of an outside in process it's more of a it's it's both right it's bi directional.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 163.347,
    "end": 171.996,
    "text": " We're introduced to Bayes' rule, which is just incredibly crucial to active inference, as well as just many other kinds of probability problems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 172.016,
    "end": 181.746,
    "text": "I strongly recommend those who are wanting to get into the maths to kind of work on just kind of understanding Bayes' rule almost as like a sort of cornerstone from which to begin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 181.766,
    "end": 188.393,
    "text": "It can be viewed as a posterior equaling and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 188.795,
    "end": 208.896,
    "text": " a fraction that is the numerator is a prior and a likelihood and then your denominator is evidence and so what can happen is that you can update any of these quantities in order to solve for another quantity right so this this this can be updated over time by taking in new information",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 208.876,
    "end": 233.128,
    "text": " that then updates everything else you can update your priors your your posteriors which are your beliefs at the end like at the end of the process um and so what's nice is that we can actually map all of these quantities uh onto the modeling process in active inference it's so a generative model in our case like an agent um it could be a human being it could be",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 233.108,
    "end": 243.12,
    "text": " some other biological organism or otherwise, the generative model is just a combination of priors and likelihood mappings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 243.981,
    "end": 248.467,
    "text": "So priors would be something like probability of X in the textbook.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 249.208,
    "end": 260.061,
    "text": "Oftentimes, notation can also be like probability of S, which stands for latent states or hidden states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 260.041,
    "end": 273.823,
    "text": " Likelihoods are probability of Y given X. So Y condition on X or in other literature can be viewed as observations O conditioned on S in latent states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 274.284,
    "end": 277.609,
    "text": "And so we have these other quantities involved.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 278.05,
    "end": 282.657,
    "text": "And, you know, all of those are updated using Bayes' rule.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 284.155,
    "end": 301.843,
    "text": " We have some additional information in that section box 2.1 goes over gives a brief refresher on probabilistic reasoning some role and product rules for anyone who wants a little bit of a who's completely you know coming into this or or maybe took a probability course some.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 302.178,
    "end": 308.71,
    "text": " but maybe the knowledge is no longer there and need a bit of a refresher.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 309.813,
    "end": 317.988,
    "text": "We have a nice example of an agent who confronts a frog or an apple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 318.048,
    "end": 322.617,
    "text": "And those are kind of two example like hidden states in that particular problem, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 322.597,
    "end": 328.834,
    "text": " So the agent has its own beliefs about the probability it will see a frog, that it will see an apple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 329.616,
    "end": 332.645,
    "text": "It's given a new observation in the moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 332.925,
    "end": 335.011,
    "text": "Whatever the thing is it's looking at, it jumps.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 335.853,
    "end": 337.939,
    "text": "And so that's an observation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 337.919,
    "end": 343.188,
    "text": " versus the S, the X, the hidden states, which are a frog or an apple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 343.529,
    "end": 351.503,
    "text": "And so those get mapped, those get linked together through the likelihood in Bayes' rule as we mapped a moment ago.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 351.523,
    "end": 359.758,
    "text": "And so the agent basically updates its beliefs about what it's seeing based on the observation it just took in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 359.738,
    "end": 361.022,
    "text": " Not sure what the thing is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 361.063,
    "end": 361.745,
    "text": "It could be a frog.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 361.765,
    "end": 362.467,
    "text": "Could be an apple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 362.688,
    "end": 363.852,
    "text": "Took in a new observation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 364.013,
    "end": 364.555,
    "text": "It jumped.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 365.498,
    "end": 366.943,
    "text": "It has its own likelihood mappings.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 367.063,
    "end": 371.318,
    "text": "Oh, if it jumped, then excuse me,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 371.838,
    "end": 375.002,
    "text": " yeah, then it will draw inference from there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 375.663,
    "end": 387.099,
    "text": "So we're also introduced to other concepts like surprise, Bayesian surprise, KL divergence, importance of biological plausibility.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 388.0,
    "end": 390.403,
    "text": "Many of these theories are being drawn from",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 390.637,
    "end": 391.458,
    "text": " Neuroscience.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 392.04,
    "end": 397.229,
    "text": "And so there's there's an emphasis on things like cognitive costs of computation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 398.351,
    "end": 401.416,
    "text": "There's only so much one's brain can do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 401.737,
    "end": 412.797,
    "text": "And so whenever you consider how many computations would be involved in any example beyond what we just looked at, like two hidden states, apples, frogs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 413.249,
    "end": 420.302,
    "text": " can imagine in practice immensely more than that are being computed, presumably at any given moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 420.322,
    "end": 430.321,
    "text": "So that's where we end up looking at quantities like variational free energy, as well as expected free energy by the end of the chapter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 430.361,
    "end": 436.152,
    "text": "And this chapter, I would say,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 437.397,
    "end": 444.027,
    "text": " This one's a really good cornerstone for just like really getting familiar with a lot of what's going on in active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 444.127,
    "end": 446.29,
    "text": "It's a pretty lengthy chapter compared to the rest.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 448.473,
    "end": 454.181,
    "text": "So spending some time with the different terms that are all kind of quickly being introduced here is a good idea.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 454.201,
    "end": 466.459,
    "text": "So I guess I'll kind of leave it off there and ask, is anyone curious about anything or more specific questions about what are going on in this chapter?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 466.861,
    "end": 471.707,
    "text": " It is a lot to say again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 475.732,
    "end": 475.933,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 476.393,
    "end": 493.375,
    "text": "So did the low road and high road come together, came, did it come about like simultaneously or is it like, is it just like worked on like, like separately and then they both just came in at the same time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 495.346,
    "end": 520.003,
    "text": " um i do think uh daniel would have a lot more knowledge on this but as far as i'm aware there's there yeah these are coming from various traditions and are kind of a synthesis of different um yeah different traditions or otherwise over time and then a lot of it is kind of uh composed primarily by carl frist and one of the co-authors of the textbook",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 521.755,
    "end": 523.417,
    "text": " Yeah, that's a good answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.437,
    "end": 524.339,
    "text": "A few other thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 525.34,
    "end": 531.89,
    "text": "The rhetorical device or the metaphor was introduced by Friston in this like beyond the desert landscape paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.23,
    "end": 534.894,
    "text": "It's referenced somewhere in the coda.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 536.436,
    "end": 545.63,
    "text": "Any model that exists is going to have a low road, so to speak, because there's always a how, otherwise it's not being, it's just a framework being discussed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 545.65,
    "end": 549.315,
    "text": "And then any kind of axiomatic starting point is its own kind of high road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.156,
    "end": 574.678,
    "text": " so low and high road can apply different to to probably to frameworks other than active inference yeah um like kind of by analogy like to almost to dennett's cranes and sky hooks and like that kind of bottom up and top down theory and empiricism so i think it kind of describes that generally and then the special thing about the low road",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 575.84,
    "end": 601.763,
    "text": " uh constructions in that lead to active inference or like that are represented by the active inference general model is exactly what Andrew said which is that the Bayes rule is embodied totally by the generative model and that describes this like broad class of of constructable but then compatible with in this case free energy principle and not necessarily something else",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.789,
    "end": 616.68,
    "text": " I guess my thinking was that it came from two minds or was it from one mind using two different perspectives to think about a solution to the problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 619.006,
    "end": 621.349,
    "text": " I think it was many more than two overall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 621.47,
    "end": 629.361,
    "text": "Like many people have raised many different good points about how something like has to be to persist, for example, in cybernetics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 629.661,
    "end": 633.747,
    "text": "And then obviously many people have proposed different architectures and there's multiple ways to do active.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.787,
    "end": 640.698,
    "text": "So it's kind of, I think that, you know, maybe get towards higher resolution maps for the low, the high road and other things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.28,
    "end": 642.46,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 642.48,
    "end": 643.842,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 643.862,
    "end": 644.062,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 644.102,
    "end": 644.864,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 644.884,
    "end": 645.344,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 645.364,
    "end": 646.566,
    "text": "David, then Susan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 647.305,
    "end": 671.457,
    "text": " yeah so similarly along those lines if you go back to uh the image 2.1 I think it was um between the percentage uh frogs and apples I think it was a comparison so in terms of that likelihood at what point are we talking about the same thing in terms of like if you have a belief structure of you know what percentage of apples believe they're frogs",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 671.842,
    "end": 700.228,
    "text": " couldn't you wouldn't it be commutative in the same way where frogs would also have that same belief structure of apples that makes sense in terms of you know the occupying the same space so self-inferential are you a frog or are you an apple your priors still need to be updated in terms of that correct but there would still be that percentage would that percentage not go away despite you know replacing those priors in that sense",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 702.301,
    "end": 719.601,
    "text": " that's very interesting question so in this case this likelihood model is the a matrix in figure point three because it's describing the mapping between okay and apple or and what is the observation so this is kind of an exteroceptive a matrix",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.581,
    "end": 733.303,
    "text": " however the metacognitive models treat like ascending observations as observations of metacognitive observers so in that case that could refer to like interoceptive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 733.503,
    "end": 745.822,
    "text": " data coming in, interoceptive observations or introspective observations mapping to unobserved states about what kind of thing is generating those observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 745.882,
    "end": 750.329,
    "text": "Like, am I hungry given the stomach sensation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 751.39,
    "end": 755.697,
    "text": "So it could be applied internally as well to maybe some of the things you're talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 755.997,
    "end": 784.924,
    "text": " yeah i guess i was speaking more also in terms of uh what how it just said in terms of uh you know of one mind or of you know more than two minds as you had mentioned okay thanks susan so as far as um describing the low road and the high road would it be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 785.68,
    "end": 811.333,
    "text": " incorrect to use a colloquial term like tactical for low road tactical moves anyone think yeah go for it yeah it's an interesting question um i mean you know on the one hand i'm not so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.516,
    "end": 815.982,
    "text": " I'm not so sure if that can be answered expressly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 816.062,
    "end": 829.361,
    "text": "Maybe that's the kind of thing that I think someone might have to kind of do their own write up on justifying that as kind of maybe like part of the active inference ontology is to view it as tactical.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 830.283,
    "end": 837.473,
    "text": "I mean, if you were thinking to just the context, just within the confines of this chapter,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 838.634,
    "end": 842.755,
    "text": " and you're thinking about an agent being tactical,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 843.511,
    "end": 860.786,
    "text": " I would say the stuff relating actually to maybe planning that we see in later sections that might be more directly linked just conceptually with the word tactical in the sense of an agent is comparing potential sequences of actions or policies that it could take.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 862.087,
    "end": 867.131,
    "text": "It is scoring those based on the expected free energy for each policy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 867.171,
    "end": 873.096,
    "text": "You end up going with the one that has the lowest expected free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 873.076,
    "end": 901.446,
    "text": " right so that's a kind of like what should i do here are a series of paths i could take here's the one that is least surprising or at least is expected to have the least amount of free energy returned take that path right so it's almost like strategizing now that that itself is still kind of a loose analogy and that you know uh yeah yeah i can see that yeah so let me ask you another question that may relate it relates to it one one thought susan on that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 901.426,
    "end": 904.593,
    "text": " Andrew, that's a good answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 905.435,
    "end": 909.563,
    "text": "Doing the evaluation and the search is the how.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 910.085,
    "end": 913.732,
    "text": "And then there's other attributes of planning that would make up the high road of planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 913.873,
    "end": 917.781,
    "text": "And I think the stream to look at is 42.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.761,
    "end": 946.435,
    "text": " um so this is also very useful for nested modeling and understanding the composability of the nested modeling so here it was like analogy to strategy tactics control the center as being a higher order simpler less tactical less operational side and then their model of a robot in a warehouse has this finer scale",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 947.63,
    "end": 975.274,
    "text": " that is like tactical that described the posture of the robot and then a higher courser scale that was like the location of it now this model itself could be interpreted from a low road perspective because even though this higher order is about the location of the robot it is still constructed so it's probably yeah to look at it or to think about it especially if you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 975.558,
    "end": 1000.35,
    "text": " worked it out yes actually I think I think you know you got strategic and tactical on both ends of action and perception I mean that's what kind of came to mind when he was he was talking and and and so and I don't know if this relates directly or not but when we talk about high road and low road policies that do they do they have distinctly different policies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.693,
    "end": 1031.417,
    "text": " no they're meeting an active inference because you only build the active inference shattered model that's actually doing the inference so they just come together in that constructed model yeah i think if it's useful um i've almost wanted to bring this up from an earlier question but uh figure 1.2 in the chap in the textbook which is actually in chapter one page seven um this is just to illustrate like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1031.853,
    "end": 1040.249,
    "text": " Gareth J. With active inference in the Center right like these are the high and low roads to active inference like it's not so much that they're entirely distinct.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1040.589,
    "end": 1045.118,
    "text": "Gareth J. You know things it's more about conceptually, these are two paths that you could.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1045.318,
    "end": 1054.435,
    "text": "Gareth J. kind of take to kind of move towards understanding active inference right so it's like the low road is kind of we're starting from base there and we're starting from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1054.415,
    "end": 1064.794,
    "text": " Matt Kallroos- Statistics numbers calculation valuations so on and that's what this chapter is about meanwhile the high road is more about the free energy principles and now we're more expressly talking about things like.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1064.914,
    "end": 1076.254,
    "text": "Matt Kallroos- Like with perception everything we've talked about so far and seeing Chapter two we don't really see so much actually about like an agent trying to survive right we don't we don't quite see that this is just like math.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1076.234,
    "end": 1078.977,
    "text": " It's just doing stuff.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1079.758,
    "end": 1085.844,
    "text": "It's only near the end that we get mentions of it has preferences that go into planning and things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1086.304,
    "end": 1088.987,
    "text": "But really, this is just the mechanical aspect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1089.828,
    "end": 1103.001,
    "text": "The high road will give us much more context and I also think it makes active inference so much more interesting when trying to think about how to apply it to different situations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1122.91,
    "end": 1137.147,
    "text": " So I guess one of the purposes of active influence is so that we don't have to manually choose the priors, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1140.551,
    "end": 1142.493,
    "text": "Choose priors or choose what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.975,
    "end": 1150.723,
    "text": "Because in, I guess, in real life with organisms, you know, there's many hidden priors in your we.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1151.412,
    "end": 1165.536,
    "text": " we don't know that lead to, you know, the perceptions and decisions that, you know, they, they have, um, you know, and it'll be too much for us to, to try and emulate or simulate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.618,
    "end": 1177.015,
    "text": "Um, I mean, do we still have to generate the prize beforehand for an agent?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1179.172,
    "end": 1186.009,
    "text": " So that is something about active inference that there's been many conversations about this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1186.141,
    "end": 1212.486,
    "text": " could totally branch out much bigger philosophical questions but active inference doesn't necessarily have any guarantee of what a prior should be it doesn't you know it's not very good whenever it comes to origin stories I suppose is one way of stating it it's more about this is how things happen this is why things happen I will say if you're coming from more of like a computational modeling or coding perspective",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1212.466,
    "end": 1217.035,
    "text": " And you'll see this much later in the textbook in like chapter 7, for example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1218.057,
    "end": 1224.75,
    "text": "But oftentimes what's done is you'll establish some kind of vector of priors over initial states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1226.133,
    "end": 1229.479,
    "text": "So you do kind of have to hard code those.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1229.729,
    "end": 1238.5,
    "text": " The thing is, you can have the agent interact with its environment, running trials, and then it can, in fact, from trial to trial, update its own priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1239.041,
    "end": 1245.849,
    "text": "So it's kind of like once you get the motion moving, it kind of moves on its own, so to speak.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1246.23,
    "end": 1251.316,
    "text": "Furthermore, a lot of examples, whenever it comes to modeling, many people just start with uniform priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1252.157,
    "end": 1256.783,
    "text": "There's not something there necessarily that says you have to have some very,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1256.763,
    "end": 1264.672,
    "text": " domain knowledge specific priors or something like unleash the agent with uniform priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1264.712,
    "end": 1273.442,
    "text": "It doesn't know what's going on, but presumably it will, you know, as the low road mechanics play out, it will readjust its own priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1274.303,
    "end": 1277.367,
    "text": "It kind of depends on the use case is the simplest answer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1278.348,
    "end": 1278.528,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1279.009,
    "end": 1284.475,
    "text": "So it can,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1285.248,
    "end": 1299.234,
    "text": " It's on price, you know, if it's given, you know, like observations of like RGB, you know, an RGB camera and maybe, yeah, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.334,
    "end": 1303.321,
    "text": "I guess it's just some sort of, you know, sensory input.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1305.385,
    "end": 1306.407,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1306.427,
    "end": 1306.527,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1306.547,
    "end": 1307.188,
    "text": "It is not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.624,
    "end": 1332.231,
    "text": " widely or simply available that just because like you made a active inference agent it's going to do arbitrary like infinite generalization structure learning etc like those are very exciting directions to consider the kind of beginning state and the procedures for agents that could do things like modify the number of observations they received or understand different policy spaces",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1332.818,
    "end": 1340.28,
    "text": " So that's definitely to be explored and then play around with the different components of that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.767,
    "end": 1344.432,
    "text": " separately and then bring them together and see how things go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.133,
    "end": 1350.4,
    "text": "But if you just look at like a PyMDP tutorial, that is not going to do like open-ended structure learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1351.182,
    "end": 1362.277,
    "text": "Whereas maybe a certain kind of wrapper around the recent structure learning paper would have that kind of capacity, but then not necessarily like affect or attention or something else that's explored in a different paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.998,
    "end": 1369.407,
    "text": "So it's always very situational which capacities are actually brought in because unless there's like some kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1369.387,
    "end": 1393.842,
    "text": " open-ended or metaprogramming element it's not gonna do something that is not described by the generative models form it's is that like a big goal of active influence because I I mean it feels like you know without that it would just be nearly impossible to to emulate you know the same fires that you know living organisms would have because you know we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1394.564,
    "end": 1418.04,
    "text": " organisms would have a lot of fire so i like almost you know from our perspective almost an infinite amount of fires yes and depending on the niche but definitely some people that's similar to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1418.965,
    "end": 1442.813,
    "text": " what they might be interested in like developing generalization capacities through metacognitive um nesting or through observers with higher complexity that might be something kind of related to how wolfram is approaching it like with the observer theory and all of that and like computational capacity david",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1444.177,
    "end": 1445.358,
    "text": " Yeah, just an observation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1445.639,
    "end": 1453.267,
    "text": "Can you go back to the branch map that you had with Bayesian and Friston?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1453.287,
    "end": 1459.755,
    "text": "It was related to what Susan was asking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1460.095,
    "end": 1465.501,
    "text": "It had Bayes theorem at the bottom, and it had active inference at the top, I believe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1466.562,
    "end": 1468.024,
    "text": "It was a tree map.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1475.024,
    "end": 1497.15,
    "text": " figure one with the high and low road yes yes all right yes so sorry uh so yeah FEP so I guess just like visually I construct it this way where could you consider this if you linked phase with free energy principle that that would you know cover a surface so in that case if you could do that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1498.193,
    "end": 1505.803,
    "text": " would you have bays over free energy or would it be free energy over bays or would it be commutative if you can see the structure there?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1507.765,
    "end": 1514.334,
    "text": "Maybe write it down, like write it out as a question for the chapter and let's return to it, but it sounds interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1514.354,
    "end": 1517.137,
    "text": "Yeah, it's outside of the bounds of what we're covering, so thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1517.478,
    "end": 1520.001,
    "text": "It's just hard to process in real time, but it sounds interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1520.862,
    "end": 1521.543,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.563,
    "end": 1524.807,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.827,
    "end": 1525.508,
    "text": "Anyone else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1525.528,
    "end": 1527.711,
    "text": "We can go totally any...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1528.568,
    "end": 1529.454,
    "text": " Direction with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1531.046,
    "end": 1534.309,
    "text": "To or look ahead or look to some other part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.743,
    "end": 1566.574,
    "text": " one more thought on the um question about where like the priors come from this is coming up later in chapter nine but chapter nine is about integrating real data so that kind of addresses some of the questions that come up about how to integrate with real systems because like it seems like pretty clearly one kind of thing to just write out a model or like sketch it out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1566.858,
    "end": 1595.515,
    "text": " just propose it and then it's another thing to connect it to data and and use it in like empirical settings so here's kind of that model that is constructed of like the rat in the teammates and then that's a map of the rat's cognitive territory it's not claiming to be a total description of the rat's physiology just the teammates decision as analyzed a certain way",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1596.119,
    "end": 1622.886,
    "text": " um so it's the observer or the experimenter who's passing what become observations to the rat but their actions from the scientist and then the admitted actions of the rat are observations for the scientists so it is it is possible to understand like our role around like building the generative model in terms of this kind of laboratory setting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.739,
    "end": 1629.343,
    "text": " kind of consistent with the origins and the behavioral analysis and SPM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1631.145,
    "end": 1637.83,
    "text": "Like in a laboratory making a cognitive map, then that map is a map of the environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.641,
    "end": 1653.244,
    "text": "And then that was kind of explored in a really,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.743,
    "end": 1661.07,
    "text": " clear and interesting way by this paper with Ramstead, Sachdeva, Develd, and Friston.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1662.231,
    "end": 1665.535,
    "text": "I'll put it in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1665.735,
    "end": 1671.341,
    "text": "But they make very strong claims about that kind of relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1674.164,
    "end": 1682.033,
    "text": "Essentially saying, if this is how you see the situation, then FEP is the best descriptor of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1685.118,
    "end": 1693.469,
    "text": " So people could dissent from their conclusions or from their setup of the problem or other features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1694.831,
    "end": 1698.396,
    "text": "But it's a very strong claim within this setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.382,
    "end": 1709.37,
    "text": "And then the fallacy fallacy, like the map territory fallacy, is very commonly discussed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.502,
    "end": 1714.107,
    "text": " The map of San Francisco is not the actual land or the territory of San Francisco.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.168,
    "end": 1720.996,
    "text": "And there's like the Borges story about the one-to-one map and how that becomes not useful because it's kind of like wrapped over the real world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.136,
    "end": 1725.0,
    "text": "So maps are always kind of motivated by the right core screenings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1726.062,
    "end": 1735.493,
    "text": "And then map territory fallacy is falsely or inappropriately articulating the map territory relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.625,
    "end": 1758.46,
    "text": " but then they are responding to what they perceived is a criticism of active FEP which is um once it's acknowledged as a cognitive modeling technique then people say well then it is just a map we want the real territory description and we want the real thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1759.553,
    "end": 1783.485,
    "text": " then that's like the fallacy fallacy is their kind of term for the overshoot it's like okay well then it doesn't describe anything because you can just construct whatever map you want it's like yes you can construct whatever map you want of san francisco i thought what so that's kind of interesting angle that they brought out even a few years ago david",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1784.748,
    "end": 1811.211,
    "text": " yeah so in terms of that i'm just trying to think of how to how to rephrase it um in terms of the mapping itself i mean obviously like through periodic time change and everything but if you created the map itself like if you i'm thinking in terms of like wave function collapse right if you're if you're observing something directly it will collapse the wave function just you know as a basic overview of it but if it's",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1811.613,
    "end": 1822.806,
    "text": " Blake Fitzpatrick's iPhone & Oblique to your perspective, but it's still within your it's not necessarily necessarily in your priors or it might have been dissolved from your priors into something else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1823.186,
    "end": 1837.823,
    "text": "Blake Fitzpatrick's iPhone & That's kind of your own inferential map which are not collapsing, but you're utilizing without having to, you know, use that extra energy or any extra energy beyond, you know, just that distilled information that you have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1837.943,
    "end": 1841.367,
    "text": "That's kind of how I Blake Fitzpatrick's iPhone & reinterpreted that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1843.169,
    "end": 1844.851,
    "text": " That sounds very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.931,
    "end": 1853.622,
    "text": "Like there's like a primary sensory mapping that's like dealing with a collapse over like primary observations or something, but then.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.503,
    "end": 1854.783,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1854.803,
    "end": 1870.662,
    "text": "So instead of like a singular viewpoint of the map and all of its other points, the viewpoint comes from, you know, a different perspective that you're not particularly aware of at the time of your inferential connection to the map itself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1871.705,
    "end": 1876.871,
    "text": " So the map still exists, but you're not using any energy to look at it directly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1876.911,
    "end": 1882.878,
    "text": "So it kind of Mercatus itself over your own perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1885.782,
    "end": 1886.422,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.643,
    "end": 1888.465,
    "text": "Add more, but it sounds interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1888.785,
    "end": 1889.286,
    "text": "Cheryl.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.288,
    "end": 1891.869,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1891.889,
    "end": 1892.429,
    "text": "Hi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.449,
    "end": 1893.831,
    "text": "Um, I've been, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.621,
    "end": 1902.39,
    "text": " As you know, I'm new to this, but I am very much interested in the way cognition is defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1903.191,
    "end": 1912.963,
    "text": "So my first question is, does the active inference then just focus on observable behaviors?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.804,
    "end": 1923.295,
    "text": "Because so much of what the brain does is implicit and is not going to actually show up as a sign.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.933,
    "end": 1927.065,
    "text": " something that an outsider could even observe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.47,
    "end": 1930.939,
    "text": "So I'll stop with that question before I go on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.809,
    "end": 1934.531,
    "text": " It's a great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1934.731,
    "end": 1943.981,
    "text": "So I wouldn't say it models only observable behaviors, but rather it is made clear what is observable and what is not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1944.001,
    "end": 1952.15,
    "text": "So you can make a model that's fully observable, like a chessboard, where there is no difference between the observations in the hidden state, like of the piece on the board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.851,
    "end": 1955.374,
    "text": "So it's like a fully observable system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1955.354,
    "end": 1963.789,
    "text": " Or you can have a system where the only observation is a binary state, and then there's like very complex internal dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.63,
    "end": 1969.599,
    "text": "And another angle on that is from this paper with Bongard Levin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1970.14,
    "end": 1976.451,
    "text": "So here they talk about this like poly computing, which is that the observer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1976.431,
    "end": 2000.228,
    "text": " is doing inference on what kind of computation a material is doing so if like there was an encrypted communication to an observer who didn't know it would look like noise that's why the observer's um situatedness is so important because we we shouldn't just assume that just because it was noise to one observer doesn't mean that there isn't something in that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.697,
    "end": 2025.675,
    "text": " information stream but it was their relationship of it that it was perceived to be doing just noise generation whereas in a different reference frame that could have other information that can't be ruled out even from from any kind of noise pattern so like i would say it's it's a big philosophical and empirical question how you model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2026.398,
    "end": 2030.244,
    "text": " like the priors and the hyper priors and all of this of observers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.466,
    "end": 2046.569,
    "text": "And that just like empirically, there are techniques that Bayesian researchers use to address some of these things, like testing the influence of different prior distributions or building the initial priors from empirical data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.211,
    "end": 2054.16,
    "text": "But certainly there's a lot of expressivity and probably a lot of complexity to what you're asking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2054.933,
    "end": 2065.332,
    "text": " Right okay that that's helpful so active inference does not claim to be the way that this works, but a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.193,
    "end": 2072.257,
    "text": " Yes, it's totally true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2072.298,
    "end": 2093.048,
    "text": "That's why it's often helpful to differentiate between like, when are we talking about like active inference as is versus with how it can be, which is improving and learning active inference or active inference versus an alternative account of the same phenomena, something that like Ryan Smith and other researchers do do and hopefully will happen more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.088,
    "end": 2096.533,
    "text": "That's one kind of comparative mode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2098.015,
    "end": 2123.196,
    "text": " which is a totally valid and important mode because it's important um for certain questions and situations and everything like to know like does reinforcement learning fit better than active inference in this setting there's other times there's kind of epistemic value even with just developing along just an active model but it's always useful to have even really radically different models like is this predictor even better than just a coin flip",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2124.543,
    "end": 2130.016,
    "text": " And then that helps calibrate it to like more reference points than just parameters within the active model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2131.781,
    "end": 2136.853,
    "text": "Which then doesn't allow you to make points about that in relationship to something that wasn't actually explored.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2139.299,
    "end": 2139.379,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2140.591,
    "end": 2143.937,
    "text": " So I just have a question about where to put questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.74,
    "end": 2151.21,
    "text": "Because you're right, I think I need to write this out to get a better idea of what it is that I'm even asking you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.613,
    "end": 2155.999,
    "text": "But it has something to do with the difference between implicit and explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.86,
    "end": 2161.148,
    "text": "So where would I kind of think this through?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2161.128,
    "end": 2186.967,
    "text": " right you could add a new row and like add to this table or you could like literally just add it anywhere anywhere okay and then do that like active inference Institute and then it's just if you add it anywhere you type it okay yeah okay great all right thank you but yeah these are interesting questions like does the implicit and explicit map on to observations and hidden states",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.436,
    "end": 2212.549,
    "text": " correct and then is there another implicit explicit for modeling is that the same one described by the internal oh by the hidden states in the by the observations not necessarily right because at one point I'm going to ask you about neurons and neural development and the the way that the brain actually um in in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.373,
    "end": 2220.324,
    "text": " in embryos grows together, myelination, how these things, it doesn't seem like a Bayesian thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.364,
    "end": 2227.315,
    "text": "And because they don't all come out different in a normal curve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2228.897,
    "end": 2233.043,
    "text": "Most human beings have their brains developed along the same lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2233.144,
    "end": 2239.954,
    "text": "And so I just would like to know how active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2240.609,
    "end": 2249.556,
    "text": " What part does it play as you go down levels of analyses or way up in levels of analyses past just agents?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.848,
    "end": 2259.637,
    "text": " All great questions on the development line, like the canalization of development, like the regularity across individuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.717,
    "end": 2261.158,
    "text": "That's definitely a big topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2261.198,
    "end": 2270.969,
    "text": "Like Mike Levin and other researchers especially have looked at that, like Waddington's epigenetic landscape and understanding how like cells come to have morphology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2271.029,
    "end": 2277.436,
    "text": "And then, I mean, you brought up other things as well, but yeah, those are like, those are all great questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.077,
    "end": 2278.858,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.878,
    "end": 2279.779,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.113,
    "end": 2285.615,
    "text": " Anyone else just go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.601,
    "end": 2292.362,
    "text": "Yes, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.224,
    "end": 2298.988,
    "text": "I thought we have a section for cohort six questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2301.971,
    "end": 2303.613,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2304.514,
    "end": 2309.599,
    "text": "When I was waiting for the textbook, I do like to put down my thoughts in there as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2310.12,
    "end": 2310.721,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.741,
    "end": 2312.162,
    "text": "Let's look at some right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2314.268,
    "end": 2320.617,
    "text": " They do all go to the same underlying thing, but if you want it to be tagged with cohort six, thank you for suggesting that you put it in here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.241,
    "end": 2325.164,
    "text": "And I'll make a chapter three one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2329.651,
    "end": 2340.306,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.326,
    "end": 2340.867,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2348.947,
    "end": 2355.033,
    "text": " What happens if you just update the prior with the posterior instead of using KL divergence?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.579,
    "end": 2369.307,
    "text": "Do you mean like what happens if you update your belief just like to last observation super simply instead of calculating anything more complex than that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.068,
    "end": 2377.435,
    "text": "Yeah, without using the supplies and I guess this to me kind of feels like a learning rate kind of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2377.567,
    "end": 2393.314,
    "text": " um is it is it like that yeah like um it's also related to kalman filter and smoothing so it's like if we're um getting noisy thermometer measurements i mean we could just update our belief just to the noisiness of the thermometer measurement",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2393.868,
    "end": 2408.486,
    "text": " and just treat it like perfect measurement of a underlying process, but the dynamics of the underlying process, like we might be able to get a way better model by just saying, well, it's a sinusoid hidden state, and then we're just sampling from it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.768,
    "end": 2420.061,
    "text": "So, I guess it makes sense from that perspective, but from the perspective of, you know, whether it's a fog on apple, you see an apple jump, it kind of feels like, oh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2421.458,
    "end": 2448.293,
    "text": " like it's um much it could be a much stronger update that oh it is not an apple it's actually a phone now yeah like in this world there's a one percent chance that apples jump so you're totally right that if this was uh apples never jump like a heuristic encoded as um a column in this matrix yeah then it would go 100 so it's like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2449.673,
    "end": 2473.065,
    "text": " in practice you can do things like that that truncate or just like start with no noise on a certain thing um zach data yeah great question it's um one that also came up actually earlier so look at the cohort five um video on like reinforcement learning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.332,
    "end": 2481.424,
    "text": " But the key difference is that in active inference, we're directly talking about the joint distribution and the likelihood of the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2482.706,
    "end": 2494.243,
    "text": "And preferences, so pragmatic value, the way that they come into the picture in decision making is by checking the difference between the preferences and the observations coming in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.612,
    "end": 2502.62,
    "text": " Whereas in reinforcement learning, there's a secondary reward distribution that's proposed on top of the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2502.72,
    "end": 2508.486,
    "text": "Like 37 degrees body temperature is rewarding, and then you pursue rewarding policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2510.028,
    "end": 2518.797,
    "text": "Versus in active inference, 37 is expected and preferred, C, and then likely policies are sampled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2520.7,
    "end": 2545.763,
    "text": " doesn't mean any given active model is as good or better or anything at all at all so it's totally situational which one is more useful which one you're more comfortable with and so on but that's the difference i heard someone susan said i heard someone say active is based on causality not correlation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2547.059,
    "end": 2550.603,
    "text": " Well, you can use it to study correlations amongst variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.564,
    "end": 2557.852,
    "text": "You could also use it like a Bayesian causal graph to study so-called causation amongst variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.193,
    "end": 2572.189,
    "text": "So then you could engage in the whole, is the causative map, the territories causation, that's a whole area like Mel Andrews and others have explored some of that philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.228,
    "end": 2602.733,
    "text": " um and judith pearl kind of and other people delman in the statistical causal modeling question with um dynamic causal modeling like if there's a causal relationship identified in the hidden state between two brain regions in the fmri study does that mean they have a causal relationship like those are questions that there's a lot of discussion on david",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2603.995,
    "end": 2607.579,
    "text": " Yeah, along those lines, how would that relate to like a co-causal state?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2610.082,
    "end": 2619.433,
    "text": "Co-causal state could be like, here there's two distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2620.234,
    "end": 2623.598,
    "text": "Here's temperature and humidity, and then the output is the dew point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.899,
    "end": 2627.522,
    "text": "So two things that jointly cause a third thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2628.262,
    "end": 2628.702,
    "text": " Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2628.963,
    "end": 2644.416,
    "text": "I'm also thinking in terms of like a third that causes still a singular in terms of like a XOR, if you were thinking in terms of like a gated where it's not a choice, but rather it's, you know, you have two individuals making separate decisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2644.657,
    "end": 2648.36,
    "text": "One person is the patient in the, you know, the case we're talking about here, right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2648.52,
    "end": 2656.547,
    "text": "In terms of the patient being doing EEG scan or something with the doctors priors, you know, at, you know, going down to that point,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2657.135,
    "end": 2686.635,
    "text": " 01 right that one percent apple frog you know at what point is it co-causal then does it become a zor or does it become still an overstate or joint co-state very interesting i think look at this guest stream 67 if you haven't which talks about like noisy independent experts and about how like with sensor arrays that having more noisy uncorrelated which is to say noisy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.02,
    "end": 2696.563,
    "text": " Bruce Sutherland, components, whereas like if all the experts agreed on a test you actually have low precision relative to one with an uncorrelated error profile.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.786,
    "end": 2699.47,
    "text": "Bruce Sutherland, Okay perfect i'll check that out, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2699.49,
    "end": 2703.78,
    "text": "Bruce Sutherland, Someone else had their hand raised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.831,
    "end": 2718.744,
    "text": " Okay, just to clarify, we want variational free energy to be as small as possible, approaching zero or negative infinity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2720.407,
    "end": 2726.637,
    "text": "In practice, approaching some number value that's in arbitrary units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.618,
    "end": 2732.366,
    "text": "There was like a discussion on the Discord general about this that people could look at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2732.967,
    "end": 2737.935,
    "text": "But like the free energy values itself is going to converge to some value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2738.928,
    "end": 2739.529,
    "text": " James Forrest, Norcal PTAC.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2739.509,
    "end": 2752.397,
    "text": ": situation specific minimal value, just like if you were doing least squares like some squares minimization for linear regression the best fit regression would converge to like some sum of squares.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.816,
    "end": 2758.044,
    "text": " So just a number sum across the squared error differences from the linear regression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.645,
    "end": 2764.133,
    "text": "But then that value is depending on the number of data points and the units and all this other random stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.653,
    "end": 2767.197,
    "text": "Not really random stuff, but it does depend on those things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2767.758,
    "end": 2775.229,
    "text": "So that's why delta free energy and the gradient of free energy is used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2775.783,
    "end": 2802.381,
    "text": " and all of the physics grounding is actually about the gradient around the free energy and that's why it's like incrementally optimizable because there's a surface that gradients on free energy can be taken on so it's like a landscape like a free energy landscape there's an elevation at that point that's like the actual score of like Q and given Y",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.918,
    "end": 2827.255,
    "text": " and then there's the local slopes that are used for optimization and then the simplest optimization heuristic is just go in the direction that it's going to be lower but that doesn't really matter what the absolute value is and then when it's when the change in free energy is zero the model is like converged to a stable point could be local could be global that's the whole challenge with like modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2843.435,
    "end": 2866.303,
    "text": " yeah this is a great question I think maybe some people have put things people outside of active inference have written about like so-called conspiracy theories in Bayesian belief updating um also definitely some of these topics people have looked at like people can add links but let's continue all the other questions um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.009,
    "end": 2892.966,
    "text": " generating prayers i mean in practice they're specified by the person who's making the generative model there should be many priors and policies yet to make the quote whole iguana so this is in chapter 10 but chapter 10 is a lot like chapter one so um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.283,
    "end": 2903.253,
    "text": " This is like in contrast to the research program of like let's study, which is also a very useful research program, but kind of two paths diverging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2903.834,
    "end": 2913.223,
    "text": "One of them is like studying really narrow components, like let's study mechanotransduction in this brain region of Drosophila fruit fly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2914.625,
    "end": 2918.008,
    "text": "And then understand very narrow features very deeply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.765,
    "end": 2923.752,
    "text": " but scattered across the animal and non-animal species.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2924.513,
    "end": 2940.233,
    "text": "And then in contrast, this alternative holistic approach is model the whole iguana, which is like, how about not just super good on the homeostasis of temperature on the iguana, then we know nothing about this other component, but think totally about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2941.478,
    "end": 2966.912,
    "text": " so yeah it is very challenging to make multimodal models because it's easy to make a single like an ant colony model with just foraging is easy but then if it's like foraging and nest construction it's hard to do that David yeah so in terms of that wouldn't it wouldn't that come back then to context-free grammars and being able to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2968.377,
    "end": 2988.445,
    "text": " um compute better in that context because at what point you know when you start using frog iguana Apple I mean isn't that giving context to the measurement itself to begin with yeah very interesting question I think in the pedagogical context you could replace it with like any",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2989.133,
    "end": 3017.706,
    "text": " other it could be the whole onion so like in that sense it doesn't like it's not a specific just to be really clear um but like yes the reason why that makes sense or how somebody would know what to do is reflective of their I guess I guess that's kind of how I'm seeing it is in terms of like if you remove all the context from everything you're if you have the statistics remaining you could apply it to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3019.002,
    "end": 3036.947,
    "text": " you know, your own inference in terms of, you know, seeing that statistical dynamic amongst two other things that are named something else, you know, that have the same exact end values that might end up, you know, then being, if you remove the context from it, you know, the statistical correlation still exists.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3039.751,
    "end": 3040.172,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3040.192,
    "end": 3043.096,
    "text": "There's, there's a lot of things that say about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.117,
    "end": 3047.001,
    "text": "I mean, there are priors, I suppose that you're bringing into that as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3050.39,
    "end": 3079.367,
    "text": " boom let's explore it more but yes it sounds interesting all right thanks thomas for the live streams on the noisy experts that was 67.1 67.1 and tqr susan asked is degrees of freedom computed and active and not reinforcement",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.418,
    "end": 3083.599,
    "text": " That is not the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3084.22,
    "end": 3088.544,
    "text": "Degrees of freedom are in play anytime statistics is being used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3088.564,
    "end": 3099.435,
    "text": "So even if you were to use linear regression or reinforcement learning or neural network or LLM, transformer, any of those statistical settings, degrees of freedom are in play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3101.237,
    "end": 3111.767,
    "text": "ANOVA, t-test, every single statistic setting with the meaning of what they describe the degrees of freedom of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3116.911,
    "end": 3118.214,
    "text": " Not sure if I'm using the right term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.695,
    "end": 3123.624,
    "text": "Are these equations proven either mathematically or empirically, or are they useful approximations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3126.55,
    "end": 3127.692,
    "text": "It's a complex question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3128.133,
    "end": 3138.514,
    "text": "In one sense, all of the consistent spaces in math, subspaces and so on, by virtue of the equal sign, they're all describing tautologies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3139.068,
    "end": 3148.541,
    "text": " all of them could be reduced to like one equals one, which could come back to like the axioms of how we are gonna be defining like numbers and equality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3149.382,
    "end": 3166.746,
    "text": "So there's an intrinsic logic to the equations that describes like the fact that it really is possible as for example, Jakob and some other people have done, like with equation 2.5, you really can go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3167.553,
    "end": 3193.577,
    "text": " and look how the different decompositions really of free energy and expected energy really are related to each other formally so there's an internal consistency similar to the status of all other like mathematical statistics or like mathematical physics does that provide an empirical validity is a totally interesting question",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3194.131,
    "end": 3219.818,
    "text": " it certainly does not provide situational validity or adequacy but then it's like a different interesting question does it like what are we looking for when we say empirically and like the live stream from just a few days ago with Ryan Smith um on the empirical status is super relevant as I'm sure the insights that is going to be like later in the week with Ryan Smith",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.013,
    "end": 3242.245,
    "text": " so like and he talked a little bit about like his philosophy background in this stream it was really cool because most of his work is very clinical and like has to do with with like scientifically clinical empirical okay any last question",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3257.733,
    "end": 3264.003,
    "text": " So this was chapter two, low road, the what slash how.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.586,
    "end": 3283.335,
    "text": "Chapter three kind of refreshes and picks up on the high road with more about the like transcendental imperatives side that are not necessarily architecture dependent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.345,
    "end": 3288.131,
    "text": " So I think like in that, the robotics work of J.F.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3288.151,
    "end": 3303.537,
    "text": "Cloutier at the Institute, he's used symbolic programming to develop kind of an alternative low road that's not distributional belief based, but it has the same high road imperatives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3304.759,
    "end": 3310.909,
    "text": "So just kind of an example of how there can be like the same why.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3311.227,
    "end": 3315.813,
    "text": " Same teleos, same ends could be done with different low roads.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3317.034,
    "end": 3320.098,
    "text": "Kind of interesting topics that like come out through chapter three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.54,
    "end": 3332.094,
    "text": "Then having approached Actim from the two sides, chapter four goes into the formal details of the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3332.895,
    "end": 3334.296,
    "text": "That's the central artifact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3334.477,
    "end": 3336.78,
    "text": "That's like what is constructed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.761,
    "end": 3341.065,
    "text": "And then chapter five gives a bunch of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3341.298,
    "end": 3346.345,
    "text": " studies and reviews on one of the systems that's been the most studied, which is like the mammalian nervous system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3346.965,
    "end": 3353.133,
    "text": "So kind of just showing here's what constructing system specific models and linking them up looks like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3354.976,
    "end": 3360.383,
    "text": "And here's what it looks like in the several decades of study that people have done in the mammal nervous system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3362.145,
    "end": 3364.749,
    "text": "Just as kind of like a review slash jumping off point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3366.371,
    "end": 3369.735,
    "text": "Any last like comments or thoughts?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3383.654,
    "end": 3388.402,
    "text": " I watched a video with Dr. Jeff Beck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.245,
    "end": 3400.363,
    "text": "And I'm not sure if I'm remembering this properly, but they were saying there are some people trying to implement the transform architecture within active influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3404.613,
    "end": 3405.975,
    "text": " Like, does that make sense at all?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3405.996,
    "end": 3408.44,
    "text": "Or maybe I'm remembering wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3408.46,
    "end": 3422.706,
    "text": "There's projects that are doing everything from like act inf wrappers around transformers to transform wrappers around LLMs to transformers or neural networks, replacing specific matrices in generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.686,
    "end": 3450.988,
    "text": " like using a neural network for a instead of just a matrix with the dimensions of observations by hidden states so there's many possible combinations I don't know what back discussion it was but um he did talk with Darius and they like talked about Markov blanket and brought up like a lot of useful questions and comments on this does that address it cool cool yep all right thank you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3452.538,
    "end": 3452.831,
    "text": " Bye.",
    "speaker": "SPEAKER_02"
  }
]