[
  {
    "start": 7.928,
    "end": 31.118,
    "text": " hello and welcome everyone this is the active inference institute quarterly roundtable number one for the year on march 29 2024 so welcome alex thanks everyone we're a participatory online institute that is communicating learning and practicing applied active inference you can find us at the links on this slide",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.098,
    "end": 37.769,
    "text": " This is a recorded and an archived live stream, so feel free to provide feedback so that we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.731,
    "end": 43.699,
    "text": "All backgrounds and perspectives are welcome, and we'll follow video etiquette for live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.16,
    "end": 50.49,
    "text": "If you're watching along live, feel free to put any questions in the live chat, and we'll get to them at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.871,
    "end": 55.675,
    "text": " Well, today we're here in our first quarterly update of the year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.236,
    "end": 60.341,
    "text": "We'll give some updates and remarks at the Institute scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.921,
    "end": 72.074,
    "text": "Then we'll take a look at the EduActive and ReInference organizational units covering the education and research projects and just talk about moving forward in 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.716,
    "end": 76.039,
    "text": "Before we jump in, Alex, do you want to add anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.761,
    "end": 91.372,
    "text": " Just a little celebrate for now one year and first round table for this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.433,
    "end": 92.633,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.314,
    "end": 97.678,
    "text": "Yeah, feels like a lot has already happened, but I guess that's why we snapshot it quarterly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.319,
    "end": 102.343,
    "text": "So here we go into Institute scale updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.884,
    "end": 107.848,
    "text": "Starting with a big picture on where things are at with the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.25,
    "end": 115.181,
    "text": " Here in the center, we have a representation of the Institute and its relationship with the ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.183,
    "end": 123.475,
    "text": "We have Institute level functions such as our officers, board of director and scientific advisory board.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 123.455,
    "end": 133.36,
    "text": " who help steward and guide directly or indirectly the organizational units focused on education, eduactive, and research, re-inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 134.082,
    "end": 139.776,
    "text": "And underneath those organizational units are all of the projects that we're going to be talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.756,
    "end": 165.021,
    "text": " through the projects is where dissemination participation and engagement occurs at the institute as well as some engagement types that we'll be discussing more in a few slides that are at the institute scale related to philanthropy and partnerships and following on from the quantum free energy principle work of chris fields in the course that he taught last year we have in this year",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.001,
    "end": 169.367,
    "text": " begun a prepare and measure dual form approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.128,
    "end": 173.012,
    "text": "The preparation and the measurement forms are always open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.492,
    "end": 176.536,
    "text": "They're open to proposals and measurements, large and small.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.777,
    "end": 182.825,
    "text": "We use them for projects within the Institute, and we also use it to interface projects in the ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.606,
    "end": 190.755,
    "text": "The proposal or the preparation form describes what the project team is setting up to operate or do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.735,
    "end": 199.367,
    "text": " And it outlines explicitly how the team is thinking about their contributions to the accessibility, rigor, and applicability of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.309,
    "end": 205.817,
    "text": "Also, teams are able to suggest minimal and higher levels of support that the Institute could provide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.337,
    "end": 217.333,
    "text": "So if nothing else is needed from the Institute other than a channel and a chat thread or a certain other kind of small support, then things might just begin right then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.685,
    "end": 242.713,
    "text": " or maybe they're waiting for some kind of support or maybe they throw out a high support offer and one day we hope to be able to fulfill those in support of the ecosystem and then the other side of the coin or the other side of the action perception loop as it were is the measurement form which describes what the person or the project or the team did what did they see change and learn",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.693,
    "end": 249.379,
    "text": " And these measurements reports could be about open source contributions to code and educational materials that people make.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.879,
    "end": 252.742,
    "text": "It could be, I read a page from a book today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.463,
    "end": 257.987,
    "text": "And that enables visibility, communication, and the flow of support to projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.287,
    "end": 272.7,
    "text": "So we hope that through this project-based engagement and preparation and measurements, we'll have a lot of very interesting affordances and structures to include and accommodate how diverse our community and ecosystem are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.68,
    "end": 280.479,
    "text": " Which leads to a common and central and critical question, which is okay, but how to participate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.281,
    "end": 287.837,
    "text": "Well, suffice to say there's multiple ways to be involved on your own timelines or on ours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 287.817,
    "end": 291.302,
    "text": " And by even asking, you've begun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 292.323,
    "end": 297.29,
    "text": "Onboard.activeinference.org is one landing point if you want to get more involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.851,
    "end": 300.895,
    "text": "We also have a Discord that you can jump into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 301.476,
    "end": 309.707,
    "text": "And sending an email to blanket at activeinference.institute is also always a good way to get the conversation going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.839,
    "end": 323.919,
    "text": " As for projects mentioned on the previous slide, you can join synchronous listed meetings of projects, or if the time doesn't work or you prefer another mode of engagement, you can communicate with the project facilitators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.44,
    "end": 336.437,
    "text": "So the activities page is just like a roster or menu or a series of options, affordances that you can design your curriculum and tune it in and out as you see fit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.244,
    "end": 350.205,
    "text": " For people looking to have a more structured involvement with projects, as well as maybe to accelerate on their personal active inference journey, there are other programs that we provide, such as the Institute internship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.806,
    "end": 359.961,
    "text": "And for staying updated on happenings in the ecosystem more broadly, we have a newsletter and a video channel, perhaps one that you're watching right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.941,
    "end": 387.484,
    "text": " and so some of the paths through can look like this beginning with staying updated this phase could be 15 minutes for some people it could be 15 years for some people to learn and absorb read the papers and the publications that are coming out about active inference and related topics watch our videos follow social media accounts and read our newsletter and do your own things in the ecosystem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.848,
    "end": 417.91,
    "text": " learn apply share your work donate stay tuned for more opportunities and so on and then across the thin dashed line into the institute someone joins to contribute to a project or just to find out what's going on in a project curiosity is enough and maybe moving on to participating in an internship and really getting more embedded and engaged with the active inference community and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.953,
    "end": 448.234,
    "text": " blazing paths or following whatever is important for you on that personalized journey so these are just some of the ways to get involved there's a lot to learn and there's a lot to absorb and resource sharing is a big piece of that and if somebody wants to get in contact or get more involved in the projects that we're going to be describing here that is why we are participatory that's why we're here for everyone anything to add on that Alex",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.437,
    "end": 465.902,
    "text": " Yeah, I see it quite important and valuable with the new approach that we propose in the implementation in terms of using preparation forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.777,
    "end": 469.383,
    "text": " and also forms that reflect the progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 469.704,
    "end": 481.211,
    "text": "And I believe maybe for now, for people who are familiar with the Institute, we should see it as developments that we should pay attention and see how to use them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.033,
    "end": 485.241,
    "text": "And for new possible participants also,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.221,
    "end": 509.001,
    "text": " to have more close look on that forms because this approach again is based on just principles and it's provide ways and affordances for us to organize work on different physical scales and also time scales thank you thanks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.871,
    "end": 530.044,
    "text": " carrying on with some more institute scale updates here's a nice new re-representation of some of the organizational rhythms starting with the quarterly we have the round table the video we're in right now and also quarterly meetings with our board of directors this is our second",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.176,
    "end": 557.331,
    "text": " cohort same people but our seconds go around on a monthly time scale we have meetings with our scientific advisory board which is an informal guidance and insight board and day after day hour after hour our sab members make many important and relevant contributions so we spoke with them even yesterday and it's great to continue those conversations and just the incredible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.29,
    "end": 581.327,
    "text": " backgrounds and approaches that people bring and and how excited and productive it can be when we're working together all like this then on a weekly time scale Alex blue and I checking in as officers and on a daily to sub-second time scale the actual inference and activity of our community itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 583.147,
    "end": 602.995,
    "text": " also we're really excited to today discuss a few upcoming programs that are going to be developing in the coming weeks beyond where they have been and rolled out very soon the three programs that people will hear more about in the coming months but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.228,
    "end": 620.038,
    "text": " If you're interested in these programs, if you have insight or experience in any of these areas we're about to discuss, or if you feel like you or your organizations might want to be some of the truly very first in each of these categories, please get in touch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.018,
    "end": 644.777,
    "text": " and here are the programs first for individuals we will be deploying a research fellowship program research fellows will be individuals who are affiliated with the institute officially in terms of being able to list that on papers and having an email address and so on to reflect the alignment with their research and contributions to active inference and our open science approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.757,
    "end": 669.448,
    "text": " we'll be providing a variety of mechanisms to enable and catalyze the innovative work and the discoveries that those fellows make and future fellow programs we would look to more materially support in different ways and also expand outside of research fellows into education fellows and so on all these incredible places we see active inference being applied",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 669.428,
    "end": 695.908,
    "text": " The partnership program will provide a structured venue and avenue for organizations that are looking for any numbers of several different things, including to make meaningful, impactful, and recognized contributions to the Active Inference open source ecosystem, for organizations that are looking to upskill and accelerate their own Active Inference learning and application,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.888,
    "end": 704.312,
    "text": " to form regional and sector level collaborations or collaborations involving a certain language or approach or discipline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.203,
    "end": 729.625,
    "text": " important input that organizations can provide to the institute about what we might do to be the best supporting organization for the ecosystem possible and also build positive reputation and context and access community and talent as we know that active inference talent can be sometimes a limiting factor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.605,
    "end": 733.952,
    "text": " And the last program here is the philanthropic avenues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.773,
    "end": 747.293,
    "text": "These will constitute small and large donations of different types to support the sustainability and frankly, the viability of the Institute's mission and vision going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.273,
    "end": 774.259,
    "text": " currently our 501c3 tax exempt status is pending so hence waiting until that is cleared to move forward but we envision a continuum from monthly and smaller opportunities for people to provide tax exempt donations all the way on through very large and custom philanthropic relationships so if on the research fellows",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 774.239,
    "end": 786.662,
    "text": " organizational partnerships or philanthropic avenues if any of those sound exciting or you think i've been waiting for this affordance then this is it so please get in touch anything you want to add on that alex",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 789.612,
    "end": 791.655,
    "text": " No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.675,
    "end": 791.775,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.795,
    "end": 810.54,
    "text": "And then just a few little summary pictures of our growing engagement in outreach and public communications platform and the slow and then all at once growth of complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 812.697,
    "end": 820.664,
    "text": " Let's go on to the Eduactive Organizational Unit and briefly cover some of our education-oriented projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 821.365,
    "end": 833.236,
    "text": "So starting with the Institute projects, and these are just screenshots from our activities page, which is where you'll land when you go to onboard.activeinference.org.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.676,
    "end": 836.459,
    "text": "This is just screenshotted and snapshotted from there today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.519,
    "end": 840.122,
    "text": "This is what is live right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.102,
    "end": 859.478,
    "text": " at the institute we have several educational projects first the active inference ontology where we are developing the rigor and applicability of the active inference ontology as a core infrastructure for the institute and ecosystem this facilitates the translation of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.458,
    "end": 867.808,
    "text": " across human languages, computer languages, and many, many other kinds of exciting applications for really what is the heart of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 868.268,
    "end": 874.195,
    "text": "And people are taking it in some very exciting cosmological and mythological directions too, I know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.396,
    "end": 885.107,
    "text": "In audio visual production, we produce a variety of informative and interesting live streams and podcasts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.249,
    "end": 888.351,
    "text": "I'll flip to that slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.225,
    "end": 908.365,
    "text": " in 2024 we've had 27 videos so far we've had sarah hamburg with the morphstream series continuing to look at biomimetic computing techniques orgstream with a focus on organizational design and applications of active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.345,
    "end": 925.678,
    "text": " math stream with a focus on some of the mathematical topics that are central or peripheral in active inference insights the absolutely wonderful series that darius has been carrying out with many guests",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.38,
    "end": 951.16,
    "text": " and guest streams which are one-off events that allow us to hear from a wide range of voices and projects in the ecosystem just from sampling ranging from marshall mcluhan and andrew mcluhan carrying on that legacy and tradition through knowledge management adrian bajon with the constructal law",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.14,
    "end": 973.401,
    "text": " empirical status of predictive coding and active inference open source ai mental gravity alexey tochinsky a participant and also a researcher in the area companies applying active inference all over the world in their robotic settings and wellness science through the lens of active inference so just hearing about all these exciting things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.174,
    "end": 981.592,
    "text": " If you have production skills or interest, please do consider joining this very fun and accessible project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.113,
    "end": 992.217,
    "text": "There are a ton of ways that people can help, ranging from curating and suggesting inviting guests, facilitating streams in English or other language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.197,
    "end": 1006.948,
    "text": " improving communications before, during, and after videos, all kinds of things that people can do, as well as work and articulate the interface between our production of audiovisual materials and the processes at the Active Inference Journal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.118,
    "end": 1026.417,
    "text": " which pick up where the live stream ends and where other media leave off and are able to integrate that into our knowledge management approaches, provide transcription, translations, captionings, all these really critical functionalities that we're developing out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.398,
    "end": 1031.603,
    "text": "And then last institute educational project is the textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.173,
    "end": 1053.658,
    "text": " so the textbook group rolls on ever since the March 2022 publication of this Parr, Pizzullo, and Friston textbook so two years ago this textbook being published and cohort five continues on with the second half of the book cohort six continues with the first half of the book",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.638,
    "end": 1074.837,
    "text": " we're having great times we have people joining one or both groups as they alternate across different time spot spots week to week we've had almost 400 registrations for this group over the six cohorts so it demonstrates the strong and continued excitement and curiosity that people have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1074.817,
    "end": 1096.015,
    "text": " and also we know there's many other reading groups and people enjoying and curious about this book so for here I'll just add that all backgrounds and levels of familiarity with active inference math statistics philosophy all of these different topics that come into play all these backgrounds are welcome and we cherish their questions and curiosity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1095.995,
    "end": 1098.86,
    "text": " The textbook group is a great place to jump in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.92,
    "end": 1108.776,
    "text": "You might find that it's a swimming pool you jump in and then immediately can quickly route onto, okay, well, here's the more advanced way to apply it computationally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.537,
    "end": 1113.483,
    "text": "Or here's a deeper corner in philosophy that that makes me curious about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.044,
    "end": 1121.496,
    "text": "Or you might find, as many of us have, that rereading these 10 chapters again and again is its own fun cycle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.235,
    "end": 1123.798,
    "text": " Those are the Institute projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1124.319,
    "end": 1138.202,
    "text": "And then facilitated by the proposal form, which is always open, we've been really excited to host a variety of other projects in the ecosystem facilitated by those outside of the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.182,
    "end": 1158.672,
    "text": " so first we have the fundamentals of active inference with sanjeev namjoshi this has been continuing on since last year and his textbook in progress is an absolutely comprehensive update to the educational materials available so we'll look forward to seeing more as that continues and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.652,
    "end": 1183.798,
    "text": " action research on collective foraging negotiation of four inches with susan hasty a really exciting week by week dynamic project that very interesting things are coming in and out of and some other projects that we would love to hear more about to be able to share but please anytime feel free to go to the onboard.activeinference.org and click around and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.778,
    "end": 1198.075,
    "text": " learn from the documentation these projects their prior works contact the facilitators see how it's listed to get involved so these are the education projects that are active at the institute right now alex anything you want to add here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.033,
    "end": 1227.201,
    "text": " just that it's great to see such a lot of different projects some of them is in different formats group working and for now in basic form for personal online learning for physics and information processing and social sciences course so we test in different format improving them and that's great",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.042,
    "end": 1236.432,
    "text": " yes thank you to everyone for their bravery and commitment to jump in and propose and to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.479,
    "end": 1249.19,
    "text": " let us know and measure, and just to be involved and to make these projects something that actually comes true and is enacted for our diverse nest mates in the ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1250.291,
    "end": 1255.536,
    "text": "All right, moving from education onto the re-inference units into the research projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.117,
    "end": 1260.0,
    "text": "Here's an analogous snapshot of the research work happening right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.721,
    "end": 1266.486,
    "text": "So we have three research oriented projects, research and development or application at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.466,
    "end": 1271.755,
    "text": " First is the rxinfer.jl learning and development group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.336,
    "end": 1274.44,
    "text": "This has been a wonderful project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.56,
    "end": 1286.28,
    "text": "We've gotten deeper and deeper into the Julia language package developed by BIAS Lab and colleagues called rxinfer.jl.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.26,
    "end": 1306.463,
    "text": " Julia language as well as some of the analytical formalisms that the package uses like factor graphs and message passing may be new for some slash all but we're having an awesome time in a large group working through the examples from coin tossing on through drone flight",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.443,
    "end": 1314.542,
    "text": " We'll have a live stream with the developers of the package next week to talk more specifically about the active inference drone setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.244,
    "end": 1322.882,
    "text": "And we really look forward to the continued upskilling of the community and the usage and the applicability of RxInfer, which is just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1323.436,
    "end": 1327.02,
    "text": " a very exciting direction for active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.04,
    "end": 1345.6,
    "text": "In knowledge engineering, we continue to explore avenues involving more on the library science side, the archiving and curation of materials, and also more into the modern language processing and analysis space into the large language models and different kinds of collaborations there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.141,
    "end": 1352.768,
    "text": "So many threads that are developing and brewing, which we hope to reveal more on soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.748,
    "end": 1368.389,
    "text": " and an active block inference, which is wrapping active inference generative models from different language of different styles in CAD-CAD, which is a systems engineering execution framework, which exists in Python, Rust, and Julia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.01,
    "end": 1380.426,
    "text": "So thinking about the systems engineering side of our work and about the articulation between the specification of composable active inference generative model components",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1380.406,
    "end": 1390.075,
    "text": " and being able to use those in an open source systems engineering framework that's as rich and full featured and first principles as CatCat is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.816,
    "end": 1392.417,
    "text": "So that's been great collaboration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.739,
    "end": 1397.943,
    "text": "And we have a number of research projects in the ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.523,
    "end": 1407.612,
    "text": "We have Symbolic Cognitive Robotics from JF Cloutier continuing his very unique work on symbolic active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.963,
    "end": 1414.818,
    "text": " Not to go into too much detail, but the high road is the same and you'll find a different low road in this project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.8,
    "end": 1427.727,
    "text": "And a variety of proposed and active research projects ranging from exploring PTSD, M-theory, humanity's story of an uncertain self,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.707,
    "end": 1448.297,
    "text": " soil biology and ant biology and beyond we look forward to hearing more updates from these research projects and sharing and highlighting their work as we hear from it anything you want to add on the research side alex nope",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1450.083,
    "end": 1466.742,
    "text": " okay well then here are some closing comments just a couple meme and fun slides that i brought together this morning meanwhile if you're watching live please feel free to write any questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.295,
    "end": 1494.973,
    "text": " whatever their epistemic or pragmatic value be in the chat and we will look at them after this but just wanted to give a few comments and thoughts and just every day there's new soup from which to draw hearty meals from but I just wanted to put down a few of these thoughts as we're seeing it right now so one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.223,
    "end": 1502.601,
    "text": " are many waves and kinds of active inference catalysts frictions and horizons for people and organizations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1503.172,
    "end": 1517.429,
    "text": " We know about the two ways that agents are able to bound their uncertainty and reduce it, which is to change the mind through inference, attention, and learning, as well as to change the world through action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.37,
    "end": 1529.483,
    "text": "And this made me think about the so-called multiple horizons model and whether we see it in terms of these stacking horizons",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.463,
    "end": 1545.193,
    "text": " based upon maintenance nurturing and novel creation or whether we see the horizons in any other number of different ways such as like what's the hill that we're on right now and then the next hill and then the next hill after that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.612,
    "end": 1554.291,
    "text": " broadly, and I look forward to refining this with people, is the first horizon that we're on is the familiarity, awareness, and skill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.772,
    "end": 1561.326,
    "text": "Right now, the rate limiting step in applying active inference to any system, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.306,
    "end": 1576.834,
    "text": " is not computational resources it's not gpu access it's people's familiarity and fluency with active inference with the ontology with the process of generative modeling with statistics all these different kinds of features that come into play",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1576.814,
    "end": 1582.042,
    "text": " The second horizon on this image on the right is the software and the methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.522,
    "end": 1599.767,
    "text": "So after getting to a basic level of familiarity, one may start to bump up rather quickly with limitations of the tools and packages, whether fundamental limitations of the packages that require basically like open source updates to progress on or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.355,
    "end": 1606.024,
    "text": " one's skill and fluency with using that software or toolkit like RxInfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.005,
    "end": 1629.619,
    "text": "And then there's a deeper, broader horizon involving hardware and beyond, ecosystems of shared intelligence, heterogeneous computing substrates, analog and quantum, wetware, all these different kinds of deeper approaches, which over a given timeline will have tremendous impacts in the active inference ecosystem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.599,
    "end": 1647.507,
    "text": " But whether we choose to focus on the first horizon, which is the accessibility and participation of active inference with the ability to make it more broadly understood and applicable, more game-ready, downloadable, press-playable than it is today...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.942,
    "end": 1670.052,
    "text": " whether we choose to focus on that second horizon of the utility provided by software packages, and then whether we look into the deeper tech beyond even that, into the unconventional computing substrates beyond Turing computation and so on, these are all places and times for bold action to support active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.386,
    "end": 1697.794,
    "text": " i think it calls for passionate holistic responsivity i think it calls for individual inquiry organizational commitments and ecological partnerships and again where there is a discrepancy where someone thinks well there should be a machine learning answer to this or there should be a communication for that or there should be a course made for this kind of person there's two ways to deal with that discrepancy either to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.774,
    "end": 1716.508,
    "text": " update one's beliefs that such a thing doesn't exist and doesn't have to and then walk away calmly or be that change and we hope that the institute can be the locus of those changes so again for individuals and organizations who are ready for that we want to continue that conversation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.615,
    "end": 1721.019,
    "text": " 2024 is a unique year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.299,
    "end": 1729.451,
    "text": "I mean, in a sense, every year is a unique year, but it's not so common that we have a full, true, tetrahedral new year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.471,
    "end": 1732.716,
    "text": "2024 is a perfect Tet year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.776,
    "end": 1737.783,
    "text": "That hasn't happened since 1771, and it won't happen again until 2300.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1737.843,
    "end": 1745.314,
    "text": "There's a few other ways to kind of work with or play with our date, which is, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.146,
    "end": 1773.04,
    "text": " the ways listed here i'll just read the last one we can think about two as the external states the external unity in multiplicity the zero as the gap the two as our blanket perception and action on the inbound and outbound and then four are internal states which themselves compose a tetrahedron",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.218,
    "end": 1781.23,
    "text": " All good, and I'm sure there's many other ways to see it, but just so fun that our year can reflect a nice shape like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.29,
    "end": 1789.604,
    "text": "And also we think more and more about these two ways that stability and stationarity can appear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.345,
    "end": 1793.931,
    "text": "And one is the construction project that's dead on the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.367,
    "end": 1815.396,
    "text": " the other is the top in motion which has a stationarity and a stability even a resiliency but you don't get a bigger dead object to flip over and spin and that's active inference a few more random fun thoughts um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.118,
    "end": 1821.806,
    "text": " Thinking about epistemic modes and tempos with a lot of people's great feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.826,
    "end": 1839.392,
    "text": "I wrote a short piece about wayfinding in the Infinite Imaginarium, juxtaposing epistemic tempos and modes, and thinking about the dynamics of the changes in the speed and type of journeys that we take in the epistemic ecosystems we're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.372,
    "end": 1852.85,
    "text": " And then just thinking about more organizationally, we had a lot of work and deadlines and timelines in the fall of 2023, leading up to a major NSF grant application, which we didn't get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.651,
    "end": 1857.837,
    "text": "And the third applied active inference application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.817,
    "end": 1873.733,
    "text": " ecosystem symposium on enacting ecosystems of shared intelligence so that was fast and a lot of other details coming into play quickly and then December taking it slow moving with the seasons and consolidating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.713,
    "end": 1882.763,
    "text": " to introduce the project, propose, and measure dual always open form system during this first quarter, which we discussed at the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.783,
    "end": 1886.407,
    "text": "And now the game is afoot again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.308,
    "end": 1889.11,
    "text": "Things thicken or quicken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.231,
    "end": 1894.996,
    "text": "There's the growth and the development of projects in our space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.897,
    "end": 1902.184,
    "text": "There are many internal and external flows that people are innovating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1902.164,
    "end": 1929.066,
    "text": " in and around every day at the institute and there's also growing at excitement and energy in the ecosystem to say nothing of capital activity so it's a very interesting time and one of the images from the paper by long way around from dean is this idea of a gap an epistemic gap and what to do about that gap it can be appreciated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.075,
    "end": 1952.404,
    "text": " and it can be crossed in multiple ways it can be jumped across that's the canal jumping quantum approach or it can be filled or a bridge can be built over it and so what are those epistemic gaps and how do we determine how do we appreciate fill bridge and jump different gaps",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.384,
    "end": 1964.079,
    "text": " And then on a different wavelength, another paper here co-written several weeks ago with Dean was about the four field fields of quantum dreams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.94,
    "end": 1972.129,
    "text": "And it was a creative and exploratory piece about visual perception and quantum active inference and all these topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.93,
    "end": 1975.893,
    "text": "And there's just a few facts that I felt were important to know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.895,
    "end": 1981.26,
    "text": "The 1923 New York Yankees, 101 years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.24,
    "end": 1982.462,
    "text": " They went 98-54.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.445,
    "end": 1993.379,
    "text": "In the playoffs, they avenged their previous losses by defeating the New York Giants in six games, four games to two, and they won their first World Series title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.399,
    "end": 1995.423,
    "text": "So, it was a big season for the team.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.504,
    "end": 2002.935,
    "text": "Babe Ruth, one of their players, had a 393 batting average and some other great statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.475,
    "end": 2003.856,
    "text": "So,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.102,
    "end": 2007.445,
    "text": " On one hand, it was absolutely historic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2007.746,
    "end": 2008.767,
    "text": "We're talking about it now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.488,
    "end": 2022.587,
    "text": "And yet, at at least two nested levels of historical success, the team scale and the slugger scale, with a sample size of well over 100,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.837,
    "end": 2049.503,
    "text": " games or at bats the success rates were in the 35 to 65 range babe ruth only was hitting less than four out of ten times going down six out of ten times and the team was only winning 65 of the games and i think about ants moving pebbles and about moving many 51 correctly gets a nest",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.057,
    "end": 2061.633,
    "text": " And yet, apparently, to this baseballhistorycomesalive.com reference, what makes this Ruth's best season ever was his outstanding performance in the field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.174,
    "end": 2064.236,
    "text": "He was the American League's best right fielder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2064.997,
    "end": 2068.302,
    "text": "So, despite the numbers that we can record,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2068.282,
    "end": 2088.45,
    "text": " what made it the best was actually something that was unrecorded so there's so many fun little twists and turns in that about what is recorded what is unrecorded what are the success rates and how do we just get up every day and try again and keep it going across multiple scales",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.43,
    "end": 2111.738,
    "text": " so that we can appreciate phil bridge and jump or not appropriately and last meme slide this is a dual railroad track vision in davis nearby me and i rewrote some famous lines of poetry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2112.443,
    "end": 2114.687,
    "text": " I expect and prefer to tell this with a sigh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.448,
    "end": 2116.971,
    "text": "Somewhere spaces and times hence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2117.892,
    "end": 2119.916,
    "text": "Two roads diverged in a could.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.478,
    "end": 2127.408,
    "text": "And we took the one less traveled by and that enacted all the difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2127.428,
    "end": 2137.185,
    "text": "Here's us in the moment of decisioning and we have the outside dark not to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.604,
    "end": 2155.528,
    "text": " and then looking forward we have more and more affordances for what we can do and who we can be and this dovetails well with a recent paper that the final version came out today actually with Mao and colleagues",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.508,
    "end": 2172.505,
    "text": " about shared protentions which are prospections anticipations in multi-agent active inference systems which with the help of toby and others has now been explored in this category theoretic way so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.915,
    "end": 2201.327,
    "text": " didn't want to have nothing here and any something i know is partial limited and incomplete and all these different features but i want to share some of those ideas and memes and thoughts in appreciation of all the amazing contributions that people have made in this kind of unique fractal nature of our topic which is the divergence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.307,
    "end": 2206.643,
    "text": " in what could be and different ways that things could be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2206.808,
    "end": 2232.428,
    "text": " and what we do right there at the fork in the road how do we take that fork how do we stay with the trouble all these different things that arise or are in the nexus of sense making and decision making so what a rich and exciting area what a great time to be able to collaborate and communicate with all so many of you and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.408,
    "end": 2256.812,
    "text": " we look forward to many more fun times ahead so hope these last slides made the right sense to you they were just thrown together they aren't my finest or only statements as such but i did want to add them in here and so we come to our last slide",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.792,
    "end": 2276.337,
    "text": " where since years ago we've looked at and asked what would an understanding enable what are the predictions and implications what are the next steps for us and for the free energy principle and for active inference what are our preferences and what are you still curious about so we will just uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.51,
    "end": 2297.97,
    "text": " hear any last thoughts from alex then i'll look in the chat if there's any questions and then in a few minutes as soon as this ends we will just begin our weekly open office hours slash discussion in the discord",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.047,
    "end": 2302.896,
    "text": " You can find the join link in the video description or elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.916,
    "end": 2312.116,
    "text": "Otherwise, we'll just chill for a few more minutes, hear any questions that people have, and then just jump over to having an open hour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.517,
    "end": 2314.862,
    "text": "Alex, what are your kind of thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.757,
    "end": 2326.912,
    "text": " Thanks for that last slide, very exciting, and thank you for sharing your ideas this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.593,
    "end": 2342.74,
    "text": "And I believe these roundtables are aimed to show some information about the Institute in this way for people, for new people, for people who know us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.795,
    "end": 2349.405,
    "text": " possibly have another look on everything of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.226,
    "end": 2364.897,
    "text": "And even if you don't understand for now how to join, how to participate, but have general interest to science, to first principles, to active inference, just give us a sign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.231,
    "end": 2381.822,
    "text": " send an email or message in discord and we'll find a way how to support you in that explorations and possible future applications thank you thank you yeah it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.692,
    "end": 2392.444,
    "text": " Again, there's so many things to say and not say, but it's always amazing how people reach out and what active inference means to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.464,
    "end": 2397.791,
    "text": "So if you're hearing this, it's for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.012,
    "end": 2400.074,
    "text": "If you're curious, doubly so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.156,
    "end": 2407.364,
    "text": "And this year, a lot is going to develop and change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.506,
    "end": 2412.231,
    "text": "The Institute will be structurally different from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.628,
    "end": 2435.805,
    "text": " with the increased numbers of affiliated individuals with the development of a real partnership group kind of like a league or a federation of organizations that want to support active inference ecosystem the education all the way on through professional applications",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.785,
    "end": 2461.455,
    "text": " and just providing some of the avenues that are more recognizable as opposed to the ones that are still not quite yet on the radar but the chorus grows every day of those who call for it to be that way so we need everyone to help co-create that and be a part of that hence these communications",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.583,
    "end": 2483.545,
    "text": " okay I'll look to the live chat but write any questions if there's anything that we can resolve here otherwise this is a great lengthened material for our update here thank you hello blue neutrino memes of destruction upcycle Club Susan",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2487.305,
    "end": 2512.013,
    "text": " okay fun fun discussions great comments there but i don't see any specific questions all right um let's continue the discussion anybody who wants to over in our discord right now if you're watching this anytime blanket active inference dot institute and see you later thank you thanks alex thanks everyone thank you",
    "speaker": "SPEAKER_01"
  }
]