[
  {
    "start": 7.329,
    "end": 8.27,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8.57,
    "end": 11.071,
    "text": "Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 11.311,
    "end": 15.814,
    "text": "This is the first Active Inference Model Stream, Active Inference Model Stream 1.0.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 17.335,
    "end": 19.797,
    "text": "And I'm really excited for today's conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 20.097,
    "end": 21.277,
    "text": "I'm Daniel Friedman.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 21.458,
    "end": 26.24,
    "text": "And just to introduce the other participants today, Ryan, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 27.801,
    "end": 27.941,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 28.142,
    "end": 29.622,
    "text": "Hi, I'm Ryan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 30.303,
    "end": 32.124,
    "text": "I'm from the Laurier Institute of Brain Research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 34.574,
    "end": 35.875,
    "text": " Hi, I'm Christopher.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 36.115,
    "end": 41.018,
    "text": "I'm a PhD student at the MRC Cognition Brain Sciences Unit, which is based at the University of Cambridge.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 43.119,
    "end": 44.32,
    "text": "Hi, I'm Max Murphy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 44.92,
    "end": 52.465,
    "text": "I just completed my PhD at University of Kansas in bioengineering with a focus on neural engineering.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 53.467,
    "end": 79.691,
    "text": " awesome thank you everyone for participating and for ryan and christopher two of the authors of this awesome work we're going to be exploring so this is the first in a several part series that is going to be highlighting several perspectives and addressing questions related to the active inference tutorial paper of smith et al called a step-by-step tutorial on active inference and its applications to empirical data",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 80.211,
    "end": 104.783,
    "text": " so the idea here is for those who are working with empirical data to learn about active inference as a method and also for those in the active inference community to be learning about some of the methods that apply active inference if you're listening you're participating and if you have any questions during the live stream feel free to post it in the youtube live chat and we'll try to address it during or after this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 105.703,
    "end": 129.564,
    "text": " presentation that we're about to get if you have questions after the live stream please feel free to leave it in a comment form and we'll try to address it and integrate your input in future sessions and to learn more and to participate check out active inference.org or any of the information in the video's description so that's all the information uh or metadata for this video",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 130.445,
    "end": 151.567,
    "text": " way this is going to work today is we're going to do some introductory questions uh just sort of like asking what in general is this work about what motivated the authors to write the paper the way that they did and then both ryan and christopher are going to share their screens for part of the presentation and they're going to show us a few different things about the work that they've done",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.188,
    "end": 155.189,
    "text": " And then we have a couple of questions prepared on our side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 155.669,
    "end": 159.209,
    "text": "But also, we're going to be looking at a live chat if anyone has questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 159.269,
    "end": 164.17,
    "text": "So just post it whenever you feel like it in the live chat, and then we'll, again, try to address it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 164.631,
    "end": 168.711,
    "text": "So as I stated, the intro questions, and then we'll go to the presentations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 169.292,
    "end": 174.193,
    "text": "So first intro question to the authors is, what is this work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 174.673,
    "end": 175.913,
    "text": "What is exciting about it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 176.073,
    "end": 178.233,
    "text": "What motivated you to work on it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 178.253,
    "end": 180.714,
    "text": "OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 181.92,
    "end": 185.142,
    "text": " So just to kind of reintroduce myself a little bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.242,
    "end": 187.324,
    "text": "So I'm Ryan Smith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 187.424,
    "end": 192.407,
    "text": "So I'm an investigator at the Laureate Institute for Brain Research in Tulsa, Oklahoma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 193.188,
    "end": 207.257,
    "text": "And the focus of our institute is primarily on neuroimaging and sort of neuroscience approaches to understanding psychology and psychiatry with a focus on sort of treating psychiatric disorders.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 208.698,
    "end": 209.899,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 210.598,
    "end": 224.684,
    "text": " for a while now, there has been the use of simpler computational models, primarily reinforcement learning models or drift diffusion models, things like that out there for researchers who are working with empirical data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 227.025,
    "end": 233.528,
    "text": "So there are good resources out there for people to learn those methods, to apply them to data in their own research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 234.549,
    "end": 239.051,
    "text": "However, at the moment, so active inference is a sort of much newer field, especially",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.773,
    "end": 244.376,
    "text": " sort of formulation in terms of partially observable Markov decision processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 245.197,
    "end": 264.912,
    "text": "And there isn't really to date a really clear sort of combined place to learn the sort of practical methods to build these sorts of models and to then sort of apply them to task behavior in empirical studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.173,
    "end": 269.155,
    "text": "So the kind of motivation for this paper, this tutorial,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 269.813,
    "end": 288.941,
    "text": " was to allow somebody, so new students or somebody who's sort of like an early junior faculty, things like that, who wants to go in this direction, to give them the resources they need to do that as easily and as thoroughly as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 289.041,
    "end": 299.265,
    "text": "So even if you start out not really having any background in this stuff, the hope was that the first section of the paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 299.955,
    "end": 323.186,
    "text": " would allow you to kind of get enough of a background in theory such that you would understand how to then learn how to build these models specifically for empirical tasks and eventually to learn how to fit those models to data so that they could be used in your own sort of research, you know, even, you know, for across many different fields.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.986,
    "end": 327.828,
    "text": "So I would say what's exciting or motivating is primarily just that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 328.635,
    "end": 341.228,
    "text": " if you're a new researcher and you're interested in this, but you don't know how to do it, the hope is it's gonna be like a one-stop shop where if you can get beginning to end, then you'll know how to do what you need to do to start using it in your own research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 341.668,
    "end": 344.311,
    "text": "So that's the major driving motivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 345.603,
    "end": 345.943,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 346.163,
    "end": 352.966,
    "text": "I love that one stop shop for a researcher who wants to apply the methods but doesn't really know where to start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 353.026,
    "end": 354.367,
    "text": "So that's really a great idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 355.007,
    "end": 359.709,
    "text": "And you have versioned the document many times to really address people's input.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 359.729,
    "end": 361.89,
    "text": "So it's cool how it's an evolving document as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 362.17,
    "end": 365.832,
    "text": "So Christopher, what would you say in response to those intro questions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.113,
    "end": 369.874,
    "text": "Um, so I think",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 371.004,
    "end": 372.745,
    "text": " there are two parts of my motivation for writing this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 372.805,
    "end": 379.188,
    "text": "The first was a selfish motivation in that I think if you want to understand something, the best way to do it is actually to write a tutorial on it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 380.849,
    "end": 394.535,
    "text": "And so in, when Ryan asked me to do this tutorial with him, I was jumped at the opportunity just because it would be an opportunity to kind of actually learn this stuff better myself and really get into some of the more technical details.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 396.036,
    "end": 400.418,
    "text": "And so then more broadly speaking though, I think there are lots, if,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 400.931,
    "end": 407.633,
    "text": " In principle, there's nothing kind of, applying these models in practice is no more complicated than doing like model-based reinforcement learning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 408.293,
    "end": 414.415,
    "text": "And yet it's incredibly more common to see researchers working with various more sophisticated RL schemes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 415.235,
    "end": 423.177,
    "text": "And I think if you are a graduate student, maybe starting in psychology or neuroscience, you're like, hey, I'm interested in whatever it is, decision-making under uncertainty.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 424.097,
    "end": 427.118,
    "text": "And I mean, we have a finite time on this earth, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 427.138,
    "end": 430.059,
    "text": "And a fine amount of time to actually dedicate into learning things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 430.649,
    "end": 435.91,
    "text": " And so I think it would be perfectly rational if you had someone to look at active inference research, like, wow, this is super technical.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 436.55,
    "end": 445.352,
    "text": "I wish I could learn it, but here's this other thing where I can go on Neuromatch, I can read Sutton and Bartow and really totally get up to scratch and use it in my research fairly easily.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 445.372,
    "end": 451.513,
    "text": "And there just wasn't something really accessible to help people actually apply it in their own research.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 452.254,
    "end": 453.374,
    "text": "So that was kind of my, yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 454.894,
    "end": 458.435,
    "text": "Yeah, I mean, I should say, just as a little background, you know, when I wanted to learn this stuff,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 459.071,
    "end": 462.994,
    "text": " originally at the end of my postdoc before I took my current faculty position.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.014,
    "end": 471.82,
    "text": "I, the only way to do it, the only way that I could learn it was actually to go, you know, hang out at the Phil in London with Carl for about four months.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.121,
    "end": 476.883,
    "text": "And, you know, just ask people a ton of questions and sit there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 477.043,
    "end": 486.89,
    "text": "And that was the only way, you know, so without having to, you know, physically go to one location in the world that was very far away from, you know, my current institution,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.54,
    "end": 490.062,
    "text": " And without doing that, there really was no way for me to do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 490.142,
    "end": 500.569,
    "text": "So, I mean, this is sort of out of empathy for my past self that, you know, this is the sort of thing I wish I would have had available to me so I could learn this stuff independently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.75,
    "end": 501.99,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 502.25,
    "end": 513.138,
    "text": "So, Max, what is your background or what got you really excited to work through the paper and develop a lot of the examples out on your own computer and everything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 513.198,
    "end": 515.9,
    "text": "So what got you excited or where are you coming from today?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 517.017,
    "end": 517.217,
    "text": " Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 518.118,
    "end": 518.538,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 518.558,
    "end": 522.461,
    "text": "So maybe I'm kind of your target demographic in some sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 523.142,
    "end": 527.726,
    "text": "I don't know that I could really be considered a junior investigator, although I hope I could someday be that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 528.907,
    "end": 535.872,
    "text": "And I'm interested in I'm much more on the motor motor system side of neuroscience as opposed to the decision making.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 535.912,
    "end": 536.173,
    "text": "So this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 536.793,
    "end": 545.457,
    "text": " Just the whole lexicon, it's a little different, but I am seeing so many commonalities when I'm coming from a signal processing background.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 545.597,
    "end": 551.319,
    "text": "I think of things in terms of Kalman formulation and trying to integrate sensory and motor information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 551.359,
    "end": 552.78,
    "text": "I see a lot of similarities there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 552.86,
    "end": 564.044,
    "text": "And so for somebody like myself, then looking at some of Friston's work and seeing how he's described the anatomy of inference and could this apply also in motor systems?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 565.525,
    "end": 570.327,
    "text": " I'm very interested to see how this might apply in my own future research and work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 571.868,
    "end": 572.108,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 572.528,
    "end": 582.633,
    "text": "So let's just say that you were speaking, Ryan, first, and then Christopher, to that early investigator, researcher of any age, who's like, okay, I get it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.374,
    "end": 588.136,
    "text": "In reinforcement learning, it's about reward, or reward-centric learning is about reward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 588.616,
    "end": 590.077,
    "text": "What is active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 590.737,
    "end": 601.324,
    "text": " how is it taking a different perspective on what it is that organisms are doing than that kind of classical account of reward-based learning, for example, or whatever you'd like to contrast it with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 601.724,
    "end": 614.672,
    "text": "But what is the bridge from the kind of assumptions and implications that lead somebody to work on that classical framing versus what is the difference in thinking that is active inference and how is that manifested in the model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 616.443,
    "end": 641.97,
    "text": " So I think this is actually a really important thing to bring up right from the start is that, so there's a, there's a kind of big distinction between, um, when people talk about the free energy principle broadly or the philosophy of the free energy principle, there's a very kind of, uh, you know, somewhat wide chasm between that and what gets called active inference nowadays where active inference is a corollary of the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.57,
    "end": 643.19,
    "text": "But, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.225,
    "end": 652.43,
    "text": " active inference as formulated in terms of partially observable Markov decision processes is quite a bit narrower, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 652.51,
    "end": 660.074,
    "text": "It's a very specific sort of discrete state space generative model that has particular sorts of elements to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.615,
    "end": 669.22,
    "text": "And it doesn't actually require knowing a lot of the things that people talk about with respect to the free energy principle more broadly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 670.48,
    "end": 671.281,
    "text": "It appeals to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 672.185,
    "end": 676.167,
    "text": " um, free energy and expected free energy as functions, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.247,
    "end": 680.708,
    "text": "As more or less cost functions for figuring out what the best choice to make is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.869,
    "end": 692.993,
    "text": "Um, and it, but, but at the end of the day, I mean, when you apply these sorts of models to behavioral tasks that get used in studies, um, it's actually, there's quite a bit of similarity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 693.073,
    "end": 697.775,
    "text": "I mean, you can really see active inference models, um, or at least the MVP formulation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 698.584,
    "end": 705.826,
    "text": " as just a particular, it's kind of like what Chris said, as just a particular kind of flavor almost of model-based reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 706.927,
    "end": 726.933,
    "text": "You know, so instead of, I mean, there's some sort of technical differences, right, where the way that sort of Carl and them have set it up, what you're doing is kind of like, it allows for kind of a fully unified Bayesian way of doing reinforcement learning and decision-making processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 727.763,
    "end": 738.965,
    "text": " And you do that by instead of calling something a reward per se, you define this probability distribution over observations that gets called a preference distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.206,
    "end": 746.927,
    "text": "And so reward then becomes a kind of probabilistic preference to observe some things over others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 748.187,
    "end": 755.709,
    "text": "You know, so if you call a particular observation a reward, then calling it a reward just amounts to having a precise",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 757.886,
    "end": 764.888,
    "text": " preference distribution that has a precise high value over whatever that rewarding outcome is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.048,
    "end": 774.23,
    "text": "And then the agent is simply driven to make decisions that it thinks is most likely to get it to observe the thing it prefers, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 774.27,
    "end": 779.311,
    "text": "So this preference distribution is more or less a way of specifying what is rewarding to the agent, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.411,
    "end": 780.711,
    "text": "What the agent is seeking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 782.151,
    "end": 785.952,
    "text": "One thing that is kind of nice about active inference that's a little different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 786.533,
    "end": 790.876,
    "text": " from reinforcement learning per se, or there's a few things I should say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 791.156,
    "end": 804.847,
    "text": "One is that making decisions based on trying to minimize expected free energy, which Chris will cover, doesn't just try to maximize reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 805.507,
    "end": 808.709,
    "text": "It also simultaneously tries to maximize information gain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.531,
    "end": 812.112,
    "text": "So what will happen is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 812.871,
    "end": 821.877,
    "text": " Uh, you know, say, say an agent starts out in a dark room, you know, just to take a very kind of contentious, you know, philosophy of the FEP sort of example, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 822.437,
    "end": 828.641,
    "text": "Say an agent starts out in a dark room, um, which means that it doesn't know where anything is, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.681,
    "end": 831.783,
    "text": "So that means it has a lot of uncertainty over what state it's in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.343,
    "end": 837.286,
    "text": "Um, and let's say simultaneously in another room, there's a fridge with some food in it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.267,
    "end": 838.347,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 839.096,
    "end": 841.957,
    "text": " then there will be two different sorts of drives there, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.977,
    "end": 847.939,
    "text": "There'll be this epistemic drive to do whatever it thinks is going to give it the most information gain, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.579,
    "end": 850.439,
    "text": "Which will be go turn on the light, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 850.479,
    "end": 853.1,
    "text": "So then it'll know what state it's in, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 853.2,
    "end": 855.321,
    "text": "Whether it's in room A or room B, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 855.381,
    "end": 859.942,
    "text": "Or whether there's a couch in the room or whether there's a TV in the room or whatever, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 861.043,
    "end": 863.423,
    "text": "And that's not reward per se.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.723,
    "end": 868.945,
    "text": "That's just trying to choose the action that's going to maximize the amount of information you get",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 869.643,
    "end": 875.967,
    "text": " Um, the other, the other chunk of it though, is to maximize observing preferred outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 876.608,
    "end": 883.032,
    "text": "And so the agent will also be driven to just leave the room to go to the fridge, you know, to observe itself eating food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.652,
    "end": 895.32,
    "text": "Um, you know, so in practice, what will happen that typically won't happen, at least in a standard reinforcement learning setting is that the agent won't just try to maximize reward directly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 895.34,
    "end": 898.182,
    "text": "A lot of times it will first choose the action that will",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 898.629,
    "end": 903.89,
    "text": " help it figure out where it is so that it's more confident what to do to get the reward later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 906.331,
    "end": 922.556,
    "text": "So it's really not, again, in practice, these models are just a nice, fully Bayesian way to integrate perception, learning, and decision-making where decision-making is driven to both maximize information gain and maximize reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 924.376,
    "end": 925.516,
    "text": "Christopher, thanks a lot.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 925.716,
    "end": 927.217,
    "text": "Anything else to add there?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 928.899,
    "end": 929.839,
    "text": " No, not particularly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 930.319,
    "end": 937.721,
    "text": "I think the only thing I would say, and I'm going to say this in a little bit because I've got another slide, is if you're interested in the technical details of what Ryan just said, there are two really good papers.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 938.681,
    "end": 940.962,
    "text": "Maybe we can make these slides available afterwards as well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 941.722,
    "end": 945.803,
    "text": "One's by Norsajid, and I'm not sure if, I'm sorry if I butchered your name there.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 946.603,
    "end": 954.285,
    "text": "The other one's Lancelot da Costa, and they have two excellent papers comparing it to reinforcement learning formulations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 955.566,
    "end": 955.926,
    "text": " Excellent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 956.547,
    "end": 959.489,
    "text": "Just to draw out a couple points, Ryan, from what you said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 959.549,
    "end": 976.704,
    "text": "So one is that the active inference framework and specifically the POMDP, the partially observable Markov decision process, instantiation of active inference is a corollary or like a derivative of the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 977.365,
    "end": 980.848,
    "text": "And there's a lot of philosophy and contentiousness around different aspects of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 980.868,
    "end": 982.129,
    "text": "We're going to read a paper in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 982.689,
    "end": 1008.691,
    "text": " active inference stream 14 by mel andrews about the math is not the territory about the philosophy and the status so yes if you want to go that way there's a whole rabbit hole there but this is kind of like a tool like a linear regression you don't get caught up in the weeds on number theory or on the information space that it's about where the calculation is useful and tractable it's going to be a tool so that's kind of where we're coming at at least today and in this series",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1009.352,
    "end": 1018.758,
    "text": " Another interesting thing, and in contrast with reinforcement learning, which is kind of like reinforce what works and don't reinforce what doesn't work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1018.798,
    "end": 1022.36,
    "text": "That neurons that fire together, wire together are positive reinforcement schemes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1023.661,
    "end": 1026.103,
    "text": "There is a reward preference built into that kind of model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1026.943,
    "end": 1031.828,
    "text": " But when there's a basin of low reward, it's often difficult for those models to latch on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1032.069,
    "end": 1044.041,
    "text": "So we saw that in the paper of Alec Shantz et al in Active Inference Stream 8, Scaling Active Inference, that kind of showed how even up against these very, very large scale machine learning models like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1044.983,
    "end": 1046.945,
    "text": " Q reinforcement learning and things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1047.486,
    "end": 1060.482,
    "text": "Other state-of-the-art deep learning models that the active inference trolley car and control theory robots were able to work really well because first they did what you just described, Ryan, which was they kind of went into an explore mode",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1061.082,
    "end": 1063.484,
    "text": " before going into a more fine-tuning mode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1063.884,
    "end": 1067.547,
    "text": "And so in doing so, they transcended the explore-exploit simple trade-off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1067.607,
    "end": 1069.588,
    "text": "It's not just a knob in this model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1069.928,
    "end": 1072.43,
    "text": "It's not a coefficient to balance explore versus exploit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1072.89,
    "end": 1081.156,
    "text": "I hope we'll draw out an understanding that they're actually related in a different way because there's something that's model-based and generative that's happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1081.676,
    "end": 1108.961,
    "text": " and so really a ton of interesting stuff so at this point i would think we could go into the presentations if people have any questions that arise put them in the youtube chat and i'll be copying those out for addressing them later and um other than that let's just work through the presentations however ryan and christopher have set up and preferred cool okay go ahead and just share your screen chris you can just go ahead yeah just kidding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1111.135,
    "end": 1113.636,
    "text": " Okay, so I'm using a dual monitor setup.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1113.656,
    "end": 1114.416,
    "text": "We'll see how this goes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1115.237,
    "end": 1122.539,
    "text": "Okay, sorry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1123.44,
    "end": 1128.522,
    "text": "I now have to open system preferences, sorry, to allow Microsoft Teams to use it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1128.642,
    "end": 1129.142,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1131.042,
    "end": 1136.745,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1139.025,
    "end": 1140.266,
    "text": "Should be with you momentarily.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1143.655,
    "end": 1143.895,
    "text": " Cool."
  },
  {
    "start": 1147.777,
    "end": 1148.738,
    "text": "Good to digest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1150.279,
    "end": 1154.961,
    "text": "It's really, it's interesting stuff and we're all learning by doing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1155.361,
    "end": 1164.727,
    "text": "So I just really appreciate and have just seen a lot of appreciation for this kind of work because in some ways it's like the missing piece between a lot of these",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1165.427,
    "end": 1191.448,
    "text": " hypothetical or abstract or scaffold models or what people have heard about with respect to what active inference is and then how it's deployed how it's enacted so to take the inactivist insight seriously as practitioners of science and as communicators as well it means making this kind of work and showing us how you do it as we all are trying to like figure out every level from literally the tech to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1192.489,
    "end": 1197.57,
    "text": " the best way to make it rigorous and accessible, the best ways to talk about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1197.93,
    "end": 1199.191,
    "text": "So, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1199.251,
    "end": 1200.231,
    "text": "What do you think about that, Ryan?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1200.251,
    "end": 1203.372,
    "text": "Yeah, I mean, I totally agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1203.432,
    "end": 1203.772,
    "text": "Hold on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1203.892,
    "end": 1204.492,
    "text": "So, Chris?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.072,
    "end": 1208.233,
    "text": "Yeah, actually, I've never used this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1208.253,
    "end": 1210.813,
    "text": "So there should be a little thing in the upright corner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.053,
    "end": 1214.174,
    "text": "It's like an arrow pointing into like a square.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1216.715,
    "end": 1217.355,
    "text": "Share content.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1221.493,
    "end": 1222.653,
    "text": " Are you guys both on PCs?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1224.274,
    "end": 1224.674,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.195,
    "end": 1226.115,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1227.576,
    "end": 1231.457,
    "text": "So, yeah, so it should be upright corner, like, right next to the leave button.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1233.898,
    "end": 1234.438,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1236.559,
    "end": 1239.941,
    "text": "Or, Ryan, you could present first, or... Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1240.521,
    "end": 1242.682,
    "text": "I actually have a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1242.982,
    "end": 1243.682,
    "text": "I have a question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1243.702,
    "end": 1245.663,
    "text": "It won't really work for me to present first, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1245.683,
    "end": 1245.963,
    "text": "Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.383,
    "end": 1247.704,
    "text": "You know, what I'm going to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1248.123,
    "end": 1249.884,
    "text": " Not going to be so comprehensible before Chris.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1250.065,
    "end": 1250.305,
    "text": "Got it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1250.485,
    "end": 1252.486,
    "text": "I actually have a question that will take a couple of minutes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1253.087,
    "end": 1257.951,
    "text": "Christopher, while you're figuring it out, is what tools would somebody need to follow along?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1258.171,
    "end": 1262.915,
    "text": "So what programming language or what interface do they need?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1263.495,
    "end": 1265.697,
    "text": "What background knowledge do they need?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1266.377,
    "end": 1267.818,
    "text": "Is there a software to download?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1267.858,
    "end": 1268.619,
    "text": "Is there a course?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1269.239,
    "end": 1273.483,
    "text": "What are the prerequisites for doing what we're about to basically jump into?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1275.157,
    "end": 1281.599,
    "text": " Um, yeah, so, I mean, I'll just say that, that, you know, a lot of this stuff was originally designed by Carl Friston.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1282.439,
    "end": 1298.503,
    "text": "Um, and if you know a lot about Carl, um, you know, before he proposed a lot of this active inference stuff, you know, he was, uh, sort of most, uh, you know, famous or his, his biggest contribution was putting together, uh, SP, SPM within MATLAB.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.103,
    "end": 1304.464,
    "text": "SPM is, um, like, uh, it's called statistical parametric mapping software, but it was,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1305.137,
    "end": 1308.98,
    "text": " more or less the original way of doing fMRI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1309.24,
    "end": 1312.302,
    "text": "So like analyzing functional and like neuroimaging data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1313.583,
    "end": 1320.427,
    "text": "And so a lot of the scripts and dynamic causal modeling, I should say, which is a particular sort of approach to doing neuroimaging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1321.248,
    "end": 1334.477,
    "text": "And so a lot of basically all the standard resources, all the standard coding routines, everything for actually building active inference models right now is primarily in SPM, which runs within MATLAB.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1335.294,
    "end": 1363.184,
    "text": " um so and all the kind of supplementary uh tutorial code that we've provided we've provided i think six six or seven different um different supplementary scripts um where you can actually run the simulations and build these models yourself um they are they are all they're all in matlab um so if you so if you have matlab then you need to have downloaded spm um and with matlab and spm you um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1363.925,
    "end": 1371.39,
    "text": " you will have everything you need to do to open our supplementary code and to follow along.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.43,
    "end": 1378.675,
    "text": "So a lot of the tutorial is actually set up so it assumes that you're kind of have the paper open side by side with the code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1379.256,
    "end": 1386.04,
    "text": "So you can actually click on, you know, different options to simulate and reproduce all the figures in the tutorial paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1387.641,
    "end": 1391.304,
    "text": "So it's, yeah, so the short answer is you need MATLAB and you need SPM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.819,
    "end": 1401.141,
    "text": " And you need to have some minimal ability to work with MATLAB.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1401.181,
    "end": 1414.185,
    "text": "Just to piggyback onto that, for anybody's benefit watching this in the future, whenever you're watching this, once you get the SPM folder, you'll unzip that, you'll get that folder, you'll put that somewhere on your computer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1414.525,
    "end": 1416.586,
    "text": "You'll want to make sure that you add path",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1417.372,
    "end": 1443.159,
    "text": " from your MATLAB workspace, when you're in the supplementary code provided by Ryan and Christopher, when you're in that workspace, add path of that folder, wherever you've put it, add path of that folder slash toolbox slash D E M. And then you should have access to the additional SPM 12 scripts that you need in order to make use of the functions they've provided.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1444.739,
    "end": 1445.86,
    "text": "Yeah, no, thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1445.96,
    "end": 1446.82,
    "text": "I mean, that's that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1447.543,
    "end": 1452.026,
    "text": " for someone who's never used MATLAB, yes, there's a few steps like that, which are super important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1452.046,
    "end": 1462.253,
    "text": "Yeah, because basically all these scripts are actually within the DEM toolbox of SPM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1462.954,
    "end": 1472.06,
    "text": "And all the scripts they've provided call on sub-functions that are within SPM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.641,
    "end": 1476.023,
    "text": "So yeah, it won't, unfortunately,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.931,
    "end": 1479.592,
    "text": " none of them will work without SPM at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1480.273,
    "end": 1487.455,
    "text": "Although there are certainly efforts to try to make some of these routines more sort of generally accessible and like free software.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1488.356,
    "end": 1505.923,
    "text": "Like Alex Chance, for example, is in the process of, I think, writing like a Python version of the main active inference MDP script, which is called SPM underscore MDP underscore VB underscore X.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.841,
    "end": 1517.184,
    "text": " And that just corresponds, that just MDP underscore VB underscore X corresponds to Markov decision process underscore variational base underscore X, which stands for factorized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1518.264,
    "end": 1524.826,
    "text": "And I'll go over what factorization is and how you actually code that in once we get to my section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1527.392,
    "end": 1528.954,
    "text": " Okay, I'm going to ask a follow up there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1529.214,
    "end": 1538.102,
    "text": "So I have my desktop computer, I have MATLAB, and it's all working with referencing SPM, most updated version.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.803,
    "end": 1545.409,
    "text": "And I've run through the examples that we're going to be working through maybe today or the ones that are in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1545.429,
    "end": 1547.631,
    "text": "So I kind of hit enter and I got things to work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1547.751,
    "end": 1550.773,
    "text": "Everything's all the scripts are working fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.128,
    "end": 1555.229,
    "text": " what information from my system do I need to know?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1555.53,
    "end": 1560.252,
    "text": "Like what measurements are gonna be relevant for me to bring to the table?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.872,
    "end": 1570.816,
    "text": "If I'm gonna do a t-test for whether two ant colonies are a different size, I know what kind of machinery I'm gonna need, two columns in the Excel spreadsheet or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1571.136,
    "end": 1581.481,
    "text": "But what kind of data or what attributes of the system are important to bring to the table for an investigator to utilize the examples that you're providing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1583.591,
    "end": 1584.091,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1584.111,
    "end": 1586.372,
    "text": "There's a couple of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1589.914,
    "end": 1599.958,
    "text": "The first goal is you take a particular behavioral task and you have to figure out what the regenerative model is for that task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.279,
    "end": 1603.08,
    "text": "This is the thing that I'll give an example of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.32,
    "end": 1605.081,
    "text": "I can actually show you multiple examples of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1606.901,
    "end": 1612.744,
    "text": "Once you have this regenerative model set up, then you can run simulations and those simulations will generate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1613.433,
    "end": 1620.638,
    "text": " observations and they'll generate expected actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1620.918,
    "end": 1635.427,
    "text": "So what you need then is you need data from an actual participant performing that task where you'll know on each trial what the person observed, right, what the task stimuli were, and you'll know what action they actually chose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.368,
    "end": 1641.091,
    "text": "And so then what you'll do ultimately is you'll",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1641.913,
    "end": 1648.258,
    "text": " do what's called parameter estimation, which is, and again, this will be a lot more comprehensible once I actually show you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1648.458,
    "end": 1659.246,
    "text": "But basically what you try to do is you try to find the set of parameter values in the model that generates behavior that's most similar to what the participant actually did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.248,
    "end": 1670.935,
    "text": "And so once you find the parameters, say one has a value of two and the other has a value of four, and that generates behavior that's identical to whatever a given participant did,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1671.681,
    "end": 1676.563,
    "text": " then those values of two and four, you can use those as individual difference estimates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1677.603,
    "end": 1689.747,
    "text": "So if you have those values for a bunch of different people who behaved in different ways on the task, then you could say, hey, is there something different about the people that have a parameter value of four versus a parameter value of eight?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.128,
    "end": 1698.931,
    "text": "Can I use that to predict, for example, how well somebody is going to respond to a particular treatment, say, in computational psychiatry?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.641,
    "end": 1704.562,
    "text": " Um, I Chris twice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.023,
    "end": 1714.224,
    "text": "Um, but so, but so, but so that's, that's kind of the idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.244,
    "end": 1718.306,
    "text": "Um, you know, and I mean, I can't, I can't share my screen in the meantime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.326,
    "end": 1720.686,
    "text": "Um, I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.766,
    "end": 1723.447,
    "text": "Well, here I can, I can perhaps go through some of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1724.007,
    "end": 1726.348,
    "text": "Um, so I'll just share my screen until I'm good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1726.568,
    "end": 1726.868,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1726.888,
    "end": 1727.168,
    "text": "Sorry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1727.488,
    "end": 1729.729,
    "text": "That was, this whole thing was, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1731.44,
    "end": 1732.441,
    "text": " Oh, you're good.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1732.521,
    "end": 1733.862,
    "text": "OK, I think I am at least.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1734.022,
    "end": 1734.963,
    "text": "Can you guys see my screen?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1736.164,
    "end": 1736.745,
    "text": "Yes, perfect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1737.966,
    "end": 1739.006,
    "text": "OK, great.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1739.027,
    "end": 1739.447,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1739.467,
    "end": 1745.212,
    "text": "There was some whole bunch of privacy issues that I had to pull the passwords there anyway.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1745.572,
    "end": 1748.655,
    "text": "OK, we are here, sorry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1756.842,
    "end": 1759.544,
    "text": "OK, so you guys saying my present of you or are you saying the full thing?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1761.201,
    "end": 1762.782,
    "text": " We see the full slide.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1762.882,
    "end": 1763.663,
    "text": "Yeah, just the slides.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1764.663,
    "end": 1764.884,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1765.324,
    "end": 1766.705,
    "text": "So this is just part one.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1767.446,
    "end": 1772.69,
    "text": "After I've gone through this, Ryan's going to take over and go through some of the practical aspects of it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1774.612,
    "end": 1776.613,
    "text": "So then just reiterate the scope and purpose.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1777.474,
    "end": 1786.101,
    "text": "Our target audience really is researchers in neuroscience and psychology that don't have a strong quantitative background in maths or ML, in particular, early career researchers.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1786.882,
    "end": 1789.043,
    "text": "We just really want to provide people with the requisite background.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1790.742,
    "end": 1792.823,
    "text": " to actually apply this in the context of their own research.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1793.864,
    "end": 1803.969,
    "text": "Okay, and then, so just to quickly highlight some really fantastic other resources, the first papers by Lancelot de Costa, which is an incredible technical review, just came out in Mathematical Psychology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1804.609,
    "end": 1808.812,
    "text": "Norsedjit has a really other incredible paper, just came out in Neurocomputation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1809.412,
    "end": 1818.737,
    "text": "And I think the comparison to dynamic programming in Bellman formulations is still in preprint, if that's right, Ryan.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1819.688,
    "end": 1825.814,
    "text": " But as well, there's some really phenomenal informal tutorials with Oleg Solopchuk.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1825.874,
    "end": 1827.055,
    "text": "I'm sorry if I butchered your name.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1827.115,
    "end": 1831.378,
    "text": "But anyway, they're fantastic, kind of informal tutorials on Medium.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1831.819,
    "end": 1842.528,
    "text": "And then lastly is kind of the closest thing to what we're doing today is these lectures by Philip Schwartenbeck in the Computational Psychiatry Summer School.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1843.009,
    "end": 1845.09,
    "text": "And these really are fantastic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1845.471,
    "end": 1846.832,
    "text": "The only difference is that they work with",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1847.148,
    "end": 1852.091,
    "text": " To my knowledge, I think they work with the unfactorized MDP scheme, which is a little less flexible than what we're working with.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1854.633,
    "end": 1855.013,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1855.413,
    "end": 1859.056,
    "text": "And so there are a lot of ways of kind of motivating active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1860.056,
    "end": 1866.741,
    "text": "I think kind of the way that's most intuitive to a lot of people in cognitive science or backgrounds in cognitive science is to kind of start from the perspective of the Bayesian brain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1867.841,
    "end": 1872.664,
    "text": "And so interrupting, if anything, is kind of moving too quickly or too slowly or anything like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1872.745,
    "end": 1874.846,
    "text": "But broadly speaking, the idea is that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1875.643,
    "end": 1881.226,
    "text": " The brain encodes a generative model of the environment where this generative model is just kind of a joint probability distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1882.206,
    "end": 1890.39,
    "text": "And then outside or in the outside world, as it were, there are states and states give rise to observations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1890.951,
    "end": 1901.396,
    "text": "And we use the generative model in combination with Bayesian updating to infer the hidden causes of our sensations from the observations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1902.156,
    "end": 1910.037,
    "text": " and then we take actions based upon our kind of internal model of the world that couples us back to the generative process, if that makes sense.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1910.497,
    "end": 1913.698,
    "text": "And so there's this kind of perception-action loop that's always going on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1915.218,
    "end": 1920.379,
    "text": "So Chris, I think you might want to tell people just what the PO comma S comma pi is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.399,
    "end": 1922.459,
    "text": "Oh, sorry, okay, yeah, so, okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1923.4,
    "end": 1931.361,
    "text": "So that is a joint probability distribution over observations, states, and policies, where policies are just actions or sequences of actions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1932.291,
    "end": 1936.732,
    "text": " that are available, all of the actions that are afforded to the agent essentially.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1940.692,
    "end": 1947.614,
    "text": "To illustrate this, we'll just give a really basic example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1947.674,
    "end": 1952.274,
    "text": "You might imagine being presented with a shadowy shape like this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1953.855,
    "end": 1961.276,
    "text": "What you want to do is infer the causes of that shape just based upon the observations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1961.715,
    "end": 1963.316,
    "text": " But you don't just have observations, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1963.456,
    "end": 1965.497,
    "text": "You have some prior knowledge about the world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1965.517,
    "end": 1968.479,
    "text": "And so we can specify that here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1968.619,
    "end": 1973.082,
    "text": "So we might say there are two possible causes in this very limited example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1973.242,
    "end": 1981.188,
    "text": "There is, we might say that the shadow is caused by convex surface or a concave surface, and they're fairly similar prior probabilities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1982.008,
    "end": 1987.892,
    "text": "However, we also have the structural prior that we've kind of acquired through a lifetime of experience of just light emanating from above.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1988.82,
    "end": 1999.689,
    "text": " And under kind of a structural prior that light emanates from above, the likelihood of the observation of that particular shadow kind of conditional on being concave is much, much higher.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2002.091,
    "end": 2002.431,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2002.531,
    "end": 2012.319,
    "text": "And so then we can then combine the two, the prior and the likelihood, to give us a joint distribution where this is just kind of conditional on a specific observation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2013.54,
    "end": 2015.602,
    "text": "We can then, and then we sum over",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2016.769,
    "end": 2027.951,
    "text": " the states in that likelihood to give us our marginal likelihood and then divide our joint distribution or our generative model by our marginal likelihood.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2027.971,
    "end": 2031.572,
    "text": "And that's called model inversion or is often colloquially called model inversion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2033.492,
    "end": 2035.573,
    "text": "And from there we get our posterior distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2035.613,
    "end": 2039.214,
    "text": "This is the probability of states conditional on observations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2039.674,
    "end": 2045.475,
    "text": "And so we started with a prior and a likelihood and got to a posterior through Bayes' rule.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2047.688,
    "end": 2056.153,
    "text": " That is formally speaking the optimal way to infer the probability of hidden causes given observations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2057.193,
    "end": 2061.776,
    "text": "But the complication to all this is that the marginal likelihood is generally speaking computationally intractable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2063.537,
    "end": 2071.021,
    "text": "In the case of these very simple discrete distributions, the number of sums that you have to perform scales exponentially with the size of your hypothesis space.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2071.181,
    "end": 2072.441,
    "text": "That's extremely impractical.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2074.261,
    "end": 2085.771,
    "text": " And kind of more realistically, when you're working in continuous state spaces, if you have non-Gaussian or non-linear signals, their distribution is analytically intractable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2086.616,
    "end": 2089.158,
    "text": " So Chris, I think Max had a question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2089.539,
    "end": 2090.239,
    "text": "Yeah, yeah, sorry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2090.259,
    "end": 2090.82,
    "text": "Yeah, real quick.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2091.18,
    "end": 2104.353,
    "text": "Just to really explicitly touch on the idea of hidden states and hidden variables in this particular context, would it be fair to say that it's not only the convexity or concavity of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2104.833,
    "end": 2121.803,
    "text": " the potential thing that I'm looking at, but also I could think of the light source, the direction from where the light source is as being another hidden variable, and those things together, would it be fair to term those as under my Markov blanket, or is that getting a little too far out from where we want to be talking right now?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2122.103,
    "end": 2129.547,
    "text": "Yeah, so Markov blankets don't really, the Markov blanket concept here doesn't really come in in any really interesting way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2129.567,
    "end": 2132.209,
    "text": "I mean, you can formulate it that way, but really the idea is just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.881,
    "end": 2134.402,
    "text": " you have this prior expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2134.502,
    "end": 2155.681,
    "text": "So when you're looking at the little gray disc right there under observation, most people, when you look at it, even though it's actually just a flat shape with some, you know, it's just a flat two-dimensional thing that has a little bit of darkness in one place, a little bit of lightness in another, you know, if most people see that as being concave, even though it's a flat 2D thing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2155.721,
    "end": 2160.105,
    "text": "So the idea is just that there's a reason, right, why people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2160.629,
    "end": 2165.05,
    "text": " typically see it as being concave, as it's kind of like popping in as opposed to out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.631,
    "end": 2172.773,
    "text": "And that's specifically because there's this prior belief that light sources tend to come from above.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.733,
    "end": 2186.677,
    "text": "So the hidden states here are kind of, there is a joint in the likelihood, which just means that there's a, in the upright where it says likelihood, there's a concave comma light from above, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2186.697,
    "end": 2188.717,
    "text": "So those are two different hidden states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.438,
    "end": 2190.318,
    "text": "What it's saying is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.89,
    "end": 2208.797,
    "text": " if the hidden states are concave and light from above, if the combination of those things is what's generating what I'm seeing with that gray disk thing, the probability of the shadow shape, the shadow pattern that you see, is 0.9.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.437,
    "end": 2218.001,
    "text": "Whereas if it was convex and light from above, if those were the two hidden states, then the probability you get that same shadow pattern is only 0.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.161,
    "end": 2220.642,
    "text": "In other words, it'd be really hard",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2221.206,
    "end": 2229.833,
    "text": " to get that pattern of shading if the thing was popping out under the assumption that light's coming from above.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.195,
    "end": 2239.101,
    "text": "So the observation here is shadow and the hidden states are concave or convex and light from above and light from below.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.822,
    "end": 2240.643,
    "text": "Okay, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2241.365,
    "end": 2247.391,
    "text": " Yeah, just one other quick example there would be like the chessboard with a shadow and a dark square.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2247.631,
    "end": 2252.937,
    "text": "It's perceived under a deep cultural prior that chessboards are regular alternating grids.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2253.497,
    "end": 2258.282,
    "text": "It makes an ambiguous shaded square appear as something that's quite different than it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2258.322,
    "end": 2259.043,
    "text": "People can look that up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2259.564,
    "end": 2263.307,
    "text": "And then another thing this reminds me of is like using a t-test",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2263.948,
    "end": 2267.552,
    "text": " to test whether group A versus B is taller or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2268.092,
    "end": 2278.523,
    "text": "It assumes, but it can be an assumption that can be slightly bent, is it assumes that other than the variable being considered, other things are sort of fixed or not mattering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.683,
    "end": 2286.231,
    "text": "Otherwise, your statistical test is basically misleading because it could be capturing some totally confounding variable in the framework you put it in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.912,
    "end": 2293.675,
    "text": " And so whenever you're talking about a real biological organism, you're talking about conditioning on certain things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2294.615,
    "end": 2298.437,
    "text": "And then given what is totally conditioned out of the picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2298.897,
    "end": 2304.72,
    "text": "So I kind of see where you're going with the blanket, but it's not specifically in this place, but a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2305.34,
    "end": 2314.985,
    "text": " But it's like, depending on the irrelevancies that we can condition out, then we're looking at the conditional relationships between different observed states versus the hidden things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2315.366,
    "end": 2316.766,
    "text": "So cool stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2316.886,
    "end": 2320.088,
    "text": "And again, in the live chat, people can post any questions on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2320.488,
    "end": 2321.409,
    "text": "Continue, Christopher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2322.449,
    "end": 2323.53,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.73,
    "end": 2324.971,
    "text": "So yeah, thanks for covering that, Ryan.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2325.931,
    "end": 2332.195,
    "text": "OK, so then the idea is that the marginal likelihood is generally computationally intractable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2333.462,
    "end": 2339.686,
    "text": " but kind of borrowing some ideas from statistical physics, what you can do is actually use some approximation techniques.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2339.806,
    "end": 2348.612,
    "text": "And instead of evaluating the marginal likelihood directly, we can evaluate something that's always provably greater than or equal to the marginal likelihood.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2349.313,
    "end": 2351.534,
    "text": "I'm going through that right now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2351.554,
    "end": 2352.935,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2353.115,
    "end": 2356.057,
    "text": "And so we're just going to take the logs kind of for mathematical convenience.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2356.077,
    "end": 2360.34,
    "text": "And the reason we always work with logs or generally speaking is because log",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2361.417,
    "end": 2365.019,
    "text": " Log algebra is just a lot easier just because it turns multiplications into arithmetic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2366.46,
    "end": 2368.741,
    "text": "It's just easier to work with essentially.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2369.061,
    "end": 2372.263,
    "text": "We'll take the negative log of our marginal likelihood.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2373.063,
    "end": 2375.684,
    "text": "This is also sometimes called Bayesian model evidence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2375.824,
    "end": 2383.528,
    "text": "When we have a negative log of a probability, it's also called surprise and information theory, which is the terminology that I'm going to use the rest of this presentation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2384.589,
    "end": 2386.37,
    "text": "You can see on the right-hand side of the equality,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2386.914,
    "end": 2397.456,
    "text": " this is the sum rule of probability, we can get back our surprise by just summing over all of the states under our joint distribution of the states and outcomes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2397.496,
    "end": 2399.897,
    "text": "Then we can do a little bit of a trick here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2399.917,
    "end": 2409.319,
    "text": "So what I'm going to do now or show you is that we are going to multiply this joint distribution or generative model by some arbitrary distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2409.759,
    "end": 2412.979,
    "text": "We multiply and divide by the same distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2413.039,
    "end": 2415.3,
    "text": "So nothing has changed here, this quality still holds.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2415.956,
    "end": 2418.937,
    "text": " I could cancel these if we wanted to, but I don't want to.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2418.957,
    "end": 2425.68,
    "text": "And that's in particular because I want to take advantage of something called Jensen's inequality.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2425.86,
    "end": 2434.204,
    "text": "And that is that a result showing that the expectation of a logarithm is always less than or equal to the logarithm of an expectation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2435.504,
    "end": 2444.988,
    "text": "And so the idea is, is that this sum here, where the logarithm is inside this summation, where, sorry, so we're taking, we're summing over",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2446.76,
    "end": 2466.255,
    "text": " this kind of difference between a generative model and this approximate or target distribution, when the logarithm is inside that, it is always going to be, and we're in kind of negative territory, it's always going to be greater than this quantity on the left-hand side, where this left-hand quantity is equal to surprise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2466.695,
    "end": 2474.541,
    "text": "Because the log is outside the sum, we can cancel these kind of approximate distributions, right, and end up back at surprise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2474.98,
    "end": 2476.361,
    "text": " On the right hand side, we can't do that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2477.302,
    "end": 2485.367,
    "text": "This right hand side will only be equal to surprise when our generative distribution perfectly matches our approximate distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2486.388,
    "end": 2491.351,
    "text": "And so this quantity on the right hand side here, this is variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2492.332,
    "end": 2501.458,
    "text": "And so the idea is, is that we find the probability distribute this approximate probability distribution, which we make simplifying assumptions about.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2501.538,
    "end": 2504.42,
    "text": "And so we can kind of evaluate analytically",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2506.868,
    "end": 2515.159,
    "text": " We find the value of this distribution that best minimizes f, where f is variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2515.62,
    "end": 2516.521,
    "text": "Does that kind of make sense?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2517.783,
    "end": 2519.105,
    "text": "Hey, Chris, just one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2519.285,
    "end": 2521.769,
    "text": "Are you trying to move your mouse around to point to things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2522.389,
    "end": 2522.49,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2523.797,
    "end": 2525.138,
    "text": " I'm actually putting my mouse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.758,
    "end": 2528.278,
    "text": "I'm scribbling my mouse a little bit on the live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2528.298,
    "end": 2529.239,
    "text": "They should be able to see that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2529.619,
    "end": 2535.84,
    "text": "But Christopher, thank you for that really awesome example because it really clarified a few things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2536.481,
    "end": 2537.781,
    "text": "Any other notes to add here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2537.901,
    "end": 2539.221,
    "text": "Otherwise, this is cool to continue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2541.062,
    "end": 2541.222,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2541.762,
    "end": 2541.902,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2543.559,
    "end": 2547.142,
    "text": " Then just to give a really toy example of this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2547.262,
    "end": 2552.286,
    "text": "We can define our approximate posterior arbitrarily as a flat distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2552.907,
    "end": 2554.428,
    "text": "We'll have a true posterior.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2554.468,
    "end": 2559.072,
    "text": "Generally speaking, we don't know what this is, but for illustration sake, we're going to give it to you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2560.252,
    "end": 2562.614,
    "text": "Then we can have a joint distribution and an observation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2562.875,
    "end": 2568.319,
    "text": "What the observation will do is it's just going to select a column from this joint distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2572.682,
    "end": 2577.204,
    "text": " And so then we can enter this into the equation we saw on the last slide.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2577.985,
    "end": 2587.569,
    "text": "And we'll slowly but surely in each update nudge our posterior distribution such that it minimizes f on each step.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2588.41,
    "end": 2595.673,
    "text": "And at the third step, what we should see is that when f is at a minimum, it is equal to surprise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2596.554,
    "end": 2599.055,
    "text": "And when f is at a minimum as well, it's at a minimum because",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2599.966,
    "end": 2602.788,
    "text": " the true posterior and our approximate posterior match.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2602.808,
    "end": 2605.45,
    "text": "Does that kind of make sense?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2606.711,
    "end": 2621.443,
    "text": "And so the idea is that by performing Bayesian inference and forcing some arbitrary distribution to approximate our posterior, we come up with an upper bound on surprise, or we come to an upper bound on surprise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2622.287,
    "end": 2625.488,
    "text": " Let me kind of just walk through and just double check here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2625.889,
    "end": 2632.251,
    "text": "So Q of S is our estimate of whether the coin is a fair coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.271,
    "end": 2637.614,
    "text": "50-50 means that it's 50-50 and then 80-20 is the reality on the table, so to speak.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2638.274,
    "end": 2642.896,
    "text": "So it's almost like first we click from 50-50, we see heads come up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2643.536,
    "end": 2646.677,
    "text": "And that contributes a little bit of evidence that maybe heads is more likely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2647.078,
    "end": 2647.958,
    "text": "So we go from 50-50 to 60-40.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2650.379,
    "end": 2652.14,
    "text": " And then something happens again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.36,
    "end": 2656.743,
    "text": "And we click on the second update to 7.7.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2657.384,
    "end": 2659.365,
    "text": "We click eventually to 0.8.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2660.066,
    "end": 2670.813,
    "text": "And then if we click all the way to 0.9.1, so like a 90.10, all of a sudden we go back up from 0.693 back up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2671.233,
    "end": 2678.898,
    "text": "So if we were to plot this final estimated F, we'd find that we were like going downhill, getting better, get to 0.693 in this discrete,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2681.079,
    "end": 2689.763,
    "text": " 0.1 movement space, and then we pop up a little bit too far, we overshoot, and we get a little bit more surprised by the distributions that we're drawing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.564,
    "end": 2691.244,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2691.364,
    "end": 2691.964,
    "text": "That's perfect.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2692.565,
    "end": 2700.609,
    "text": "Well, the only thing that I would say that's, I mean, a little different, just to note, is that there's nothing in this example where you observe something over and over again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.629,
    "end": 2707.912,
    "text": "This is just a single observation once, and you're trying to figure out what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.479,
    "end": 2713.381,
    "text": " what is the, you're trying to figure out what the true posterior is, trying to get as close to it as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2714.021,
    "end": 2722.825,
    "text": "So all you're doing is saying, here's the single observation, but I'm going to try out a bunch of different values for Qs, a bunch of different values for that approximate distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.606,
    "end": 2731.129,
    "text": "And I'm just going to find the one, you know, through this kind of iterative updating thing where I slowly move Qs, you know, to different values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.789,
    "end": 2735.651,
    "text": "You just do that for a single observation and you update until you find",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.331,
    "end": 2751.102,
    "text": " the minimum free energy value, which just tells you that your approximate posterior, the QS thing, is really close to the true posterior that you couldn't figure out on your own because the problem was too tough to solve with exact Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.243,
    "end": 2757.867,
    "text": "So this kind of corresponds to what people might talk about as prediction error minimization, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.408,
    "end": 2763.872,
    "text": "So you just see this observation once, and the brain tries to minimize prediction error by minimizing F",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.636,
    "end": 2774.107,
    "text": " by just moving beliefs until it finds the belief that minimizes F, which is the same thing as minimizing prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2776.309,
    "end": 2777.329,
    "text": " If that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2778.01,
    "end": 2781.171,
    "text": "Let me clarify, because I think that really helped me understand it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2781.351,
    "end": 2788.774,
    "text": "And at first I thought, wait, with one observation, because at first when I described it, I was thinking update was tied to a new observation from the coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2789.295,
    "end": 2797.078,
    "text": "But then I thought, well, if you're only getting one observation, the maximum likelihood model is a coin that only comes up heads because you only have one observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2797.598,
    "end": 2801.12,
    "text": "But it's not one shot parameter learning naive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2801.9,
    "end": 2809.387,
    "text": " It's actually a tethered estimate that's tethered even loosely, but non-zero tethering to a prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2809.407,
    "end": 2814.471,
    "text": "0.5, 0.5, some people will say uninformative, but all priors are informative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.112,
    "end": 2815.933,
    "text": "They're all what they are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.953,
    "end": 2816.913,
    "text": "And then,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2817.614,
    "end": 2828.1,
    "text": " it's almost like because of the logs, even though you only observed the coin come up once, it's like, all right, it's a little too far to update to 99.1 just from seeing one coin flip.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2828.24,
    "end": 2831.462,
    "text": "I would need extraordinary evidence for extraordinary updates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2832.223,
    "end": 2843.57,
    "text": "And so it's like that one heads observation updates you from 50.50 to near 80.20, which does happen to be close to the actual probability of the coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2844.19,
    "end": 2850.593,
    "text": " And it also happens to navigate this explore exploit in an interesting way because it updates it, but not all the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.174,
    "end": 2867.242,
    "text": "So it's just kind of showing how the Bayesian updating brings some of that wisdom of multi-observation learning, like slow updating of parameters and sequential updating to a little bit of a different context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2869.358,
    "end": 2870.879,
    "text": " I do want to clarify here a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2870.979,
    "end": 2875.423,
    "text": "I mean, there's no actions here, so there can't really be explore-exploit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2875.443,
    "end": 2879.226,
    "text": "You can't choose to look over here versus over there to gain information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2879.246,
    "end": 2888.073,
    "text": "So explore-exploit is specifically in the realm of choosing actions that will minimize uncertainty versus maximize reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2889.354,
    "end": 2893.677,
    "text": "This is really more just with normal free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.918,
    "end": 2896.74,
    "text": "We're not to expected free energy yet, which is the decision-making part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2897.233,
    "end": 2911.605,
    "text": " With normal free energy, you can think the simplest way to think about free energy is just in terms of complexity minus accuracy, which is equivalently complexity plus prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.366,
    "end": 2917.27,
    "text": "And all that ultimately means is, so the complexity thing is basically how much you have to change your beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2918.951,
    "end": 2923.495,
    "text": "So it's basically saying, what's the minimum change in my beliefs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2924.184,
    "end": 2927.466,
    "text": " that will make my new beliefs as accurate as possible, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2927.486,
    "end": 2934.491,
    "text": "So I have to move my beliefs as little as possible while also minimizing prediction error, if that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2934.691,
    "end": 2946.78,
    "text": "So what this generative model is saying is just that the probability that we're in state one is 0.8 if I were to get this observation, where the probability of being in state two is only 0.2 were I to get this observation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.385,
    "end": 2962.229,
    "text": " So, I mean, probably a better example than the heads and tails thing would just be something like the concave-convex example we gave before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2962.249,
    "end": 2963.09,
    "text": "Hidden state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2963.57,
    "end": 2971.114,
    "text": "There is some possibility where light from below could cause the shading pattern, but it's just much less likely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.134,
    "end": 2981.499,
    "text": "So you're just trying to find the belief that it's convex and light from above that is the one that most likely generated what you're seeing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.503,
    "end": 2989.112,
    "text": " And it might take a bunch of updates like that given just what you see once to kind of arrive at the best fitting belief.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2989.605,
    "end": 2994.328,
    "text": " There's a related question in the live chat that I'm just going to ask because it's on the topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2994.688,
    "end": 3006.516,
    "text": "They asked, is this approximate Bayesian inference thing called something else in stats outside of active inference, or is this unique to active inference because this isn't sequential Bayesian updating, as you mentioned?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3007.017,
    "end": 3008.638,
    "text": "This isn't a standard Bayesian filter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3008.938,
    "end": 3011.78,
    "text": "What is this called outside of the active inference field?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3012.44,
    "end": 3014.301,
    "text": "Yeah, it's just variational Bayes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3014.682,
    "end": 3019.265,
    "text": "Variational Bayes, where does the partially observable Markov decision process come into play?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.426,
    "end": 3046.446,
    "text": " uh we'll cover that in a moment's time actually yeah it doesn't it doesn't yeah it doesn't come in yet so i think one thing to say is kind of writing this tutorial it's hard to please everyone right like in going through some of the feedback like we get we got some feedback where people were just like utterly confused and wanting clear explanations and then at the other end of the spectrum we wanted there were people wanting much more technical details like how does this relate to things like gradient descent because this is just kind of uh",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3047.438,
    "end": 3055.001,
    "text": " very simplified cartoon example of something called a gradient descent scheme where you're doing a gradient descent on free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3056.842,
    "end": 3068.627,
    "text": "And so I would just say kind of to flag all of these issues is one, I would say if something's unclear in this presentation, read the paper because we cover things in a lot more detail in the paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3068.927,
    "end": 3072.269,
    "text": "And if that isn't technical enough for you, actually go and just look at our code.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3073.009,
    "end": 3076.851,
    "text": "We supply a kind of standalone script where we",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3077.495,
    "end": 3079.657,
    "text": " it's extreme and it's extremely well commented.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3079.837,
    "end": 3082.578,
    "text": "And from there, you should be able to figure out everything that's going on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3084.88,
    "end": 3095.967,
    "text": "So all of this stuff in this presentation is kind of necessarily simplified because you don't really need those technical details to kind of start using the framework or start getting intuition for how things work.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3097.108,
    "end": 3101.191,
    "text": "But once you do have an intuition and you want more, just go and see the code, I would say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3103.49,
    "end": 3103.77,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.211,
    "end": 3108.915,
    "text": "It's like you can use the ANOVA package in R without going into the source code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.315,
    "end": 3109.956,
    "text": "It's helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.236,
    "end": 3111.397,
    "text": "It's a tool for scientists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3111.717,
    "end": 3118.883,
    "text": "And then if you're curious about the underpinnings of statistics and perennial philosophical debates, there's a literature and a search bar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.303,
    "end": 3123.587,
    "text": "But today it's about the applications of these methods, which is awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3123.807,
    "end": 3125.208,
    "text": "So thanks everyone for the questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3125.268,
    "end": 3125.829,
    "text": "Keep them coming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3125.849,
    "end": 3127.15,
    "text": "But this is great discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.19,
    "end": 3128.131,
    "text": "I really appreciate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3129.767,
    "end": 3132.989,
    "text": " Okay, and so just kind of to recap there, I haven't covered action yet.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3133.009,
    "end": 3134.47,
    "text": "I'm going to cover action a little bit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3135.051,
    "end": 3146.879,
    "text": "But just kind of to recap, the idea is that under active inference, organisms are kind of, we model them as if their phenotype is in their body and their brain kind of embodies a generative model of the environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3147.759,
    "end": 3155.424,
    "text": "And organisms kind of invert the generative model to arrive in an approximate posterior distribution over the hidden causes of sensory input.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3155.804,
    "end": 3157.966,
    "text": "And they do this by minimizing variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3159.631,
    "end": 3162.052,
    "text": " That much should hopefully be clear by this point.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3164.454,
    "end": 3168.596,
    "text": "Then onto the generative model, and it is a very specific type of generative model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3168.776,
    "end": 3172.458,
    "text": "Namely, it's a partially observable Markov decision process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3172.478,
    "end": 3176.98,
    "text": "There's a graphical representation of this as a Bayesian network on the right-hand side.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3177.2,
    "end": 3180.462,
    "text": "I'm not going to give too much detail about this right now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3180.482,
    "end": 3183.064,
    "text": "I will actually build it up step-by-step.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3183.624,
    "end": 3184.244,
    "text": "But just prelude,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3186.274,
    "end": 3194.719,
    "text": " The idea with POMDPs is that they describe transitions among hidden unobservable variables and the sensory data that's generated by the variables.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3195.02,
    "end": 3196.681,
    "text": "Whoops.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3196.701,
    "end": 3211.35,
    "text": "So those arrows mapping from states to observations kind of give information about the direction of influence or conditional influence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3211.39,
    "end": 3214.692,
    "text": "So kind of the arrow between the purple node",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3215.55,
    "end": 3221.114,
    "text": " O and the green node S is mediated by the A matrix, which is a likelihood.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3221.734,
    "end": 3227.018,
    "text": "And the transitions between states are mediated by a B matrix, which is a transition probability.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3228.039,
    "end": 3239.587,
    "text": "And so the goal of active inference with POMDPs is to infer states and action sequences or policies by minimizing various forms of variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3241.912,
    "end": 3244.693,
    "text": " So let's start with a really, really simple example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3244.854,
    "end": 3246.074,
    "text": "We have static inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3247.455,
    "end": 3254.658,
    "text": "The idea with static inference is this is just a graphical representation of Bayes' rule, essentially.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3255.759,
    "end": 3259.541,
    "text": "We have a prior, which is encoded in our D vector.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3259.641,
    "end": 3266.544,
    "text": "We have a likelihood encoded in our A matrix, and we end up with an update equation, which is a softmax function.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3266.564,
    "end": 3268.665,
    "text": "A softmax function is a normalized exponential.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3272.171,
    "end": 3276.032,
    "text": " And so I'm not going to kind of run through that explanation in detail.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3276.112,
    "end": 3281.373,
    "text": "I'm just going to kind of leave the slide here so people can figure it out for themselves and pause and go back and convince themselves that this is true.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3281.713,
    "end": 3287.455,
    "text": "But for this very simple example, the inference scheme that we're using here is formally equivalent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3287.515,
    "end": 3288.995,
    "text": "It's just an exact inference scheme.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3289.975,
    "end": 3297.317,
    "text": "So moving into dynamic models, specifically so where states change over time, these are also called hidden Markov models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3298.069,
    "end": 3308.391,
    "text": " This is when we have to start making approximate or when things are no longer equivalent to using active inference are no longer equivalent to exact inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3310.592,
    "end": 3315.833,
    "text": "And so here we have our transition probabilities encoded in a B matrix.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3316.133,
    "end": 3321.674,
    "text": "And this is just essentially like the probability of some state of T plus one conditioned on the previous state.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3322.734,
    "end": 3331.703,
    "text": " And so you can see over here in terms of the update equations, we're now in log space and this little sigma thing here is a softmax function, which just normalizes this equation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3332.243,
    "end": 3335.887,
    "text": "And the idea is that this is kind of, sorry, my screen keeps flipping.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3336.187,
    "end": 3343.034,
    "text": "Anyway, the combination of D and B, so our two priors, in addition to our likelihoods,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3344.173,
    "end": 3346.174,
    "text": " will give us the approximate posterior.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3346.434,
    "end": 3359.599,
    "text": "And the reason we have this one half in front is just because in practice, the approximation scheme that's used by active inference, namely variational message passing, tends to overestimate kind of the value of the posterior.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3359.939,
    "end": 3362.02,
    "text": "And so this is kind of just a way of compensating for that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3362.06,
    "end": 3372.844,
    "text": "And so anyone who's kind of interested in technical details there, see Thomas Parr has a really excellent paper out in Scientific Reports on neuronal message passing schemes under various approximations to free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3374.375,
    "end": 3377.616,
    "text": " Okay, and so then the form of the free energy is just down here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3378.637,
    "end": 3384.419,
    "text": "And so the idea is that by iteratively applying these updates, we minimize free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3386.7,
    "end": 3393.783,
    "text": "And you iteratively kind of, you do a full round of updating every time you get a new observation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3396.624,
    "end": 3398.224,
    "text": "Okay, but what about policy selection?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3398.725,
    "end": 3402.286,
    "text": "So the idea with policy selection is roughly speaking,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3402.799,
    "end": 3406.601,
    "text": " that policies are just state transitions that the agent has control over.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3407.061,
    "end": 3418.928,
    "text": "So imagine you are a psychophysics experimenter and you have just a very simple, boring example of someone kind of, say, estimating the orientation of some hard to see stimulus.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3419.228,
    "end": 3420.929,
    "text": "And so the policy space there is tiny.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3421.289,
    "end": 3422.069,
    "text": "It's two options.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3422.129,
    "end": 3423.23,
    "text": "It's left or right, let's say.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3424.291,
    "end": 3428.193,
    "text": "Or you could have an agent that you could be simulating something more interesting in psychophysics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3428.613,
    "end": 3430.514,
    "text": "You could be simulating an agent navigating a maze.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3431.161,
    "end": 3433.063,
    "text": " And then the policy space is much larger.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3433.103,
    "end": 3436.867,
    "text": "They could move forwards, backwards, left, right, et cetera, et cetera.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3439.089,
    "end": 3445.796,
    "text": "And so the idea is that active inference agents, by definition, need to select policies that will minimize variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3446.777,
    "end": 3451.261,
    "text": "But that relies upon observations that have yet to come.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3452.202,
    "end": 3453.123,
    "text": "So that's kind of a problem.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3454.554,
    "end": 3458.396,
    "text": " But the way around this is to treat observations as random variables.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3458.976,
    "end": 3465.779,
    "text": "And then what you do is you minimize an approximation not to surprise, which is variational for energy, but to expected surprise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3466.339,
    "end": 3471.401,
    "text": "And that approximation to expected surprise is expected free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3472.102,
    "end": 3475.163,
    "text": "And so this expected free energy has two key components.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3475.823,
    "end": 3477.644,
    "text": "The first is the expected cost.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3478.104,
    "end": 3479.565,
    "text": "And this is kind of minimize.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3479.805,
    "end": 3481.686,
    "text": "The idea here is to minimize expected cost.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3482.318,
    "end": 3486.081,
    "text": " you need to minimize the deviation between our predicted and our preferred outcomes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3486.402,
    "end": 3488.904,
    "text": "And so this is kind of what we were talking about, Ryan was talking about before.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3488.924,
    "end": 3492.668,
    "text": "So this C vector encodes a distribution over an agent's preferences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3493.468,
    "end": 3503.337,
    "text": "So for example, policies that minimize expected costs are policies that kind of bring about observations that the agent prefers, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3503.397,
    "end": 3508.262,
    "text": "So if I prefer to kind of have my body temperature within a certain range,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3508.66,
    "end": 3515.405,
    "text": " The policy would be maybe staying inside because I live in England and it's like negative one outside, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3516.705,
    "end": 3523.51,
    "text": "Now, expected ambiguity is a little bit... This is kind of the epistemic drive or the information gain term.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3523.97,
    "end": 3527.793,
    "text": "This is kind of the expected entropy of our likelihood distribution.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3528.413,
    "end": 3533.397,
    "text": "So the idea here is that to minimize ambiguity, you will have an A matrix, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3533.417,
    "end": 3538.02,
    "text": "An A matrix, if the idea is to minimize kind of ambiguity, you need to select...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3538.74,
    "end": 3543.222,
    "text": " observations in that A matrix that are maximally precise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3544.263,
    "end": 3550.947,
    "text": "And so to return to or take actions even that will make those things, that A matrix, maximally precise.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3551.627,
    "end": 3563.013,
    "text": "And so if I'm in a dark room, to give Ryan an example before, the thing that will make or select kind of or policies that will make that distribution maximally precise are policies like turning light on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3564.334,
    "end": 3568.196,
    "text": "And so then to minimise free energy as a whole, you have to minimise both of these things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3569.769,
    "end": 3577.235,
    "text": " You can do this in terms of one-step policies, just looking one step ahead, or you can do it using deep policies, looking many, many steps ahead.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3579.077,
    "end": 3579.958,
    "text": "Hopefully, that's pretty clear.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3579.978,
    "end": 3585.302,
    "text": "Is there anything you'd like to add to that, Ryan or Daniel, anyone else?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3585.322,
    "end": 3596.071,
    "text": "Yeah, I guess I'll just say, just to make it as clear and explicit as possible for people who don't have a background in what this whole thing, what this equation means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3597.189,
    "end": 3603.053,
    "text": " So the idea is just if you look at that term above expected cost, that's called a KL divergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3603.774,
    "end": 3610.659,
    "text": "And so basically it's just a value that encodes the difference between two distributions or the dissimilarity between two distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.579,
    "end": 3620.646,
    "text": "And so that first one, that Q O given pi, that's just saying what observations do I expect given that I choose to do this versus that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3622.427,
    "end": 3625.569,
    "text": "Then that second one, that P of O, that's the preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3627.205,
    "end": 3639.934,
    "text": " So basically what it's trying to do is just minimize the difference between your preferred observations and the observations that you expect, given that you choose to do thing one versus thing two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3640.774,
    "end": 3646.758,
    "text": "So it's really just choosing the thing that you think is going to get you as close to what you want as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3647.299,
    "end": 3649.84,
    "text": "It's very just reward-seeking, more or less.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3650.921,
    "end": 3655.264,
    "text": "And that second one, the expected ambiguity, that H thing stands for entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3655.99,
    "end": 3661.715,
    "text": " And basically entropy is just the higher the entropy, the flatter a distribution is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3662.295,
    "end": 3666.338,
    "text": "So think of a distribution that's like one is like 0.5, 0.5 and the other one's like 0.8, 0.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3666.959,
    "end": 3683.251,
    "text": "Um, if you chose the state that would generate 0.5, 0.5 over observations, then it wouldn't tell you anything because either observation you've got, it tell you there's a 0.5 probability that you're in one state and a 0.5 probability you're in the other state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3683.892,
    "end": 3684.072,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3684.599,
    "end": 3697.942,
    "text": " Whereas the other state would generate a 0.8 or a 0.2, then that one will give you a lot more information because if you observe the thing that indicates 0.8, then you're really confident what state you're in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.323,
    "end": 3701.563,
    "text": "Or if you observe 0.2, you're really confident you're not in that state, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3702.284,
    "end": 3711.606,
    "text": "So you're just seeking out the thing that you think will get you what you want as much as possible, but also moving to the states that are going to,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3712.145,
    "end": 3718.273,
    "text": " give you the observation that's going to tell you the most about where you are, if that makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3718.453,
    "end": 3725.141,
    "text": "So just, again, just for people who aren't necessarily as familiar with reading the kind of notation in these equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3725.882,
    "end": 3726.283,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3726.663,
    "end": 3726.843,
    "text": "Max?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3728.617,
    "end": 3733.861,
    "text": " Yeah, just one point of clarification, and then I just wanted to tie it back to the example we had discussed previously.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3734.101,
    "end": 3741.185,
    "text": "So first I want to just make sure I'm understanding correctly that the D in that equation is the KL divergence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3741.205,
    "end": 3742.586,
    "text": "So that's an operator.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3742.606,
    "end": 3746.349,
    "text": "It's not the same as the D that's in the figure in the block diagram.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3746.369,
    "end": 3748.37,
    "text": "No, that's the KL divergence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3748.43,
    "end": 3752.593,
    "text": "That's kind of a standard way of representing it in other papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3752.633,
    "end": 3755.414,
    "text": "That's just kind of pasted in, but it's not very clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3755.455,
    "end": 3756.275,
    "text": "That should be the KL.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3756.295,
    "end": 3757.276,
    "text": "It has nothing to do with D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3758.403,
    "end": 3769.953,
    "text": " And then the D that's in this graphic in the block diagram, would that be analogous in our previous example where we were talking when we illustrated step by step, that would be our 0.5, 0.5.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3771.734,
    "end": 3774.737,
    "text": "But in this context could be much more complicated than that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3775.237,
    "end": 3775.658,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3775.758,
    "end": 3778.84,
    "text": "In a simple example, yeah, it would just be your prior, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3778.9,
    "end": 3785.426,
    "text": "So if ahead of time you think that like ice cream is more likely than donuts, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3785.885,
    "end": 3786.926,
    "text": " then that could just be like 0.8, 0.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3789.668,
    "end": 3793.471,
    "text": "Or if you have no idea whether it's going to be ice cream or donuts, it could be 0.5, 0.5.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.493,
    "end": 3813.768,
    "text": "And for anyone who is wanting to get into optimization and how do we know whether or not this is going to converge when we do our message passing algorithm back and forth, there was a really good citation, and that's the one that was alluded to at the beginning of this on the slides, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3814.008,
    "end": 3815.409,
    "text": "The technical papers, is that correct?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3816.547,
    "end": 3820.31,
    "text": " So the citation to do with message passing in particular is a paper by Thomas Parr.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3821.231,
    "end": 3822.792,
    "text": "So that is in scientific reports.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3825.694,
    "end": 3827.655,
    "text": "Yeah, we can, I think, do you have show notes?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3828.296,
    "end": 3828.796,
    "text": "I assume we can.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3828.816,
    "end": 3829.497,
    "text": "Yes, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3829.517,
    "end": 3841.886,
    "text": "I have a couple other general questions from the live chat, but I think we'll take them at the end of your presentation as we turn towards some of the neurobiology beginnings and a few other aspects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.926,
    "end": 3842.886,
    "text": "So continue, Christopher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3843.667,
    "end": 3844.087,
    "text": "Yeah, cool.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3844.127,
    "end": 3844.387,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3845.942,
    "end": 3846.182,
    "text": " Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3846.242,
    "end": 3853.964,
    "text": "And so then kind of just to close or just to briefly recap, so there are multiple stages to this, to policy selection.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3854.104,
    "end": 3863.886,
    "text": "So under a generative model that has multiple policies, you need to minimize, you minimize your free energy with respect to each policy, your variational free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3864.226,
    "end": 3871.748,
    "text": "And so you might think about this as say you're coming to a set of traffic lights and you have a whole bunch, you could turn left, right, or go straight ahead.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3872.748,
    "end": 3875.249,
    "text": "Those actions are possible, but you then get,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3876.061,
    "end": 3879.022,
    "text": " sensory input that says there's a no left turn sign.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3879.902,
    "end": 3884.184,
    "text": "So that would make that policy given an extremely high free energy value.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3884.724,
    "end": 3889.085,
    "text": "And so that would eliminate it from the plausible policies that you can kind of evaluate, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3891.066,
    "end": 3894.107,
    "text": "And so then expected free energy is what we just talked about.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3894.707,
    "end": 3900.589,
    "text": "And the posterior distribution is actually the softmax function over both of these.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3900.649,
    "end": 3903.65,
    "text": "And so this, because kind of these are both negatives,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3907.113,
    "end": 3913.679,
    "text": " policies that best minimize both variational free energy and expected free energy will have the highest posterior value.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3916.521,
    "end": 3918.463,
    "text": "Is that clear?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3918.663,
    "end": 3923.927,
    "text": "There are a couple of caveats to all of this, but just wanting to make sure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3923.987,
    "end": 3924.988,
    "text": "Ryan, do you want to add anything here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.689,
    "end": 3935.557,
    "text": "Well, I'll just say, just so anybody who doesn't know what a softmax function is, so all that means is that, for instance, when you take",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3935.959,
    "end": 3941.761,
    "text": " minus F minus G, that's not going to give you something that's a true probability distribution, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3941.781,
    "end": 3944.521,
    "text": "It's not going to be a thing that sums to one, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3944.561,
    "end": 3946.402,
    "text": "Where probabilities altogether sum to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3946.962,
    "end": 3951.203,
    "text": "What it's going to do is give you this negative, you know, a bunch of negative numbers, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3951.643,
    "end": 3964.607,
    "text": "So what a softmax function does is it normalizes that, which just means that it takes the kind of relative values, you know, of each of those things and turns it into a probability distribution that sums to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3965.276,
    "end": 3975.783,
    "text": " So you end up with that bolded pie symbol is just a probability distribution that assigns a probability to each possible policy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3977.184,
    "end": 3980.586,
    "text": "And a policy, by the way, is just a sequence of actions, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3980.626,
    "end": 3985.109,
    "text": "So one policy might be like turn left, turn right, and another policy might be turn right, turn left.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3986.81,
    "end": 3992.053,
    "text": "And so it's just saying that that minus F minus G thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3992.657,
    "end": 3995.098,
    "text": " will just be turned into a probability distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3995.718,
    "end": 4001.76,
    "text": "And that probability distribution over different policies is what the agent will sample from, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4001.78,
    "end": 4010.163,
    "text": "So if pi says this policy is 0.8 and this other policy is 0.2, then the agent will be a lot more likely to choose the policy that's 0.8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4010.223,
    "end": 4010.603,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4012.024,
    "end": 4019.646,
    "text": "Maybe go to the last caveat slide and then I have a few other questions where we'll just try to like have a question, simple answer, question, simple answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4019.846,
    "end": 4021.407,
    "text": "And then we'll move into the part two screen share.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4022.614,
    "end": 4027.597,
    "text": " Okay, so the two caveats are just, there are two extra components to the POMDP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4028.497,
    "end": 4041.624,
    "text": "That is namely the E vector, which you can see is kind of pointing to, or there's that E block that's pointing to policies, and then there's our gamma as well that's also pointing to policies.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4042.044,
    "end": 4047.287,
    "text": "And so E is how, generally speaking, how one models habit formation, or one way of modeling habit formation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4047.928,
    "end": 4050.309,
    "text": "And so I'm not going to talk about that now, I just kind of wanted to flag it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4051.484,
    "end": 4057.109,
    "text": " And then when things come up in learning, you won't be surprised there's now this extra term in the policies.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4057.569,
    "end": 4058.77,
    "text": "And get what Gamma does.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4058.87,
    "end": 4063.673,
    "text": "Gamma is essentially weights the contribution of G to policy selection.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4064.154,
    "end": 4073.201,
    "text": "And so the idea is, roughly speaking, is that G is essentially a, you have your prior distribution of policies, which doesn't take in F at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4074.281,
    "end": 4080.266,
    "text": "And then you have your posterior distribution, which takes in F. And then you look at the difference between those.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4081.312,
    "end": 4086.656,
    "text": " And if there's a large difference between those, roughly speaking, then gamma will go down.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4086.676,
    "end": 4093.22,
    "text": "It will essentially downweight the contribution of expected free energy to your posterior over policies.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4094.581,
    "end": 4100.105,
    "text": "And this is kind of linked to, this is how we model phasic dopamine spiking, for example.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4102.056,
    "end": 4108.958,
    "text": " I'm not going to get into any more details there because I think it's actually much easier to just have like a fully worked example, but I did just want to flag all that stuff.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4110.078,
    "end": 4111.479,
    "text": "Okay, so I think that was my last.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4112.079,
    "end": 4118.861,
    "text": "So that's like this tightening of strategy while things are effective, but not overfitting, but a tightening while things are working.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4119.441,
    "end": 4127.584,
    "text": "And then during a mismatch, a period of high uncertainty or ambiguity, there's actually a movement towards more exploratory behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4128.364,
    "end": 4128.564,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4129.164,
    "end": 4131.965,
    "text": " Let me try to go through a couple of these questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4132.005,
    "end": 4143.749,
    "text": "So we'll just try to have the sort of clippable... One further thing I just wanted to clarify about that, though, is that so gamma thing, really you should think about that as kind of like the precision estimate for expected free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4144.429,
    "end": 4155.453,
    "text": "So all it's doing is just saying, hey, if things were super different than what I thought they were before policy-wise, then, I mean, in some cases, it's a little more complex than that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4155.513,
    "end": 4156.373,
    "text": "But basically...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4157.054,
    "end": 4160.777,
    "text": " I can't trust my expected free energy estimate as much, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4161.017,
    "end": 4161.217,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4161.257,
    "end": 4170.284,
    "text": "So I should downweight, I should sort of downweight how much my expected free energy contributes to what I choose to do because it's not as reliable, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4170.304,
    "end": 4179.592,
    "text": "So it's just saying how much should my habits and my current observations affect what I do versus what I expected ahead of time, how rewarding they were going to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4180.054,
    "end": 4185.916,
    "text": " Right, so if the clock has always been accurate, and then you look at it and you're like, wow, I didn't know it was 1pm, you're like, I believe the clock.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4186.216,
    "end": 4192.518,
    "text": "But if you know that the clock is inaccurate, then you think, I thought it was noon, I looked at it, it said 1, but you know, who knows with this clock these days.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4193.058,
    "end": 4195.459,
    "text": "So, that's about the confidence in the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4195.879,
    "end": 4197.999,
    "text": "Okay, so, policy selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4198.319,
    "end": 4199.34,
    "text": "Two quick questions on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4199.7,
    "end": 4206.922,
    "text": "The first one is, what is the timescale of policy selection, and does this model assume any particular temporal scale?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4209.455,
    "end": 4233.415,
    "text": " um so i mean temporal temporal scales are kind of just whatever you want them to be right so so like you know in the context of a task right you might just say here's time point one which is where you know a participant gets some observation right and here's time point two which is where they choose an action right in which case that would be a two time step trial um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4234.125,
    "end": 4235.566,
    "text": " And I mean, it doesn't really matter, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4235.606,
    "end": 4243.491,
    "text": "I mean, it might, the stimulus might be on for five seconds or it might be on for one second in the first, you know, time step in the trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4244.331,
    "end": 4247.673,
    "text": "Um, and maybe their decision takes half a second, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4247.713,
    "end": 4251.615,
    "text": "So the time step two could be half a second or it could be like a minute, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4251.795,
    "end": 4257.218,
    "text": "I mean, like, so it's time steps are kind of whatever you define them to be relative to a task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4258.099,
    "end": 4263.142,
    "text": "Um, you know, in another session, when we get to hierarchical models, you will have, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4263.598,
    "end": 4270.239,
    "text": " higher levels that operate on slower time scales than the lower levels, but that's a kind of more complex thing that we'll have to cover later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4271.069,
    "end": 4296.227,
    "text": " Okay, another policy-related question is, can you comment on different forms of policies, such as plans from tau equals zero to big time T, so from the beginning till T, and then tau equals little t to big T, belief action policies, tree search followed by belief action policies, and then how is this related to different constructs, such as working memory and habits?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4296.987,
    "end": 4297.547,
    "text": "So maybe just...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4298.388,
    "end": 4304.913,
    "text": " First part of the question was, how are different kinds of policy estimation undertaken?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.933,
    "end": 4313.64,
    "text": "And the second part is, how is that related to maybe different constructs we have with regular vocabulary like working memory or habits?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4316.482,
    "end": 4318.603,
    "text": "Do you want me to take that, Chris, or do you want to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4319.144,
    "end": 4320.905,
    "text": "Yeah, I'm happy to take it, I suppose.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4321.185,
    "end": 4326.029,
    "text": "So you can have shallow policies or you can have deep policies, where deep policies are just kind of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4326.536,
    "end": 4355.475,
    "text": " time point whatever time point one to t and you're just summing over basically all of you basically it's the path integral formally speaking just over expected free energy and that is updated at each time point um or you can have shallow policies where it's just one time step uh how does this relate to like things like tree search and all that stuff um well it depends so i i'm assuming that that question means that you're kind of familiar with like bellman formulations and that kind of thing um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4356.903,
    "end": 4374.01,
    "text": " So expected free energy is Bellman optimal for one-step policies, and it's not Bellman optimal for deep policies, but there are what's called a sophisticated inference scheme, which is, is this correct Ryan, that's formally equivalent to backward induction?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4374.59,
    "end": 4375.471,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4375.851,
    "end": 4385.915,
    "text": "So yeah, sophisticated version of active inference, which is more sort of explicitly like a deep tree search, is equivalent to backward induction, which is Bellman optimal, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4386.4,
    "end": 4386.82,
    "text": " Exactly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4387.721,
    "end": 4390.262,
    "text": "There are forms of this that do relate to tree search.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4390.622,
    "end": 4393.804,
    "text": "In regard to working memory, depends on how you want to set up the task.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4394.384,
    "end": 4409.451,
    "text": "There are models of, say, working memory where you have two-level models, where you model working memory as the thing that has stable maintenance, or you can model it with one-level models.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4409.471,
    "end": 4411.092,
    "text": "It just depends on how you want to set things up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4411.172,
    "end": 4413.073,
    "text": "Generally speaking, I think of",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4415.481,
    "end": 4417.282,
    "text": " working memory is being functionally defined.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4418.402,
    "end": 4423.103,
    "text": "There are lots of definitions, I won't put one out there right now, but like something to do with maintenance, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4425.864,
    "end": 4430.325,
    "text": "And then it kind of just depends on what you're trying to model about working memory, what type of model is appropriate.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4431.286,
    "end": 4440.088,
    "text": "Yeah, I mean, one additional thing to say that's just really kind of basic is that working memory is gonna come down to what your transition matrices look like, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4440.428,
    "end": 4442.289,
    "text": "So if you're put into state one,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4442.967,
    "end": 4455.336,
    "text": " and you have a really strong belief in your transition matrices that if you start in state one, you're going to stay in state one, then that more or less amounts to that state remaining active over several time steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4455.977,
    "end": 4466.444,
    "text": "And if you learn that at time step one, and then at time step four, believing you're in that same state tells you what action to do, then that's a type of working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4468.115,
    "end": 4484.774,
    "text": " Thomas Parr has a really awesome paper, Prefrontal Computation as Active Inference, where he kind of thinks about transition precision in terms of excited tree recurrent connections in lateral PFC, essentially, which have been linked to things like maintenance.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4487.483,
    "end": 4500.833,
    "text": " Cool one last quick take before we go to Ryan sharing your screen is related to modeling a given behavioral task, what are the criteria for setting the factors, where the model will be embedded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4501.554,
    "end": 4510.921,
    "text": "So how do we just sort of operationalize the kinds of things that we take into account in this model, I believe, is what the question is asking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4512.53,
    "end": 4517.372,
    "text": " I mean, in a lot of tasks, there's probably not one unique way, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4517.412,
    "end": 4539.738,
    "text": "I mean, that's kind of where the kind of creativity problem-solving aspect of this comes in is because you kind of have to figure out, right, what factorization structure, what generative model structure, whether it's factorized or not, right, or what different sets of ways to set up a model that can generate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4540.667,
    "end": 4563.324,
    "text": " uh behavior that you would see in a task right i mean i'll give you i'll give you an example right when we build this task build this task model together in my part here um but you know general in a lot of cases you can make something factorized or you can make it not factorized um and you know sometimes you can set actions up so that uh it has to do with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4564.405,
    "end": 4567.246,
    "text": " Probability is in the B matrix in your transition beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4567.386,
    "end": 4570.527,
    "text": "In other cases, you can set it up so it's in the likelihood in the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4571.407,
    "end": 4578.17,
    "text": "My point is there isn't one unique solution always for what generative model to use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4578.31,
    "end": 4583.311,
    "text": "A lot of times you might try out multiple generative models and then do model comparison to figure out which one's best.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4583.912,
    "end": 4585.052,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4585.292,
    "end": 4590.034,
    "text": "Maybe while you're setting up your screen, I'm going to ask one more question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4590.99,
    "end": 4601.498,
    "text": " Somebody wrote, I'm still not exactly clear on why you would want to maximize information and minimize the difference between your desired outcomes and your expectation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4602.439,
    "end": 4609.244,
    "text": "What advantage is afforded by maximizing information if it doesn't enhance the likelihood of receiving the desired outcome?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4611.325,
    "end": 4611.946,
    "text": "Well, it won't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4612.146,
    "end": 4613.086,
    "text": "It won't in that case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4613.387,
    "end": 4617.85,
    "text": "Like typically what will happen is if there's, so the agent,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4618.39,
    "end": 4633.956,
    "text": " I mean, it depends a little bit on the exact task set up, but what will usually happen is that if the agent knows what to do to get the reward, then that just means that that cost term or that kind of reward probability term will just be the one that dominates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4633.976,
    "end": 4635.317,
    "text": "Like the value of that will dominate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4635.377,
    "end": 4637.437,
    "text": "The thing will just select reward automatically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4638.258,
    "end": 4641.339,
    "text": "The information seeking will typically only have a high weight.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4641.897,
    "end": 4646.08,
    "text": " if it's the case that the agent doesn't know what to do yet to get the reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4646.32,
    "end": 4647.441,
    "text": "You know, that reminds me a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4648.041,
    "end": 4653.645,
    "text": "It reminds me a lot of the game theory strategy, which is like tit for tat, but then you start out playing nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4654.305,
    "end": 4657.868,
    "text": "It's like default to being cooperative, but then have a strategy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4658.208,
    "end": 4667.234,
    "text": "And so it's sort of like a meta approach, which is if you're winning the game of Go or chess at whatever training level, then what is there to do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4667.694,
    "end": 4668.715,
    "text": "Your strategy is working.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.075,
    "end": 4671.657,
    "text": "But then when there isn't a victory observation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4672.397,
    "end": 4680.643,
    "text": " Then it entails an exploratory search that percolates through higher and higher abstractions of learning in the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4681.403,
    "end": 4686.167,
    "text": " So I hope that we can make that a little bit more tangible with this session right here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4686.187,
    "end": 4688.208,
    "text": "So we have 40 minutes left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4688.789,
    "end": 4691.091,
    "text": "And again, this is just part one of multiple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4691.551,
    "end": 4700.058,
    "text": "So let's go for, you know, 20 to 30 minutes followed by 10 to 20 minutes of wrap up and final questions from the chat and a couple other ones I have stored up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4700.478,
    "end": 4702.54,
    "text": "But thanks and take it away, Ryan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4703.961,
    "end": 4704.221,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4704.321,
    "end": 4708.664,
    "text": "So I want to just ask real quick, can you guys see my like mouse if I like point to things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4708.865,
    "end": 4709.025,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4709.065,
    "end": 4709.225,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4709.952,
    "end": 4713.633,
    "text": " Okay, okay, because I need to point to things when I'm presenting this stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4713.753,
    "end": 4723.555,
    "text": "So, okay, so just kind of, again, to get to scope here, I mean, the end goal of the tutorial is for people to be able to actually do research with these things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4724.135,
    "end": 4728.275,
    "text": "So the end goal here is to learn how to build task models for empirical studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.396,
    "end": 4732.796,
    "text": "And the basic idea is that you're going to have participants perform a task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4733.376,
    "end": 4736.657,
    "text": "And then what you want to do is find the parameter values in the model,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4737.512,
    "end": 4746.297,
    "text": " Um, say like values for precision or values for prior expectations or values for, um, habit distributions, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4746.317,
    "end": 4753.901,
    "text": "That E thing that, um, I'm not going to probably, I won't use either in this example, but, but just things like that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4753.941,
    "end": 4757.563,
    "text": "Where different things in a model could take on different values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4758.123,
    "end": 4761.005,
    "text": "And based on those values, the agent will act differently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4761.265,
    "end": 4762.366,
    "text": "It'll make different choices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4763.106,
    "end": 4766.928,
    "text": "And so what you want to do is take the behavior of an actual participant,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4767.506,
    "end": 4773.007,
    "text": " and then find the values for those parameters that best reproduce their behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4776.508,
    "end": 4790.632,
    "text": "And then once you have those parameters that best reproduce a given person's behavior, and you do that for all the participants, then you can just use those values, those parameter values, as individual difference measures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4790.692,
    "end": 4795.733,
    "text": "You might say, like, if one person has a higher precision, a higher",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4796.385,
    "end": 4814.178,
    "text": " a matrix precision than another person, you know, does that predict something about, um, for instance, how well they're going to respond to a treatment like in computational psychiatry, or can that tell you something about, um, you know, some other cognitive function or, I mean, you know, et cetera, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4814.878,
    "end": 4820.302,
    "text": "Um, and, um, so the goal again is to get people to that point where they can do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4821.966,
    "end": 4827.828,
    "text": " And like I said before, this is the kind of thing that people have been doing for a long time in reinforcement learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4829.008,
    "end": 4830.029,
    "text": "But it's new.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4830.149,
    "end": 4835.651,
    "text": "It's a novel, sort of not very common thing yet to do an active inference because not enough people know how to do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4837.311,
    "end": 4841.973,
    "text": "And so, you know, I can give you examples here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4842.153,
    "end": 4847.654,
    "text": "If I can get my... What the... Oh.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4848.535,
    "end": 4848.695,
    "text": "It's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.089,
    "end": 4855.67,
    "text": " I don't know why this is not letting me advance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.152,
    "end": 4861.472,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4862.333,
    "end": 4879.58,
    "text": "So, you know, in these tasks and very, you know, in another session, we'll, you know, walk you through how to build like a perceptual task that's like widely used for like EEG research, as well as neuroimaging research more broadly, but called like an oddball task, which is primarily a perception task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4881.224,
    "end": 4886.648,
    "text": " And there are also sorts of inferential, like prospective decision-making tasks that you can use that don't involve learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4887.269,
    "end": 4892.993,
    "text": "And then there are tasks that, you know, that use reinforcement learning or explore exploit dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4894.154,
    "end": 4897.276,
    "text": "And then you can also use it with neuroimaging, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4897.296,
    "end": 4907.043,
    "text": "You could say like trial by trial, where are the prediction errors, you know, in the brain, what parts of the brain look like they're doing the free energy minimization, you know, trial by trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4907.063,
    "end": 4909.745,
    "text": "So there's things like that that you can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4914.499,
    "end": 4930.47,
    "text": " okay um and so sorry what just that that really reminds me of just to pull back a level making measurements of a biological system like gene expression or neuroimaging and then saying what gene is upregulated in people who have this condition or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4931.03,
    "end": 4933.411,
    "text": " what brain region is activated in this condition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4933.972,
    "end": 4939.775,
    "text": "And we're taking that beyond the simply descriptive, beyond the just measure and do a t-test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4940.315,
    "end": 4945.498,
    "text": "And we're thinking about these observations, these behavioral phenotypes as being emitted",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4946.658,
    "end": 4965.054,
    "text": " often across tasks potentially or across modalities emitted by a generative model that has these higher level parameters that shape the way that the person or the organism responds to stimuli under a certain specific framing of a time and task dependent model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4965.554,
    "end": 4968.517,
    "text": "Just to sort of pull back a level and give that, but continue Ryan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4970.278,
    "end": 4974.302,
    "text": "So, so I just want to say that, you know, there are, this is kind of a new",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4974.912,
    "end": 4975.873,
    "text": " a new thing to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.113,
    "end": 4977.333,
    "text": "Not very many people have done it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4978.474,
    "end": 4984.937,
    "text": "You know, my lab has kind of been trying to kind of get this approach out there more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4986.298,
    "end": 4992.101,
    "text": "And so, I mean, here's some example papers that just do each of the things that I mentioned, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4992.181,
    "end": 5002.807,
    "text": "So this one on the right here, it's a recent class computational biology paper is using active inference primarily just for a perceptual model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5003.916,
    "end": 5008.78,
    "text": " And with that one, we were just looking at actually interoceptive processes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5008.8,
    "end": 5021.429,
    "text": "So, for instance, every time people feel a heartbeat and then indicate by pushing a button that they feel their heartbeat, you know, who does better than that than others and why, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5021.569,
    "end": 5027.073,
    "text": "And some people might have stronger prior expectations that they are or are not going to feel a heartbeat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5027.713,
    "end": 5031.396,
    "text": "And some people instead might just have different levels of sensory precision, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5031.436,
    "end": 5031.556,
    "text": "Like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5031.92,
    "end": 5035.903,
    "text": " they treat the signal coming up from their body as more or less precise, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5035.963,
    "end": 5037.243,
    "text": "So that's like one example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5037.263,
    "end": 5049.251,
    "text": "This paper in drug and alcohol dependence was a learning, an action, or a explore, exploit, and reinforcement learning task that was applied to people in substance use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5050.652,
    "end": 5057.977,
    "text": "And then this one in the lower left, it's greater decision uncertainty paper, is an example of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5058.89,
    "end": 5062.532,
    "text": " purely just sort of planning, like decision-making inferential model without learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5063.812,
    "end": 5074.677,
    "text": "And then Philip Schwartenbeck's paper up here on the right is an example of using active inference to look for the neural correlates of particular model parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5076.237,
    "end": 5085.861,
    "text": "So for instance, with the drug and alcohol dependence paper, it just used this simple explore-exploit task where people had three options.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5085.901,
    "end": 5087.342,
    "text": "They could push button one, two, or three,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5088.137,
    "end": 5090.999,
    "text": " And then you get either a green or a red ball would kind of fall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5091.459,
    "end": 5093.541,
    "text": "And green meant they won and red meant they lost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5094.061,
    "end": 5100.646,
    "text": "And initially they didn't know, you know, what the probability was of winning or losing for each button.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5101.427,
    "end": 5106.33,
    "text": "So the first few choices they had to kind of explore, right, to figure out which one's giving the most greens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5106.931,
    "end": 5111.654,
    "text": "I mean, eventually they become confident that one of them is best and they kind of stick to that one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5113.376,
    "end": 5113.876,
    "text": "And I won't go",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5114.292,
    "end": 5128.075,
    "text": " through it, but you can specify a particular version of the graphical models that Chris showed that generate appropriate behavior like participants do on this task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5129.656,
    "end": 5143.779,
    "text": "And again, I won't really go through this, but this is what the likelihood or A matrix would look like that they would wear over time, they would learn these A zero values that basically say, if I choose",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5144.546,
    "end": 5173.143,
    "text": " slot machine one two or three what's the probability that that's going to generate uh this row the observation for this row which is a win or the observation for this row which is a loss and then the c vector here the one that encodes reward just says whatever the cr value is which would be a positive number just says i prefer winning versus losing by some amount um and then this is the equation for learning and then this is just showing um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5174.505,
    "end": 5176.746,
    "text": " So just showing the expected free energy equation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5177.706,
    "end": 5188.01,
    "text": "And again, this isn't the example I'm going to work through, but what you could do, I'll skip that, is you could find that people with substance use showed lower action precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5188.03,
    "end": 5189.971,
    "text": "In other words, the behavior was a little more random.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5190.531,
    "end": 5198.034,
    "text": "They showed higher learning rates for wins and slower learning rates for losses compared to healthy people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5198.054,
    "end": 5203.136,
    "text": "So you can tell this interesting story about, hey, if people with substance use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5203.931,
    "end": 5223.495,
    "text": " learn more slowly whenever a bad thing happens when they take the drug, but they learn more, you know, more quickly every time they feel good right after taking a drug, then, um, their behavior is going to have a much harder time stop stopping, uh, taking, taking a drug, um, despite the fact that it has negative consequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5224.415,
    "end": 5232.597,
    "text": "Um, you know, and so you can fit, uh, these are just group estimates just showing in a Bayesian way that learning rate for losses was, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5234.192,
    "end": 5261.772,
    "text": " different um in people with uh substance use than healthy people um and uh the example for just uh planning and decision making without learning this was a uh an approach avoidance conflict task basically people just had to decide where to move this little uh avatar dude on uh along this little runway line and the closer they were to like the sun uh and uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5262.273,
    "end": 5264.034,
    "text": " and a bar that had lots of red.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5264.214,
    "end": 5268.096,
    "text": "That meant they were going to see a nice, happy image, and they were going to win some points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5268.176,
    "end": 5272.358,
    "text": "The more red in the rectangle thing, the more points they would win.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5273.098,
    "end": 5278.48,
    "text": "And a rainy cloud meant they were going to see a really terrible picture and hear a terrible sound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5279.681,
    "end": 5288.645,
    "text": "So in some cases, they would need to say, OK, I'm willing to go through seeing this really negative, aversive thing to win a lot of points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5289.372,
    "end": 5290.353,
    "text": " or not, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5290.393,
    "end": 5303.699,
    "text": "So in this model, it's just trying to say, you know, they start in the middle, for example, you know, how close do they decide to get to one side or the other, which controls the probability of getting what's on one side or the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5303.719,
    "end": 5305.76,
    "text": "So it's just planning where to move, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5305.78,
    "end": 5310.062,
    "text": "There's no learning because they already know exactly what the rewards and punishments are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5311.663,
    "end": 5316.185,
    "text": "And so in that case, again, I won't go through this, but you can specify a generative model for this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5317.152,
    "end": 5323.415,
    "text": " In a similar way, you can run simulations of what people will do under different parameter values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5323.495,
    "end": 5329.338,
    "text": "This beta thing is the expected precision for expected free energy precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5330.639,
    "end": 5337.202,
    "text": "And EC here is just how much they like the reward, like the points relative to how much they dislike the negative images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5337.222,
    "end": 5339.704,
    "text": "And we just called that emotion conflict.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5341.225,
    "end": 5342.005,
    "text": "That's just another way of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5342.406,
    "end": 5343.426,
    "text": " presenting the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5343.486,
    "end": 5344.346,
    "text": "I won't go through that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5344.867,
    "end": 5360.47,
    "text": "But here, again, you can show, for example, that people with depression and people with substance use showed less emotion conflict than healthy people, and they showed greater decision uncertainty than healthy people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5360.51,
    "end": 5367.772,
    "text": "They showed they had lower expected free energy precision, which corresponds to higher beta values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5367.792,
    "end": 5370.253,
    "text": "So that's just another example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5371.948,
    "end": 5372.473,
    "text": " I think.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5373.03,
    "end": 5379.391,
    "text": " One thing that, from the presenter view, you can't see questions, but now that I'm not in presenter view, I can see that Daniel had his hand up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5379.571,
    "end": 5380.472,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5381.032,
    "end": 5381.512,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5381.832,
    "end": 5384.152,
    "text": "Just, yes, this is great stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5384.172,
    "end": 5386.553,
    "text": "I just want to highlight a few pieces here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5386.973,
    "end": 5399.675,
    "text": "So with that same task, you could imagine a purely descriptive model and a paper being written on something like, people who have X diagnosis are more likely to approach when there's conflict or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5399.976,
    "end": 5401.696,
    "text": "So that would be a purely descriptive...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5402.236,
    "end": 5425.336,
    "text": " finding based upon the same exact data now what this tutorial is about is using the exact same behavioral data within and across participants and then modeling underlying parameters that have a very specific graphical layout and relatedness so here we're talking about a t-test basically being used on a summary statistic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5425.876,
    "end": 5451.919,
    "text": " so they're not just different in the descriptive outcomes like this group was more likely to gamble on red this is like saying this group had a higher hidden state variable that we're going to attach to what we're going to call like gambling propensity now that relates to a question from the chat which is um and a really important question how are the neurobiological interpretation of the agent's generative model parameter estimates",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5453.055,
    "end": 5455.536,
    "text": " done with respect to the parameter model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5455.576,
    "end": 5470.201,
    "text": "So how do we go from a summary statistic or a graphical model estimate to a neurobiological interpretation, let alone intervention, um, or anything like that, but just mainly the interpretation side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5471.801,
    "end": 5478.964,
    "text": "Um, so, so we have a whole, a whole section in the tutorial on the neural process theory that's associated with active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5479.711,
    "end": 5487.055,
    "text": " Um, that's something that we're going to, uh, that was, we plan to talk about in, uh, another session, um, probably in part two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5487.075,
    "end": 5505.466,
    "text": "Um, so I'm probably gonna hold off on describing that in detail right now, but the, the kind of quick version, um, is that, uh, the, the process, the neural process theory just makes certain assumptions about how, uh, neurons can be connected up to do this kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5506.246,
    "end": 5507.607,
    "text": "Um, you know, so for example,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5508.485,
    "end": 5518.65,
    "text": " Um, there's a, you can have different rates at which your beliefs change rates with which the, with your distribution over States, um, becomes more or less precise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5519.57,
    "end": 5526.514,
    "text": "Um, and you know, the, the neural process theory says that the, for instance, the, the sorts of ERPs that you would measure, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5526.554,
    "end": 5535.798,
    "text": "The changes and the changes in, uh, the magnitude of change in the, uh, neural activation that you would see would correspond to the rate of change in, in those beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5536.445,
    "end": 5540.486,
    "text": " Essentially, you can think about it as how quickly prediction error is being minimized as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5542.046,
    "end": 5561.71,
    "text": "Whereas the updates to this beta thing, trial by trial, are modeled as the phasic dopamine spikes that are essentially updating how much the expected free energy controls action policy selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5561.73,
    "end": 5563.75,
    "text": "So there is just a neural process theory that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5566.701,
    "end": 5580.088,
    "text": " proposes one way in which the variational message passing that underlies these models, how that could be implemented in early and therefore what sorts of signals you ought to measure in the brain if that process theory was correct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5580.708,
    "end": 5587.832,
    "text": "But it's really important to recognize that there are several different possible process theories that you could come up with, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5587.952,
    "end": 5595.716,
    "text": "So there's many different ways you could connect a bunch of neurons up together to implement these sorts of models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5596.331,
    "end": 5601.533,
    "text": " So there's like a lot of different levels of study here, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5601.593,
    "end": 5605.215,
    "text": "There's what generative model best describes task behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5605.235,
    "end": 5613.398,
    "text": "And then there's given that model, what of a bunch of different message passing algorithms is the one that is being used?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5614.038,
    "end": 5622.641,
    "text": "And then there's the question about given that it's this message passing algorithm, you know, there's a bunch of different possible ways the brain could implement that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5622.762,
    "end": 5623.922,
    "text": "So which one is the right one?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5624.654,
    "end": 5631.885,
    "text": " So there's many different levels of empirical questions that you can ask at each of these different levels of description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5632.762,
    "end": 5658.821,
    "text": " yep what i'll say to that is that the relationship between the free energy principle and active inference again as a process theory it means something uh within the philosophy of science literature so check out the alias 2018 interview with carl friston myself and marching forger or the recent paper of mel andrews because basically the process theory makes specific falsifiable testable hypotheses",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5659.341,
    "end": 5665.005,
    "text": " So that's the kind of thing you could actually then say, dopamine, use this kind of tool and you should expect to see this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5665.465,
    "end": 5669.468,
    "text": "And that's why this is a little bit more towards the data focused empirical end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5669.788,
    "end": 5670.768,
    "text": "So continue, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5671.789,
    "end": 5671.989,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5672.309,
    "end": 5685.558,
    "text": "But like I said, I mean, we'll go into it, you know, task models will make specific predictions about what kind of ERPs, you know, you would measure in EEG, you know, during certain tasks or same thing with like fMRI responses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5686.038,
    "end": 5688.58,
    "text": "And so, but anyway, we'll get into that in another session.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5689.816,
    "end": 5691.597,
    "text": " So this is another example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5691.657,
    "end": 5698.222,
    "text": "Again, I'll walk you through these really briefly, but that's another generative model we built for this heartbeat perception task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5698.923,
    "end": 5714.735,
    "text": "And what we found here was that in a certain condition, a certain high arousal condition, healthy people showed higher precision, higher interoceptive precision, whereas a bunch of different clinical groups didn't show any change in precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5715.601,
    "end": 5729.746,
    "text": " Again, it's just showing differences here in the way the brain treats signals coming up from the body when in a high arousal state, or really a state where they're having to hold their breath for a long period of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5730.346,
    "end": 5732.027,
    "text": "You can also estimate prior expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5732.107,
    "end": 5733.267,
    "text": "Those didn't differ by group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5734.708,
    "end": 5741.991,
    "text": "Then finally, this is an example of using active inference for neuroimaging that Philip Schortenbeck did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5743.666,
    "end": 5749.067,
    "text": " he was looking at the beta plus gamma updates, the expected free energy precision updates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5749.627,
    "end": 5763.329,
    "text": "And he showed that trial by trial, those updates did correlate with these midbrain region, with this midbrain region that is where a chunk of that region is where a bunch of dopamine neurons are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5763.91,
    "end": 5771.351,
    "text": "So sort of consistent with this kind of idea that phasic dopamine responses are the ones encoding these changes in expected free energy precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5773.379,
    "end": 5777.022,
    "text": " Anyway, so those are just a bunch of examples of the way that this kind of thing has been used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5777.863,
    "end": 5780.164,
    "text": "And I should point out that this is all just within the last couple of years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5780.204,
    "end": 5781.025,
    "text": "This is very recent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5782.446,
    "end": 5797.578,
    "text": "So the task that I'm going to walk you through how to actually build it, and we'll see how much time we actually have to go through this, is a pretty simple task where the participant just starts in the start state and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5798.157,
    "end": 5804.2,
    "text": " Initially, they don't know anything about, they have to choose one of two of these slot machines, the one on the left or the one on the right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5805.281,
    "end": 5813.465,
    "text": "And they don't know, I have no idea to start with on trial one, which one is more likely to give a reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5814.025,
    "end": 5821.969,
    "text": "And if you're in the left better context, then that means that choosing the left slot machine will win 80% of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5822.43,
    "end": 5824.931,
    "text": "And if you're in the right better context,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5825.635,
    "end": 5830.217,
    "text": " then choosing the right slot machine will give you the reward, um, 80% of the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5830.237,
    "end": 5840.622,
    "text": "Um, and so crucially, if on the first time step, they just choose a slot machine, then, uh, they could, they'll win $4 if they're right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5841.422,
    "end": 5845.905,
    "text": "Um, but the other things that'd be kind of like the reward seeking thing, you know, they want as much money as possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5846.705,
    "end": 5850.867,
    "text": "Um, but what they can also do is they can first ask for this hint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5851.687,
    "end": 5853.008,
    "text": "If they choose to ask for the hint,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5853.675,
    "end": 5855.916,
    "text": " it will tell them what context they're in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5856.016,
    "end": 5857.956,
    "text": "It will tell them whether it's left better or right better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5858.596,
    "end": 5862.458,
    "text": "And then they can choose one of the two slot machines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5862.498,
    "end": 5867.539,
    "text": "And again, they'll win 80% of the time if they choose the right one based on the hint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5868.279,
    "end": 5875.722,
    "text": "But crucially, if they take the hint first, then they'll only win $2 if they get it right instead of four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5875.842,
    "end": 5877.542,
    "text": "So in other words, taking the hint is costly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5879.183,
    "end": 5880.443,
    "text": "So you can think of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5881.109,
    "end": 5890.315,
    "text": " choosing one of the slot machines right away as being this kind of reward seeking thing, where it's also risk seeking because you don't know ahead of time which one's the right one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5891.095,
    "end": 5897.96,
    "text": "Or you can do this information seeking thing where you choose the hint first, even though that'll get you less money, but you'll be more confident in which one's right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5899.841,
    "end": 5908.066,
    "text": "So it's set up specifically to have this information gain component by choosing the hint and the reward seeking component by choosing one of the two slot machines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5909.498,
    "end": 5917.026,
    "text": " The question is, how would you actually in practice build a model of this task?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5917.347,
    "end": 5919.069,
    "text": "There's going to be some basic steps to do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5919.89,
    "end": 5925.196,
    "text": "One is to define whatever your initial state priors are, and that's going to be that D thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5927.458,
    "end": 5928.86,
    "text": "We'll go into this more with the learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5930.256,
    "end": 5935.179,
    "text": " Big D, if you use both big D and little d, big D is kind of like the true generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5936.019,
    "end": 5939.161,
    "text": "You know, the real thing out in the world that are generating the observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5940.342,
    "end": 5944.524,
    "text": "And little d, if you use it, is what's in the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5944.564,
    "end": 5947.065,
    "text": "So the agent's beliefs, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5947.145,
    "end": 5949.547,
    "text": "And those two can be... So big D and little d can be different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5949.727,
    "end": 5954.449,
    "text": "If big D and little d are the same, that means that the agent's beliefs are accurate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5956.41,
    "end": 5957.451,
    "text": "And so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5958.479,
    "end": 5965.645,
    "text": " If you want the agent to learn or to have different prior expectations than what the true ones are, then you have to use this little d thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5967.406,
    "end": 5968.107,
    "text": "Same thing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5968.287,
    "end": 5978.535,
    "text": "We have to define the likelihood or the state outcome mapping, and that's going to be our big A and our little a if we want it to learn and have different beliefs than the true ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5979.996,
    "end": 5982.699,
    "text": "We have to define the preferences over outcomes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5982.719,
    "end": 5984.22,
    "text": "So that's going to be the C thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5985.097,
    "end": 5988.779,
    "text": " then we have to define the possible transitions or actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5990.12,
    "end": 5996.484,
    "text": "And so if there's just one transition matrix for a factor, that just means the agent has no control over what it does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5997.585,
    "end": 6012.415,
    "text": "But if there's a state factor that can have multiple possible transitions where each transition is like an action, then the agent can choose policies that correspond to different transition sequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6013.876,
    "end": 6014.456,
    "text": "So for instance,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6015.097,
    "end": 6015.818,
    "text": " Well, I'll just show you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6016.878,
    "end": 6023.824,
    "text": "But then for V here, the last thing you have to define is policies, which is this thing V in the code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6024.444,
    "end": 6036.373,
    "text": "And that's going to be specifying different sequences of B matrices, different sequences of possible transitions that could happen over the course of the trial, and that the agent could choose one of those transition sequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6036.393,
    "end": 6038.975,
    "text": "To just jump in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6040.527,
    "end": 6042.348,
    "text": " really quickly for each of those.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6042.749,
    "end": 6050.313,
    "text": "Then if, if there's, uh, you know, if I'm talking about a different outcome modality, I would have, I would have to have one of those parameters for each outcome modality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6050.373,
    "end": 6050.973,
    "text": "Is that correct?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6051.833,
    "end": 6060.478,
    "text": "Um, you would need to have, so there's going to be one, uh, uh, a matrix, um, for each outcome modality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6060.498,
    "end": 6067.082,
    "text": "Um, and that's just going to say what, uh, what outcomes are going to most likely to be generated, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6068.291,
    "end": 6070.472,
    "text": " given each combination of states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6071.692,
    "end": 6075.393,
    "text": "So given the value of each state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6076.534,
    "end": 6079.995,
    "text": "And these are things that come up in experimental design, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6080.055,
    "end": 6085.056,
    "text": "So like the probability that a given machine would dispense a winning ticket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6085.296,
    "end": 6089.457,
    "text": "That's something I should be thinking about as the empirical person designing my experiment, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6089.938,
    "end": 6090.638,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6091.018,
    "end": 6094.339,
    "text": "So I'll show you here, but right, so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6094.847,
    "end": 6101.092,
    "text": " Typically, you can do it other ways, but typically, this likelihood thing is what would define the reward probabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6102.013,
    "end": 6119.828,
    "text": "So you'd say, given that I'm in the state of having chosen the left slot machine, that will generate the reward observation with 0.8 and the not reward observation as 0.2, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6120.289,
    "end": 6121.77,
    "text": "So I'm just saying the reward probability is 80%.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6123.988,
    "end": 6132.593,
    "text": " And the agent would, if you want them to learn those reward probabilities, then you'd specify one of these little a things, and then you'd have it learn it over repeated observations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6134.394,
    "end": 6140.878,
    "text": "It's such a critical and really fascinating point that reward isn't absent from the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6141.038,
    "end": 6145.901,
    "text": "Through the preference vector c, it's baked into how policy is calculated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6146.843,
    "end": 6155.906,
    "text": " And so it's like the agent is pursuing precision, all things being equal through natural selection, unsuccessful models are just not gonna exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6156.406,
    "end": 6161.028,
    "text": "And models that don't see themselves performing behavior are not gonna be active for long.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6161.468,
    "end": 6170.091,
    "text": "So under a model of a successful preference, then there's just a convergence towards that with whatever affordances are at hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6170.791,
    "end": 6174.713,
    "text": "So it's just a really interesting way to see how reinforcement",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6175.453,
    "end": 6179.975,
    "text": " learning situations, um, can be adapted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6180.316,
    "end": 6187.899,
    "text": "So the 18 minutes, some of the, some of the gets a little bit more into the kind of like free energy philosophy stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6187.96,
    "end": 6195.043,
    "text": "But, but I mean, yes, like the assumption is that, uh, people inherit preferences that keep them alive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6195.804,
    "end": 6203.387,
    "text": "Um, but, uh, but in, in kind of like an empirical task context, you just use the C vector to just define what counts as the reward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6203.407,
    "end": 6204.268,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6204.807,
    "end": 6206.968,
    "text": " You know, so it could be anything, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6206.988,
    "end": 6207.929,
    "text": "It could be winning money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6207.969,
    "end": 6211.231,
    "text": "It could be winning points, even if it doesn't give you money, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6211.271,
    "end": 6214.974,
    "text": "It could be like seeing a positive image, you know, anything like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6215.014,
    "end": 6217.335,
    "text": "You just define what the preference distribution is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6218.356,
    "end": 6219.817,
    "text": "And then usually you parameterize it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6219.837,
    "end": 6226.801,
    "text": "So you fit that as a parameter to see essentially how much does the person like, you know, winning $2, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6228.142,
    "end": 6229.723,
    "text": "And I'll show you that in a second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6231.064,
    "end": 6232.485,
    "text": "But yeah, so...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6233.154,
    "end": 6240.318,
    "text": " You're going to need one A matrix and one C matrix for each output modality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6241.759,
    "end": 6250.464,
    "text": "You're going to need one D vector and at least one B matrix for each state factor to answer the original question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6253.485,
    "end": 6261.95,
    "text": "The first thing here is the way that I decided to build the model for this task is the first,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6262.79,
    "end": 6265.632,
    "text": " hidden state factor is the context, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6265.672,
    "end": 6271.395,
    "text": "So am I in the state where the left one is better or am I in the state where the right one is better?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6272.335,
    "end": 6275.717,
    "text": "And I started that out specifying this little D here thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6275.737,
    "end": 6279.419,
    "text": "And the brackets just say the number of the state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6279.499,
    "end": 6283.201,
    "text": "So this is D for state factor, priors over states for state factor one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6283.942,
    "end": 6287.223,
    "text": "And there's two different possible states, left better or right better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6287.244,
    "end": 6291.586,
    "text": "And I just specified these as two really small numbers, which just says,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6292.202,
    "end": 6297.527,
    "text": " it's an even probability that it's going to be the left one or the right one is better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6298.067,
    "end": 6299.208,
    "text": "But these are really small.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6299.268,
    "end": 6304.513,
    "text": "And so I'm not confident at all about whether that distribution is right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6305.714,
    "end": 6308.016,
    "text": "And I'll explain more about that when we get to the learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6308.036,
    "end": 6313.48,
    "text": "Because this will be soft maxed during inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6313.54,
    "end": 6317.644,
    "text": "So this will become 0.5, 0.5 during inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6318.345,
    "end": 6319.886,
    "text": "But when you learn, you sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6320.347,
    "end": 6328.112,
    "text": " build up the numbers here so they become bigger numbers, which means the agent learns to be more confident in what the distribution is that it believes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6329.853,
    "end": 6333.196,
    "text": "But then I can also specify big D, right, which is the generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6333.776,
    "end": 6338.079,
    "text": "And I just put this as one and zero, which means that the true context is that the left one's better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6340.08,
    "end": 6345.263,
    "text": "So that's what I would use to set up the priors for state factor one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6346.304,
    "end": 6347.385,
    "text": "State factor two here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6348.366,
    "end": 6350.568,
    "text": " If you can see at the bottom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6352.249,
    "end": 6353.069,
    "text": "So, hold on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6353.67,
    "end": 6355.331,
    "text": "Can you guys see this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6355.411,
    "end": 6356.692,
    "text": "Or can you guys see the bottom?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6356.712,
    "end": 6359.173,
    "text": "Because in mine, I can see my bottom.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6359.193,
    "end": 6361.575,
    "text": "We only see one line of code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6362.596,
    "end": 6362.876,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6362.916,
    "end": 6363.836,
    "text": "The D2 line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6364.797,
    "end": 6365.137,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6365.317,
    "end": 6368.92,
    "text": "I'm just asking, do you see this search down here and all that stuff?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6369.06,
    "end": 6369.66,
    "text": "It's perfect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6369.68,
    "end": 6370.141,
    "text": "It's perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6370.221,
    "end": 6370.461,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6370.621,
    "end": 6371.201,
    "text": "There, now it's gone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6371.481,
    "end": 6372.642,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6372.882,
    "end": 6375.324,
    "text": "So, then D2 is the second.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6376.032,
    "end": 6376.893,
    "text": " hidden state factor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6377.053,
    "end": 6379.875,
    "text": "And that's the one that corresponds to your choices, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6379.995,
    "end": 6383.858,
    "text": "So this is a one here, which means it always starts out in the start state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6384.059,
    "end": 6389.583,
    "text": "The first column here is the start state, and then it can either transition into the hint state, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6389.603,
    "end": 6390.784,
    "text": "Which is the second one here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6390.904,
    "end": 6391.745,
    "text": "I just define that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6392.546,
    "end": 6397.309,
    "text": "Um, and then the third one is the choose the left slot machine state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6397.349,
    "end": 6399.391,
    "text": "And the fourth one is choose the right slot machine state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6400.232,
    "end": 6400.292,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6401.098,
    "end": 6407.943,
    "text": " So this just says at time one, my prior is with 100% certainty that I'm going to start in the start tape of the task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6409.544,
    "end": 6411.525,
    "text": "So that's actually pretty simple, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6412.105,
    "end": 6418.409,
    "text": "So then the next thing you're going to do is you're going to have to specify the likelihood, so the A matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6419.63,
    "end": 6422.272,
    "text": "And I'm not going to show you the complete one yet until we go into the code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6422.292,
    "end": 6423.633,
    "text": "I'm just going to show you the parts that matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6425.194,
    "end": 6428.276,
    "text": "But so for the second state factor,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6428.809,
    "end": 6443.541,
    "text": " So for the second outcome modality, so the likelihood mapping for A2 is going to be this thing where the first row corresponds to null, which is just it hasn't won or lost yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6444.181,
    "end": 6449.526,
    "text": "The second row is the observation that it lost, and the third row is the observation that it won.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6449.546,
    "end": 6455.41,
    "text": "And each of the columns here correspond to the state factor values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6455.45,
    "end": 6457.212,
    "text": "So the left column here corresponds to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6457.847,
    "end": 6465.152,
    "text": " the D one, you know, this thing, you know, uh, so the 0.25 here for left better for the left better state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6465.773,
    "end": 6472.318,
    "text": "And the right one here is the one that corresponds to the light better state, um, which maps onto column two here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6472.818,
    "end": 6485.147,
    "text": "So the way that you would read this matrix is that if you were in the right state, right, better state, then you would, uh, win with this probability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6485.854,
    "end": 6488.495,
    "text": " and you would lose with this probability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6490.095,
    "end": 6494.737,
    "text": "Or if you were in the left one, then you would lose with that probability and win with that probability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6494.757,
    "end": 6497.857,
    "text": "Are columns of that soft maxed?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6498.298,
    "end": 6499.718,
    "text": "Are those distributions?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6500.338,
    "end": 6502.719,
    "text": "Yeah, the columns are soft maxed, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6503.139,
    "end": 6511.681,
    "text": "Again, if you're using, I mean, to get a little technical, if you're using little a, so these are Dirichlet distributions, then it will build up counts, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6511.761,
    "end": 6513.942,
    "text": "So these numbers could become like, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6514.366,
    "end": 6522.088,
    "text": " like 50, 25, eight, you know, whatever, but those are that encode the confidence in those distributions, but yeah, they'll get softmax for inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6522.828,
    "end": 6535.552,
    "text": "Um, um, so then, so then you'd have to also specify the C matrix for that state factor, or I mean that outcome modality, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6535.592,
    "end": 6537.433,
    "text": "So C2 is going to correspond to A2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6537.593,
    "end": 6540.293,
    "text": "Basically it's for the sec, they're both for the second outcome modality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6541.154,
    "end": 6542.374,
    "text": "Um, and here again,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6542.938,
    "end": 6549.423,
    "text": " Rows are going to be observations, but here the, uh, the rows correspond to time points in the trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6550.464,
    "end": 6558.19,
    "text": "Um, so basically this is just saying that, um, at time zero or at time one, I have no preference for anything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6559.07,
    "end": 6566.036,
    "text": "Um, at time two, I have a negative preference for losing and I have a positive preference for winning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6566.636,
    "end": 6568.638,
    "text": "And this RS thing is just a parameter, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6568.678,
    "end": 6570.099,
    "text": "So we can say this LA thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6570.119,
    "end": 6571.78,
    "text": "So loss aversion is one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6572.315,
    "end": 6575.016,
    "text": " So it doesn't want to lose with negative one, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6576.077,
    "end": 6581.559,
    "text": "And for RS, we say RS equals four, which is, you can think of as the $4, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6582.139,
    "end": 6588.702,
    "text": "And then so if it observes the win at time two, then it's going to prefer that with a value of four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6589.663,
    "end": 6597.206,
    "text": "And if it gets it at time three, then it's going to be RS divided by two, which means at time three, if it gets it, it's only going to win $2, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6597.326,
    "end": 6600.107,
    "text": "Or whatever the relative values are for the person, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6600.127,
    "end": 6601.748,
    "text": "You could fit RS",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6602.386,
    "end": 6607.628,
    "text": " for a given person to see how much they prefer $4 over two, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6609.528,
    "end": 6615.21,
    "text": "And these also in the code are soft maxed and then logged.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6616.171,
    "end": 6618.431,
    "text": "So they become log probabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6620.152,
    "end": 6623.953,
    "text": "So that's just saying how much you dislike losing and how much you want to win.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6624.713,
    "end": 6626.074,
    "text": "And again, you can set those as parameters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6628.234,
    "end": 6629.535,
    "text": "And then for...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6630.336,
    "end": 6659.573,
    "text": " state out for outcome modality one which is the getting the hint right you can have no hint you can have the hint that the left machine is better and the hint that the right machine is better right so those are both observations and then you can say uh with this pha thing you can say basically how how informative is the hint right like if i observe the machine left hint does that tell me with certainty that the left one's better or does it just tell me with some probability that the left one's better",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6660.416,
    "end": 6682.343,
    "text": " Um, and here you could just set this as a being, you know, like you could just set, uh, this is like ones and zeros, um, to just, to just tell you, uh, basically that would just say, uh, if PHA was one, then that would just say that the, uh, the thing is a hundred percent, uh, accurate, um, in telling you which one's better if you observe one hit versus another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6683.264,
    "end": 6686.745,
    "text": "Um, and, um, and so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6687.361,
    "end": 6694.526,
    "text": " then the next thing is you have to consider the possible actions or sequences of actions that are gonna correspond to policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6695.267,
    "end": 6715.921,
    "text": "And so here, the way to think about it is, so you're starting out in state one for state factor two, the action state factor, and you can either go from the start state immediately to choosing the right machine, or you can go immediately from the start to choosing the left machine, or you can choose to take the hint",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6716.55,
    "end": 6720.411,
    "text": " and then go to the right one or take the hint and then go to the left one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6721.831,
    "end": 6727.853,
    "text": "So those sequences of actions are the policies that are going to matter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6727.893,
    "end": 6730.333,
    "text": "They're going to encode what the agent can do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6731.554,
    "end": 6739.076,
    "text": "And so to do that, you have to set up different transition matrices, different B matrices that encode each of these actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6739.416,
    "end": 6744.097,
    "text": "Transitioning from one to four, transitioning from one to three, transitioning from one to two,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6744.926,
    "end": 6747.127,
    "text": " transitioning from two to four and two to three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6747.927,
    "end": 6763.511,
    "text": "And so that's going to correspond to setting up these B matrices, which here, so B1, right, which is the state factor for which slot machine is better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6764.472,
    "end": 6772.994,
    "text": "This is just going to be an identity matrix, which basically just says that the left better context is constant across the trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6773.669,
    "end": 6780.193,
    "text": " you know, it's not as if from time point one to time point two, the context is going to change or something like that, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6780.213,
    "end": 6787.336,
    "text": "So it just says the belief is, and it is true that each trial has a stable identity as being the left better one or the right better one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6789.197,
    "end": 6798.402,
    "text": "But for state factor two, so B2 here, that's where you want the agent to have different possible actions, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6798.442,
    "end": 6801.024,
    "text": "So B2 colon colon one,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6802.171,
    "end": 6805.593,
    "text": " So the third dimension being the different possible action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6807.053,
    "end": 6816.557,
    "text": "The first one would be like this, which basically just says columns are states at time t and rows are states at time t plus 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6818.418,
    "end": 6825.321,
    "text": "So this just says I can start in any state, so in any column, and choose to move to state 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6827.389,
    "end": 6832.412,
    "text": " This one says I could start in any column and move to state two, so taking the hint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6833.192,
    "end": 6838.215,
    "text": "This one says I can start in any column, so any state, and move to state three, which is using the left machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6838.815,
    "end": 6841.437,
    "text": "Then same thing here for moving to the right machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6841.457,
    "end": 6851.523,
    "text": "So there are four actions, one, two, three, and four, that correspond to four different third dimensions in the B matrix for state factor two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6852.643,
    "end": 6854.224,
    "text": "And so then, given those,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6857.95,
    "end": 6861.451,
    "text": " Given those, we specify V, which are the policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6862.971,
    "end": 6867.132,
    "text": "And here, the third dimension corresponds to which state factor?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6867.912,
    "end": 6872.413,
    "text": "So for this one, for state factor one, there are no actions, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6872.433,
    "end": 6874.753,
    "text": "It's just this one V matrix and its identity matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6875.714,
    "end": 6885.396,
    "text": "And here the rows are the action and the columns are, or sorry, the rows are the time point and the columns are the action, or the policy, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6887.096,
    "end": 6887.476,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6888.117,
    "end": 6891.66,
    "text": " the row here just means action moving from time one to time two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6892.481,
    "end": 6897.966,
    "text": "And this second row means the action from time two to time three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6897.986,
    "end": 6900.528,
    "text": "And so that is useless, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6900.588,
    "end": 6903.03,
    "text": "For state factor one, because there's just only one action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6904.131,
    "end": 6908.835,
    "text": "Whereas for state factor two, we have all the different possible action sequences, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6908.855,
    "end": 6913.72,
    "text": "So policy one would just be if the thing just decided to stay in the start state the whole time, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6913.76,
    "end": 6915.301,
    "text": "Like to just not do the trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6916.181,
    "end": 6930.305,
    "text": " Um, the other one would be action two, which is take the hint and then, and then take action three, which is moved to the left slot machine or take the hint it to the third column, take the hint and then move to four, which is the action of choosing the right slot machine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6930.325,
    "end": 6943.669,
    "text": "Um, and then here, this is just kind of a little bit of a trick, but you can choose to, uh, at time from one time to one to time two, you can immediately choose the left slot machine and then move back to the start state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6943.789,
    "end": 6944.729,
    "text": "So three and then one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6945.339,
    "end": 6972.294,
    "text": " same thing choose the right slot machine and then again move back to state one and the only reason for that move back to state one thing is is that um if you let the thing stay in state three and state four then it's as if it won four dollars and then won two dollars after that so you have to kind of move it back out of the state where it would win um so so then you know then you've built everything really um so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6973.212,
    "end": 6976.613,
    "text": " and you throw all of it in this little MDP structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6977.934,
    "end": 6982.335,
    "text": "So I didn't mention this, but you have to specify T, which is the number of time points in the trial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6982.875,
    "end": 6984.696,
    "text": "So in this case, it would be three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6985.956,
    "end": 6987.817,
    "text": "So start, take the hint, choose left.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6988.217,
    "end": 6989.597,
    "text": "Start, take the hint, choose right, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6989.617,
    "end": 6990.578,
    "text": "So there's three time points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6991.658,
    "end": 6993.699,
    "text": "V is just V, which is what we defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6994.619,
    "end": 7001.041,
    "text": "We'll ignore U for now, but that's what you would use if you wanted to specify one-step policies instead, but the thing doesn't look ahead at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7002.049,
    "end": 7014.572,
    "text": " Um, you know, and then ABC and D are just the different matrices we specified and we want it to learn D. Um, so we specify the little D. Um, and then these other things are just different parameters that you can set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7015.252,
    "end": 7020.913,
    "text": "Um, so ETA is the, as a learning rate, um, alpha is kind of like an action precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7020.993,
    "end": 7022.913,
    "text": "So it's basically an inverse temperature parameter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7022.933,
    "end": 7026.674,
    "text": "It controls how random someone's choices are given the policy that they choose.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7027.554,
    "end": 7030.875,
    "text": "Um, beta is the expected free energy precision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7031.459,
    "end": 7032.259,
    "text": " that we talked about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7032.919,
    "end": 7045.082,
    "text": "And these other two parameters, I won't really go into detail, but they just have to do with specifying the time constant, so basically how quickly evidence accumulates after an observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7045.362,
    "end": 7057.525,
    "text": "And this ERP thing is basically it controls certain assumptions about what ought to happen if you make a new observation each time with respect to what sorts of neural responses you would get.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7059.286,
    "end": 7060.446,
    "text": "And this is all explained in the code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7061.471,
    "end": 7069.814,
    "text": " I think that's a, it's a perfect pause point so that we can close within the hour and leave people with excitement for part two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7069.975,
    "end": 7074.416,
    "text": "So what can they look forward to in part two and beyond in a minute?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7075.577,
    "end": 7075.937,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7076.017,
    "end": 7090.283,
    "text": "So, I mean, I would just say that, you know, once, once you have this set up, then the next steps are to run this structure through this VBX underscore tutorial script, and that will actually run the model and, you know, simulate the behavior, the neural responses,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7090.987,
    "end": 7102.151,
    "text": " And then we'll show you how to use plotting scripts to display and show the behavior that was the outcome of the simulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7102.171,
    "end": 7112.854,
    "text": "And then we'll show you how the MDP structure works and then actually show you some simulation results and how they work and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7112.874,
    "end": 7114.775,
    "text": "And actually probably walk you through some of the actual code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7116.556,
    "end": 7118.377,
    "text": " That was an amazing session.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7118.637,
    "end": 7122.119,
    "text": "Ryan, Christopher, Max, thanks so much for coming on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7122.399,
    "end": 7126.781,
    "text": "Everybody who was watching live and in replay, also very appreciated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7127.381,
    "end": 7133.004,
    "text": "So please leave a comment if you have a question or feedback for the authors or for anyone else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7133.684,
    "end": 7148.414,
    "text": " And stay in touch with us because we're going to be making this a multi-part series where we're going to be going deeper into the technical aspects and also highlighting use cases, hearing about people who are just learning programming, learning to apply it, people who are experts in other fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7148.454,
    "end": 7152.396,
    "text": "So whatever your perspective is, you're in the right spot to be learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7152.857,
    "end": 7157.94,
    "text": "So thanks again, all of you for coming on and we will see you another time.",
    "speaker": "SPEAKER_03"
  }
]