[
  {
    "start": 7.773,
    "end": 8.593,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.913,
    "end": 13.075,
    "text": "Welcome to the Active Inference Lab and to the Model Stream 2.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.335,
    "end": 16.517,
    "text": "Today's going to be a really awesome discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.657,
    "end": 19.538,
    "text": "So let's just introduce ourselves and get right into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.018,
    "end": 20.958,
    "text": "I'm Daniel Friedman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.098,
    "end": 23.9,
    "text": "I'm a postdoctoral researcher in Davis, California.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.32,
    "end": 24.54,
    "text": "Ryan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.521,
    "end": 26.641,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 26.661,
    "end": 27.801,
    "text": "So I'm Ryan Smith.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 28.161,
    "end": 32.343,
    "text": "I'm an associate investigator at the Laureate Institute for Brain Research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 34.892,
    "end": 35.834,
    "text": " Hi, I'm Christopher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 36.235,
    "end": 38.94,
    "text": "I'm a PhD student at the University of Cambridge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.944,
    "end": 46.475,
    "text": "And I'm Max Murphy, and I'll be starting my postdoctoral fellowship at Carnegie Mellon in hopefully a week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.714,
    "end": 48.014,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.254,
    "end": 56.82,
    "text": "Thanks to Ryan and Christopher, the authors, or two of the three authors of this paper for joining today and for Max for lending your expertise as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.501,
    "end": 67.427,
    "text": "So this is the second model stream in a multi-part series that is going to be highlighting perspectives and addressing questions related to applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.948,
    "end": 76.593,
    "text": "And so right now we're looking at the tutorial paper of Smith et al., a step-by-step tutorial on active inference and its application to empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.974,
    "end": 100.534,
    "text": " uh you can find in the video description so if you have any questions or thoughts or comments during the live stream type it in the youtube live chat and we'll be monitoring that and then if you have any questions after the live stream leave a comment on the video or get in touch with us another way and we'll try to address it in a future session and if you want to learn more or if you want to participate go to active inference.org",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.0,
    "end": 109.288,
    "text": " All right, so today in our second session, we're gonna be picking up with a brief overview and summary of where we're at, where we've been.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.809,
    "end": 120.661,
    "text": "We're gonna go through a few clarifying questions that have been raised in the last week, and then we're going to dive into the specific examples and into the code and do some code walkthrough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.701,
    "end": 121.862,
    "text": "So that will be really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.503,
    "end": 128.465,
    "text": " All right, so I'll just throw out the first opening question, which is who is this session for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.045,
    "end": 135.266,
    "text": "What kinds of tools and skills would you say are required and which kinds of tools or skills might be helpful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.287,
    "end": 139.427,
    "text": "Um, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 140.107,
    "end": 145.889,
    "text": "Well, um, I mean, I would say that the session and I mean, really the entire tutorial is for people who.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 147.582,
    "end": 169.584,
    "text": " I mean, mainly people who are just starting out, people who want to be able, who are interested in active inference, but maybe don't have a lot of background in mathematics, especially people coming from neuroscience and psychology backgrounds, for example, that want to, or people who do some computational modeling, but maybe simpler reinforcement learning models, things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 170.545,
    "end": 176.811,
    "text": " where active inference is kind of notoriously a little bit more kind of like black box, you know, it's harder to kind of break into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 176.831,
    "end": 192.226,
    "text": "A lot of people think that the models are described in a way that's kind of like opaque, you know, and so the idea was to give people the background needed and the actual example code that would be needed that could be adapted to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 193.271,
    "end": 200.716,
    "text": " build your own models, do your own simulation studies and apply and build models of task studies and be able to fit models to data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.676,
    "end": 212.723,
    "text": "In other words, to start to finish to be able for a person who wants to be able to use active inference models to model data and empirical studies and actually use them in their own research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.743,
    "end": 215.125,
    "text": "So as far as tools necessary,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 216.497,
    "end": 223.483,
    "text": " The main thing right now is going to be having some minimal understanding or motivation to learn how to use MATLAB.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 227.026,
    "end": 239.737,
    "text": "In the tutorial codes, we have seven or eight different tutorial scripts at this point, but the main one is the one that I'll be focusing on today and it's very heavily commented.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 239.837,
    "end": 243.44,
    "text": "Best we did try to describe line by line each thing that's going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 244.599,
    "end": 247.942,
    "text": " There's enough comments and there'd almost be kind of like a second paper in and of itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.524,
    "end": 257.972,
    "text": "So, you know, we're hoping that even someone who doesn't have a ton of background in MATLAB will be able to kind of bootstrap their way up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 259.153,
    "end": 264.339,
    "text": "But you definitely need to have a little bit or be motivated to learn at least a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.74,
    "end": 267.462,
    "text": "Anything else to add on that, Christopher or Max?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.471,
    "end": 270.631,
    "text": " No, I think that sums it up well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.971,
    "end": 272.892,
    "text": "Just one note on the code there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.972,
    "end": 274.633,
    "text": "So you mentioned it's in MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.073,
    "end": 279.234,
    "text": "Now, what about other programming languages or backgrounds like Python?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.394,
    "end": 288.037,
    "text": "So what other languages are people in the active inference space developing in, and how could we include more computer languages as well as natural human languages?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.317,
    "end": 298.0,
    "text": "So, I mean, there are, so at present, everything is almost exclusively in MATLAB, unfortunately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 298.627,
    "end": 315.216,
    "text": " The reason for that is that a lot of this is actually built off of SPM scripts that Carl Friston originally wrote in relation to neuroimaging approaches, so things like dynamic causal modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 315.837,
    "end": 324.301,
    "text": "A lot of the current scripts for doing active inference call on a broad range of other SPM scripts that are used for a lot of different purposes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 324.782,
    "end": 326.082,
    "text": "For instance, in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 327.81,
    "end": 330.591,
    "text": " dealing with large matrices in like neuroimaging.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 332.031,
    "end": 348.915,
    "text": "So for that reason, and because Carl has primarily worked in MATLAB in relation to SPM, everything has kind of been in SPM and specifically in what's called the DEM toolbox in SPM 12, which stands for dynamic expectation maximization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 348.935,
    "end": 356.837,
    "text": "There's a ton of active inference scripts as well as a ton of other modeling scripts for say like continuous models and other sorts of things in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.043,
    "end": 363.728,
    "text": " We just make use of a couple of those, the main ones, not the ones they call on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 365.489,
    "end": 373.555,
    "text": "But that being said, there are people who are trying at the moment to translate some of this stuff into Python.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 374.636,
    "end": 385.884,
    "text": "Alec Schatz, for example, is currently in the process of trying to put together Python versions of some of the main simulation and inversion scripts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 387.532,
    "end": 388.033,
    "text": " I don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.194,
    "end": 393.406,
    "text": "I mean, they're very kind of in beta at the moment as I understand them, but I know that that's something that's in progress.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 394.653,
    "end": 394.853,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.053,
    "end": 406.701,
    "text": "So it sounds like because this project has such a history of being developed in MATLAB and the SPM toolkit and Carl Fristen's research and collaborations, we're drawing heavily on MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.981,
    "end": 413.285,
    "text": "However, in the modern development context, there's a lot of open source projects that are developing in Python.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.565,
    "end": 419.429,
    "text": "So that's definitely an area we'll hope to be expanding and also a great opportunity for people who are experienced in Python",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.089,
    "end": 427.134,
    "text": " or MATLAB and want to be curious about active inference, this is the opening to help contribute to something that could be really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.594,
    "end": 438.562,
    "text": "So just a last warm-up introduction question, what kinds of projects or questions or investigations do you think this could apply to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.802,
    "end": 449.029,
    "text": "For somebody who they've heard of scientific modeling, but not active inference modeling, what do you think are some low-hanging fruit or really straightforward interpretations where you think it could be applied?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.572,
    "end": 452.454,
    "text": " So, I mean, I guess there's a couple of questions here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 452.474,
    "end": 472.655,
    "text": "I mean, one is, um, you know, like, well, I guess the main one is given that the kind of history of computational modeling has, um, um, largely, um, been in the, um, like reinforcement learning, um, you know, sort of literature or, I mean, there are others like drift diffusion modeling and things like that, but, um, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 473.24,
    "end": 484.783,
    "text": " the, you know, one of the kind of major questions is, oh, well, active inference models seem like they're really complicated, you know, relative to some of these simpler sort of traditional reinforcement learning models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 485.704,
    "end": 488.344,
    "text": "So what is it that active inference actually adds, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 488.644,
    "end": 500.708,
    "text": "Like, what can you do using an active inference model in a study that you maybe couldn't do or couldn't do as naturally using standard sorts of existing reinforcement learning models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 502.549,
    "end": 506.992,
    "text": " Here the answer that I would want to give is there's a few parts to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 507.753,
    "end": 529.129,
    "text": "One is that because the value or cost function in active inference is expected free energy as opposed to a reward function, and because the expected free energy has a reward component and an information value component,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 529.83,
    "end": 536.615,
    "text": " then it's quite a bit more natural in active inference models to model explore-exploit tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 536.795,
    "end": 546.183,
    "text": "So tasks where the agent has to somehow intrinsically assign value to seeking information as a means of knowing how to maximize reward eventually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 547.904,
    "end": 555.39,
    "text": "There are actually two different types of directed or goal-driven exploration in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 556.21,
    "end": 559.473,
    "text": "One is what we just call parameter exploration,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 560.345,
    "end": 571.032,
    "text": " And the idea here is this is probably the closest thing to reinforcement learning where say the agent might not start out knowing what the reward probabilities are if they choose one action versus another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.753,
    "end": 584.782,
    "text": "So they will choose actions that will help them essentially learn best what the reward probabilities are before, you know, just reliably you're continuously selecting the same option, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 584.802,
    "end": 587.283,
    "text": "Because that's to kind of know which one's the most rewarding first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 587.944,
    "end": 588.244,
    "text": "So that's,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 588.732,
    "end": 590.172,
    "text": " called parameter exploration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 590.492,
    "end": 606.336,
    "text": "And that, like I said, has analogs in reinforcement learning, but doesn't have a specific, in standard models anyway, doesn't have a very specific sort of information drive to seek that out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 606.796,
    "end": 607.376,
    "text": "But there are some.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 607.396,
    "end": 609.157,
    "text": "So there are things like information bonus terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 609.317,
    "end": 612.358,
    "text": "There's different things like that in reinforcement learning that can do something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.378,
    "end": 614.278,
    "text": "But they're kind of tacked on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 614.298,
    "end": 617.399,
    "text": "They have a little more kind of ad hoc feeling to them, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 619.342,
    "end": 622.784,
    "text": " Whereas it kind of emerges naturally from expected free energy in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 624.265,
    "end": 628.368,
    "text": "There's also something that's a little more unique in active inference, which is called state exploration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 628.388,
    "end": 637.893,
    "text": "And that's more where you're just kind of choosing to move to states that you expect will give you the most precise observations about what state you're in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.534,
    "end": 643.216,
    "text": "So this would be the thing like you don't know whether you're in the green room or the red room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 643.717,
    "end": 647.599,
    "text": "So you should go turn on a light so you'll know which room you're in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 649.108,
    "end": 659.172,
    "text": " That also falls out of expected free energy very naturally, but not out of a lot of other traditional computational modeling approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 662.253,
    "end": 676.798,
    "text": "Sorry, I could go on for a while about this, but there's also something in reinforcement learning models that has to do with Explore Exploit called random exploration, where people essentially start behaving more randomly if they're uncertain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 678.484,
    "end": 680.526,
    "text": " if they know they have to make a bunch more future choices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 682.247,
    "end": 694.718,
    "text": "But those values are typically fixed in reinforcement learning models, whereas the expected for energy precision parameter in active inference is actually a dynamically updated version of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 695.298,
    "end": 703.045,
    "text": "So it changes to remain driving essentially the amount of randomness and behavior that's expected given past observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 704.873,
    "end": 706.674,
    "text": " And so that's kind of nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 706.854,
    "end": 712.878,
    "text": "The last thing I would say is that active inference has a very kind of specific neural process theory associated with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 713.378,
    "end": 720.122,
    "text": "So it makes very specific predictions about the neural responses you ought to see in studies, whereas most other models don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 721.142,
    "end": 722.323,
    "text": "So that's what I would say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 723.143,
    "end": 724.124,
    "text": "Thanks for the answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.484,
    "end": 726.565,
    "text": "Any thoughts on that or any other questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.625,
    "end": 727.646,
    "text": "Christopher or Max?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.207,
    "end": 734.57,
    "text": "I would just say, very broadly speaking, active inference is really great for modeling decision-making under uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.465,
    "end": 742.831,
    "text": " And in particular, various types of perceptual decision making and in discrete state spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 742.911,
    "end": 744.792,
    "text": "So you can do anything from modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.932,
    "end": 759.604,
    "text": "So like Ryan and I have some previous work where we show that you can reproduce a whole lot of kind of classic visual awareness, neural correlates and the classic visual awareness paradigms, for example, using a hierarchical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.148,
    "end": 769.211,
    "text": " And the reason we can do that is because active inference has such a detailed and rich process theory attached to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.571,
    "end": 776.774,
    "text": "And so for me, I think what's really unique about it is that there's lots of different ways of providing unified explanations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 776.834,
    "end": 790.059,
    "text": "But one way that you might want to provide a unifying explanation is just have a unifying set of kind of unifying computation or one computational architecture where you can draw in all of these different things into one paradigm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 790.734,
    "end": 800.217,
    "text": " and then understand, well, one computational paradigm that is, and then understand how they're related through the different parameters that are being modulated when you, or being fit when you build models, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.757,
    "end": 819.203,
    "text": "So I'm not aware of any other modeling paradigm really where you could model things as diverse as a basic kind of explore-exploit task, or looking at kind of phasic dopamine dynamics, and then something that goes all the way up to something like visual awareness, or even like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 819.83,
    "end": 822.431,
    "text": " planning and Bellman optimal planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.131,
    "end": 825.432,
    "text": "So to me, that's what's so special about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.372,
    "end": 829.593,
    "text": "If you want to unify things under one umbrella, this is really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 832.174,
    "end": 832.715,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 832.815,
    "end": 848.06,
    "text": "One last thing I'll say, and this is just a practical nice thing, is that in most other modeling approaches, you actually have to change the equations to fit it to a specific task, whereas in Active Inference, technically you don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.706,
    "end": 851.727,
    "text": " All you do is the actual update equations are always identical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 852.727,
    "end": 856.729,
    "text": "All you have to do is write down the appropriate generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.97,
    "end": 865.352,
    "text": "So it's nice because it's really generic and once you have the generative model specified, everything else kind of just comes for free.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 866.192,
    "end": 873.375,
    "text": "And just to jump in off of that generalizability, the reason I'm interested, I am somebody who studies movement and totally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.025,
    "end": 878.707,
    "text": " different area of neuroscience than decision making and uncertainty modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 878.767,
    "end": 894.952,
    "text": "But at the same time, this framework, what kind of interests me about it is that exactly that, which is that it seems that I can start out with kind of a structured generative model that is consistent, even across domains, and then potentially use that to apply it to my own neuroscientific research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.473,
    "end": 902.735,
    "text": "The main questions that I have and things that I'll be interested to hear about moving forward would be, you know, we talked about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.362,
    "end": 907.404,
    "text": " that we can use it both for parameter exploration and state exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.865,
    "end": 921.032,
    "text": "But when we're in the empirical context of the experiments being performed, it might be the case that I'm uncertain about certain parameters or I'm uncertain about the state and I may be uncertain about both of those things simultaneously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.473,
    "end": 932.519,
    "text": "So finding a way to either design my experiments so that I impose certainty on either the state or the parameters is probably, seems to me an important,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.867,
    "end": 934.448,
    "text": " part of using this model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.029,
    "end": 937.349,
    "text": "No, it's a great point actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 937.39,
    "end": 951.197,
    "text": "Me and Chris were just talking about this like yesterday or something, like how to design an optimal task to disambiguate but include both, having to solve problems that involves state and parameter exploration simultaneously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 952.318,
    "end": 960.162,
    "text": "Technically, the example model that we have for the tutorial is able to do that but not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 960.615,
    "end": 962.316,
    "text": " in an incredibly interesting way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 963.017,
    "end": 965.879,
    "text": "Justin, kind of a way to show how you could do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 967.14,
    "end": 981.812,
    "text": "Very interesting about the experimental design because the kind of statistical techniques, like a t-test, we know the statistical power calculations or we might know the kinds of experimental designs that lead to good clean t-tests, but it's a great point about the experimental design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.372,
    "end": 986.355,
    "text": "And just to highlight this generalizable and also generative nature,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.276,
    "end": 997.527,
    "text": " we talked about a lot of different areas of research, a lot of different frameworks, but the parts that stood out to me were, Christopher, you said decision-making under uncertainty and action and perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.167,
    "end": 1001.411,
    "text": "That covers a lot, a lot of different areas of neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.871,
    "end": 1007.257,
    "text": "And then we are looking for this kind of unified explanation, but rather than an explanation, which might be,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.637,
    "end": 1032.73,
    "text": " philosophical or based upon how much we understand it or how we feel that one day we're rather going to look for a unified computational architecture or a computational paradigm as you said that will let us compare and design and develop these generative and generalizable models so really cool discussion and i'm just going to ask one question from the youtube live chat then we'll go to ryan with a screen share",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.931,
    "end": 1043.255,
    "text": " CB asks, can active inference research help us understand the neuroscience of stimulus independent thoughts when there isn't any sensory input at all?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.556,
    "end": 1045.096,
    "text": "Thanks for elaboration in this regard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.738,
    "end": 1056.922,
    "text": "I mean, I guess, I mean, the broad answer is yes, but the way that you would do it would probably be pretty task specific.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1057.917,
    "end": 1069.201,
    "text": " Um, you know, so, so I'm, um, I'm not necessarily sure how to give a really precise detailed answer without knowing the particular like task or even just general psychological context that's being imagined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1070.081,
    "end": 1079.325,
    "text": "Um, so, I mean, it's actually really easy to model, for instance, like working memory tasks where you might get a stimulus at one point, but then there's just no stimulus for a really long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.885,
    "end": 1085.827,
    "text": "And somehow the thing has to continue to maintain representations, um, in the absence of any stimulus to know what to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1086.445,
    "end": 1088.066,
    "text": " you know, at some distant future point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1089.946,
    "end": 1091.827,
    "text": "You know, there's that kind of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1091.847,
    "end": 1103.531,
    "text": "I mean, just as one example, again, like I said, the way to answer the question probably would be different depending on the exact sort of psychological or task context in question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1104.312,
    "end": 1123.764,
    "text": " Cool, so just like explore, exploit, there are tasks that looked more exploratory or more exploitative, almost within this action and perception, we're gonna be talking about some tasks that are more towards the action oriented side, like the policy planning or the motor behavior and other tasks that are more towards almost the perceptive side, like this visual awareness task,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.164,
    "end": 1141.612,
    "text": " Now, ocular motor movement, the movement of the eye muscles is still a behavior and there's papers that model that, but it's almost like we're looking at the whole spectrum of explore, exploit, or action perception, reinforcement learning, and wondering how we can, again, make this unified framework for talking about these different kinds of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.892,
    "end": 1144.633,
    "text": "So shall we jump right in Ryan or go ahead and add anything else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.893,
    "end": 1150.676,
    "text": "Well, I mean, I mean, just, just one last point to bring up in relation to their, you know, this person's question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1151.365,
    "end": 1167.008,
    "text": " is just that it's actually what's really important and probably a more recent development, and this is stuff that some of the visual awareness stuff that me and Chris have done and also some stuff that I've done previously with emotional awareness, for example, like models of emotional awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1167.728,
    "end": 1176.87,
    "text": "There's a really important sense of what you're doing, not just behavioral actions, but actually cognitive actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.93,
    "end": 1179.891,
    "text": "You're selecting policies that just do something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1180.376,
    "end": 1187.82,
    "text": " like in the neural implementation, just do something like change the functional connectivity between two brain regions or change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1188.301,
    "end": 1193.303,
    "text": "In other words, it is stimulus-independent action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1193.343,
    "end": 1198.246,
    "text": "They're actions that have to do with changing what you're doing cognitively and not what you're doing behaviorally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1199.727,
    "end": 1206.271,
    "text": "So that's also an important part of it that's been done in a few previous papers that I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.206,
    "end": 1210.649,
    "text": " relates in an important way to this kind of stimulus independence sort of question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.049,
    "end": 1212.39,
    "text": "But again, only if I understood it right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1212.89,
    "end": 1213.17,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.631,
    "end": 1215.312,
    "text": "Good answer and thanks for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.512,
    "end": 1226.519,
    "text": "So go ahead and share your screen and just however we can help, whatever you want us to do or not do, we're there, but I'm really looking forward to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.539,
    "end": 1228.0,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1228.04,
    "end": 1235.105,
    "text": "So the main thing here that I want to do just to start is, and this is in part just because I'm assuming that not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1235.586,
    "end": 1239.509,
    "text": " everyone who's watching today was watching last week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1240.81,
    "end": 1254.6,
    "text": "So I'm not gonna be able to give you a full understanding of where we're sort of, of how we're segwaying from last week to this week, but I just wanna give kind of like a really sort of rapid overview of where we're kind of going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1255.821,
    "end": 1262.366,
    "text": "You know, so first we covered this slide here, which just shows an example of how you can do",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1263.957,
    "end": 1265.958,
    "text": " how you can do perception as Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1266.998,
    "end": 1269.94,
    "text": "This is just a mathematical example of how it works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1270.82,
    "end": 1285.906,
    "text": "But the idea is where you see this two-dimensional image and you're this gray disc under observation, you're trying to infer based on prior expectations, whether three-dimensionally it's a concave or convex shape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.387,
    "end": 1292.269,
    "text": "The idea is that in simple problems, you can do that exactly by solving",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1293.643,
    "end": 1296.485,
    "text": " Bayes theorem, so this equation up here on the upper left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1298.246,
    "end": 1301.629,
    "text": "But in most cases, that's actually intractable to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.41,
    "end": 1311.736,
    "text": "And so what you do in active inference is you instead define this thing F here, which is called expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.756,
    "end": 1320.303,
    "text": "And it's more or less a measure of the accuracy of predictions minus the accuracy of beliefs",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.599,
    "end": 1329.063,
    "text": " and combined with the complexity of those beliefs, essentially how much you have to change your beliefs to get a model that's accurate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1330.184,
    "end": 1349.914,
    "text": "So by finding a set of beliefs that minimize expected free energy, in other words, ones that are accurate while changing as little as possible, this is just an example of how by doing that, by just kind of searching around for different QSs here, different beliefs about the probability of states,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1350.88,
    "end": 1363.043,
    "text": " then you can find one that, when you calculate it, gives the lowest value for f. And that's going to be the one that's as close as possible to the true answer the Bayes theorem would give you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1365.084,
    "end": 1378.987,
    "text": "And so what you're trying to do then in active inference is you have some true thing going on out in the world, true states and the observations that they generate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1380.33,
    "end": 1388.332,
    "text": " But then the brain has this model where it's trying to say, okay, what state must I be in given that I got this observation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1388.472,
    "end": 1395.494,
    "text": "So the brain is trying to essentially come up with the representation that best matches what's going on in the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1395.534,
    "end": 1398.195,
    "text": "In other words, the thing that's truly generating the observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1399.975,
    "end": 1404.436,
    "text": "And so that's probability of O and S, so states and observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.917,
    "end": 1406.177,
    "text": "This pi thing is policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1406.687,
    "end": 1414.374,
    "text": " So it's what's the most likely action I ought to choose given that the world is this way and given that I prefer some observations over others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1416.255,
    "end": 1425.463,
    "text": "And what's gonna be important for what I cover today is the way that you actually set up these generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.924,
    "end": 1433.27,
    "text": "And the way that these are set up is you have these states S and you have these observations O.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1434.353,
    "end": 1458.793,
    "text": " um and then you have prior initial prior expectations that we just called d um and if you solve this right if you get some observations and you say given my generative model what states are most likely given those observations and given my prior expectations d then you get your sort of optimal belief about what the what the states ought to be given those observations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1460.114,
    "end": 1464.138,
    "text": " But in active inference, we do this in a way that's also dynamic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1465.359,
    "end": 1470.963,
    "text": "So, for instance, states at time one are going to transition into states at time two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1471.644,
    "end": 1478.589,
    "text": "And so you also have beliefs, this thing in B, about what states are most likely to transition into what other states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1480.571,
    "end": 1485.895,
    "text": "And then, and this is kind of one of the unique moves in active inference, is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1486.343,
    "end": 1487.004,
    "text": " policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1487.324,
    "end": 1494.269,
    "text": "So the different action sequences you might choose are just models as things that entail different transitions between states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1495.39,
    "end": 1504.737,
    "text": "So B matrix one, for example, here would entail choosing to move from one state to another state, whereas some different policy would entail a different B matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.777,
    "end": 1508.099,
    "text": "That means you transition from one state to some other state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1510.121,
    "end": 1515.605,
    "text": "And the choice of policy depends on G here, which is the expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1516.172,
    "end": 1518.873,
    "text": " which is a function of C, which is your preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1520.213,
    "end": 1543.46,
    "text": "So essentially what you're trying to do is you're trying to find the policy which corresponds to a set of state transitions that will generate the observations over time that are gonna be as consistent as possible with your preferences, which corresponds to having the lowest G. And then there's some other sort of parameters up here that can say,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1544.571,
    "end": 1545.211,
    "text": " Add habits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1545.412,
    "end": 1551.914,
    "text": "So E here can give you kind of an additional prior over policies that gives you kind of habits to do one thing over another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1551.934,
    "end": 1564.358,
    "text": "It can have this beta gamma thing that also controls how precise or how reliable the model expects the expected free energy estimates to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1565.679,
    "end": 1571.541,
    "text": "So I realize that's a lot, but we kind of covered this more slowly last time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1572.23,
    "end": 1582.313,
    "text": " But what you really need to know, when we're actually putting together the code, like I'm going to walk you through, this is what we're going to be specifying step by step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1582.373,
    "end": 1584.994,
    "text": "We're going to be specifying what the observations are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1585.014,
    "end": 1594.597,
    "text": "We're going to be specifying the likelihood A. So in other words, what states generate what observations with what probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1596.218,
    "end": 1600.599,
    "text": "We're going to be specifying D and B, which are the priors of our initial states and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1601.172,
    "end": 1603.392,
    "text": " beliefs about how states are going to transition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1603.412,
    "end": 1613.074,
    "text": "And we're going to define policies, this pie thing, which is going to tell us the different possible state transitions we could choose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1614.394,
    "end": 1628.877,
    "text": "And then we're going to define C here, which is what the agent's preferences are, what observations it wants to get over others, as well as the habits and this beta thing, the expected free energy precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.172,
    "end": 1636.075,
    "text": " building a model in the code amounts to just specifying what all these things are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1637.235,
    "end": 1648.341,
    "text": "What the state space is, what the observation space looks like, what A and D and B look like, and what C looks like, and maybe E and Beta.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1648.902,
    "end": 1655.945,
    "text": "If you want to know the exact equations for solving this, we've shown them here, but again, I'm not going to describe them in detail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1657.166,
    "end": 1658.967,
    "text": "But basically all they're doing is they're saying,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.551,
    "end": 1671.38,
    "text": " given my beliefs about state transition, so my priors, and given A, my likelihood, what's my most likely posterior belief going to be, which is just Bayesian inference, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1671.58,
    "end": 1678.305,
    "text": "Priors and likelihoods together equal posteriors or are approximate to posteriors technically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1680.2,
    "end": 1681.201,
    "text": " So that's what we're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1681.221,
    "end": 1684.826,
    "text": "Can I just make one comment on that slide, Ryan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.886,
    "end": 1685.607,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1685.947,
    "end": 1686.167,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.408,
    "end": 1692.495,
    "text": "So on the top left, we have state inference given priors and given observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.576,
    "end": 1693.797,
    "text": "So that's kind of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.957,
    "end": 1697.362,
    "text": "And we're going to be building on the strata to go from inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1697.822,
    "end": 1700.044,
    "text": " Bayesian inference to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.444,
    "end": 1708.591,
    "text": "So you go from the top left, which is just perception at one moment in time that's static, to the bottom left, where you have states that are updating through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.071,
    "end": 1712.274,
    "text": "Given priors and given observations, you're updating your estimate through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.894,
    "end": 1714.195,
    "text": "Then you go to the top right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.315,
    "end": 1716.537,
    "text": "So the bottom left square adds in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.017,
    "end": 1720.941,
    "text": "Now on the top right, we add in this element of policy selection or control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.641,
    "end": 1735.372,
    "text": " And then on the bottom right, we get all the way up to this full active inference model, which not just has a control theory element through policy, but some extra parameters that help us as we're going to find out soon, like E and beta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1735.732,
    "end": 1744.179,
    "text": "So just to give that one more time, because this is what's unique about active inference, and this is the skeleton of the model that everything else is going to be scaffolded onto.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.399,
    "end": 1745.38,
    "text": "Thanks, Ryan, continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.24,
    "end": 1747.101,
    "text": "Yeah, no, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1747.261,
    "end": 1750.283,
    "text": "That was definitely a good, quicker, clear summary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1751.519,
    "end": 1754.581,
    "text": " So appreciate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1754.741,
    "end": 1778.758,
    "text": "And then again, just to remind people, the end goal of all of this is to learn how to put together particular generative models, particular sets of A matrices, D vectors, B matrices, C matrices, et cetera, for empirical, so for behavioral tasks that participants can do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1779.739,
    "end": 1781.06,
    "text": "And then you can fit these models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1782.13,
    "end": 1787.214,
    "text": " to actual behavior to learn things about participants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1787.274,
    "end": 1796.92,
    "text": "For instance, you might learn what their parameters are for A or for B, or for instance, what their beta value is, you know, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.241,
    "end": 1801.363,
    "text": "So that's the kind of ultimate goal here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1802.203,
    "end": 1809.448,
    "text": "But the kind of first step to do that, beyond just understanding the structure I was talking about, is to know how to actually put that together into code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1810.771,
    "end": 1823.179,
    "text": " And so last time, you know, I gave a bunch of examples of past experiments that we and others have done where we have built active inference models for tasks, fit them to data, and learn things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1824.019,
    "end": 1836.327,
    "text": "For instance, about differences in substance use and learning rates, for example, or differences in beta and decision uncertainty between healthy people and people with depression and anxiety or substance use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1837.652,
    "end": 1845.437,
    "text": " or differences in perception of precision estimates for interoceptive perception, for instance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1846.998,
    "end": 1858.947,
    "text": "So I just kind of went through these examples of specific tasks and empirical results just to show the kind of thing that you can do with this in practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.967,
    "end": 1862.61,
    "text": "So I'm not going to read this again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1863.407,
    "end": 1876.116,
    "text": " But, and then the task that we're modeling is one that's designed to be really simple, but that also kind of showcases the major important elements of active inference models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1877.477,
    "end": 1889.886,
    "text": "And so here, what we're doing is we have a task where the agent starts in a start state and they can either directly choose to pull the left, to choose the left slot machine or the right slot machine,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1890.663,
    "end": 1896.869,
    "text": " And if they do that, they can either win $4 or $0, depending on which machine is better, the left one or the right one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1897.509,
    "end": 1899.431,
    "text": "But they don't know ahead of time which one's better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1899.551,
    "end": 1908.279,
    "text": "So they can either kind of take a risky guess and either get $4 or $0, or they can choose to seek information first to ask for this hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1909.2,
    "end": 1915.205,
    "text": "And the hint will tell them which of the left one or the right one is better on that trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1916.513,
    "end": 1920.736,
    "text": " And if it's the left better context, that means the left one will win 80% of the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1920.756,
    "end": 1926.1,
    "text": "And if the hint says the right one's better, then the right one will pay out 80% of the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1926.941,
    "end": 1934.807,
    "text": "But there's a cost to taking the hint, which is that if you take the hint and then choose a machine, then you can only win $2 instead of four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1936.568,
    "end": 1939.29,
    "text": "So that's what we're going to be modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1940.551,
    "end": 1944.234,
    "text": "And so what we need to specify for that is we need to specify",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1944.926,
    "end": 1946.987,
    "text": " that there are two types of hidden states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1947.348,
    "end": 1956.314,
    "text": "One is whether it's the left better or the right better context, whether it's a left better or right better trial, and also the behavior states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1956.594,
    "end": 1965.12,
    "text": "So choosing to move from the start state to the hint state, or choosing to move from the start state directly to the left or right slot machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1967.261,
    "end": 1968.662,
    "text": "So that's two types of states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1969.843,
    "end": 1974.006,
    "text": "We have to specify the observations, or in this case,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1974.687,
    "end": 1978.128,
    "text": " The major observations are winning the $4, $2, or $0.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1978.248,
    "end": 1982.89,
    "text": "Or in this case, we're actually just going to model you win or you don't win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.99,
    "end": 1984.711,
    "text": "And I'll show you how that works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.791,
    "end": 1991.254,
    "text": "And we'll have to define the agent's preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.274,
    "end": 1994.915,
    "text": "So essentially saying it prefers $4 more than $2 and $2 more than $0.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.255,
    "end": 1997.196,
    "text": "And that's going to be that C thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1999.177,
    "end": 2002.258,
    "text": "So that's kind of the general task structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2003.064,
    "end": 2022.257,
    "text": " And I went through the way to do this kind of simply outside of the code, which is you define your initial state priors, you define your state outcome mapping, you define your preferences over outcomes, you define the state transitions slash actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.117,
    "end": 2032.844,
    "text": "So B, and then you define the policies, which you define as this letter of V. And then the final thing I'll talk about before going into the code is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2034.329,
    "end": 2037.751,
    "text": " In these models, you can separate out the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2038.131,
    "end": 2046.736,
    "text": "So it's actually out in the world generating observations from the generative model, which is the agent's beliefs about what's generating the observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2047.656,
    "end": 2057.161,
    "text": "And if we want to separate those in the code, then what we do is big D or big A or big B, those are the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2058.202,
    "end": 2059.723,
    "text": "But if you also specify",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2060.464,
    "end": 2065.866,
    "text": " a little D or a little A or a little B, then that's the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2066.266,
    "end": 2067.267,
    "text": "So that's the agent's beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2067.847,
    "end": 2071.448,
    "text": "And if you specify those, then they will be separate from the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2072.109,
    "end": 2073.629,
    "text": "And that's typically what you need to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2073.729,
    "end": 2077.131,
    "text": "That is what you need to do if you want to model learning, which I'll show.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2077.891,
    "end": 2080.392,
    "text": "Ryan, just two quick points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.412,
    "end": 2084.033,
    "text": "So first off, someone has asked, will these slides be available?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.633,
    "end": 2086.694,
    "text": "Or is there any resource where we can look at these slides?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.714,
    "end": 2088.395,
    "text": "Because there's a lot of great information on them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.355,
    "end": 2092.256,
    "text": " I can make them available.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2094.156,
    "end": 2101.158,
    "text": "Almost all the figures that I'm showing other than the actual task figure here are in the tutorial paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.839,
    "end": 2109.141,
    "text": "Everything I'm showing about how to actually build the models is in the code and well-explained in the code like I'll show.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2109.921,
    "end": 2114.442,
    "text": "But I'm also happy to provide these slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2114.482,
    "end": 2115.283,
    "text": "Just let me know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2116.263,
    "end": 2118.804,
    "text": "Like I said, the vast majority of them are literally just the figures in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2120.416,
    "end": 2126.423,
    "text": " So, yeah, I mean, like I said, I'm happy to make them available or send them to anyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.443,
    "end": 2131.628,
    "text": "I could even just put them as additional supplementary material with a tutorial as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2131.708,
    "end": 2132.409,
    "text": "So, I mean, yeah, just.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2133.459,
    "end": 2134.2,
    "text": " whatever people want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.56,
    "end": 2142.611,
    "text": "Great idea and what a fun and accessible science we can have when we just receive questions like that and can put up our slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.971,
    "end": 2148.338,
    "text": "And then I think Max, there was a question that you had about the B matrix just while we're defining our terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.859,
    "end": 2150.041,
    "text": "What would you like to say about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.164,
    "end": 2151.464,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2152.385,
    "end": 2157.809,
    "text": "But just real quick, for anybody who's just jumping in on the stream, the link is below the video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.889,
    "end": 2158.849,
    "text": "You can go to their paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.949,
    "end": 2162.272,
    "text": "If you're looking for that supplementary code, it's in the supplementary materials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.312,
    "end": 2165.534,
    "text": "You can download all of the code from their supplementary materials there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.635,
    "end": 2180.124,
    "text": "The question I had was, one thing to touch on is, as we walk through the code, one thing I noticed is that we have kind of a tensorial structure for these matrices where we could also specify a transition matrix",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.663,
    "end": 2194.69,
    "text": " that had like a 2D structure with probability of 0.8, 0.2, but instead we have a tensorial structure where we have a fixed probability of one for transitioning from any given state to another state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.31,
    "end": 2206.156,
    "text": "And I just thought if you wanted to touch on maybe the motivation for that, I believe it's related to how the model, like basically interpreting the model and how the model gets used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.456,
    "end": 2207.677,
    "text": "Is that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.557,
    "end": 2211.278,
    "text": " I didn't know if you wanted to elaborate on that any.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.598,
    "end": 2212.039,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2212.159,
    "end": 2213.42,
    "text": "I mean, I mean, yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2213.44,
    "end": 2215.641,
    "text": "I mean, so technically, you know, we call these things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2215.781,
    "end": 2219.163,
    "text": "We call like the A matrix and the B matrix matrices, but technically they're tensors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2219.824,
    "end": 2221.665,
    "text": "Um, so they're high dimensional matrices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.145,
    "end": 2233.453,
    "text": "Um, and, um, so, so, and, you know, obviously go through this when we go through the code, but because you can have different, um, types of states, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2233.473,
    "end": 2238.076,
    "text": "So the state of being in the left better or the right better context, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.837,
    "end": 2244.239,
    "text": " versus the type of state that has to do with, you know, where you move to or what you choose, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2244.319,
    "end": 2251.601,
    "text": "The being in a start state versus the hint state versus, you know, the left or right bandit or yeah, slot machine choice state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2252.281,
    "end": 2256.042,
    "text": "Um, because you have two different types of states, those are called state factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2256.903,
    "end": 2267.866,
    "text": "Um, and so essentially what you need to do is you need to specify these matrices, or I guess it really tensors that again, this is for a, that, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2268.513,
    "end": 2283.72,
    "text": " say what outcomes for each type of outcome will be generated for each combination of each value for each state factor, which makes it higher dimensional, which is probably the trickiest part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.74,
    "end": 2287.822,
    "text": "And I'll explain this as well as I can when we go through the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2289.122,
    "end": 2290.863,
    "text": "But so that's that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2290.963,
    "end": 2297.926,
    "text": "And also, so simultaneously, because you have two types of states here, that also means you have to have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2298.747,
    "end": 2306.689,
    "text": " a B matrix, a transition matrix for each type of state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2307.489,
    "end": 2319.752,
    "text": "When the agent doesn't have control about transitions for a certain state, then there's only going to be one of these B matrices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2319.792,
    "end": 2320.892,
    "text": "For example, here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2321.993,
    "end": 2325.793,
    "text": "This just says B for factor 1, which is what context you're in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2327.114,
    "end": 2327.954,
    "text": "This is just a simple,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2328.679,
    "end": 2338.707,
    "text": " a 2D matrix, although technically, for reasons in the code, you define it as a three-dimensional thing with just a one here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2339.047,
    "end": 2344.051,
    "text": "But that's just because the third dimension here defines the number label for the action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2344.071,
    "end": 2355.019,
    "text": "So this is basically just saying there's only one action for state factor one, and that is an identity matrix here, which just means that for each trial,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2355.802,
    "end": 2359.405,
    "text": " it's going to be the left better context through the whole trial, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.705,
    "end": 2365.369,
    "text": "In other words, within a trial, it's not going to, like after they take the hint, it's not going to like switch on them, you know?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2365.409,
    "end": 2368.531,
    "text": "So really the right one is better if they got the hint that the left one was better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2368.991,
    "end": 2373.014,
    "text": "This is just saying, if you start in the left better one, you're going to stay in the left better one the whole trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2373.935,
    "end": 2374.375,
    "text": "And that's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2376.316,
    "end": 2384.322,
    "text": "Whereas for state factor two, so the B matrices for state factor two, there are four of these,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2385.011,
    "end": 2387.753,
    "text": " which correspond to four different possible actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2389.014,
    "end": 2399.501,
    "text": "So here the third dimension says this is action one, which means that from any state, which are the columns, you can move to state one, which is the first row.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.742,
    "end": 2412.69,
    "text": "Whereas the second one says if I pick action two, so third dimension value two, then I can move from any of the four states, again columns, to state two, which is the hint state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2414.207,
    "end": 2422.51,
    "text": " And so forth for action three and action four, moving to choose the left bandit or the left machine or choosing the right machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2422.53,
    "end": 2426.691,
    "text": "So these are going to be the four actions, which are just the four possible transitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2428.632,
    "end": 2438.415,
    "text": "And then when you specify policies, this thing in V, this is just saying for each state factor, which of those actions can I string together?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.923,
    "end": 2469.911,
    "text": " v for one here for state factor one is just a bunch of ones because again there's only one action it just stays in whatever state it started in um and each column here is a policy and each row is a time is a an action time point basically so this is saying so the first row here is what action could i take when moving from time one to time two and the third row and the second row here is what action could i take when moving from time two to time three and again",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2470.802,
    "end": 2478.644,
    "text": " Each of these columns just stay in ones because there is no possible action for changing the context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2480.004,
    "end": 2495.928,
    "text": "But the policy for vector two here, so again the actions, there's these five columns and this just says I can move to the start state and I can stay in the start state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2496.188,
    "end": 2498.409,
    "text": "So that's just action one up here twice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2499.529,
    "end": 2512.875,
    "text": " Then the second column here says I could take action two, so look at the hint, and then move to action three, which is choose the left machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2513.515,
    "end": 2517.517,
    "text": "Or I could take the hint two and then choose four, which is move to the right machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.257,
    "end": 2521.839,
    "text": "Or I can go straight to the right machine and then go back to start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2522.594,
    "end": 2529.455,
    "text": " or I can go straight to the, sorry, three is the left machine, or straight to the right machine, action four, and then go back to start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2530.295,
    "end": 2535.276,
    "text": "So in other words, there's a bunch of other possible transitions, strings that you might think of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.577,
    "end": 2541.118,
    "text": "You might, for instance, go to the left machine and then go take the hint or something like that, but we're not allowing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2541.158,
    "end": 2548.339,
    "text": "We're saying these are the allowable transitions, so these are the different policies or action sequences that can be chosen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2548.908,
    "end": 2557.15,
    "text": " So correct me if I'm wrong, but it seems that this tensorial structure kind of allows us to compress all those different combinatorial, you know, combinations that we might have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2557.21,
    "end": 2561.452,
    "text": "So it allows the structure of basically just allows the code to be a little more efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2561.532,
    "end": 2562.712,
    "text": "Is that at the end of the day?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.732,
    "end": 2566.033,
    "text": "Yeah, that's a perfectly reasonable way to talk about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.573,
    "end": 2568.193,
    "text": "So, so, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2568.374,
    "end": 2571.414,
    "text": "So, so that already gives you kind of a little bit of a start here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.595,
    "end": 2576.416,
    "text": "So now and then, and then in,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.571,
    "end": 2581.652,
    "text": " So at the end of the day, what we're going to be doing is we're going to be specifying each of these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.692,
    "end": 2583.332,
    "text": "So T, the amount of time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2583.412,
    "end": 2585.133,
    "text": "V, the policy space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2585.153,
    "end": 2587.613,
    "text": "A, the likelihood, the state outcome mapping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.913,
    "end": 2590.814,
    "text": "B, the transition probabilities or transition matrices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2591.474,
    "end": 2594.655,
    "text": "C, which is the preferred observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2594.775,
    "end": 2597.076,
    "text": "This says preferred states here, but it should be preferred observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2598.236,
    "end": 2600.436,
    "text": "D would be the priors of our initial states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.177,
    "end": 2605.978,
    "text": "And then all these other extra little parameters that you can or cannot include.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.378,
    "end": 2607.258,
    "text": "I'll talk about those later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2608.67,
    "end": 2616.354,
    "text": " But then we also specify this little d, which basically says the thing doesn't start out knowing the context, so it has to learn the context over trials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2616.414,
    "end": 2621.416,
    "text": "It has to build up beliefs about d over trials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.676,
    "end": 2626.879,
    "text": "With that as a quick background, I'm going to now move into the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2628.362,
    "end": 2639.049,
    "text": " It's cool that the whole thing is stored as one object with a bunch of fields because it's almost like you could have ensembles of these different models or you might have a bunch of ants in a colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.409,
    "end": 2647.594,
    "text": "It really lends itself to being reproducible and transparent with what each parameter is and comparing a whole host of them alongside or different kinds of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.974,
    "end": 2657.1,
    "text": "Just really cool to see that instead of just a tangle of parameters that you can get lost in, this is like a column of things that each has a very clear purpose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.955,
    "end": 2668.1,
    "text": " Yeah, so I should say, so you do, yeah, put all of these things into the structure that would usually just call little MDP, which just stands for Markov Decision Process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.701,
    "end": 2679.326,
    "text": "And then when you actually run the thing, then you run it through the SPM MDP VB underscore X code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2679.967,
    "end": 2683.288,
    "text": "And we've provided a version that just appends it with the word tutorial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2684.909,
    "end": 2688.031,
    "text": "And you make that big MDP and then you can take",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2688.47,
    "end": 2695.072,
    "text": " use subsequent commands like this that just generate figures that will show you the outcomes of the simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2697.292,
    "end": 2699.333,
    "text": "These are examples of simulation results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2699.673,
    "end": 2703.414,
    "text": "But again, I'll go into these after we go through some of the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2703.774,
    "end": 2706.735,
    "text": "Because to know how to actually use this stuff, you need to understand the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2708.315,
    "end": 2712.376,
    "text": "So hopefully, I can make this not too monotonous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2712.437,
    "end": 2714.217,
    "text": "Walking through code isn't always the most exciting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2714.897,
    "end": 2717.918,
    "text": "But the way that we have this set up,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2719.955,
    "end": 2729.057,
    "text": " Like I said, we have comments that try best to explain what every little command means, like what clear and close all mean, what RNG default means, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2729.078,
    "end": 2732.378,
    "text": "I'm actually going to change this to shuffle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2733.098,
    "end": 2745.181,
    "text": "What that means is just that the MATLAB will use a random number generator that won't do the exact same thing each time, so we can get variable results when we run it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2748.442,
    "end": 2755.627,
    "text": " We've provided several different simulation options that we can use after building the model below, which is what I'll walk through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2756.288,
    "end": 2768.076,
    "text": "So if you set the sim variable equal to one, then that will just simulate a single trial, which will reproduce figure seven in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2768.836,
    "end": 2770.718,
    "text": "So that'd just be a single trial simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2771.398,
    "end": 2777.242,
    "text": "If you set sim equal to two, then that'll simulate multiple trials where the left context is always active,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2778.595,
    "end": 2779.596,
    "text": " the agent won't know that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.876,
    "end": 2783.438,
    "text": "So the agent has to learn, okay, the left one is the one it always is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2783.898,
    "end": 2787.78,
    "text": "So after a while, it'll be confident and won't need to take the hint anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2789.381,
    "end": 2790.841,
    "text": "If I could just briefly interject there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2790.881,
    "end": 2796.124,
    "text": "So that would be, for example, an example of what we talked about earlier as parameter exploration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2797.765,
    "end": 2797.985,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2799.546,
    "end": 2801.167,
    "text": "Well, not exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2801.227,
    "end": 2805.069,
    "text": "It would be an example of learning the parameters over successive time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2807.788,
    "end": 2810.549,
    "text": " So state, I mean, state exploration is a bigger thing here, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2810.589,
    "end": 2815.371,
    "text": "Because either they choose to move to the queue or not to learn which context it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2817.112,
    "end": 2836.561,
    "text": "I agree that, so yeah, the tricky thing is that when you only have two options, then parameter exploration would just amount to, even though I've gotten some good results from choosing the left one, I might also instead try to choose the right one a few times to be more confident in what the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2837.082,
    "end": 2838.803,
    "text": " rule of probability is for the right one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.264,
    "end": 2850.592,
    "text": "But typically to get good dynamics like that, you're probably going to need something that has more like three arms, like three different options instead of two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.973,
    "end": 2858.237,
    "text": "If you're also going to include the state exploration thing with the queue, it would get a little more complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2858.317,
    "end": 2866.723,
    "text": "Like a standard kind of paradigm for doing parameter exploration would be something where you don't have the queue and the agent just has like three choices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2867.489,
    "end": 2873.332,
    "text": " And it just kind of has to choose different ones over time until it becomes confident which one is the best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2873.432,
    "end": 2874.933,
    "text": "And then it'll just keep choosing that one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2875.754,
    "end": 2887.68,
    "text": "Um, so the parameter exploration would amount to how many times kind of it, it chooses each slot machine initially, um, just to figure out which one is best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.26,
    "end": 2894.284,
    "text": "Um, and, um, uh, standard reinforcement learning agent will do that differently than an active inference agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2894.524,
    "end": 2894.604,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2895.402,
    "end": 2898.891,
    "text": " And the substance use study I mentioned above actually specifically did that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2900.629,
    "end": 2904.752,
    "text": " But yeah, so... There's one question here in this Sim equals 1, 2, 3, 4, 5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.192,
    "end": 2910.776,
    "text": "They're like scenarios that you're going to be able to rapidly plug and play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.896,
    "end": 2915.038,
    "text": "So scenario one is like a static or scenario two is multi-trial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.098,
    "end": 2922.443,
    "text": "So this is what is going to allow reproducible construction of the figures and understanding of how different parameter changes influence behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.583,
    "end": 2923.804,
    "text": "But that's what we're laying out right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.824,
    "end": 2926.246,
    "text": "It's kind of like the scenarios for the agent, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.526,
    "end": 2926.666,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.066,
    "end": 2928.888,
    "text": " I don't know about quick is one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.928,
    "end": 2930.869,
    "text": "I think Sim 5 would take about half an hour to run.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2932.411,
    "end": 2933.432,
    "text": "Yeah, don't do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.552,
    "end": 2937.535,
    "text": "Sim 5 we'll talk about when we talk about parameter fitting, which will be a different session.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.696,
    "end": 2951.427,
    "text": "But mainly we'll be talking about Sim 1, 2, and 3 here, which has to do with perception and learning as opposed to the real empirical stuff, which is estimating parameters and using them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2951.943,
    "end": 2954.304,
    "text": " you know, for group all analyses and things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2954.504,
    "end": 2962.629,
    "text": "Well, it's just so helpful, though, how it's laid out from the most static, straightforward, perceptive inference to action in the loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.989,
    "end": 2969.772,
    "text": "And then now that actions in the loop, we're going to think about the simplest setting to explore action in the loop on a single trial unchanging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.792,
    "end": 2974.935,
    "text": "And then we're going to keep on adding layers of ecological variability or other features into the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.955,
    "end": 2976.796,
    "text": "So thanks for making it so stepwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.876,
    "end": 2978.557,
    "text": "And that's why it's a step by step tutorial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.518,
    "end": 2981.639,
    "text": " Yeah, yeah, we tried.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2982.96,
    "end": 2985.102,
    "text": "But that's the last thing for today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2985.382,
    "end": 2991.788,
    "text": "So if you set sim equal to three, then that will simulate a reversal learning situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2992.448,
    "end": 2996.412,
    "text": "And that's where basically the left context is active for a certain number of trials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.892,
    "end": 3000.876,
    "text": "And so the agent should build up a prior expectation that it's just the left one every time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3001.436,
    "end": 3003.978,
    "text": "So it'll stop taking the hint and just start choosing left.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.919,
    "end": 3005.76,
    "text": "But then it switches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3006.2,
    "end": 3008.222,
    "text": "And so now the right context is the right one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.097,
    "end": 3009.937,
    "text": " is the correct one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3010.298,
    "end": 3016.42,
    "text": "And you see basically how long it takes before the agent again says, okay, no, I need to start taking the hint again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3016.44,
    "end": 3023.542,
    "text": "And then eventually when it becomes confident to just choosing the right one, you know, directly and not needing to take the hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3025.003,
    "end": 3027.764,
    "text": "So it's kind of like a standard reversal learning kind of task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3028.824,
    "end": 3031.605,
    "text": "So those are the three that hopefully we'll get through today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3031.625,
    "end": 3037.787,
    "text": "And there are several parameters, you know, that can be kind of messed with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3038.667,
    "end": 3047.913,
    "text": " But the one that I've focused on mainly here, at least we can set in the beginning, is this RS1 thing, which just turns into RS later down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.933,
    "end": 3051.615,
    "text": "But that stands for risk-seeking, or it could also be reward-seeking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.896,
    "end": 3061.722,
    "text": "But more or less, the bigger this value is, the stronger the agent's preference is for winning as much money as possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3062.242,
    "end": 3068.106,
    "text": "So this is the value that's in the C matrix that defines preferences over winning versus losing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3069.274,
    "end": 3081.964,
    "text": " So the bigger this number, the more the agent is going to say, okay, I care more about reward than about information, and therefore I'm just going to take the risky choice to go for one of the slot machines directly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3082.605,
    "end": 3089.17,
    "text": "So the higher this, the less information seeking, the lower this is, the more information seeking the agent will be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.792,
    "end": 3098.617,
    "text": "And so that's just kind of a really simple one to show how by tweaking parameters you can get different results here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.212,
    "end": 3112.215,
    "text": " just allowing you to wait how strong the reward value component is in the expected free energy versus how strong the weight is of the information seeking component of the expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3114.676,
    "end": 3119.097,
    "text": "Then you can ignore this PEB thing down here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.117,
    "end": 3127.419,
    "text": "This is basically you can turn this on if when you do SIM equals five, you want to actually do group level Bayesian analyses on the parameters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3129.467,
    "end": 3131.527,
    "text": " This will also save the outputs of SIM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.747,
    "end": 3134.448,
    "text": "Like Chris said, SIM 5 takes like a half hour to run.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.628,
    "end": 3139.869,
    "text": "So if you turn this thing on, it'll also save the results of SIM 5.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3140.389,
    "end": 3144.21,
    "text": "So you can run this PEB thing without having to redo SIM 5 every time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.43,
    "end": 3146.87,
    "text": "So we just figured hopefully that would help.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3147.75,
    "end": 3152.831,
    "text": "I just want to jump in and point out that it's really nice in this part where, for example, with RSL set there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.251,
    "end": 3158.512,
    "text": "Now let's say that I'm designing my experiment and I need to know how many trials and how many subjects do I need",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.817,
    "end": 3173.147,
    "text": " when I'm doing my power analysis, I can run a simulation like this, set that parameter at what I think might be a reasonable range of values from the literature, and then I can say, well, this is the expected difference in my groups based on what I think this range of values might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.187,
    "end": 3177.169,
    "text": "So it's a really powerful tool to be able to plug and play a single parameter like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.57,
    "end": 3179.371,
    "text": "Yeah, no, it's nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3179.451,
    "end": 3188.637,
    "text": "I mean, typically with experiments, what you do want to do first is you want to kind of say, hey, can tweaking different parameters in the model,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.215,
    "end": 3195.86,
    "text": " produce simulated behavior that looks a lot like the type of behavior I actually see in real participants.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3197.521,
    "end": 3211.61,
    "text": "You know, so, yeah, so exactly what you'd be hoping for is, hey, like, there's a chunk of people that look like, that act as though they have a high risk-seeking value, and another group of people, they have a lower risk-seeking value based on their behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3212.351,
    "end": 3215.153,
    "text": "You can fit the model to that explicitly, and then you can say, hey,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3216.463,
    "end": 3219.425,
    "text": " is the difference in the RS value between these two groups of people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.465,
    "end": 3221.087,
    "text": "Does that predict anything interesting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3221.607,
    "end": 3227.132,
    "text": "You know, does that tell you something about, you know, how well they're going to respond to like drug A versus drug B?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3227.392,
    "end": 3238.921,
    "text": "Or does it tell you something about, um, you know, their general cognitive ability or, you know, their current emotional state or, you know, like you can do all that kind of stuff, um, which is the ultimate goal of all of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3239.862,
    "end": 3242.324,
    "text": "Um, but so, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3243.384,
    "end": 3244.625,
    "text": "So the first thing we need to do, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3245.751,
    "end": 3250.252,
    "text": " at least in the order I have it set up, is to set T. So T is the number of time steps in the trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3250.853,
    "end": 3269.058,
    "text": "So in this case, there are three time steps, remember, because the agent has to start in the start state and then move to the second time step, choose the hint state, and then third time step, choose one of the machines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3269.658,
    "end": 3272.419,
    "text": "Or it can go straight from the start state to one of the machines",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3273.049,
    "end": 3275.811,
    "text": " But then at the third time step, it'll just go back to the start state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3276.711,
    "end": 3277.972,
    "text": "That's how we have it set up anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3277.992,
    "end": 3279.353,
    "text": "So you need three time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3281.994,
    "end": 3291.179,
    "text": "So then what's typically easiest is to first start out by specifying the prior expectations over states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3292.62,
    "end": 3299.504,
    "text": "And so in big D, which is the generative process, for factor number one, which is in the braces here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3300.182,
    "end": 3303.523,
    "text": " we just specify this as a column vector.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3303.943,
    "end": 3309.785,
    "text": "So a row, and then this means that it's transposed and becomes a column, this apostrophe thing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3310.465,
    "end": 3319.987,
    "text": "And so we set this as one and zero, which just means that it's with 100% probability gonna be in the left better context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3322.188,
    "end": 3326.569,
    "text": "And then for the second state factor, so this D two thing here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3327.907,
    "end": 3340.771,
    "text": " We set it so the agent always starts out in the start state, so a one in that first entry, and then zeros for all the rest because it's never going to start in the hint state or in the choose left state or in the choose right state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3341.731,
    "end": 3347.913,
    "text": "We're just saying absolutely the agent will always start in the start state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3348.173,
    "end": 3356.436,
    "text": "This is all explained, but then for little d, so this is the agent's actual beliefs, we say the agent has no idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3357.182,
    "end": 3359.323,
    "text": " what context it's going to be to start with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3360.524,
    "end": 3363.285,
    "text": "So we set these to values that are flat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3363.325,
    "end": 3367.007,
    "text": "So where each, the left better and the right better context have the same values.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3368.748,
    "end": 3379.054,
    "text": "But notice here that we didn't set these up to add up to one like we did for big D. And the reason is that these are technically what are called Dirichlet distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3380.535,
    "end": 3385.918,
    "text": "And Dirichlet distributions are basically they say,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3387.021,
    "end": 3392.966,
    "text": " The smaller these numbers are, the less confident the agent is in its beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.647,
    "end": 3399.852,
    "text": "So if these are 0.25 and 0.25, it thinks it's a flat distribution, but it's really unconfident.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3400.012,
    "end": 3409.8,
    "text": "Whereas this thing was like 20 and 20, then it would also believe it's a flat distribution, but it'd be really, really confident that its beliefs are about a flat distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.312,
    "end": 3424.077,
    "text": " To explain that better, we're actually going to transition over to Chris who's going to give you a little bit of a more general explanation of how learning works here since you actually do need to understand this now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3425.818,
    "end": 3426.138,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3426.198,
    "end": 3429.059,
    "text": "So we can transition over to Chris here briefly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3429.758,
    "end": 3429.898,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.018,
    "end": 3434.981,
    "text": "Because usually a probability people would imagine it sums to one, something has to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.101,
    "end": 3437.102,
    "text": "You know, the coin has to go heads or tails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.162,
    "end": 3443.766,
    "text": "So it has to add up to a hundred percent has to add up to one to be a classical probability, but this is a little bit of a tweak on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.306,
    "end": 3446.307,
    "text": "Some similar features, but some unique features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.467,
    "end": 3449.389,
    "text": "So thanks for switching over there and helping us understand it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.309,
    "end": 3450.449,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3450.469,
    "end": 3451.93,
    "text": "So can you guys see my screen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3452.35,
    "end": 3453.611,
    "text": "Yes, we don't see you, but we see your screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3453.631,
    "end": 3455.612,
    "text": "All right, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.613,
    "end": 3456.833,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.853,
    "end": 3457.073,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.876,
    "end": 3472.101,
    "text": " So as Ryan was saying before, essentially our likelihood, what we were talking about before, say we're talking about the A matrix, there is technically speaking a Dirichlet, so all of the distributions will be categorical distributions, our Ds, our Bs, and our As.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3472.781,
    "end": 3474.161,
    "text": "They're all categorical distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3476.262,
    "end": 3482.144,
    "text": "And they all have a prior or a distribution over the parameter space, which is a Dirichlet distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3483.823,
    "end": 3493.745,
    "text": " Um, and so just to kind of, for the people who are technically like in the know as it were, uh, a categorical distribution is just a special case of multinomial distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3494.805,
    "end": 3510.028,
    "text": "Um, and a Dirichlet distribution is what's called a conjugate prior for the categorical and the multinomial distributions, which just means that if you multiply these two things together, these two distributions, you get out the distribution that has the same form as the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.521,
    "end": 3522.183,
    "text": " That's really important if you're doing empirical Bayes, for example, where the posterior after round one serves as the prior in the second round of inference, that kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3524.083,
    "end": 3528.544,
    "text": "Just to briefly go through this, you guys can see my cursor, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.404,
    "end": 3529.724,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3529.964,
    "end": 3530.484,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3530.685,
    "end": 3539.046,
    "text": "This is the categorical distribution where X is some categorical variable that occupies one of one decay,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.161,
    "end": 3542.063,
    "text": " mutually exclusive states of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3542.624,
    "end": 3548.789,
    "text": "So that is to say I have a distribution over a grid world where my agent is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3548.829,
    "end": 3550.47,
    "text": "My agent can't be in two places at once.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3550.75,
    "end": 3554.434,
    "text": "It's either left or it's right, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3555.995,
    "end": 3557.937,
    "text": "Theta are just the parameters of that distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3558.277,
    "end": 3562.821,
    "text": "So this function here, this thing sticking out the front, it's just normalization constant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3563.461,
    "end": 3567.685,
    "text": "It just counts the combinatorics of the distribution and ensures that sums to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3569.023,
    "end": 3576.849,
    "text": " Exactly the same thing here with the Dirichlet distribution, although it is a distribution over the parameter space of our likelihood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3577.709,
    "end": 3587.816,
    "text": "So Dirichlet distributions are often colloquially called distributions of distributions because they are a distribution over a vector that has to sum to one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3587.836,
    "end": 3598.344,
    "text": "Then what's really beautiful about these two distributions is that when you multiply them together, and we'll just ignore the normalization constant because things get pretty messy, but you end up with a distribution",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3598.877,
    "end": 3601.479,
    "text": " that it has the same functional form as the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3601.499,
    "end": 3603.08,
    "text": "It's also a Dirichlet distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3603.24,
    "end": 3610.565,
    "text": "So our posterior distribution over the parameters of our likelihood is also a Dirichlet distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.045,
    "end": 3615.528,
    "text": "And all that changes when we go from the prior to likelihood is we add this little alpha thing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3615.568,
    "end": 3616.248,
    "text": "It's called a count.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3616.268,
    "end": 3623.413,
    "text": "So we essentially add a count to whatever it was that was observed, to the variable that was observed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.997,
    "end": 3627.378,
    "text": " So I'm just going to go into a little bit more detail than that on the next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3627.838,
    "end": 3631.299,
    "text": "Is there anything you want to add to that, Ryan?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.339,
    "end": 3650.485,
    "text": "No, I mean, at the end of the day, and Chris will cover this, I'm sure, is that while this might look really complicated to somebody who doesn't have a lot of math background, it really just amounts to there being like what I showed you with D. There being a number that's assigned to each entry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3652.126,
    "end": 3653.586,
    "text": "And when you observe something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3654.096,
    "end": 3655.277,
    "text": " that number will get bigger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.618,
    "end": 3673.07,
    "text": "So that just means that, like what I said, that for instance, if I believe that I was in the left better state the last five times, then I'll add like five numbers, you know, I'll add one five times to that left one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3673.09,
    "end": 3674.811,
    "text": "So now it would be like 5.25 as opposed to just 0.25.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3674.851,
    "end": 3676.072,
    "text": "And ultimately those numbers,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3681.957,
    "end": 3683.118,
    "text": " get soft maxed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3683.238,
    "end": 3686.819,
    "text": "So they just get normalized and turned back into a probability distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3688.58,
    "end": 3693.042,
    "text": "But like I said, at the end of the day, you're just adding counts each time you observe something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3693.502,
    "end": 3694.003,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.623,
    "end": 3701.426,
    "text": "This is just like how you might be a little bit more confident about the true ratio of different kinds of colors of balls in an urn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.486,
    "end": 3704.928,
    "text": "If you had three of one color and then one of the other color, you're not quite sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.948,
    "end": 3708.009,
    "text": "If you had 3 million and 1 million, you'd be very sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.249,
    "end": 3709.63,
    "text": "And then Max, you had a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.885,
    "end": 3733.605,
    "text": " Yeah, so just going to the other end of the spectrum then, if I'm somebody who's in probability theory and I'm talking about a Dirichlet distribution and I'm talking about the support for that distribution on the open interval 0, 1, and as we can see here from these equations that are provided, that, you know, if I go to 0, then I'm basically going to end up with a, since it's multiplying each time, then there could be problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.665,
    "end": 3735.187,
    "text": "So in practice, however,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.539,
    "end": 3745.382,
    "text": " My question, not being very experienced with using these things, in practice, when we implement this, does that have much of an effect on any of the estimated parameters?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.382,
    "end": 3747.602,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.042,
    "end": 3764.507,
    "text": "But one thing to say is that because you always work with log, you were always in log space, you just have basically a little numerical trick where to make sure that you never have a log of zero,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3765.031,
    "end": 3768.655,
    "text": " we add e to the negative 16 to all entries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3771.818,
    "end": 3773.239,
    "text": "Does that kind of answer your question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3773.7,
    "end": 3785.912,
    "text": "Yeah, so for example, if I see at the end of the day, I might have a converged parameter that has apparently a very low log likelihood of when I converge on that estimate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3787.239,
    "end": 3801.954,
    "text": " Is it, you know, maybe part of that could be related to, okay, there's sometimes where I'm entering in a state that might be unlikely to occur most of the time, or maybe it wasn't observed in this particular set of experiments, but the rest of it kind of holds up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.034,
    "end": 3808.02,
    "text": "Is that maybe one way to think about low values when I converge to my parameter estimates?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.44,
    "end": 3814.222,
    "text": " I'm not sure I totally understand the example just because it's a little bit abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3814.302,
    "end": 3817.024,
    "text": "Could we give a... How about the slot machine example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.284,
    "end": 3820.366,
    "text": "It's like you go into the casino, you've never done any of the slot machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.766,
    "end": 3822.468,
    "text": "It's like you haven't had much experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.588,
    "end": 3827.231,
    "text": "So even if you're not sure about which one's better, it's like you're not sure overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.731,
    "end": 3835.154,
    "text": " And then as you try more of the slot machines, just like Ryan was saying, you increment up observations, so to speak in those columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.535,
    "end": 3841.717,
    "text": "So after you've made a thousand slot machine visits, you're a little bit more confident than after you had made zero or one or few.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.757,
    "end": 3842.418,
    "text": "Is that the case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3842.438,
    "end": 3844.339,
    "text": "Just to bring it to the example that we're going to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.359,
    "end": 3844.639,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.679,
    "end": 3844.899,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3844.959,
    "end": 3849.421,
    "text": "Or I could pull the slot machine three times and get only one result observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.461,
    "end": 3853.623,
    "text": "And I would never have, um, the compliment to that result observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.375,
    "end": 3859.739,
    "text": " Um, and so then effectively my, my probability distribution is then one and zero on my posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.759,
    "end": 3872.268,
    "text": "Um, so if I end up having like weird looking numbers in my, on my converged parameter estimates in terms of the log likelihoods for the different things, it's, it's kind of maybe just relates to this particular property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3872.308,
    "end": 3878.472,
    "text": "But at the end of the day, what it sounds like is that I'm still going to converge to the correct values using this approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3878.812,
    "end": 3881.194,
    "text": "That's just like kind of an insurance, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3882.492,
    "end": 3886.014,
    "text": " Yeah, I'm not sure, honestly, if there are any formal results that relate to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3887.354,
    "end": 3901.2,
    "text": "But in practice, because we always basically, the categorical distribution just ends up being a softmax function over the concentration parameters, you'll always have something that's between 0 and 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3902.701,
    "end": 3908.984,
    "text": "And the concentration parameters basically will always be somewhere between 0 if it's never been observed and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3910.109,
    "end": 3915.633,
    "text": " at whatever it is, it goes to however high your, how very many experiments you run or simulations you run.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3916.494,
    "end": 3918.455,
    "text": "Um, I've never encountered a problem with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3918.976,
    "end": 3926.641,
    "text": "Um, but then again, I've never actually really looked into, um, possible consequences of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3926.682,
    "end": 3927.382,
    "text": "So I just don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3927.402,
    "end": 3929.263,
    "text": "I'm sorry, Ryan, do you have anything to say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3929.404,
    "end": 3939.331,
    "text": "Um, I mean, the only thing I would say, and yeah, and maybe, maybe I misunderstood the question, but I mean, if it has to do with whether or not you'll, there's certainly no guarantee that you'll converge on the, on the, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3940.12,
    "end": 3941.521,
    "text": " on the true generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3942.921,
    "end": 3947.884,
    "text": "There's lots of cases where things can go wrong and you'll get stuck in local minima and things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.184,
    "end": 3961.23,
    "text": "We actually show several examples of that in this structure learning paper where we show how you can use active inference for structure learning and like Bayesian model expansion or state space expansion and state space reduction and things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3961.91,
    "end": 3967.213,
    "text": "There's lots of cases where you'll end up with the wrong likelihood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3967.233,
    "end": 3969.174,
    "text": "So it's not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3972.804,
    "end": 3982.866,
    "text": " Or maybe in my mind, just a caveat would then be, you know, going to that example with the posterior distribution, I only have picked the machine three times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.866,
    "end": 3998.25,
    "text": "When we're designing our experiment, it might be important to consider setting it up so that, you know, we're not going to get into the case where we only have a sample event of three because obviously that doesn't sound like good science to anybody anyways, but it's just kind of the oversimplified case where as you add more categories,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3999.096,
    "end": 4003.099,
    "text": " you could run into that scenario for one of your particular categories, which could cause some problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.139,
    "end": 4009.483,
    "text": "If there's a hundred kinds of cereal and you only let people choose one time, you're not going to get a good estimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.563,
    "end": 4013.346,
    "text": "It's kind of like a sample size and an experimental design question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.766,
    "end": 4022.652,
    "text": "So just to kind of pull back for those, because that's a really interesting question about where there's provability or how different sample sizes are related to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.553,
    "end": 4035.179,
    "text": " We're just thinking about the structure for how additional observations are going to increase the kind or the quality of this estimate of a parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4036.019,
    "end": 4051.447,
    "text": "Yeah, and you'll see in what Chris shows you that basically the lower the concentration parameter values are generally, the more the expected free energy will be weighted toward choosing, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4052.074,
    "end": 4053.616,
    "text": " parameter exploration policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4054.376,
    "end": 4065.106,
    "text": "So it'll be a thing where if it's never chosen the 99th serial before, it'll be driven to go choose that one just because it wants to be more confident in what the actual parameters are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4067.048,
    "end": 4069.47,
    "text": "But anyway, Crystal, yeah, go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4070.313,
    "end": 4097.746,
    "text": " yeah yeah so we actually don't yeah we actually don't have any numerical examples in the paper where we kind of have show the frangie values um for different parameter values we only kind of have state exploration terms but um there are i mean maybe that's something we could add to the paper actually that would be something interesting yeah be cool yeah okay so essentially just to kind of give a little recap we just have our uh our",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4100.083,
    "end": 4125.64,
    "text": " probability distribution over A or the parameters of A is just a Dirichlet distribution over kind of over A and then so we just end up with a matrix that has the number where the rows are our possible observations and the columns are our hidden states and literally all that we're doing this so this little term this little kind of cross inside the circle is called a Kronecker tensor product and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4127.819,
    "end": 4130.3,
    "text": " Actually, is that correct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4130.38,
    "end": 4131.041,
    "text": "I actually don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4131.381,
    "end": 4134.182,
    "text": "That's the notation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4135.022,
    "end": 4136.563,
    "text": "It's in the SPM textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.003,
    "end": 4139.204,
    "text": "That notation is used for the Chronicler product.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.005,
    "end": 4140.525,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4140.645,
    "end": 4142.166,
    "text": "Okay, good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4142.426,
    "end": 4143.706,
    "text": "Sorry, I just had a brief mind blank.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.726,
    "end": 4144.487,
    "text": "I was like, oh, God.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4144.787,
    "end": 4147.768,
    "text": "Anyway, so in this eta thing here is just a learning rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4148.108,
    "end": 4151.99,
    "text": "And so whatever, it will just multiply essentially this here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.07,
    "end": 4153.771,
    "text": "So say, I'll just give an example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4154.571,
    "end": 4155.952,
    "text": "And we'll just add that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4156.638,
    "end": 4159.42,
    "text": " to our previous values of whatever these A's are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4159.44,
    "end": 4169.086,
    "text": "So just very simply, say we have our posterior states is something like 0.7, 0.3, and we receive observation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4169.547,
    "end": 4173.229,
    "text": "So this is a transpose vector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4173.349,
    "end": 4175.451,
    "text": "So this corresponds to row two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4176.391,
    "end": 4182.555,
    "text": "All that this would do is we're literally adding a value of 0.7 and 0.3 to this matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4184.276,
    "end": 4185.577,
    "text": "That's all that learning is, really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4185.617,
    "end": 4186.518,
    "text": "It's very simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4188.02,
    "end": 4194.285,
    "text": " and then both of these columns will get passed through a softmax function at the end of the day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4194.505,
    "end": 4197.787,
    "text": "Just to give an example of what we're talking about before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4197.827,
    "end": 4207.714,
    "text": "So because they're both softmaxed, all that softmax cares about is that the difference between the two numbers in all the two elements of the vector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4208.015,
    "end": 4212.578,
    "text": "So 51 and 50 and two and one, the same value in the softmax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4212.918,
    "end": 4215.3,
    "text": "But in one case, the model is incredibly confident",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4216.107,
    "end": 4218.629,
    "text": " And in the other case, it's not confident at all, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4219.429,
    "end": 4237.361,
    "text": "So if you had an agent that was actually doing parameter exploration, the agent would have no motivation whatsoever to explore the parameters in the first case of 51, 50, but it would be quite motivated in the case of 2, 1, for example, even though the likelihood distribution you end up getting out of that is the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4238.662,
    "end": 4239.742,
    "text": "Okay, good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4241.143,
    "end": 4243.224,
    "text": "So that is actually, I think, all that we really had.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4243.285,
    "end": 4245.466,
    "text": "That's all that I'd prepared for this is because it's,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4246.161,
    "end": 4247.862,
    "text": " really is in practice, it's so simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4250.523,
    "end": 4255.065,
    "text": "Back to you Ryan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4262.549,
    "end": 4262.849,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4263.129,
    "end": 4271.413,
    "text": "So anyway, with that as a little bit of background, all we're doing here is we're saying to start with, the agent believes it's a flat distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4271.453,
    "end": 4274.735,
    "text": "It has no idea which one's going to be better left or right on each trial,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4275.421,
    "end": 4277.082,
    "text": " That's in little d, because that's our model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4277.402,
    "end": 4284.988,
    "text": "So each time it believes that it was in the left better context, it's just going to keep adding numbers to this 0.25 here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4285.748,
    "end": 4297.557,
    "text": "And those will be scaled by that learning rate thing that Chris showed, where if learning rate is one, then each time it observes the left better context, it'll just add a one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4297.637,
    "end": 4299.018,
    "text": "So it'll become 1.25, and then 2.25, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4299.058,
    "end": 4300.439,
    "text": "But if the learning rate was 0.5, so it was lower,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.994,
    "end": 4307.378,
    "text": " then it would add 0.5 each time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4307.458,
    "end": 4310.783,
    "text": "So it'd be 0.75, 1.25, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4311.384,
    "end": 4314.149,
    "text": "So the learning rate just scales how big the counts are that get added.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4315.495,
    "end": 4319.636,
    "text": " And the learning rate could be zero, at which case there wouldn't be an update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.696,
    "end": 4334.921,
    "text": "Just thinking about just what could the whole range be from not a learning agent to very slowly incorporating new information using this Dirichlet framework that Christopher just described, all the way up to just ridiculously high values so that it just, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.921,
    "end": 4341.603,
    "text": "I should just highlight as well, I think there's, this is, I just kind of want to, this probably isn't a good point for discussion, just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4342.23,
    "end": 4352.634,
    "text": " keep things moving, but one thing that's worth highlighting is there's a genuine kind of debate, or maybe debate's a bit too strong a word, but discussion to be had about whether we should actually be modulating learning rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4353.674,
    "end": 4362.858,
    "text": "Given that the model is Bayes optimal, or approximately Bayes optimal, one would assume that there should be a way of modeling things without actually changing the learning rate from one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4364.302,
    "end": 4369.105,
    "text": " Um, but in practice, I'm not sure if that actually works, but, uh, anyway.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4369.745,
    "end": 4370.005,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4370.025,
    "end": 4373.587,
    "text": "So, I mean, I mean, technically, technically a learning rate of one is optimal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4374.028,
    "end": 4374.368,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4374.808,
    "end": 4385.574,
    "text": "But for, but for, um, for when you're fitting behavior, when you're fitting the model to behavior, um, most people are not optimal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4386.595,
    "end": 4392.158,
    "text": "Um, and so, uh, you have to estimate typically the learning rate for each person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4393.076,
    "end": 4395.318,
    "text": " And oftentimes it's quite a bit below one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4395.758,
    "end": 4397.9,
    "text": "But that's actually an interesting attribute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.98,
    "end": 4411.211,
    "text": "And again, it's an example about how using these generative and generalizable frameworks help us compare not just who could remember more numbers or who had a faster reaction time as far as just observable characteristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.551,
    "end": 4416.936,
    "text": "We're moving a step back and asking whether people might differ in their learning rate or in other attributes of this model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.057,
    "end": 4418.317,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4418.457,
    "end": 4421.8,
    "text": "And there is also, and again, I mean, this isn't something to really get into so much, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4422.418,
    "end": 4432.365,
    "text": " there is effectively a learning rate that comes out of the precision of your posterior beliefs over states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4433.126,
    "end": 4451.64,
    "text": "Like for instance, if your posterior beliefs over states are really imprecise, like say it's like point, say afterwards, you know, this is like 0.6, 0.4, then whatever observation that you get is just gonna add counts of 0.6 and 0.4, which means that you're not really gonna build up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4453.059,
    "end": 4465.901,
    "text": " strong priors, you know, a more precise prior for one over the other because you're not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4466.365,
    "end": 4490.342,
    "text": " confident about which state you're in with just a quick example of that you go into the casino and you're drawing a card and you can't read the card or it's the the number is rubbed off so if there's no precision at the sensory level with which card you drew you're not going to be updating your estimate of how likely different numbers are and then if there's a perfectly legible card so it's a hundred percent you have no error about which card it is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.902,
    "end": 4498.064,
    "text": " there's the secondary question about how much you update your internal model, but it's not a precision about the perception question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.104,
    "end": 4515.167,
    "text": "So it's really a nice point and it's worth understanding that you can have uncertainty about observations that then is captured by this model, but also even in the case of precise or even totally observable scenarios, there's additional uncertainty related to learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.808,
    "end": 4518.668,
    "text": "Yeah, I mean,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4519.389,
    "end": 4520.83,
    "text": " again, there's still potential problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4520.87,
    "end": 4542.027,
    "text": "I mean, what tends to happen in these models is, especially if learning rate is one, then like the agent kind of becomes too confident too quickly, or a better way to put it is they, once they've like observed a certain number of like lefts, for example, becomes really hard for it to unlearn that, which is different from what humans do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4542.127,
    "end": 4544.489,
    "text": "Humans tend to infer that there's a different context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4544.529,
    "end": 4545.83,
    "text": "They're like, okay, no, now it's the,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4546.345,
    "end": 4552.852,
    "text": " Now it's a new context where right is better, so it doesn't necessarily unlearn the original counts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4553.672,
    "end": 4558.117,
    "text": "It instead sort of infers now I'm in a new state and I need to accrue different counts for that state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4558.815,
    "end": 4561.716,
    "text": " And that requires more complex models, which can also be built.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4562.057,
    "end": 4564.077,
    "text": "Just a couple of little notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.198,
    "end": 4569.64,
    "text": "That's kind of like humans using narrative to help reset local parameter estimations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4569.66,
    "end": 4570.901,
    "text": "Like, oh, well, now it's a new day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.241,
    "end": 4574.342,
    "text": "So now things that were unlikely yesterday, now it can be likely today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.722,
    "end": 4584.207,
    "text": "And also it relates to this question about the optimal learning rate in a mathematical or an analytical framework, maybe one or some other number is quote optimal, but then in a realized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4584.747,
    "end": 4589.69,
    "text": " ecological setting, it might be actually not the best solution in that setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4591.631,
    "end": 4591.972,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4593.012,
    "end": 4602.018,
    "text": "So, I mean, yeah, typically people talk about this in other literatures being like latent cause inference or like inferring the latent causes behind things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4602.058,
    "end": 4606.601,
    "text": "There's different latent cause and it's kind of the same thing as saying there's a different context and therefore a different likelihood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4607.802,
    "end": 4613.726,
    "text": "But yeah, so I'll just kind of, you know, go through this here, you know, kind of step by step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4613.786,
    "end": 4614.006,
    "text": "So,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4615.073,
    "end": 4622.015,
    "text": " So I'm going to set up, right, so I have my big D and my little d here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4623.815,
    "end": 4633.378,
    "text": "And then the next thing I'm going to do is, and I'm doing this a little bit condensed, is to just set the number of states here for each state factor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4633.918,
    "end": 4636.639,
    "text": "So that's going to be the length of D1 and the length of D2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4636.739,
    "end": 4643.941,
    "text": "So this one's going to be the two contexts, so there's going to be two states, and this one's going to be the length of D2, which is going to be four states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4644.696,
    "end": 4649.678,
    "text": " So at the end of the day, this NS thing, if you look on the right, is just going to look like that, 2 and 4.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4650.078,
    "end": 4652.919,
    "text": "Just one note there for those who are unfamiliar with MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.039,
    "end": 4657.8,
    "text": "So at line 148, where NS is, you put a little red dot, like a stop sign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.121,
    "end": 4665.063,
    "text": "And then you hit Run, which ran everything that we had just discussed from a clean slate up to that line, and then it halted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.623,
    "end": 4669.984,
    "text": " So that's what allowed us to actually instantiate all these variables we were just talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.365,
    "end": 4677.827,
    "text": "And then you stepped just one line at a time so that you could run this line 148 with all of its prerequisites fulfilled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.127,
    "end": 4680.308,
    "text": "So it's kind of like a break point in the program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4680.608,
    "end": 4682.269,
    "text": "We took a breath and then we ran one line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4682.309,
    "end": 4683.609,
    "text": "And so now we're going to go step by step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.649,
    "end": 4684.989,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4685.209,
    "end": 4689.011,
    "text": "It just allows you to kind of see what it's doing step by step, which is, yeah, it's helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4689.051,
    "end": 4689.371,
    "text": "So sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4689.411,
    "end": 4689.491,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4689.551,
    "end": 4692.272,
    "text": "I should have said what play is and stuff and stuff like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4692.632,
    "end": 4692.712,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4693.484,
    "end": 4706.414,
    "text": " So now that I've specified that, I can put this little for loop thing, which just says for i equals one to the number of states for factor two, I'm just gonna make it all the no hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4706.514,
    "end": 4715.981,
    "text": "This is just saying for all the matrices in A1 to start with, everything is just gonna generate the no hint observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4718.003,
    "end": 4719.444,
    "text": "So it will end up just looking",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4721.502,
    "end": 4733.266,
    "text": " like this where, so I just have, so this is just saying, and I should say that the columns correspond to the first state factor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4733.306,
    "end": 4746.169,
    "text": "So left context, right context, and these third, this third dimension here, one, two, three, four, that's what corresponds to the second state factor, which is the behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4746.189,
    "end": 4750.151,
    "text": "So this is saying when I'm in the start state one,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4751.607,
    "end": 4754.668,
    "text": " each context is going to generate the no hint observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4755.288,
    "end": 4760.089,
    "text": "When I'm in the hint state factor, it's going to generate the no hint observation and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4760.109,
    "end": 4763.87,
    "text": "So I'm just starting it that way for ease to say that they're all that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4764.95,
    "end": 4772.432,
    "text": "But then what I'm going to do is I'm going to define this thing PHA, which is the probability of the hint being accurate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4774.473,
    "end": 4779.334,
    "text": "And again, this is just kind of to make things a little bit concise and convenient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4780.086,
    "end": 4784.887,
    "text": " And then I'm going to replace that A2, because remember A2 means I'm in the hint state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4786.747,
    "end": 4799.75,
    "text": "And so I'm going to say when I'm in the hint state, in column one here, I'm going to observe the machine left hint with some probability if I'm in the machine left state, which is the left column.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4800.77,
    "end": 4804.55,
    "text": "And then one minus that for the no hint state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4805.23,
    "end": 4807.351,
    "text": "And again, if I'm in the right better way,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4808.407,
    "end": 4812.389,
    "text": " context, so the right column here, then it's going to be the reverse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4812.589,
    "end": 4815.671,
    "text": "I'm going to observe the right machine with some probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4815.991,
    "end": 4817.592,
    "text": "Just one note on that, Ryan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.732,
    "end": 4823.735,
    "text": "So people might look at this and wonder, why didn't you just say hint or no hint instead of this 1 minus 1 equals 0?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4824.276,
    "end": 4828.878,
    "text": "And this is because, as you've had it, it generalizes to cues that are less than 100% accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.239,
    "end": 4836.341,
    "text": " So then you could have the probability of the hint being accurate to being 90% or less or some other value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4836.641,
    "end": 4849.365,
    "text": "And so if you have a probabilistic learning task, you can model it with this exact framework, just by changing PHA equals point something rather than re-imagining the entire matrix multiplication, which is really the hard part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.246,
    "end": 4851.166,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4851.486,
    "end": 4857.528,
    "text": "So, so if I step through that, then in this case, I've set PHA to one, which just means the hint is completely accurate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4858.283,
    "end": 4876.01,
    "text": " So now if I look at A1 again, then it's going to look like this, where all the other behavioral states, so in the start state, in choosing the left state or choosing the left machine and choosing the right machine, those still generate row one here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4876.11,
    "end": 4878.211,
    "text": "Both contexts do because the no hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4878.831,
    "end": 4887.315,
    "text": "But if I'm in state two, which is the hint behavioral state, then if I'm in the left machine, if I'm in the left state,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4887.921,
    "end": 4893.786,
    "text": " then I will observe the left is better hint with probability one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4893.966,
    "end": 4905.415,
    "text": "If I'm in the right column here, the right context is better state, then I'm going to observe the right hint observation, so the bottom row here with 100 percent probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4905.635,
    "end": 4911.98,
    "text": "So in other words, if I observe this thing, then I'm going to know for sure that I'm now in the left better context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4913.521,
    "end": 4914.402,
    "text": "But again, if I made this 0.8, 0.2, 0.2, 0.8,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4917.005,
    "end": 4922.749,
    "text": " then that would just mean there's some probability that the hint's going to give me the wrong answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4924.35,
    "end": 4926.191,
    "text": "So that's all that is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4926.351,
    "end": 4929.373,
    "text": "So remember, the first state factor is the columns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4930.054,
    "end": 4933.696,
    "text": "The second state factor is going to be the third dimension.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4935.197,
    "end": 4936.218,
    "text": "That's kind of key.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4939.4,
    "end": 4945.664,
    "text": "So now what I'm going to do is I'm going to define the second outcome modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4945.684,
    "end": 4946.965,
    "text": "So this is another thing that's important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4947.651,
    "end": 4954.776,
    "text": " is that the number here for A that's in the braces, that corresponds to the outcome modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4956.137,
    "end": 4964.942,
    "text": "So the first set of observations I can get is no hint, machine left hint, and machine right hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4965.143,
    "end": 4969.365,
    "text": "So that's one set of observations that we call like an observation or an outcome modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4971.227,
    "end": 4974.889,
    "text": "Now for A2, the second observation or outcome modality",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4975.506,
    "end": 4981.15,
    "text": " the possible observations are null, loss, and win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4982.911,
    "end": 4996.58,
    "text": "So what this is saying is for the first two behavioral states, for i equals one and two, so being in the start state or the hint state is always going to generate the null observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4996.68,
    "end": 4998.301,
    "text": "So it's not going to generate a loss or a win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5001.223,
    "end": 5004.285,
    "text": "Now, after that, if I step through here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5005.091,
    "end": 5007.592,
    "text": " I can set what I just called P win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5007.612,
    "end": 5008.892,
    "text": "So the probability of winning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5009.132,
    "end": 5010.572,
    "text": "And I set that to be 0.8.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5012.033,
    "end": 5016.233,
    "text": "And this is the part where the actual reinforcement or reward learning comes in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5017.714,
    "end": 5032.357,
    "text": "Because what I can do is I can say, okay, if I'm in the left, choose the left machine state, so three, then the probability of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5033.288,
    "end": 5060.992,
    "text": " winning the probability of losing um is uh one minus p win and the probability of winning in the right one or the probability of losing in the right one if i choose the right one is high right which makes sense right because if i'm in the left better context then if i choose the right column right if i choose the right uh machine then i'm most likely going to lose um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5062.816,
    "end": 5080.266,
    "text": " In contrast, if I'm in the write better context and I choose, if I choose the write machine and I'm in the write better context, then the write column here should generate a win with high probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5080.587,
    "end": 5091.313,
    "text": "This is just saying, if I choose the write machine, that's the four, and I'm in the write better context, which is the write column, then I have a high probability of winning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5092.823,
    "end": 5095.025,
    "text": " and vice versa up here if I choose the left one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5096.025,
    "end": 5101.99,
    "text": "Again, just to talk about how this is the minimal example, we're talking about two options with the two slot machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.05,
    "end": 5103.01,
    "text": "There could be more options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.551,
    "end": 5109.075,
    "text": "We're talking about how much it costs to get the hint and how much it costs when you win or how much you receive when you win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.315,
    "end": 5110.376,
    "text": "That's a parameter you can change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.696,
    "end": 5112.157,
    "text": "How accurate the hint is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.197,
    "end": 5116.42,
    "text": "You could have a perfectly accurate hint that sends you to the slot machine that wins 100% of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5116.78,
    "end": 5119.122,
    "text": "So the probability of winning can now be changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.622,
    "end": 5128.304,
    "text": " So then you can say, okay, I'm imagining a situation where there's a perfect messenger with a hint, and then it's free to visit that person, and then it's 100% likely which slot machine is the winning one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.944,
    "end": 5137.466,
    "text": "Or you can imagine these more gray zone scenarios where different things are associated with each other in a less direct way, or there's more than two options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.846,
    "end": 5148.049,
    "text": "Just for those who are like seeing this one example for the first time, this is kind of like the tip of the iceberg of a big, big family of different kinds of models that have a lot more options and a lot more nuance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5149.011,
    "end": 5149.331,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5149.411,
    "end": 5154.932,
    "text": "I mean, you could have, you know, 20 outcome modalities and 10 state factors if you wanted to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5154.952,
    "end": 5160.713,
    "text": "It would just mean that, like, there'd be a fourth dimension for the third state factor and a fifth dimension for the fourth state factor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5160.753,
    "end": 5162.673,
    "text": "And, you know, it'll just get really big really fast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5163.954,
    "end": 5174.535,
    "text": "But so now that I've done this, because I set the probability of winning to 0.8, given that you're, you know, in the correct context, then A2 will look like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5175.335,
    "end": 5178.376,
    "text": "So this just says if I choose",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5178.942,
    "end": 5182.665,
    "text": " If I'm in the start state, I never observe a win or a loss.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5182.725,
    "end": 5185.406,
    "text": "If I'm in the hit state, I never observe a win or a loss.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5188.048,
    "end": 5199.776,
    "text": "If I choose the left option, the left machine, then I will win with 0.8 and lose with 0.2, and the opposite for if I choose the right one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5200.116,
    "end": 5205.46,
    "text": "I'll lose with 0.8 if I choose the left machine and I'm in the right context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5206.311,
    "end": 5212.513,
    "text": " And if I choose the right machine, so state four here, then the probability of winning is 0.8.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5213.793,
    "end": 5215.854,
    "text": "So the third row here is winning, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5217.574,
    "end": 5219.635,
    "text": "And 0.2 and vice versa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5219.695,
    "end": 5226.137,
    "text": "So this is just defining the probability of winning given your choice, given whether it's the left better or right better context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5228.318,
    "end": 5232.579,
    "text": "And I know that's a mouthful, but yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5233.467,
    "end": 5249.038,
    "text": " So then finally, and this isn't really all that practically interesting, but it's important to include is that what this just says, so outcome modality three is just the agent's own behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5249.698,
    "end": 5258.004,
    "text": "So what this means is every single time it makes a choice, it observes itself making that choice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5259.042,
    "end": 5263.324,
    "text": " Um, and all that does is make the agent completely confident about what it did.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5264.164,
    "end": 5272.368,
    "text": "Um, but you could imagine if somebody weren't aware of their own decision-making behavior, you could imagine that might lead to decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.388,
    "end": 5275.429,
    "text": "That's not in line with what you would do if you could observe your behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.67,
    "end": 5277.11,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5277.19,
    "end": 5282.752,
    "text": "So, you know, I mean, if you, if you get rid of this, then in some cases the agent, yeah, it won't be all that confident what he did.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5282.812,
    "end": 5286.714,
    "text": "And so therefore it'll be hard for him to, uh, or to learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5287.423,
    "end": 5290.584,
    "text": " what actions were the right one, because it won't know what it chose, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5291.284,
    "end": 5293.064,
    "text": "It'd be like choosing a slot machine blind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5295.545,
    "end": 5300.026,
    "text": "I just want to jump in with a question about my motor systems context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5300.066,
    "end": 5315.07,
    "text": "So for example, if I'm studying sensory motor integration, and I'm measuring motor cortex signals from neurons in motor cortex, and I'm measuring output such as the kinematics, the kinetic forces that are generated, and the EMG signals in the periphery,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5315.788,
    "end": 5333.356,
    "text": " I could then use that context to say, I could specify it as either one one or as zero one, for example, if I didn't think that it was capable of observing its past history or its decision states in the form of some kind of a sensory blockade related to my experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5333.997,
    "end": 5335.858,
    "text": "Would that be a practical application?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5336.018,
    "end": 5340.66,
    "text": "Does that have face validity in this context, given that I'm measuring those signals?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5342.021,
    "end": 5342.821,
    "text": "One thing that just,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5343.257,
    "end": 5348.678,
    "text": " collectively flag, generally speaking in motor control domains, you're working with like continuous quantities, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5349.198,
    "end": 5349.438,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.078,
    "end": 5353.719,
    "text": "And that's why you use things like Kalman filters, et cetera, as your models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5355.519,
    "end": 5362.521,
    "text": "I'm not sure to what extent a partially observable Markov decision process would actually be the appropriate generative model for the situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5362.961,
    "end": 5370.602,
    "text": "I think it would be, if you want to model like the decision-making processes for motor control,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5371.124,
    "end": 5372.905,
    "text": " So am I going to move my arm to the left or the right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5372.945,
    "end": 5374.066,
    "text": "That is a discrete decision.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5374.627,
    "end": 5384.154,
    "text": "But actually measuring motor control and a lot of those things that you were talking about, those continuous signals, I'm not actually sure POMDP is the appropriate generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5384.575,
    "end": 5400.247,
    "text": "But for example, if I thought that I had a state space that consisted of a fixed point or any kind of, you know, however I'm abstracting those continuous processes into the realm of, you know, a discrete state, just glossing over that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5400.922,
    "end": 5404.224,
    "text": " this kind of model could maybe account for that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5405.145,
    "end": 5406.846,
    "text": "Or be used in that way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5407.227,
    "end": 5421.557,
    "text": "I mean, in any case, you know, where a signal is technically continuous, I mean, you know, to use these sorts of models, right, you're going to have to just pick some quasi-arbitrary, or maybe justified in some sense, a way to kind of bin, you know, bin time, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5421.577,
    "end": 5424.859,
    "text": "You'd have to desperatize time in some way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5425.68,
    "end": 5427.201,
    "text": "You know, the signal was X for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5427.941,
    "end": 5429.143,
    "text": " these three milliseconds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5429.223,
    "end": 5433.968,
    "text": "And now it changed to why these next three milliseconds, that'd be some kind of like funny average or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5434.749,
    "end": 5444.0,
    "text": "Um, I guess, I guess the, you know, potential concern here is also that like, like there has to be some way to, to link the, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5445.302,
    "end": 5452.307,
    "text": " the states as you're kind of bending them to some sort of policy selection process, presumably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5452.327,
    "end": 5454.648,
    "text": "So I'm not completely sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5454.668,
    "end": 5457.41,
    "text": "I can't imagine exactly how that would work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5457.67,
    "end": 5461.193,
    "text": "It's almost like this one is about the agent deciding which way to walk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5461.673,
    "end": 5472.402,
    "text": " And then maybe there's some proprioceptive feedback, but let's think about what this decision-making example is, and then wonder about where the motor and where these other modalities and the continuous signal processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5472.682,
    "end": 5478.127,
    "text": "Also interesting, let's just walk through this discrete time, discrete opportunity space model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.147,
    "end": 5481.13,
    "text": "And then we talked about like an active inference stream eight,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.57,
    "end": 5487.113,
    "text": " with Alex Chance about what does it look like to move active inference from a discrete into a continuous space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5487.453,
    "end": 5490.275,
    "text": "So it's the kinds of things that are actively being developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5490.395,
    "end": 5492.556,
    "text": "And it sounds exciting about the motor example, Max.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5493.856,
    "end": 5510.045,
    "text": "Yeah, I mean, I mean, so there are, you know, and, you know, Thomas Parr has done, you know, a bunch of this, like where you use mixed models, right, where the top, the top layer is a discrete state space Markov decision process model like this, you know, deciding left arm, right arm, but then it feeds into a continuous",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5510.969,
    "end": 5517.714,
    "text": " state space below that actually controls the dynamics of the movement itself based on the decision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5517.734,
    "end": 5523.638,
    "text": "My guess is it would be more, something more like that would be better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5523.658,
    "end": 5530.102,
    "text": "That being said, these sorts of models are much more about behavior and choice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5530.222,
    "end": 5539.809,
    "text": "I mean, when you're talking about neural responses, I would think that would come more, be more useful in these models to use them to predict the neural responses that you would get",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5540.407,
    "end": 5546.269,
    "text": " when a person does X versus Y and see if that matches with the firing rates that you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5547.97,
    "end": 5549.811,
    "text": "There's a paper on the mixed model thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5549.831,
    "end": 5554.572,
    "text": "There's a paper, I think it's called Discrete Movements to Decisions and Back Again or something along those lines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5554.612,
    "end": 5555.613,
    "text": "It's in neural computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5556.953,
    "end": 5559.314,
    "text": "I think it deals with all the formal issues that arise with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5560.214,
    "end": 5560.454,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5561.795,
    "end": 5562.275,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5562.455,
    "end": 5562.655,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5562.915,
    "end": 5565.276,
    "text": "So just for the sake of time here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5566.817,
    "end": 5569.658,
    "text": "So again, what I did here, and this is for the agent observing,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5570.097,
    "end": 5574.14,
    "text": " their own behavior, all I did was I made it like this, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5574.16,
    "end": 5585.227,
    "text": "So this is just saying when the agent chose state one, then it observes the observation associated with state one, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5585.287,
    "end": 5587.609,
    "text": "Row one with 110 probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5588.309,
    "end": 5596.174,
    "text": "When it was in the hint state, then it observes that it was in the hint state row two with 100% probability and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5596.435,
    "end": 5599.837,
    "text": "So it's just providing maximally precise evidence so that it knows",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5600.202,
    "end": 5600.682,
    "text": " what it did.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5600.702,
    "end": 5605.764,
    "text": "Um, so now notice that this was big A, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5605.784,
    "end": 5607.185,
    "text": "So that's the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5608.125,
    "end": 5612.207,
    "text": "If I wanted to, if we wanted to do reward learning, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5612.227,
    "end": 5619.01,
    "text": "If we wanted it to learn P when the, what the reward probabilities are, then we'd have to set little a here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5619.851,
    "end": 5628.554,
    "text": "Um, and you might start out just sort of making big a, making a little a equivalent to, to big a, um, to start with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5629.535,
    "end": 5629.595,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5630.51,
    "end": 5637.752,
    "text": " and multiplying each of the values in little A by a big number, like 200.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5637.992,
    "end": 5658.437,
    "text": "And what that does is it just makes it so the agent is really, really, really confident about its beliefs in A that are associated with big A. And what that does is it just prevents learning for anything you don't want it to learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5659.369,
    "end": 5665.094,
    "text": " So if you multiply this thing by a really big number, then it won't learn anything, even though technically it's learning because it's just already too confident.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5666.955,
    "end": 5674.301,
    "text": "But then what you could do is for anything that you do want it to learn, you can just redefine those with really small numbers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5674.722,
    "end": 5674.942,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5675.022,
    "end": 5676.663,
    "text": "So you can say a three here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5676.743,
    "end": 5685.551,
    "text": "So the probability of choosing of winning shoes, if you choose the left machine, you know, is point five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5686.451,
    "end": 5689.712,
    "text": " So it's just 0.5s all around, right, or 0.25s or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5690.372,
    "end": 5700.895,
    "text": "So this is just saying that the agent would start with completely imprecise beliefs about whether it would win or lose depending on what it chose, depending on context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5701.456,
    "end": 5703.036,
    "text": "So this is what you would do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5703.076,
    "end": 5708.098,
    "text": "You'd kind of turn on little a if you wanted it to learn the reward probabilities, but we're not doing that here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5709.258,
    "end": 5710.839,
    "text": "So we're just showing this as examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5711.539,
    "end": 5712.759,
    "text": "And same thing if you wanted to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5712.819,
    "end": 5715.42,
    "text": "You could do the same thing, but for outcome modality one,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5716.507,
    "end": 5718.789,
    "text": " to have it learn like the accuracy of the hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5719.709,
    "end": 5723.352,
    "text": "So again, these are just kind of commented out examples if you wanted to do that kind of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5725.773,
    "end": 5733.418,
    "text": "So now we've defined the likelihood matrix, right, the A matrix, like what states generate what outcomes with what probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5734.179,
    "end": 5737.361,
    "text": "Now we're moving on into B, which are the transition probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5740.022,
    "end": 5745.386,
    "text": "And remember that there's one of these per state factor per action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5747.34,
    "end": 5756.463,
    "text": " So, and this is what I showed before that for B1, so for state factor one, the context, there's only one action, quote unquote, and it's just an identity matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5756.503,
    "end": 5760.624,
    "text": "This just says the left better context never changes within a trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5763.305,
    "end": 5773.909,
    "text": "And again, I showed this before for the second state factor, the transitions, there's four different possible transitions transitioning from state one to any of the other states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5774.369,
    "end": 5775.329,
    "text": "So just to be clear here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5776.264,
    "end": 5782.227,
    "text": " these transition matrices, the columns are the states you're in now, and the rows are the states that you would move to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5782.247,
    "end": 5786.068,
    "text": "So this is saying from any state, you could move to state one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5787.849,
    "end": 5791.19,
    "text": "From any state, you could move to state two, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5792.791,
    "end": 5801.314,
    "text": "So you end up having one, two, three, four different actions for that state factor, four different possible transitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5804.275,
    "end": 5805.596,
    "text": "So now the next thing that we do",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5806.451,
    "end": 5812.732,
    "text": " is we move to the preference distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5812.972,
    "end": 5814.132,
    "text": "So that's C, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5814.152,
    "end": 5819.573,
    "text": "So this is what the agent wants or what the agent finds rewarding and how rewarding the agent finds it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5820.773,
    "end": 5826.935,
    "text": "So to do that initially, we just, with NO, we just say, what are the different number of outcomes for each outcome modality?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5827.495,
    "end": 5835.656,
    "text": "And that just looks at the size of the row dimensions in A. So if I do that,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5836.109,
    "end": 5844.232,
    "text": " And again, this is just using this size function, which is just, again, to make it more convenient or generalizable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5844.752,
    "end": 5847.753,
    "text": "So if I do that, then NO is going to look like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5847.894,
    "end": 5851.895,
    "text": "That's just saying I have three different outcome modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5852.715,
    "end": 5856.197,
    "text": "One is null, no hint and hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5856.617,
    "end": 5859.618,
    "text": "One is null, lose and win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5860.238,
    "end": 5863.479,
    "text": "And one is the agent observing its own behavior, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5863.599,
    "end": 5864.86,
    "text": "Observing action one, two, three, or four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5866.87,
    "end": 5867.991,
    "text": " Can I ask something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5868.111,
    "end": 5883.516,
    "text": "So many people have asked in the past weeks about dimensionality of, not to go into the Markov blanket discussion, but the dimensionality of observations and how we talk about different kinds of outcomes, different kinds of senses, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5883.997,
    "end": 5887.938,
    "text": "And it's almost looking like it's just about the way it's specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5888.278,
    "end": 5890.219,
    "text": "So the hint could be in your ear,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5891.119,
    "end": 5893.501,
    "text": " And the observation could be visual or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5893.541,
    "end": 5897.944,
    "text": "And so you could get philosophical and ask whether there's really one or two different sensory modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5898.004,
    "end": 5903.928,
    "text": "But in the context of this inferential model that we're writing, it's almost like those things don't really matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5904.028,
    "end": 5906.43,
    "text": "They're just variables that are observed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5907.75,
    "end": 5908.111,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5908.171,
    "end": 5911.033,
    "text": "I mean, so again, we call these modality, like outcome modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5911.053,
    "end": 5912.634,
    "text": "So in this case, there's three, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5912.654,
    "end": 5916.877,
    "text": "So like you said, the hint, this could be the auditory modality and there's three things that could hear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5917.397,
    "end": 5920.079,
    "text": "This could be the visual modality and it's the three",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5920.697,
    "end": 5923.718,
    "text": " whether it wins or loses or hasn't seen that yet, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5923.738,
    "end": 5924.478,
    "text": "This could be visual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5925.078,
    "end": 5927.819,
    "text": "And this fourth thing, the third one could be proprioception, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5927.839,
    "end": 5929.699,
    "text": "It could be observing or feeling what it did.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5929.719,
    "end": 5932.18,
    "text": "I mean, in this case, it's probably also somewhat visual, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5932.2,
    "end": 5934.54,
    "text": "It observes what it does, but you get the point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5935.0,
    "end": 5940.722,
    "text": "So yeah, so there's just a factorized, you know, dimensionality for each modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5940.882,
    "end": 5943.222,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5943.922,
    "end": 5944.843,
    "text": "But okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5945.383,
    "end": 5946.723,
    "text": "So now I've,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5947.349,
    "end": 5956.756,
    "text": " what I've done is I've started out by just putting zeros in the C matrix, the preference distribution for each outcome modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5957.357,
    "end": 5962.441,
    "text": "So this is just saying for outcome modality one, so the hint, the agent has no preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5963.361,
    "end": 5968.345,
    "text": "And I should say the rows are the observations for the null, hint, no hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5969.126,
    "end": 5970.327,
    "text": "And the columns are time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5970.547,
    "end": 5976.672,
    "text": "So this is saying at time one, the agent doesn't care whether it gets the hint or not in terms of rewardingness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5977.524,
    "end": 5979.446,
    "text": " Same thing at time two, same thing at time three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5980.026,
    "end": 5984.089,
    "text": "And I've just done that for all three outcome modalities to start with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5985.891,
    "end": 5992.936,
    "text": "The only thing that we want to add preferences for is the win-lose observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5994.698,
    "end": 6000.002,
    "text": "So in this case, so that's C for outcome modality two, which is the win-loss thing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6000.742,
    "end": 6006.467,
    "text": "So what I've done again for generalizability is I've set this parameter LA, that is called loss aversion,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6007.281,
    "end": 6013.405,
    "text": " And I've set this parameter RS, which is that reward-seeking thing, which I just defined above as RS1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6013.625,
    "end": 6017.067,
    "text": "And again, that's just convenience, so I don't have to go down here and reset it every time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6019.268,
    "end": 6023.331,
    "text": "So I define these, again, just for convenience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6023.931,
    "end": 6028.934,
    "text": "And then what I say here is, so the observations, again, are null, lose, win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6029.174,
    "end": 6034.557,
    "text": "So this is at time zero, the agent doesn't care whether it observes a null, a loss, or a win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6034.578,
    "end": 6037.039,
    "text": "And that's just because it can't observe anything but a null.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6037.831,
    "end": 6048.034,
    "text": " Um, at time two, it dis prefers losing with a value of, again, negative one here, um, for both time two and time three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6048.054,
    "end": 6058.617,
    "text": "Um, but here's a little bit of a trick is that I define the preference for winning as RS at time two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6058.817,
    "end": 6061.798,
    "text": "And remember that RS is four right now, because that's what we set it above.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6062.478,
    "end": 6065.679,
    "text": "Then at time three, I set the preference as RS divided by two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6065.699,
    "end": 6065.739,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6068.041,
    "end": 6088.755,
    "text": " So what that ultimately means is that this preference distribution will look like this, saying it dislikes losing equally at each time, but it gets more reward for winning at time two than at time three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6090.657,
    "end": 6092.718,
    "text": "And so that's our preference distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6094.81,
    "end": 6097.192,
    "text": " And that's basically it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6097.452,
    "end": 6110.301,
    "text": "This is all in how the details of how the sketched out scenario, okay, $4, but then you got to wait 20 minutes and however your scenario is, this is about the detail in matrix form of how the payoffs work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6110.741,
    "end": 6119.067,
    "text": "And so it could be minus one, or you might ask if another number is appropriate there, but it's kind of like, that's the detail level, that's the applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6119.107,
    "end": 6124.231,
    "text": "And that's where we hope to see a lot of people exploring different scenarios so that we can understand better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6125.407,
    "end": 6135.017,
    "text": " Yeah, and so you'll see that when we actually do the like fitting, like parameter fitting to behavior, one thing we'll do is we'll fit this, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6135.057,
    "end": 6139.141,
    "text": "So for some people, RS might be like eight, and for other people, it might be like two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6140.562,
    "end": 6146.168,
    "text": "So you find this value for each person that best explains or reproduces their behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6147.955,
    "end": 6155.801,
    "text": " I mean you gave that example last week right in the substance abuse example where that actually has really meaningful or that parameter has a really meaningful interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6157.902,
    "end": 6170.992,
    "text": "Yeah exactly because it has to do with in the case of an explore exploit task the lower RS is basically means the more people the more like someone is driven to explore you know before they kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6171.721,
    "end": 6174.862,
    "text": " jump to conclusions about which one's the best and just keep choosing that one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6175.282,
    "end": 6191.325,
    "text": "It makes me think about maybe in the substance example or another example, it's like if we're going to have a society that rewards good behavior and punishes negative behavior or something on some issue, do you go with here's how much you get positive and here's how much the punishment should be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6191.645,
    "end": 6193.505,
    "text": "Should it be small punishment versus large?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6193.865,
    "end": 6197.566,
    "text": "These kinds of questions, which are really important at the individual and the group level,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6198.306,
    "end": 6208.734,
    "text": " Not that this is even close to the answer, but it's almost like it's a way for us to start talking about how much do we value and how much do individuals need different blends of these different attributes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.134,
    "end": 6211.175,
    "text": "So really a cool way to talk about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6212.416,
    "end": 6213.237,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6213.257,
    "end": 6222.643,
    "text": "Oh, so one thing that I did want to clarify here is you'll notice that these are supposed to be probability distributions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6223.104,
    "end": 6226.006,
    "text": "C, each column here is supposed to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6226.713,
    "end": 6228.454,
    "text": " something that adds up to one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6228.634,
    "end": 6230.635,
    "text": "And technically we work with log probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6232.336,
    "end": 6240.14,
    "text": "So, you know, negative one and four and negative one and two obviously aren't probabilities or log probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6241.06,
    "end": 6256.388,
    "text": "So in practice, each column here is soft maxed and then each element is logged, which is how you end up with the actual log probability distributions that define the preferences when they're actually used in the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6258.914,
    "end": 6266.537,
    "text": " I show an example of the numbers they turn into, or we show them in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6267.478,
    "end": 6273.16,
    "text": "Last really central thing is to define the policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6273.24,
    "end": 6278.042,
    "text": "Here, I'm just going to use NP here to define the number of policies I want to allow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6279.263,
    "end": 6282.784,
    "text": "Here, the NF thing is just the number of actual state factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6284.861,
    "end": 6294.226,
    "text": " And that will just allow me in a generalizable way to say that V has T minus one rows, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6294.267,
    "end": 6302.291,
    "text": "So it's going to be the number of actions minus the number of times because you have to move from time one to time two, time two to time three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6302.331,
    "end": 6308.315,
    "text": "So there's always one less action possibility than there are times in a trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6309.535,
    "end": 6311.857,
    "text": "And the number of policies, again, is going to be columns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6311.897,
    "end": 6314.098,
    "text": "The number of state factors is going to be that third dimension.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6314.952,
    "end": 6321.514,
    "text": " So I can start by just defining that as ones, and I can keep it that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6321.534,
    "end": 6323.455,
    "text": "I just wrote this explicitly so you could see it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6323.835,
    "end": 6327.336,
    "text": "And this just means, again, it can only choose to stay in the same context every time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6327.376,
    "end": 6329.577,
    "text": "So that's not something the agent knows or can control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6330.477,
    "end": 6340.36,
    "text": "Whereas for state factor two, I can define each of these possible policies, stay in the start state, take the hint, and then choose the left machine, take the hint, choose the right machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6341.297,
    "end": 6344.962,
    "text": " choose the left machine and then go back to start, choose the right machine and then go back to start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6345.603,
    "end": 6350.168,
    "text": "And I describe what each of those means in this kind of one, two, three, four, five thing down here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6351.65,
    "end": 6359.24,
    "text": "So then if we want to, and I'm not gonna do this here, you could specify E, which is the kind of like habits",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6360.123,
    "end": 6364.307,
    "text": " Essentially, it's just a prior over policies that biases you toward choosing one thing versus another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6364.768,
    "end": 6376.299,
    "text": "And just one point there, Ryan, is in the previous active inference streams, we talked about that as the field of affordances for those who are connecting it to the ecological psychology or to the inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6379.187,
    "end": 6380.608,
    "text": " Oh, you mean policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6381.288,
    "end": 6384.711,
    "text": "E. Yeah, I'm not sure I understand that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6385.071,
    "end": 6391.115,
    "text": "The prior on what can be done among policies is the affordances of the organism in their niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6391.575,
    "end": 6395.138,
    "text": "So if you don't have the object, it's not going to be a policy under consideration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6395.438,
    "end": 6404.664,
    "text": "And so E is this mathematical device that's going to be weighting policies by their habit, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6405.265,
    "end": 6407.226,
    "text": "Excellence is a habit, that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6410.287,
    "end": 6410.627,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6410.667,
    "end": 6418.112,
    "text": "I mean, I, I guess like, I mean, technically what you're doing is, you know, like the, when this makes sense functionally is, is when you're learning it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6418.952,
    "end": 6425.456,
    "text": "So, so what you would do with little e, um, and so this might start out, you know, flat, right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6425.496,
    "end": 6428.198,
    "text": "With just counts of one for the direction distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6428.218,
    "end": 6438.064,
    "text": "Um, but if you choose the same policy 20 times, let's say you choose policy three 20 times, then this one, this third one here would become a 20.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6438.104,
    "end": 6438.164,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6440.103,
    "end": 6447.487,
    "text": " And so that just means that you'd start out with a strong bias now for choosing policy three because you've chosen it a bunch of times before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6448.707,
    "end": 6458.712,
    "text": "And that's an optimal thing to do under the assumption that option three was the one that continued to have the lowest expected free energy every time, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6458.732,
    "end": 6468.457,
    "text": "So if in this model-based way, based on minimizing expected free energy, you succeeded over and over again when you chose option three, then it makes sense to build up this kind of bias",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6469.676,
    "end": 6498.418,
    "text": " so that you don't actually have to work that hard cognitively to just keep doing the thing that's right once you build up a prior that's going to keep being right so I guess I can see how if you do the same sorts of things in a given niche over and over again then you develop priors that bias you toward doing the things that are successful in that niche and if something's never been observed then it's unlikely it takes a different mode of operation outside this script if something's never been observed for it to be considered",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6499.943,
    "end": 6501.924,
    "text": " This is just a basic, they know the pop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6501.964,
    "end": 6507.185,
    "text": "That's why you initiate with a non-zero value because it's something that could happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6508.586,
    "end": 6508.766,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6508.806,
    "end": 6509.166,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6509.226,
    "end": 6509.746,
    "text": "No, that's true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6509.786,
    "end": 6514.388,
    "text": "If you set a zero anywhere in E then it's, it's as though they don't have that option.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6514.408,
    "end": 6516.008,
    "text": "Um, yeah, that's true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6516.428,
    "end": 6523.071,
    "text": "Um, one other thing to say is just like agents can get stuck if you have non-stationary environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6523.411,
    "end": 6527.232,
    "text": "So say you have a hundred trials of one thing and then you switch,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6528.652,
    "end": 6558.304,
    "text": " contexts the agent will probably be stuck um and so i don't know it's just useful with all of these parameters they have kind of we can have our favorite interpretations related to like ecological psychology or whatever but i think it's always useful to kind of consider them functionally and use them kind of appropriately for the for whatever situation is your modeling yeah like that's the thing is is you know the the most useful places with this and say like computational psychiatry are the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6559.113,
    "end": 6575.397,
    "text": " if you have the right set of experiences in these models, then you get stuck doing what's technically base optimal given your past experience, but that like makes you really, really maladaptive in what you're doing in the new context that you're in, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6575.417,
    "end": 6582.839,
    "text": "So you can get stuck in really maladaptive places in parameter space that could lead to symptoms that look like psychiatric symptoms, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6584.719,
    "end": 6586.86,
    "text": "So, I mean, this is this kind of idea, you know, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6587.176,
    "end": 6594.025,
    "text": " Philip Fortenbeck has a paper on this as like, you know, optimal inference and suboptimal models, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6595.694,
    "end": 6598.296,
    "text": " So the whole point is you're doing the optimal thing, but your model is wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6599.196,
    "end": 6602.979,
    "text": "You're doing the optimal thing under the assumption that your model is right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6603.539,
    "end": 6614.185,
    "text": "Just outside of this model stream, which is really amazing and I hope it will continue, we would also like to feature these kinds of direct discussions about the computational psychiatry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6614.646,
    "end": 6616.487,
    "text": "So this is awesome with a walkthrough in the code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6616.507,
    "end": 6618.748,
    "text": "It's going to be helpful for a lot of people who are learning that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6619.168,
    "end": 6624.652,
    "text": "And then let's table and find the right time to talk about these issues because it's really awesome what you're describing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6626.377,
    "end": 6630.559,
    "text": " Yeah, I mean, obviously computational psychiatry is what I do in practice, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6630.579,
    "end": 6631.4,
    "text": "So yeah, I'd love to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6632.961,
    "end": 6636.803,
    "text": "Okay, so finally, there's a bunch of kind of additional parameters, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6636.823,
    "end": 6643.647,
    "text": "So we talked about learning rate, which here we're just setting to 0.5 for, you know, arbitrarily.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6644.888,
    "end": 6648.149,
    "text": "Beta, this is the expected free energy precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6648.91,
    "end": 6656.034,
    "text": "So it controls essentially how confident the agent is in its expected free energy estimates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6657.832,
    "end": 6666.475,
    "text": " So if this value is high, that means that the agent is really unconfident in its expected free energy estimates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6667.436,
    "end": 6674.998,
    "text": "And when that's the case, then behavior will be a lot more random, unless the agent has strong habits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6675.719,
    "end": 6683.762,
    "text": "If agent has strong habits, then having a high beta value means that the habits will have a much stronger influence on ultimate policy selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6685.638,
    "end": 6689.12,
    "text": " And we actually show, this is the thing that I was talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6689.14,
    "end": 6694.984,
    "text": "It's kind of like a random exploration sort of thing where it's actually updated over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6695.465,
    "end": 6700.808,
    "text": "So with each observation, the agent essentially updates its confidence in its expected free energy estimates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6703.43,
    "end": 6712.596,
    "text": "And then alpha is kind of like a standard, what are called inverse temperature parameters, where it just kind of controls randomness and action selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6712.736,
    "end": 6714.257,
    "text": "So once you've chosen a policy,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6715.936,
    "end": 6723.68,
    "text": " that policy might say this action is better than that action, but occasionally the agent might still choose a different action kind of randomly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6725.16,
    "end": 6730.223,
    "text": "And this is actually, again, this is technically like a suboptimal thing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6730.243,
    "end": 6731.843,
    "text": "You ought to just always choose the best thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6732.344,
    "end": 6741.508,
    "text": "But this is actually quite important to fit in practice because in actual human behavior, there tends to be a notable amount of randomness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6741.548,
    "end": 6744.189,
    "text": "And so you need to actually fit something like alpha to get",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6744.659,
    "end": 6746.1,
    "text": " a model that fits behavior well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6748.901,
    "end": 6754.965,
    "text": "Now, these other two things I'll probably skip over largely because they only have to do with the neural process theory primarily.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6755.665,
    "end": 6766.651,
    "text": "But this ERP thing, it just controls how much beliefs reset at each time point with respect to the modeled firing rate changes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6766.731,
    "end": 6770.853,
    "text": "So it basically controls how much priors at one time point carry over",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6772.481,
    "end": 6776.324,
    "text": " at the next time point with respect to the neural process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6777.965,
    "end": 6791.534,
    "text": "Then tau is basically like an evidence accumulation rate, so it controls how quickly you update your beliefs based on new observations as attached to the neural process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6791.554,
    "end": 6791.994,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6792.955,
    "end": 6796.697,
    "text": "If anyone digs into the code, it's just a time constant on gradient descent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6797.558,
    "end": 6798.939,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6800.976,
    "end": 6806.558,
    "text": " So, and I go through a couple other ones here that I explained, but I'm going to kind of skip over those for now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6807.778,
    "end": 6808.839,
    "text": "So then that's basically it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6809.019,
    "end": 6819.022,
    "text": "If we wanted to, we could hard code what the states, what the initial states are and what the observations are like that by setting S and O. But typically what we will do is we won't do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6819.222,
    "end": 6825.384,
    "text": "We'll just let the generative process generate the observations itself, which is probabilistic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6825.404,
    "end": 6828.405,
    "text": "So it'll generate with whatever the probability is of D over D,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6830.532,
    "end": 6834.614,
    "text": " what states are actually the true states in that context and therefore what observations get generated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6835.535,
    "end": 6842.899,
    "text": "Um, and so last thing, and again, I already covered this is you just stick all these things you defined into this MDP, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6843.68,
    "end": 6849.763,
    "text": "Um, and we allow little D, which means we're going to allow it to learn whether the left or the right context is more likely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6850.444,
    "end": 6856.127,
    "text": "We said all these things, you know, the learning rate and the action precision or inverse temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6856.307,
    "end": 6858.208,
    "text": "So alpha, um, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6858.989,
    "end": 6859.029,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6859.616,
    "end": 6868.481,
    "text": " we're going to leave out other things we could have defined like E or like learning A or learning B or learning C or learning E, etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6868.781,
    "end": 6875.005,
    "text": "We're not going to define the states ahead of time and we're not going to define some of these additional parameters that we couldn't click.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6876.786,
    "end": 6888.293,
    "text": "Then we can just do some nice labeling here just so we label what the contexts mean, the semantics we're laying on it for the figures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6889.398,
    "end": 6890.338,
    "text": " and that's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6892.519,
    "end": 6905.941,
    "text": "Then once we do that, then we can use this little check script here just to make sure we didn't mess anything up in building the model and it'll nicely tell you or give you a hint anyway about what you might have messed up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6906.601,
    "end": 6913.122,
    "text": "Then this script that I mentioned before that we provide is the one that actually runs the simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6914.663,
    "end": 6916.723,
    "text": "Then finally, once we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6917.398,
    "end": 6926.201,
    "text": " these simulations run, which will be stored in this big MVP, then we can use these plotting scripts to actually show the results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6927.641,
    "end": 6931.002,
    "text": "And if I set SIM equals one, then it's gonna do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6931.122,
    "end": 6936.624,
    "text": "It's just gonna do a single trial simulation, which I'm gonna do now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6938.224,
    "end": 6940.285,
    "text": "So I'll just let the thing run the rest of the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6940.385,
    "end": 6942.506,
    "text": "So I won't, I'll get rid of these stoppers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6943.373,
    "end": 6950.976,
    "text": " Well, just to give a quick, let's give a coding recap just to where we are at the end of the second session while you're going through the stop signs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6951.156,
    "end": 6956.598,
    "text": "So in the first session, we talked a lot about the basis of this paper and the rationale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6956.658,
    "end": 6960.279,
    "text": "We talked a little bit more about who might be interested or what kinds of experiments it was adjacent to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6960.999,
    "end": 6972.803,
    "text": " And then today that was awesome with the code because we went through a full definition and we moved from that sort of analytical definitions that we went through in the first session into seeing how they're realized in the code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6973.203,
    "end": 6976.684,
    "text": "And for me, at least it was really helpful to see how a lot of these things were put down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6977.344,
    "end": 6987.728,
    "text": "And then we got all the way up to line 631 or something, but it could be different in a little different version, but we got to the definition of the full model and then the call out from that object to another script",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6988.228,
    "end": 6993.09,
    "text": " And then we're going to be storing all the outputs in this kind of big container called MDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6993.35,
    "end": 7000.014,
    "text": "So today we went from zero to 60 with the code, getting all these things run through and defined and operated on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7000.034,
    "end": 7001.054,
    "text": "Now we're going to look at the output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7001.434,
    "end": 7005.696,
    "text": "And then it sounds like in future sessions, we're going to be fitting parameters and maybe doing a few other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7007.217,
    "end": 7007.437,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7007.457,
    "end": 7015.801,
    "text": "And future stuff will, I mean, it sounds like maybe we're going to wait to do to show learning next time, I guess, depending on the amount of time, but, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7016.26,
    "end": 7021.921,
    "text": " Yeah, next time then we'd be in a position to do actual code for learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7022.801,
    "end": 7027.322,
    "text": "We're planning on covering the neural process theory and building hierarchical models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7028.683,
    "end": 7031.203,
    "text": "And then the last thing is, yeah, actually fitting models to data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7032.343,
    "end": 7035.844,
    "text": "So yeah, we'll see how much of that we can get through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7036.584,
    "end": 7041.025,
    "text": "But okay, so just to finish here, so I got rid of all my little stoppers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7041.105,
    "end": 7044.626,
    "text": "So now I'm just going to click continue and it's going to run sim equals one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7046.238,
    "end": 7050.141,
    "text": " And what I'm going to get out of this is a little plot like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7050.501,
    "end": 7059.088,
    "text": "And also there'll be a neural process theory one under here, but I'm going to ignore this for now because we're not talking about the neural process theory right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7059.108,
    "end": 7063.131,
    "text": "So what this top one here is, is it's hidden states of contexts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7064.152,
    "end": 7068.415,
    "text": "Now black equals a higher probability, white equals a low probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7068.455,
    "end": 7071.177,
    "text": "And so there's, you know, the gray is kind of in between, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7071.877,
    "end": 7073.919,
    "text": "So this is saying, and these are all,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7074.5,
    "end": 7077.181,
    "text": " posteriors over states at the end of a trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7077.441,
    "end": 7078.261,
    "text": "So that's important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7078.461,
    "end": 7088.825,
    "text": "So what this is saying is at the end of the trial at time three, these are the beliefs that the agent has about what state it was in across all these time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7089.586,
    "end": 7096.148,
    "text": "So this is saying at the end of the trial, the agent was completely confident that it was in the left better context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7097.209,
    "end": 7101.51,
    "text": "And these little cyan blue dots here mean that that's what the true context was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7102.11,
    "end": 7103.691,
    "text": "So in other words, the agent was right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7105.092,
    "end": 7110.253,
    "text": " So this is saying at the end of the trial, the agent was really confident it was in the left better context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7111.133,
    "end": 7113.274,
    "text": "The other state factor is choice states down here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7113.934,
    "end": 7119.555,
    "text": "And this is just saying that it observed itself go from the start state to the hint state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7120.175,
    "end": 7123.836,
    "text": "And then, well, sorry, it moved from the start state to the hint state to the choose left state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7124.296,
    "end": 7125.216,
    "text": "So those are the states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7125.916,
    "end": 7128.697,
    "text": "The actions correspond to that well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7128.777,
    "end": 7131.277,
    "text": "So this is saying it first chose the hint state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7132.15,
    "end": 7136.132,
    "text": " And then it shows the choose left state or choose left actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7136.152,
    "end": 7137.093,
    "text": "Sorry, these are the actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7139.374,
    "end": 7142.055,
    "text": "This thing in the middle on the left, it's not really important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7142.095,
    "end": 7147.278,
    "text": "It's just kind of depicting what the different policy options are kind of arbitrarily based on the numbers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7147.538,
    "end": 7148.598,
    "text": "So I just ignore that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7149.779,
    "end": 7154.401,
    "text": "Down here at the bottom, we have the outcomes and the outcome preference distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7155.122,
    "end": 7159.604,
    "text": "So this is just saying it observed null and then the left hint and then null again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7160.972,
    "end": 7166.896,
    "text": " The third one just says it observed it go to the start state, then to end state, and then to choose left, so just observed its own behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7167.536,
    "end": 7170.418,
    "text": "The second one here is the win-loss one, which is the most important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7170.738,
    "end": 7177.002,
    "text": "So you can see that this one actually has a non-zero distribution over it, which is what means it prefers some observations over others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7178.623,
    "end": 7188.029,
    "text": "So in this case, what it's saying is it started the null state at time two, it stated in the null state because it took the hint, and then it observed a win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7189.448,
    "end": 7196.893,
    "text": " So in other words, it got the hint, it knew what context it was, it chose left, chose left, and so it observed a win.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7197.874,
    "end": 7198.635,
    "text": "So that's what that means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7199.896,
    "end": 7204.639,
    "text": "And then this distribution over policies here is just saying at the beginning, it wasn't that confident, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7204.659,
    "end": 7211.524,
    "text": "So there's a lot of gray across all the policy options, but after the hint, it became really confident at time two about what the right policy was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7213.225,
    "end": 7216.528,
    "text": "This bottom thing is part of the neural process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7216.568,
    "end": 7218.529,
    "text": "It's simulating dopamine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7219.033,
    "end": 7223.256,
    "text": " So dopamine responses, quote unquote, it's the updates in the expected precision, that beta thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7224.517,
    "end": 7227.66,
    "text": "But that's how you read these plots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7228.28,
    "end": 7232.423,
    "text": "And again, I won't go over the neural process theory one because we're going to do that next time, hopefully.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7233.524,
    "end": 7240.83,
    "text": "But just the last thing to show is if you noticed, in that case, the agent went to the hint first, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7241.49,
    "end": 7243.532,
    "text": "So it went for the hint first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7243.592,
    "end": 7244.813,
    "text": "I'll just do that one more time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7244.833,
    "end": 7247.195,
    "text": "So you can see it's very reliable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7247.796,
    "end": 7252.74,
    "text": " that it will choose the hint with a lot of confidence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7253.501,
    "end": 7263.329,
    "text": "But now look what happens if I make this RS value higher, if I make it eight, which means that the thing is really, really, really wants to win the $4 basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7263.709,
    "end": 7267.172,
    "text": "So in this case, it should be risk-taking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7267.433,
    "end": 7271.856,
    "text": "It should just forego the hint and just take a guess immediately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7271.916,
    "end": 7272.937,
    "text": "You can see that's what it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7274.679,
    "end": 7274.979,
    "text": "It has a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7275.549,
    "end": 7282.255,
    "text": " Flat distribution has no idea whether it should choose the left one or the right one, but it just takes a chance because it really wants to win the $4.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7282.716,
    "end": 7289.362,
    "text": "And the value of information and the expected free energy is low because the reward value is really high.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7289.862,
    "end": 7290.883,
    "text": "And so it just takes a guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7292.805,
    "end": 7297.189,
    "text": "And it guesses right, and it turns out that it was in the left context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7297.389,
    "end": 7301.293,
    "text": "So it observes that it lost at time two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7302.113,
    "end": 7307.315,
    "text": " And because it observed that it lost, then it refers, oh, I must have been in the left context as opposed to the right one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7307.355,
    "end": 7310.576,
    "text": "So at the end, it still knows now that it was in the left better context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7312.397,
    "end": 7313.577,
    "text": "So that's what that means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7313.617,
    "end": 7323.22,
    "text": "You can see right away that by changing how much the thing values reward in the preference distribution changes how information seeking it is versus how risk seeking it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7324.961,
    "end": 7327.602,
    "text": "So that's the way that that works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7329.258,
    "end": 7334.622,
    "text": " So do we want to end here or do we want, or is there time to show learning?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7336.323,
    "end": 7338.824,
    "text": "We can absolutely go through learning if you would like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7339.545,
    "end": 7344.328,
    "text": "So the topics that I've written down, I have learning, which it sounds like would be awesome to run through now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7344.868,
    "end": 7350.852,
    "text": "Then we have actual data, hierarchical models, neural process theories, and then computational psychiatry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7351.232,
    "end": 7353.114,
    "text": "So that's the stack of topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7353.494,
    "end": 7357.997,
    "text": "Let's get to learning today and then another time, another model stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7360.27,
    "end": 7361.37,
    "text": " Okay, sounds good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7362.07,
    "end": 7367.372,
    "text": "So learning, so if you could see, I sort of said how to do this here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7367.432,
    "end": 7369.032,
    "text": "I said for it to reproduce figure seven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7369.612,
    "end": 7377.434,
    "text": "So for figure nine here, which is sim two, which is the initial learning, I'm going to first set RS to three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7377.454,
    "end": 7383.535,
    "text": "It's just a value that turns out it's nice for showing the dynamics of learning in a way that's clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7384.356,
    "end": 7389.897,
    "text": "So because it should start out being information seeking and what we want to show is how it learns to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7390.526,
    "end": 7400.193,
    "text": " more confident and therefore starts to forego the hint as it builds up a stronger prior that the left context is the one that keeps being the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7401.314,
    "end": 7408.559,
    "text": "So now what I'll do is I'll set sum equals two, but I'll show you what this does down when I go to sum equals two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7412.322,
    "end": 7412.602,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7413.202,
    "end": 7416.265,
    "text": "So this is actually incredibly simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7416.605,
    "end": 7418.106,
    "text": "So when sum equals two is set,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7418.652,
    "end": 7421.554,
    "text": " all I do is I say, okay, I want 30 trials, so N equals 30.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7423.515,
    "end": 7433.181,
    "text": "To keep the MDP thing, something that remains in that just single structure, I redefine little MDP as big MDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7433.221,
    "end": 7434.482,
    "text": "Again, this is just for convenience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7435.282,
    "end": 7444.888,
    "text": "Then I can use this deal function, which is just a nice convenient function in MATLAB, which more or less just says, repeat the MDP structure 30 times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7446.55,
    "end": 7455.856,
    "text": " So now there's MDP1, MDP2, MDP3, and all those are just the same, just identical as the initial MDP that we built.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7457.697,
    "end": 7464.141,
    "text": "So if I do that, then what will happen is it will look like, so okay, so I'll do two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7464.802,
    "end": 7471.406,
    "text": "One is, so before, so now I just have big MDP equals little MDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7472.423,
    "end": 7474.424,
    "text": " So now big MDP will look like this, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7474.444,
    "end": 7477.725,
    "text": "There's just a single field for TV, AB, blah, blah, blah, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7477.765,
    "end": 7479.566,
    "text": "Everything that we set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7480.647,
    "end": 7495.533,
    "text": "Now, once I run this deal thing, then if I step, then all of a sudden MDP will now look like this, where you can see now that same structure is repeated in 30 rows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7496.454,
    "end": 7499.295,
    "text": "And this will all start out being identical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7500.215,
    "end": 7501.956,
    "text": "So, but will happen now though,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7502.714,
    "end": 7511.741,
    "text": " is if I run it through the VBX tutorial script, then, and this will take a second, it will run through the whole thing 30 times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7514.062,
    "end": 7536.606,
    "text": " and again this will just take a sec so wait let me ask something so first maybe someone's maybe has a little noise in their background but it seems like this little mdp is like a column that conveys all the details for a single trial and then we're making like a meta matrix we're just generalizing the matrix into many dimensions and now we're stacking all of the total model as like a column",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7537.126,
    "end": 7539.769,
    "text": " into, in this case, 30 trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7540.27,
    "end": 7544.334,
    "text": "But you could do 100 trials in a row, or you could have 20 sets of 10 trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7544.755,
    "end": 7555.667,
    "text": "So it's the idea of concatenating total model setups, like a column, so that you can do operations on big, big, potentially hierarchical sets of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7556.783,
    "end": 7559.185,
    "text": " In this case, each MDP is a row, really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7559.265,
    "end": 7560.826,
    "text": "It's just a giant model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7560.927,
    "end": 7563.909,
    "text": "Yeah, it's just a giant structure with MDP over and over again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7564.39,
    "end": 7565.11,
    "text": "Yeah, I meant row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7565.13,
    "end": 7565.991,
    "text": "Sorry, good call.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7566.011,
    "end": 7567.052,
    "text": "My R-centrism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7567.352,
    "end": 7568.793,
    "text": "I'm always thinking in columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7570.515,
    "end": 7571.636,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7571.836,
    "end": 7572.036,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7572.056,
    "end": 7581.644,
    "text": "So now, I ran the MDP with all those different repeated rows, repeated models through this MDP script here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7581.664,
    "end": 7582.505,
    "text": "Now,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7585.202,
    "end": 7589.785,
    "text": " what you'll see is now the MDP structure will look a little different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7592.647,
    "end": 7602.534,
    "text": "So now in addition to all the stuff it had before, it's also now going to have all this other stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7609.189,
    "end": 7623.281,
    "text": " It's going to have the free energy F. It's going to have the expected free energy G. It's going to have the total free energy H. It's going to have the actions U. It's going to have the free energy for the learn parameters D, a bunch of other stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7623.941,
    "end": 7628.945,
    "text": "And we have a whole table in the tutorial that says what each of these fields mean so you can interpret them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7630.046,
    "end": 7632.068,
    "text": "They don't all matter enough for me to go through them right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7633.869,
    "end": 7638.313,
    "text": "But so then once I have that, then I can generate,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7639.333,
    "end": 7646.835,
    "text": " a plot with this little game underscore tutorials script for plotting multiple trials that we put together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7648.395,
    "end": 7656.717,
    "text": "I can run that and it will generate multi-trial behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7657.197,
    "end": 7660.058,
    "text": "What this is showing is the first action on each trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7661.959,
    "end": 7663.319,
    "text": "Here what you can see is that in the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7663.917,
    "end": 7669.398,
    "text": " and the colors are the probabilities, so dark equals higher probability, and the blue circles are the actual chosen actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7670.618,
    "end": 7674.539,
    "text": "So you can see for the first several trials, the agent kept taking the hint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7675.499,
    "end": 7692.002,
    "text": "But after a while, because the left one, if the left context kept being the one, the one that it thought it was in at the end, it starts to be confident around trial 9, 10 here, that it's always just going to be the left one, so it just immediately chooses the one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7692.659,
    "end": 7694.86,
    "text": " the left arm or the left machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7695.86,
    "end": 7700.261,
    "text": "Um, but now you can see is, is that it gets one wrong, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7700.301,
    "end": 7701.881,
    "text": "Cause the, it's only 80%, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7702.141,
    "end": 7703.782,
    "text": "That the left one is going to be the right one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7703.802,
    "end": 7710.943,
    "text": "Um, and, uh, once, um, Wait, could a dog, could a dog be muted or is that yours?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7711.003,
    "end": 7711.684,
    "text": "Yes, it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7711.824,
    "end": 7714.564,
    "text": "It is dog wanting to, wanting to be in my lap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7715.144,
    "end": 7718.125,
    "text": "If the dog's a contributor, then absolutely welcome to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7719.585,
    "end": 7719.826,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7720.066,
    "end": 7720.106,
    "text": "Um,"
  },
  {
    "start": 7722.759,
    "end": 7732.624,
    "text": " But anyway, so it starts to get one wrong here around trial 12, right, 13, because, again, it's only even when it's in the left better context, it still will lose 20% of the time, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7733.084,
    "end": 7735.585,
    "text": "And so once it loses, it says, okay, actually, I'm not confident anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7735.625,
    "end": 7738.706,
    "text": "So it starts taking the hint again, and that happens a couple of times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7740.067,
    "end": 7743.848,
    "text": "And so it starts kind of going, bouncing around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7745.169,
    "end": 7747.53,
    "text": "And also note that this is under",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7748.511,
    "end": 7752.792,
    "text": " an alpha value, right, like the action precision value that's not that high.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7753.332,
    "end": 7755.532,
    "text": "So its behavior is a little random, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7755.552,
    "end": 7759.113,
    "text": "There's a little bit of randomness in it like what a real human would do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7760.894,
    "end": 7765.835,
    "text": "And so this next color, this next plot here below is just green as a win, black as a loss.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7766.175,
    "end": 7770.636,
    "text": "And you can see when it loses, the negative free energies are larger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7773.564,
    "end": 7775.225,
    "text": " And again, this I won't go through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7776.626,
    "end": 7779.148,
    "text": "These two here are just part of the neural process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7779.168,
    "end": 7785.192,
    "text": "They're like the expected ERPs and expected dopamine responses that the theory would predict.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7786.073,
    "end": 7792.277,
    "text": "And then this bottom one is just kind of the evolution of the agent's priors about whether it's going to be the left-wind or the right-wind context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7794.038,
    "end": 7795.779,
    "text": "So that's how to read this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7796.259,
    "end": 7798.081,
    "text": "So it learns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7798.541,
    "end": 7802.724,
    "text": "But look what happens if I instead make the thing a little bit more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7804.545,
    "end": 7805.225,
    "text": " risk seeking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7805.265,
    "end": 7811.07,
    "text": "So I make the value of the subjective value of winning $4 more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7812.771,
    "end": 7818.675,
    "text": "And I do that just by setting RS to four instead of three in this case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7821.557,
    "end": 7821.998,
    "text": "So now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7824.773,
    "end": 7839.118,
    "text": " By the way, it's awesome that basically by hitting play on this script, it seems like even with minimal tweaking, people can reproduce this in their own setup, start to play with some of the variables, and it's just really an awesome toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7839.178,
    "end": 7839.919,
    "text": "This is pretty cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7841.079,
    "end": 7842.219,
    "text": "Yeah, no, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7842.299,
    "end": 7848.842,
    "text": "Yeah, we definitely tried to make it as easy as user-friendly as possible for people to have minimal background.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7848.862,
    "end": 7851.723,
    "text": "So I'm glad if you guys think so, but okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7852.228,
    "end": 7858.333,
    "text": " So in this case, I set the risk-seeking parameter in the preference distribution to be a higher number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7859.233,
    "end": 7865.138,
    "text": "So now if you look, the agent is now, it takes the hint twice and then just sticks with left every single time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7866.659,
    "end": 7870.382,
    "text": "Even if it loses a couple of times, it just continues to be risk-seeking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7872.424,
    "end": 7880.089,
    "text": "And again, everything else is basically the same except the predicted dopamine responses and ERPs and things like that are different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7881.781,
    "end": 7891.704,
    "text": " Um, but, but so that is what it looks like when you just do like a normal learning, um, just where it says the same, the context is the same across trials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7891.884,
    "end": 7904.208,
    "text": "And the last thing I'll show you guys is if I set it to three, then we engineered this kind of this, uh, reward learning, um, uh, or this reversal learning version, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7904.248,
    "end": 7907.729,
    "text": "So reversal learning is for the first several trials, the left context is better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7908.229,
    "end": 7910.77,
    "text": "So it's going to build up a prior that the left context is better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7911.428,
    "end": 7915.811,
    "text": " but then it's going to switch to the right context being better and we're going to see how the agent does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7916.792,
    "end": 7920.254,
    "text": "Now I'll show you how we do that, which is also very simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7920.874,
    "end": 7926.919,
    "text": "Here we're going to set N to be 32 trials, do the same kind of deal thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7927.759,
    "end": 7938.566,
    "text": "But now what I did is I just said for one to the number of trials divided by eight, we're going to make big D one zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7938.627,
    "end": 7940.168,
    "text": "So this is saying the true neural process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7941.345,
    "end": 7943.066,
    "text": " generative process is going to be the left one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7943.646,
    "end": 7957.214,
    "text": "But then I say in the MDP for n divided by eight plus one to n, so basically one after this number to the end, then it's going to now be switched to the generative process as the right context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7958.855,
    "end": 7966.68,
    "text": "So in this case, it just means the first eight trials are left better and the rest of the trials up to 32 are going to be the right better context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7967.32,
    "end": 7968.341,
    "text": "So that's literally it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7968.461,
    "end": 7970.642,
    "text": "Then you just run the same thing through the same VBX",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7971.328,
    "end": 7973.351,
    "text": " function and you plot it with the same plotting script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7973.611,
    "end": 7975.754,
    "text": "So that's really very simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7976.836,
    "end": 7982.864,
    "text": "So if I do that with risk-seeking of three, then what we'll see happen is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7987.537,
    "end": 7989.619,
    "text": " Then, you know, give it a second to cook here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7989.819,
    "end": 8006.471,
    "text": "Just to give one note on that software design, instead of having five scripts called simulation one, simulation two, simulation three, it's like there's a common core and then the simulation scenarios are defined basically like variables down here in the 600s lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8007.031,
    "end": 8010.033,
    "text": "And then by changing which simulation is in play,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8010.934,
    "end": 8016.336,
    "text": " At the very top, it seems like Ryan is being able to change which simulation we're in very fluidly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8016.396,
    "end": 8019.197,
    "text": "So we can change a simulation, look at a variable, change a variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8019.437,
    "end": 8021.578,
    "text": "Go back up, change the simulation, go back in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8024.259,
    "end": 8028.661,
    "text": "Yeah, I mean, basically, it's just an if-then function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8028.701,
    "end": 8030.942,
    "text": "It just says, if sim equals three, then do this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8031.722,
    "end": 8033.663,
    "text": "Or else, if sim equals four, do this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8034.003,
    "end": 8035.904,
    "text": "I mean, it's just a very simple if-then statement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8037.504,
    "end": 8038.365,
    "text": "But okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8038.645,
    "end": 8039.265,
    "text": "So in this case...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8040.229,
    "end": 8043.971,
    "text": " Um, so I set RS equals three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8045.131,
    "end": 8051.254,
    "text": "Um, and what you can see is, is in this case, the agent just continued to take the hint the entire time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8052.434,
    "end": 8056.576,
    "text": "Um, um, cause it was never, it was never confident enough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8057.257,
    "end": 8061.819,
    "text": "And the, uh, you know, and it happened to get the first one wrong in this case, which is part of what drove that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8062.659,
    "end": 8068.502,
    "text": "Um, but so if the, if the, uh, actual observations that got were a little different, let's actually try that again and see, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8070.786,
    "end": 8070.968,
    "text": " What?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8073.837,
    "end": 8075.177,
    "text": " what I would get here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8075.377,
    "end": 8084.479,
    "text": "But this characterizes all these interesting things like a perhaps over or under eagerness to ask for hints or acquire more information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8084.819,
    "end": 8088.1,
    "text": "It's showing how the model, this one is not trying to fit human behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8088.18,
    "end": 8095.482,
    "text": "We're really playing with the bare bones, but already we're seeing that's kind of pathological hint taking behavior, but it never goes when it knows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8095.802,
    "end": 8096.742,
    "text": "And so now it's something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8096.802,
    "end": 8097.142,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8097.342,
    "end": 8100.863,
    "text": "Well, it's just, it's parameter play, but it's going to play out differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8100.883,
    "end": 8101.103,
    "text": "So like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8101.843,
    "end": 8104.445,
    "text": " Yeah, so like in this case, Red does take the hint every time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8104.465,
    "end": 8112.351,
    "text": "It does kind of start, you can see on trial five here, it starts to have a little bit of like, eh, maybe I should just choose the left one immediately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8112.912,
    "end": 8115.414,
    "text": "But then it gets a couple wrong and then the context changes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8115.974,
    "end": 8119.477,
    "text": "You can see in context learning here, it starts out, oh, I think the left one's better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8119.497,
    "end": 8120.498,
    "text": "And then it starts switching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8120.538,
    "end": 8126.862,
    "text": "And then around trial 11 and 12, now it starts to become more and more confident that it's in the right win context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8128.203,
    "end": 8129.865,
    "text": "So now last thing I'll show you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8130.734,
    "end": 8132.676,
    "text": " is what happens under that same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8132.876,
    "end": 8137.88,
    "text": "But when I set RS equal to four, so it's a little more risk seeking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8140.602,
    "end": 8144.626,
    "text": "Um, cause this actually gets a little more fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8144.946,
    "end": 8149.109,
    "text": "So the risk seeking is like a multiplication on the money.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8149.229,
    "end": 8159.678,
    "text": "So it's like one to $2 versus 1 million to 2 million, like how high the stakes are, because it sounds like you're kind of tuning up whether the agent wants the big wins or what is it really conveying in this model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8160.362,
    "end": 8164.283,
    "text": " It's just essentially the precision of the preference distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8164.364,
    "end": 8171.726,
    "text": "So it's just how big the number is over win at time step two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8173.287,
    "end": 8174.287,
    "text": "But that's really all it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8174.367,
    "end": 8181.19,
    "text": "It's just how high the probability is for a win in the agent's model, which just encodes how strongly they prefer winning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8182.67,
    "end": 8188.733,
    "text": "You could think about it as like $4 for them subjectively being like the value of $10 or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8190.131,
    "end": 8205.278,
    "text": " But all it ends up doing in practice is it ends up saying the reward value component of expected free energy has a higher weight than the information value component is all it ends up being in practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8206.838,
    "end": 8210.18,
    "text": "So here you can see that the behavior is actually, you know, again, it's more interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8210.74,
    "end": 8214.382,
    "text": "So you can see it takes a hint twice and all of a sudden it's like, all right, I'm confident enough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8214.402,
    "end": 8216.923,
    "text": "I'm going to go for choosing left immediately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8216.943,
    "end": 8217.703,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8217.723,
    "end": 8219.044,
    "text": "And it does that for a few trials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8219.676,
    "end": 8224.021,
    "text": " And then the context switches, you know, so at trial eight it switches to being the right context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8224.502,
    "end": 8226.824,
    "text": "And then it's like, oh, nope, I'm going to start taking the hint again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8226.845,
    "end": 8230.469,
    "text": "And then it observes the right one a bunch of times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8230.529,
    "end": 8233.112,
    "text": "And then it's like, okay, now I'm confident it's the right one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8233.192,
    "end": 8236.516,
    "text": "And then it starts choosing the right one without taking a hint a bunch of times now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8237.108,
    "end": 8242.91,
    "text": " The behavior is quite a bit more interesting because it becomes confident, it loses confidence, and then it switches to being confident again in the other thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8243.85,
    "end": 8245.391,
    "text": "It gets one wrong around 23.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8245.591,
    "end": 8250.512,
    "text": "It gets a wrong one, and then it does one hint, and then it's like, nope, I'm on the right track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8250.552,
    "end": 8251.612,
    "text": "I just lost one time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8251.813,
    "end": 8252.313,
    "text": "It's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8253.133,
    "end": 8254.413,
    "text": "Yep, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8256.094,
    "end": 8259.195,
    "text": "So that's the way the learning works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8259.215,
    "end": 8266.077,
    "text": "And if I show you, I'm plotting this here, but literally in the MVP, it will just be,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8266.88,
    "end": 8269.081,
    "text": " if I go to the things learning D, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8269.141,
    "end": 8282.324,
    "text": "So if I go to little d trial one, then it observes, yeah, it's 0.75, 0.25 because it observed left the first time, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8282.344,
    "end": 8283.284,
    "text": "And then at, say like trial eight, it's 2.2, 2.2,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8297.237,
    "end": 8303.781,
    "text": " Uh, it didn't make, it's kind of flat, it was flat still, but that's cause it got some wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8304.061,
    "end": 8305.502,
    "text": "That's when it was most confused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8306.923,
    "end": 8307.423,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8308.143,
    "end": 8320.91,
    "text": "Uh, and then, but if I go down to say like, you know, at the end, say like trial, I don't know, 31 or something, then all of a sudden, um, it's two versus 13.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8321.15,
    "end": 8321.35,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8321.37,
    "end": 8322.451,
    "text": "So it's way more confident.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8322.471,
    "end": 8325.853,
    "text": "It's added a lot more counts to, um, it being the right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8326.637,
    "end": 8327.558,
    "text": " context that's better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8329.46,
    "end": 8331.281,
    "text": "And that's, you know, that's really it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8332.882,
    "end": 8335.064,
    "text": "So, and that's literally all the learning is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8335.384,
    "end": 8352.058,
    "text": "And, you know, like Chris showed you the equation for learning A, but, you know, in the tutorial paper, we also show it for learning D, which is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8352.91,
    "end": 8354.011,
    "text": " even simpler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8354.091,
    "end": 8356.713,
    "text": "It's just, see if I can get to it real quick here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8359.755,
    "end": 8363.218,
    "text": "Learning, process theory, learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8364.659,
    "end": 8365.72,
    "text": "Yeah, it's literally just this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8366.26,
    "end": 8374.387,
    "text": "So D for the next trial is D for the previous trial plus eta times whatever the posterior states were for the previous trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8376.408,
    "end": 8379.13,
    "text": "That's, you know, that's literally it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8382.13,
    "end": 8385.971,
    "text": " Although I'm realizing that should be a minus, not an equals, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8386.091,
    "end": 8390.113,
    "text": "But little typos here and there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8390.193,
    "end": 8392.853,
    "text": "But anyway, that's really it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8394.514,
    "end": 8397.795,
    "text": "So it's not complicated at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8397.915,
    "end": 8401.936,
    "text": "It's just add a count based on what your posterior was over states at the end of the last trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8404.077,
    "end": 8409.519,
    "text": "So if we're stopping at the end of basic learning, then that's really it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8411.323,
    "end": 8420.892,
    "text": " Like I said, four and five have to do with estimating parameters based on data and then recovering parameter estimates and fitting behavior to data and things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8421.292,
    "end": 8422.814,
    "text": "We'll cover that at another time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8423.504,
    "end": 8423.804,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8424.044,
    "end": 8430.547,
    "text": "Well, just to catch our breath at the end of this really fascinating and very appreciated stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8432.148,
    "end": 8436.269,
    "text": "And if anyone wants to put any last comments in the live chat, they'll have just a couple of minutes to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8436.71,
    "end": 8441.852,
    "text": "Let's just each take a final recap or a final thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8442.625,
    "end": 8444.867,
    "text": " what do we want to remember from this time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8445.347,
    "end": 8446.968,
    "text": "What are we going to take forward into next time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8447.008,
    "end": 8449.31,
    "text": "What are we looking forward to learning more about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8449.43,
    "end": 8459.997,
    "text": "So whoever wants to go first, maybe Christopher, any remarks on Ryan's presentation and then on the code and also like your role or which parts had you done?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8460.317,
    "end": 8463.8,
    "text": "I was just curious about that while listening for the last.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8465.761,
    "end": 8468.103,
    "text": "So, no, I think I agreed with everything that was said there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8468.463,
    "end": 8469.704,
    "text": "One thing to just say is very,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8471.842,
    "end": 8483.707,
    "text": " When you really get a handle on building these models, it will take, I think for the most time I've ever spent building these models, once we'd actually figured out the model structure, was a couple of days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8484.727,
    "end": 8491.25,
    "text": "Like you might spend a very, very long time figuring out the model structure, but once you figure out the model structure, everything falls in place and it's super easy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8492.37,
    "end": 8500.213,
    "text": "So it's kind of interesting in the sense that I have some friends do like neural network or modeling with like spiking neural nets and they can spend like weeks building these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8504.992,
    "end": 8506.913,
    "text": " The hard work here is really conceptual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8508.774,
    "end": 8512.516,
    "text": "And then did you ask what part of the tutorial I wrote or versus Ryan?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8513.157,
    "end": 8513.977,
    "text": "Was that the question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8514.197,
    "end": 8521.842,
    "text": "Not a partitioning, just which parts were your background drawing from or just how do you see it similar or differently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8522.845,
    "end": 8529.186,
    "text": " I wrote, generally speaking, I wrote the mathematical appendices and then did like first drafts of a lot of the techie sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8529.466,
    "end": 8536.027,
    "text": "But that was kind of like my, I deliberately asked Ryan to do that just because I wanted to kind of get a better understanding of them myself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8537.728,
    "end": 8540.828,
    "text": "And then Ryan kind of wrote a lot of the broader sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8541.208,
    "end": 8542.389,
    "text": "That was kind of how that stuff worked out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8545.829,
    "end": 8549.95,
    "text": "Yeah, I mean, yeah, I wrote, I mean, I wrote the code we're going through now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8551.109,
    "end": 8553.93,
    "text": " was I took the first pass on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8554.71,
    "end": 8570.076,
    "text": "Chris wrote the hierarchical modeling code, which another day you'll see in a lot of the neural process simulation code, or the custom one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8570.736,
    "end": 8573.837,
    "text": "The ones I was showing you now are just like Carl's standard, the ones that are in SPM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8573.977,
    "end": 8579.539,
    "text": "But Chris made some way, way cooler ones for the hierarchical neural process simulation stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8580.365,
    "end": 8588.408,
    "text": " Um, so, um, but yeah, I mean, a lot of this was a fully collaborative, you know, I wouldn't necessarily say, you know, one person did anything more than the other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8588.428,
    "end": 8595.05,
    "text": "Um, so everyone's who's like written a scientific paper knows like it's after the first draft has been written.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8595.07,
    "end": 8600.432,
    "text": "That's kind of hard to tell product because when you have heavy backward and forward editing, it,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8603.544,
    "end": 8604.125,
    "text": " I totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8604.145,
    "end": 8605.306,
    "text": "It's a great perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8605.346,
    "end": 8607.127,
    "text": "So also thanks for sharing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8607.548,
    "end": 8613.553,
    "text": "So maybe now let's have our last little round, maybe max, or we'll each take a last step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8614.854,
    "end": 8623.062,
    "text": "Yeah, I'm just, you know, to as a lead into next week, I'm excited to hear about the neural process theory and really about, you know, looking at those dopamine traces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8623.122,
    "end": 8625.224,
    "text": "And it's cool to see the spiking that you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8625.817,
    "end": 8653.759,
    "text": " able to reproduce with this kind of a model structure that does reflect you know kind of how these actual neurobiological processes might look um one thing i'm really keen to hear about is um the you know the link function between your your gradient um on free energy and your dopamine expression or simulated dopamine expression levels and the the postulated link between um you know precision insofar as dopamine i mean these are things that i'm just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8654.198,
    "end": 8670.624,
    "text": " It's a little out of my realm, but I think it's really interesting because fundamentally that's such an elegant mechanism if it's that gradient only from a mathematical standpoint that it's really cool to tie that from the math and theory into empirical observation and using that to validate the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8674.105,
    "end": 8674.365,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8674.885,
    "end": 8675.806,
    "text": "Christopher or Ryan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8675.906,
    "end": 8676.786,
    "text": "Yeah, definitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8676.806,
    "end": 8677.827,
    "text": "Well, we're excited to show you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8678.727,
    "end": 8679.007,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8679.927,
    "end": 8681.688,
    "text": "Do either of you want to make any last comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8682.639,
    "end": 8684.1,
    "text": " No, this has been really fun.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8684.44,
    "end": 8684.86,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8684.98,
    "end": 8685.54,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8685.6,
    "end": 8685.96,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8686.0,
    "end": 8686.52,
    "text": "Thanks everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8686.901,
    "end": 8687.821,
    "text": "Talking this whole time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8687.881,
    "end": 8692.062,
    "text": "So I, I don't think people probably don't want to hear me ramble anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8692.583,
    "end": 8694.243,
    "text": "Not till next time at least, but yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8694.423,
    "end": 8697.664,
    "text": "Thanks everyone for watching live and in replay and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8697.685,
    "end": 8706.108,
    "text": "And just for participating because it's the conversations we're having, the real time errors we're finding and the learning that we're all contributing to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8706.228,
    "end": 8709.509,
    "text": "So just thanks everyone for participating and we'll see you later for next",
    "speaker": "SPEAKER_00"
  }
]