[
  {
    "start": 11.377,
    "end": 12.317,
    "text": " And we are live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.657,
    "end": 16.399,
    "text": "Hello, everyone, and welcome to Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.699,
    "end": 20.08,
    "text": "This is the third part in a four part series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.46,
    "end": 21.34,
    "text": "It is model stream 3.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.001,
    "end": 27.502,
    "text": "And today we are here with Ryan Smith and Christopher White and Max Murphy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.983,
    "end": 30.704,
    "text": "And we're going to be having a really interesting discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.764,
    "end": 32.124,
    "text": "So thanks, everyone, for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.344,
    "end": 37.786,
    "text": "Just to quickly introduce ourselves before we go to points of process and then into the material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.386,
    "end": 39.347,
    "text": " I'm Daniel Friedman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.667,
    "end": 41.568,
    "text": "I'm a postdoc in California.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.289,
    "end": 45.17,
    "text": "I'm Ryan Smith.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 45.91,
    "end": 50.092,
    "text": "I'm an investigator at the Laureate Institute for Brain Research in Tulsa, Oklahoma.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 50.112,
    "end": 52.914,
    "text": "Hi, I'm Christopher White.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 53.034,
    "end": 57.136,
    "text": "I'm a PhD student at the MRC Cognition Brain Sciences Unit in Cambridge, England.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 57.156,
    "end": 60.018,
    "text": "Hi, I'm Max Murphy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.158,
    "end": 62.459,
    "text": "I'm a postdoctoral fellow at Carnegie Mellon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.153,
    "end": 64.413,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.593,
    "end": 74.882,
    "text": "Thanks, everyone, for joining, for our panelists and the authors, for Max for contributing your experience, and also for everybody who's going to be live and in replay asking us questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.582,
    "end": 86.531,
    "text": "This is the third in a four-part series that is going to be highlighting different perspectives and addressing questions related to the Active Inference tutorial paper of Smith et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.952,
    "end": 90.595,
    "text": "from, I guess you could say 2020, but it's been versioned several times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.195,
    "end": 114.345,
    "text": " and that tutorial is called a step-by-step tutorial on active inference and its applications to empirical data so if you have any questions during the live stream you're more than welcome to type it in the live chat and we'll try to get to it if you have questions after this live stream just leave a comment and we're going to try to address it as well to learn more and to find out about participating check out active inference.org",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.526,
    "end": 115.826,
    "text": " That's all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.326,
    "end": 123.428,
    "text": "So for today, in our third session, we're going to be picking up with just a brief overview, even shorter than the second part's overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.968,
    "end": 127.209,
    "text": "And then we're going to be diving into two main sections today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.89,
    "end": 132.091,
    "text": "Ryan is going to be leading a section on the neural process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.731,
    "end": 136.553,
    "text": " And then Christopher is gonna be leading a section on hierarchical models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.933,
    "end": 138.915,
    "text": "So two very interesting topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.415,
    "end": 145.238,
    "text": "Let's just start with one warmup introductory question before we go to the neural process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.778,
    "end": 151.282,
    "text": "And my question would be, let's say somebody were sent just this third part of this four part series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.182,
    "end": 158.586,
    "text": " What would you say is the summary of the first two parts that we can catch them up with right now before we jump into these next two parts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.626,
    "end": 165.249,
    "text": "So what happened in the first two parts that led us to want to talk about the neural process theory and the hierarchical modeling today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.851,
    "end": 169.792,
    "text": "Okay, well, I can try to start to take a stab.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 169.872,
    "end": 175.595,
    "text": "Chris, feel free to add anything, but it's obviously a lot to summarize in just a couple seconds here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 176.175,
    "end": 181.498,
    "text": "But in session one, primarily we went over the kind of like broad",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 182.377,
    "end": 208.745,
    "text": " broad stroke sort of description of active inference, the ideas of how you can do approximate Bayesian inference to solve problems with perception and learning and decision making using free energy minimization and expected free energy minimization, where exact Bayesian inference just becomes intractable for most kind of real world problems when you're trying to do something cognitive or perceptual.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 210.559,
    "end": 215.201,
    "text": " And then we went over how to build specific task models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 216.001,
    "end": 226.524,
    "text": "And specifically, we used an explore-exploit, a simple sort of explore-exploit model, similar to a kind of behavioral task that you might use in an empirical study.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 226.544,
    "end": 238.288,
    "text": "And we just showed how, at the level of matrices and vectors and things like that, how you specify a generative model in order to simulate behavior on that kind of task.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 240.834,
    "end": 244.055,
    "text": " And that's more or less what we've covered so far.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 244.155,
    "end": 252.559,
    "text": "So the kind of general mathematics and motivation of active inference and how to apply it to model tasks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 253.939,
    "end": 258.901,
    "text": "But that was all, like I said, at the kind of computational and algorithmic level of description.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 260.142,
    "end": 269.086,
    "text": "Whereas one of the really nice things about active inference is that you have not only the computational and algorithmic level, but you also have an attached",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 269.65,
    "end": 294.616,
    "text": " what's called a neural process theory, which more or less corresponds to a specific hypothesis about ways that neurons and neural populations can be connected up in plausible ways to implement the active inference algorithms, and specifically the variational updating algorithms that are used to solve the sorts of tasks that you use to model with active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 295.497,
    "end": 296.737,
    "text": "So that's kind of where we're picking up is",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 297.321,
    "end": 319.651,
    "text": " now that we can build models and understand their background and motivation, how can we actually move this into neuroscience and make trial by trial predictions about what neural responses you ought to see, which you could, for example, feed in to like an fMRI experiment to see if you can actually find correlates of those predicted trial by trial responses.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 322.04,
    "end": 329.583,
    "text": " And just kind of add to that, I think the general way that you would feed it into an fMRI experiment would just be the standard way that people usually do this stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 329.603,
    "end": 333.925,
    "text": "So you just put it in and add it as a regressor into a GLM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 334.645,
    "end": 334.805,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 335.646,
    "end": 344.029,
    "text": "And as you'll see, we can also do, it's not just fMRI, you can also do it, I mean, the most direct predictions it makes are about ERPs and EEGs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 346.002,
    "end": 353.489,
    "text": " And we're going to talk about what the ERP is and the biology of it a little bit along the way and other frameworks for how people have interpreted it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.83,
    "end": 360.156,
    "text": "But yes, as we've kind of looked at a few different times, there's the observables, which are the behavior or the neuroimaging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.576,
    "end": 364.739,
    "text": " whether it's a fMRI or EEG or some other type of measurement technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.119,
    "end": 366.56,
    "text": "And then there's the measurement of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.96,
    "end": 373.824,
    "text": "And we're talking about models that start from those observables and then do some interesting generative modeling under the hood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.084,
    "end": 375.725,
    "text": "And that's where the power arises from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.185,
    "end": 380.508,
    "text": "So any other comments on that, Max, before we jump into part one with the neural process theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.771,
    "end": 406.805,
    "text": " No, I'm just, like I said last time, I'm excited to hear about tying in relating specifically, you know, gradients on, you know, variational free energy to, you know, dopamine expression and just hearing about like the links between those and why that might be an elegant way to kind of express things in terms of the neural process theory and what we know about the connectivity of these regions and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.266,
    "end": 409.727,
    "text": "Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.927,
    "end": 411.988,
    "text": "Then Ryan, take it away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.231,
    "end": 428.875,
    "text": " OK, so let me just share my screen here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 428.895,
    "end": 436.417,
    "text": "OK, so just as a kind of very brief, you know, sort of just catch people up a bit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 436.997,
    "end": 437.077,
    "text": "Uhm?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 441.172,
    "end": 447.254,
    "text": " So we started out, you know, like describing active inference, like I said, at the level of generative models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 448.675,
    "end": 453.736,
    "text": "And those, sorry, I'm trying to find the right figure here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 459.198,
    "end": 462.939,
    "text": "And those have this particular sort of graphical structure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 464.3,
    "end": 467.701,
    "text": "And just focusing on the one on the bottom right here, which is the full generative model,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 468.336,
    "end": 473.1,
    "text": " you have a particular set of observations over time, this 01, 02, 03 thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 473.7,
    "end": 479.705,
    "text": "And then you have particular hidden states, so beliefs about what's going on out in the world outside of the brain.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 480.346,
    "end": 485.13,
    "text": "And so you have your beliefs about what happened at time one, and then time two, and then time three.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 485.15,
    "end": 497.359,
    "text": "And this A matrix thing is what encodes the likelihood mapping or the belief about what outcomes will be present if particular states out in the world",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 498.548,
    "end": 499.008,
    "text": " are the case.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 500.869,
    "end": 511.132,
    "text": "And then you have beliefs about how, in this B matrix thing here, about how if you're in particular states at time one, how that's going to transition into different states at time two and so forth.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 512.132,
    "end": 517.194,
    "text": "And this D thing is just an initial prior about what states you're going to be at time one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 518.475,
    "end": 526.037,
    "text": "And then you have policies pi up here, which control, which allow the agent to control some of the transitions between states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 527.315,
    "end": 533.219,
    "text": " So for instance, the transition of moving my leg up versus down, right, would be something that the agent could control.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 534.719,
    "end": 543.124,
    "text": "And then policies are selected based on this G thing, which is the expected for energy, which is a function of C, which is your preferences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 543.684,
    "end": 545.806,
    "text": "So the outcomes that you prefer over others.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 546.806,
    "end": 555.651,
    "text": "So policies are selected that are going to transition between states that generate outcomes or observations that are as close to preferences as possible.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 556.948,
    "end": 565.693,
    "text": " And then policies are also in part controlled by E, which is a prior over policies that acts as a kind of influence of habits.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 566.533,
    "end": 585.002,
    "text": "And this gamma thing, which will be important in the neural process theory I'll talk about, which is essentially it's like a temperature parameter, more or less on like a dynamically updated temperature parameter that basically controls how much the expected free energy",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 585.843,
    "end": 588.384,
    "text": " contributes to policy selection.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 588.404,
    "end": 598.587,
    "text": "So it's basically saying, if I don't trust my model very much, then policy selection is going to be influenced by expected free energy less and by habits more.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 599.628,
    "end": 611.552,
    "text": "And the way the gamma is updated is through this hyperparameter beta, which again, we covered this all in a lot more detail last time, but I'm just kind of reminding the reader about the elements",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 612.324,
    "end": 620.991,
    "text": " that are going to correspond to different aspects of the neural process theory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 621.712,
    "end": 626.396,
    "text": "My only comment on this is, again, think about incremental layers of complexity in the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.516,
    "end": 635.183,
    "text": "On the top left is static perception, hidden states, observable states, and you're doing inference on the hidden states S given your prior D. So instantaneous",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.124,
    "end": 637.886,
    "text": " hidden state inference given observables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.227,
    "end": 642.953,
    "text": "Bottom left, you're talking about hidden states changing through time with the inference of a B matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.754,
    "end": 652.746,
    "text": "Top right, you introduce the idea that PI policy is going to intervene into how states change through time and that that policy is selected by a preference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.306,
    "end": 663.073,
    "text": " C that gets transmuted into a free energy G. And then the bottom right is the full fleshed out skeleton where we also see E, gamma, and beta as described by Ryan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.273,
    "end": 666.935,
    "text": "So just start top left, bottom left, top right, bottom right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.196,
    "end": 670.458,
    "text": "And that's adding up one more thing for each layer of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.518,
    "end": 672.659,
    "text": "And then now we're going to be working with the bottom right model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.64,
    "end": 675.021,
    "text": "Yep.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 675.261,
    "end": 678.683,
    "text": "And the last sort of important thing is about the underlying way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 678.964,
    "end": 682.226,
    "text": "So each of these equations on the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 683.298,
    "end": 684.458,
    "text": " at any of these boxes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 686.399,
    "end": 700.701,
    "text": "The way that you infer beliefs about states based on observations is through a set of equations that correspond to approximate Bayesian inference through minimizing free energy and expected free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 701.761,
    "end": 710.403,
    "text": "So the idea is more or less how the system, how in the neural process theory does the system settle on a set of posterior beliefs over states",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 711.381,
    "end": 722.527,
    "text": " through free energy, free energy minimization, and how in the brain that's going to correspond to the neural process theory to minimizing particular types of prediction errors.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 723.947,
    "end": 728.169,
    "text": "Now, but I want to be clear, though, that these sorts of prediction errors are not identical, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 728.209,
    "end": 739.595,
    "text": "This is not the same process theory as what's associated with predictive coding and perception, where predictive coding is a continuous states-based model as opposed to the discrete states-based models we're talking about that have categories.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 740.359,
    "end": 748.984,
    "text": " you can only be in state one, state two, state three, as opposed to the sorts of continuous state spaces associated with things like brightness, for example.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 750.625,
    "end": 757.25,
    "text": "So this has a similar kind of prediction error minimization flavor to predictive coding models, but it's not the same thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 759.151,
    "end": 769.237,
    "text": "So now, to start with, kind of abstractly, the way to see how prediction errors come in really naturally",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 769.969,
    "end": 797.502,
    "text": " is just to remember that free energy, right, one decomposition that we've talked about in previous sessions is you can think of free energy as being decomposed into a complexity term minus an accuracy term, where accuracy just means basically how close your predicted outcomes are to the observed outcomes, and complexity corresponds to basically how much you have to move your beliefs",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 798.338,
    "end": 821.148,
    "text": " from prior beliefs to posterior beliefs so minimizing free energy means coming to the beliefs that Change your beliefs as little as possible while also maximizing accuracy So so that's the kind of idea and a very kind of intuitive way to think of free energy and so given that definition of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 822.01,
    "end": 829.452,
    "text": " you can think of the gradients or the way that free energy changes with respect to these approximate posterior beliefs that we're trying to come to, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 829.752,
    "end": 833.292,
    "text": "These can always be expressed as a particular mixture of prediction errors.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 833.932,
    "end": 841.134,
    "text": "And you think about this as pretty intuitive because complexity, like I said, is just the average difference between posterior and prior beliefs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 841.834,
    "end": 846.295,
    "text": "So minimizing that difference can be seen as a type of prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 848.104,
    "end": 853.765,
    "text": " And minimizing and then accuracy is similarly just the difference between predicted and observed outcomes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 854.386,
    "end": 858.727,
    "text": "So minimizing that difference can also be seen as a type of prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 860.247,
    "end": 875.851,
    "text": "So active inference can be implemented then as this kind of prediction error minimization that just corresponds to a minimization of these two differences at a computational level of description as opposed to an algorithmic or neural level description.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 878.072,
    "end": 887.738,
    "text": " So the kind of standard and fairly daunting looking figures that you'll typically see in active inference papers associated with the neural process theory look something like this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 888.799,
    "end": 899.805,
    "text": "So on the left, you have a bunch of initially pretty scary equations that correspond to the actual kind of dynamics that a neural system is gonna have to implement.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 901.547,
    "end": 906.89,
    "text": "And then on the right, these kind of little fun kind of schematic ball neuron setups",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 907.386,
    "end": 918.373,
    "text": " where you have particular layers that are supposed to kind of, you know, kind of heuristically perhaps correspond to different layers of neurons and cortical columns.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 920.274,
    "end": 929.139,
    "text": "And each of these layers of neurons are sort of proposed, again, very just kind of like schematically, to correspond to different variables.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 929.84,
    "end": 936.484,
    "text": "And the equations over here and the synaptic connections correspond to particular mathematical operations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 937.176,
    "end": 949.324,
    "text": " So here kind of the easy way to think about it is that these red connections here are excitatory or excitatory just means addition in the equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 950.025,
    "end": 961.012,
    "text": "Whereas these inhibitory bluish purple connections with the balls at the end instead of the arrows are inhibitory, which just means subtraction in the equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 961.673,
    "end": 965.355,
    "text": "Whereas the green modulatory connections",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 966.806,
    "end": 972.21,
    "text": " that just corresponds to multiplication in the update equations on the other side of the panel.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 972.23,
    "end": 982.957,
    "text": "So the idea is that using this kind of scheme, you can just follow along, just follow the synapses and the ball neurons that correspond to the particular variables.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 984.539,
    "end": 993.825,
    "text": "And you can kind of get a sense of how you can just connect up neurons like this to solve the equations that need to be solved to implement active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 995.379,
    "end": 999.081,
    "text": " say one thing about this I think makes it a little bit more intuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 999.161,
    "end": 1014.087,
    "text": "Because all of the updates are done in log space, addition and basically adding or putting probability distributions together is just addition and subtraction, which is nice thinking about in terms of this scheme.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1014.127,
    "end": 1018.629,
    "text": "Then generally speaking, the modular tree connections will correspond to some precision parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1021.269,
    "end": 1024.391,
    "text": " which will modulate the precision of the distribution, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1024.732,
    "end": 1033.238,
    "text": "So that's kind of how you can think about the, or I find that helpful in thinking about the relationship between something like this and the actual update equations themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1034.761,
    "end": 1035.622,
    "text": " Yeah, absolutely.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1036.202,
    "end": 1037.143,
    "text": "Thanks for adding that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1037.323,
    "end": 1039.764,
    "text": "It's almost like the anatomy of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.265,
    "end": 1047.029,
    "text": "We're doing a schematic neuroanatomy that's simplified or abstracted based upon the actual patterns of neural connections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.57,
    "end": 1058.898,
    "text": "And then we're looking at the anatomy of this computational model and thinking about how it could be plausibly carried out on neural systems, neural processes, but also it stands alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.918,
    "end": 1060.659,
    "text": "And so this is just another way that we can look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.806,
    "end": 1073.091,
    "text": " Yeah, so another thing that I really want to be clear about is that active inference per se isn't committed to this particular implementation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1074.052,
    "end": 1080.715,
    "text": "There's quite a few different ways that you could come up with to connect a bunch of neurons together to solve these equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1081.235,
    "end": 1088.939,
    "text": "So there's not kind of a one-to-one mapping between the way that the equations look and the way that neurons could solve those equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1090.079,
    "end": 1091.16,
    "text": "So this is an example.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1091.826,
    "end": 1094.548,
    "text": " But ultimately, it's a separate empirical question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1095.368,
    "end": 1102.153,
    "text": "What way the brain is actually set up to solve these equations, even if those equations are what are being solved?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1103.714,
    "end": 1104.174,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1104.775,
    "end": 1111.379,
    "text": "And even if so, then we can also, let's say it turns out variational message passing or like marginal message passing is just a really bad metaphor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1111.479,
    "end": 1116.502,
    "text": "Well, that's fine because we've got all sorts of other things like belief propagation, blah, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1116.602,
    "end": 1117.263,
    "text": "And they can all",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1119.537,
    "end": 1125.402,
    "text": " I think the main thing is that you're minimizing variational free energy and expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1126.343,
    "end": 1136.292,
    "text": "The rest is part of specific parts of a process theory that we can hopefully falsify or at least more realistically not find useful anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1137.797,
    "end": 1139.658,
    "text": " And just sorry, one more note on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.698,
    "end": 1144.322,
    "text": "You brought up how there's the computational and the algorithmic levels and we're in the process theory realm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.522,
    "end": 1150.726,
    "text": "So for those who might not be familiar with process theory or Mars levels of analysis, the computational level is like the function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.846,
    "end": 1153.628,
    "text": "Like you have to sort a list from the biggest to the smallest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1153.988,
    "end": 1155.889,
    "text": "You can't falsify that idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.25,
    "end": 1157.731,
    "text": "It's computational, it's functional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1158.311,
    "end": 1160.652,
    "text": " Then you go one layer down into the algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.753,
    "end": 1162.354,
    "text": "So you say, I have a sorting algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.454,
    "end": 1169.518,
    "text": "There's many sorting algorithms, but this is the implementation as it's actually going to be written in a certain pseudo code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.958,
    "end": 1174.501,
    "text": "So that's one of many possible algorithms that do a certain computational task like sorting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.941,
    "end": 1178.684,
    "text": "And then the process theory is like the specific program you can think of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.044,
    "end": 1180.645,
    "text": "It's the actual implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.985,
    "end": 1185.488,
    "text": "Now, as to whether it's actually being implemented that way, you might be right or wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.908,
    "end": 1190.094,
    "text": " So that's what we're talking about with the falsification of the process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.535,
    "end": 1193.599,
    "text": "But at the computational level, it's what Christopher just said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.779,
    "end": 1196.704,
    "text": "It's the imperatives that there's a free energy minimization happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.024,
    "end": 1202.192,
    "text": "And now we want to be building up specific plausible examples to work within that framework for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.692,
    "end": 1229.325,
    "text": " Just to jump in real quick, it sounds like in the next stream we might be discussing more of these empirical examples and instantiations, but just to say that from the biological standpoint of what's going on, for example, when we talk about a modulatory layer, that could happen in a multitude of different ways in terms of changing what the membrane potential of the cell is and making it more responsive or receptive to being activated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.867,
    "end": 1240.415,
    "text": " or it could happen through, you know, gradual plastic processes that recruit more receptors to the surface and cause it to become more responsive to any individual message.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1240.455,
    "end": 1246.9,
    "text": "So it's really going to be context-specific and depend on the experiment and what circuit we are specifically studying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.221,
    "end": 1249.122,
    "text": "Yeah, absolutely.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1249.222,
    "end": 1256.888,
    "text": "And I mean, the thing you mentioned about plasticity makes an important point that I should make sure that I, you know, I might have forgot to mention, but",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1257.435,
    "end": 1263.876,
    "text": " But so in the context of inference, right, over the shortest time scales, we're just getting observations, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1263.956,
    "end": 1272.057,
    "text": "And based on the way that these, the current weights of all these connections, the system is just going to settle on a free energy minimum, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1272.097,
    "end": 1273.318,
    "text": "Like a prediction error minimum.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1273.998,
    "end": 1286.76,
    "text": "And then the activation patterns in these neurons, specifically these ones at the top here, the S pi T and S or S pi tau and S tau are going to be the posterior beliefs about what states you're in.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1287.689,
    "end": 1295.874,
    "text": " Um, and, uh, but that's, again, just given a fixed set of synaptic connections that corresponds to your generative model now.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1296.714,
    "end": 1309.341,
    "text": "Um, but with learning, like we discussed last time when we showed learning simulations, learning corresponds to slowly changing the synaptic, the strength of the, uh, each of these synaptic connections themselves.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1310.242,
    "end": 1315.525,
    "text": "Um, so you also over slower timescales minimize expected free energy, um, and variational free energy, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1317.128,
    "end": 1333.434,
    "text": " through changing these connection strengths, again, over slower timescales via kind of synaptic plasticity processes like long-term potentiation and long-term depression, for example, as a way of improving the accuracy of your generative model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1334.775,
    "end": 1343.218,
    "text": "So just to kind of reiterate, inference corresponds to changing activity levels, whereas learning corresponds to changing synaptic strengths.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1344.878,
    "end": 1345.419,
    "text": "So if that's...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1346.892,
    "end": 1347.252,
    "text": " helpful.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1348.132,
    "end": 1354.254,
    "text": "Um, so, so again, yeah, I mean, like, like they were saying, you have basically three different levels of hypotheses to test.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1354.374,
    "end": 1364.878,
    "text": "One is at the computational level, does the brain, uh, minimize free energy and expected free energy, or at least is it helpful to describe it as doing that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1365.538,
    "end": 1372.14,
    "text": "Um, and then second question is given that that first one is true, which of several different algorithms is the brain using?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1372.16,
    "end": 1375.961,
    "text": "And then question three is given that it's using a given a specific algorithm,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1376.952,
    "end": 1381.213,
    "text": " how is the brain set up to implement that algorithm?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1381.413,
    "end": 1383.594,
    "text": "So there's kind of a one-to-many mapping between each level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1385.034,
    "end": 1394.577,
    "text": "And a final point to make is actually some people talk about these different, quote-unquote, Marian levels of computational level, algorithmic level, and implementation level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1395.057,
    "end": 1405.481,
    "text": "People talk about them as though they're entirely independent, but they're actually not necessarily independent in all cases because sometimes the algorithm can depend a bit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1405.541,
    "end": 1406.441,
    "text": "There can be dependencies.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1407.228,
    "end": 1418.691,
    "text": " between the algorithm and the implementation, because some of the things that the algorithm is going to have to compute are things about, for instance, like energy costs, which are going to depend on the implementation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1419.631,
    "end": 1423.192,
    "text": "So anyway, just as kind of a side point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1423.912,
    "end": 1430.654,
    "text": "But in general, just to kind of walk you through a sense here, so you might start out with these observations at the bottom.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1431.528,
    "end": 1440.273,
    "text": " These are going to go up through these excitatory connections to this pink layer three here, which is going to correspond to the state prediction error we'll talk about.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1440.293,
    "end": 1446.016,
    "text": "These excitatory connections are going to drive increases in activity in these pink guys.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1447.757,
    "end": 1456.521,
    "text": "Those are going to be inhibited by prior beliefs about states at this higher level, which jointly is going to lead this level to decrease",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1460.376,
    "end": 1471.341,
    "text": " while the system finds states up here at the level above that best account for or predict those observations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1471.361,
    "end": 1481.226,
    "text": "So these red arrows going up here can correspond to interactions between A and O in these equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1482.006,
    "end": 1487.169,
    "text": "And so you can walk your way through kind of step by step, and we do this kind of step by step in the paper,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1487.694,
    "end": 1494.198,
    "text": " where each of these, um, interactions, um, corresponds to elements in the equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1494.478,
    "end": 1498.94,
    "text": "So for instance, like to get States, to get States up here, right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1498.96,
    "end": 1501.782,
    "text": "That corresponds to this fourth equation down.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1502.542,
    "end": 1509.206,
    "text": "And that's by multiplying policies, um, by States given policies, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1509.246,
    "end": 1515.79,
    "text": "So pie here, multiplying the, uh, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1516.394,
    "end": 1518.895,
    "text": " the S's and the T's here that are added.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1518.996,
    "end": 1523.518,
    "text": "So we'll lead to the posteriors over states, just as one example.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1525.159,
    "end": 1535.385,
    "text": "And then another thing that's important to stress is a lot of times you'll notice in these diagrams that there are kind of multiple rows kind of going backwards.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1535.405,
    "end": 1539.047,
    "text": "So there's like these three pink ones and then these three other pink ones behind them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1540.168,
    "end": 1540.908,
    "text": "And that's because",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1542.532,
    "end": 1549.838,
    "text": " each of these posterior beliefs over states the system's trying to come to are with respect to a particular policy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1550.379,
    "end": 1559.766,
    "text": "So the thing is actually calculating what its beliefs would be under each of many policies where each of these rows corresponds to a policy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1561.107,
    "end": 1571.436,
    "text": "And that's what allows it to then infer a distribution over policies based on the states that are expected under each policy and the outcomes that they are expected to generate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1572.293,
    "end": 1578.096,
    "text": " Um, so, so again, I'm not going to kind of do this for you now, just cause it would take forever.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1578.617,
    "end": 1599.969,
    "text": "But if you just kind of look at each of these equations, um, you know, where addition is, where multiplication is, et cetera, then you'll find, um, that these connections, um, you know, basically reiterate or, or show how, uh, uh, how this can implement, uh, how the neural connections can implement each of these equations, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1602.267,
    "end": 1614.24,
    "text": " But to kind of go into certain aspects of how this would work and where the neural processor really comes in in terms of making empirical predictions,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1615.911,
    "end": 1623.857,
    "text": " Just to jump in real quick, for the sake of moving forward, just to help me thinking about what the biology is as we start to talk about the neural process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.138,
    "end": 1630.082,
    "text": "Here, you have pi, and you have kind of like, you know, connections that are inhibitory, excitatory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.123,
    "end": 1640.271,
    "text": "Sometimes when I think about phenomena in the biology, you know, you have an emergent concept that's the result of kind of a population of cells.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1640.571,
    "end": 1641.652,
    "text": "In this case, would it be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1642.272,
    "end": 1653.181,
    "text": " better to think of this, like, a policy as the actual, like, you know, the activation, I'm looking at a single neuron, or am I going to be thinking about that, like, at a, you know, a layer or a population level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1653.821,
    "end": 1655.463,
    "text": "Oh, yeah, yeah, no, very, very good point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1655.503,
    "end": 1662.748,
    "text": "I mean, like I said, these are very schematic, and in any active inference paper, you'll see that, you know, the statement is that HG's balls are supposed to correspond to a population of neurons.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1663.249,
    "end": 1663.569,
    "text": "Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1664.089,
    "end": 1667.272,
    "text": "Right, so a population where, I mean, just as one example, right, like,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1667.848,
    "end": 1673.811,
    "text": " one subset of neurons in a given population might encode the expected free energy of each policy, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1673.831,
    "end": 1682.995,
    "text": "So activation across the population of neurons would encode, for instance, a distribution over all the policies being considered or something along those lines.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1683.095,
    "end": 1689.418,
    "text": "So yeah, no one's thinking about this as each of these being single neurons that are solving all of this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1689.478,
    "end": 1694.061,
    "text": "I mean, that would be a really vulnerable system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1694.781,
    "end": 1696.322,
    "text": "Very little damage to that system would",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1697.259,
    "end": 1698.859,
    "text": " knock the whole thing out.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1699.499,
    "end": 1709.321,
    "text": "So, yes, definitely they're supposed to correspond to populations, but a lot of the details of that is really kind of underspecified in the theory as stated.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1709.361,
    "end": 1712.722,
    "text": "It's still fairly abstract, kind of at the level I'm showing here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1714.822,
    "end": 1719.203,
    "text": "So, is that helpful?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1719.963,
    "end": 1721.023,
    "text": "Yeah, yeah, that does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1721.683,
    "end": 1722.784,
    "text": "Okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1723.864,
    "end": 1724.604,
    "text": "So, okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1725.259,
    "end": 1731.821,
    "text": " So the first ones here to focus on the left are so this epsilon pi tau thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1732.741,
    "end": 1734.841,
    "text": "And this is what's called state prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1736.242,
    "end": 1742.323,
    "text": "And more or less what this does is by minimizing this, we end up with a posterior over states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1744.044,
    "end": 1752.026,
    "text": "And then the actual variational free energy for each policy is just calculated based on beliefs about states and that error signal.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1753.777,
    "end": 1765.199,
    "text": " So, and this corresponds to layer three and layer two here in the schematic on the right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1766.639,
    "end": 1774.481,
    "text": "So to give you a sense, so in the paper we show a specific example, like a worked example of calculating this kind of prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1775.781,
    "end": 1783.142,
    "text": "And so what this says, so this is the prediction error for each policy, for each time point tau.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1784.733,
    "end": 1801.077,
    "text": " And the first part here, this one half ln b pi tau s pi tau minus one, et cetera, all the way over, the whole thing here with the b's that are multiplied by one half, you can think of this whole entire thing as your prior expectation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1802.157,
    "end": 1812.559,
    "text": "So b from pi tau minus one, this is saying what do I expect about my current state given the state that I was just in before?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1813.505,
    "end": 1816.828,
    "text": " Um, whereas this one is something a little more interesting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1817.308,
    "end": 1823.253,
    "text": "It's saying, um, this is saying sort of beliefs about, um, expectations that come from the future.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1823.934,
    "end": 1830.519,
    "text": "So, you know, what are my beliefs about a state at a given time, given my beliefs about the state after that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1831.3,
    "end": 1841.648,
    "text": "Um, and, um, you know, this, this might seem a little bit counterintuitive, but, um, it allows for a retrospective inference, um, which is something that humans definitely do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1841.729,
    "end": 1842.229,
    "text": "So think about.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1842.622,
    "end": 1849.287,
    "text": " Think about a case where you're sitting in a room and it's dark and you don't know whether the room is the green room or the red room.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1851.609,
    "end": 1856.533,
    "text": "But you sit there for like five minutes and then all of a sudden you turn on the light and you see that the room is red.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1857.514,
    "end": 1862.638,
    "text": "You don't just infer I'm in a red room now, you infer I've been in a red room the whole time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1863.719,
    "end": 1869.044,
    "text": "So your beliefs about the past are updated based on your beliefs about the current time point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1870.205,
    "end": 1871.386,
    "text": "So what this",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1872.265,
    "end": 1883.61,
    "text": " Second B here, so expectations propagating from the future to the past allows you to come to beliefs about the states you were in at earlier times based on beliefs about later times.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1886.171,
    "end": 1899.837,
    "text": "And so it's important to also reiterate here that each of these S's, S for pi, you know, S pi tau minus one, these beliefs about each S at each time point are updated at every time point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1900.501,
    "end": 1905.804,
    "text": " So at time three, I can observe something and update my belief about the state at time one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1906.585,
    "end": 1918.972,
    "text": "Um, so this is kind of being recomputed, um, at each time point with a new observation, but about each time point, um, you know, in both the past and the future, um, as well as the present.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1919.652,
    "end": 1928.537,
    "text": "Um, so, so broadly then this whole thing, this one half times both of these, um, B's and S's is your prior expectation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1928.557,
    "end": 1928.597,
    "text": "Um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1930.014,
    "end": 1941.477,
    "text": " And then that gets added to the likelihood function here, which is so A times O, which is the actual observation at a given time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1942.097,
    "end": 1945.878,
    "text": "And so this is like your, this thing together is like your likelihood.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1947.139,
    "end": 1956.461,
    "text": "So this, again, is very similar to just kind of another form of representing Bayes' theorem, where you have priors and you have a likelihood.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1957.039,
    "end": 1961.182,
    "text": " and you're trying to come to something that will inform your posterior beliefs over states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1962.903,
    "end": 1968.746,
    "text": "And then that whole thing is subtracted from beliefs about the current state at that moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1969.967,
    "end": 1979.172,
    "text": "And more or less, if you just kind of run this over and over again, you'll settle on a set of beliefs about states that minimizes this thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1980.193,
    "end": 1986.777,
    "text": "And just to show an example of that, we specify here what A could look like.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1987.285,
    "end": 2004.628,
    "text": " So in this case, state one versus state two, the two columns, state one would generate, say, observation one with 0.8, whereas state two here in the right column would generate outcome one with 0.4 and so forth.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2005.228,
    "end": 2006.809,
    "text": "So that would be your likelihood.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2008.849,
    "end": 2013.97,
    "text": "Now, B here, like I said before, this is your prior from based on the previous time point.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2014.69,
    "end": 2034.747,
    "text": " And here we're just saying column again, here is state at time tau and row is at time tau minus one or, uh, you know, from tau minus one, or this is basically, this is saying, given that I was in a, given that I was in a state at time tau, what is my belief about the state I'll transition to?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2034.767,
    "end": 2040.932,
    "text": "So this is saying, I believe if I'm in state one, I'm most likely staying at state one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2041.819,
    "end": 2044.802,
    "text": " But there's a 0.2 probability that I could move to state 2.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2047.184,
    "end": 2056.712,
    "text": "Whereas the b pi tau is 0.3, 0.3, and 0.7, 0.7, which means no matter what, I expect it's more likely I'm going to move to state 2.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2058.513,
    "end": 2062.176,
    "text": "And then what I actually observe is outcome 1.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2064.018,
    "end": 2067.02,
    "text": "And my prior beliefs are just 0.5, 0.5.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2067.101,
    "end": 2067.581,
    "text": "So I have no",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2069.522,
    "end": 2071.863,
    "text": " I didn't have a strong prior either way to start with.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2073.304,
    "end": 2080.707,
    "text": "And this V thing is just a depolarization variable, which doesn't come into this predictionary equation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2080.727,
    "end": 2083.228,
    "text": "So I'll just kind of leave that for below.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2084.508,
    "end": 2097.494,
    "text": "So this is just an example of how if you plug in each of these things into this equation, then just kind of follow along with the numbers, eventually you'll end up with",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2098.197,
    "end": 2103.039,
    "text": " this prediction error, this negative 0.2231, negative 0.99163.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2106.08,
    "end": 2122.726,
    "text": "And you can think about, so then if we move here, then we can take this V, which is your initial kind of depolarization level in a given neuron.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2123.187,
    "end": 2125.367,
    "text": "Then you add the prediction error to that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2126.168,
    "end": 2127.048,
    "text": "So the depolarization,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2127.403,
    "end": 2128.844,
    "text": " depolarization level changes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2128.864,
    "end": 2146.893,
    "text": "So this would be a change in the activity level of the neuron in terms of depolarization, but then posteriors over states then correspond to normalizing, putting a softmax over this depolarization, which then turns it into your actual posterior over states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2147.554,
    "end": 2152.917,
    "text": "So this ultimately says my posterior belief is that I'm more likely in state one, 0.66767,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2156.311,
    "end": 2159.332,
    "text": " then in being in state 2.3333.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2160.413,
    "end": 2169.676,
    "text": "And this then would correspond to the firing rates in the process theory associated with each possible state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2170.256,
    "end": 2176.239,
    "text": "So V is going to be your depolarization and S is going to be the resulting firing rates.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2177.399,
    "end": 2178.499,
    "text": "Just add something to this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2178.74,
    "end": 2183.741,
    "text": "So generally thinking E here, or sorry, not E. Epsilon, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2183.821,
    "end": 2185.162,
    "text": "Epsilon, yeah, a little epsilon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.028,
    "end": 2187.65,
    "text": " is a free energy gradient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2190.852,
    "end": 2192.334,
    "text": "It is a variational free energy gradient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2192.774,
    "end": 2205.325,
    "text": "And then what we end up doing here when we're adding, essentially when we have V, when we're plusing our negative free energy gradient, we're essentially just doing a gradient descent on variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.485,
    "end": 2207.066,
    "text": "That's exactly what this is actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2207.526,
    "end": 2208.888,
    "text": "And that's how it's implemented in the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2209.248,
    "end": 2213.051,
    "text": "The only difference between this and what we're doing in the code is that we have a little step",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2215.015,
    "end": 2221.299,
    "text": " So we divide our epsilon by like two or whatever our time constant for gradient descent is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.64,
    "end": 2236.748,
    "text": "So when, you know, tying it back to that previous schematic that we had, where we had the arrows that we're excited toward in here, we're adding this on to the putative, you know, memory and potential that we have described here that might reflect these kind of probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2237.301,
    "end": 2261.832,
    "text": " then if we have this kind of, perhaps if this were an excitatory interaction that we were looking at, then maybe if that excitatory interaction from one particular layer to another was representing that variational free energy gradient, we might expect to see this kind of response and we might measure that in terms of some kind of related biomarker of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.892,
    "end": 2263.153,
    "text": "Is that more or less the gist?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.011,
    "end": 2271.173,
    "text": " Yeah, I mean, so, well, I mean, just to go back to the kind of schematic here, like where this is happening is like right here, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2271.294,
    "end": 2274.475,
    "text": "So you have B from time one, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2274.975,
    "end": 2276.135,
    "text": "Which is this purple guy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2276.595,
    "end": 2289.02,
    "text": "So S through B from the previous time point adds on to the prediction error at the current time point and S from the future, uh, belief about the future also adds here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2289.68,
    "end": 2292.761,
    "text": "Whereas the likelihood a, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2297.526,
    "end": 2302.128,
    "text": " Yeah, is added from, oh, there's this inhibitory thing here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2303.348,
    "end": 2311.472,
    "text": "Anyway, I mean, so that's the, I have to walk through a little bit to figure out where this inhibitory one is coming from.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2311.492,
    "end": 2315.794,
    "text": "Oh, this is the minus LN.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2315.874,
    "end": 2317.294,
    "text": "Yeah, the current state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2317.314,
    "end": 2319.755,
    "text": "Yeah, yeah, okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2319.775,
    "end": 2322.436,
    "text": "But anyway, so that's kind of as an example.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2323.777,
    "end": 2325.237,
    "text": "But yeah, so.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2327.492,
    "end": 2336.274,
    "text": " So by doing that, you get this posterior overstates that gives you both predicted depolarization levels in cells and predicted firing rates.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2337.614,
    "end": 2348.076,
    "text": "That being said, those in and of themselves are not that easy to measure empirically unless you're doing like single cell recording or something like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2348.376,
    "end": 2356.657,
    "text": "So the idea that gets taken sort of from here is how you can get from these predicted firing rates to something that you can measure",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2357.767,
    "end": 2377.979,
    "text": " like event-related potentials in doing EEG or electroencephalography, where you have a bunch of electrodes basically attached to somebody's scalp, and you're measuring changes in neural activity, changes in potentials through the scalp from the brain when a person is exposed to a particular stimulus.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2379.7,
    "end": 2385.483,
    "text": "And the neural process theory, the kind of prediction is that the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2387.426,
    "end": 2396.872,
    "text": " ERPs are going to correspond to the rate of change in beliefs, which is going to be the rate of change in, where is this slide?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2400.354,
    "end": 2407.278,
    "text": "The rate of change in V, the rate of change in this depolarization thing, which is going to be the prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2407.938,
    "end": 2414.282,
    "text": "So just to show an example of this that me and Chris published recently,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2415.586,
    "end": 2427.028,
    "text": " in the literature on visual consciousness, you know, there's a big interest in what ERPs are specific to having conscious experience.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2428.288,
    "end": 2443.811,
    "text": "And an example of an ERP that in the past has been linked to conscious experience, but more recently there's been some sort of controversy because it looks like you can get these P3 potentials in a way that's",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2444.992,
    "end": 2447.153,
    "text": " not specific to conscious experience.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2447.893,
    "end": 2457.538,
    "text": "Um, and so we were interested in seeing whether the neural process theory, um, would allow us to kind of show, um, where this is coming from and could reconcile, um, these sorts of results.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2458.378,
    "end": 2470.164,
    "text": "Um, and so it was based on this really kind of simple paradigm where you start out, um, the person starts out looking at a stimulus like this, where there's just these red discs and these, um, kind of slanty lines.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2471.045,
    "end": 2471.725,
    "text": "Um, and then,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2472.671,
    "end": 2481.277,
    "text": " In some trials, what will happen is they'll kind of transiently be a little square here that comes up in the midst of these slanty lines.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2482.018,
    "end": 2482.638,
    "text": "Then it'll go away.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2485.0,
    "end": 2495.467,
    "text": "And basically what the manipulation is, is in some cases you have the person focus specifically on these red disks on the outside to see if they change color.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2497.048,
    "end": 2502.392,
    "text": "And then you ask at the end, did you ever notice these square things that pop up?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2504.394,
    "end": 2517.118,
    "text": " And there are cases when they do see the square and cases when they don't, and you're looking for differences in ERPs corresponding to when they do versus they don't under conditions of different sorts of attention.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2517.138,
    "end": 2528.842,
    "text": "And so what we were trying to do is to see whether when you built an active inference model,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2529.528,
    "end": 2554.926,
    "text": " that um that corresponded to this particular um attention uh task um it's called an inattentional blindness task um you know could we reproduce the the p3 pattern so this kind of in red here this extra um um dip um in uh neural activity as measured by eeg that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2555.85,
    "end": 2566.134,
    "text": " looks like it typically only happens when a person consciously experiences something, but with these recent exceptions, where it looks like it depends just on whether a stimulus is task relevant or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2567.555,
    "end": 2572.416,
    "text": "Chris, actually, I think this was primarily your work, so maybe you could describe this in a little more detail.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2573.077,
    "end": 2573.677,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2573.697,
    "end": 2580.66,
    "text": "First of all, I think that just give a shout out because we forgot to reference it on the slides, is this paradigm was designed by Michael Pitts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2582.66,
    "end": 2587.923,
    "text": " And he has done a lot of really incredible empirical work on visual consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2588.063,
    "end": 2591.024,
    "text": "So just kind of important to acknowledge that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2591.244,
    "end": 2595.206,
    "text": "Anyway, so generally they speak, there's three phases in this experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.266,
    "end": 2599.048,
    "text": "So phase one is they're not told there's going to be a square kind of self-assemble.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2599.848,
    "end": 2603.21,
    "text": "And they're asked just to monitor the disks on the outside and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2603.851,
    "end": 2614.94,
    "text": " there's a huge literature on this, but generally speaking, inattentional blindness, when you have a setup that's kind of analogous to that, about 50% of people are inattentionally blind to whatever your manipulation is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2615.54,
    "end": 2625.589,
    "text": "So I think the really famous one is like a group, if you ask people, like monitor how many times a basketball is being passed back and forth between a group of people, a gorilla can walk past and wave at people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2626.249,
    "end": 2629.672,
    "text": "And about 50% of them don't report seeing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.214,
    "end": 2633.455,
    "text": "So the idea here is just kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2633.931,
    "end": 2660.539,
    "text": " operationalize that a little bit more carefully and then in phase two is after everyone's kind of been because like literally when you ask people after phase one hey did you see a square you're kind of alerting to them the fact that there was a square present there but it's still not the square is still not task relevant so in phase two they just do exactly the same task monitor the external disks and in phase three the manipulation is they then say okay well we now want you to count how many times or like hit a button whenever the square appears",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.181,
    "end": 2667.385,
    "text": " And so the idea was, was that if you kind of see here, when we say percent scene, we basically set a hierarchical model, which we're going to look at in a minute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2668.006,
    "end": 2672.549,
    "text": "And we just had it kind of report what type of trial it thought it was in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2672.749,
    "end": 2679.993,
    "text": "Did it see a line or not where a line was just like a cat of this categorical variable, or did it see a square?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2680.013,
    "end": 2689.96,
    "text": "Um, and essentially we just, in the same way that you might in psychophysics, like titrate the stimulus or the contrast of a stimulus or whatever,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.285,
    "end": 2691.906,
    "text": " until people see it 50% of the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2691.926,
    "end": 2700.868,
    "text": "Basically what we did was we titrated it until the model saw it 50% of the time or titrate the precision of the A matrix kind of corresponding to contrast or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2701.628,
    "end": 2708.491,
    "text": "And then we just manipulate attention where attention corresponds to basically how precise the model's A matrix was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2709.371,
    "end": 2719.414,
    "text": "And what we showed was that when attention, which we operationalized as basically like we had two steps of attention, we had focal attention and like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2719.884,
    "end": 2721.645,
    "text": " super precise task-relevant attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2722.205,
    "end": 2727.808,
    "text": "When there was just the focal attention condition, the model reported seeing the thing 99% of the time, so basically all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2728.729,
    "end": 2738.034,
    "text": "And when there was precise task-relevant attention, the model reported seeing it 100% of the time again, but we see a dissociation between the presence of the P3 in line with empirical results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2738.634,
    "end": 2742.236,
    "text": "And so the idea... So I can actually just highlight this since I'm the one with the cursor.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2742.836,
    "end": 2748.099,
    "text": "So in this first condition, so this is when, like Chris said, the thing had no...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2748.792,
    "end": 2756.72,
    "text": " expectation that there's going to be any square there, and the precision of the A matrix was low because there was no attention.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2757.821,
    "end": 2761.925,
    "text": "So as a result, the ERP, the simulated ERP is flat.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2763.146,
    "end": 2771.254,
    "text": "And similarly, the second dip here, which is what would correspond to a dip here, is absent.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2772.973,
    "end": 2776.136,
    "text": " And here at the bottom are the simulated firing rates.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2776.436,
    "end": 2788.286,
    "text": "So in the first level, basically when black at the bottom changes to black at the top, that just means it starts to believe the upper row is a belief that the square was present and the bottom is the belief that the square was absent.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2788.887,
    "end": 2798.555,
    "text": "So basically what this means is when it goes from black at the bottom to black at the top, that the belief changes so it's more likely that the stimulus was present.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2800.259,
    "end": 2813.326,
    "text": " And then, um, but you can see because the A matrix is, uh, imprecise, then, um, which corresponds to like a low stimulus strength, then this, um, then this is not very, uh, you know, it's still pretty blurry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2813.966,
    "end": 2822.871,
    "text": "And then at the second level, these are beliefs about sequences that are what's actually going to, in other words, did it go from no square to square and back to no square?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2822.891,
    "end": 2829.675,
    "text": "Um, and so you can see that the beliefs remain really imprecise, um, because it's not, uh,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2830.342,
    "end": 2831.843,
    "text": " It's not attending to it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2831.903,
    "end": 2833.464,
    "text": "It's not task relevant.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2834.265,
    "end": 2847.576,
    "text": "In this case, though, like Chris was talking about, you can see that even though it's not task relevant, the beliefs at the higher level ultimately do converge onto this top row, which is the one where the square was present.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2848.596,
    "end": 2850.978,
    "text": "But you can see that the beliefs change pretty gradually.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2852.239,
    "end": 2855.802,
    "text": "Whereas when attention was precise because it was task relevant,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2856.48,
    "end": 2868.368,
    "text": " then you can see that the belief changes from being kind of flat over these two possible top states to being black, fully confident that the square turned on and off.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2870.029,
    "end": 2876.693,
    "text": "And that really quick change in beliefs is what corresponds to the strong ERP.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2876.833,
    "end": 2881.196,
    "text": "And in this case, because of the higher level, it's a kind of late ERP corresponding to the P3.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2882.397,
    "end": 2885.639,
    "text": "So really what's going on is the prediction of the neural process theory",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2886.457,
    "end": 2894.639,
    "text": " is that it's going to be the rate of change in beliefs, basically, that is what's going to be measured as an ERP.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2895.319,
    "end": 2898.52,
    "text": "Do you have anything further you want to say about that, Chris?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2899.18,
    "end": 2900.02,
    "text": "No, not at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2900.04,
    "end": 2912.944,
    "text": "I mean, one thing I just want to highlight is the only difference between phase one and phase two is a very slight difference in the precision of the A matrix that we took to basically be the addition of some slight focal attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2915.442,
    "end": 2929.054,
    "text": " But you can see just looking at the figures, it really made a very minor difference, but it still bumped it up above the threshold just enough for it to basically go from 50 percent report to basically 100 percent report.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2930.236,
    "end": 2934.881,
    "text": " Just also one point on the ERP or the event-related potential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.001,
    "end": 2937.023,
    "text": "It's defined on the bottom left of the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.563,
    "end": 2944.089,
    "text": "It's like a population-level measure of the electromagnetic activity in populations of cells in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.83,
    "end": 2950.836,
    "text": "And so it's kind of like on the left, if something's passing under the radar, the population is not changing in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.157,
    "end": 2980.13,
    "text": " broad strokes but then when there's this event that's task relevant it transiently synchronizes the population to be doing certain things in a certain timing and then that's reflected by changes in the population level electromagnetism patterns reflected by what are called ERPs but there's a whole literature with Friston and many others on this topic yeah so basically ERPs are just depolarization of dendritic trees um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2981.24,
    "end": 2983.041,
    "text": " Yeah, which corresponds to the prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2983.462,
    "end": 2984.783,
    "text": "Yeah, which corresponds to prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2985.723,
    "end": 2985.983,
    "text": "Cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2986.023,
    "end": 2997.852,
    "text": "So basically, as prediction error initially goes up and then goes back down, then that would be the predicted ERP.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2998.792,
    "end": 3009.22,
    "text": "And this is kind of related to pretty standard neural mass models that are used in the literature that make pretty similar assumptions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3010.078,
    "end": 3019.581,
    "text": " they assume that the average firing rate of a population can be treated as a sigmoid function, so a function that looks like this, of the average membrane potential.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3021.222,
    "end": 3035.246,
    "text": "And you can do things like, for instance, shift this function to the left or the right based on things that control the firing rate threshold, which could relate to inhibitory interneurons, or there's a bunch of different neural mechanisms involved.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3035.286,
    "end": 3037.707,
    "text": "But basically, the point is just that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3038.537,
    "end": 3047.287,
    "text": " this idea about where you get firing rates from average membrane potentials is not kind of out of nowhere.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3047.307,
    "end": 3051.231,
    "text": "It's something that's kind of used as a standard assumption in",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3054.124,
    "end": 3055.325,
    "text": " these sorts of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.845,
    "end": 3069.372,
    "text": "And one interesting note is the softmax, that sigma that we use to kind of renormalize probability, it's actually utilized in artificial neurons in neural networks as also a probability renormalizing trick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.912,
    "end": 3081.819,
    "text": "So we're thinking about it in kind of like the intersection of the physical thing and the instrumentalist approach, realism and instrumentalism, and we're sailing our active inference ship together through there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.692,
    "end": 3102.248,
    "text": " Yeah, so that's, and, you know, later Chris will show specific simulations based on an actual task that will produce predicted ERPs that are consistent with existing literature when he goes through the code in the second part of this session.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3103.669,
    "end": 3109.675,
    "text": "But, so I'm going to sort of stop talking about the state prediction errors at this point, which, again, Chris will pick up in his part.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3110.893,
    "end": 3123.217,
    "text": " The second thing that's kind of commonly talked about as part of the neural process theory in active inference is this idea of expected free energy precision being associated with dopamine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3123.237,
    "end": 3129.038,
    "text": "So I want to say right from the start that to be technically correct, we call this expected free energy precision.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3129.638,
    "end": 3132.439,
    "text": "In the literature, it's often just called policy precision.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3134.18,
    "end": 3138.301,
    "text": "But that can be slightly confusing just because",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3139.545,
    "end": 3167.568,
    "text": " The precision of the actual posterior distribution of our policies, right, this bolded pie here, corresponds not just to the precision of expected free energy, G here, but also to F and to E. So there are ways in which the expected free energy precision, this gamma thing that scales G, you know, could be precise or imprecise while the actual posterior distribution of our policies could still be precise or imprecise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3168.086,
    "end": 3176.71,
    "text": " in a way that differs from the precision of G. Yeah, so you can be not sure what to do, but have very clear understanding of two policies and their implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.77,
    "end": 3178.451,
    "text": "It's two separate levels of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.991,
    "end": 3180.031,
    "text": "No, it's not quite that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3180.472,
    "end": 3197.079,
    "text": "Yeah, that's not, yeah, like, so a good example would be, for instance, so in the, you know, in, you know, the paper, you know, that I wrote with Casper and others on the, on deeply felt affect, so deeply felt affect, so the idea about",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3197.717,
    "end": 3207.94,
    "text": " um, changes in emotional states or affective states, um, relates specifically to this, uh, beta, um, term here that controls the expected for energy precision.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3208.78,
    "end": 3222.283,
    "text": "Um, now when expected for energy precision goes down, um, and that will often correspond to write a negative or when expected for energy goes up, sorry, then that will correspond to a decrease in expected for energy precision.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3222.303,
    "end": 3225.924,
    "text": "Um, um, but, uh, or,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3226.588,
    "end": 3241.335,
    "text": " difference between F and G. But there will be cases where gamma will go down, meaning the model becomes less confident in its beliefs about its ability to minimize expected free energy, essentially.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3241.395,
    "end": 3244.916,
    "text": "It decreases its beliefs, its confidence in its action model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3245.837,
    "end": 3253.0,
    "text": "But there are cases when that can happen despite the fact that the actual posterior distribution over policies becomes really precise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3253.772,
    "end": 3263.836,
    "text": " So, so a kind of nice example of this would be, you know, say you're kind of walking around in the woods and at the moment you're really confident in the walking around policy, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3263.856,
    "end": 3268.238,
    "text": "So there's a precise distribution over, you know, I should be walking around.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3269.038,
    "end": 3271.479,
    "text": "Um, but now you unexpectedly see a bear.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3272.36,
    "end": 3280.623,
    "text": "Um, now immediately you're going to switch to having a very precise posterior distribution over the runaway policy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3281.463,
    "end": 3282.564,
    "text": "Um, so.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3283.206,
    "end": 3290.689,
    "text": " you're gonna have two distributions of our policies that are both very precise, but they change rapidly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3291.169,
    "end": 3298.633,
    "text": "So the policy that the model was confident in before is very different than the policy that the model was confident in after.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3299.253,
    "end": 3308.097,
    "text": "So despite that the posterior distribution over policies is still precise, that thing's very confident what to do, gamma will still go down.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3308.817,
    "end": 3310.838,
    "text": "So the thing will feel negative.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3311.328,
    "end": 3313.91,
    "text": " like emotion, despite being very confident in running away.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3314.591,
    "end": 3319.475,
    "text": "So the thing that's driving that is F. I think that's important to put in, or to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3319.495,
    "end": 3323.279,
    "text": "If you want to cash it out, Ryan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3323.799,
    "end": 3324.72,
    "text": "Oh, well, I mean, yes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3324.76,
    "end": 3335.189,
    "text": "I mean, just in the sense that, so F is going to be, so based on a new observation, F is the kind of evidence for each policy at the time of the new observation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3335.81,
    "end": 3338.252,
    "text": "So if F strongly contradicts G,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3339.167,
    "end": 3357.993,
    "text": " then that means that the distribution is going to change in a way that, um, suggests that you ought to have less confidence in G. Um, and, um, and we can, we can, I'll show a specific example of that below, um, when we actually show simulations of the, um, you know, uh, postulated dopamine responses.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3358.713,
    "end": 3365.035,
    "text": "But so the idea here is, is that, um, dopamine or phasic dopamine responses correspond to",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3365.905,
    "end": 3371.669,
    "text": " changes in this parameter beta, which controls gamma, which is the expected free energy precision.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3373.09,
    "end": 3395.725,
    "text": "And the way that these updates in beta, so this equation here, just corresponds to the initial beta, so the non-bolded one here, plus this thing, so the posterior distribution over policies minus the prior distribution over policies, so basically how much did beliefs about policies change, and then dotted with",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3396.175,
    "end": 3407.344,
    "text": " the negative expected free energy that corresponded to that trial, and then minus the previous beta, which allows this thing to just continually iterate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3408.625,
    "end": 3418.172,
    "text": "But because the change from posterior beliefs over policies from prior beliefs over policies just adds F, basically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3418.653,
    "end": 3425.398,
    "text": "The prior over policies, we don't show it here, is just LNE minus gamma G. So the F only comes in to turn the prior",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3425.905,
    "end": 3428.487,
    "text": " over policies into a posterior over policies.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3429.467,
    "end": 3448.32,
    "text": "And so this change is driven by F. And so the more that F is consistent versus inconsistent with G is what controls the agent's sort of changes in confidence about its G estimates.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3449.741,
    "end": 3455.585,
    "text": "And so changes in that are what are expected or proposed to correspond to phasic dopamine responses.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3456.226,
    "end": 3463.232,
    "text": " And then the kind of tonic level of beta is also proposed to be associated with tonic dopamine levels.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3463.773,
    "end": 3465.474,
    "text": "So if I can just very briefly say something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3466.375,
    "end": 3475.383,
    "text": "So essentially gamma is a, gamma is a rate, or beta, sorry, is a rate parameter from a gamma distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3476.423,
    "end": 3480.745,
    "text": " And essentially, you get this derivation, so beta dot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3482.006,
    "end": 3484.327,
    "text": "Technically, that's a temporal derivative, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3484.547,
    "end": 3498.214,
    "text": "And so it's a little misleading, kind of, because this actually is a variational derivative of gamma with respect to variational free energy, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3498.414,
    "end": 3505.318,
    "text": "So the idea is that updates or changes in essentially this beta value will minimize variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3506.258,
    "end": 3529.233,
    "text": " And if you want to see like that, so the actual, um, the actual derivations of that get kind of, kind of gnarly, but if you're interested, if anyone's interested, I would just say, um, go and read and the appendix of and sales paper that's in PLOS computational biology on the locus cerulea, ceruleus and, um, learning rate and prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3529.874,
    "end": 3529.954,
    "text": "Um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3530.535,
    "end": 3532.937,
    "text": " where they show the derivations of all this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3533.077,
    "end": 3547.106,
    "text": "Yeah, Anna's, the appendix in Anna's paper is, like, actually really great for this because plus CB basically, like, required, it looks like, that she spelled, like, every little detail about deriving everything in active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3547.346,
    "end": 3553.049,
    "text": "So it's a really great paper, both in the main text and in the appendix, for showing kind of exactly where you get each of these things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3554.85,
    "end": 3557.232,
    "text": "Yeah, like, pretty much as clearly as I've seen it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3559.372,
    "end": 3585.352,
    "text": " anything else to add on the neural process front because there's some questions and then we'll head into the second section but this is awesome uh there's a lot more actually let's keep going then then so yeah we'll do more neural process theory however much and then we'll be taking questions we'll have a intermission with a few questions that are really nice and then christopher will launch into the hierarchical modeling so so to actually give examples here because you know everything we've said about the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.953,
    "end": 3589.676,
    "text": " about dopamine and beta updates is still pretty abstract.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3590.937,
    "end": 3602.908,
    "text": "So, you know, in the tutorial, we give specific numerical examples of this as well to show and give a kind of like geometric, actually, intuition about this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3604.369,
    "end": 3613.517,
    "text": "And so here you can see, so here we show, right, that the prior over policies, this pi zero, like I said, is just the softmax of ln e minus gamma g.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3614.428,
    "end": 3620.571,
    "text": " And then the posterior is the softmax of LNE minus F minus gamma G, which we showed before.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3621.271,
    "end": 3628.535,
    "text": "And so, and these are the equations for quote unquote dopamine, phasic dopamine responses.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3630.316,
    "end": 3634.978,
    "text": "And so if you just take a specific, really simple example, so let's say there's no hat.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3634.998,
    "end": 3641.381,
    "text": "So let's say that beta zero and therefore gamma zero and the initial beta posterior, those are all just one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3641.421,
    "end": 3643.302,
    "text": "So we're just starting out, you know, totally,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3643.806,
    "end": 3647.207,
    "text": " flat, basically.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3648.708,
    "end": 3650.408,
    "text": "And we'll say that the agent has no habits.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3651.649,
    "end": 3653.549,
    "text": "So there are two possible policies here, I should say.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3653.969,
    "end": 3659.411,
    "text": "So the agent has no habits, so it's just one and one for counts over policies.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3660.412,
    "end": 3665.333,
    "text": "Now, let's say that G is 10 and nine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3665.413,
    "end": 3670.935,
    "text": "So in other words, there's slightly higher expected free energy for the first policy than the second policy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3672.172,
    "end": 3679.837,
    "text": " So now let's say that F, the agent gets a new observation and the free energy for each policy corresponds to 20 and one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3680.558,
    "end": 3686.181,
    "text": "So as you can see, this is still consistent with the 10 and nine, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3686.221,
    "end": 3693.386,
    "text": "It's not like contradicting the, you know, policy one still has higher free energy than policy two.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3694.747,
    "end": 3699.61,
    "text": "So when you calculate pi zero using this equation and these numbers up here,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3700.265,
    "end": 3705.307,
    "text": " you end up initially having a probability over policies of 0.218 and 0.728.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3705.347,
    "end": 3716.371,
    "text": "So policy two is the one that is more likely given the expected free energy because it's lower, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3716.451,
    "end": 3717.551,
    "text": "Expected free energy is nine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3719.252,
    "end": 3724.534,
    "text": "Now the posterior over policies after we put in F just ends up being zero one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3725.674,
    "end": 3730.036,
    "text": "And so if you take the difference here, so we just called pi diff, so pi minus pi zero,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3730.748,
    "end": 3732.589,
    "text": " that ends up being negative 0.218, 0.218.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3735.57,
    "end": 3745.595,
    "text": "And then if you do this, so dot pi diff with negative g, and these two betas just cancel out, because it's just one minus one, and so you end up with 0.22.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3746.436,
    "end": 3756.121,
    "text": "And then if you compute the update, then yeah, what the change will be, then gamma ends up equaling 1.28, which went up from one,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3759.502,
    "end": 3765.024,
    "text": " which means that you'd have a positive phasic dopamine, predicted positive phasic dopamine response.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3765.864,
    "end": 3784.37,
    "text": "And a way to kind of think about it geometrically is whether or not the vectors corresponding to pi diff, so the difference between pi and pi zero, point in the same direction as negative G. Because that implies that they're consistent with one another, that implies that essentially",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3785.493,
    "end": 3786.473,
    "text": " G was on track.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3787.234,
    "end": 3790.375,
    "text": "That's worth a rerun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.515,
    "end": 3792.815,
    "text": "So what is this geometric space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.496,
    "end": 3804.559,
    "text": "And then what would it mean if the vectors were totally correlated and they were like pointing in the same exact direction versus here they're almost at 90 degrees or what would it mean for different arrows to be pointing in different directions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.46,
    "end": 3812.542,
    "text": "So these are the vectors corresponding to the vectors here in G and the vector",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3813.468,
    "end": 3815.77,
    "text": " that corresponds to pi minus pi zero.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3816.731,
    "end": 3832.223,
    "text": "So this is, and I should say that these are scaled so that they're similar lengths, but the same directions, because otherwise one arrow would be way, way, way longer than the other, and the kind of point isn't clear, wouldn't be clear.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3832.803,
    "end": 3839.769,
    "text": "But so basically pi diff, right, is negative 0.218, 0.218, so it's pointing left and up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3839.969,
    "end": 3842.551,
    "text": "So negative x, positive y.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3843.505,
    "end": 3848.166,
    "text": " Um, whereas G is, um, negative G would be negative 10, negative nine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3848.226,
    "end": 3851.246,
    "text": "So it will be down and left.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3852.187,
    "end": 3868.009,
    "text": "Um, and so the, the general kind of, um, intuition that's supposed to be given is that, um, when these two vectors point in the same direction where that just means that the angle is less than 90 degrees, um, then, uh, the gamma update will be positive.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3868.769,
    "end": 3872.77,
    "text": "Um, whereas if for instance, instead we do a different example.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3873.268,
    "end": 3888.295,
    "text": " Now the only thing we're going to do here is we're going to change F. We're going to change F from 20 and 1 to, or no, sorry, we're going to change G. So G is going from 10 to 9 to only being 1 and 9.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3888.715,
    "end": 3898.299,
    "text": "So in other words, while in this case the first policy had higher expected free energy, now the first policy has lower expected free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3899.898,
    "end": 3912.204,
    "text": " Now, if you run through the exact same set of steps to solve the equations, you're going to end up with a gamma of 0.14, which means there's going to be a negative, there should be a drop in dopamine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3912.924,
    "end": 3917.687,
    "text": "In other words, the agent should become less confident in its G estimates.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3918.447,
    "end": 3925.751,
    "text": "And you can see that if you look at where the vectors are pointing in this case, then the angle difference is 128 degrees.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3927.336,
    "end": 3938.349,
    "text": " 0.66 degrees, so more than 90 degrees, so therefore they point in different directions, so therefore they provide evidence against G, if that makes sense.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3938.905,
    "end": 3962.344,
    "text": " yep let me try with the dopamine so we're thinking of dopamine as a tracker of confidence it has many roles and colombo and others have talked about pluralism in dopamine so we're not this is not a lecture on dopamine we're thinking about dopamine as like confidence and we're headed in a direction we're on our road trip and the dopamine's coursing through our brain and we want to know how confident we are that we're on the right path as new observations are coming in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.024,
    "end": 3967.446,
    "text": " Now, as we've seen from the earlier sections, we're doing a lot of matrix math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.086,
    "end": 3975.909,
    "text": "And just like a vector is a simpler version of a matrix and a tensor is a more complicated version of a matrix, they're all kind of in the same math space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.569,
    "end": 3977.73,
    "text": "And a given vector",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.59,
    "end": 3984.793,
    "text": " From computer science, it's like two numbers that are in a column, but also a vector has this arrow interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.093,
    "end": 3990.595,
    "text": "So if someone says the coordinate three comma three, it's like a vector from zero zero pointing to three three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.995,
    "end": 3997.358,
    "text": "So lists of numbers like a computer science vector is basically the same thing as a vector with a.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.958,
    "end": 3999.839,
    "text": " start and then ahead and at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4000.239,
    "end": 4004.36,
    "text": "So it's physics and computer science, and we're thinking about vectors and matrices and tensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.02,
    "end": 4011.723,
    "text": "And then we're laying out after scaling and renormalizing which direction these different vectors are pointing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4012.303,
    "end": 4015.924,
    "text": "And then it's kind of like, are we headed on the basically the same path?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.424,
    "end": 4022.046,
    "text": "Is the vector of the evidence sort of pointing us in a similar direction that we're already believing in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4022.766,
    "end": 4031.268,
    "text": " Or is the new evidence coming in like a tailwind or a headwind that's kind of surprising us and it's not in line, it's not headed in the same direction as what we're already believing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.728,
    "end": 4039.97,
    "text": "And then this meta with the gamma, the hyperparameter, is about how much reliance we're putting in to G versus our observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.45,
    "end": 4048.391,
    "text": "Yeah, so I mean, another kind of a nice thing here is that so as gamma goes down, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4048.411,
    "end": 4052.312,
    "text": "So if you look at this posterior distribution of our policies equation,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4052.955,
    "end": 4055.016,
    "text": " as this gamma value gets lower, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4055.056,
    "end": 4065.241,
    "text": "So as the agent becomes less confident in its action model, more or less, it's less confident that its model will be good at minimizing expected free energy, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4065.381,
    "end": 4069.864,
    "text": "As that goes down, then G contributes less, which means that F and E contribute more.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4070.464,
    "end": 4078.608,
    "text": "So if an agent has built up really strong habits, then its beliefs and its model will control action",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4079.286,
    "end": 4086.349,
    "text": " if gamma is high, but if gamma is really low, then the agent will just kind of choose whatever it's habitually chosen in the past.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4086.369,
    "end": 4092.992,
    "text": "So habits will kind of take over if it's not confident in its model, which is kind of a nice way to think about.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4093.272,
    "end": 4105.497,
    "text": "It has some kind of analogs to like model-based versus model-free algorithms and reinforcement learning, for example, that, again, you can think about in terms of actually making decisions based on",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4106.032,
    "end": 4118.12,
    "text": " you know, explicitly simulating what's going to happen in the future if I make one choice versus another versus just doing what's typically worked in the past is another kind of way to think about what Gamma is arbitrating.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4119.581,
    "end": 4121.001,
    "text": "Did you want to say anything else, Chris?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.662,
    "end": 4124.223,
    "text": "No, I was just going to say there's some really nice numerical results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4125.164,
    "end": 4128.226,
    "text": "So I think I've forgotten, I'm sorry if I've forgotten their name.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4128.606,
    "end": 4134.63,
    "text": "I think it's Thomas Fitzgerald is the lead author on this, but they have some stuff just showing that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4135.003,
    "end": 4150.473,
    "text": " related schemes, I think the equations have changed a little bit since then, but they're pretty much the same, that this scheme gives very, very similar answers as something like temporal difference learning, which is a very simple model-free algorithm in reinforcement learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4151.294,
    "end": 4155.817,
    "text": "And that's also, I think, the gold standard model of phasic dopamine at the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4156.577,
    "end": 4157.578,
    "text": "Ryan, you can correct me on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4158.359,
    "end": 4163.842,
    "text": "No, I mean, yeah, I mean, it's like temporal difference account of reward prediction error and stuff.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4163.882,
    "end": 4164.803,
    "text": "Yeah, we're treating,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4165.558,
    "end": 4174.38,
    "text": " phasic dopamine responses as reward prediction errors in temporal difference learning models is definitely a very standard and kind of like widely supported view.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4174.76,
    "end": 4185.443,
    "text": "And this, I mean, the idea is that this sort of active inference model of dopamine is kind of saying something different.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4185.463,
    "end": 4192.305,
    "text": "It's not saying it's a reward prediction error, but it's something that will have the same kind of dynamics as reward prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4192.825,
    "end": 4193.845,
    "text": "Because if you think about it,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4194.372,
    "end": 4197.813,
    "text": " So say, you know, I'm walking along and I'm not expecting a reward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4198.473,
    "end": 4202.094,
    "text": "Um, and then all of a sudden I get a cue that makes it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4202.114,
    "end": 4206.015,
    "text": "So now that I expect now I expect, um, reward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4206.735,
    "end": 4220.518,
    "text": "Um, so, you know, for instance, like, or say like in like a simple kind of like experiment, like a, like operant condition, experiment conditioning experiment with like a rat or something, you know, it learns that every time it sees a light, it's going to get a reward in five seconds.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4221.338,
    "end": 4221.398,
    "text": "Um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4222.057,
    "end": 4234.141,
    "text": " then the reward prediction error story would say, oh, you're going to get a reward prediction error when the rat sees the light, because now it knows it's going to get a reward that it wasn't expecting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4235.662,
    "end": 4250.787,
    "text": "So in this case, though, you'll get something kind of similar, but for a different reason, where you can think about the rat initially just kind of wandering around, not being super confident in any particular policy, but then it gets that cue that it's going to get rewarded",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4251.511,
    "end": 4253.772,
    "text": " if it goes up and pushes the lever, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4253.812,
    "end": 4256.634,
    "text": "Is the standard way this works.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4256.894,
    "end": 4266.839,
    "text": "So instead of it being a reward prediction error, what would be happening is the queue is actually unexpectedly making the rat a lot more confident in what to do, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4266.859,
    "end": 4269.44,
    "text": "A lot more confident in the policy of going and pushing the lever.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4269.46,
    "end": 4279.465,
    "text": "So you're gonna get something that looks just like a reward prediction error, at least in that sort of setup, but actually has to do with an update in confidence about what to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4281.457,
    "end": 4289.859,
    "text": " So that's kind of in part, that's one kind of intuitive way to think about where similar looking dynamics come from.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4291.16,
    "end": 4305.224,
    "text": "But I should also kind of be clear that, I mean, this is definitely not meant necessarily to be kind of a universal unifying account of dopamine, at least",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4306.448,
    "end": 4327.972,
    "text": " at least as far as, um, you know, I can tell at present, there's lots of other things that dopamine does that, um, you know, look like they couldn't be explained by just this sort of model, but this sort of model, um, looks like it's decent as a contender for thing, making sense of things like, um, why dopamine doesn't just respond for prediction errors, but also response for events that are salient.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4328.773,
    "end": 4334.014,
    "text": "Um, for example, um, this kind of saliency versus reward prediction error sort of thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4334.034,
    "end": 4335.594,
    "text": "There's a couple others, but, but, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4336.049,
    "end": 4339.751,
    "text": " So this is not necessarily meant to be a, you know, this is all dopamine does.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4341.411,
    "end": 4346.433,
    "text": "But anyway, so just making that clear.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4348.814,
    "end": 4364.661,
    "text": "So now the kind of last thing to show, and this is the actual figure in the paper that just shows both of these things, is that if you do the actual variational updating where just beta continually changes, then the actual kind of gradient, like the changes look",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4364.98,
    "end": 4371.464,
    "text": " like this, where the thing would start out, for instance, at around, at a certain value.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4371.484,
    "end": 4388.994,
    "text": "And then for this case, right, so it starts at, you know, down coming from one, and then it will gradually go up and converge after 16 iterations is what's set in the code to that posterior value over what gamma ought to be.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4389.494,
    "end": 4394.457,
    "text": "Whereas in this case, it will drop coming up from one, down, and then converge",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4394.884,
    "end": 4398.687,
    "text": " over those iterations onto this value of 0.14.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4399.208,
    "end": 4403.692,
    "text": "So it's not as though in the neural model this is kind of happening with one little step.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4403.972,
    "end": 4413.96,
    "text": "It's kind of a – it's a convergence that you can think of as related to a kind of prediction error, essentially kind of like an expected free energy prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4414.381,
    "end": 4416.723,
    "text": "Some people have talked about it that way in previous papers.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4418.124,
    "end": 4422.668,
    "text": " For those following along in the code, would this be in the EFE precisionupdating.ms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4422.708,
    "end": 4424.329,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4426.15,
    "end": 4433.936,
    "text": "To play around with this exact example, as well as ones where you can specify bigger policy spaces.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4434.737,
    "end": 4439.921,
    "text": "When the agent has five policies to choose from instead of one, it's just a little more realistic.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4441.042,
    "end": 4443.303,
    "text": "It's hard to show vectors.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4444.312,
    "end": 4446.033,
    "text": " started to illustrate those in like five dimensions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4446.454,
    "end": 4448.235,
    "text": "So we went with two for these simple examples.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4449.196,
    "end": 4461.425,
    "text": "But yes, in that EFE precision updating, you can reproduce these results and then try changing like private beta values or changing G and F to C to get more of an intuitive sense of the dynamics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4463.846,
    "end": 4472.633,
    "text": "And so like in the, whatchamacallit, when we were showing in the explore exploit test model last time,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4473.777,
    "end": 4487.025,
    "text": " these sorts of simulated behaviors, right, where the agent either chooses to take the hint and then go left or right to get a reward, or it's just risk-seeking and just goes left versus right automatically instead of taking the hint first.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4489.006,
    "end": 4498.171,
    "text": "In the previous session, we went over this, but we kind of ignored this bottom right section on expected free energy precision and these dopamine plots.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4498.911,
    "end": 4501.513,
    "text": "But now that we've kind of walked through that a little bit,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4502.325,
    "end": 4511.21,
    "text": " Um, you know, we can kind of come back to that and see that in this case, um, the agent, uh, started out in the beginning and it chose to take the hint.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4511.99,
    "end": 4519.434,
    "text": "Um, and then it knew, um, whether to, uh, choose left, uh, choose the left machine or choose the right machine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4520.074,
    "end": 4525.937,
    "text": "So you can see what happens here is when it takes the hint, then it becomes a lot more confident about what to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4526.798,
    "end": 4531.28,
    "text": "Um, and so it's at that point that you simulate a big jump in dopamine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4531.875,
    "end": 4538.478,
    "text": " So in this case, it's not because it's got a reward immediately, it's because it got a cue where it learned what to be able to do to get a reward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4539.239,
    "end": 4545.142,
    "text": "So then it chooses left and then it observes a win here at the third time point or this third column.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4546.682,
    "end": 4548.803,
    "text": "So this is an example.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4550.024,
    "end": 4553.365,
    "text": "Then in the learning simulations that we showed last time as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4555.126,
    "end": 4559.569,
    "text": "Before we leave that slide, could I just jump in real quick and add a quick clarification about that figure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4561.849,
    "end": 4590.115,
    "text": " So in that middle panel for win-lose, and you look at that matrix, it actually looks like if that's the expected probabilities for win-loss at any given time epoch, one, two, and three, it actually looks like in this case, the way that the simulation goes, it's more confident about winning on this time step when it knows to take the hint, and then after it's taken the hint, it becomes less confident about winning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.476,
    "end": 4594.537,
    "text": " It's actually to do with the fact that those aren't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4594.617,
    "end": 4599.72,
    "text": "So they're probabilities, but they're not probabilities in the way that the rest of the model is probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4600.261,
    "end": 4604.883,
    "text": "So these are preferences where we model preferences as a probability distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4606.224,
    "end": 4606.504,
    "text": "I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4607.285,
    "end": 4613.348,
    "text": "So that has to do with more of the, it's had more observations at time three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4613.969,
    "end": 4618.592,
    "text": "So as you're going, since it's an accumulator in that optimization process,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4619.625,
    "end": 4625.289,
    "text": " No, it's just, so when you're trying to encode essentially what's rewarding for the agent, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4625.749,
    "end": 4633.914,
    "text": "You're just setting, you're just saying that it has a particular distribution over each possible set of outcomes for each outcome modality.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4633.955,
    "end": 4639.758,
    "text": "And that distribution just encodes which observations are more preferred than others.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4640.819,
    "end": 4646.803,
    "text": "And formally, that's just a fixed probability distribution over the different observations you might get.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4647.23,
    "end": 4651.312,
    "text": " where the higher the probability is, quote-unquote, the more the agent prefers that observation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4652.813,
    "end": 4661.138,
    "text": "So this is just saying, like, for the first outcome modality, it's just all gray here because the agent doesn't prefer a hint or not a hint.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4662.639,
    "end": 4673.765,
    "text": "And in the third one here, observed action, it doesn't prefer innately to observe itself do one action or another, but in this middle one, observing wins versus losses versus null, just not observing an outcome yet,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4674.506,
    "end": 4679.789,
    "text": " At the first time point, so the first column, it just doesn't have any preferences.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4680.53,
    "end": 4688.775,
    "text": "At the second time point, so this middle column, the thing has a strong preference for win, so this black one, which corresponds to high probability.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4689.395,
    "end": 4694.478,
    "text": "It has a strong preference against losing, observing a loss, which is a very low probability.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4694.979,
    "end": 4697.36,
    "text": "And then the null state is just this kind of like intermediate thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4697.42,
    "end": 4700.502,
    "text": "It's not bad like a loss, but it's not good like a win.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4701.007,
    "end": 4708.169,
    "text": " And so the reason it chose the null there, or the reason is because it chose a hint because of the epistemic value of the hint, I should say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4708.99,
    "end": 4710.35,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4710.53,
    "end": 4721.754,
    "text": "So basically what's happening is if you remember that this distribution is a little lighter at time two because the value of winning is higher at the second time step than the third.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4721.774,
    "end": 4726.956,
    "text": "Remember, because it can win $4 if it tries to get the, if it just chooses one right away.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4727.616,
    "end": 4729.797,
    "text": "But at the third time point, this is a little,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4730.419,
    "end": 4731.439,
    "text": " less precise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4731.499,
    "end": 4737.642,
    "text": "It's a little flatter, which is why it looks darker gray, because the black here only corresponds to winning $2 instead of $4.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4738.542,
    "end": 4741.944,
    "text": "So the difference between winning and losing isn't quite as stark.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4742.484,
    "end": 4742.784,
    "text": "I see.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4742.964,
    "end": 4743.184,
    "text": "Okay."
  },
  {
    "start": 4743.424,
    "end": 4745.365,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4745.505,
    "end": 4749.046,
    "text": "But the point is, it's not actually getting a big bump in dopamine when it wins.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4749.947,
    "end": 4755.749,
    "text": "It's getting a big bump in dopamine when it observes the hint, because that's when it becomes confident in what to do to get the win.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4757.679,
    "end": 4765.262,
    "text": " And that's to re-emphasize that we're doing this trajectory of policy, which is what ties it to the path integral as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4765.682,
    "end": 4771.444,
    "text": "So at each time point that it's being evaluated at, it's in the past and in the future, and it's conditioned on policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.944,
    "end": 4781.267,
    "text": "So it's almost like the reward, if you always expect the envelope has the paycheck, if you get it and then you open it, it's like neutral with respect to what you already believed about the way the world worked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.607,
    "end": 4785.51,
    "text": " And you'd get a negative if it was less than expected and a positive if more than expected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.83,
    "end": 4793.215,
    "text": "And so in that way, the reward of what is initially just pure stimuli that could be rewarding or thought of in that way gets moved up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.796,
    "end": 4796.738,
    "text": "That's kind of like reinforcement learning or reward learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.018,
    "end": 4801.861,
    "text": "And that's why we're in this area of thinking about stimuli and policy and rewards and risks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.422,
    "end": 4803.603,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4803.623,
    "end": 4806.905,
    "text": "I mean, the idea is just that in that context, uh,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4807.304,
    "end": 4817.467,
    "text": " these dopamine responses, the simulated dopamine responses here correspond to changes in confidence about what to do or changes in confidence that your model will give you the right answer about what to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4819.168,
    "end": 4828.71,
    "text": "And that will look, that will have the same dynamics as a reward prediction error from a cue that predicts reward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4830.251,
    "end": 4835.893,
    "text": "So the dynamics will look like a reward prediction error even though in these models it corresponds to something different.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4838.564,
    "end": 4841.467,
    "text": " So it's kind of like in behaviorism, everybody can agree on the behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4841.587,
    "end": 4847.813,
    "text": "We agree that if we train up the animal, it learns to do this after X experimental paradigm is carried out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.314,
    "end": 4849.855,
    "text": "And then now we're talking about internal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.875,
    "end": 4855.4,
    "text": "We're thinking either at a neural process level, like which regions of the brain or computationally, like what is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.041,
    "end": 4873.182,
    "text": " And then here, there's a common trunk with the predictive processing, the reward prediction error, all of that, and the active inference models we're talking about, and reinforcement learning, which is that over time, the reward gets moved up to be associated apparently more with the queue than with the actual stimulus delivery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.703,
    "end": 4889.738,
    "text": " But we're taking a point of divergence in that we're adding in a few different pieces that differentiate an active inference free energy gradient descent driven policy selection from just Q association, even though they do have some similarities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.158,
    "end": 4894.462,
    "text": "This is like a generalization or a much more nuanced way to approach similar situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.144,
    "end": 4896.384,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4896.744,
    "end": 4899.547,
    "text": "And, you know, ultimately, right, the hope is to find situations",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4900.117,
    "end": 4906.02,
    "text": " where active inference and reinforcement learning models are going to make different predictions about what dopamine will do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4908.161,
    "end": 4915.585,
    "text": "Because that's where you can actually say which model has more empirical support.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4915.605,
    "end": 4928.851,
    "text": "Thomas Fitzgerald, I think it was the paper that Chris was talking about before, he did show there are interesting findings where when you get rid of dopamine, when there's dopamine depletion and there's some lack of dopamine in the system for one reason or another,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4930.171,
    "end": 4933.893,
    "text": " that doesn't actually get rid of reward learning.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4934.033,
    "end": 4952.524,
    "text": "Like an agent can still learn about rewards despite the dopaminergic function being impaired, you know, which makes it look as though, you know, dopamine might not be serving this reward prediction error function, at least if you think that reward prediction error is necessary for reward learning.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4955.085,
    "end": 4959.328,
    "text": "And so there was, he showed some simulations, again, with a slightly different formalism than the current one,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4959.83,
    "end": 4971.82,
    "text": " showing how you can get the same dopamine responses as you would expect in a reinforcement learning model, but it explains why you don't need dopamine to do the reward learning.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4973.682,
    "end": 4978.886,
    "text": "But like I mentioned, the formalism isn't exactly the same as it is now, because that was a slightly older paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4980.087,
    "end": 4988.154,
    "text": "So I think there's just a lot more kind of empirical work to do to try to kind of find differential support for one model of dopamine over another here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4990.071,
    "end": 4990.611,
    "text": " Very cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4991.671,
    "end": 4993.752,
    "text": "Any other comments, Chris?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4994.692,
    "end": 5003.393,
    "text": "No, I think just looking at the time, do you want to speed through the slides and then we can get on to the stuff?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5003.413,
    "end": 5003.593,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5003.713,
    "end": 5005.494,
    "text": "I can skip or just skim over a lot of this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5005.514,
    "end": 5012.395,
    "text": "The last thing I was going to talk about is that this isn't used as much because it's not actually implemented in this way in the code.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5012.875,
    "end": 5018.836,
    "text": "But Carl has made this point that you can also implement minimizing expected free energy,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5019.825,
    "end": 5022.648,
    "text": " using a different kind of prediction error called an outcome prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5023.248,
    "end": 5028.313,
    "text": "And that just corresponds to the different elements in expected free energy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5029.073,
    "end": 5040.943,
    "text": "So, which is here just, here is just minimizing the expected difference between the preferred outcomes, C, and the outcomes that you expect under a policy, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5040.983,
    "end": 5046.248,
    "text": "So, under some policy, for under some policy, the state for that pi",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5047.374,
    "end": 5050.996,
    "text": " multiplied with A will give you the expected outcomes of a policy.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5051.016,
    "end": 5063.304,
    "text": "So you're just trying to, this prediction error, minimizing this prediction error just corresponds to finding the policy that minimizes the difference between basically what you want and what you expect, given what you choose to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5064.624,
    "end": 5069.868,
    "text": "And the second term is the ambiguity or information seeking term.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5070.548,
    "end": 5075.611,
    "text": "And it effectively, you can think about it as the expected difference between beliefs about states",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5076.072,
    "end": 5077.752,
    "text": " before and after a new observation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5078.273,
    "end": 5087.335,
    "text": "So you're trying to find basically a difference that like the state that maximizes how much information you gain about what state you're in.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5088.215,
    "end": 5099.638,
    "text": "But formally, it's the entropy of the likelihood distribution for a state or how kind of flat or uninformative the distribution is of expected outcomes given that you're in one state versus another.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5099.658,
    "end": 5101.098,
    "text": "And in the paper,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5102.386,
    "end": 5109.691,
    "text": " We go through numerical examples of computing these sorts of outcome prediction errors as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5111.012,
    "end": 5131.066,
    "text": "But the basic point, again, I won't go through them in detail, is just if you have some policy that is going to generate the state one with probability 0.9 and state two, probability 0.1, and your preference is perfectly precise over observing outcome one, and that's your likelihood mapping,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5131.892,
    "end": 5159.549,
    "text": " then policy, whereas policy two is expected to just generate 0.5, 0.5 over states, and the outcomes that are associated with those states look like this, then what you're going to get is policy one is going to end up, if you just do the math out, policy one is going to have a value of 2.4,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5160.819,
    "end": 5166.563,
    "text": " for that term, whereas policy two is gonna have a value of 7.3.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5167.063,
    "end": 5171.786,
    "text": "So this difference is gonna be a lot bigger and therefore there's gonna be more outcome prediction error.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5171.946,
    "end": 5180.271,
    "text": "And so the policy that, the first policy that's gonna generate the outcomes that are closer to what you want is gonna minimize that prediction error more.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5181.452,
    "end": 5182.933,
    "text": "And so again, we just show examples.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5182.973,
    "end": 5188.136,
    "text": "We also show examples of this part, but the basic idea here is if this is your likelihood function,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5188.82,
    "end": 5192.101,
    "text": " then state one here is kind of imprecise in what it predicts, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5192.121,
    "end": 5198.504,
    "text": "It predicts one outcome with 0.4 and another outcome with 0.6, whereas state two has a more precise distribution.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5198.524,
    "end": 5202.005,
    "text": "It generates outcome one with 0.2 and outcome two with 0.8.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5202.546,
    "end": 5207.387,
    "text": "So the agent would learn more if it moves to state two because the outcomes are more informative.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5209.128,
    "end": 5217.852,
    "text": "And so basically these work examples just show how the agent should, to minimize outcome prediction error, the agent should be",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5218.939,
    "end": 5221.28,
    "text": " driven to choose to move to state two.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5223.54,
    "end": 5238.865,
    "text": "And so finally, and I'm not going to go into this at all, but we also show this panel here that corresponds to another kind of element that's been proposed in the neural process theory that has to do with model reduction and sleep.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5239.745,
    "end": 5247.728,
    "text": "And the basic idea is that sleep allows you to search for other models that you might entertain",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5249.178,
    "end": 5253.301,
    "text": " that can produce the same experiences you've had during the day, but can do so in a simpler way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5254.582,
    "end": 5266.289,
    "text": "So sleep is basically still trying to minimize free energy, but not with respect to new observations, but just with respect to your model based on the experiences that you already had earlier.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5266.309,
    "end": 5277.377,
    "text": "And that corresponds to internal dynamics that can essentially prune away or reduce the weights of synaptic connections that are contributing less",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5278.035,
    "end": 5279.796,
    "text": " to explaining what you did.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5279.816,
    "end": 5291.379,
    "text": "So essentially kind of noise, like if there's a bunch of kind of coincidental connections between different things you observe, then there's some kind of noise in what you've learned.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5292.099,
    "end": 5294.14,
    "text": "And so during sleep you can reduce that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5295.14,
    "end": 5301.722,
    "text": "And here's just a few papers that have talked about that and shown simulations in case people are interested.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5304.85,
    "end": 5310.893,
    "text": " Now, moving on to what Chris is going to talk about are hierarchical models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5311.933,
    "end": 5323.798,
    "text": "And the idea here is you can just take the same exact structure of the model here that we've shown before, but put a layer kind of below it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5324.239,
    "end": 5334.203,
    "text": "That's the same kind of thing, but instead of the observations being actual outcomes, the observations are just whatever the states, the beliefs over states are,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5334.887,
    "end": 5343.032,
    "text": " at the lower level, or the observations for the second level are just the posteriors over states at the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5343.812,
    "end": 5362.403,
    "text": "And so that just looks like this, where you see here that you still are selecting policies at the higher level, although you can also select policies at the lower level, but states at time two here just generate states at time one and states at time one, or states at, sorry, states at level one,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5363.49,
    "end": 5367.092,
    "text": " act as the observations for level two.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5368.553,
    "end": 5372.355,
    "text": "As you can see, necessarily these operate over a slower time scale as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5372.955,
    "end": 5392.485,
    "text": "So for instance, at time one, level two, the first state, state of time one is gonna generate the first state at time one at the lower level, but then the lower level is gonna move to its beliefs at state two over a faster time scale.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5394.209,
    "end": 5397.111,
    "text": " And so this whole thing is going to repeat at the lower level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5397.171,
    "end": 5402.675,
    "text": "So the thing is going to infer posteriors over states based on two observations at fast time scales.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5404.016,
    "end": 5415.845,
    "text": "And then the posterior beliefs over states at the lower level are then going to propagate up and act as the observations for state one at time one at the higher level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5416.406,
    "end": 5422.01,
    "text": "And then that's going to transition through a second level B matrix to beliefs over states at time two.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5422.602,
    "end": 5434.472,
    "text": " which then is just going to provide priors to a second trial, to the start of a second trial at the lower level, which again operates over a faster timescale.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5434.492,
    "end": 5442.258,
    "text": "So essentially this whole lower level model completes its belief update before the higher level transitions to its next state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5443.539,
    "end": 5451.245,
    "text": "And in the neural process theory, it really just involves taking the first level, just kind of tacking on another level of neurons on top,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5451.849,
    "end": 5462.079,
    "text": " and making the observations of the second level, the things that drive the prediction error and the states, as just the posteriors over states at the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5462.099,
    "end": 5473.25,
    "text": "So it's just kind of repeating the same thing, but at a higher level and treating the interactions between the second and the first level the same way that observations feed into the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5474.977,
    "end": 5478.06,
    "text": " And so I raised a question on this slide from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.661,
    "end": 5486.609,
    "text": "Someone asked, can you please explain the relationship or difference between models based upon deep active inference versus sophisticated inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5487.17,
    "end": 5489.652,
    "text": "And how is that related to the current discussion around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5490.433,
    "end": 5492.795,
    "text": " dopamine signaling, whether it's phasic or non-phasic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5492.935,
    "end": 5494.257,
    "text": "So two questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5494.537,
    "end": 5500.502,
    "text": "One is what is deep active inference and how is that related to sophisticated active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5500.582,
    "end": 5504.266,
    "text": "And how are those related to what we're discussing now about dopamine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.606,
    "end": 5506.848,
    "text": "And I have a thought if, but you can go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.629,
    "end": 5509.591,
    "text": "I can answer all these very quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.671,
    "end": 5510.512,
    "text": "This is perfect answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.552,
    "end": 5510.912,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5511.673,
    "end": 5514.996,
    "text": "So deep active inference can kind of correspond to two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5515.943,
    "end": 5525.465,
    "text": " You can talk about it in terms of using deep neural networks to parameterize your essentially your A's and B's and B matrices or your policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5526.625,
    "end": 5528.666,
    "text": "That would be kind of like a machine learning application.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5528.926,
    "end": 5543.429,
    "text": "And when I say deep active inference, what I generally and what other people have talked about, like the paper that first came out called like deep whatever, deep active inference, it was just one of these hierarchical models, whereas deep in the sense that there's this temporally deep or temporally thicker",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5544.403,
    "end": 5568.765,
    "text": " one could say uh time time scale stacked on top and so then in terms of sophisticated active inference that's just to do with policy selection um and where you're essentially doing something that looks more like a tree search um so i would just say i don't know it's it's equivalent to backward induction and reinforcement learning uh so you essentially instead of saying kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5570.089,
    "end": 5574.651,
    "text": " propagating forwards on a tree, you start at your terminal node and then you propagate backwards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5575.872,
    "end": 5579.393,
    "text": "You say, given where I want to go, how do I best get there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5579.734,
    "end": 5580.634,
    "text": "Then propagate backwards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5582.175,
    "end": 5585.336,
    "text": "Then I don't really know what the phasic, non-phasic thing means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5587.137,
    "end": 5587.357,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5587.817,
    "end": 5588.498,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5588.738,
    "end": 5596.802,
    "text": "I'm not aware of anybody saying anything about if there's any change in the dopamine story in sophisticated active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5598.12,
    "end": 5604.963,
    "text": " I mean, in sophisticated active inference, you're still obviously updating beliefs about policies when you make a new observation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5604.983,
    "end": 5625.294,
    "text": "But yeah, I mean, the main difference, like Chris said, it's just how you come to post your beliefs over policies by doing this sort of more thorough tree search where you have this additional element where you say, you know, given that I observe a thing at time two at a given branch in a tree, what will my beliefs be at time two?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5626.943,
    "end": 5629.944,
    "text": " And like, like, like Chris said, it's equivalent to backward induction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5630.424,
    "end": 5634.366,
    "text": "Um, and, uh, it's, it's, um, anyway, yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5634.386,
    "end": 5644.75,
    "text": "So I, without, without, again, I don't think anyone's talked about this much, but presumably you still make new observations that update your beliefs over policies as you move through time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5644.77,
    "end": 5649.312,
    "text": "Um, and so I don't necessarily see how the dopamine story would need to change.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5649.332,
    "end": 5652.353,
    "text": "Um, but, uh, but yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5652.634,
    "end": 5655.875,
    "text": "Um, and I will say in addition to what Chris said, um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5656.496,
    "end": 5665.32,
    "text": " there are really two kind of related meanings independent of the kind of machine learning deep neural network thing that Chris talked about.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5665.88,
    "end": 5668.861,
    "text": "One is, and like you said, the standard one is talking about deep temporal models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5669.461,
    "end": 5685.508,
    "text": "And that's just exactly what I was showing here, where the second level necessarily operates at a slower time scale than the first level, because the first level has to kind of complete all of its time steps before",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5686.075,
    "end": 5690.178,
    "text": " it can provide an observation to the higher level and then the higher level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5690.398,
    "end": 5694.781,
    "text": "So basically each higher level state corresponds to a whole lower level trial.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5696.081,
    "end": 5713.893,
    "text": "You know, so if you wanted to, you could make a lower level trial, have 10 time steps, but the posterior over beliefs at that lower level, at the end of those whole times to all those time steps would be, you know, what the observation is that, you know, provides evidence for the first state at the first, that the state at the first time point at the second level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5714.613,
    "end": 5715.454,
    "text": "So, and then,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5716.064,
    "end": 5719.185,
    "text": " second level states transition, and then the second level state.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5719.666,
    "end": 5723.988,
    "text": "So they're basically one trial at the higher level with two time points.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5724.928,
    "end": 5730.55,
    "text": "Each of those time points corresponds to providing priors for a whole trial at the lower level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5730.57,
    "end": 5736.613,
    "text": "So you're going to have as many trials at the lower level as you have time steps in one trial at the higher level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5739.537,
    "end": 5741.298,
    "text": " So that's what deep temporal models means.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5741.318,
    "end": 5747.961,
    "text": "It's just that the second level operates at a slower time scale than the first and provides priors for initial states at the first level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5749.462,
    "end": 5764.949,
    "text": "Another meaning that some people use, like in the deeply felt affect paper, is just deep parametric models, which basically just means the first level, things that happen at the first level can be used as evidence for updating hyperparameters for the higher level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5766.633,
    "end": 5778.796,
    "text": " And like in the deeply felt affect paper, basically we had second level states that corresponded to valence, but those were updated, not by first level beliefs, but by changes in beta at the lower level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5779.236,
    "end": 5781.777,
    "text": "So when gamma updates were positive, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5781.837,
    "end": 5792.539,
    "text": "When the confidence and expected free energy went up, there was a ascending signal though, then updated beliefs at the second level that corresponded to feeling better, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5792.559,
    "end": 5795.44,
    "text": "So positive valence and those also,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5796.209,
    "end": 5806.876,
    "text": " that state could also act as a prior on what the beta update should be, right, how confident the agent should be at the lower level as trials go forward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5806.916,
    "end": 5819.145,
    "text": "So it can also have to do with Kenneth's quote unquote deeper parameters as opposed to just deeper levels that control priors over states at the lower level.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5820.386,
    "end": 5822.907,
    "text": "But that's not as commonly used.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5823.368,
    "end": 5825.309,
    "text": "By far the most common is just deep temporal models.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5826.496,
    "end": 5830.878,
    "text": " Do you have any more to add on the neural process or can we do our switch over?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5831.278,
    "end": 5833.139,
    "text": "No, neural process is pretty done.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5833.779,
    "end": 5850.107,
    "text": "The only thing is that before Chris starts, because what we're simulating when we're doing this example in the code of a hierarchical model, the example we're using is an empirical task called a local global or oddball paradigm.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5850.647,
    "end": 5855.21,
    "text": "So Chris is just going to... I'm just putting up this slide so that Chris can walk us through the...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5856.502,
    "end": 5859.244,
    "text": " the design of this task.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5860.145,
    "end": 5870.392,
    "text": "So just before we cross over, just while we take a breath, I want to make one ultra-rapid summary for just contrast, and then ask one question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5870.872,
    "end": 5874.455,
    "text": "So the brief summary is we're dealing with the Active Inference Framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5874.915,
    "end": 5876.516,
    "text": " We are within free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5876.556,
    "end": 5877.798,
    "text": "We're talking about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5877.898,
    "end": 5879.299,
    "text": "That's why it's Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5879.719,
    "end": 5885.624,
    "text": "Now, we've heard about a couple of adjectives, deep, sophisticated, affective, and even inactive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5886.165,
    "end": 5889.047,
    "text": "And those have been in the titles of papers or they've been the titles of models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5889.488,
    "end": 5890.869,
    "text": "We heard about just very...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5892.27,
    "end": 5895.935,
    "text": " concisely about what deep can mean, whether deep neural networks or deep time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5896.615,
    "end": 5901.441,
    "text": "And then there's a third definition of deep meaning like fully or radically parametric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5901.902,
    "end": 5907.448,
    "text": "And that is interpreted within the affective valence framework within the paper that Ryan just mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5907.468,
    "end": 5909.311,
    "text": "So that's deep and affective, which are related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.691,
    "end": 5933.262,
    "text": " then sophisticated is related to this tree search counterfactual policy and state estimation we talked about the sophisticated inference in a previous stream and inactive is highlighting more from an ecological or even a philosophical perspective about the embodied and enacted aspects of cognition so that's just a summary about a few of the flavors under the umbrella of active inference and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5933.982,
    "end": 5938.267,
    "text": " They don't necessitate a renaming of the lab because they're like variants or paper titles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5938.807,
    "end": 5941.33,
    "text": "But this is the total umbrella that we're working under.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.971,
    "end": 5945.675,
    "text": "And then the general question from the chat, which I hope that set it up for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5945.955,
    "end": 5947.057,
    "text": "And then we'll address this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5947.157,
    "end": 5949.379,
    "text": "Each person give a very short response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5949.459,
    "end": 5950.541,
    "text": "And then we launch into Chris's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5951.687,
    "end": 5963.791,
    "text": " When preparing a model for exploring free energy principle active inference in MATLAB, do you often sketch out equations with sample Bayesian calculations for each term to help clarify your thinking and track what will happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.231,
    "end": 5976.754,
    "text": "Or in other words, how do you go from thinking or specifying the generative model of even a experiment into what you do when you're talking, like you go from this behavioral example to the code, how do you do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5978.635,
    "end": 5978.895,
    "text": "I mean,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5979.577,
    "end": 5990.241,
    "text": " So for me, honestly, when I'm actually setting up a model for a task, I don't really think about the equations hardly at all, because you don't need to, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5990.281,
    "end": 6002.845,
    "text": "I mean, what you need to focus on is just what the necessary elements are in terms of states and observations and policies that are just in a task, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6002.865,
    "end": 6007.707,
    "text": "So you have to think, okay, in a task, what are the observations that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6008.345,
    "end": 6010.607,
    "text": " the participant has, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6010.667,
    "end": 6013.889,
    "text": "Is there just one possible observation modality?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6013.909,
    "end": 6018.392,
    "text": "They either observe this or that, or are there multiple observation modalities?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6018.432,
    "end": 6022.395,
    "text": "Like maybe they observe a cue and then they observe a reward, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6022.455,
    "end": 6026.197,
    "text": "And so then you need two observation modalities, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6026.237,
    "end": 6028.059,
    "text": "You think about how many in each modality, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6028.079,
    "end": 6029.54,
    "text": "Is it just cue or no cue?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6030.06,
    "end": 6032.001,
    "text": "You know, is it just reward or no reward?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6032.101,
    "end": 6034.923,
    "text": "Or is it no reward, reward or loss?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6036.564,
    "end": 6042.107,
    "text": " You know, so you just think, okay, what are the different types of observations and how many observations within each type?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6042.428,
    "end": 6044.689,
    "text": "Just, you know, what does the actual participant observe?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6045.61,
    "end": 6047.211,
    "text": "And then you have to think about the states, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6047.451,
    "end": 6049.672,
    "text": "What are the, what is the participant's beliefs?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6049.932,
    "end": 6058.018,
    "text": "What is the minimal set of beliefs they need to be able to make a decision, right, about how to get reward if it's a reward task?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6059.258,
    "end": 6064.041,
    "text": "You know, so that might be beliefs about what trial type it is, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6064.081,
    "end": 6065.082,
    "text": "Or it might be beliefs about",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6065.615,
    "end": 6068.697,
    "text": " what are the different choices I might make, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6068.737,
    "end": 6078.325,
    "text": "Like moving into the state of choosing, say, option one versus option two, you know, and then you have to think, okay, what are the different action sequences, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6078.365,
    "end": 6083.669,
    "text": "Like, does the agent just push a button and get lucky, you know, reward or no reward?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6083.909,
    "end": 6088.492,
    "text": "Or, you know, does the agent have to, you know, make a couple choices in a row?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6088.512,
    "end": 6091.114,
    "text": "You know, just what are the actual options, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6091.154,
    "end": 6094.857,
    "text": "And so, I mean, that's really what it boils down to is just figuring out,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6095.481,
    "end": 6097.062,
    "text": " What things do the participant observe?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6097.542,
    "end": 6100.404,
    "text": "You know, what beliefs do they need to make choices?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6100.544,
    "end": 6101.725,
    "text": "What choices are available?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6103.306,
    "end": 6106.388,
    "text": "You know, and I mean, it kind of builds itself beyond that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6106.669,
    "end": 6114.974,
    "text": "I mean, you have to realize that the update equations in active inference, you know, we've actually been showing are very general, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6115.174,
    "end": 6117.976,
    "text": "They don't change at all, depending on what task you're implementing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6117.996,
    "end": 6119.337,
    "text": "So you're not changing the equations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6119.497,
    "end": 6125.301,
    "text": "All you're doing is using the exact same update equations on a generative model that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6126.581,
    "end": 6129.542,
    "text": " can successfully simulate behavior on a task.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6130.723,
    "end": 6134.085,
    "text": "So I mainly think you just have to think about matrix and vector structure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6135.745,
    "end": 6142.689,
    "text": "So I can actually answer this question just by building or showing you how you get from this task structure to the coding question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6143.109,
    "end": 6143.47,
    "text": "Perfect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6144.91,
    "end": 6151.814,
    "text": "So just to basically build on that, all that you'd think about is the structure of the generative model because the update equations are totally generic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6152.274,
    "end": 6155.036,
    "text": "Unless you're doing something like fairly advanced,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6156.024,
    "end": 6176.32,
    "text": " where you actually do need to specify some type of addition to the generative model, use a new type of distribution, whatever, then you would need to re-derive the update equations, and you're going to have some time on your hands taking a lot of functional derivatives and setting the result equal to zero and figuring out what the answer is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6176.76,
    "end": 6182.184,
    "text": "But I have never had to do that personally, and I think very, very few people in the active inference literature have had to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6184.906,
    "end": 6185.787,
    "text": "Okay, so...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6187.29,
    "end": 6193.974,
    "text": " In terms of this task, this is a local, global, or basically like auditory, modified auditory oddball paradigm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6195.054,
    "end": 6198.876,
    "text": "It was kind of, I think this was the first paper that used it, although I'm not completely sure about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6199.356,
    "end": 6206.0,
    "text": "But basically they just have play you a series of tones and there are four possible conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6206.48,
    "end": 6213.804,
    "text": "And what they're trying to manipulate is your level of, or the time scale over which your expectations operate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6214.514,
    "end": 6218.577,
    "text": " because they're trying to get at expectations at different levels of the cortical hierarchy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6219.158,
    "end": 6222.86,
    "text": "And so the idea is that you can have regularities at two timescales.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6223.261,
    "end": 6228.865,
    "text": "So the first timescale is the local timescale, and that is just the series of five tones, say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6228.965,
    "end": 6232.168,
    "text": "So it might be... And these tones can be two different frequencies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6232.208,
    "end": 6236.151,
    "text": "So it might be beep, beep, beep, beep, beep, beep, beep, beep, beep, that type of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6238.132,
    "end": 6240.114,
    "text": "And the idea is that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6241.018,
    "end": 6245.426,
    "text": " let's say you violate an expectation on this local timescale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6245.626,
    "end": 6248.151,
    "text": "This might be something like the bottom row here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6249.954,
    "end": 6254.282,
    "text": "This would be beep-beep-boop, beep-beep-boop, beep-beep-boop, beep-beep-boop, beep-beep-boop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6254.984,
    "end": 6269.71,
    "text": " And if that happens 80% of the time or in 80% of the trials, you would have, like, a global expectation or expectation over a long timescale that there would be a violation on the fifth beep, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6270.27,
    "end": 6282.575,
    "text": "But on a local timescale, for neuronal processes, say, in primary auditory cortex or wherever, that are operating over this very rapid timescale, they are blind to this more global regularity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6282.655,
    "end": 6284.236,
    "text": "And so you will get essentially what this...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6284.87,
    "end": 6292.297,
    "text": " will give you is global expectations and violations of global expectations, particularly give you a P300.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6292.577,
    "end": 6299.143,
    "text": "So essentially that is a large positive potential over kind of like frontocentral electrode sites.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6299.483,
    "end": 6301.865,
    "text": "And that corresponds to a violation of global expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6302.971,
    "end": 6303.632,
    "text": " regularities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6304.192,
    "end": 6321.067,
    "text": "Whereas mismatched negativity correspond, which is kind of a negative, I think, I actually haven't, I'm not an auditory neuroscientist, so I'm sorry about this if I get it wrong, but broadly speaking, it's kind of over association courtesies, like auditory association courtesies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6322.088,
    "end": 6324.33,
    "text": "Not 100% about that though, sorry, I should have looked that up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6326.184,
    "end": 6334.207,
    "text": " Anyway, and that's a negative going potential that corresponds to violations of local expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6334.247,
    "end": 6347.412,
    "text": "And so just the reason we use this is because it's kind of the simplest possible model that gives you some type of realistic dynamics and also kind of highlights the face validity of this computational framework, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6348.792,
    "end": 6349.872,
    "text": "So any questions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6349.892,
    "end": 6351.353,
    "text": "Would you like to add anything, Ryan, before I...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6351.707,
    "end": 6380.967,
    "text": " pull out the code i mean i guess you know just just because i'm the one in control of the slide and the pointer here i mean i just just want to make sure that people understand exactly what what's corresponding to what you say so so basically the idea is just that at each short time scale right you could have each green one corresponds to a beep and the red one corresponds to a boop right so at the fast time scale you could be surprised that there's a boop at the end of four beeps um for instance if if most of the time for example it was just beep beep beep beep",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6381.73,
    "end": 6385.613,
    "text": " then whenever there's a beep, beep, beep, boop, then that's unexpected, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6385.633,
    "end": 6388.995,
    "text": "So that's an expectation violation at a low, fast timescale.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6390.797,
    "end": 6401.564,
    "text": "But what Chris is saying is that you can also have a long timescale thing, which is like how many times in a row is it beep, beep, beep, boop versus beep, beep, beep, beep, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6401.584,
    "end": 6406.088,
    "text": "So one longer timescale pattern would be four beep, beep, beep, beeps in a row.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6407.689,
    "end": 6410.631,
    "text": "And so if you come to expect four beep, beep, beep, beeps in a row,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6411.351,
    "end": 6420.337,
    "text": " Then if you hear a beep, beep, beep, boop, then your belief about the expected sequence of these four trials is what would be violated or not.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6420.937,
    "end": 6425.52,
    "text": "So at the fast timescale, you can have violations for each series of beep, beep, beep, beeps.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6426.261,
    "end": 6434.266,
    "text": "At the higher timescale, you can have expectation violation about the sequence of beep, beep, beep, beeps.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6434.346,
    "end": 6438.489,
    "text": "So that's the idea is you can have long timescale violations and short timescale violations.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6439.07,
    "end": 6450.517,
    "text": " where the short test timescale ones correspond to the low level and the high level, the second level of the model corresponds to the beliefs about the sequence of beep, beep, beep, beeps.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6451.838,
    "end": 6455.02,
    "text": "So anyway, so that's what's called global regularity versus local regularity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6455.56,
    "end": 6455.82,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6456.601,
    "end": 6460.883,
    "text": "Just for simplicity, I just simulated the local deviation global standard condition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6461.904,
    "end": 6467.047,
    "text": "So that would be, if you kind of look, the third from the bottom on the right-hand side of the screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6468.368,
    "end": 6468.788,
    "text": "Imagine that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6471.681,
    "end": 6474.023,
    "text": " And the local standard global deviation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6476.484,
    "end": 6478.686,
    "text": "So that might be, yeah, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6478.966,
    "end": 6482.088,
    "text": "Which is the very top on the right-hand side of the screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6482.689,
    "end": 6483.849,
    "text": "And so I'll just pull out the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6483.869,
    "end": 6486.151,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6486.331,
    "end": 6487.372,
    "text": "So now we've got to switch screens.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6488.152,
    "end": 6488.333,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6492.856,
    "end": 6493.156,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6494.517,
    "end": 6494.837,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6495.077,
    "end": 6496.538,
    "text": "Very interesting so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6496.618,
    "end": 6497.939,
    "text": "Thanks a lot, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6498.039,
    "end": 6498.98,
    "text": "And great questions, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6500.151,
    "end": 6501.152,
    "text": " So can everyone see my screen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6502.172,
    "end": 6503.012,
    "text": "Yeah, looks good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6503.052,
    "end": 6503.433,
    "text": "It's coming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6503.593,
    "end": 6504.033,
    "text": "Looks like cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6504.053,
    "end": 6504.233,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6505.254,
    "end": 6508.795,
    "text": "Let me just, okay, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6509.256,
    "end": 6512.137,
    "text": "Um, so I now cannot see the chat or any of the anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6512.177,
    "end": 6514.578,
    "text": "So if you need to get my attention, just like you'll have to shout out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6516.719,
    "end": 6516.919,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6517.259,
    "end": 6517.46,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6517.68,
    "end": 6518.98,
    "text": "Or just ask us periodically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6519.821,
    "end": 6520.821,
    "text": "Yeah, that's yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6521.382,
    "end": 6524.203,
    "text": "So at the first level, um, so there's two levels to this model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6525.015,
    "end": 6550.072,
    "text": " at the first level it's very simple the model there are there is one hidden state factor and it has two mutually exclusive states um high and it just corresponds to the tone of the stimulus and just high or low um then in terms of we then separate the generative model from the generative process here like we talked about in the previous code walkthrough um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6552.896,
    "end": 6559.823,
    "text": " And then as we're going through kind of in terms of likelihood mapping, it's again, really simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6560.603,
    "end": 6561.785,
    "text": "It's just an A matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6561.985,
    "end": 6573.476,
    "text": "So the A matrix is just an identity mapping where, sorry, these just to go through it very briefly to revise a bit, the columns correspond to the hidden states and the rows correspond to the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6573.496,
    "end": 6577.98,
    "text": "So this is saying when you are in a hidden state, high tone,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6578.972,
    "end": 6581.053,
    "text": " what is the probability that you will see a high tone?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6581.193,
    "end": 6583.153,
    "text": "Well, it's an identity matrix, so it's probability one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6584.614,
    "end": 6588.435,
    "text": "When you are in state low tone, what is the probability that you will see a low tone?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6588.535,
    "end": 6589.975,
    "text": "And it's again, hidden state one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6590.515,
    "end": 6593.376,
    "text": "We can then separate the generative model from the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6593.856,
    "end": 6607.24,
    "text": "And the reason we do that is because this idea of there being a, so the generative process, it is going to be the probability of a high tone hidden state or high tone state out there in the world, giving rise to a high,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6607.992,
    "end": 6610.214,
    "text": " toned observation is probability one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6610.594,
    "end": 6612.155,
    "text": "But our generative model is noisy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6613.076,
    "end": 6619.581,
    "text": "And if you want to actually simulate having an in silico brain that's at all realistic, you need to have some level of noise in that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6619.761,
    "end": 6633.751,
    "text": "So what we do there is we just run it through a softmax function, run the A matrix through a softmax function with a temperature parameter that will very slightly turn down the precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6634.352,
    "end": 6637.194,
    "text": "So if I just kind of, I'll just run all this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6640.114,
    "end": 6648.315,
    "text": " And then if we just open up little A, we see that it's now not a perfect identity mapping, but it's something pretty close.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6650.736,
    "end": 6663.678,
    "text": "By the way, so the reason I do that is because one, it's realistic, but also if you want to get ERPs at all, where ERPs are essentially changes in belief, if you have a perfect identity mapping, you'll never get ERPs because the agent is 100% confident all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6666.679,
    "end": 6669.439,
    "text": "So you never have to change your beliefs if you've got perfect beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6670.473,
    "end": 6671.133,
    "text": " Um, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6672.094,
    "end": 6676.437,
    "text": "Then in terms of transitions, um, this is just the bees.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6676.937,
    "end": 6679.658,
    "text": "It is again, a identity mapping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6679.698,
    "end": 6688.143,
    "text": "So that's just saying these that that's perfectly stable, uh, high tones don't turn into low tones, low tones, don't turn into high tones.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6688.964,
    "end": 6696.188,
    "text": "And at this first level of the model, this is now we essentially plug all those variables into our MDP structures that we saw last time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6697.858,
    "end": 6707.024,
    "text": " And at the first level of the model, the thing that we need to specify is this T, how many time steps are going to be at the first level per time steps at the second level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6707.624,
    "end": 6708.905,
    "text": "And we only want there to be one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6709.105,
    "end": 6710.526,
    "text": "So I'm just going to set that to one here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6711.346,
    "end": 6713.868,
    "text": "And again, ERP, we need to set that to one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6714.888,
    "end": 6716.709,
    "text": "This is essentially a resetting parameter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6717.73,
    "end": 6724.374,
    "text": "mdp.erp is the extent to which you reset your beliefs at each time step, at each new time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6724.824,
    "end": 6734.332,
    "text": " And the reason, so say you are modeling a human being wandering through a maze where your time steps correspond to, say, a couple of seconds in between things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6735.073,
    "end": 6742.499,
    "text": "You actually should, to be realistic or to have a realistic model, you should have a little bit of resetting in your posterior expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6744.181,
    "end": 6748.665,
    "text": "If, however, in this case, we're on the scale of seconds or milliseconds,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6749.175,
    "end": 6753.256,
    "text": " then it makes absolutely no sense to have resetting going on in your posterior expectations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6753.336,
    "end": 6774.482,
    "text": "So we set ERP equal to one, and that will determine... Yeah, the only thing I'll say here is this is something that you've got to kind of watch out for because for whatever reason, the default in the standard routines in the SPM underscore MDP underscore VB underscore X script, the default is four.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6775.462,
    "end": 6777.943,
    "text": "The default value for ERP is four if you don't specify it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6778.581,
    "end": 6785.683,
    "text": " And so you'll get pretty funny, probably inaccurate, um, simulations for ERPs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6786.243,
    "end": 6795.685,
    "text": "Um, if you don't set it back to one explicitly, there's a time scaling factor for how things are playing out at the neurophysiological versus the behavioral timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6796.685,
    "end": 6798.085,
    "text": "Well, I mean it affects behavior too.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6798.146,
    "end": 6803.587,
    "text": "It's just saying, it's just saying basically like, yeah, like Chris said, it's just how much do your beliefs go back to baseline?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6804.427,
    "end": 6804.487,
    "text": "Um,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6805.533,
    "end": 6827.408,
    "text": " compared to your posterior beliefs about that time about the you know like after the first observation um so like you could be just as surprised or more surprised at time step two even if your beliefs at time step one already favored what was going to happen at time step two yeah and a lot of cases you just don't want that you want priors to carry over um um so",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6828.984,
    "end": 6833.326,
    "text": " You could have something like complete resetting, which would be completely ridiculous, but you could do it if you wanted to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6833.846,
    "end": 6838.748,
    "text": "Or you could have no resetting at all, which is what makes sense in this situation, because you want there to be complete carryover.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6838.948,
    "end": 6848.131,
    "text": "You could do model fitting on empirical data and ask whether it's a better fitting model to have empirically a 0.6 or a 1 or a 1.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6848.171,
    "end": 6849.331,
    "text": "So you could fit this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6849.491,
    "end": 6852.412,
    "text": "You could treat this as a parameter that you fit as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6852.512,
    "end": 6855.773,
    "text": "Yeah, if you were fitting to match ERP waveforms or something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6856.334,
    "end": 6857.514,
    "text": "Yeah, I would definitely fit it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6858.434,
    "end": 6870.383,
    "text": " Okay, so this next part is where there are two key points in this where there is a separation from how we would do a first-level model or a single-level model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6870.884,
    "end": 6872.565,
    "text": "So we need to clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6872.745,
    "end": 6878.31,
    "text": "So essentially, usually, you'll just clear all of your A's, B's, and D's because you're going to reuse those matrices at the second level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6879.911,
    "end": 6882.673,
    "text": "And then you'll save your MDP structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6883.596,
    "end": 6898.421,
    "text": " and run it through this little MDP check thing, which should give you some nice little error, like very usually pretty helpful error messages telling you if you've got some weird shape matrices or I don't know, if I just have a zero here and ran it, for example, it would tell me, hey, your B matrix doesn't make any sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6901.242,
    "end": 6910.765,
    "text": "So then you'll then generally clear this MDP structure and save the MDP one into this little MDP, this other MDP structure here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6911.949,
    "end": 6917.21,
    "text": " So then moving on to the slower time scale or second level beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6917.711,
    "end": 6919.651,
    "text": "So this is where things get a little bit more complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6922.252,
    "end": 6927.893,
    "text": "And so there are three hidden state factors where these are all independent probability distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6929.374,
    "end": 6931.474,
    "text": "The first is sequence type.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6931.794,
    "end": 6941.237,
    "text": "And so this this is essentially there are three sequence types where this corresponds to sequences of tones at the first level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6941.587,
    "end": 6945.571,
    "text": " So there can be a whole sequence where it's just beep, beep, beep, beep, beep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6945.731,
    "end": 6946.371,
    "text": "There's no boops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6946.672,
    "end": 6948.213,
    "text": "And so that would be all high.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6948.693,
    "end": 6950.615,
    "text": "There could be all low, so it's all boops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6951.136,
    "end": 6953.698,
    "text": "There could be a high and then a low, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6954.278,
    "end": 6955.88,
    "text": "And there could be a low and then a high.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6956.02,
    "end": 6958.482,
    "text": "So this would be, does that kind of all make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6959.223,
    "end": 6965.969,
    "text": "And this corresponds to different sequences of hidden states at the first level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6970.782,
    "end": 6971.042,
    "text": " Got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6971.282,
    "end": 6974.324,
    "text": "Not all of them have to be used in each experiment, but that's the whole state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6974.964,
    "end": 6975.744,
    "text": "Yep, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6976.464,
    "end": 6979.006,
    "text": "Then this is actually where things get interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6979.106,
    "end": 6991.191,
    "text": "So you have to specify, when you build this type of models, you have to specify a time in trial hidden state factor, which is essentially the agent's beliefs about how things evolve over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6991.891,
    "end": 7000.435,
    "text": "And there's actually some really, it seems kind of like when I first, Ryan first taught me how to build these things, I kind of just had the assumption like, oh, this is just like a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7001.263,
    "end": 7010.009,
    "text": " it's just something that you need to build for the model to work, but it doesn't, it's just kind of a bit of mission formal machinery that doesn't track what the brain's doing to my delight and surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7010.349,
    "end": 7022.597,
    "text": "There actually is quite a bit of neurophysiological evidence that there are factorized representations of task phase in both medial temporal lobes and lateral prefrontal cortex, which is really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7024.518,
    "end": 7028.02,
    "text": "But essentially this would be something like the time in trial of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7028.781,
    "end": 7031.763,
    "text": " So I'm at time point one, regardless of what stimulus there is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7032.183,
    "end": 7034.465,
    "text": "I'm at time point two, regardless of what stimulus there is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7034.525,
    "end": 7042.83,
    "text": "I'm at time point N. Or I'm in the final time point where I have to give a response, regardless of what my response will actually be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7042.85,
    "end": 7044.491,
    "text": "Does that kind of all make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7047.493,
    "end": 7047.633,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7048.14,
    "end": 7051.301,
    "text": " And then the last hidden state factor is just the agent's response.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7051.661,
    "end": 7062.223,
    "text": "So to make this interesting, so we could have just set this up as a hidden Markov model and not had the agent give responses, which would have been fine, just would have been a very passive model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7062.583,
    "end": 7070.785,
    "text": "And just kind of to make this interesting and then so that people can read it and then build their own more sophisticated models and see how you would specify policies in a deep model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7071.165,
    "end": 7076.086,
    "text": "I basically just had the agent at the last time step, so the sixth time step,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7076.857,
    "end": 7086.479,
    "text": " just say whether the last beep or boop in the trial was the same as or different from the previous beeps or boops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7089.239,
    "end": 7090.579,
    "text": "Is that all clear so far?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7092.0,
    "end": 7093.06,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7093.4,
    "end": 7098.161,
    "text": "So the idea is that these sequence types, the agent has no prior expectations over all of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7098.181,
    "end": 7098.961,
    "text": "It's totally flat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7099.581,
    "end": 7105.062,
    "text": "So when this first D1 gets run through a softmax function, this will just be a completely flat vector.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7106.128,
    "end": 7111.21,
    "text": " But the agent always has a perfect prior belief that it is in state one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7112.791,
    "end": 7121.175,
    "text": "It also has the perfect prior belief that it doesn't know or it doesn't have any response prepared in terms of what report it will make.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7123.856,
    "end": 7127.878,
    "text": "Again, what we do here is essentially we separate the generative model from the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7128.498,
    "end": 7132.32,
    "text": "Just put little D2 just so it's not to confuse people with these different levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7134.465,
    "end": 7136.726,
    "text": " We multiply, this is actually really crucial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7137.186,
    "end": 7151.55,
    "text": "So when you specify a D and separate it, there's a little flag in the VBX script or the model inversion script that tells it, okay, you are now learning D and you'll get updates to D. But sometimes you don't actually want to simulate learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7152.41,
    "end": 7159.332,
    "text": "You want in the very same way that you want to like simulate some process outside of learning or some process independent of other things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7160.293,
    "end": 7164.374,
    "text": "In a lab, when you actually run experiments, sometimes you just want to isolate one process in simulations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7164.813,
    "end": 7174.36,
    "text": " So to essentially turn off learning, you just make the concentration parameters in these, which are concentration parameters from Dirichlet distribution, like really massive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7175.181,
    "end": 7190.311,
    "text": "And so the difference between, say, 100 and, adding a count of one will essentially do nothing to the agent's behavior then, if the concentration parameter's already at 100, which is why we specify it this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7192.473,
    "end": 7193.374,
    "text": "Yeah, so if you think about it,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7194.042,
    "end": 7212.292,
    "text": " depending on the type of task, if the thing thinks that learning is going on because you're separating the generative model from the generative process, then if you have low concentration parameter values, then the epistemic value for parameter exploration will make a big difference, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7212.332,
    "end": 7220.177,
    "text": "The thing will actually be driven to move to states that will help it learn something about what those concentration parameters should be.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7221.498,
    "end": 7223.799,
    "text": "So it can affect behavior in ways that kind of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7226.225,
    "end": 7228.887,
    "text": " problems for the kind of tasks that you're trying to model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7230.327,
    "end": 7240.993,
    "text": "So one thing, yes, is that having them at really high values means that the agent just isn't going to do any seeking information about parameters because it just thinks it already knows them really well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7242.034,
    "end": 7247.437,
    "text": "But also, it still is going to add counts to those distributions after each observation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7247.997,
    "end": 7251.039,
    "text": "So changing a distribution from 100 to 100",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7253.119,
    "end": 7281.208,
    "text": " two 100s to 100 and 101 the actual distribution is like still basically the same whereas if it was like one and one and you add a count so it's now one and two that's a very big change in the distribution um so both of those things together just kind of make it as though it doesn't think it's learning anything cool okay um is that clear to everyone all good to move on",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7285.863,
    "end": 7292.285,
    "text": " So then the next thing, so I think the hardest part of doing active inference or building these models is factorizing the A matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7292.585,
    "end": 7295.246,
    "text": "So these are all independent distributions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7295.886,
    "end": 7298.527,
    "text": "But they interact in the A matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7298.927,
    "end": 7302.368,
    "text": "And so you have to think about that when you're specifying it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7302.808,
    "end": 7309.37,
    "text": "And so what this one, what this matrix says is, so remember that our first hidden state is sequence type.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7309.71,
    "end": 7312.991,
    "text": "So this is just, and our first outcome modality is just the stimulus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7313.561,
    "end": 7317.803,
    "text": " And I'm just going to quickly dip down so you see how this level is connected to the bottom level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7318.703,
    "end": 7320.804,
    "text": "We have to specify something called a link function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7321.284,
    "end": 7335.269,
    "text": "And this will just be a little matrix or a vector, depending on how many hidden state modalities you have in the first and second level, where the rows in this matrix correspond to lower level hidden state factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7336.067,
    "end": 7340.848,
    "text": " And the columns correspond to high-level outcome modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7341.148,
    "end": 7363.653,
    "text": "And so all that we're saying, and so when you specify these things, you actually need to be careful that, say, the number of hidden states you have at the higher level, or sorry, the number of outcomes that are possible in your outcome modality match the number of hidden states that you have in your first level, at the first level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7363.713,
    "end": 7364.393,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7365.765,
    "end": 7371.066,
    "text": " because your second level of your model is treating those first level hidden states as observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7376.408,
    "end": 7380.229,
    "text": "So here, the two observations are high tone or low tone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7380.369,
    "end": 7393.233,
    "text": "And all this is saying, so this first column is high tone, second column is high sequence, second column is low sequence, third column is high, then low, and last one is low, then high.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7394.974,
    "end": 7398.856,
    "text": " This is, and we're specifying this for time step one to three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7399.437,
    "end": 7411.545,
    "text": "So what we're doing here is we are going to, so we have set up our A matrix where there's four hidden states corresponding to sequence type and two outcomes, just to reiterate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7411.805,
    "end": 7420.931,
    "text": "And then what we're gonna do is we're gonna loop over the six time point in the trial and loop over all the states in the report.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7422.011,
    "end": 7423.652,
    "text": "And so then we're just gonna step but,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7427.717,
    "end": 7437.604,
    "text": " then basically I'm just gonna set this up so that there's just an identity mapping essentially between hidden states and observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7439.365,
    "end": 7446.831,
    "text": "And I've done this, I've looped this overall, but this is actually not an accurate generative model because we want there to be an odd ball at the fourth time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7447.011,
    "end": 7448.772,
    "text": "And so I just specify that here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7448.932,
    "end": 7457.178,
    "text": "So I take this I set, which corresponds to this kind of second hidden state factor, and I set it equal to four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7457.779,
    "end": 7460.38,
    "text": " And then what you can see here is that there's now a change in the mapping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7460.4,
    "end": 7469.344,
    "text": "So remember, this first column is high, second column is low, third column is high-low, and then fourth column is low-high.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7469.744,
    "end": 7470.704,
    "text": "So we now see a change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7470.744,
    "end": 7477.467,
    "text": "So this is then saying when you're in a high hidden state, at the fourth time step, you'll see a high tone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7477.767,
    "end": 7479.648,
    "text": "When you're in a low tone, the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7480.028,
    "end": 7484.55,
    "text": "But it gets interesting, or you get a change from the matrix above.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7485.489,
    "end": 7495.334,
    "text": " fourth time step because when it's in a high-low at the fourth time step, it will hear a low tone and in low-high, you'll hear a high tone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7496.354,
    "end": 7497.435,
    "text": "Is everyone pretty clear about that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7500.876,
    "end": 7501.917,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7502.357,
    "end": 7511.081,
    "text": "We're looping over all this j equals one to three in both of these is just saying we're looping over all possible responses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7511.101,
    "end": 7514.903,
    "text": "We're not making that mapping between those hidden states between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7515.475,
    "end": 7523.657,
    "text": " the first hidden state sequence and in any way dependent on the response.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7523.917,
    "end": 7525.397,
    "text": "So it's independent of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7527.638,
    "end": 7531.639,
    "text": "So then the second outcome modality that we need to specify is just report feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7531.979,
    "end": 7541.841,
    "text": "So with the agent, we're going to have it make an action or specify policy allowing it to make an action at the fifth time step, at the end of the fifth time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7543.902,
    "end": 7545.122,
    "text": "Sorry, the sixth time step rather.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7548.351,
    "end": 7553.154,
    "text": " And we then need to kind of give the agent feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7553.634,
    "end": 7560.238,
    "text": "So there are three hidden, and this is no longer, this feedback modality is not connected to the first level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7561.919,
    "end": 7566.181,
    "text": "And so there are three outcomes, null, which is just, we don't give the agent any feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7566.221,
    "end": 7573.905,
    "text": "So it just has a totally flat preference distribution essentially over this, over null, doesn't care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7575.235,
    "end": 7587.464,
    "text": " for the first five time steps, and then at the sixth time step, we need to start messing with whether it thinks it's going to be, whether agents thinks it's going to receive wrong versus right feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7588.104,
    "end": 7593.748,
    "text": "So this would be saying something like, okay, so here you report that they are the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7594.409,
    "end": 7601.194,
    "text": "So this is response two, so J equals two, and I equals six correspond to the sixth time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7601.234,
    "end": 7602.695,
    "text": "So these, where these correspond to,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7603.24,
    "end": 7607.544,
    "text": " what we're indexing into elements of these hidden state factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7609.646,
    "end": 7618.354,
    "text": "And then, so the idea is then, what this is saying is that at hidden state for 1 and 2, if you say they're the same, remember this is all highs, all lows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7618.554,
    "end": 7621.296,
    "text": "If you then say it's the same, you will get correct feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7621.957,
    "end": 7627.582,
    "text": "And because this is high-low and low-high, if you say it's the same, it will give you incorrect feedback.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7628.427,
    "end": 7634.489,
    "text": " then we see this is reversed when we say the agent is going to give the agent the option to report different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7636.289,
    "end": 7644.251,
    "text": "So these two, it'll be incorrect for high and low sequences and correct for low-high and high-low.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7644.271,
    "end": 7646.452,
    "text": "Is everyone with me?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7649.853,
    "end": 7650.073,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7650.873,
    "end": 7651.073,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7651.994,
    "end": 7656.675,
    "text": "Okay, then again, just like we did before, we're gonna reduce the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7658.055,
    "end": 7670.018,
    "text": " we're going to separate the hidden states, sorry, the hidden generative model from the generative process and reduce the precision with a temperature parameter of two, which is super precise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7670.078,
    "end": 7671.539,
    "text": "It's just not a perfect identity mapping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7672.159,
    "end": 7676.46,
    "text": "And we're then going to disable learning again, because we're not interested in learning at the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7679.321,
    "end": 7681.301,
    "text": "By the way, you do get fairly similar results if you do learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7681.321,
    "end": 7683.142,
    "text": "So I'm not kind of like cooking the books.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7683.482,
    "end": 7683.922,
    "text": "It's just that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7684.437,
    "end": 7690.751,
    "text": " In terms of the tutorial, it didn't really make sense to add an extra several lines on learning for a fairly simple simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7691.782,
    "end": 7699.149,
    "text": " It's awesome, and just to highlight, that is a similar design move as when you mentioned several times separating the generative process from the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7699.549,
    "end": 7717.485,
    "text": "It allows you to have a cue that isn't always associated, like high tone is the high tone, they hear it perfectly, but now it's a situation where they can't really tell if it's one shade of a color or another, so it allows a lot of expressivity, and it will just be really awesome to, in the coming months and years, see and return to the code",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7717.785,
    "end": 7725.609,
    "text": " to understand exactly how different groups are implementing it to model different specific situations that kind of just go down these roads that you're just pointing out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7725.689,
    "end": 7729.932,
    "text": "But we're staying on the freeway, but you're pointing out different exits that really are interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7730.812,
    "end": 7731.813,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7731.913,
    "end": 7739.957,
    "text": "There's lots of, I mean, there's quite a few different, like in previous papers, you know, for instance, like we've modeled things like noisy learning, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7740.017,
    "end": 7744.54,
    "text": "So where, for instance, like in the generative process, it is, you're always being presented with one object, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7744.78,
    "end": 7745.3,
    "text": "And that's like 100% true.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7745.34,
    "end": 7745.4,
    "text": "But",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7747.728,
    "end": 7776.027,
    "text": " the the a matrix and the generative model you know you kind of soft max it with some precision parameter like chris was doing so it's it's um not very precise so it's kind of like for instance like seeing an object but having it be blurry you know or something like that um you know so it's how well do you learn uh from stuff even if what you're seeing is kind of imprecise or like for instance figuring out where a whether a tone was present in some like white noise you know like and there's some experiments to do that kind of thing so it",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7776.343,
    "end": 7783.908,
    "text": " Yeah, I mean, these models are incredibly flexible for whether you want to do just perception or just learning or just decision making with or without learning.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7783.928,
    "end": 7788.571,
    "text": "So it's, I mean, that's part of why they're so nice.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7789.412,
    "end": 7789.572,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7790.252,
    "end": 7792.934,
    "text": "And so then just kind of moving on to the transition probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7794.455,
    "end": 7801.26,
    "text": "So B, B2, this is just, so this corresponds to our first sequence of tones, hidden state factor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7801.74,
    "end": 7806.203,
    "text": "And this is an identity matrix, four by four identity matrix, because there are four hidden states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7807.052,
    "end": 7810.833,
    "text": " This is just saying that our sequence doesn't change to another sequence halfway through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7810.933,
    "end": 7811.533,
    "text": "That makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7813.433,
    "end": 7827.796,
    "text": "Now, things get interesting in terms of specifying the transition functions when we talk about the second trial phase transitions and our policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7827.856,
    "end": 7834.878,
    "text": "The idea here is that we then specify this trial phase transition function so that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7836.593,
    "end": 7841.695,
    "text": " it will kind of deterministically step through all of the phases in the sequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7841.735,
    "end": 7850.398,
    "text": "So this is state one, or row, sorry, columns are state, hidden state one, rows are, will be kind of hidden state one, hidden state two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7850.718,
    "end": 7858.021,
    "text": "So what this is saying is that at time one, hidden state one transitions to hidden state two, hidden state two transitions to hidden state three, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7858.401,
    "end": 7865.164,
    "text": "And if I wanted to, if I wanted to simulate some infinite number, like it's not actually infinite, this is a finite horizon MVP,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7865.814,
    "end": 7880.898,
    "text": " But if I wanted to simulate some very large number of these trials, I could put the last one so that this last trial, or sorry, when it's in the last report phase, it will transition back to the first phase, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7881.158,
    "end": 7881.938,
    "text": "But I don't want to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7882.119,
    "end": 7887.36,
    "text": "I just want to have the last time step in the trial as an absorbing state that the simulation will stop on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7887.92,
    "end": 7891.521,
    "text": "And then simulate each trial as kind of a separate thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7892.301,
    "end": 7894.562,
    "text": "But just to highlight that in case you wanted to do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7894.898,
    "end": 7904.465,
    "text": " If you want to like simulate, there are some ways of simulating kind of heartbeats and things like that where you specify a transition function that has an orbit built into it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7907.908,
    "end": 7912.291,
    "text": "So then in terms of report, this is the controllable hidden state factor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7913.112,
    "end": 7923.7,
    "text": "And these, it will add, will now have like a multidimensional matrix where the third dimension in the matrix just corresponds to basically the control state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7924.321,
    "end": 7928.643,
    "text": " So this would just be I am in null and I am going to stay in null.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7929.443,
    "end": 7930.284,
    "text": "I'm not going to do anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7930.404,
    "end": 7936.246,
    "text": "The second one would be you can get from any hidden state, you can transition yourself into reporting same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7936.527,
    "end": 7940.548,
    "text": "And this third one is from any hidden state, you can transition yourself into reporting different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7941.809,
    "end": 7946.351,
    "text": "Then in terms of the policies, there are six time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7946.491,
    "end": 7947.491,
    "text": "So we specify that here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7947.672,
    "end": 7950.153,
    "text": "We specify the number of hidden state factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7950.373,
    "end": 7953.134,
    "text": "So remember, again, there's sequence type.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7954.71,
    "end": 7956.491,
    "text": " time in trial and report modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7957.132,
    "end": 7957.833,
    "text": "So three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7959.714,
    "end": 7961.096,
    "text": "Then we've got two policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7961.336,
    "end": 7963.578,
    "text": "So these are the number of options that the agent will have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7964.499,
    "end": 7968.983,
    "text": "And then these are deep policies, which are consistent throughout the whole trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7969.083,
    "end": 7977.812,
    "text": "And so basically, or this is to say the agent will be computing these over the course of the whole trial, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7978.729,
    "end": 7984.63,
    "text": " And so all this is saying is that the agent stays in state hidden kind of action one, which is just null.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7984.87,
    "end": 7985.59,
    "text": "It doesn't do anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7985.61,
    "end": 7986.231,
    "text": "It doesn't do anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7986.271,
    "end": 7986.991,
    "text": "It doesn't do anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7987.071,
    "end": 7987.751,
    "text": "Can't do anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7987.971,
    "end": 7990.331,
    "text": "And at the last time step, we allow it to choose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7990.692,
    "end": 8004.374,
    "text": "And that just corresponds to kind of, you can imagine not actually presenting the participant with in psychos and psychophysics experiment or whatever, not presenting it with an option to actually move, change the key, hit a keyboard or anything like that until the last time step of the trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8006.535,
    "end": 8006.955,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8006.995,
    "end": 8007.155,
    "text": "So.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8007.918,
    "end": 8009.74,
    "text": " Last bit, any questions so far?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8012.402,
    "end": 8012.562,
    "text": "Nope.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8013.603,
    "end": 8014.764,
    "text": "Looks pretty good though, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8016.206,
    "end": 8018.688,
    "text": "Okay, so then we've got the first C matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8019.128,
    "end": 8026.755,
    "text": "This will just be a two by T or two by six matrix of zeros.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8026.976,
    "end": 8029.818,
    "text": "So if I just kind of hit go on this, we can take a look at it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8030.158,
    "end": 8030.339,
    "text": "Whoops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8038.052,
    "end": 8039.793,
    "text": " So I'm going to hit run at some point soon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8039.813,
    "end": 8041.453,
    "text": "We can check out everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8042.493,
    "end": 8044.234,
    "text": "But this is just what the C matrix looks like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8044.294,
    "end": 8048.755,
    "text": "So this is the agent's preference for hearing a particular tone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8048.775,
    "end": 8050.676,
    "text": "So this is just saying agent doesn't care at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8050.856,
    "end": 8051.996,
    "text": "It has no preference for tone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8055.577,
    "end": 8057.218,
    "text": "Then our report hidden state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8057.478,
    "end": 8067.381,
    "text": "This is, again, it's going to be completely flat, essentially, except for at the last time step when it receives feedback, it has a preference for not being incorrect and a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8068.907,
    "end": 8070.228,
    "text": " preference for being correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8073.228,
    "end": 8084.552,
    "text": "I just want to make sure people understand that the brackets, we went over this last time, but the brackets are what say what output modality corresponds to what A matrix.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8084.572,
    "end": 8093.575,
    "text": "C2 brackets 2 means that that corresponds to the observations in the A matrix with brackets 2.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8093.635,
    "end": 8096.235,
    "text": "That's how you know that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8098.922,
    "end": 8105.787,
    "text": " this is the one that corresponds to observing feedback, whereas the first one is the one that corresponds to just observing tone.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8106.047,
    "end": 8110.91,
    "text": "So just to make it clear that you use the bracket numbers to assign to the outcome modalities.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8111.591,
    "end": 8111.731,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8112.612,
    "end": 8115.033,
    "text": "And then, so then that's basically what built our MDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8115.173,
    "end": 8116.594,
    "text": "So we're just going to specify it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8116.634,
    "end": 8119.757,
    "text": "So we've now got our earlier MDP structure, if we remember.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8120.117,
    "end": 8121.798,
    "text": "So this is MDP one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8121.818,
    "end": 8125.861,
    "text": "And this is the thing that we specified all the way back when we were talking about level one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8127.786,
    "end": 8130.748,
    "text": " And we then plug that into our new MDP structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8130.888,
    "end": 8133.29,
    "text": "So we'll have MDP dot MDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8133.33,
    "end": 8136.613,
    "text": "So this is the Markov decision process at the lower level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8137.293,
    "end": 8140.456,
    "text": "We then plug it into our new MDP structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8141.797,
    "end": 8143.959,
    "text": "Or this will just be a subordinate MDP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8145.16,
    "end": 8146.741,
    "text": "And we have to specify a link function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8146.761,
    "end": 8155.508,
    "text": "And we talked about that before, but just to reiterate, rows here are... Sorry, I'll start with... Rows are...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8156.772,
    "end": 8162.276,
    "text": " lower level hidden state factors and columns are high level observation modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8162.516,
    "end": 8171.782,
    "text": "So all that we're saying here is that we want the lower level observation modality or lower level hidden state one to plug into observation modality one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8172.182,
    "end": 8177.066,
    "text": "So the hidden state to the first level will be treated but as observation to the second level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8179.767,
    "end": 8184.971,
    "text": "Okay, then we just plug in all of our variables that we saw before, time, our likelihood mapping, the generative",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8185.532,
    "end": 8189.095,
    "text": " model for our likelihood mapping, et cetera, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8189.675,
    "end": 8193.958,
    "text": "And so Cs, Ds, and our V, which is our policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8194.318,
    "end": 8199.942,
    "text": "And then again, we need to set our decay slash reset parameter to number one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8201.743,
    "end": 8211.55,
    "text": "Then in terms of MDP, we can just specify names for our outcome modalities and our transition functions, which will just kind of make interpreting the plots a little bit nicer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8212.383,
    "end": 8221.487,
    "text": " And then lastly, you just plug the whole thing, this whole MDP structure into our SPM MDP check thing, which will again give you some nice informative error messages, which are extremely helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8224.048,
    "end": 8225.509,
    "text": "I still use that thing all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8227.109,
    "end": 8228.41,
    "text": "And then we can just run it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8229.19,
    "end": 8231.171,
    "text": "And so let's do that right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8232.292,
    "end": 8241.876,
    "text": "And by the way, so I do have a lot of, I'm just gonna run it and kind of show you what it looks like, and then I'm gonna go through how I simulated each of the specific conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8242.403,
    "end": 8245.686,
    "text": " because we did something similar to how Ryan simulated learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8250.351,
    "end": 8263.263,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8263.663,
    "end": 8265.185,
    "text": "So I'm going to hide this stuff for now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8267.006,
    "end": 8267.767,
    "text": "Slight spoiler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8270.835,
    "end": 8271.155,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8271.276,
    "end": 8274.358,
    "text": "And so this is just, I'll just look at one of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8274.718,
    "end": 8275.018,
    "text": "Sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8276.419,
    "end": 8278.18,
    "text": "Just so we get an idea of what's going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8279.761,
    "end": 8281.562,
    "text": "So this is just hidden state sequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8281.763,
    "end": 8282.883,
    "text": "The sequence is the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8282.983,
    "end": 8285.405,
    "text": "The agent believes it was the same throughout the whole trial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8285.585,
    "end": 8285.805,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8285.885,
    "end": 8286.386,
    "text": "That's true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8287.346,
    "end": 8290.568,
    "text": "Time in trial transitioned to the next point, just as we expected it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8290.889,
    "end": 8298.614,
    "text": "And then at the last time step, because this was a all kind of all high sequence,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8299.491,
    "end": 8301.693,
    "text": " It just said they were the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8302.473,
    "end": 8304.214,
    "text": "And so then it got the answer right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8305.675,
    "end": 8310.119,
    "text": "I think it's only sharing your... Yeah, it's only showing the MATLAB window.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8310.419,
    "end": 8312.04,
    "text": "We don't see the plots.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8312.66,
    "end": 8314.141,
    "text": "Oh, really?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8317.684,
    "end": 8324.028,
    "text": "Okay, let's see if I can... God damn it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8324.088,
    "end": 8326.65,
    "text": "If you dock them, you might be able to pull it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8327.551,
    "end": 8328.992,
    "text": "Yep, slide into the IDE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8333.088,
    "end": 8335.429,
    "text": " Or share a whole screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8335.81,
    "end": 8337.431,
    "text": "Can you see the screen now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8337.511,
    "end": 8338.031,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8338.251,
    "end": 8339.112,
    "text": "Now we see them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8339.132,
    "end": 8339.352,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8339.372,
    "end": 8340.133,
    "text": "Now we get to the block.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8340.973,
    "end": 8341.253,
    "text": "Sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8341.313,
    "end": 8342.674,
    "text": "I was just talking to myself then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8342.714,
    "end": 8343.175,
    "text": "That sucks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8343.795,
    "end": 8344.416,
    "text": "It was fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8346.297,
    "end": 8346.597,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8346.757,
    "end": 8346.997,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8348.178,
    "end": 8350.88,
    "text": "So again, this is the stable hidden state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8350.9,
    "end": 8350.94,
    "text": "Hi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8351.881,
    "end": 8352.101,
    "text": "Hi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8352.932,
    "end": 8359.018,
    "text": " This is our time in trial thing, stably transitioning from one point to another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8359.498,
    "end": 8366.485,
    "text": "This is our report hidden state, which just says at the second time step, the agent reported same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8366.565,
    "end": 8368.407,
    "text": "Then it got feedback that it was correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8372.671,
    "end": 8374.573,
    "text": "Then I'm just going to quickly go through",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8377.475,
    "end": 8386.718,
    "text": " Essentially how I simulated all the conditions because remember we want to simulate local deviation then global standard and local standard global deviation That makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8386.778,
    "end": 8400.502,
    "text": "So I'm going to simulate ten trials where that's ten collections of beep beep beep beeps or beep beep beep boops in a row And what we want to do is essentially",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8402.697,
    "end": 8405.199,
    "text": " have the agent, it is going to be doing some learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8405.399,
    "end": 8411.923,
    "text": "It's going to be learning a prior expectation over what sequence it should be in, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8413.103,
    "end": 8414.244,
    "text": "And so, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8414.324,
    "end": 8417.206,
    "text": "Just to make sure they understand this, so go back up to the d's.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8417.966,
    "end": 8423.209,
    "text": "So if you notice, he's only multiplying d2 and d3 by 100.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8423.249,
    "end": 8423.329,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8423.349,
    "end": 8426.751,
    "text": "So d1, d2 brackets 1, the first state factor, is still 100.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8431.55,
    "end": 8432.651,
    "text": " just one, one, one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8433.311,
    "end": 8437.914,
    "text": "So, which allows it to learn one, but not learn state factor two and state factor three.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8438.615,
    "end": 8439.495,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8441.496,
    "end": 8448.421,
    "text": "And so what we should have at the end of our local deviation thing, for example, so we have two, sorry, wrong part of the code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8449.041,
    "end": 8449.321,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8449.381,
    "end": 8460.068,
    "text": "So for our local deviation, global standard manipulation or simulation, what we're going to do is just the first nine trials will all be a high low.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8460.429,
    "end": 8461.029,
    "text": "So it will be,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8461.991,
    "end": 8462.851,
    "text": " Beep, beep, beep, boop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8463.011,
    "end": 8463.812,
    "text": "Beep, beep, beep, boop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8463.852,
    "end": 8464.632,
    "text": "Beep, beep, beep, boop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8465.052,
    "end": 8475.856,
    "text": "And then the global, so then our 10th trial, however, is going to be the same because it's a global standard.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8475.936,
    "end": 8488.441,
    "text": "So the global standard is the beep, beep, beep, boop, but we should get a kind of local deviation and we should always get a mismatch negativity because there's the last one deviates from the kind of the local temporal regularity, if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8489.358,
    "end": 8493.261,
    "text": " Then in our local standard global deviation, we're going to invert that structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8494.062,
    "end": 8497.324,
    "text": "So the first nine trials are all high-low.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8498.485,
    "end": 8500.106,
    "text": "So again, we've got beep, beep, beep, boops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8501.888,
    "end": 8508.332,
    "text": "But at the last time step, there is a beep, beep, beep, beep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8508.693,
    "end": 8516.819,
    "text": "And when we do that, we won't get any type of mismatch negativity or first-level ERP to that last",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8517.281,
    "end": 8520.502,
    "text": " kind of surprise response at the last time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8521.162,
    "end": 8530.025,
    "text": "We will, however, get a global deviation because the second level is now really surprised that there wasn't a deviation at the first level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8530.986,
    "end": 8532.766,
    "text": "Does that all kind of make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8533.787,
    "end": 8534.067,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8534.927,
    "end": 8535.167,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8535.327,
    "end": 8538.869,
    "text": "And basically what we do is we'll just specify n equals 10, this number of trials.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8539.289,
    "end": 8543.39,
    "text": "We'll get our MDP structure that we kind of put together before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8544.07,
    "end": 8545.491,
    "text": "We'll put it into our MDP deal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8545.999,
    "end": 8558.608,
    "text": " So that will just give us 10 MDPs which are to start with all identical, and then we're just going to choose to select the 10th one and change, either have and mess with the hidden state factor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8558.668,
    "end": 8560.069,
    "text": "So here we're not actually changing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8560.089,
    "end": 8563.091,
    "text": "It's the same as the first nine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8563.331,
    "end": 8564.972,
    "text": "But in the second example, we're changing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8565.312,
    "end": 8571.737,
    "text": "We're changing it from a local deviation to a local standard or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8573.427,
    "end": 8575.368,
    "text": " which will give rise to a global deviation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8576.009,
    "end": 8587.794,
    "text": "I'm actually not going to, for the sake of time, I'm actually not going to go through all of the code for just plugging this stuff in because this is literally just putting our structures into a plotting script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8587.894,
    "end": 8589.415,
    "text": "Here, things get more interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8589.895,
    "end": 8593.077,
    "text": "Here is where I make some custom ERP plots, which I think are cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8594.078,
    "end": 8597.419,
    "text": "But again, I actually don't think walking through the code is particularly helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8597.459,
    "end": 8600.221,
    "text": "I think just the type of thing, the way I learned this was I just spent a day",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8601.633,
    "end": 8606.194,
    "text": " or half a day just reading through someone else's code and figuring it out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8607.455,
    "end": 8626.58,
    "text": "So the only thing that I would make sure is that so when you're doing this U1 underscore one, sorry, like it's just, these are ways of indexing and pulling the actual simulated firing rates and ERPs.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8627.642,
    "end": 8633.145,
    "text": " out of the MDP structure after you run it through the VBX code.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8634.406,
    "end": 8647.212,
    "text": "So this is just representing kind of the most straightforward way of pulling those simulation results out of particular cells in the MDP structure after it's run.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8647.232,
    "end": 8655.697,
    "text": "And we have a table in the tutorial, I think it's table three, that explains the structure of each of those cells and where each of those...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8656.929,
    "end": 8658.93,
    "text": " each of those simulation results are.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8659.75,
    "end": 8660.45,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8660.57,
    "end": 8666.172,
    "text": "And so then I'm just going to hit run and we'll kind of walk through what this stuff looks, what these plots look like together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8673.615,
    "end": 8673.855,
    "text": "Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8675.376,
    "end": 8675.676,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8676.176,
    "end": 8676.496,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8676.596,
    "end": 8681.198,
    "text": "So these are my custom ERP plots on the right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8683.279,
    "end": 8684.359,
    "text": "And so I'm going to start",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8685.762,
    "end": 8688.223,
    "text": " Start there, actually, because I think they're kind of nicer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8697.764,
    "end": 8698.204,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8698.964,
    "end": 8707.406,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8708.126,
    "end": 8712.887,
    "text": "So far left, we have a, or top left, sorry, we have a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8713.717,
    "end": 8716.138,
    "text": " global standard versus a global deviation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8716.918,
    "end": 8724.52,
    "text": "And the way you calculate the mismatch negativity is you just subtract the global deviation from the global standard.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8724.66,
    "end": 8727.6,
    "text": "And then you get this nice, that's what we have on our top right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8728.12,
    "end": 8741.003,
    "text": "We have this nice kind of negative going ERP that looks exactly, I mean, I'm not going to show you this, but if you want to satisfy yourself with this, this looks like kind of, for such a simple model, it's kind of shocking how much this looks like a standard mismatch negativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8744.397,
    "end": 8745.177,
    "text": " And so that's really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8746.078,
    "end": 8753.621,
    "text": "Then on our second one here, this is our two, this is our global standard, which is in blue, and our global deviation, which is in red.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8753.981,
    "end": 8755.822,
    "text": "And then we can subtract them from one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8756.342,
    "end": 8768.047,
    "text": "And we can just look at kind of the, we get a nice, large, positive going potential that looks a lot like a P300.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8768.187,
    "end": 8768.787,
    "text": "So then in terms of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8775.592,
    "end": 8779.058,
    "text": " I'm just gonna show you a couple of the local deviation, local standard things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8780.36,
    "end": 8783.946,
    "text": "Sorry, I'm gonna close these and these.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8783.966,
    "end": 8788.012,
    "text": "Just kind of clean up the screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8790.208,
    "end": 8797.173,
    "text": " It's nice, though, that someone can just download this, and also an important note is installing all of the SPM prerequisites.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8797.594,
    "end": 8817.808,
    "text": "Maybe we could do a standalone in the future, but once the packages are installed, someone can just run the script and have also all of these figures be spit out, and then it looks like there's enough commentary, and hopefully these videos are enough of a walkthrough, at least of early versions of the code, where you can tweak different things and start seeing how it plugs into other...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8818.769,
    "end": 8820.21,
    "text": " things you might want to explore with the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8820.49,
    "end": 8825.191,
    "text": "But all these figures just come out in one batch and you're just fighting them away over there, Christopher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8826.011,
    "end": 8826.992,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8827.212,
    "end": 8843.597,
    "text": "So I guess one thing to say is one reason why I'm not particularly motivated to make a big standalone kind of thing is even if I were to do that, which I don't want to do, but even if I were to do that, by the time I'd rewritten all of the functions, I would essentially have a package of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8843.988,
    "end": 8846.912,
    "text": " that is as cumbersome to download as SPM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8847.153,
    "end": 8850.658,
    "text": "But SPM is written in a really nice way and it's super easy to install.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8850.678,
    "end": 8854.164,
    "text": "So it would actually be a lot easier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8854.184,
    "end": 8858.23,
    "text": "It's just a lot easier to install SPM that would be to go to my GitHub say and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8858.703,
    "end": 8861.204,
    "text": " put all of this stuff onto your laptop, make sure all the parts work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8861.304,
    "end": 8861.524,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8862.104,
    "end": 8872.327,
    "text": "Maybe a future supplement could just be start with a virtual machine and let's just install the prerequisites and just actually do a full clean installation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8872.367,
    "end": 8875.128,
    "text": "Could be a good point of reference, but thanks for that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8875.188,
    "end": 8875.548,
    "text": "Continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8875.728,
    "end": 8876.068,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8876.188,
    "end": 8879.069,
    "text": "I mean, it's, I mean, it's really very, it'd be very short and sweet to do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8879.229,
    "end": 8882.45,
    "text": "I mean, downloading SPM like is, you know, it's freeware.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8882.63,
    "end": 8886.071,
    "text": "I mean, it doesn't just takes a couple of minutes to download and really all you have to do",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8886.829,
    "end": 8889.591,
    "text": " is just once you download it, is just go into MATLAB and set the path.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8889.812,
    "end": 8891.093,
    "text": "Like that's it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 8891.193,
    "end": 8893.355,
    "text": "It'd be like five minute tutorial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8893.915,
    "end": 8896.457,
    "text": "I think there's a function called install SPM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8896.477,
    "end": 8901.702,
    "text": "So you go into MATLAB and run the function and install SPM.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8902.242,
    "end": 8903.543,
    "text": "Okay, but returning to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8904.284,
    "end": 8907.287,
    "text": "So each of these points kind of, can everyone see my pointer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8907.427,
    "end": 8907.787,
    "text": "I'm hoping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8908.087,
    "end": 8908.468,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8909.068,
    "end": 8911.831,
    "text": "Each of these pointers, this is all a time step at the first level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8912.631,
    "end": 8914.493,
    "text": "And so this is kind of local standard",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8915.171,
    "end": 8917.133,
    "text": " and a global deviation, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8919.394,
    "end": 8926.96,
    "text": "So this will be, we see there's a little ERP each time there's new stimulus presented, but there's not a major one that makes sense because it's the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8928.421,
    "end": 8930.522,
    "text": "And this is trial 10, by the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8931.043,
    "end": 8932.063,
    "text": "I should say this is trial 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8932.364,
    "end": 8939.849,
    "text": "So I have trial one versus, maybe I'll just contrast all the trial 10s because otherwise things get messy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8941.09,
    "end": 8942.051,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8943.072,
    "end": 8943.492,
    "text": "This is trial 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8944.844,
    "end": 8951.13,
    "text": " Um, and so this is trial 10 for local standard, um, global deviation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8951.25,
    "end": 8956.795,
    "text": "And so we see kind of no first level ERPs really, or no enhanced ERPs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8956.855,
    "end": 8962.56,
    "text": "They're all the same, but this last one, because this last or sixth ERP, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8962.66,
    "end": 8970.067,
    "text": "Because it disconfirmed a prediction, essentially, there is a enhancement",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8970.669,
    "end": 8996.729,
    "text": " in higher level beliefs when the model suddenly changes from thinking it was a high high low high high high low to a high high high high if that makes sense and then if you compare that second level erp to this one over here which is just local deviation global standard it's smaller that p300 there is smaller amplitude but at this first level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8997.642,
    "end": 9000.606,
    "text": " because it kind of confirmed that there was a deviation at this first level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9000.626,
    "end": 9004.631,
    "text": "And you see at this first level, there's this massive deviation response.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9007.595,
    "end": 9008.997,
    "text": "So is that all fairly clear?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9009.017,
    "end": 9010.639,
    "text": "Because I think that's just about all I have to show.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9010.659,
    "end": 9013.382,
    "text": "I do think this stuff is really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9013.402,
    "end": 9014.504,
    "text": "It's kind of nice to chat about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9016.983,
    "end": 9039.242,
    "text": " So just to – I want to be very clear that I am understanding with the event-related potentials that you're showing that you superimposed and you got, based off your hierarchical model, you could then superimpose those ERPs, which are related to gradient descent on the variational free energy, which is related –",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9040.177,
    "end": 9059.896,
    "text": " to dopamine expression and as we showed uh way at the beginning of this video um that relationship between membrane voltage and expected firing rate mean population firing rate and we're taking all of these things together to provide the superimposed traces of the local fuel potentials at any given instant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9060.937,
    "end": 9071.005,
    "text": " And we're showing how this oddball paradigm could play out conceivably by, you know, with a simulated version of this model, how it could be realized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9071.045,
    "end": 9071.325,
    "text": "Is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9071.906,
    "end": 9072.606,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9072.626,
    "end": 9078.551,
    "text": "The only thing I would say is that these simulations have like nothing to do with the dopamine stuff.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9078.571,
    "end": 9080.132,
    "text": "Yeah, I was about to say the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9081.213,
    "end": 9084.436,
    "text": "With the exception of like dopamine having to do with how you choose policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9085.205,
    "end": 9100.158,
    "text": " So if we just like blew up the dopamine receptors or sorry, this like in silico dopamine and just made it like we could make the agent behave totally randomly or we could make it behave in a super precise, impulsive way or something, something along those lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9100.859,
    "end": 9101.78,
    "text": "Sorry, I shouldn't have said that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9102.28,
    "end": 9106.444,
    "text": "Impulsivity is a bit complicated, but we could make that happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9107.057,
    "end": 9115.58,
    "text": " agent behave in a totally random way and choose random actions, which would again have effects on the sensations that the agent would receive, so it would indirectly affect the ERPs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9116.121,
    "end": 9121.683,
    "text": "But there's nothing about that gamma term that would affect state prediction error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9121.703,
    "end": 9123.844,
    "text": "You could just turn off gamma, and it wouldn't make any difference to this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9123.864,
    "end": 9124.044,
    "text": "Exactly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9132.752,
    "end": 9147.301,
    "text": " So then, just so that I'm getting it correct, the more important thing then would be the membrane voltage, which is related to the free energy minimization and your schematic diagram of those excitatory, imputative, and inhibitory connections that you're realizing in this model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9147.821,
    "end": 9148.222,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9148.562,
    "end": 9151.524,
    "text": "Yeah, it's just about rate of change and posteriors over states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9152.324,
    "end": 9153.325,
    "text": "Okay, totally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9153.485,
    "end": 9155.346,
    "text": "So I'm just going to stop sharing my screen at this point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9156.787,
    "end": 9159.608,
    "text": "So hopefully you guys can no longer see my screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9159.929,
    "end": 9161.63,
    "text": "Nope, we're back to just seeing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9163.042,
    "end": 9163.904,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9164.205,
    "end": 9168.016,
    "text": "Wow, what a fun and interesting session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9168.638,
    "end": 9168.858,
    "text": "Let's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9170.848,
    "end": 9185.115,
    "text": " First, just really appreciate everyone for coming on because these are extremely didactic and it's really just something else to be walking through the code and seeing how many degrees of freedom there could be and also how real it can be when we actually specify it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9185.535,
    "end": 9195.78,
    "text": "So any closing thoughts or and what can people look forward to for part four, which is the final part before the semester begins for some of us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9198.157,
    "end": 9206.277,
    "text": " Yeah, no, I mean, like I said, I mean, the last one is just the last section of the tutorial, which is kind of where we're building to this whole time, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9206.906,
    "end": 9210.569,
    "text": " is how to actually apply this stuff to empirical data and do real experiments.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9211.289,
    "end": 9212.831,
    "text": "Can I ask a question on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9213.051,
    "end": 9222.098,
    "text": "Someone asks, can we use this tutorial to construct a generative model of metacognitive control of attention or meta-awareness, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9222.218,
    "end": 9225.8,
    "text": "modeling task-free conditions, say, while doing meditation, for example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9226.081,
    "end": 9227.602,
    "text": "So we talked a lot about task modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9227.742,
    "end": 9229.263,
    "text": "How does this generalize?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9229.924,
    "end": 9235.788,
    "text": "Yeah, so I mean, you kind of have to, so I mean, you know, the first question is just how do you make that, you know, like,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9236.311,
    "end": 9237.211,
    "text": " really concrete.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9237.692,
    "end": 9237.912,
    "text": "Right.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9238.492,
    "end": 9254.379,
    "text": "So, I mean, there's there's very easy ways, you know, like I've published a couple of papers and so has, you know, several other people doing something like cognitive actions, selecting cognitive policies as opposed to behavioral policies.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9255.219,
    "end": 9264.163,
    "text": "And these are things like where you selectively choose what to pay attention to, you know, or selectively choosing, you know, what to kind of hold in working memory.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9265.041,
    "end": 9276.066,
    "text": " or things along these lines that don't involve any kind of overt observable behavior, but involve selecting cognitive, fully internal actions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9276.126,
    "end": 9280.308,
    "text": "Something like selecting ways of manipulating lower level representations, things like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9281.508,
    "end": 9290.972,
    "text": "So that's certainly possible, but what you would need to do then is say, okay, what does a meditative action look like?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9291.212,
    "end": 9292.653,
    "text": "It could be something like, for instance,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9293.211,
    "end": 9320.13,
    "text": " making a, like, choosing a policy at a higher level that say, like, for instance, like, really, really, really reduces the precision of, like, an A matrix or something, right, if you wanted to completely, you know, like, cease to attend to anything, like, in the external world, you know, for example, you know, or, for instance, maybe the opposite, right, maybe, like, mindfulness, you know, has to do with actually paying really, really precise attention to the present, but, like,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9320.546,
    "end": 9323.667,
    "text": " making your transition matrices super imprecise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9324.327,
    "end": 9328.809,
    "text": "So essentially it's all about the present and you're not thinking about anything in the past or the future.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9328.829,
    "end": 9341.134,
    "text": "I mean, I could think of lots of different ways you might do something like that, but to really make it, you have to turn it in to something task-ish, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9341.194,
    "end": 9348.717,
    "text": "You have to define actions, even if they're really internal actions, you have to define the way they relate to perception, the way they manipulate the processing perception.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9350.735,
    "end": 9360.841,
    "text": " I guess you have to ultimately boil it down to something really concrete with an exact quantitative structure, but all the resources are certainly there to do it if you're creative enough to come up with a regenerative model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9361.722,
    "end": 9363.583,
    "text": "I have two things to add to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9363.843,
    "end": 9367.625,
    "text": "First is that I think there's a really cool early preprint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9367.745,
    "end": 9368.946,
    "text": "I'm not sure if it's been published anywhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9368.986,
    "end": 9372.007,
    "text": "It's called Towards a Formal Neurophenomenology of Metacognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9373.628,
    "end": 9375.97,
    "text": "Lars Sandervald-Smith is first author.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9376.03,
    "end": 9377.971,
    "text": "Maxwell Ramstead, who I think has been on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9378.407,
    "end": 9379.608,
    "text": " the podcast before, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9379.708,
    "end": 9381.489,
    "text": "He's the senior author.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9381.97,
    "end": 9387.293,
    "text": "They actually do try and model metacognition and specifically in a meditation context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9388.534,
    "end": 9393.158,
    "text": "I would just say one thing that I am personally skeptical about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9393.178,
    "end": 9398.782,
    "text": "I encourage everyone to do this kind of work, but this probably highlights my biases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9398.822,
    "end": 9405.827,
    "text": "But I think if something is hard to study empirically, that is to say it's very hard to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9406.644,
    "end": 9418.61,
    "text": " study in terms of neuroimaging, for example, and creating an event-related design where you can get precise time locking between neuronal responses and cognitive processes, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9419.25,
    "end": 9428.234,
    "text": "If something's hard to do that in an experimental context, it's going to be extremely difficult, if not more difficult, to do it meaningfully in terms of a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9428.514,
    "end": 9434.437,
    "text": "Because I think these generative models are only meaningful and helpful to the extent to, and other people are free to disagree with this,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9435.319,
    "end": 9438.88,
    "text": " This is just very much me going off on my own kind of tangent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9439.16,
    "end": 9441.74,
    "text": "That's just to say it's almost like you need to get more rigorous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9441.86,
    "end": 9445.001,
    "text": "It's no longer just like, well, this one thing happened with this one setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9445.181,
    "end": 9452.942,
    "text": "It actually demands a higher standard, but things that it lets above that higher standard are very cross-referenceable, very interoperable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9453.322,
    "end": 9455.402,
    "text": "So very nice statement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9456.263,
    "end": 9464.584,
    "text": "Yeah, I mean, I should say that, like, I guess you can think about these models as, you know, beyond the kind of more specific applications we've been talking about,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9465.131,
    "end": 9469.274,
    "text": " is doing kind of two, you know, doing like a couple of like broader things.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9469.975,
    "end": 9477.561,
    "text": "One is, is that you can use them for kind of theory, making theories precise, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9477.581,
    "end": 9490.331,
    "text": "So for example, like, um, so a lot of my past work, like I focus a lot on like, like theories of like emotion and emotional awareness and how that relates to relates to like, you know, psychiatric, you know, like clinical context and things like that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9491.051,
    "end": 9493.293,
    "text": "Um, but you know, prior to doing",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9493.843,
    "end": 9500.606,
    "text": " a lot of this modeling stuff, it kind of comes out of these like fairly hand wavy conceptual review papers, right?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9500.626,
    "end": 9509.27,
    "text": "Where it's like boxes and arrows and, you know, like it's, and sometimes in those cases, it's hard to go from kind of the theoretical boxes and arrows.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9510.531,
    "end": 9517.013,
    "text": "You know, even if you assign say neural regions or systems to them, it's hard to make those things really precise.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9517.694,
    "end": 9520.315,
    "text": "So that like, it's very clear that one,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9520.871,
    "end": 9548.347,
    "text": " empirical result would actually confirm or disconfirm it um whereas so you can take you know like a kind of conceptual you know somewhat hand wavy model like that and then turn it into an exact generative model um which can just make your theory really precise you know so so like one day you know it'd be really cool if instead of like review papers it's like review paper plus actually here's a model you know like a precise quantitative model that we think comes out of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9549.039,
    "end": 9556.522,
    "text": " unifying all the results as opposed to less precise theories.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 9556.602,
    "end": 9560.784,
    "text": "One other nice thing you can do with these models is just like have a total proof of principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9560.864,
    "end": 9570.948,
    "text": "Someone might make a radical claim like there is no way that you can conceivably do X. And then the response to that is here is a model that does X. And that's useful, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9571.309,
    "end": 9574.51,
    "text": "It might even not be an empirically tractable example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9574.55,
    "end": 9576.871,
    "text": "Like I think the dark room problem is an example of this, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9577.352,
    "end": 9581.935,
    "text": " Like you could say, there is no possible way of designing an active inference model that will escape the dark room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9582.556,
    "end": 9587.159,
    "text": "And then you can build a model and say, here is an example of an active inference agent escaping the dark room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9587.179,
    "end": 9590.402,
    "text": "That would be a really shitty, boring experiment to run.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9590.422,
    "end": 9594.084,
    "text": "I hope no one does it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 9594.104,
    "end": 9595.606,
    "text": "It's an argument by construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9596.306,
    "end": 9619.676,
    "text": " but especially when people have these edge cases or perceived to be edge cases, but that's how philosophy is at the fringe and at the border and expanding and critiquing and improving all these different metaphors that have come up in discussing like 14 was what is the dialogue between science and the modeling and the actual quantitative components of it and the empirical work and philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9619.736,
    "end": 9623.538,
    "text": "So it's really just, we're coming at that same question from a little bit of a different angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9623.878,
    "end": 9625.139,
    "text": "So I think this has been a great,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9625.899,
    "end": 9653.729,
    "text": " length and a great session ryan christopher max really appreciate all of you for coming on so that's going to be it for today but it will be our final session next friday um at the same time at 9 00 a.m pacific on february 5th is going to be number four so thanks everyone for watching live and replay thanks again to authors and participants so peace out everyone thank you bye",
    "speaker": "SPEAKER_00"
  }
]