[
  {
    "start": 3.372,
    "end": 4.033,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.833,
    "end": 12.781,
    "text": "It's June 13th, 23, and we're in cohort three discussing chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.123,
    "end": 16.745,
    "text": "So we'll head over to the chapter six page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.187,
    "end": 33.362,
    "text": "And before we look at some of the specific questions and like pick ones that are interesting and so on, does anyone just want to give any overall thoughts or questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.87,
    "end": 56.23,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.232,
    "end": 62.699,
    "text": "Well, of course, just right in the chat, raise your hand if you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.643,
    "end": 79.221,
    "text": "We can look to some of the previously addressed or at least asked questions and get some more perspectives and improve some of the discourse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.202,
    "end": 84.728,
    "text": "Does anybody have an alternative preference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.748,
    "end": 84.848,
    "text": "Nope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.857,
    "end": 86.137,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.838,
    "end": 99.571,
    "text": "So also definitely please vote with an interesting button because once we get above like 10 or some number of votes, then we'll make a short video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.851,
    "end": 104.075,
    "text": "So we'll kind of be upvoting and then seeking to improve those sections most.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.837,
    "end": 106.157,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.039,
    "end": 113.164,
    "text": "Why is modeling of the generative process a necessary step for building an active inference model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.81,
    "end": 117.913,
    "text": " Who wants to give a first thought on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.109,
    "end": 133.876,
    "text": "That we can review, but first just yeah, Ali and then anyone else just why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.298,
    "end": 138.122,
    "text": "Why are we talking about modeling the generative process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.427,
    "end": 168.852,
    "text": " Yeah, I think as we talked about the distinction between generative model and generative process before, well, at least according to the previous active inference framework, generative process is basically what's, I mean, it refers to the latent state of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.253,
    "end": 172.257,
    "text": " observary data we get from the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.138,
    "end": 184.433,
    "text": "In other words, what causes those data, in this case, is put into a kind of probabilistic model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 185.594,
    "end": 190.941,
    "text": "So on the other hand, generative model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 191.562,
    "end": 207.182,
    "text": " I mean, the aim of generative model is to provide a kind of mechanism to track those generative process as close as it can, or at least based on the situation of interest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 207.202,
    "end": 211.447,
    "text": "So that's one distinction between generative model and generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 211.808,
    "end": 214.431,
    "text": "But on the other hand,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 214.85,
    "end": 234.816,
    "text": " Well, recently I got to the understanding that it's not so straightforward to separate generative model from generative process because in some situations we might never know what generative process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 235.876,
    "end": 240.482,
    "text": " is, I mean, what actually constitutes generative process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 240.623,
    "end": 265.157,
    "text": "And the only thing we can concentrate or we can at least confidently focus on is to model the generative model based on some of the assumptions about how the environment will behave in the future or at least",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 265.458,
    "end": 272.305,
    "text": " based on some of our knowledge about the overall mechanism of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 274.388,
    "end": 281.976,
    "text": "But in some simple situations, it might be possible to differentiate between the two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.738,
    "end": 284.098,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.158,
    "end": 284.619,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.659,
    "end": 291.246,
    "text": "Anyone else have any related thought or question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.475,
    "end": 296.724,
    "text": " about the role of building a generative process and a generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.829,
    "end": 301.053,
    "text": "And then we'll look at some of the previous responses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.457,
    "end": 312.458,
    "text": "And then we'll move on to another question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.716,
    "end": 319.403,
    "text": " I'll bring in one paper, path integrals, particular kinds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.443,
    "end": 326.915,
    "text": "And of course, remember that you can always just click on the icon of the institute on the right, and you'll jump to where we are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.078,
    "end": 333.265,
    "text": "So in this paper, which we often look back towards,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 335.017,
    "end": 358.257,
    "text": " we see this taxonomy of different kinds of things ranging from the simplest inert systems through active systems, but perhaps simple active systems like a metronome on through sophisticated or strange systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.709,
    "end": 368.739,
    "text": " which have hidden internal states that are doing like counterfactual kind of world modeling, self in world modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.62,
    "end": 383.974,
    "text": "And so in chapter six, we're talking about whether you're trying to set up a simple inert system or a simple active system, or you're on the path towards making more complex cognitive models,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.325,
    "end": 388.971,
    "text": " there's gonna be certain steps that are outlined in the recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.473,
    "end": 407.935,
    "text": "So that is like the continuity of active inference type modeling of the particular partition, splitting things into internal, external, and blanket states, and then further differentiating the blanket into the incoming sensory states and the outgoing action states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.437,
    "end": 412.341,
    "text": "Well, calling them sense and action is of course,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.456,
    "end": 416.642,
    "text": " conditioned upon choosing one side of that blanket to be internal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.483,
    "end": 420.066,
    "text": "And that's kind of like the cognitive system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.867,
    "end": 429.899,
    "text": "And so we call the cognitive system of interest in terms of its particular states, the internal and the blanket states, that is like the thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.702,
    "end": 433.544,
    "text": "And that is the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.148,
    "end": 436.388,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.085,
    "end": 463.354,
    "text": " yeah and one other related thing is i mean this typology is actually based on a three-level classification namely at one hand we have the distinction between active and inert particles which do and do not have active states and then on the other level we have distinction with between dissipative and conservative particles which are and are not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.334,
    "end": 465.297,
    "text": " subject to random fluctuations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 465.718,
    "end": 475.475,
    "text": "And finally, the ordinary and strange particles which have active states, which do have and do not have active states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 476.016,
    "end": 483.148,
    "text": "And one other point is it's interesting that in some recent literature, especially the one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.449,
    "end": 493.916,
    "text": " the white paper published about four months ago, Designing Ecosystems of Intelligence from First Principles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 494.798,
    "end": 497.425,
    "text": "And this recent paper",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 497.607,
    "end": 517.236,
    "text": " The inner screen model of consciousness, the term generative process and never appear even once in the entire paper so basically they they began began to use a generative model interchangeably with generative process in some sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 518.465,
    "end": 543.544,
    "text": " yes um this is this is something that we're going to be asking about in guest stream 45 in six days because we noticed that in this presentation that Maxwell had generative model covering the entire particular partition rather than the way that it was shown",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.908,
    "end": 566.038,
    "text": " in um the figures of the textbook where we had the generative model with internal blanket states essentially being partitioned from the generative process which is the process which actually gives rise to the observations so we can think of it as kind of like some uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.98,
    "end": 590.862,
    "text": " uh dialectical usage in the dialect sense of the active ontology so evolution and in use of what people are referring to um that's how it goes when things are changing fast but we'll find out in a few days some more takes on this um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.933,
    "end": 606.288,
    "text": " Active Inference Agent employs a generative model as its model of the external world and uses the generative model to perform inferences about perceptual input to make decisions about actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.871,
    "end": 611.657,
    "text": "The external world or the generative process is complex and unknowable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.921,
    "end": 615.904,
    "text": "Generative models may or may not be able to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.639,
    "end": 625.271,
    "text": " but learning and also action selection puts the generative model in better alignment with the world's generative process, whatever it might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.992,
    "end": 627.574,
    "text": "Two ways to minimize free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.935,
    "end": 630.258,
    "text": "Change your mind through perception and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.979,
    "end": 632.381,
    "text": "Change the world through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.287,
    "end": 638.951,
    "text": "And there's some more discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.092,
    "end": 645.942,
    "text": "Any other, from anyone, a comment or a question about the generative process and the generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.495,
    "end": 650.622,
    "text": " And kind of where we're at in chapter six, or we'll move on to the next question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.691,
    "end": 655.932,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.952,
    "end": 656.272,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.292,
    "end": 668.494,
    "text": "And also please use the upvote so that we can just figure out which questions we want to make improvements and short videos around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.276,
    "end": 669.516,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.34,
    "end": 671.842,
    "text": " Next question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.583,
    "end": 676.708,
    "text": "Please just raise your hand if you have a different question or put it in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.728,
    "end": 680.693,
    "text": "So this is kind of a core question about chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.534,
    "end": 685.999,
    "text": "What are the four steps in the recipe to construct an active inference model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.903,
    "end": 693.428,
    "text": "So from the very first sentence of chapter six,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.91,
    "end": 717.61,
    "text": " what the chapter is aiming to provide is this four-step recipe to construct an active inference model now it doesn't have to be strictly linearly followed they're more like four considerations or four areas of questioning more so than like you must take on one two three four in this order um but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.256,
    "end": 723.92,
    "text": " Let's look at the active inference model recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.161,
    "end": 728.806,
    "text": "We made just a sub page because this is such a central topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.707,
    "end": 741.822,
    "text": "I mean, all of our expectations and preferences slash hopes and dreams about applying active inference, using active inference modeling for some system or phenomena of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.883,
    "end": 745.927,
    "text": "This is kind of what it comes down to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.567,
    "end": 749.571,
    "text": "Again, this isn't the only or the total",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.26,
    "end": 768.42,
    "text": " protocol for modeling but chapter six is the transition point in the book where the first five chapters set us up to understand epistemically what active inference models were about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.4,
    "end": 771.989,
    "text": " the low road and the high road in chapters two and three, how we approach active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.731,
    "end": 777.122,
    "text": "Chapter four, the generative model itself and some of the mathematics and the formalisms of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.603,
    "end": 782.635,
    "text": "And then chapter five, exploring some applications in mammalian neurophysiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.197,
    "end": 785.262,
    "text": "And now chapter six is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.001,
    "end": 812.177,
    "text": " our system of interest whether it's another aspect of mammalian neurophysiology or whether it's any other of the many many situations that we're interested in modeling this is the model recipe as laid out by the authors here so does anyone want to give a thought or a question or just overview on the four considerations that that are in chapter six for the model recipe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.26,
    "end": 852.812,
    "text": " yeah Ali and then anyone else yeah just one thing uh that I think we've also talked about before is to keep in mind that it's not absolutely necessary uh to follow those steps uh strictly in a sequential order so it would be possible to uh to address them in at least uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.792,
    "end": 877.467,
    "text": " in an asynchronous way or even in some cases even change the order of the steps so it's just a general framework to follow the recipe it's not I think needs to be strictly observed yeah maybe it's more like making four dishes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 878.864,
    "end": 880.487,
    "text": " But let's look at what they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.408,
    "end": 885.174,
    "text": "So first question, which system are we modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.416,
    "end": 892.105,
    "text": "And this is analogous to the identification of the system of interest in systems engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.147,
    "end": 896.232,
    "text": "And there are situations where this is trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.106,
    "end": 917.865,
    "text": " or where the teacher tells you which system is being modeled but there's also situations where it's non-trivial because of course everything is attached to everything in the world and so making these distinctions about the spatial and the temporal and the causal boundaries",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.845,
    "end": 941.794,
    "text": " of the system that we're actually going to choose to model such that it's at some base optimal trade-off point between being tractable and understandable implementable all of these different features that's kind of an iterated process and that's not one that's just simply written on the world as it is so we just get to show up and find out like this is where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.774,
    "end": 950.145,
    "text": " We have to take an active approach to modeling to even determine some of these processes through inquiry, but what which system are we modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.808,
    "end": 961.099,
    "text": "The second question is what is the most appropriate form for the generative model so let's look at where they describe this in a bit more detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.686,
    "end": 972.698,
    "text": " This is the decision, whether it is appropriate to think of a process in terms of categorical or discrete inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.701,
    "end": 983.796,
    "text": "or continuous inferences motivating the choice between discrete or continuous time implementations or hybrid of active inference so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.666,
    "end": 1011.589,
    "text": " just to recall figure 4.3 is where we see a juxtaposition of the discrete time active inference generative model on the top and the continuous time active inference generative model on the bottom they're being laid out this way to highlight their structural similarities like they have this kind of downward facing e and then the upstairs with action in both cases",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.67,
    "end": 1036.277,
    "text": " but there are some differences between the discrete time and the continuous time formulation we're not going to go into too much more uh detail on their differences right now but we can discuss if people want and this is going to get explored in a lot more detail in chapters seven and eight the coming two chapters which are explicitly about discrete and continuous time generative models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.379,
    "end": 1042.363,
    "text": " And you can also make hybrid implementations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.383,
    "end": 1054.961,
    "text": "So the most common hybrid implementation is in the folk psychological setting where decision making is discrete at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.381,
    "end": 1060.088,
    "text": "Like, should I reach for the orange or the apple?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.675,
    "end": 1070.249,
    "text": " And then at the sensory motor or lower, smaller or faster level, you have continuous time model, like a motor reflex model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.09,
    "end": 1085.652,
    "text": "And then the motor reflex model, the attractor of where it's going to be expecting to find itself, which is where it reaches towards, is being imposed from the top down by that categorical decision-making model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.473,
    "end": 1089.838,
    "text": "So hybrid models are absolutely possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.139,
    "end": 1100.698,
    "text": " And one setting that they're used in is systems that have discrete decision-making processes that interface with continuous sensory motor activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.024,
    "end": 1111.658,
    "text": "Then we need to select the most appropriate hierarchical depth, motivating the choice between shallow versus deep models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.009,
    "end": 1119.838,
    "text": " So how much spatial temporal or causal depth is the model biting off?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.839,
    "end": 1126.906,
    "text": "Are you trying to model weather for one season or for one year or for 20 years or for a million years?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.227,
    "end": 1135.696,
    "text": "And then how is that scope going to be compartmentalized into the model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.216,
    "end": 1139.4,
    "text": "So let's just say we wanted to do an 100-year predictive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.106,
    "end": 1149.496,
    "text": " One approach would be one tick of the model, one time step in the discrete time model is a hundred years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.137,
    "end": 1155.503,
    "text": "And we fit all the parameters so that they are like what's accurate after a hundred years go by.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.564,
    "end": 1159.988,
    "text": "But then we wouldn't be able to necessarily make a prediction at 50 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.529,
    "end": 1161.93,
    "text": "So, okay, what else could we do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.491,
    "end": 1168.257,
    "text": "We could have the tick be one year and have this model go a hundred into the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.536,
    "end": 1178.146,
    "text": " Or we could have a nested model where we have decades where the tick goes by one year at a time and then 10 decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.226,
    "end": 1182.491,
    "text": "And so at the higher nested level, it's like the transition between decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.973,
    "end": 1189.96,
    "text": "And so these are all structural variants of a model that can do prediction of 100 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.0,
    "end": 1191.322,
    "text": "Or maybe you want every single day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.863,
    "end": 1194.666,
    "text": "Maybe you want a transition matrix amongst seconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.865,
    "end": 1207.58,
    "text": " But each of these are going to have trade-offs in terms of the computational requirements of the model, whether you're going to be able to calibrate it with data, the amount of parameters that you're going to be creating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.841,
    "end": 1222.037,
    "text": "And so this is the modeler's quest and art and science to find the right models for a given situation because all models are wrong, some are useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.532,
    "end": 1236.669,
    "text": " And finally, we need to consider whether it's necessary to endow the generative model with temporal depth, kind of previously mentioned, and the ability to predict action contingent observations to support planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.011,
    "end": 1251.67,
    "text": "That's called planning as inference, and it is using the expected free energy, where if you have different actions that can be taken, different policies, which is kind of like an action over the given time horizon, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.274,
    "end": 1279.783,
    "text": " then planning as inference means predicting the consequences of those actions and then doing a type of inference to determine which path of action to be taken after determining the form for the generative model there are the questions of setting up the generative model and setting up the generative process so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.489,
    "end": 1302.717,
    "text": " the kernel of active inference if we see it in figure 4.3 again the discrete time or the continuous time this doesn't have attention metacognition um learning of preferences counterfactual world modeling what would happen if they did that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1303.169,
    "end": 1308.855,
    "text": " There's a lot of sophisticated cognitive phenomena that are not found in the base model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.875,
    "end": 1311.978,
    "text": "In fact, the base model doesn't even have learning at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.979,
    "end": 1321.127,
    "text": "We're going to see in the coming chapters how this can be straightforwardly elaborated to include learning on any parameter shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.967,
    "end": 1324.45,
    "text": "But this by itself does not include learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.791,
    "end": 1332.838,
    "text": "And so they're highlighting that there's a lot of decisions to be made",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.173,
    "end": 1362.808,
    "text": " in terms of setting the priors and which aspects are going to be fixed and what aspects are going to be learnable and remember that the models are maps not territories so just because something is learnable in principle or in practice in the real world doesn't necessarily mean that the model is going to be simply mimicking that and vice versa so again these are just some steps to consider",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.058,
    "end": 1389.454,
    "text": " essentially setting up the generative model and the generative process the the type of thing that we're modeling the cognitive entity and their environment and they say that these four steps in most cases suffice to design active inference model once completed the behavior of the system is determined by the standard schemes of active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.155,
    "end": 1417.888,
    "text": " this is a huge advantage of working with active inference cognitive modeling is once you get the model set up and entered into whatever implementation approach you're using spm or pi mdp or rx infer etc then the methods of parameterizing it fine-tuning it fitting that model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.797,
    "end": 1421.621,
    "text": " are very generic and straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.343,
    "end": 1435.781,
    "text": "So it's not like you kind of slap together how you're thinking about the system, and then you're gonna spend all of this engineering work on making the optimization tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.822,
    "end": 1437.603,
    "text": "It's the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.685,
    "end": 1444.753,
    "text": "A lot of the work goes into the structural understanding of the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.999,
    "end": 1457.858,
    "text": " Because once you have your model entered in to PyMDP, for example, then standard routines are used to fit the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.474,
    "end": 1469.357,
    "text": "Ali, then anyone else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.582,
    "end": 1482.379,
    "text": " I yeah i'm wondering how I mean to what extent this recipe is applicable when it comes to modeling the collective intelligence, which is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.861,
    "end": 1499.125,
    "text": "I mean the current interest of active inference research largely and, in particular, I believe, based on the stages of development for active inference outlined in designing ecosystems white paper currently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1499.324,
    "end": 1522.581,
    "text": " we're on the systemic intelligence level of modeling, and we're aiming toward modeling or toward developing an efficient way to model sentient intelligence, but we're not there yet on the problem of modeling sophisticated intelligence and sympathetic and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.152,
    "end": 1525.336,
    "text": " ultimately shared intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1525.937,
    "end": 1538.459,
    "text": "So it's interesting to see how those four steps can be applied when we finally get into those stages of development of active inference agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.186,
    "end": 1546.213,
    "text": "Yes, this is from the paper from 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.373,
    "end": 1547.455,
    "text": "Olivier?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.464,
    "end": 1559.438,
    "text": " Yeah, so I suppose that's, you know, the best way to understand these four different points is to look at how, you know, current examples of papers have done them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.34,
    "end": 1570.371,
    "text": "So take, you know, already implemented models and identify, you know, step one, two, three and four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.638,
    "end": 1580.651,
    "text": " And do we have in the Active Entrance textbook groups some kind of list of example models to do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.392,
    "end": 1582.193,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.934,
    "end": 1583.875,
    "text": "Yes, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.935,
    "end": 1585.617,
    "text": "So it's a great suggestion, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.677,
    "end": 1590.283,
    "text": "I agree that showing these stages being carried out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.495,
    "end": 1601.559,
    "text": " We can hope becomes a practice in the active inference ecosystem, because it would connect a lot of the dots for people replicating the analyses and for learners.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.66,
    "end": 1605.589,
    "text": "But here's what we can look at now in the code page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.772,
    "end": 1616.429,
    "text": " We have several dozen different languages, different implementations of active inference drawn from a variety of papers, pretty much the GitHub pulled out where we can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.489,
    "end": 1622.498,
    "text": "Now, not all of these are heavily documented or pedagogically oriented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.63,
    "end": 1635.196,
    "text": " So sometimes there's some forensic work to be done with like understanding because and also a lot of this happens outside of the context of shared epistemic niches and shared education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.777,
    "end": 1639.765,
    "text": "So the variables are going to have different names and the implementations are going to be quite different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.946,
    "end": 1642.09,
    "text": "These are not necessarily created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.07,
    "end": 1646.355,
    "text": " after reading chapter six, especially if they, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.435,
    "end": 1650.58,
    "text": "But it certainly is a retroactive approach that can describe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.721,
    "end": 1660.391,
    "text": "And then I think one of the most clearly unpacked and didactic examples that we can look at is Model Stream 7.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.654,
    "end": 1671.925,
    "text": "And in Model Stream 7.2, in the video description is the notebook of this presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.272,
    "end": 1680.446,
    "text": " And so it does in a much more pedagogical way and in an executable way, it runs perfectly as is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.487,
    "end": 1686.218,
    "text": "You can see how is B getting set up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.451,
    "end": 1692.444,
    "text": " So again, this isn't exactly aligned with the four stages of the recipe, but like we said, those don't have to happen in that order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.764,
    "end": 1695.41,
    "text": "But this is like, these are the variables that you need to set up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.272,
    "end": 1705.371,
    "text": "A, B, C, D, E. And then at the bottom, you see the routines, the run active inference loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.975,
    "end": 1718.62,
    "text": " So if seeing it in a pseudocode way helps you understand the processual nature of the active inference loop better than the analytical equations, that's definitely a good way to learn and study this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.386,
    "end": 1722.708,
    "text": "Okay, yeah, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.829,
    "end": 1725.013,
    "text": "Any more that we can say on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.925,
    "end": 1731.611,
    "text": " One other resource I'll link in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.092,
    "end": 1736.201,
    "text": "This is to the Active Blockference CODA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.461,
    "end": 1738.125,
    "text": "This is just another project at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.726,
    "end": 1748.487,
    "text": "So here we've kind of expanded on the recipe to include more up front and along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.293,
    "end": 1753.398,
    "text": " So more of like the structural understanding of the system and why the model is being made.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.438,
    "end": 1765.553,
    "text": "Then we kind of include the steps of chapter six, but also take more of a life cycle perspective on the operations of these models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.835,
    "end": 1775.405,
    "text": "And then we have all these different settings where people have started to explore those kinds of modeling approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.425,
    "end": 1778.389,
    "text": "So I'll just link to this page also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.044,
    "end": 1808.005,
    "text": " in in the recipe okay let's go back to the questions so what are the four steps we just looked through them essentially they're they're a set of considerations that build the generative model the generative process so the cognitive thing and the environment the niche that's giving observations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.93,
    "end": 1832.068,
    "text": " four considerations that help us develop that from its kind of sketchiest outlines on through the determination of which variables are going to be like learnable or not which ones are discrete state space which ones are continuous state space Etc and then once we have that set up and entered into our implementation approach then all the routines are standard",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.382,
    "end": 1842.598,
    "text": " And there's always exciting developments with making those routines better at dealing with sophisticated planning and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.618,
    "end": 1857.685,
    "text": "So again, this is a big strength and a growing one for active inference that the work in understanding the system gets us to the point where it can be run generically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.901,
    "end": 1874.057,
    "text": " as opposed to just taking an ad hoc understanding of a system, which is like kind of a mistake, but one that flies by in many situations, and then confusing the engineering work with improving the computational aspects of the model with an understanding of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.92,
    "end": 1879.222,
    "text": "Okay, so that was this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.443,
    "end": 1884.988,
    "text": "Again, upvote the question so they rank higher, but I'm just gonna continue down from the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.251,
    "end": 1891.918,
    "text": " In figure 6.1, what do the unidirectional and bidirectional arrows mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.119,
    "end": 1896.483,
    "text": "So we see there are some connections between nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.264,
    "end": 1904.153,
    "text": "Nodes are random variables and edges represent causal influences, possible causal influences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.994,
    "end": 1909.379,
    "text": "Just because they're here doesn't mean that they're relevant in a given situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.28,
    "end": 1915.887,
    "text": "But this is kind of like the set of the possible connectivities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.795,
    "end": 1918.477,
    "text": " of the action perception loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.299,
    "end": 1930.009,
    "text": "So the blanket states are connected to each other possibly because they form that insulating set around the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.03,
    "end": 1940.22,
    "text": "So again, you can design a system where the API call comes in and then a second computer computes it and then a third computer emits it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.318,
    "end": 1947.055,
    "text": " So there doesn't have to be an edge between these two, but in principle it's allowable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.043,
    "end": 1958.513,
    "text": " we see this symmetry where again, an internal and external, that just depends which system we're focusing on, but there's a symmetry across here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.553,
    "end": 1971.167,
    "text": "And so you can kind of see it's like a rotated 180 degrees symmetry where sensory states don't have a backwards arrow from internal states and external states don't have a backwards arrow to active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.448,
    "end": 1977.754,
    "text": "However, external and sensory have bidirectionality and internal action have bidirectionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.495,
    "end": 1978.695,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.194,
    "end": 1999.931,
    "text": " The particle, that which is being partitioned off from the world, can have different sensory and active blanket states, blanket being the joint set of U and Y, and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.852,
    "end": 2007.338,
    "text": "And these arrows are just shaping out the space of the possible interactions amongst those variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.62,
    "end": 2010.1,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2014.248,
    "end": 2036.172,
    "text": " um in let's see guest stream number seven how particular is the physics of the free energy principle if people want to go into more detail on this question uh miguel aguilera and colleagues",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.557,
    "end": 2062.547,
    "text": " provided some technical analyses and basically asked under what topologies of the action perception loop does the free energy principle apply for example if we have like a simple around the clock model none of these backwards arrows do things still apply or if we have more or less connectivity in in principle what applies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.915,
    "end": 2072.408,
    "text": " And the short answer to this is, basically, it's always going to hold in some fashion, but it may or may not be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.649,
    "end": 2087.228,
    "text": "And the important constraint that we're really adhering to, the most important constraint, is across the interface, there's no telepathy and there's no telekinesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.65,
    "end": 2090.492,
    "text": "That doesn't mean internal states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.995,
    "end": 2095.841,
    "text": " can't track or phase lock onto external states with very sparse sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.522,
    "end": 2100.307,
    "text": "The point is they do so only through the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.008,
    "end": 2105.013,
    "text": "So you can't get information about hidden states except by sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.674,
    "end": 2107.056,
    "text": "That's no telepathy clause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.017,
    "end": 2115.467,
    "text": "And the no telekinesis clause is you can only influence external states through the active states of the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.633,
    "end": 2126.986,
    "text": " So the fact that there's no connection between internal and external states is really the most important constraint on the topology of perception and action and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.727,
    "end": 2135.957,
    "text": "And other than that, there's some technical discussions to be had about exactly which situations have bidirectional arrows and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.738,
    "end": 2138.28,
    "text": "And some of it is explored in 7.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.683,
    "end": 2141.944,
    "text": "Ali, and then anyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.645,
    "end": 2152.035,
    "text": " I just wanted to mention a couple of technical terms that have been used in the literature repeatedly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.055,
    "end": 2163.909,
    "text": "One is the autonomous states, which refers to the joint set of internal states and the activist states instead of the whole blanket state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2163.969,
    "end": 2170.176,
    "text": "So particle is the joint set of internal states and the whole blanket states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2170.156,
    "end": 2176.806,
    "text": " If we consider only the activist states among the blanket states, then that's been referred to autonomous states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.787,
    "end": 2185.819,
    "text": "And the other term is a sparse coupling, which exactly refers to that unidirectional arrow in this figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2185.839,
    "end": 2195.133,
    "text": "So very briefly, sparse coupling refers to the fact that things are defined by what they are not connected to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.193,
    "end": 2198.458,
    "text": "So if the whole",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2198.843,
    "end": 2208.797,
    "text": " diagram here would be connected, the whole states here would be connected through bidirectional arrows, then that wouldn't be a sparse coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2208.857,
    "end": 2215.506,
    "text": "So the reason this term is used is because of that unidirectionality in this figure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2217.97,
    "end": 2218.33,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.372,
    "end": 2228.665,
    "text": "And one important piece on the autonomous states, and this is kind of like a cool way to think about ACT-IN formally, but also informally,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.332,
    "end": 2233.336,
    "text": " Autonomous states, again, are just the internal and active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.037,
    "end": 2236.962,
    "text": "So these are the two ways that you can reduce your free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.463,
    "end": 2239.806,
    "text": "Change your mind, change the world through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.187,
    "end": 2242.29,
    "text": "Learning and perception, update internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.011,
    "end": 2245.434,
    "text": "Action, updating active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.416,
    "end": 2251.243,
    "text": "Our preferences, the C vector, are over sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.585,
    "end": 2258.854,
    "text": "So we say, I prefer to find myself at 37C, homeostatic body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.969,
    "end": 2277.579,
    "text": " And so because I prefer that, I'm going to seek policies that meander my way, even if it's one step backwards, two step forwards, to reduce my surprise, bound my surprise, reduce my expected free energy about finding myself at homeostatic body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.08,
    "end": 2285.432,
    "text": "So our preferences are over sensory states, but the two things that we can control, the autonomous states...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.003,
    "end": 2290.888,
    "text": " like all-knowing and all-powerful are the internal and active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.21,
    "end": 2296.895,
    "text": "And another way of saying that is you don't directly have your thumb on the scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.116,
    "end": 2314.153,
    "text": "We want to see a certain number on the scale, but all we want to be able to do, even in our maximal empowerment, would be perfect updating of learning and perception and perfect selection of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.353,
    "end": 2336.736,
    "text": " If you enable the model to also take control over its sensory incoming data, not the downstream processing of it, but the primary sensory data, then the model may, in pursuit of seeking its preferences, just simply modify the sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.218,
    "end": 2341.221,
    "text": "So if we'd like to see a sunset,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.302,
    "end": 2343.985,
    "text": " You know, we want to either learn, but we're not seeing one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.205,
    "end": 2353.093,
    "text": "You want to either learn that we actually don't prefer that, then all is good with the world, or make a plan to see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.254,
    "end": 2365.785,
    "text": "But if you can just turn on the VR in your mind and see it right there, you've kind of made a hollow satisficing of your preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.806,
    "end": 2370.55,
    "text": "And in the ecological evolutionary context, you're going to get swept off the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.048,
    "end": 2377.094,
    "text": " So the autonomous states are like what we would want to control under maximal empowerment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.755,
    "end": 2382.841,
    "text": "And they're the two avenues of reducing free energy, changing mind and changing the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.426,
    "end": 2386.746,
    "text": "Olivier?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.769,
    "end": 2391.572,
    "text": "Yeah, I mean, I'm not sure I got it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.933,
    "end": 2397.52,
    "text": "But you said the preference is put on the sensory state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2397.54,
    "end": 2397.88,
    "text": "Correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.741,
    "end": 2399.042,
    "text": "Correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.702,
    "end": 2401.064,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.084,
    "end": 2401.785,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.457,
    "end": 2422.153,
    "text": " is that um reflected in the mathematical uh expression of free energy oh absolutely it is not shown here this on the particular partition we don't see the c vector or preferences but um let's look at it in the equations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.601,
    "end": 2449.103,
    "text": " so here equation 2.6 on expected free energy and so in the top decomposition expected free energy g is a function that's evaluating policies so it's loading in our policy prior that's like our habits",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.095,
    "end": 2474.938,
    "text": " and then it's sharpening those policy priors into a policy posterior that then you can sample from or just select the best option from so let's just say that um two-thirds of the time I turn left that's my habit and then if we just passed the prior on policy through then action would be selected according to that ratio two-thirds of the time going to the left",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.032,
    "end": 2482.961,
    "text": " However, what expected free energy does is it sharpens the policy prior habit into policy posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.662,
    "end": 2493.755,
    "text": "In the top decomposition, we see one way of thinking about what contributes to the expected free energy for a given policy concern or option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.576,
    "end": 2499.722,
    "text": "And that's thinking about it in terms of the information gain and the pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.563,
    "end": 2501.925,
    "text": "So first, the information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.586,
    "end": 2505.87,
    "text": "Here, we see that there's a KL divergence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.34,
    "end": 2525.412,
    "text": " between hidden states through time, X tilde, pi is on both sides, and here there's a Y. So if the Y, the expected sensory information under that policy, if it didn't give us any information, it's not expected to give us information, then the KL divergence is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.965,
    "end": 2549.627,
    "text": " no information is expected to be gained from that course of action however if the policy does have a sensory observations that would lead us to learn then epistemic gain is non-zero here we have pragmatic value and this is basically how surprised are you about the sensory data given your preference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.67,
    "end": 2565.82,
    "text": " And so if your preference is 37 and it's like a bowl around 37, then the highest pragmatic value policy would be the least surprising, meaning that the ball would be right at the bottom of the bowl at 37.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.86,
    "end": 2570.569,
    "text": "So just to contrast with reward learning, reinforcement learning,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.832,
    "end": 2578.924,
    "text": " in reward and reinforcement learning, you have this reward function that's like 37 is the most rewarding body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.285,
    "end": 2582.29,
    "text": "So I'm going to try to find my way up to the most rewarding point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.773,
    "end": 2585.275,
    "text": "We take an opposite approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.936,
    "end": 2595.713,
    "text": "We say, I expect and prefer to be at 37 C. That's what I'd be least surprised by if my thermoreceptors were at 37.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.688,
    "end": 2601.798,
    "text": " That's why expectations and preferences are kind of used together in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2601.838,
    "end": 2611.799,
    "text": "And then policies are selected that are able to contribute to pragmatic value and information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.74,
    "end": 2617.009,
    "text": "And during the modeling process, you see that there's some fine tuning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.158,
    "end": 2643.385,
    "text": " needed to balance these two drives and that's actually explored in this notebook like if you set the preference for getting sugar to 1 million to one then it'll never seek information it's ready to risk it for the chance of winning a million but if the pragmatic value is um very small then the information gain term dominates and another way that that is shown in a figure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.934,
    "end": 2665.575,
    "text": " is in figure 2.6 where we have expected free energy just as shown now here the pragmatic value term is on the left but it's the same equation yeah and so if only pragmatic value matters so it's a fully observable there's nothing epistemic to gains like a chess board then you get expected utility Theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.395,
    "end": 2682.416,
    "text": " In contrast, when there's no pragmatic value on the table, so all outcomes are equally pragmatically valuable, then you only have two, three, four, five, in which case you're having information driving decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.219,
    "end": 2684.319,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2684.339,
    "end": 2685.621,
    "text": "But both can be on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.362,
    "end": 2693.131,
    "text": "And that is how active inference in a first principles way is negotiating the explore-exploit dilemma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.356,
    "end": 2696.456,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.476,
    "end": 2696.676,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.365,
    "end": 2698.228,
    "text": " Ali, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.819,
    "end": 2707.324,
    "text": "And also this kind of information seeking or preference seeking is what referred to as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.692,
    "end": 2737.243,
    "text": " curiosity or rather artificial curiosity in the literature, but it's probably worth mentioning another recent trend in active inference literature, which is the development of sophisticated active inference, which I don't think is explicitly stated in the textbook, but basically sophisticated inference deals with the situations in which rather than",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2737.645,
    "end": 2742.411,
    "text": " trying to answer what will happen if I do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2743.332,
    "end": 2746.937,
    "text": "They try to address what will I believe if I do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2747.117,
    "end": 2755.728,
    "text": "So basically, it's based on the consequences of actions for beliefs rather than just the states of the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.674,
    "end": 2760.835,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.933,
    "end": 2788.729,
    "text": " yeah especially with all of the developments and elaborations happening like around the time of the writing of this textbook and since then um it's kind of it kind of contextualizes the bigger picture but like figure 4.3 is like the Lego block this is like the the neutral minimal cognitive kernel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.367,
    "end": 2818.497,
    "text": " shown in its discrete time and continuous time setting and a lot of the work right now on the analytical and on the formal side for example with category theory is to understand the compositionality of these models like can we really attach this to that in principle and then a lot of the computational work which you'll see um in the code section",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.628,
    "end": 2837.11,
    "text": " are using techniques from computer science broadly, like search on large trees and branching and pruning on trees, using these computer science and engineering approaches to make running large active inference models more tractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.953,
    "end": 2848.264,
    "text": "So the textbook helps us parachute in and get a first overview",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.797,
    "end": 2860.031,
    "text": " But for those who want to see more, there's certainly more on the computer science implementation side and on the analytical and on the formal side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.193,
    "end": 2867.841,
    "text": "But all things considered, the textbook walks the line between that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.722,
    "end": 2879.196,
    "text": "And again, chapter six is like the moment in the book where it transitions from the first five chapters, which are like a background and statistics class,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.02,
    "end": 2891.939,
    "text": " on through chapter six and beyond, which through our work, we can even develop into something like a playbook or a set of code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.979,
    "end": 2904.019,
    "text": "And in cohort three, which we're in right now with chapter six, one of our goals for this activity interval is to leave an executable trail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.522,
    "end": 2922.104,
    "text": " So we want to develop the answers to questions, but also especially where we can to leave a code or executable or just pseudocode way to approach this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.065,
    "end": 2927.05,
    "text": "And that's something that can be collaboratively worked on and versioned through the cohorts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.874,
    "end": 2930.635,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.655,
    "end": 2932.217,
    "text": "Few more questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.311,
    "end": 2943.083,
    "text": " All right, how does the particular partition, so figure 6.1, particular partition, the particle, blanket, and internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.263,
    "end": 2945.686,
    "text": "Autonomous states, just internal and active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.706,
    "end": 2949.952,
    "text": "But the particle, imagine if you were looking at a dust particle under the microscope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.953,
    "end": 2952.475,
    "text": "That would be an inert particle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.296,
    "end": 2956.86,
    "text": "But a cognitive particle is like the agent in the agent-based modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.262,
    "end": 2962.407,
    "text": "So we see sometimes a simple action perception loop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.129,
    "end": 2969.52,
    "text": " And other times we see the more expanded particular physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.043,
    "end": 2981.882,
    "text": "But then this question asks, how does the particular partition relate to the partially observable Markov decision process in figure 4.3?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.126,
    "end": 2987.432,
    "text": "So where did the Markov blanket go in figure 4.3?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.943,
    "end": 2996.587,
    "text": " Okay, one simple thought, then anyone can add more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.288,
    "end": 3001.595,
    "text": "The observations here, O, are the sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.796,
    "end": 3009.527,
    "text": "And so in the continuous time, they're even shown with Y. So that's actually the same variable as used for sensory states in the particular partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.708,
    "end": 3015.656,
    "text": "But the O are the observables across the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.397,
    "end": 3021.064,
    "text": "And then here, pi is policy selection, policy inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.196,
    "end": 3025.902,
    "text": " which is influencing the B matrix, which is how the agent thinks things change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.823,
    "end": 3033.871,
    "text": "But we could also imagine that pi also reaches out to influence the generative process, which just isn't shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.374,
    "end": 3038.837,
    "text": "Here, just the agent's generative model is shown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.138,
    "end": 3041.38,
    "text": "There's no generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.1,
    "end": 3046.866,
    "text": "But if there were a generative process, it would be receiving an input from pi,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.415,
    "end": 3051.239,
    "text": " and sending an output to observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.244,
    "end": 3073.933,
    "text": "So the POMDP can be seen as like a way of unrolling the particular partition, because this gives a sequential linear executable format to modeling the particular partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.828,
    "end": 3080.329,
    "text": " Any other thoughts on this, Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.84,
    "end": 3112.375,
    "text": " uh yeah one other way uh to like look at it is to uh interpret the uh I mean because in sorry in uh pomdp uh the a the agents preferred observations uh somehow strives toward keeping it within the high probability States uh which would be consistent uh with its continued existence in other words uh this uh striving toward uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.54,
    "end": 3121.913,
    "text": " keeping these high probability states can be interpreted as keeping its markup blanket intact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3122.394,
    "end": 3140.539,
    "text": "So in other words, markup blanket is kind of implicitly implied in POMDP, but not obviously explicitly stated, but it can be interpreted from various perspectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3141.717,
    "end": 3169.294,
    "text": " yes thank you okay gibsonian affordance concept does anyone want to give a little information on this question and then i think we'll have a response well it's a controversial issue indeed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3170.0,
    "end": 3175.747,
    "text": " If you can just briefly remind Gibson's affordance concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.767,
    "end": 3176.028,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.129,
    "end": 3177.429,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.83,
    "end": 3178.07,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.531,
    "end": 3182.996,
    "text": "Let me get the right page here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.481,
    "end": 3186.781,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.021,
    "end": 3191.687,
    "text": "Here I'm going to share some work by Paolo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.735,
    "end": 3205.134,
    "text": " an intern, and he's analyzing the affordance concept and the representation concept in the English and in the Portuguese literature using the active inference ontology to connect between the two of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.096,
    "end": 3208.218,
    "text": "And there's a table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.504,
    "end": 3220.375,
    "text": "So recently there was a paper written by Ramstead about the affordance 3.0 concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.047,
    "end": 3229.437,
    "text": " and basically says the way that we talk about affordances in Act-Inf, that is pretty much the Gibsonian affordance concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3230.398,
    "end": 3236.105,
    "text": "So as Ali tactfully noted, this is like an area of discussion slash controversy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.185,
    "end": 3241.151,
    "text": "So I look forward to Paolo developing the work more and bringing this out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.453,
    "end": 3247.459,
    "text": "However, affordance 1.0 concept by Gibson",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.131,
    "end": 3255.183,
    "text": " was that the affordance was about the perception of a capacity for action in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.403,
    "end": 3258.749,
    "text": "Like a handle is perceived as for grasping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.63,
    "end": 3265.721,
    "text": "And people focus a lot on this direct perception and there's the whole Markov blanket trick, which we've talked about elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.302,
    "end": 3273.514,
    "text": "And people focus on like whether the Markov blanket is direct or indirect perception, but that is actually a little bit of a red herring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.494,
    "end": 3301.307,
    "text": " the key piece of the gibsonian affordance concept is that the affordance is doing something explanatory about perception it's explaining a perception of a certain type which is the perception for action in a niche however in active inference as it's been used affordance is used to describe action capacities that are not necessarily perceived",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.705,
    "end": 3331.345,
    "text": " more like something that the system can do and so when we look at the pi variable from like figure 4.3 then like we call those what we call e affordances and then pi is the policies of affordances so if it's just one time step then pi is the same as e but if it's uh 12 time steps then it's all the 12-step combinations of the affordances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.438,
    "end": 3360.049,
    "text": " e what can be done however active inference does not highlight the perceptual aspects of the affordance because it's kind of a view from the inside view from the outside which we're going to come back to in chapter nine but just to show what this looks like the experimenter might say well that mouse can go up down left right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.552,
    "end": 3364.577,
    "text": " So that's how the active inference affordance concept is used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.118,
    "end": 3367.841,
    "text": "Up, down, left, right are the four capacities for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.762,
    "end": 3381.818,
    "text": "However, the traditional ecological psychological Gibsonian affordance concept highlighted the view from the inside, which is the perception of an action capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3382.068,
    "end": 3386.213,
    "text": " Now that's not a perfect concept in and of itself because it just begets the next question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.233,
    "end": 3392.1,
    "text": "Well, what raises salient affordances to awareness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.442,
    "end": 3399.028,
    "text": "So it's not like one is better than the other and surely they can be understood of as compatible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.869,
    "end": 3407.198,
    "text": "However, there is some significant work needed to understand the continuity of these concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.292,
    "end": 3417.384,
    "text": " And whether or not it's valid to say that the affordance 3.0 concept is actually in the direct lineage of the affordance 1.0 and 2.0 concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.566,
    "end": 3423.511,
    "text": "And Paolo S is the best intern to speak to about this topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.843,
    "end": 3433.144,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.985,
    "end": 3437.269,
    "text": "Well, that brings us to the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.873,
    "end": 3457.063,
    "text": " end here i'll unlike these ones for uh next week we'll be at the other time and um yeah everyone's welcome to add or upload questions or anything else any anyone else want to add anything before we close",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.063,
    "end": 3464.504,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.124,
    "end": 3465.545,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.665,
    "end": 3470.992,
    "text": "Yes, chapter six is when it really starts getting into the modeling and the doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.733,
    "end": 3484.771,
    "text": "So also next week, I'll hope that we can develop out some of the code, maybe even annotate some of the PyMDP examples or some of the other examples in terms of the recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.052,
    "end": 3486.293,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.354,
    "end": 3487.895,
    "text": "Thank you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.456,
    "end": 3488.796,
    "text": "Farewell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.378,
    "end": 3490.719,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.68,
    "end": 3492.02,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.04,
    "end": 3492.501,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]