[
  {
    "start": 7.247,
    "end": 26.586,
    "text": " hello and welcome everyone to the active inference lab today it is january 10 2022 and we're here in act inf guest stream number 14 with a whole host of awesome guests we're going to be discussing osteopathy and mental health",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 27.467,
    "end": 30.529,
    "text": " And we're going to have the authors say hello and introduce themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 31.109,
    "end": 33.59,
    "text": "Then Lucas will give a presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 33.87,
    "end": 38.573,
    "text": "And during the presentation, please feel free to add your comments and questions in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.193,
    "end": 46.617,
    "text": "And then we'll have a bunch of time after the presentation to ask those questions to the authors, hear any author's remarks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 46.817,
    "end": 51.12,
    "text": "So really excited to hear from you all and learn from your perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.06,
    "end": 76.607,
    "text": " let's hear the introductions from the authors and then go to lucas so please robert and then we'll kick it off from there thank you uh yeah robert shaw i'm based in sweden i'm an osteopath and a psychotherapist my research interest is particularly with embodiment and that was what my phd was on embodiment within the therapeutic relationships",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 81.229,
    "end": 85.372,
    "text": " Hi everyone, I'm Francesco Ceritagli from Italy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.032,
    "end": 109.029,
    "text": "I'm a neuroscientist and an osteopath, mainly interested in discovering how the brain works in relation to touch, in relation to the effect of touch based on the different types of stimuli that the body receives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.499,
    "end": 113.5,
    "text": " Hi, I'm George Estevez.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 113.78,
    "end": 114.601,
    "text": "I'm an osteopath.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 114.801,
    "end": 118.723,
    "text": "I'm currently based in Malta and Italy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 118.743,
    "end": 128.788,
    "text": "I'm also a cognitive scientist, and my main interest is on predictive processing, active inference, touch, and chronic pain in general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 131.892,
    "end": 132.392,
    "text": " Yeah, hi.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 132.632,
    "end": 133.913,
    "text": "My name is Lukas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 133.993,
    "end": 135.333,
    "text": "I think I'm the last of the authors.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 135.373,
    "end": 138.774,
    "text": "So I'm an osteopath as well, based in Hamburg in Germany.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 139.174,
    "end": 143.435,
    "text": "And I'm currently working part-time at the Osteopathic Research Institute.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 144.155,
    "end": 147.256,
    "text": "And I'm working there in education and research.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 147.436,
    "end": 153.818,
    "text": "And I'm also part-time studying psychology and neuroscience of mental health at King's College in London.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 154.558,
    "end": 158.899,
    "text": "And I think I can kick off the presentation now, if that's okay with you, Daniel.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 161.0,
    "end": 161.32,
    "text": "Perfect.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 161.834,
    "end": 162.054,
    "text": " Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 163.695,
    "end": 168.116,
    "text": "So, yeah, we have the opportunity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 168.176,
    "end": 170.437,
    "text": "Thanks again for the Active Experience Lab for the invitation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 170.997,
    "end": 171.897,
    "text": "It's a pleasure to be here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 173.478,
    "end": 186.182,
    "text": "We have the opportunity to present a paper that we have recently published in Frontiers in Psychology in the section Health Psychology Research Topic called An Activism and Active Experience in the Therapeutic Alliance.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 187.225,
    "end": 192.79,
    "text": " And the paper is entitled Osteopathy and Mental Health and Embodied Predictive and Interoceptive Brainwork.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 193.731,
    "end": 197.394,
    "text": "And yeah, without further ado, I think let's dive right into it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 197.414,
    "end": 202.539,
    "text": "A little introduction on why these things might be interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 205.521,
    "end": 212.948,
    "text": "We have globally a very high prevalence and a burden, but also comorbidity between musculoskeletal",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 213.772,
    "end": 215.993,
    "text": " and mental health disorders.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 216.273,
    "end": 230.681,
    "text": "So to put this in perspective, about 1 billion prevalent cases of mental disorders have been reported in 2017, while about 1.3 billion prevalent cases have been reported of musculoskeletal disorders in 2017.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 230.741,
    "end": 238.665,
    "text": "So together, these two broad spectrum of disorders are very prevalent, but also burdensome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 238.905,
    "end": 242.807,
    "text": "So together, both conditions contribute",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 243.544,
    "end": 247.425,
    "text": " are the main contributors to work by disability.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 248.726,
    "end": 260.289,
    "text": "But musculoskeletal mental disorders are also highly co-morbid, which means, for example, that anxiety and depression are frequently co-occur with chronic and often musculoskeletal pain conditions and vice versa.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 260.99,
    "end": 271.333,
    "text": "So, for example, depressive symptoms are quite prevalent in pain sufferers and pain symptoms are also quite prevalent in individuals with depression.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 273.14,
    "end": 286.047,
    "text": " So, this data kind of outlines a need to integrate physical and mental healthcare services in our opinion, but also in the opinion of many research papers in the literature.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 286.627,
    "end": 294.851,
    "text": "So, especially multidisciplinary collaborations between musculoskeletal and psychological healthcare specialists have been called for.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 295.96,
    "end": 309.871,
    "text": " But on the other hand, there have also been some disease classifications that have been proposed to combine physical and mental health and proposed classifications that are neither purely somatic nor purely mental.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 310.712,
    "end": 321.481,
    "text": "So we believe that there is a need to integrate these kind of approaches and we like to propose osteopathy to be one of these approaches.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 322.626,
    "end": 329.788,
    "text": " And osteopathy, for those who don't know, is generally used primarily to treat musculoskeletal disorders like back pain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 330.668,
    "end": 342.13,
    "text": "But it also has recently been proposed to benefit psychosocial factors, in particular in patient populations with persistent pain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 345.074,
    "end": 361.968,
    "text": " There was also some research that has been conducted from Hillary Abbey and colleagues showing some positive outcomes of combined treatment, combined osteopathy and combined psychological informed strategies showing positive results.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 362.645,
    "end": 368.428,
    "text": " So there are only a few attempts to investigate the effectiveness of osteopathy in the field of mental health.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 368.668,
    "end": 375.171,
    "text": "And there are only a few approaches being developed to treat or to engage with mental health.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 375.811,
    "end": 387.177,
    "text": "So based on this background, we try to propose a framework on how to move forward and how to research the protective effects of osteopathy in this field.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 388.097,
    "end": 390.659,
    "text": "And we do so by drawing together",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 391.94,
    "end": 397.882,
    "text": " from the research fields of embodied cognition, predictive coding, but also interoception and osteopathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 398.722,
    "end": 404.384,
    "text": "And we like to propose, in the end, our framework, which is an embodied predictive and interoceptive framework.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 405.205,
    "end": 410.947,
    "text": "And if you look on the right-hand side, figure one, this is kind of our background put together.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 411.047,
    "end": 417.189,
    "text": "And to simplify, embodied cognition kind of highlights the role of the body in cognition and in mental health.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 418.075,
    "end": 423.899,
    "text": " And these processes are likely underpinned by predictive coding processes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 424.62,
    "end": 435.247,
    "text": "So furthermore, our access point, we discuss interoception as an access point and therapeutic access point to affect these processes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 435.367,
    "end": 440.65,
    "text": "And we argue that osteopathy might be an approach to realize this aim.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 442.272,
    "end": 444.933,
    "text": "So let's have a look at the background.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 444.973,
    "end": 446.875,
    "text": "We start with the first research field, which is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 447.754,
    "end": 471.95,
    "text": " embodied cognition and generally embodied embodiment is an interdisciplinary field of research which spans disciplines including philosophy but also psychology psychiatry and neuroscience and in general these theories of embodiment argue that the cognition and emotion are both dependent on embedded embodied simulations so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 472.833,
    "end": 481.635,
    "text": " They argue that body and mind are inseparable in producing cognition and that the non-neural body might both constrain and enable cognition.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 482.735,
    "end": 486.416,
    "text": "But notably there are stronger and weaker versions of embodiment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 487.456,
    "end": 497.698,
    "text": "Some argue that the body might contribute to cognitive processes while other versions argue that it might constitute cognitive processes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 500.039,
    "end": 500.799,
    "text": "So to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 501.719,
    "end": 510.182,
    "text": " get a little bit more detail involved, theories of embodiment argue that cognition and emotion are based upon reinstatements of perception.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 510.382,
    "end": 520.385,
    "text": "So this is relating to both external, extra-receptive and inter-receptive sensory states, but also to action, which relates to proprioceptive motor states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 521.466,
    "end": 529.148,
    "text": "And these perceptions produce embodied or sensory motor simulations of previous experiences in one's self.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 529.689,
    "end": 530.329,
    "text": "So this is a",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 531.929,
    "end": 557.724,
    "text": " of explanation of embodiment and this perspective is quite interesting because it might revise our brain-centered view of cognition by acknowledging that these processes are not simply limited to neural events in the brain but also cut across the brain body and world's divisions and should be also studied accordingly and there are different kinds of commitment to the embodied theories",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 559.452,
    "end": 566.595,
    "text": " And activism is an interesting aspect or linked concept that I want to go into detail a little bit further.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 566.615,
    "end": 575.498,
    "text": "And activism proposes that cognition emerges from the dynamic interaction of brain, body, and also environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 576.278,
    "end": 582.26,
    "text": "So most of you might have heard about the 4E cognition, which is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 583.115,
    "end": 589.721,
    "text": " that cognition is all together embodied, embedded, enacted, extended, but also ecological.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 590.742,
    "end": 602.633,
    "text": "And it is argued that cognition is an embodied, embedded, enacted, extended, and ecological process of sensemaking through a body in an environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 602.753,
    "end": 607.798,
    "text": "So this is an evaluative interaction of an organism and its environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 608.513,
    "end": 618.055,
    "text": " So in detail, these four or five E's mean that embodied cognition is enabled through and also constrained by the non-neural body.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 619.716,
    "end": 627.098,
    "text": "Embedded means that cognition depends on the environmental context as the organism is situated within the environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 628.458,
    "end": 635.38,
    "text": "Enacted means that cognition is for action and depends on the interaction of the embodied organism with the environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 636.36,
    "end": 640.804,
    "text": " And extended means that cognition extends beyond the brain and body into the environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 641.304,
    "end": 644.087,
    "text": "The most notable example might be your smartphone.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 645.148,
    "end": 650.352,
    "text": "And lastly, ecological means that cognition depends on the environmental affordances for action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 651.433,
    "end": 657.598,
    "text": "And altogether, this might constitute an activism with a 5E perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 658.359,
    "end": 661.962,
    "text": "So combining these perspectives of embodied and active",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 662.714,
    "end": 678.544,
    "text": " In activism, both mental and physical health conditions, for example, pain and depression, are associated with an altered interaction of the organism with the environment through its embodiment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 679.345,
    "end": 682.767,
    "text": "So it's the three-part interaction of brain, body, and environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 684.249,
    "end": 692.554,
    "text": " So to sum this up, embodiment and activism emphasize the interaction of brain, body, and environment in understanding the mind and cognition.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 693.615,
    "end": 705.483,
    "text": "And to understand the processes of the brain in a little bit more detail, we have to turn to another field of research, which is the next part of the background, which is predictive coding.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 706.594,
    "end": 714.36,
    "text": " And I believe that predictive coding is a topic most of the listeners are more familiar with than us, but I try to summarize them anyway.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 715.04,
    "end": 721.565,
    "text": "So predictive processing is a theoretical framework with growing influence in the field of cognitive science.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 722.446,
    "end": 731.413,
    "text": "And it is closely related, but also distinct from the free energy principle, Bayesian brain hypothesis and active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 731.433,
    "end": 734.575,
    "text": "So I will summarize all of them closely, shortly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 735.536,
    "end": 735.676,
    "text": "So",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 736.328,
    "end": 746.413,
    "text": " The free energy principle proposes that living systems resist a tendency to disorder, or in other words, remain in thermodynamic non-equilibrium steady states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 747.213,
    "end": 753.356,
    "text": "And they do so by restricting themselves to a limited number of states through the minimization of free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 754.196,
    "end": 760.259,
    "text": "And in this instance, free energy is defined as the difference between the systems predicted and actual states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 761.239,
    "end": 764.561,
    "text": "And this can be minimized using both perception and action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 765.322,
    "end": 773.411,
    "text": " In perception, it is minimized by updating the prediction that is made from the generated model based on the sensation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 774.472,
    "end": 780.679,
    "text": "And action, in turn, is changing the sensation through action to match with the prediction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 780.839,
    "end": 782.641,
    "text": "So it's like a self-fulfilling prophecy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 784.183,
    "end": 786.545,
    "text": "And the Bayesian brain hypothesis",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 788.047,
    "end": 801.454,
    "text": " proposes that brains make predictions about the causes of extra-receptive, inter-receptive, but also proprioceptive sensations using both the current sensory input but also prior beliefs based on the generative model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 802.674,
    "end": 817.542,
    "text": "And in general, the confidence or precision one has in the belief or the prior and the sensory input or the likelihood will determine how much the perception will in the end shift towards the expectation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 818.391,
    "end": 824.954,
    "text": " So in general, a gap between prior and likelihood is called a prediction error or free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 826.075,
    "end": 837.021,
    "text": "And while a system is minimizing prediction error or free energy or surprise or entropy, that is also maximizing the evidence for its own model of the world.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 838.441,
    "end": 842.723,
    "text": "And this is the Bayesian brain hypothesis is relating to behavior.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 842.823,
    "end": 845.625,
    "text": "So predictive coding is putting this into a neural perspective.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 846.332,
    "end": 859.019,
    "text": " and proposes that there are descending top-down predictions that are conveyed from higher cortical levels down to lower cortical levels, where they are compared to us sending bottom-up sensory information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 860.099,
    "end": 871.305,
    "text": "So from this perspective, information only goes up the cortical hierarchy if a mismatch between the predicted and actual information occurs, which is termed a prediction error.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 872.35,
    "end": 877.533,
    "text": " And otherwise, top-down predictions constantly explain away bottom sensory information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 879.974,
    "end": 887.998,
    "text": "So then there's active inference, which proposes that the brain actively modifies its input to confirm prior expectations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 888.798,
    "end": 894.481,
    "text": "And this is an active and also selective sampling of sensory information in the world through action.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 895.202,
    "end": 897.683,
    "text": "So prediction errors can be minimized.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 897.783,
    "end": 899.424,
    "text": "We have talked about it a little bit.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 899.844,
    "end": 901.925,
    "text": "Through perceptual inference and active inference,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 902.455,
    "end": 914.265,
    "text": " Perceptive inference meaning revising the generative model based on the prediction errors and active inference acting on the world to generate a state that is predicted by the generative model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 915.866,
    "end": 930.898,
    "text": "And to bring all of this together within the physical and mental health condition, to understand the physical and mental health conditions, it might be an altered weighting of prior beliefs and sensory information which gives rise to physical and mental health conditions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 931.638,
    "end": 945.469,
    "text": " So for example, physical health conditions, prior beliefs are likely overweighted relative to sensory information, which means too much precision, which then predicts symptoms consequently experienced.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 946.871,
    "end": 956.599,
    "text": "And this might also lead to heightened prediction of pain even towards harmless sensations, so that harmless sensations might be perceived as painful.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 957.659,
    "end": 960.562,
    "text": "And on the other hand, mental health conditions,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 962.161,
    "end": 969.485,
    "text": " Both prior beliefs might be overly precise in comparison to sensory information or vice versa.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 969.645,
    "end": 972.787,
    "text": "So the first one in depression and the second one in psychosis.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 973.827,
    "end": 979.63,
    "text": "And yes, so one point that was quite interesting",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 980.618,
    "end": 988.024,
    "text": " Interesting is that chronic pain and depression, which we are quite interested in, are particularly linked to false experiences of interoception.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 988.044,
    "end": 989.526,
    "text": "There's a little literature about this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 990.046,
    "end": 995.671,
    "text": "So this is our next research topic that we want to combine with the other ones.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 997.332,
    "end": 998.573,
    "text": "So what is interoception?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1000.074,
    "end": 1007.761,
    "text": "Kajsa and I have defined interoception as the process by which the nervous system senses, interprets, and integrates",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1008.345,
    "end": 1010.166,
    "text": " Signets originating from within the body.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1010.427,
    "end": 1012.788,
    "text": "So it's all information from within our own body.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1013.449,
    "end": 1022.335,
    "text": "And this provides some kind of embodied sensory experience, which is absolutely necessary for the adaptive interaction with the environment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1023.276,
    "end": 1031.462,
    "text": "So an interesting aspect is that the active interference model was also applied to interoception, which is termed interoceptive interference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1032.984,
    "end": 1040.45,
    "text": " And it proposes that interoceptive experiences result from appearances about the hidden costs of this sensory information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1041.992,
    "end": 1060.788,
    "text": "So to put this into the neural perspective, top-down interoceptive predictions are compared with bottom-up interoceptive information, most likely in the insular, and the mismatch between both then results in prediction error, which is minimized depending on the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1061.733,
    "end": 1066.394,
    "text": " on the precision by either perceptual inference or active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1066.514,
    "end": 1076.557,
    "text": "So, perceptual inference means revising the top-down interoceptive predictions, and active inference means then modifying the bottom-up interoceptive information to convey with a prediction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1078.677,
    "end": 1090.32,
    "text": "And interestingly, Andrew Seth has proposed that an emotion can also be viewed as interoceptive inference because interoceptive prediction errors are used to infer emotional states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1092.15,
    "end": 1109.205,
    "text": " So to connect this to physical and mental health conditions, deficits in interceptive processing, for example, low interceptive accuracy might be associated with both physical and mental health conditions like chronic pain and comorbid depression.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1110.806,
    "end": 1112.488,
    "text": "However, there is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1115.034,
    "end": 1121.557,
    "text": " It is not clear how that every disorder in every individual might behave the same in this way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1121.777,
    "end": 1124.918,
    "text": "I think there are differences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1128.132,
    "end": 1149.497,
    "text": " So some disorders in individuals would likely benefit from reducing overly precise interoceptive predictions, for example, worrying beliefs about real but indeed harmless sensations, while other patients might reduce overly precise interoceptive information, which is, for example, illusory sensations that maintain worrying beliefs.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1150.097,
    "end": 1152.278,
    "text": "So there are both possibilities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1153.325,
    "end": 1158.891,
    "text": " So let's talk about our approach on how to influence interoceptive information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1158.951,
    "end": 1159.853,
    "text": "And this is osteopathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1159.893,
    "end": 1162.996,
    "text": "We are all osteopaths, the authors on this paper.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1163.557,
    "end": 1165.359,
    "text": "So a few words about osteopathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1166.56,
    "end": 1170.144,
    "text": "Osteopathy combines hands-on manual approaches with",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1171.328,
    "end": 1179.555,
    "text": " Hands-off patient management approaches, so we use touch and manipulation as hands-on, which is informed by osteopathic models of care, so our clinical reasoning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1180.275,
    "end": 1188.062,
    "text": "And hands-off patient-managed approaches involve patient education, psychological support, lifestyle advice, but also self-management solutions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1188.562,
    "end": 1191.865,
    "text": "And these are informed, of course, by osteopathic principles.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1192.846,
    "end": 1199.471,
    "text": "But notably, both might utilize top-down and bottom-up dynamics between peripheral tissues and the brain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1201.127,
    "end": 1201.287,
    "text": " Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1201.887,
    "end": 1213.97,
    "text": "So in general, osteopathy is applied to treat a range of clinical conditions, but an emphasis is given on chronic pain conditions, in particular musculoskeletal disorders like back pain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1215.111,
    "end": 1223.273,
    "text": "And philosophically, osteopathy has emphasized the unity and interaction of body, mind and soul for quite some time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1224.036,
    "end": 1232.562,
    "text": " And it has also been proposed that it might benefit psychological outcomes, especially in chronic pain patients, but this needs some further research.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1233.463,
    "end": 1250.215,
    "text": "And Francesco and colleagues also proposed that osteopathic treatment might influence interoceptive processing in a concept paper they published in, I think, 2016, and went on to conduct some primary research showing that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1251.295,
    "end": 1261.923,
    "text": " Osteopathy indeed increases interoceptive accuracy, but also decreases the bold response of brain correlates of interoception in patients with chronic low back pain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1262.844,
    "end": 1272.531,
    "text": "So they do so probably by the stimulation of afferent C-tactile fibers, which communicate interoceptive and affective dimensions of touch.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1273.433,
    "end": 1282.216,
    "text": " So this could be relevant to both physical and mental health conditions that involve interoceptive deficits, which are, for example, chronic pain and also depression.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1283.957,
    "end": 1288.859,
    "text": "So this is our background, and I think it leads up to the framework we'd like to present.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1289.939,
    "end": 1293.941,
    "text": "And the framework bridges all of these fields of research.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1294.321,
    "end": 1298.422,
    "text": "And it is an embodied interoceptive, but also predictive framework.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1300.973,
    "end": 1311.142,
    "text": " The basic basis is that both physical and mental health symptoms may result from altered precision weighting between intercepted predictions and intercepted input.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1311.442,
    "end": 1324.593,
    "text": "So we argue that, or the literature argues that either too much precision is a failure to acquire, which is an overly precise prediction, or too little precision is a failure to the likelihood, which is an imprecise prediction error.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1326.175,
    "end": 1328.557,
    "text": "So arguably,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1329.093,
    "end": 1334.017,
    "text": " Chronic pain and depression are mainly linked to the overweighting of priors.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1334.817,
    "end": 1342.303,
    "text": "So these beliefs likely predict painful and depressive states, even if the actual interceptive information is harmless.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1343.384,
    "end": 1345.465,
    "text": "And they do so due to past experiences.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1346.046,
    "end": 1350.089,
    "text": "And they likely make these states come true through active appearance.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1350.989,
    "end": 1355.713,
    "text": "So the expected symptoms might be generated through action to confirm the prediction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1356.636,
    "end": 1381.225,
    "text": " And in order to update these prior beliefs and reduce the active influence of pain and depressive states, it is likely that surprising interoceptive input needs to be provided to increase, first of all, the weight of the likelihood, but also to generate prediction errors that can revise the belief, issuing the predictions, and thus osteopaths likely need to foster perceptual influence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1381.821,
    "end": 1388.083,
    "text": " So actual information is used in perceptual inference to update the prediction and also the perception of these symptoms.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1388.944,
    "end": 1390.965,
    "text": "And we have a look at figure two in a moment.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1392.105,
    "end": 1406.39,
    "text": "So there's a paper by Farb from 2015, which has argued that contemplative practices may alter interoceptive processing, shifting regulatory habits from active to perceptual inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1407.011,
    "end": 1410.212,
    "text": "And we believe that osteopathy does the same.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1411.505,
    "end": 1421.632,
    "text": " So if we have a look at our main figure here, we propose that you see a patient in red lying on the treatment table.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1422.353,
    "end": 1436.783,
    "text": "Imagine this patient has chronic pain with comorbid depression and he's lying there and the osteopath provides some touch-based interventions to the symptomatic area in this image, the abdomen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1437.624,
    "end": 1439.345,
    "text": "And we argue that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1440.379,
    "end": 1450.602,
    "text": " the belief or the prior of the patient is likely to predict physical and mental states that are associated with pain and depression because to be the likely cause of uncertain information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1450.962,
    "end": 1453.903,
    "text": "And this is the overweighting of the prior.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1454.963,
    "end": 1467.266,
    "text": "But if we provide some treatment interventions to the patients, the sensory input is not linked to these physical and mental states, which is surprising, but osteopathic treatment",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1468.186,
    "end": 1471.767,
    "text": " often does not involve pain, but it's quite pleasant if you touch a patient.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1472.387,
    "end": 1484.131,
    "text": "So this is a surprising mismatch, of course, to the patient because the expected and the actual information do not match and thus generate an intraceptive prediction error.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1485.251,
    "end": 1491.773,
    "text": "So these prediction errors need to be minimized and they can be minimized using active or perceptual influence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1492.373,
    "end": 1494.954,
    "text": "And in chronic pain,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1495.407,
    "end": 1503.169,
    "text": " We argue that high precision is afforded to the belief, to the prior, and low precision is afforded to the sensory information and the likelihood.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1503.749,
    "end": 1513.471,
    "text": "So the first process that needs to be engaged is active inference, which likely produces the symptoms that are resembling the predicted states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1514.071,
    "end": 1524.954,
    "text": "So likely the autonomic nervous system is engaged to produce sensations that resemble the expected painful and depressive symptoms.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1528.276,
    "end": 1537.51,
    "text": " However, we are in a healthcare context in osteopathic treatment, so the patient might also be declined to think that this is a health-promoting intervention.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1537.71,
    "end": 1539.133,
    "text": "So this is not...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1540.709,
    "end": 1546.591,
    "text": " not, this is contradictory with the prediction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1547.251,
    "end": 1555.134,
    "text": "So active inference might not be sufficient to reduce and explain the interceptive prediction errors.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1556.034,
    "end": 1564.297,
    "text": "So consequently, we argue that perceptual inference processes might be engaged to update then the belief and the FOIA based on the likelihood.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1564.317,
    "end": 1568.859,
    "text": "So the sensory information provided by the osteopath might update the belief by the patient.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1569.648,
    "end": 1573.672,
    "text": " and thereby revising the generative model, holding the belief and issuing the prediction.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1574.612,
    "end": 1585.942,
    "text": "So we argue that these are the processes that underpin osteopathic treatment in these kinds of patients, and especially when an emotional reaction in treatment develops.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1586.603,
    "end": 1586.743,
    "text": "So",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1589.346,
    "end": 1600.429,
    "text": " Yeah, and in essence, we argue that belief and the prediction of physical and mental states that are associated with pain and depression are updated through these interventions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1600.549,
    "end": 1614.012,
    "text": "So the persistent and noisy interceptive prediction errors which maintain the symptoms through active inference might be replaced with surprising and precise interceptive prediction errors to alleviate the symptoms through perceptual inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1615.692,
    "end": 1618.933,
    "text": "So this is, in a nutshell, our framework.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1619.728,
    "end": 1642.965,
    "text": " and we also of course need to discuss this framework and have a look at some implications also limitations so in general i like to emphasize that this theoretical framework is a theoretical framework and therefore requires experimental scrutiny of verification or falsification so future research particularly needs to explore if osteopathic treatment indeed",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1644.338,
    "end": 1647.28,
    "text": " alleviates physical and mental symptoms in this patient population.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1647.781,
    "end": 1657.548,
    "text": "Also, if it actually increases interoceptive accuracy in this population and likely also decreases allostatic load and modulates autonomic nervous system activity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1657.708,
    "end": 1660.07,
    "text": "So there are a few measurement tools we can use for that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1661.261,
    "end": 1670.529,
    "text": " And other limitations include the disregard of complexity, both of the health conditions, but also of the therapeutic approaches.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1670.689,
    "end": 1679.257,
    "text": "So osteopathy and depression and chronic pain are all very complex conditions, and we have simplified them extremely.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1679.317,
    "end": 1688.185,
    "text": "So we overlooked environmental factors, and we didn't go into explaining the patient-therapist relationship in detail as well.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1688.749,
    "end": 1691.251,
    "text": " But this framework should be understood in this context.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1691.431,
    "end": 1693.653,
    "text": "So it should be understood in a person-centered context.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1695.455,
    "end": 1708.407,
    "text": "And future studies might also have a look at why manual treatment of peripheral tissues sometimes leads to autonomic and emotional disorders.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1709.074,
    "end": 1709.534,
    "text": " responses.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1709.635,
    "end": 1723.744,
    "text": "And I think this is the basic of why I was so interested in this research and these theories, because in practice, I frequently engaged patients which responded quite emotionally to touch and felt quite better after.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1724.164,
    "end": 1726.906,
    "text": "So I wanted to understand how this might happen.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1727.926,
    "end": 1736.132,
    "text": "So based on our hypothesis, you can see in figure 3, panel A, that the therapeutic input that is",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1736.977,
    "end": 1747.002,
    "text": " provided during treatment may contradict the predicted state of pain and depression and produce an interoceptive prediction error, which is used to infer emotional states",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1747.526,
    "end": 1751.789,
    "text": " and need to be minimized by active inference or by perceptive inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1751.909,
    "end": 1756.993,
    "text": "And what you can see in NLA is that the initial active inference is quite quick and sharp.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1757.454,
    "end": 1776.168,
    "text": "And we have seen, or I've seen, and my colleagues as well, from experience that often if patients display emotional responses during treatment, they firstly experience some sympathetic activity like sweating and muscle tightness, combined with emotional distress, for example, starting to cry,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1776.889,
    "end": 1787.496,
    "text": " But these initial reactions frequently are replaced with very parasympathetic activity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1787.536,
    "end": 1794.2,
    "text": "So the breathing goes down and the patient starts to relax and emotional calmness starts to set in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1794.76,
    "end": 1802.485,
    "text": "And I believe this is quite well explainable with the framework we have provided here because an active inference might be the first way to engage",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1803.869,
    "end": 1812.034,
    "text": " in minimizing these prediction errors and perceptive inference might be the second and more sustainable way of minimizing these prediction errors.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1812.974,
    "end": 1827.561,
    "text": "So lastly, you can see on panel B another idea which might come from this framework, and this is the ground for multidisciplinary collaborations in the treatment of mental and physical disorders.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1828.382,
    "end": 1832.824,
    "text": "So we propose a kind of integrative interoceptive exposure therapy",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1833.65,
    "end": 1844.398,
    "text": " in which both physical but also mental health care specialists can come together and work in a multidisciplinary but also person-centered care approach.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1845.038,
    "end": 1850.863,
    "text": "And the idea is, if you can see on the left-hand side here, is that mindfulness practices",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1851.73,
    "end": 1869.08,
    "text": " likely work top-down, helping the patient to attend to the sensation that he or she is experiencing, but also affecting the sensory information, like osteopathy working bottom-up, also affecting the sensory information by likely producing a sensation itself.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1869.78,
    "end": 1879.005,
    "text": "And psychotherapy is likely to work top-down to help identify and also reflect on the sensation and likely works on...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1880.771,
    "end": 1885.816,
    "text": " works on the prion that leave directly, not through the sensory information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1886.937,
    "end": 1891.22,
    "text": "So these are a few future research ideas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1892.241,
    "end": 1896.225,
    "text": "And now we can conclude this presentation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1897.046,
    "end": 1905.009,
    "text": " And to put it all together, this hypothesis and theory article proposes the embodied predictive and intrusive framework.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1906.009,
    "end": 1915.912,
    "text": "And it does so to reason and research the effect of osteopathic treatment as putatively on comorbid psychological factors in patients with persistent physical conditions.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1917.093,
    "end": 1923.975,
    "text": "And one of the basic ideas is that persistent physical and mental conditions like chronic pain and depression",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1924.905,
    "end": 1942.237,
    "text": " may be underlined by first overly precise interoceptive predictions meaning that symptom congruent information is expected and second imprecise interoceptive prediction errors meaning that symptom incongruent information is not sensed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1943.498,
    "end": 1950.243,
    "text": "So osteopathic treatment may provide uncertain and surprising interoceptive information to the bodily area",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1950.825,
    "end": 1964.618,
    "text": " that is associated with the physical and also comorbid mental symptoms, resulting in interoceptive prediction errors that first engage active appearance processes, which lead to initial autonomic activity resembling the predicted symptoms.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1965.799,
    "end": 1972.906,
    "text": "And this is because it is the most likely cause of uncertain interoceptive information due to the past experiences of the patient.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1973.8,
    "end": 1986.735,
    "text": " And afterwards due to the context or factors, the patient likely engages perceptual inference processes that then update the maladaptive interoceptive predictions based on the actual interoceptive information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1987.375,
    "end": 1994.303,
    "text": "And osteopathy might also actually improve the ability to attend to actual interoceptive information.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1995.481,
    "end": 2007.526,
    "text": " So in a nutshell, persistent and noisy interoceptive prediction errors that maintain the symptoms are likely replaced with surprising and precise interoceptive prediction errors that arguably alleviate the symptoms.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2008.506,
    "end": 2017.33,
    "text": "And in this way, treatment might reduce the belief about and also the prediction of physical and mental states that are associated with chronic brain and comorbid depression.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2018.63,
    "end": 2023.572,
    "text": "And we are currently also at the Osteopathic Research Institute conducting research into",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2024.341,
    "end": 2025.002,
    "text": " these approaches.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2025.102,
    "end": 2042.018,
    "text": "So Torsten has also joined us today, has developed an approach to psychosomatic osteopathy and we are currently having a look on how these techniques might influence stress levels in healthy participants but also patients with chronic tension type headaches or chronic musculoskeletal disorders.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2042.819,
    "end": 2045.642,
    "text": "So maybe there's some things to follow in the future.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2046.215,
    "end": 2047.196,
    "text": " So that's it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2047.216,
    "end": 2049.957,
    "text": "Thank you very much for your attention.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2050.417,
    "end": 2055.06,
    "text": "I'm really looking forward to the discussion and to engaging Robert, George, and Francesco.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2056.461,
    "end": 2058.001,
    "text": "And here are the references.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2058.021,
    "end": 2060.243,
    "text": "I think I'll scroll through them shortly.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2060.563,
    "end": 2064.865,
    "text": "And if someone is interested, I think they can get the presentation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2065.045,
    "end": 2065.726,
    "text": "Is that right, Daniel?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2067.967,
    "end": 2068.147,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2077.452,
    "end": 2078.132,
    "text": " So that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2079.553,
    "end": 2080.333,
    "text": "Thanks, Lucas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2080.353,
    "end": 2081.853,
    "text": "That was an awesome presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2082.293,
    "end": 2084.894,
    "text": "Really a lot to think and talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2085.674,
    "end": 2092.156,
    "text": "So perhaps we'll first just open it up to any of the authors and colleagues here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.576,
    "end": 2096.017,
    "text": "Please just jump in wherever you'd like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2096.197,
    "end": 2106.62,
    "text": "I think it'd be awesome to hear about just your overview or what brought you to this area of research, as well as anything that you picked up on from this last presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2114.282,
    "end": 2117.483,
    "text": " I think maybe I can say a few words because I forgot something in the beginning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2117.563,
    "end": 2131.108,
    "text": "So it all started with George and Francesco inviting Robert and me to join a research group that tries to reconceptualize osteopathic care under the active inference framework.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2131.649,
    "end": 2138.011,
    "text": "So we have a group of osteopaths from Europe working with the active inference framework.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2138.071,
    "end": 2143.293,
    "text": "And there are also other papers coming in a special topic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2143.8,
    "end": 2149.863,
    "text": " which also has been edited by George and Francesco.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2150.203,
    "end": 2153.825,
    "text": "So there are other ideas coming forward in the near future.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2157.506,
    "end": 2163.349,
    "text": "I think one thing that I guess brought us into this area",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.986,
    "end": 2188.579,
    "text": " you know, is a sort of a way of looking into how we can best help our patients, in particular those with, you know, present with complexity, including, you know, chronic pain, but not just chronic pain, you know, the broad sort of area of persistent physical symptoms, you know, those that tend to sort of go around, see different practitioners,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2190.243,
    "end": 2213.961,
    "text": " look for a solution to their problem trying to know what's going on and you know we tend to sort of see them in practice and struggle at times if we use um you know a very reductionist approach to practice which is do a manual intervention and hope for the best you know that's that's far from um you know from what is best practice this does what is patient-centered care and also um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2227.128,
    "end": 2227.948,
    "text": " Can you still hear?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.149,
    "end": 2230.55,
    "text": "I just lost George for an audio.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.61,
    "end": 2232.191,
    "text": "I was just going to ask.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.211,
    "end": 2232.591,
    "text": "Yeah, me too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.811,
    "end": 2233.071,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.552,
    "end": 2236.093,
    "text": "I can pick up a bit from that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2239.635,
    "end": 2252.843,
    "text": "There's been a kind of a problem with osteopathic theory over the years, which George is hinting at around the reductionistic biomechanical model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2254.136,
    "end": 2271.704,
    "text": " And when it comes to complexity, those sorts of traditional ways of looking at people's chronic symptoms leave something to be, well, they're not really, they leave things missing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2271.884,
    "end": 2281.549,
    "text": "We're realising using, if we draw from other disciplines, that we can see that there's a potentially much better way to describe",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2282.68,
    "end": 2285.841,
    "text": " why people have these kind of chronic type symptoms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2286.301,
    "end": 2294.545,
    "text": "And I came into this a bit like Lucas with being quite surprised in practice about how people react to treatment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2296.125,
    "end": 2296.745,
    "text": "And I think we have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2300.365,
    "end": 2309.855,
    "text": " It's almost a kind of a tacit sort of thing within the profession that we treat people with emotional disturbance, but we don't actually upfront it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2310.556,
    "end": 2318.885,
    "text": "And so this conceptual framework is actually starting to redress the balance, which I think is really, really important.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2318.985,
    "end": 2321.768,
    "text": "And trying to understand why is it people react?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2322.552,
    "end": 2350.255,
    "text": " um i think the this notion of prediction errors is um kind of an interesting one i i came into it a long time ago looking at it from a psychodynamic point of view and things called abreactions but i think what we're moving towards is trying to come up with a bit more of a unified theory and that's why i think the concepts of active inference and activism are actually starting to help and also add the participatory sense making",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2351.395,
    "end": 2357.258,
    "text": " movement also adds a lot to how we can start to understand it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2358.399,
    "end": 2366.703,
    "text": "I know Lucas mentioned we haven't talked about the therapeutic relationship, but there are other papers in the pipeline that we'll look at.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2366.723,
    "end": 2367.664,
    "text": "I'm losing my voice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2367.684,
    "end": 2373.487,
    "text": "I hope that sort of did a bit of a summary for you, George.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2379.451,
    "end": 2381.632,
    "text": " Very interesting framing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2381.672,
    "end": 2382.813,
    "text": "Yeah, continue, George.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2383.834,
    "end": 2384.314,
    "text": "No, no, no.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2384.514,
    "end": 2388.736,
    "text": "I think Robert, you know, did a brilliant job in summarizing everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2388.777,
    "end": 2398.842,
    "text": "So, you know, all the challenges and the reasons why, you know, we got interested in exploring a different kind of way of looking at things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2401.504,
    "end": 2403.825,
    "text": "Francesco or Torsten, would you like to add anything?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2403.845,
    "end": 2408.028,
    "text": "Otherwise, anyone in the live chat is welcome to add a question and I have some questions too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.935,
    "end": 2410.556,
    "text": " Yes, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.636,
    "end": 2426.436,
    "text": "So one other viewpoint that I can add at this point is that from previous research that actually we published looking at the and using fMRI, but also other neuroscientific tools like, for example, thermocons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.737,
    "end": 2441.223,
    "text": " we ended up understanding or exploring the fact that actually the brain is starting to react to specific or general touch in a kind of similar but different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.544,
    "end": 2453.329,
    "text": "And this actually creates a kind of a question, a research question on where the ability of the specific manual therapies approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.989,
    "end": 2478.089,
    "text": " might intercede with specific brain, bottom-up or top-down, in an old-style way describing how the brain works, because actually now we know and look in particular in activism and active inference, the brain actually doesn't work with the top-down or bottom-up stream so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.609,
    "end": 2481.812,
    "text": "But in a way, actually, we ended up saying that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.759,
    "end": 2509.886,
    "text": " probably the interaction with the body, so using a kind of affordancy and sense-making, so creating action into the patient and through the action of the therapeutic alliance and therefore through the professional and the operator might create a kind of a sharing relationship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.067,
    "end": 2538.263,
    "text": " scenario or a sharing environment that with the concept of predictive processing and active inference might also be explained through the Markov-Blankets communication and Markov-Blankets connection between the two elements, so the patient and the operator, that something might happen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.023,
    "end": 2554.861,
    "text": " not only through the specific activity that any type of manual therapist can do, but also within a framework of closeness between the two elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.302,
    "end": 2559.066,
    "text": "Indeed, one of the early studies that also Lucas mentioned,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.918,
    "end": 2579.772,
    "text": " What actually we did was just touching the ankles of a healthy patient laid down on the scan and we just changed our mental attitude on focusing towards the hand or avoiding the attention towards the hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.892,
    "end": 2582.013,
    "text": "So like mimicking the way in which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.594,
    "end": 2606.6,
    "text": " a manual therapist was paying attention to what he or she is doing through manual touch or just being absolutely away from the attention of the manuals and therefore in the specific elements of the research was just counting a random bit through the headphones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.44,
    "end": 2624.116,
    "text": " And what actually we saw is that in those people that were touched through an attention towards the hand, there was a higher activation of the insula and the infrafrontal gyrus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.816,
    "end": 2637.905,
    "text": " like in a way the perception of the patient is before the fact that actually is conscious of something happening from an interoceptive point of view within the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.846,
    "end": 2641.127,
    "text": "And the body is saying, do you know what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2641.608,
    "end": 2647.572,
    "text": "I'm feeling something that actually I'm processing through an interoceptive framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.232,
    "end": 2677.236,
    "text": " in the in the insula and at the same time i'm changing my um endogenous or exogenous attention based on the way in which you touch me so and therefore this creates a more complex environment in which actually we we we would like to understand better and we think that and the an active uh approach is one of the and with all its",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2677.816,
    "end": 2691.571,
    "text": " let's say, subsections and elements that might be an interesting way of interpreting or at least trying to read what is happening in the complex clinical environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.054,
    "end": 2695.355,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.954,
    "end": 2722.972,
    "text": " so i'll make an observation and then ask a question so robert i really like what you said about uh being motivated from earlier on by what you saw the outcomes of treatment were and then that was kind of alluded to in what we just heard like um you could be touching someone's ankle but it's not just the ankle that might change maybe it's their knee but maybe it's something in their head but then maybe it's something in their",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.872,
    "end": 2750.229,
    "text": " organ or their brain or their mind and um that idea of like entering at the anomaly is it's very clinical like i'm not that kind of a doctor but that's kind of what i understand to be done like looking for patterns and anomalies and then it's also very at home in the realm of participatory sense making like you also addressed but also that's kind of active inference which is relative to a generative model of the world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2752.225,
    "end": 2756.009,
    "text": " observations are either consistent or surprising in some way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2756.83,
    "end": 2758.932,
    "text": "And so that was just kind of, it's an interesting tie in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2758.952,
    "end": 2770.164,
    "text": "And I think it just speaks to how, even in a qualitative or just a conceptual level across different domains, we can like talk about active inference as well as other areas and their concordances",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2771.599,
    "end": 2774.361,
    "text": " And it's not like one has to nest over the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2774.381,
    "end": 2777.763,
    "text": "There are different domains and approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2778.363,
    "end": 2780.705,
    "text": "So, Robert, any thoughts on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.825,
    "end": 2782.025,
    "text": "Or I have other questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2783.366,
    "end": 2797.515,
    "text": "Yeah, I think there needs to be some kind of addressing of you got to, you know, you have a relationship between the practitioner and the patient.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2798.235,
    "end": 2801.117,
    "text": "And I think the participatory sense making is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2802.228,
    "end": 2827.499,
    "text": " can start to somehow dissolve a little bit of the the kind of normative language which has become problematic so so anomalies in the past have been dismissed as in oh you're not getting better because you're not reacting to the treatment properly whereas these types of approaches are saying oh hold on a minute there is a shared",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2828.855,
    "end": 2855.469,
    "text": " narrative and i think the narrative medicine movement is also quite important in in these ideas obviously we can't write about that as well um but it's it's nice i think you've picked up on that sort of multi-dimensional and crossover between different disciplines because i think that's another thing we're trying to make a big point of in this paper we need to reach out to other disciplines and say look",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2856.42,
    "end": 2860.903,
    "text": " we have this way of doing things, but we know we don't have the whole picture at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2861.624,
    "end": 2875.134,
    "text": "But if we can combine with psychologists, psychiatrists, I mean, all of us on the paper, we've all gone outside of osteopathy to look at other disciplines.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2876.735,
    "end": 2884.721,
    "text": "And that's kind of another kind of, it's like a meta kind of participatory sense-making that goes into, I think, what we're trying to achieve here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2886.55,
    "end": 2895.393,
    "text": " Like someone will look at that figure and you all are saying, hey, we're the person above the table with the hands on and with medical training.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2896.053,
    "end": 2904.776,
    "text": "But then there's another part that you didn't go into detail on what would be that therapy component or the niche modification component.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2904.796,
    "end": 2907.717,
    "text": "So totally agree that the paper is like an invitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2908.077,
    "end": 2909.978,
    "text": "And that was really to my question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2911.42,
    "end": 2935.152,
    "text": " like we see in other domains and applications of active inference, you reframe something that might've been perceived about like just reward or a normative precision-based approach, like this is the reference range, you're getting your objective function is to enter that reference range, and it's like a red flag if it's not, towards this more,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.076,
    "end": 2946.899,
    "text": " perhaps even customized reduction of uncertainty and the body like predicting its own sensation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2946.919,
    "end": 2950.64,
    "text": "So I just wondered what are the implications?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2951.481,
    "end": 2951.801,
    "text": "Does that,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2953.032,
    "end": 2957.794,
    "text": " play a role in how the medical expert understands the scenario?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.894,
    "end": 2962.096,
    "text": "Does it play a role in the patient's own understanding of what's happening?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2962.136,
    "end": 2972.84,
    "text": "Just how beyond the research predictions and experiments that are being described, how does this translate into a clinical experience?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2976.155,
    "end": 2991.4,
    "text": " So one of the things, it's quite interesting you bringing the concept of nation construction on the other paper that we have in the pipeline where we actually argue that osteopathic care is a kind of a effective inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2993.101,
    "end": 3009.001,
    "text": " you know there's an argument around you know the construction of you know a niche which can be a diet in the case in most adult interactions in clinical practice but it can also go beyond that and be even a triadic kind of relationship for example",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.577,
    "end": 3020.44,
    "text": " when you're treating a baby, where actually it's not a two-way communication between the practitioner and the baby, but it's also with the parents, with the mother.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.82,
    "end": 3030.162,
    "text": "And in fact, you know, the first person you need to bring, you need to synchronize is probably with the mother as well, because, you know, if you kind of treat the baby indirectly, you get there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3030.502,
    "end": 3038.204,
    "text": "So I think that there's a lot of sort of alignment, there's a lot of synchrony to take into account into the therapeutic encounter",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3039.281,
    "end": 3039.444,
    "text": " And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3040.484,
    "end": 3068.332,
    "text": " know arguably the the kind of the development of a robust therapeutic alliance is through that when the two people sort of sharing sharing a common niche but also sharing a you know common kind of you know mental states and predicting in a lot of times without any words what the response of the other person is likely to be so it could be for some people may sort of sound a little bit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3069.552,
    "end": 3088.537,
    "text": " more kind of esoteric but if we put it through a lens of you know active inference in activism and so on sense making uh you're talking about things that are pre-reflective uh you're talking about things that's just happened and uh when um even down the realms of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3089.031,
    "end": 3102.526,
    "text": " at times we hear practitioners or our own experiences, practitioners on kind of body work, then you feel like at times that, you know, the patient seems to be relaxing because you got some relaxation through your own kind of body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3102.566,
    "end": 3103.267,
    "text": "And it's a sort of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.198,
    "end": 3111.083,
    "text": " It could be the esoteric side of things, but also you could think that maybe that demonstrates some form of alignment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3111.243,
    "end": 3117.807,
    "text": "Maybe that demonstrates an element of synchrony that can be done at a more physiological level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3118.828,
    "end": 3132.417,
    "text": "So there's a lot of mileage, in my opinion, in exploring clinical practice, particularly in situations with an element of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.706,
    "end": 3137.177,
    "text": " of complexity to explore it through these lenses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3146.765,
    "end": 3168.414,
    "text": " And also, this is also in line with the most recent theoretical paper just published a few months ago by Antonio Damasio and colleagues, where actually they were looking at the complexity through the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.975,
    "end": 3172.398,
    "text": " the Interoceptive Nervous System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.839,
    "end": 3178.266,
    "text": "So what actually they called for the first time ever Interoceptive Nervous System.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.326,
    "end": 3188.239,
    "text": "So it's a system that includes not only the fact that actually we need to understand what is going on within our body,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.599,
    "end": 3192.764,
    "text": " So the old concept between quotes, the old concept of Craig.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.884,
    "end": 3194.045,
    "text": "So how do you feel?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.526,
    "end": 3205.197,
    "text": "But it also goes into the fact that the body actually interacts with the environment and also that beautiful issue on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.858,
    "end": 3230.811,
    "text": " or neuroscience based on interoception, where actually they try to predict, to say something new in terms of interoception, where the main hypothesis was that the way in which we create interoception, that is the base for a complex clinical condition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.671,
    "end": 3248.884,
    "text": " is not only related to the fact that the different brain areas and therefore the interoceptive nervous system, it's creating the kind of interaction between all the autonomic and non-autonomic areas, but also those areas are important for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.305,
    "end": 3274.827,
    "text": " for decoding what is happening outside the body and therefore through a descending primary and secondary descending mechanism that actually introduce new variables within the system that it allows the system to detect and to understand better the complexity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.447,
    "end": 3290.59,
    "text": " And through this complexity created the appropriate changes that might be helpful for keeping the non-equilibrium steady state and therefore all the concepts in relation to the predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.65,
    "end": 3294.65,
    "text": "So what is the, how we can intercede with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.73,
    "end": 3303.592,
    "text": "Because actually we are using one element that is touch that in a way might be disturbing the system because actually it's using",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.528,
    "end": 3323.44,
    "text": " in particular gentle touch or what is called affective touch is disturbing or interacting with the system and just through those anatomofunctional pathways that actually goes directly to the insula and so through the CT fibers and therefore we are interacting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.441,
    "end": 3340.775,
    "text": " in an ascending way with that specific areas that are including the interoceptive nervous system that actually are one of the parts for emerging the elements that we are talking about now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.495,
    "end": 3349.482,
    "text": " And why it's important as just to underline what George said, which I found very clever and I support that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.642,
    "end": 3368.419,
    "text": "So it's a way of creating a sort of entry point that also in the complex system might intercede with something that is multifactorial within the body that not only includes, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.959,
    "end": 3381.282,
    "text": " pain, the perception of pain and the experience of pain and all the elements that are inside the body, but also it creates the bound with something that is external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.782,
    "end": 3392.404,
    "text": "And bounding with external, it means that actually you are establishing the therapeutic alliance in terms of the dyadic, but also indirectly the triadic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.124,
    "end": 3396.947,
    "text": " condition when actually you treat, for example, a baby or an elderly person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.087,
    "end": 3416.082,
    "text": "So when actually there is someone that might be a parent, that might be the son, the daughter, or legal guardian actually are bringing that person into the clinical encounter and therefore are part of the general treatment session.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.182,
    "end": 3421.626,
    "text": "So I think it's a way by looking at the neuroscience behind the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3422.546,
    "end": 3444.575,
    "text": " the theoretical framework and the practical examples that can be clinically found and can be clinically explored, I think there is a nice way also to intercede with a different lens to understand complex situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.556,
    "end": 3447.537,
    "text": "I would add something to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3452.298,
    "end": 3453.082,
    "text": " Yes, please, Torsten.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3453.979,
    "end": 3465.807,
    "text": " Okay, I would add something to what was said by George, and was that I would even go a step further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.668,
    "end": 3475.473,
    "text": "I mean, we decided to support Luca's work financially because it is part of the psychosomatic ospite in our point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.994,
    "end": 3481.958,
    "text": "But it's not only that we want to interact our palpation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.578,
    "end": 3504.236,
    "text": " in reaction to interception but also to body sensations to arousals to emotions to belief systems and from my point of view in this case the osteopath is less a therapist but more a co-regulator by the interaction between both of them the awareness of the patient to his own stimulus in different levels",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.696,
    "end": 3505.336,
    "text": " will increase.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.817,
    "end": 3511.58,
    "text": "And secondly, from the beginning, osteopathy was interested in interrelationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.22,
    "end": 3517.904,
    "text": "And this means that we are already in our own profession in a way interdisciplinary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.424,
    "end": 3528.73,
    "text": "So it means, for example, that also we could look that peripheral hypoglycemia will lead always to a central hypoglycemia, to a central",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3531.732,
    "end": 3534.392,
    "text": " even so it means you have no more sugar in your brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.753,
    "end": 3547.697,
    "text": "So even if you would touch and you do all your psychological stuff, but by your metabolic system, you create hypoglycemia in your brain, even then, whatever you do, it will not have a big result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.157,
    "end": 3554.339,
    "text": "So as more fragmented areas in the functioning of the patient's health, we can include",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.779,
    "end": 3584.271,
    "text": " in our treatment and this means basically which was in the past not so much dominant and more active patient because in research it will show proactivity is one of the most factors to be healthy and basically in an ospartic treatment the patient is laying passively most of the time in the past so here we have not only looking in research how ospartic treatment can help but even change ospartic treatment in a more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.613,
    "end": 3595.409,
    "text": " postmodern way so that we can help the patient even more with our hands instead what was past treatments done in orthopedic treatment before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.444,
    "end": 3606.551,
    "text": " So actually on that theme of kind of origins and futures of osteopathy, I'll read a comment from the live chat and anyone else can write a chat too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3608.753,
    "end": 3611.315,
    "text": "Good morning, my dear osteopathic brothers and sisters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3611.915,
    "end": 3625.426,
    "text": "I'm an American osteopath and must leave for work now, but wanted to share a history of the Still-Hildreth Hospital in Kirksville, which was an outgrowth of Dr. Still's original concept, wishing to have osteopathic applications to mental health.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3626.127,
    "end": 3639.014,
    "text": " There are still papers, papers by still, which came out of that institution about effects osteopathy had on mental health conditions and early research on osteopathy and mental health from Mel Friedman, who is actually my father.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3639.574,
    "end": 3642.055,
    "text": "So any thoughts on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3642.195,
    "end": 3651.28,
    "text": "And also just keeping in mind the guest stream is kind of a two-way street, people in active inference who are perhaps hearing about osteopathy for the first time and vice versa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3651.74,
    "end": 3652.321,
    "text": "Just what...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3653.161,
    "end": 3682.013,
    "text": " are some of those principles lucas that you mentioned in your presentation informed by osteopathic principles like what are some of those principles and origins and how has it changed because it was very interesting what torsten had addressed yeah so i think an important distinction that we have to make is between american osteopaths and osteopaths mostly around the world because i for myself i'm not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3682.455,
    "end": 3683.216,
    "text": " medical doctor.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3683.436,
    "end": 3693.066,
    "text": "So in the US, the DO is a medical doctor in the osteopathic field.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3693.586,
    "end": 3698.471,
    "text": "So they can treat mental health conditions and psychiatric disorders.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3699.012,
    "end": 3701.034,
    "text": "And it is regulated that they can do this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3701.614,
    "end": 3709.855,
    "text": " So in Germany, for example, I can't treat someone with a major depression because my training was not oriented to allow me to treat that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3710.416,
    "end": 3727.458,
    "text": "So it is important for us to emphasize that we are not treating mental disorders on our own, but that we try to address psychological factors in people with physical conditions that are visiting us quite frequently.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3727.959,
    "end": 3730.739,
    "text": "So I think that is another distinction that I have to make.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3731.426,
    "end": 3737.731,
    "text": " between our colleagues from America and then to the point of the history of osteopathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3738.431,
    "end": 3743.975,
    "text": "We came across a few papers that have argued for an osteopathic psychiatry.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3744.035,
    "end": 3748.939,
    "text": "I think that was involved in this paper a little bit in the earlier times.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3751.429,
    "end": 3757.373,
    "text": " There has been some work done, but the work is, as your father has outlined, quite old.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3757.913,
    "end": 3763.016,
    "text": "So we try to put some new perspectives to this discussion, I think.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3763.837,
    "end": 3771.822,
    "text": "I think one thing, if I may, would be useful to add is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3773.11,
    "end": 3796.945,
    "text": " The origins of Austeropathy with Andrew Taylor Steele and some of his early students, including John Martin Littlejohn, were primarily based around new concepts, concepts of unity, self-regulation that were kind of relatively new in the late 19th century.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3797.662,
    "end": 3802.665,
    "text": " And a lot of the work was sort of one interesting and important concept of conceptual adaptation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3802.885,
    "end": 3811.17,
    "text": "So, you know, enabling people to adapt to their day-to-day activities, to adapt and interact with the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.97,
    "end": 3821.536,
    "text": "Unfortunately, that was a little bit lost over the years and osteopathy and other forms of manual therapy are practically poor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3822.436,
    "end": 3838.472,
    "text": " musculoskeletal physiotherapy became for a long time based on a kind of very biomechanical model of care you know looking primarily at structured musculoskeletal structures the reason for quite a lot of the of the clinical problems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3839.025,
    "end": 3866.788,
    "text": " which in fact led to Hoover and American Osteopathy in 1963 to write a very important paper that not many people actually read or actually acted on, which actually called for osteopathy or osteopathic medicine to be ecological medicine, because it's not about just the theology, it's not about sort of using a pure biomedical model and try to find",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3867.623,
    "end": 3869.164,
    "text": " What is the cause of the problem?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3869.204,
    "end": 3870.285,
    "text": "What is the pathology?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3870.746,
    "end": 3894.146,
    "text": "So I think, you know, the interesting thing over the years, and actually that's, you know, something that actually, you know, personally attracted me a lot to these new ideas, is actually these ideas kind of are very much, you know, in a sense, aligned with those initial ideas of osteopathy, where everything kind of started from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3894.653,
    "end": 3904.883,
    "text": " concept of this sort of adaptationist central concept around the free energy principle, for example, the interactions with the environment central concepts around inactivism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3905.364,
    "end": 3911.41,
    "text": "So really to think about the person in that sort of unique ecological niche and how can we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3911.98,
    "end": 3919.186,
    "text": " as practitioners, I kind of help that person to help with self-regulation, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3919.447,
    "end": 3928.154,
    "text": "Also take into account the knowledge we have these days about what is actually the role of the nervous system, pretty much about in the role of allostasis, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3929.497,
    "end": 3932.298,
    "text": " not so much about sort of the higher order cognitive stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3932.318,
    "end": 3945.824,
    "text": "So I think there's a lot to extract from these frameworks and not necessarily try to rewrite the history of osteopathy or other forms of menotherapy, but actually apply things in a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3946.434,
    "end": 3965.687,
    "text": " in a kind of a critical and serious manner to actually sort of move forward and move away from ideas that actually no longer make that much sense from, for example, practising entirely on a biomechanical model of care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3969.128,
    "end": 3970.969,
    "text": " I like very much what George was saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3971.39,
    "end": 3981.477,
    "text": "And basically it was not only Hoover, it was already little John and McConnell who gone in this way, what Hoover explored more and we are on the way of them basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.937,
    "end": 3993.485,
    "text": "So if we nowadays look also into genetics, which was in the beginning of osteopathy not possible, look into epigenetics, look into lifestyle factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.966,
    "end": 3998.349,
    "text": "And with each factor of the susceptibility of a person to get sick or get health,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.729,
    "end": 4026.666,
    "text": " increases and if we include this with our patient we are on the way of little john mcconnell and who was opened up for us already in the very early times of osteopathy thank you torsten robert and then anyone else yeah i just uh don't want to lose sight of the fact that the paper is about recognizing that even though we may not be trained to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4028.36,
    "end": 4057.951,
    "text": " deal with psychological interventions an awful lot of our patients have psychological problems of some order or another i think something like 40 percent of primary care consultations coexist with mental disturbance so whether we like it or not we're dealing with it and this is a this is a way we can go we're not training people not saying osteopaths should become psycho psychotherapists or psychologists but we're saying",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4058.76,
    "end": 4064.451,
    "text": " If we raise awareness of these issues, it's going to help in our patient care.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4067.492,
    "end": 4069.413,
    "text": " I agree very much what Robert was saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.533,
    "end": 4071.574,
    "text": "And even I would go a step forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.614,
    "end": 4081.257,
    "text": "We can't avoid to interchange with emotional being, with the ANS being, with cognitive levels of a person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.758,
    "end": 4086.759,
    "text": "We only can be a little bit more competent when we treat with our patient in these areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.1,
    "end": 4091.661,
    "text": "And this doesn't mean that we need to be a psychotherapist in treating patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.222,
    "end": 4093.342,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4094.013,
    "end": 4101.88,
    "text": " It's the complex systems perspective that the entity is in the niche and that the mind and body are interrelated, inseparable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4102.08,
    "end": 4110.688,
    "text": "And so any model that for some sort of like credentialing reason chooses to ignore that is going to be operating in peril.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4111.128,
    "end": 4112.229,
    "text": "So how do we...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4113.01,
    "end": 4117.994,
    "text": " recognize the system's complexity, but also the immense amount of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4118.314,
    "end": 4122.658,
    "text": "You know, you could study just the liver and there would be a lot to learn, or just the lungs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4123.078,
    "end": 4130.424,
    "text": "So how do we pull back and actually have a healthy relationship in this very complex setting?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4131.185,
    "end": 4136.569,
    "text": "So here's a sort of fun question, also staying with the anomaly theme.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4137.802,
    "end": 4151.949,
    "text": " I was wondering if throughout your training or experiences had come across any embodied exercises that you think are really good entry points to the predictive body and interoception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.109,
    "end": 4156.612,
    "text": "So like I was thinking of having one's arms in the doorframe and trying to raise them out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4157.292,
    "end": 4159.954,
    "text": "And then when you step out, you know, the arms will raise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4161.178,
    "end": 4184.038,
    "text": " And I was wondering if there was any other experiences that might be that anomaly for someone to start wondering if they were interested to look into more of these approaches that you outline in the paper, rather than the signal processing perception framework or some other non or pre ACT-INF model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4191.854,
    "end": 4198.68,
    "text": " I think the literature is quite dense with examples on how the body influences the mind in these kind of instances.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4199.801,
    "end": 4201.663,
    "text": "For example, going back to Strzok,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4202.647,
    "end": 4217.63,
    "text": " who published a study with the pen in between the teeth showing that people find comics much more funnier if they had a pen between the teeth because this pen activates the zygomaticus major with this primary muscle of laughing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4218.19,
    "end": 4226.572,
    "text": "So there are quite a few examples on how simple manipulations of the body framework influences cognition and emotion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4227.588,
    "end": 4235.783,
    "text": " But I don't have some specific exercises to give to patients that answers the question.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4238.899,
    "end": 4243.503,
    "text": " Well, because also, Daniel, I think it depends from the patient's condition so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4244.043,
    "end": 4257.474,
    "text": "So if we take into account what we said up to now, so it means that each patient has got his or her own clinical specific condition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.034,
    "end": 4268.503,
    "text": "So going into a protocolized, for example, exercise might end up with patient having different reactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.19,
    "end": 4293.399,
    "text": " So, therefore, the use of these frameworks that consider the complexity of the patient within the uniqueness of him or her definitely might help us to have fantasy or to have imagination during the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.144,
    "end": 4316.737,
    "text": " the treatment and adapt the different possibilities that might be exercise and might be treatment procedures and might be techniques and might be approaches into the condition of the patient that is not only the patient, but is the patient within the environment, within his or her environment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4317.297,
    "end": 4333.553,
    "text": " and therefore create the optimal way of what we predict that might be optimal for the patient in order to achieve the outcome that needs to be obtained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4336.038,
    "end": 4360.269,
    "text": " I think there's, in fact, you know, I'm just thinking one exercise that I tend to use, and it's nothing that I developed myself, but it's used by quite a number of practitioners to, you know, to teach patients about pain and about the sensations they feel is, for example, to use the analogy to, you know, the sort of a fist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4360.469,
    "end": 4365.231,
    "text": "So if you ask a patient, for example, in cases of patients with...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4366.263,
    "end": 4378.793,
    "text": " chronic pain, fear of movement, you tend to find that, for example, movement tends to be quite slow and sort of restrictive, not so much because there's a serious limitation in the movement, but because there's a fear of movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4379.373,
    "end": 4386.639,
    "text": "We tend to use, for example, as the patient are looking, if you make a fist and you try to move your wrist, it's going to feel uncomfortable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4387.256,
    "end": 4408.993,
    "text": " that's in a sense how how your neck is trying to move against you resisting if you try to move relax you know it's the sensations are completely different so you can actually create if you think about these exercises that are used by you know quite a lot of musculoskeletal practitioners to actually start introducing the the sort of some",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4409.813,
    "end": 4432.545,
    "text": " some of the the sensations that we want uh that might actually violate their generative model and change things a little bit so that's a good way of you know trying to teach the patients you know this is how you should feel this is how you should move and not so much like trying to move against resistance which happens if you make a fist and try to you know move your wrist",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4434.212,
    "end": 4445.402,
    "text": " In general, I like very much also Francesco's commentary because in osteopathy, we try really to identify individualized approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.922,
    "end": 4454.009,
    "text": "So there was a nice research from Amy Cuddy where she changed body postures and measured the cortisol and testosterone outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4455.831,
    "end": 4461.135,
    "text": "But in new research, it was not confirmed because it was too...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4462.679,
    "end": 4464.84,
    "text": " it was not adapted to a certain person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.18,
    "end": 4474.765,
    "text": "Sometimes it's enough that just a slight extension in two vertebrates can give a person a different kind of breathing experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.145,
    "end": 4484.07,
    "text": "In another person, it could be that just the face could be a little bit released and some muscles, like for example, Lucas was mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4484.43,
    "end": 4491.354,
    "text": "So I think the approaches to a patient in an orthopedic treatment is very individualized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4492.074,
    "end": 4504.245,
    "text": " And it's not a general techniques for everybody, which could help so good as an individualized approaches in relation to different experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.128,
    "end": 4510.23,
    "text": " Thanks for all the awesome and diverse answers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4510.69,
    "end": 4530.181,
    "text": "So I'll ask the question carefully, I guess, but standardized interventions, whether they're measured in milligrams or educational curriculum, lend themselves towards being scientifically tested more easily, like a two group experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4530.281,
    "end": 4533.603,
    "text": "People who do or don't have the diagnosis or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4534.952,
    "end": 4536.376,
    "text": " any other number of situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4536.436,
    "end": 4541.752,
    "text": "And it was really also just highlighted in what Torsten added with this, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4542.972,
    "end": 4569.173,
    "text": " individuated experience and the dyad is unique there's never going to be another one like that in the history of osteopathy with those people in that niche interacting that way so just wondered um what insights from all of your different areas of expertise start to help us address like the specificity of the particulars of an encounter but also know what",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4570.765,
    "end": 4576.882,
    "text": " kinds of things should be available for population level use or on average, are eggs good or bad?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4584.292,
    "end": 4594.396,
    "text": " Yeah, I think this is a really big problem in osteopathy and research, osteopathic research in general, is what kind of control groups are we doing?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4594.796,
    "end": 4603.079,
    "text": "So if we are treating a patient, is mere touch without intention a good control group or no intervention?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4603.599,
    "end": 4606.04,
    "text": "So there are many problems to the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4606.772,
    "end": 4612.935,
    "text": " to researching the person-centered nature of osteopathy, but also the manual nature of osteopathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4613.396,
    "end": 4621.48,
    "text": "And I think Francesco is a good person to speak about this because he recently published a paper on control interventions in osteopathy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4621.76,
    "end": 4623.481,
    "text": "Maybe you want to add something, Francesco.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4625.623,
    "end": 4626.403,
    "text": "Thanks, Lukas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.643,
    "end": 4631.546,
    "text": "So I think this is a very interesting topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.888,
    "end": 4637.32,
    "text": " question, Daniel, for three reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.42,
    "end": 4639.468,
    "text": "So the first one is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4640.959,
    "end": 4647.523,
    "text": " we are still within a drug-based research paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.143,
    "end": 4668.196,
    "text": "Because actually, during the, from 1980s onward, and then with the development of evidence-based medicine, the majority of the research actually was drug-based research, and therefore we can control milligrams, as you said, we can control the type of administration and all the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.716,
    "end": 4675.177,
    "text": " elements that actually created the randomized controlled trial, very controlled, very specific, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.057,
    "end": 4684.359,
    "text": "However, during the last 10 years, all these paradigms actually start to have some creepy things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.419,
    "end": 4686.56,
    "text": "And in which sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4686.62,
    "end": 4693.521,
    "text": "Because actually, it's very far away from the clinical practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4694.401,
    "end": 4700.448,
    "text": " And the clinical practice is based on variability and outliers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4700.669,
    "end": 4708.317,
    "text": "And the variability and outliers are important to understand what are the clinical effects of a specific treatment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.979,
    "end": 4728.934,
    "text": " So indeed, during the last 15 years, this concept of having super rigid randomized control trial, in particular in the intervention group, and therefore in the control group, actually started to change, started to be molded in a way of creating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.915,
    "end": 4734.218,
    "text": " something that is much closer to the reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.398,
    "end": 4738.621,
    "text": "Therefore, they ended up with pragmatic clinical trials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.141,
    "end": 4759.455,
    "text": "And pragmatic clinical trials, those trials actually are closer to the reality in which there is not just one administration in terms of, for example, drug treatment, but actually they are taking into account all the different elements that might influence the effect of the treatment itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4760.035,
    "end": 4776.842,
    "text": " Indeed, when actually we administer, for example, a drug, but then we're looking for long-term effects or long-term outcomes in the intervention group, and intervention group then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.302,
    "end": 4799.412,
    "text": " goes back home and one part of this intervention group is very very happy because they just got a new child, they just won the lottery and all the positive elements, obviously the long-term effects of the drug treatment is definitely better than",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.032,
    "end": 4824.384,
    "text": " the uh the someone instead who for example had lost so what is the the what is the concept underneath that is the concept of the the research is changing and also the methodological elements underneath research are changing now there are pragmatic trials but they're also what they call the benchmarking control trial so there are actually are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4824.804,
    "end": 4839.361,
    "text": " trials that are important for detecting what is happening during the clinical routine life within the hospital and then adding another intervention to the normal routine care",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.901,
    "end": 4843.442,
    "text": " then you see what is the difference between the two pathways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.962,
    "end": 4845.683,
    "text": "So what it's saying by that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.883,
    "end": 4859.707,
    "text": "It's saying that it is true that it's important to control all the variables within a given intervention, but at the same time, if we look at the cause-effect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.347,
    "end": 4863.151,
    "text": " And therefore, efficacy, yes, it's important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.511,
    "end": 4876.988,
    "text": "If we want to look at what is in studies called effectiveness, so the clinical effect of a specific treatment, then what you do, what you specifically do, a specific treatment or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.449,
    "end": 4902.041,
    "text": " 10 grams more or 15 grams left actually doesn't make that difference because of what we are talking here and also because probably those 15 grams are less and probably will have more powerful effects if I'm talking to the patient with the right tone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4902.701,
    "end": 4915.169,
    "text": " and therefore inducing an increased effect based on the interaction, the shared narratives that we are talking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4915.269,
    "end": 4929.118,
    "text": "So in a way it's true, but at the same time the recent evidence are shifting the methodological research concept towards complex intervention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.981,
    "end": 4957.46,
    "text": " for the awesome response and indeed it is mirroring trends in other scientific areas to study targeted perturbations and measuring dynamical systems after perturbation or testing different dynamical models rather than just summary statistic and t-test and then you know rubber stamp that so it is absolutely really interesting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4959.878,
    "end": 4964.26,
    "text": " Does anyone else have any comments or questions or things they'd like to share?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4964.28,
    "end": 4964.7,
    "text": "Please, Robert.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4964.86,
    "end": 4973.084,
    "text": "I mean, there's quite a tradition in the nursing world to look at action research, which is real life and real life interventions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4973.104,
    "end": 4975.005,
    "text": "You know, what happens at the ground level?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4975.065,
    "end": 4976.525,
    "text": "And I think that's really where we are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4977.205,
    "end": 4978.046,
    "text": "That's what we're saying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4978.846,
    "end": 4980.827,
    "text": "You know, what actually happens in the treatment room?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4981.347,
    "end": 4983.888,
    "text": "Not what we think what happens, but actually what happens.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4985.389,
    "end": 4987.73,
    "text": "And this is a conceptual framework that enables that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4989.477,
    "end": 5004.845,
    "text": " So almost within Act-Inf, it'd be like the difference between what we think is going to happen, like, well, if the two comparisons of the two different amounts had this effect on the biomarker, well, then the one that had the better biomarker effect should be used in the clinic, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5005.945,
    "end": 5029.322,
    "text": " so that's like staying within the generative model but then always being open to having new information and being able to have um discernment to know whether it's consistent or inconsistent with our expectations but our expectations for complex systems even people we know very well like they can still surprise you and so um but always keeping that openness to the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5030.183,
    "end": 5035.388,
    "text": " even the tactile, which is something that a lot of other medical modalities don't do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5035.989,
    "end": 5043.957,
    "text": "So maybe the tactile, 5% of the time, it diverts a cohort of patients towards another diagnosis, like the tissue is warm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5045.148,
    "end": 5052.893,
    "text": " but that at the whole population level wouldn't even be statistically significant, but it might be very important for a small subset.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5053.293,
    "end": 5068.323,
    "text": "So it's very interesting about like kind of pointing without dwelling on some of the limitations of the current medical system, which I think most people can agree is not realizing our preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5069.801,
    "end": 5078.178,
    "text": " And then here's actually a science informed way where we can start to look at complex interventions in human systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5081.445,
    "end": 5082.025,
    "text": " Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.285,
    "end": 5090.568,
    "text": "And therefore, we are starting to have also some theories behind that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5091.488,
    "end": 5107.332,
    "text": "There can be a complexity of living system that actually can be also applied into this field, this changing view of the research field that up to now, as we said, was mainly based on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.072,
    "end": 5113.335,
    "text": " was biased towards the pharmaceutical standpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.139,
    "end": 5121.12,
    "text": "Any other thoughts or comments on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5124.451,
    "end": 5137.296,
    "text": " Yeah, this is a very big point Francesco is saying and all his extremely engagement in helping us to get more science is incredibly important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.896,
    "end": 5139.777,
    "text": "Basically to have a little bit balance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5139.817,
    "end": 5147.6,
    "text": "We will never have the full balance because with our treatment, we can't make so much money like a pharma concern can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5152.403,
    "end": 5165.691,
    "text": " But at least we have opportunities for opening doors in a way that is closer to reality and creating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5169.193,
    "end": 5181.536,
    "text": " a way that up to now is the mainstream because actually also the drug-based treatment actually are facing big challenges up to now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.057,
    "end": 5187.358,
    "text": "And the more you go, either you go in ultra precise medicine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5188.078,
    "end": 5197.506,
    "text": " because actually we are all going all the way down and deep into precise medicine, or you need to go on the opposite side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5198.126,
    "end": 5200.388,
    "text": "In the middle, everything is already discovered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5201.208,
    "end": 5211.497,
    "text": "So therefore, there are chances to integrate the two, because there are chances, because actually we are living in a way that actually we need precise medicine,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5213.271,
    "end": 5217.955,
    "text": " But at the same time, we need also complex intervention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.336,
    "end": 5234.829,
    "text": "We need a complex way of looking at the person in a different way, not in a super segmented way, but in a way that actually brings everything together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.642,
    "end": 5251.534,
    "text": " I think another piece of the puzzle was brought up when someone mentioned the early paper about osteopathic approaches as ecological medicine, because in my own research with insect ecology, that was always the question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5251.654,
    "end": 5264.586,
    "text": "Well, you could have the insects in the lab and then you know what age they were and what they ate, but then the temperature and the humidity aren't what they have evolved to experience and you don't know whether they're healthy, but then out in the wild, they're doing interesting stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5265.186,
    "end": 5272.649,
    "text": " in the way that it's meant to happen, but you don't know how old the animal is or you don't know what its physiological condition is or you don't get the measurements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5273.329,
    "end": 5282.713,
    "text": "And so there's a dialogue there between the more controlled laboratory side, which is like kind of precision medicine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5282.733,
    "end": 5287.935,
    "text": "I mean, some people may want to live in a laboratory if that means that they could make more measurements about their body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5288.516,
    "end": 5291.057,
    "text": "And then there's sort of the field ecology",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5292.117,
    "end": 5317.315,
    "text": " natural history angle um so that's very um interesting of how there was like a medical along with a mental health and ecological synthesis happening in a sense through osteopathy that now a lot of different perspectives are helping to combine um typified and lucas's very dense and informative slides",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5321.805,
    "end": 5324.228,
    "text": " Ecological is one of the E's we mentioned.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5326.231,
    "end": 5326.471,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5327.713,
    "end": 5328.414,
    "text": "There are many E's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5329.173,
    "end": 5358.363,
    "text": " and like maybe the term inactive might not come in also it's another heat okay 7e more um but it also it shows how different um ways of describing across fields can prevent their synthesis like again osteopathy might not have used the term inactivism but i mean looking back on it isn't it it's almost it's it's not even it's to say it's definitional it's like an understatement",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5359.682,
    "end": 5373.942,
    "text": " So then there's a lot of latent possibility and then how does that get applied and how does it change the way that the art and the science are carried out, are enacted themselves?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5377.066,
    "end": 5401.52,
    "text": " anyone else would like to ask a question or like what would you say to those who are learning active inference and just hearing about what you've described for the first time or those maybe from the medical or osteopathic community who are learning about active inference for the first time in sort of closing i would say that um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5403.553,
    "end": 5414.196,
    "text": " Active inference provides a way in which we can actually simplify things, you know, rather than making them more complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5414.256,
    "end": 5422.018,
    "text": "I think there's a lot of, you know, people would feel scared, there's another model, and there's another kind of complex thing to look into it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5422.318,
    "end": 5430.201,
    "text": "In fact, if you look at sort of the basic foundations of active inference, is actually things make perfect sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5430.241,
    "end": 5430.801,
    "text": "And in fact,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5432.256,
    "end": 5439.579,
    "text": " you can simplify your interaction with your patient in become a much more effective way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5439.619,
    "end": 5454.566,
    "text": "There's a kind of a, when you get to that point where you know that things are working well, since your internal states are my active states and vice versa, when I can predict things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5455.187,
    "end": 5457.428,
    "text": "So I think you can,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5458.8,
    "end": 5467.546,
    "text": " can help us with that, can also help us to understand, you know, complexity that patients bring to the table.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5468.386,
    "end": 5488.6,
    "text": "And, you know, the paper is about mental health and osteopathy, and, you know, lots of people would argue osteopathy is primarily focused on musculoskeletal care, but as we've been talking about, you know, most musculoskeletal care and musculoskeletal conditions have an element of mental health.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5489.9,
    "end": 5499.887,
    "text": " In a sense, the patient that can't get out, can't do their normal day-to-day activities when their world stops making sense is likely to become depressed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5500.328,
    "end": 5506.913,
    "text": "So if you, by working on their musculoskeletal problem, make them feel better,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5507.927,
    "end": 5521.837,
    "text": " indirectly or even directly you are treating their mental health conditions so I think can help us to see the bigger picture rather than simply the dysfunction in the body or the brain in fact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5523.418,
    "end": 5536.287,
    "text": "I definitely echo that with George and I think what I've learned and I've been working in this field for 30 years is this is giving us a handle on some of the uncertainty that goes on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5537.512,
    "end": 5565.143,
    "text": " as a practitioner a lot of my students get really scared about how to deal with unpredictable things that occur in practice and it can be you know pretty challenging because there's a lot of complexity and i think the big take-home message i'd say is you don't have to be the expert on your patient this gives us the handle yeah i mean you have a hard enough time being an expert on yourself",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5566.055,
    "end": 5569.997,
    "text": " But to be an expert on another human being is pretty damn difficult.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5570.738,
    "end": 5572.539,
    "text": "This gives us a model framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5574.3,
    "end": 5590.19,
    "text": "It's some way it's reinventing things that may other people have said in the past, but it's it's starting to bring it all together into a package that says, right, there's a ecological niche or you could say shared narrative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5590.717,
    "end": 5603.244,
    "text": " There's a way of talking to a patient that you don't have to tell them what to do, that we can kind of work out, we can facilitate healing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5603.824,
    "end": 5607.446,
    "text": "And that actually is what initially got me into osteopathy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5610.568,
    "end": 5612.949,
    "text": "I think this is a very interesting point, Robert.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5613.822,
    "end": 5623.007,
    "text": " And it resonates with a thing that is an osteopathic principle that we try to activate the self-healing powers of patients.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5623.087,
    "end": 5633.353,
    "text": "And this implies for me that we are not the therapist who brings up healing in the patient, but the patient in itself is generating the healing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5633.82,
    "end": 5645.21,
    "text": " And therefore, we are not the specialists who have to understand the complexity of the patient, but to be there as a counterpart and evolve with the patient to generate a more healthy life.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5651.241,
    "end": 5679.257,
    "text": " can't help but remark on robert what you said there about not having to be an expert um it reminded me of how like the arm doesn't have to be a theoretical coffee cup subject matter expert it has to implement a strategy of which a broad range are going to be possible and none of them can be pre-stated but it has to implement a strategy to get the coffee cup and so it's just a very um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5681.812,
    "end": 5708.731,
    "text": " interesting way to tie together the transdisciplinarity with also one of the threads of inactivism and ecological psychology and active inference which is that we're doing and thinking and doing are together rather than waiting to be subject matters experts on everything before we are able to act in a complex niche that includes us as a part but we're not going to get the whole picture on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5712.981,
    "end": 5716.103,
    "text": " Well, this was a very fun discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5716.163,
    "end": 5723.169,
    "text": "It sounds like you all are on a very cool line of research and we really appreciate it in the lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5723.629,
    "end": 5728.473,
    "text": "I hope that you'll come back and discuss more as more research occurs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5730.254,
    "end": 5730.535,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5731.175,
    "end": 5731.936,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5732.496,
    "end": 5733.617,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5733.777,
    "end": 5734.257,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5734.778,
    "end": 5735.018,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5735.698,
    "end": 5736.199,
    "text": "Have a good day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5736.339,
    "end": 5736.859,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5737.82,
    "end": 5738.18,
    "text": "You too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5738.2,
    "end": 5738.881,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5739.041,
    "end": 5739.401,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5739.421,
    "end": 5740.222,
    "text": "See you soon.",
    "speaker": "SPEAKER_02"
  }
]