[
  {
    "start": 2.579,
    "end": 3.26,
    "text": " All right, welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.36,
    "end": 4.021,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4.642,
    "end": 10.429,
    "text": "It's August 15th, 23, and we're in cohort four in our first discussion of chapter five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.71,
    "end": 14.414,
    "text": "So soon we will screen share.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 15.215,
    "end": 22.584,
    "text": "But first, any remarks that anybody wants to make on chapter five?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 23.725,
    "end": 27.81,
    "text": "Just anything that stayed with them after reading it or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.068,
    "end": 56.548,
    "text": " feelings that they had or anything else about chapter five um I will say um I found this to convert and conversely to chapter four being rather mathematically dense this one is a little bit more um neurobiologically dense at least for those who maybe are new to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 57.136,
    "end": 60.339,
    "text": " thinking about the relationship between this and areas of the brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 60.479,
    "end": 73.251,
    "text": "But I did appreciate in this chapter, there was much more on precision, which we didn't get too much before, even though it was brought up many a time in preceding chapters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 73.351,
    "end": 84.521,
    "text": "And I really appreciated the relationship that was made between different forms of precision and different neurotransmitters and neuromodulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 84.601,
    "end": 85.742,
    "text": "I found that to be very",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 86.11,
    "end": 99.626,
    "text": " interesting and helpful and maybe kind of reinforcing the idea of like, they're not just probability distributions here, but also precision of each or like confidence in each probability distribution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 101.188,
    "end": 103.651,
    "text": "My big takeaway from this chapter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 107.616,
    "end": 107.936,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 108.357,
    "end": 108.797,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.019,
    "end": 112.742,
    "text": "Anyone else just any thoughts on five?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.929,
    "end": 143.895,
    "text": " Any other thoughts or any question that somebody wants to lead with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.035,
    "end": 147.74,
    "text": "Or we can just explore the chapter and look at some written questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.337,
    "end": 167.164,
    "text": "I did want to ask what everyone makes of the relationship",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 167.836,
    "end": 171.319,
    "text": " Justin Delacruz- made here, I mean in preceding chapters we're talking a lot about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 172.24,
    "end": 189.496,
    "text": "Justin Delacruz- You know kind of the differences between viewing variables as categorical versus continuous and it's a big kind of bifurcation throughout many of these chapters like we have continuous models versus you know palm dps and.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 190.417,
    "end": 195.362,
    "text": "Justin Delacruz- different ways of looking at things, but at one point in this chapter they point to the idea that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 195.967,
    "end": 225.535,
    "text": " There's actually a big relationship, a connection between the two that maybe what's going on in the upper levels of say the brain cortical regions and so on is that they're working with categorical variables, but in a way it's not simply categorical variables, but rather these are like looking at discrete trajectories that the continuous variables could take.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 226.122,
    "end": 255.488,
    "text": " um that was a nice way of maybe putting making some kind of thread between the two ways of looking variables that is there's still a continuous aspect within the categorical states um it's just it's looking at it as a discrete trajectory didn't know if anyone made anything that found it to be useful for anything or anything they're working cool thanks um darius then anyone else",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 256.818,
    "end": 264.47,
    "text": " Yeah, it's not so much a comment on the previous point about discrete versus continuous variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 265.091,
    "end": 279.214,
    "text": "I wanted to ask, really, a question more concerned with the mechanisms behind prediction coding, at least as it's embodied in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.785,
    "end": 303.885,
    "text": " so you I can't understand this idea of sort of the shuttling up of prediction errors and the shuttling down of expectations I guess Daniel my question is we kind of just take this idea that prediction errors arise for granted um something I've been trying to kind of wrap my head around is to what degree is that a kind of just um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.131,
    "end": 326.683,
    "text": " immediate mismatch between the priors at one layer and the incoming sense data or is it that those there's some Bayesian inference required to even compute the prediction error so you know I have a prior X I compute variable base to work out the probability of my prior given Y",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 327.98,
    "end": 333.207,
    "text": " Is that, in a sense, that distinction between the prior and the posterior, is that what is constituting surprise?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 333.968,
    "end": 342.239,
    "text": "Or is it just the pure sense data coming up the chain, which then is discordant with my prior X, if any of that makes sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.146,
    "end": 347.406,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.432,
    "end": 365.057,
    "text": " what a lot of the a lot of angles of this just first very briefly yeah this uh hierarchical hybrid type of model where the higher levels of the system are discretized",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.037,
    "end": 393.475,
    "text": " and then the lower levels are kind of like where the rubber hits the road is being more continuous that's a motif that comes up like again and again for example in ryan smith's at all's uh work live stream 46 active inference does not contradict folk psychology this is a common motif and a big reason is that counterfactuals are not really so clear in a continuous setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.742,
    "end": 401.514,
    "text": " Like if there's three discrete choices, you can really quickly talk about the tree of all choices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.476,
    "end": 416.699,
    "text": "But if it's just like a cone of options, you could take like an infinite amount of paths because technically even paths that are only one infinitesimal apart in the continuous space are still distinct trajectories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.5,
    "end": 421.386,
    "text": "So in the continuous time, you don't really get a kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.366,
    "end": 446.8,
    "text": " explicit planning or explicit counterfactual and so in order to deal with cognitive decisions which which often are um categorical or discrete or deal with like explicit symbolic actuals then you need some kind of discretization and yes the good news is that they work well together and that gets revisited in chapter five",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.965,
    "end": 474.795,
    "text": " in practice when all of the um difference neural models are going to get brought together and shown that there's no issue with the continuous uh model here and the discrete model up here and then also comes back in chapter eight okay about mechanisms of predictive coding the brain well it's interesting to look at the first words in this um section",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.513,
    "end": 506.098,
    "text": " chapter four gave us a lot of general information about variational inference about generative models um essentially following from free energy principle in this chapter we focus on the process theories which are are explicitly about a system of interest so whereas a principle can't be falsified or not it's just it's it's something that is um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.838,
    "end": 518.834,
    "text": " in the realm of decisions that you take towards modeling, process theories are more in line with scientific hypotheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.894,
    "end": 522.258,
    "text": "They're actually like kind of living and dying with empirical evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.16,
    "end": 532.592,
    "text": "But the amount of empirical evidence for any given statistical model of brain has nothing to do with whether the principle is valid or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.673,
    "end": 545.105,
    "text": " Now, that doesn't mean it obviously it's good when we see empirical support for process theories under the principle, but there's no piece of evidence that could be found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.666,
    "end": 554.354,
    "text": "I mean, maybe this is an overstatement that would validate a principle because principles aren't validated by evidence, but nor are they rejected by evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.035,
    "end": 560.52,
    "text": "However, it's super interesting to connect them to specific systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 561.175,
    "end": 589.528,
    "text": " going to be applying generative models to the brain bayesian brain plus action and one of the kinds of models but but not the only kind of generative model that exists for the brain is like the hierarchical predictive coding architecture and so in that architecture um which arose from video compression but then was later found to capture a lot of biological phenomena",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.508,
    "end": 600.025,
    "text": " there's an alternating stack of error units and kind of estimator units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.966,
    "end": 611.283,
    "text": "So that the different levels of estimator units are sending ascending error signals and descending predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.805,
    "end": 617.052,
    "text": "So Darius, you're asking, is that mismatch",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.112,
    "end": 647.038,
    "text": " immediate or is it computed through a bayesian update i mean is that the question yes basically well the trivial deflationary answer is bayesian updates happen in bayesian statistics so if you want to make a statistical model that calculates an exact mismatch or if you want to have it do bayesian updating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.233,
    "end": 671.912,
    "text": " that's about the map not the territory so we're already lifted away from what the system's already doing um in this chapter in the motor unit here it is just a direct mismatch descending predictions of the of the um mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.478,
    "end": 700.279,
    "text": " incoming proprioception and it's just a simple differential but that simple but there's no reason why you couldn't make it slightly different um like you could have i mean you you could do anything with the legos that doesn't mean it would be more effective or or give unique explanations or predictions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.58,
    "end": 711.172,
    "text": " but in its simplest form, which is embodied here, it is just a differential, denominated in units of the measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.157,
    "end": 717.599,
    "text": "Could you do a Bayesian update?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.601,
    "end": 724.647,
    "text": "I mean, could this variable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.495,
    "end": 738.222,
    "text": " what would that do or what would we get by having this do a Bayesian update?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.242,
    "end": 755.58,
    "text": "I mean, I sense the difference between the two models would be one, you have predictions coming down the stream and you get the mismatch coming from what the higher levels are expecting and it's kind of meeting at this point where the prediction error is occurring.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.02,
    "end": 760.725,
    "text": "The other one is that the prediction occurring is just happening within a level where there is a prior",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 761.768,
    "end": 768.857,
    "text": " That prior is then getting updated, given evidence, and there's going to be a mismatch between the posterior and the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 769.377,
    "end": 775.184,
    "text": "So that's all happening within the level, the prior of the level and the posterior of the level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 775.705,
    "end": 782.914,
    "text": "Whereas the other way of thinking about it is the kind of prior of a higher level, the proximate level, and that's shuttling down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.114,
    "end": 788.08,
    "text": "You get prediction error shuttling up, but the kind of level where it's all happening is just a meeting point under that model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.072,
    "end": 814.759,
    "text": " yeah i i see what you're saying so like if if this were instead of just a simple simple differential if this were like a common filter so it had its own inertia and it was get it was doing its it was getting input and then it was doing some like filtering just like common filter and then it was sending some signal back up yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.925,
    "end": 817.547,
    "text": " there's an infinite amount of model architectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.728,
    "end": 829.617,
    "text": "You could compose it however you want in principle, and no piece of evidence can support or reject the in principle construction or composition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.718,
    "end": 832.94,
    "text": "So there are definitely some interesting properties of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.06,
    "end": 835.702,
    "text": "And then this is where we get to the process theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.463,
    "end": 844.83,
    "text": "So then we look at specific measurements or cognitive or behavioral phenomena in biological systems, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.333,
    "end": 864.827,
    "text": " and then we seek to compose something that um captures some of the phenomena that we want to capture recognizing that maps and territories uh are not the same thing and then you have a whole portfolio of models and you compare them in terms of their um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.043,
    "end": 879.295,
    "text": " accuracy, explainability, adequacy, all of these standard statistical modeling methods, then you write the paper with all the compared models and you publish the code, then other people continue developing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.335,
    "end": 885.881,
    "text": "So that's kind of more normal science than it can sometimes seem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.922,
    "end": 890.945,
    "text": "But the earlier chapters talked a lot about what could be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.265,
    "end": 894.308,
    "text": "I mean, and other literature goes beyond that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 895.216,
    "end": 897.258,
    "text": " And then they're not saying this is how it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.298,
    "end": 907.649,
    "text": "It's not the final word on process theories for active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.53,
    "end": 914.397,
    "text": "It's simply the interpretation consistent with available evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.417,
    "end": 924.227,
    "text": "So they're just saying, here's one model architecture that we're using for unique explanations and predictions in these different neural systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.186,
    "end": 951.43,
    "text": " now those specific model architectures are at the mercy of data like if someone said I think these three factors contribute to this health outcome that's a hypothesis and then someone's good thing I oh no I think it's just these two and someone else says I think there's a fourth factor those are all going to be compared just like regular scientific modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.452,
    "end": 978.362,
    "text": " whereas none of those discussions are going to be like well the the three-factor model doesn't fit the health condition so linear regressions are incorrect that's like a category error but now in chapter five we've kind of crossed the river from the general high road low road to now I guess I don't know specific cars on the high road and the low road or something like that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.013,
    "end": 990.248,
    "text": " So this gives us a very different like flavor and deployment of active inference because we're so directly talking about process theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 992.332,
    "end": 995.557,
    "text": "And these are the ones that are in contact with the empirical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.851,
    "end": 1007.134,
    "text": "Any other thoughts or questions on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.929,
    "end": 1057.692,
    "text": " okay well chapter five is going to um go through three neural systems from the mammalian nervous system and in the end it's going to be kind of a frontal cortex a midbrain region",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1058.853,
    "end": 1088.86,
    "text": " and the spinal cord region and the chapter is going to introduce these three different models which essentially um cover some connected though distinct cognitive phenomena and those three systems are going to be considered separately and then it all gets built up to figure 5.5",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.177,
    "end": 1096.844,
    "text": " which composes these three systems and starts getting you towards that whole iguana.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.785,
    "end": 1105.772,
    "text": "So this is like how functional composition for these kinds of generative models works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.013,
    "end": 1118.003,
    "text": "We're not gonna go into the whole category theory elements of compositionality here, but it's just encouraging to know that the generative models that somebody makes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.742,
    "end": 1126.269,
    "text": " are able to be synthesized and play nicely together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.69,
    "end": 1132.916,
    "text": "So you could also compose one of the brain, and then you could compose one of a computer, and then that would be your human-computer interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.976,
    "end": 1136.98,
    "text": "Or you could have two humans, and then that would be your communication system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.421,
    "end": 1148.091,
    "text": "So that kind of model compositionality is a very nice feature that Chapter 5 makes kind of an understated argument in support of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1150.838,
    "end": 1177.707,
    "text": " highly okay 5.2 microcircuits and messages any any overall thoughts or anyone want to like give a summary on what they read or what they were left with from this section um just a comment and this kind of follows from something we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1178.125,
    "end": 1204.74,
    "text": " briefly discussed last week in chapter four in one of the meetings, but I found it very interesting, the idea that they're kind of like asymmetrical frequencies implied in this 5.2 section, that you can have nonlinear functions in the lower level, computing errors related to incoming sensory information versus a prediction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1205.075,
    "end": 1224.146,
    "text": " And that's set up in a narrow imaging that seems to be commonly associated with like a gamma band frequency versus the descending predictions that are made, which tend to be at like a slower rate, like somewhere around theta, I suppose.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1224.988,
    "end": 1230.677,
    "text": "And so it's just, it felt like this was giving a little bit more concreteness to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1231.028,
    "end": 1252.446,
    "text": " predictive coding and saying like there are differences in frequencies there are various functions or differences here it's not as simple as um taking a simple vector of the predictions from the upper layer and the sensory information like and just doing some simple subtraction right but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1253.135,
    "end": 1255.08,
    "text": " of the actual minus the predicted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1255.14,
    "end": 1263.921,
    "text": "It's rather that there's different speeds of information movement here and different components, different parts, and different ways you could potentially model it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1265.825,
    "end": 1290.246,
    "text": " awesome yeah and one short note i'll add i'll add there and bring in to the notes um the reactive message passing paradigm which i hope we'll hear more about from dimitri and bert in the symposium um these are computational implementations where different nodes in the graph can update at different frequencies so it's perfectly amenable to that terry's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.795,
    "end": 1302.936,
    "text": " yes i mean it's um it's in this section so it's page 87 yes yeah you were just there um if you go down a little bit yeah this is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.996,
    "end": 1306.038,
    "text": " Is that where it is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1307.1,
    "end": 1310.383,
    "text": "It's above the middle schematic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1310.684,
    "end": 1311.084,
    "text": "Oh, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.144,
    "end": 1311.464,
    "text": "Perfect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.605,
    "end": 1327.443,
    "text": "So if you just leave it there, I think this is exactly what I was talking about, which is it says here in the bit sort of the middle part of the bottom paragraph, you send the output from layer three, superficial pyramidal, pyramidal, blah, blah, blah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1327.783,
    "end": 1331.387,
    "text": "So that layer is shooting prediction error up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1331.367,
    "end": 1340.197,
    "text": " then you get the descending input represents a prediction from the higher level presumably, while descending output is a prediction for the lower level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1341.339,
    "end": 1357.678,
    "text": "So I think that is kind of maybe worth unpacking because it's, I mean, there seems to be a lot going on and a lot of predictions going down and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1357.844,
    "end": 1385.083,
    "text": " prediction error going up so it would be good just to get some clarity on exactly where all this is happening and you know what layers we're exactly talking about here yeah yeah good good point there's a few things so first I'm gonna I'll bring in one one blog post that kind of contextualizes like why are we focusing on this cortical architecture at all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1385.131,
    "end": 1395.384,
    "text": " Jeff Hawkins has a book and I guess some startup or something related to this cortical architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.025,
    "end": 1412.826,
    "text": "So a lot of people have, whether they've looked at the gross neuroanatomy or they've looked more into the finer scale neuroanatomy, a lot of people have centered on the cortical regions of the brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.806,
    "end": 1426.58,
    "text": " which it's in the mammalian frontal part of the brain, and it's the part that's wrinkly and on the outside, that that type of tissue organization supports different cognitive phenomena that people are interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.6,
    "end": 1441.395,
    "text": "Of course, not to say that other regions of the brain are not also doing different cognitive phenomena, but that for certain kinds of cognition, understanding the connections within and across the stereotypical units of the cortex called columns,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.375,
    "end": 1469.475,
    "text": " this has been a super active area of research now a really important note is that while there are six layers so-called six layers in this in the cortex these six layers are histologically defined basically so they're defined on tissue properties like what you can see out of the microscope and like gene expression things like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.455,
    "end": 1492.324,
    "text": " this is not a six layer sandwich with prediction error prediction error six times so this is not a six level hierarchical model this is actually a but now this does have a hierarchical modeling but if you look at the subscripts or the superscripts we see i and i plus one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.097,
    "end": 1503.37,
    "text": " So actually these six histological layers together are composing like kind of a single multi-scale jump.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.451,
    "end": 1521.653,
    "text": "And then the idea is that across cortical units, because they also signal laterally, not just within the column, higher nested models could be constructed cognitively, but this is not like a six layer nested model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.24,
    "end": 1528.867,
    "text": " it just happens to be the case that this tissue has these six laminar histological layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.43,
    "end": 1531.65,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.453,
    "end": 1541.5,
    "text": "So the layers with numerals, these are just anatomically defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1541.6,
    "end": 1545.044,
    "text": "These are not statistically defined at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.125,
    "end": 1549.108,
    "text": "And on the left,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.173,
    "end": 1573.611,
    "text": " the anatomy of this column stereotypical column is shown and each of these nodes represents like a cell population so not necessarily just a single cell but perhaps like a group of cells that have some similarities and like the spdp ssii these are like different cell populations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.367,
    "end": 1597.776,
    "text": " and this on the left is showing their empirical anatomical connections that's not to say that's all of their relevant connections just like there's a subway map and then also there's footpath so there's bioelectricity there's neurohormones there's a lot more in play but this is just the wiring associated with these cell populations okay um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.262,
    "end": 1612.898,
    "text": " Now, as common in computational neuroscience, a given single cell or population of cells is going to be associated with some variable on a statistical model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.918,
    "end": 1618.964,
    "text": "And here we basically have two main letters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1619.925,
    "end": 1621.527,
    "text": "So first the tilde means through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.788,
    "end": 1626.092,
    "text": "The two main letters here are the mu and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.473,
    "end": 1640.506,
    "text": " And the, um, the E the mu is like the mean estimate and the E is, um, the error signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1648.414,
    "end": 1653.379,
    "text": "Um, I'm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.329,
    "end": 1665.161,
    "text": " I'm a little bit not sure why G is being discussed here rather than Mu.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.401,
    "end": 1669.146,
    "text": "Ali, do you have a thought on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.333,
    "end": 1683.045,
    "text": "Well, yeah, actually, I guess that's because you see, based on some framework,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1684.072,
    "end": 1701.895,
    "text": " You see, all the brain's needs or the way that the signals need to be passed through this bidirectional path, they don't need to be satisfied all at once.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1701.975,
    "end": 1712.509,
    "text": "So obviously they're prioritized by a decision-making triangle in which the immediate current needs",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1712.489,
    "end": 1730.948,
    "text": " or in other words, the residual prediction errors, they converge on the, as Holmes described in his book, periaqueductal gray, and they're ranked in relation to the current needs and opportunities.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1731.749,
    "end": 1740.538,
    "text": "And this opportunity is manifested in the form of a kind of two-dimensional saliency map.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1740.89,
    "end": 1742.693,
    "text": " in the superior colliculi.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1743.034,
    "end": 1766.273,
    "text": "So this prioritization triggers a kind of conditioned action programs, which in turn unfolds in expected context over a kind of deep hierarchy of predictions, or in other words, the generative model of the forebrain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1767.164,
    "end": 1778.697,
    "text": " So these actions, uh, they're generated by, uh, prioritize, uh, affects, uh, that are generalized, uh, that are generated, uh, by, uh, prioritize ethics.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1778.717,
    "end": 1781.159,
    "text": "They're somehow voluntary.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1781.9,
    "end": 1793.813,
    "text": "Uh, in other words, they're subject to the immediate, uh, here and now choices, rather, uh, kind of pre-established programs or pre-established algorithms.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1795.058,
    "end": 1818.72,
    "text": " And, um, on the other hand, these choices are, uh, kind of felt in, uh, if we want to talk about the higher order, um, higher order elements of the brain, uh, they're kind of felt in the extra receptive, uh, consciousness, which, uh, again, contextualizes this kind of affect, uh, and, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1819.797,
    "end": 1826.564,
    "text": " They're made on the basis of this fluctuating precision weighting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1827.265,
    "end": 1840.938,
    "text": "In other words, arousal, modulation, and postsynaptic gain of the incoming error signals that are, on the other hand, rendered salient by these prioritized needs.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1841.579,
    "end": 1845.703,
    "text": "And they're also buffered in working memory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1845.953,
    "end": 1870.273,
    "text": " with the aim of minimizing uncertainty or maximizing confidence, which also correlates with the current prediction as to how that particular need or particular desire to minimize the prediction error needs to be met.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1871.063,
    "end": 1894.253,
    "text": " Briefly, what this amounts to is a bit unsettling, which says that the higher order elements of the brain or the consciousness would only be required to mediate mismatches between the internal and external states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1894.233,
    "end": 1903.125,
    "text": " And the more adaptively and predictively reliable our model becomes, the more our behavior will become automated.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1904.527,
    "end": 1908.372,
    "text": "In other words, operating below the level of conscious experience.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1909.013,
    "end": 1916.123,
    "text": "So, yeah, I guess that balance between the",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1916.592,
    "end": 1927.263,
    "text": " I mean, the precision making of the G and the E comes from, or at least can be explained from Solm's framework in this way.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1933.669,
    "end": 1934.05,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1942.338,
    "end": 1945.401,
    "text": "But there's no G in this figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.516,
    "end": 1960.453,
    "text": " Well, here's G. Here's the full descending G. So just like the knee bones connected to the leg bone and all of that, ascending and descending are relative to obviously which node we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1961.142,
    "end": 1976.245,
    "text": " So the ultimate descending, um, prediction again in a, in a, a standing person, the ultimate descending prediction is gonna be like the, the main big output of this model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.507,
    "end": 1989.225,
    "text": "And that's, what's going to, um, uh, it's not shown here, but it's, it's what is the, the full output of this whole column is this G.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.006,
    "end": 2005.004,
    "text": " I mean, there's so many.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.886,
    "end": 2006.747,
    "text": "Oh yeah, Ali, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.733,
    "end": 2012.158,
    "text": "I just wanted to add another",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2012.392,
    "end": 2017.577,
    "text": " point here, which you see these kinds of errors.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2018.217,
    "end": 2025.163,
    "text": "Well, the word error can somehow connote negative needs.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2026.044,
    "end": 2034.432,
    "text": "I believe in the free energy principle framework or active inference framework, or at least Mark Soms interpretation of it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2035.633,
    "end": 2040.357,
    "text": "That's exactly what our consciousness feeds on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2040.674,
    "end": 2065.5,
    "text": " so um in other words uh the the surprisal uh i mean uh the consciousness as i said is only needed uh i mean roughly speaking in situations where a surprisal needs to be minimized uh if no surprise though there would be not much need for uh consciousness or",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2065.666,
    "end": 2075.879,
    "text": " to put it in a different terms, consciousness is a kind of process that seeks to somehow overcome itself.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2076.68,
    "end": 2087.573,
    "text": "So these kinds of error are essential for any higher order activity of the brain,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2088.211,
    "end": 2107.671,
    "text": " Amit Singer- Be it I mean consciousness decision making or any kind of higher order activity, so it would never be exactly equated to zero because that would basically mean to go unconscious and to not have any higher order activity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2107.651,
    "end": 2109.173,
    "text": " in the brain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2109.473,
    "end": 2123.811,
    "text": "So this also maps onto Anil Seth's theory of consciousness as a kind of process that seeks to minimize the surprisal.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2125.973,
    "end": 2127.315,
    "text": "Yeah, also error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.918,
    "end": 2135.785,
    "text": "Yeah, like you said, error can seem like it's a bad thing, but it's like a set point and half the time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.743,
    "end": 2163.308,
    "text": " your error is going to be well in a calibrated system half the time the error is positive and half the time the error is negative if you're spending more time uh if 90 of the time your estimates are too high in a Gaussian world then that would be a signal to update um there's a lot more detail to go into with the exact um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.756,
    "end": 2184.385,
    "text": " mechanics here um including the the difference between the middle version and then the version on the right which is more connected with the notation that we saw from the pomdp um but this is kind of like a um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.043,
    "end": 2211.705,
    "text": " it's like I have for some reason I'm thinking of a fancy iced coffee percolator with something is coming in and this is like a percolation mechanism and there's a there's a descending from I plus one that's the G here prediction from the higher level and then there's the um ascending",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.17,
    "end": 2230.065,
    "text": " uh differential this isn't the raw signal data coming in this is already the differential coming up and then those are able to meet through a statistical mechanism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2231.513,
    "end": 2259.208,
    "text": " that also recapitulates but but not exactly I mean it's not like it's this five and three it's it's it's not exactly intended to to be but this is the result of the this is a falsifiable process theory that then somebody can explore like well what statistically happens when this when you transiently suppress this exact connection and then the process of model building continues Darius",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2260.083,
    "end": 2264.369,
    "text": " I asked whether the I in this, um, is that referring to the tilde?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2264.389,
    "end": 2276.526,
    "text": "Is it referring to time where I plus one is, uh, future or past predictions and whatever, or is it actual, is it part of, is it relating to the level of the hierarchy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2277.067,
    "end": 2277.468,
    "text": "Correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.349,
    "end": 2280.853,
    "text": "I is the Ith level of the hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2281.173,
    "end": 2282.895,
    "text": "I plus one is a higher level of the hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.016,
    "end": 2284.598,
    "text": "Tilda means through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.618,
    "end": 2288.183,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.504,
    "end": 2315.622,
    "text": " now they're going to abstract a little bit from this six layer showing all the nodes so here we still have one two three four five six with figure five or I mean uh with a uh layer four um being shown now it's being clarified how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.964,
    "end": 2340.985,
    "text": " nothing's falling in my room now it's um being clarified how here we have I minus one I and I plus one so these are three cortical columns that are next to each other and now those three cortical columns are able to actually instantiate a three-layer nested model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.812,
    "end": 2367.841,
    "text": " So it's almost like we get the vertical stacking through horizontal concatenation or composition where the outputs of one column can be errors like here from I. And also notice that I, that they're not bound within a column.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.802,
    "end": 2369.883,
    "text": "Here's I minus one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.385,
    "end": 2373.047,
    "text": "And then the error unit of I.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.715,
    "end": 2402.19,
    "text": " then the mean and the error units of i and then the error units of i plus one and then the highest nested layer on the right um which is uh only sending descending predictions and getting the highest level ascending predictions uh Daniel mm-hmm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.727,
    "end": 2412.741,
    "text": " Yeah, I'm just a bit lost with what you just said in terms of what I, I minus one and I plus one mean here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2412.881,
    "end": 2425.399,
    "text": "So for me, that was, you know, three different time steps within the tilde, you know, big vector of states and not, you know, communication between different columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.742,
    "end": 2431.688,
    "text": "Yeah, the I, the superscript is not time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2432.562,
    "end": 2459.245,
    "text": " subscript is used for time but here this is referring to three nested levels so let's just say this cortical column we're we're guessing the hundreds place this one with the tens place and this were the ones place so together this is a three layer nested model that's um doing predictive processing on a three digit number but time is not shown here it's just saying tilde it's all happening through time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.95,
    "end": 2465.037,
    "text": " and here the I superscripts are related to the level of the hierarchical model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2470.404,
    "end": 2480.858,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.878,
    "end": 2481.258,
    "text": "Darius?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.122,
    "end": 2486.565,
    "text": "Sorry, I don't know why it keeps going into clapping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.115,
    "end": 2488.996,
    "text": " I do mean to clap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2489.136,
    "end": 2490.598,
    "text": "Everyone's making excellent contributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2490.818,
    "end": 2499.969,
    "text": "So just to summarize, it seems like there's hierarchy both within and across.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.87,
    "end": 2514.366,
    "text": "So if you go back up to that, so the way you spoke of that before is there's a three layered nested hierarchy, but we also have superficial and deep down the vertical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2515.667,
    "end": 2516.248,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.022,
    "end": 2540.852,
    "text": " what I mean it's a very general question but why is this computationally efficient to have both vertical and horizontal hierarchies why can't we just shuttle predictions and prediction error across one dimension yeah well as stated this though it has six tissue layers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2541.608,
    "end": 2571.092,
    "text": " is really like is this is like a minimal multi-scale model um you could make a model you could make a um predictive processing hierarchy that's like a skyscraper and just simply has three on top but it just turns out that this is actually capturing the structure of the brain so i guess what i mean is we what do we what's what's gained",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.325,
    "end": 2574.148,
    "text": " by, you know, it makes complete sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2574.168,
    "end": 2581.037,
    "text": "I mean, whether it's vertical or horizontal, I think is a moot point because it's just, you know, it's just way of, I guess, picturing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2581.637,
    "end": 2586.623,
    "text": "But what's gained by having two dimensions rather than one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2586.663,
    "end": 2594.633,
    "text": "So what I mean by that is what is the function of the verticality, the deep and superficial verticality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2594.782,
    "end": 2620.519,
    "text": " if ascending and descending predictions is compensated for or counted for by the horizontal axis in this picture in this diagram yeah one answer is that the the the histological um verticality let's just say the fact that there's multiple layers of tissue gives you a really nice packet or motif",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.651,
    "end": 2628.041,
    "text": " that has both the units that you need, the mu and the E. So it has the two pieces that you need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.642,
    "end": 2639.476,
    "text": "So you could have your workshop with just a bunch of mus and Es, and then just compose it however you needed it without caring if you were reusing motifs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.758,
    "end": 2645.224,
    "text": "But if we construct a motif, like a cortical column,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.166,
    "end": 2663.871,
    "text": " That that's able to do what it does by itself and also contribute to more nested models just through a diagram and combining them like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.336,
    "end": 2674.742,
    "text": " It just makes a scalable, reusable motif that's developmentally plausible and actually has support in neurobiology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.123,
    "end": 2676.527,
    "text": "Olivier, then Javier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2678.313,
    "end": 2695.393,
    "text": " Stavros Stavridovich, yeah isn't the the horizontality here mustn't think about different areas in the rain, but could also be seen as a hierarchy, you know vertical hierarchy between you know lower area like no v1 v2 and v4 in a in a visual system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.423,
    "end": 2713.085,
    "text": " So we will have, you know, both verticality within, you know, each of this area and, you know, a more general connection between areas in which, you know, you have a more and more complex invariant message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.188,
    "end": 2715.469,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.332,
    "end": 2726.747,
    "text": "You could coarse grain and you could look at other neural systems in terms of message passing and hierarchical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.781,
    "end": 2734.402,
    "text": " Go for it, Javier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.303,
    "end": 2736.104,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2736.705,
    "end": 2746.64,
    "text": "Connecting back with a thousand brains theory of Hawking's wouldn't disconnect as well with the fact that Hawking says that you have just one model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2746.68,
    "end": 2753.41,
    "text": "You have all these columns and micro columns, like creating lots of different models, and then you have this sort of voting system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2753.39,
    "end": 2777.288,
    "text": " that is connected is related to the horizontal connections in which the different columns are influencing each other is that a sort of way of explaining this you know vertical versus horizontal so maybe the horizontal sort of voting or influencing uh the models created by the different columns or micro columns something like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2777.825,
    "end": 2792.762,
    "text": " yeah that's a great a great um comment one paper that kind of approaches that is this fame in the brain fame in the predictive brain um Dennett had this fame in the brain meme",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.21,
    "end": 2812.54,
    "text": " um and and uh this paper argues that basically like the the unit the unity of consciousness is like kind of like underlying it there's this subconscious process of selection amongst those models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.52,
    "end": 2824.762,
    "text": " I mean, again, this is running fast and loose with the map and the territory because we're talking about a system of interest, but we're obviously talking about the act in fontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.243,
    "end": 2829.33,
    "text": "But if 10 counterfactuals are imagined...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.588,
    "end": 2837.193,
    "text": " each one of them in deliberation might be transiently famous and explicitly considered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.854,
    "end": 2850.245,
    "text": "Like, you know, I could go to coffee shop A, I could go to B, I could go to C. But then for things that are experienced, that can be understood as like the outcome of this election or selection process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.968,
    "end": 2859.773,
    "text": "So it's like the winning hypothesis is what is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.057,
    "end": 2863.941,
    "text": " you know, in the spotlight of consciousness or awareness at a given time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.181,
    "end": 2864.441,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.544,
    "end": 2888.325,
    "text": "Yeah, and also, aside from that saliency map that I mentioned before, I don't believe the representation of the nested hierarchy is about, I mean, necessarily, it's not necessarily spatially",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2888.542,
    "end": 2893.66,
    "text": " distributed horizontally distributed representation.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2893.78,
    "end": 2898.838,
    "text": "It's more like the unpacking of a single",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2899.072,
    "end": 2903.958,
    "text": " let's say, tangled neurons that's unpacking that figure.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2905.46,
    "end": 2923.982,
    "text": "The real physical or spatially distributed hierarchy is the vertical one in which the clusters of different types of neurons",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2924.3,
    "end": 2929.928,
    "text": " are packaged into vertical columns.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2930.409,
    "end": 2940.263,
    "text": "And that's also, I believe, so Darius asked, what's the computational justification for such an organization?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2940.323,
    "end": 2952.501,
    "text": "Well, that kind of packaging can be efficient if we consider the different types of neuron with different length of axons for each neuron.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2952.599,
    "end": 2965.085,
    "text": " Each of those types of neurons can be assigned with specific tasks or can be more efficient in doing some tasks other than the others.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2967.269,
    "end": 2970.135,
    "text": "I believe that's also one of the reasons for",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2970.115,
    "end": 2973.2,
    "text": " the vertical distribution of those types of neurons.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2973.52,
    "end": 2992.309,
    "text": "But again, that nested hierarchy is just schematic representation or unpacking of a single tangled neurons and it doesn't refer to any spatially distributed hierarchy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2994.078,
    "end": 2994.419,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.84,
    "end": 2997.709,
    "text": "Also, we can think back to the neats and the scruffies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.451,
    "end": 3006.957,
    "text": "I mean, the extreme scruffy position is every synapse needs its own framework and university department and software package.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.156,
    "end": 3034.108,
    "text": " the other end you have the extreme meat framework and and so real work exists on that continuum and that's part of the unfolding discussion and one can only imagine how much neuroimaging and and molecular histology goes into the development of these really elegant computational um models and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.645,
    "end": 3057.362,
    "text": " people take them in different ways some people take these and abstract or generalize them even more and aren't as worried about whether it actually adheres to the structure of the brain um like what if we had two cortices on top of each other and we had this and we had that um someone else might want to um make it more directly connected to the measurements they were taking in their lab",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.815,
    "end": 3070.034,
    "text": " So again, chapter five is a five switch from chapter four because chapter five really is getting into the empirical and the specific systems of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.594,
    "end": 3078.827,
    "text": "That's going to come back again in chapter six when we talk about the recipe and chapter nine when we talk about integration with data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.128,
    "end": 3095.989,
    "text": " um but that's kind of the the breadth that that we're in between on one hand the more theoretical work like free energy principle and active inference in principle and on the other hand these are specific models and and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.066,
    "end": 3100.171,
    "text": " What do you call somebody who makes an evidence-based critique of this model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3100.772,
    "end": 3103.937,
    "text": "A computational neuroscience student or researcher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.237,
    "end": 3106.0,
    "text": "I mean, that's all there is to that field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.821,
    "end": 3116.897,
    "text": "Looking at how other people have integrated the information and made models and then offering positive developments and critiques beyond that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.502,
    "end": 3138.227,
    "text": " So it's kind of interesting after all, like the math and philosophy that it can feel like in the earlier chapters here, we're just like dumped squarely into empirical neuroscience and the connections just signaled by a new chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.156,
    "end": 3149.643,
    "text": " just so that we see it before we write down our questions and hopefully people can add as much discourse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.703,
    "end": 3158.09,
    "text": "It's super, super helpful to vote or add your own thoughts and curate the answers of others in the coming week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.871,
    "end": 3160.472,
    "text": "But basically, here's what's going to be upcoming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.413,
    "end": 3171.302,
    "text": "We're going to go from looking at the cortical column to descending predictions playing a role in motor control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.417,
    "end": 3173.981,
    "text": " proprioceptive information is going to come in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.762,
    "end": 3185.878,
    "text": "And then in the ventral and dorsal horns, but basically in this cross section of the mammalian spiral cord, the descending predictions are going to meet with the proprioceptive incoming information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.579,
    "end": 3193.289,
    "text": "And that's going to result in kind of this differential guided motor activity selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.569,
    "end": 3195.552,
    "text": "Like I want my arm to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.612,
    "end": 3197.475,
    "text": "It is where I want it to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.555,
    "end": 3198.236,
    "text": "It's not moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.797,
    "end": 3199.558,
    "text": "Move the set point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3199.678,
    "end": 3200.479,
    "text": "Now the arm moves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.058,
    "end": 3229.555,
    "text": " then um going back up to the cortical column we're going to now trace another projection so not just a projection to the spinal cord but also cortical layer 5 targeting some deep brain structures like the stratum and other aspects basal ganglia very interesting very cool dopaminergic and and uh brain regions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.041,
    "end": 3257.179,
    "text": " uh several topics and cognitive phenomena are discussed that the midbrain regions are important for here in figure 5.4 we also talk about policy selection and the direct and the indirect pathways of policy selection one of which the indirect is basically a pass-through on habit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.34,
    "end": 3277.647,
    "text": " And the other, the direct pathway involving an expected free energy calculation, so thus updating prior probabilities on policies, habit, updating that according to the expected free energy of policies, which is to say their epistemic and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.288,
    "end": 3287.2,
    "text": "So this is kind of a type one, type two, or like a habit pass-through versus deliberative decision-making distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.846,
    "end": 3291.3,
    "text": " Table 5.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3292.343,
    "end": 3319.887,
    "text": " provides some empirical work connecting different computational uh variables to neurotransmitters of course neurotransmitters do different things in different brain regions different synapses different contexts this is the neat and scruffy again we could have a framework for every single specific neurotransmitter um or we could just say all neurotransmitters are the same and this is somewhere in the middle this is saying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.867,
    "end": 3334.831,
    "text": " we can actually understand some uniquely valuable insights and unique predictions from associating different neurotransmitters in certain contexts with different computational roles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.851,
    "end": 3346.009,
    "text": "5.6 comes to this hybrid theme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.069,
    "end": 3350.757,
    "text": " which is about connecting the continuous and the discrete hierarchies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.838,
    "end": 3365.01,
    "text": "It's a total major theme of the textbook, though we are often distinguishing between discrete and continuous state spaces and also a special focus on the continuous and the discrete treatment of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.99,
    "end": 3391.318,
    "text": " as with other modeling um it's it's revisited multiple times that you can make hybrid models for example with continuous modeling at a lower level and categorical modeling at a higher level um finally in the closing pages they stitch together all three of the systems that were introduced",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3392.581,
    "end": 3409.037,
    "text": " So the descending signaling coming from the cortical column on one hand, going down to the motor selection unit, however, also going down to the behavioral planning and selection components.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3409.738,
    "end": 3420.529,
    "text": "And in fact, those behavioral selection and planning components then reentering into the cortical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.678,
    "end": 3423.202,
    "text": " so that the action can be decided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.644,
    "end": 3442.812,
    "text": "So just one example of compositional cognitive cartography and bringing together different modeled subsystems of interest and using active inference to integrate diverse cognitive phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.356,
    "end": 3446.398,
    "text": "And that's chapter five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.378,
    "end": 3451.399,
    "text": " Any last comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3461.991,
    "end": 3469.3,
    "text": "Well, next week will be our, it's the symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.921,
    "end": 3472.604,
    "text": "So hopefully people can view it or rewatch it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.745,
    "end": 3477.229,
    "text": "Then it'll be our final discussion on chapter five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.272,
    "end": 3504.162,
    "text": " and the following week will be an unrecorded session for for like feedback um we really need everyone truly so we will be especially interested to hear everyone's feedback with this anonymous feedback form for people's um suggestions on how to develop and improve there's many many notes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.142,
    "end": 3528.546,
    "text": " so it it for those who want to stay active and and leverage their contribution reading what people have already suggested which is quite copious and then curating or adding it and then maybe even finding a place where like you want to continue to get more involved in the coming months and years then we'll uh take some weeks off",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.416,
    "end": 3535.544,
    "text": " And then restart the second half of cohort four with chapter six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.505,
    "end": 3539.71,
    "text": "Meanwhile, start cohort five from the beginning of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.752,
    "end": 3545.079,
    "text": "And the work goes on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.744,
    "end": 3549.005,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.287,
    "end": 3550.868,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3551.208,
    "end": 3551.869,
    "text": "See you next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3553.872,
    "end": 3554.473,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.954,
    "end": 3556.997,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]