[
  {
    "start": 4.991,
    "end": 16.755,
    "text": " Hello and welcome everyone to Active Inference Lab to the guest stream, the Active Inference guest stream number 2.1 on March 18th, 2021, featuring Dimitris Bolas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.675,
    "end": 22.097,
    "text": "And this is going to be a really awesome discussion on a wide variety of topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.757,
    "end": 26.958,
    "text": " So I'll just pass it to Dimitris to introduce himself and take it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.058,
    "end": 31.859,
    "text": "We're going to have a presentation first, and then we'll be documenting questions from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 31.939,
    "end": 34.439,
    "text": "So please drop any thoughts or questions in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.759,
    "end": 37.04,
    "text": "And then we'll have a discussion after this presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.34,
    "end": 39.02,
    "text": "So thanks again for coming on the stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.12,
    "end": 41.4,
    "text": "We really appreciate the time and please take it away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.721,
    "end": 45.461,
    "text": "Hello, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.541,
    "end": 46.922,
    "text": "I'm very happy being here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.942,
    "end": 49.322,
    "text": "Thank you very much, the organizers for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.303,
    "end": 78.362,
    "text": " um organizing and presenting such an interesting series of short seminars so today i would like to present you a work that we have been doing primarily the last six years in munich in collaboration with leonard zilbach and his group in max planck and basically the title i instructed 4im",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.525,
    "end": 91.376,
    "text": " Human Becoming in and Through Social Interaction is the title of my PhD dissertation that was presented last year about this month.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.957,
    "end": 102.286,
    "text": "So for anybody that would like more details at the end of the talk, they would always go back to the document.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.467,
    "end": 104.909,
    "text": "It's already published in ResearchGate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.481,
    "end": 112.442,
    "text": " And there you can find also the already first papers that came out from this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.143,
    "end": 118.944,
    "text": "But more are coming in the way in the next few months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.144,
    "end": 127.365,
    "text": "So I'll start by presenting the outline of this presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.945,
    "end": 131.066,
    "text": "So first, we will go through the theoretical work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.026,
    "end": 158.42,
    "text": " which consists of the dialectical at-human hypothesis and the dialectical mis-at-human hypothesis, which both focus and emphasize the importance of social interaction in human becoming across various contexts and various scales, from evolution to cultural development and psychopathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.16,
    "end": 159.28,
    "text": "Then,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.942,
    "end": 186.5,
    "text": " Importantly, we will discuss concrete empirical methodologies with regards to how we can put into the formal test this kind of hypothesis, which we call two-person psychophysiology, because this work tries to extend the traditional psychophysiology work in the social domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.82,
    "end": 189.302,
    "text": "So we will see how, based on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.935,
    "end": 218.088,
    "text": " hyperscanning research for example we integrate different streams of studying for monitoring recording and analyzing data in high resolution from multiple people at the same time that they are able to interact in real time then we will go through the empirical work and the first two studies which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.9,
    "end": 224.363,
    "text": " about the interpersonal and human in real-time social interactions, especially through gaze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.384,
    "end": 231.666,
    "text": "And second, about the interpersonal and human in real-life social relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.767,
    "end": 239.23,
    "text": "And this is with regards to autistic traits and interpersonal similarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.671,
    "end": 246.854,
    "text": "Fourth, we will discuss some scientific and societal implications of his work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.549,
    "end": 250.731,
    "text": " And we will briefly conclude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.932,
    "end": 257.795,
    "text": "So, the theoretical work is based on two main pillars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.415,
    "end": 275.685,
    "text": "That's a philosophical framework developed across many centuries, going back to ancient years, ancient Greece and also ancient China or India.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.511,
    "end": 304.213,
    "text": " and we will go through more details later but this was developed further in more modern times in especially in france and germany and also we lean upon heavily the bayesian brain hypothesis and especially the framework of predictive processing and active inference so i guess most of the people here might be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.106,
    "end": 321.333,
    "text": " already familiar with these frameworks, but I would like to go through a simple example just to make clear the practical implications of this kind of frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.973,
    "end": 331.157,
    "text": "So let us imagine a lady waking up late for her work and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.807,
    "end": 336.649,
    "text": " So she cannot decide what to wear for going to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.01,
    "end": 349.097,
    "text": "But based on her previous experience, as she lives in the south part of Greece, in Crete, she believes that most probably the weather will be good and sunny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.177,
    "end": 353.94,
    "text": "So she decides to go out without carrying an umbrella or a coat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.08,
    "end": 356.601,
    "text": "However, these days it's unlikely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.139,
    "end": 364.701,
    "text": " Contrary to her predictions, the weather was rainy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.581,
    "end": 367.963,
    "text": "And that day, she got wet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.403,
    "end": 378.849,
    "text": "The second day, even though she believed that the probability for raining might be 5%, so she increased her beliefs about the probability of raining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.949,
    "end": 383.171,
    "text": "However, she still decided not to carry an umbrella.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.451,
    "end": 387.633,
    "text": "This continues for a week, where she finally",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.304,
    "end": 400.986,
    "text": " have come to believe that the probability of raining, even in this period, in this place, was 90% and decided to carry an umbrella.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.546,
    "end": 410.308,
    "text": "So we see here how she gradually updated her beliefs based on the evidence that she observed in real life, gradually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.008,
    "end": 413.988,
    "text": "Let us imagine another illustrative example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.108,
    "end": 417.929,
    "text": "The same lady goes for vacations to Japan",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.655,
    "end": 426.637,
    "text": " And she again is late to go out, and she has not decided whether she needs to carry an umbrella with her or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.777,
    "end": 433.639,
    "text": "Based on rumors in this time, she again believes that the weather will be good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.039,
    "end": 435.24,
    "text": "So she's slightly dressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.8,
    "end": 439.261,
    "text": "However, again, she's again unlucky, and the weather is raining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.461,
    "end": 446.743,
    "text": "So already in this case, the lady, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.91,
    "end": 455.134,
    "text": " from the second day already, she believes that the probability of raining will be 90%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.194,
    "end": 464.259,
    "text": "So we see here a jump regarding her updating of the weather beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.62,
    "end": 466.841,
    "text": "Why is that happening here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.441,
    "end": 476.486,
    "text": "From a Bayesian perspective, one could argue that in this case that her beliefs were formed quickly through social rumors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.207,
    "end": 477.747,
    "text": "They were more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.163,
    "end": 484.808,
    "text": " less confident, so more susceptible into change when faced with contradictory evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.91,
    "end": 492.614,
    "text": "That's a very important factor in the Bayesian brain hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.935,
    "end": 506.444,
    "text": "I will not go through the mathematical details, but with these very simple and simplifying examples, we examine two cardinal aspects of such accounts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.541,
    "end": 518.303,
    "text": " namely the updating of beliefs through integrating prior knowledge and new data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.883,
    "end": 536.686,
    "text": "And also we examine the learning rate of this procedure, which is thought of as a weighted precision prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.199,
    "end": 549.127,
    "text": " which means that the more confident we are about our previous beliefs, the less likely we are to update them in face of contradictory information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.228,
    "end": 556.371,
    "text": "So this framework has gained much attention over the last years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.732,
    "end": 565.437,
    "text": "First, because as we see, it's useful in examining various",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.452,
    "end": 580.48,
    "text": " real life scenarios and put them into formal equations and models which can be formally examined and tested against one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.041,
    "end": 590.165,
    "text": "So, of course, the outline of this account that we've drawn so far, it's rather simplistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.225,
    "end": 595.008,
    "text": "So in this case, we only examined the scenario that one person",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.239,
    "end": 608.582,
    "text": " observes passively the world and their only choice is to update their beliefs according to what they observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.762,
    "end": 621.686,
    "text": "So this, as Carl Frisson has mentioned, resembles in some aspects the old Plato's cave allegory where humans were",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.436,
    "end": 646.506,
    "text": " nothing else than prisoners for their whole lives in a deep cave where they never experienced the outer world and their only experience about their environment was through projections on a wall through shadows of the real objects that are reflected on the wall in front of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.486,
    "end": 650.928,
    "text": "So this we can imagine in a way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.387,
    "end": 672.841,
    "text": " humans or other organisms experiencing the world in a manner like that as we have specific sensory organs where information from the world is projected and we selectively experience the reality around us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.022,
    "end": 678.685,
    "text": "Of course this is just a partial image of what is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.325,
    "end": 681.447,
    "text": "One right away can think of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.894,
    "end": 688.896,
    "text": " a second avenue of attunement between the organism and the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.296,
    "end": 698.698,
    "text": "So as we first said, the organism tries to minimize prediction error through perception and learning by adjusting their own beliefs to the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.158,
    "end": 709.661,
    "text": "But of course, an organism can also update their beliefs through action so that they selectively transform",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.638,
    "end": 715.179,
    "text": " and sample the world in a way that it conforms to their initial beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.04,
    "end": 729.503,
    "text": "So this constitutes a more comprehensive account of organismic life and especially human life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.223,
    "end": 739.345,
    "text": "But we will argue in line with other recent accounts in this talk that this account is still not enough",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.14,
    "end": 754.191,
    "text": " on its own because it considers individual organisms out of context, out of their social context, and especially with regards to humans, out of the crucial cultural context as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.233,
    "end": 767.022,
    "text": "In our effort to embed this kind of account, we have leaned on the electrical approach, which, as we saw before,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.331,
    "end": 781.239,
    "text": " It constitutes a school of thought which goes back to ancient years and continues until these years, always enriched in different historical contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.839,
    "end": 788.003,
    "text": "So the importance of this framework is that it emphasizes unity of phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.844,
    "end": 794.627,
    "text": "It doesn't neglect inner contradictions and emphasize movement of phenomena or change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.179,
    "end": 813.049,
    "text": " And so situation of crisis or radical changes, it doesn't seem to this account as problematic, but also as chances of updating and enriching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.309,
    "end": 822.334,
    "text": "So this kind of accounts try to overcome dichotomies such as the organism and the environment, the individual and the collective, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.502,
    "end": 832.025,
    "text": " as we will see in our work, even patient versus their cultural context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.345,
    "end": 841.629,
    "text": "Special emphasis is given not only in intra-level processes, but also between level processes across various temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.75,
    "end": 850.272,
    "text": "So this account goes against both dualism and reductionism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.036,
    "end": 868.146,
    "text": " as it tries to examine phenomena in their wholeness but without metaphysically assuming independent levels of reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 870.688,
    "end": 879.474,
    "text": "Traditionally, sciences, for good reasons also, for lack of tools, have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.434,
    "end": 891.302,
    "text": " focused on specific levels of description of reality, such as, for example, the physical or biological level or the psychophysiological level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.563,
    "end": 897.186,
    "text": "This kind of studies have provided important insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.887,
    "end": 908.134,
    "text": "However, when examined isolated in single levels, we will argue it doesn't provide the whole picture of complex phenomena",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.55,
    "end": 914.132,
    "text": " such as psycho-socio-cultural or psychiatric phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.073,
    "end": 937.602,
    "text": "So in this work we have argued that even deploying simple research paradigms will be crucial to try to probe and monitor processes that live on different levels of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.093,
    "end": 939.653,
    "text": " description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.854,
    "end": 963.243,
    "text": "Based on this assumption, we have reviewed human becoming as a dialectic of internalization and externalization, and more precisely, connected internalization processes to predictive processing, which, as we saw from our examples, is the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.169,
    "end": 991.127,
    "text": " mechanism of updating our own beliefs in order to conform to the environmental regularities and we connected the externalization processes and especially collective externalization processes to active inference which is a process of co-regulating the outer world and especially the social world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 993.894,
    "end": 1006.362,
    "text": " according to our inner beliefs, but also according to our collective inner beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.763,
    "end": 1017.23,
    "text": "One can see human becoming as a human with a world, both physical world and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.95,
    "end": 1021.733,
    "text": "So here we see how we can, how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.653,
    "end": 1035.078,
    "text": " organisms, such as animals or humans, try to regulate the world, both physical and social world, by acting on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.858,
    "end": 1042.761,
    "text": "So, for example, in this case, this little animal holds the ball against gravity first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.921,
    "end": 1051.444,
    "text": "That means that already, in an embodied way, captures the physical dynamics of Earth, the gravity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.008,
    "end": 1054.949,
    "text": " but also acts against social influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.13,
    "end": 1059.532,
    "text": "For example here, an attempt from somebody taking the ball.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.293,
    "end": 1067.216,
    "text": "So we see human becoming as dialectical as human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.756,
    "end": 1081.143,
    "text": "In a nutshell, we say that interpersonal statistical regularities say multi-scale hierarchical models on an individual level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.15,
    "end": 1082.77,
    "text": " vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.011,
    "end": 1098.838,
    "text": "And this can happen across different scales, from phylogenesis, culture, endontogenesis, to everyday learning, decision-making, perception, and even so-called automatic interceptive process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.999,
    "end": 1109.443,
    "text": "Our perspective draws heavily on a Vygotskyan perspective, who have famously declared",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.611,
    "end": 1114.512,
    "text": " claim that through others we become ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.512,
    "end": 1126.434,
    "text": "So in order to further illuminate this view, let us imagine a simple example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.214,
    "end": 1138.316,
    "text": "Let us imagine a little baby that feeling hungry as their interceptive systems is out of balance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.071,
    "end": 1140.712,
    "text": " and tries to reach for food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.032,
    "end": 1151.976,
    "text": "However, the motor repertoire of such a human being is not developed yet fully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.418,
    "end": 1162.28,
    "text": "And so this baby is unable to reach for food on its own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.0,
    "end": 1168.122,
    "text": "So what happens is that usually the caregiver will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.821,
    "end": 1179.428,
    "text": " notice such kind of behavior and it will try to satisfy that, for example, by placing the food closer to the baby.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.329,
    "end": 1195.679,
    "text": "So in this case we see, we can even imagine how this kind of interpersonal relation between the caregiver and the baby results, may result in an internalization of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.212,
    "end": 1199.834,
    "text": " on a symbolical level of this kind of process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.034,
    "end": 1221.147,
    "text": "So the baby, both across evolution and development, might come to realize that when extending the hands or the index finger, calls for attention, pointing to a specific object that they need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.908,
    "end": 1223.549,
    "text": "So we see how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.082,
    "end": 1238.729,
    "text": " An interpersonal relationship based on natural needs for survival might end up in internalization on a symbolic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.311,
    "end": 1245.872,
    "text": "So here, that example is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.268,
    "end": 1271.139,
    "text": " in our talk because this illustrates how a collective level, a level of description of processes between people might be transformed into single brains and single bodies processes and actually makes us what we are becoming that is humans in our growing up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.42,
    "end": 1274.36,
    "text": "This kind of accounts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.774,
    "end": 1291.46,
    "text": " are very much in line with the framework of an activism and especially the account of participatory sense-making, which has focused a lot on the fundamental role of social interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.101,
    "end": 1300.243,
    "text": "Both from individual sense-making, which is always affected by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.018,
    "end": 1314.885,
    "text": " coordination dynamics while we are embedded in social interactions, or the way to joint sense-making, that means how we jointly with others make sense of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.188,
    "end": 1325.291,
    "text": "However, this kind of account might seem theoretical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.612,
    "end": 1328.413,
    "text": "So now here we will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.226,
    "end": 1350.878,
    "text": " ask the question, how can we apply this kind of ideas and why is it even important to reflect on these processes and whether these processes lie on lower level of descriptions or collective levels or between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.898,
    "end": 1358.782,
    "text": "So to illustrate an example, we will use autism as a paradigm example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.094,
    "end": 1368.037,
    "text": " And we will try to illustrate how these ideas can be concretely put into practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.718,
    "end": 1384.604,
    "text": "So autism spectrum condition has been described as a pervasive developmental condition, which is characterized by difficulties in social interaction and communication, as well as restricted interests and or sensory behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.064,
    "end": 1386.365,
    "text": "So that's the traditional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.354,
    "end": 1401.985,
    "text": " a typical definition of autism spectrum conditions and some predominant approaches so far have focused on difficulties or so-called impairments of theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.545,
    "end": 1418.137,
    "text": "These theories describe autism as a condition that individuals have problems with understanding the intentions or beliefs of other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.55,
    "end": 1433.341,
    "text": " So there are also alternative hypotheses, such as the social motivation hypothesis, which claims that people with autism have usually diminished social motivation to interact with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.922,
    "end": 1442.268,
    "text": "So in this case, they might lack opportunities in gaining more cognitive abilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.089,
    "end": 1447.312,
    "text": "We see also weak central coherence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.398,
    "end": 1471.743,
    "text": " account and or executive dysfunction, which refers to more individual characteristics of individuals, autistic individuals, such as difficulties with planning or paying more attention to local information rather than global information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.363,
    "end": 1475.824,
    "text": "We also see broken mirror neuron hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.95,
    "end": 1486.136,
    "text": " which emphasize the difficulty of autistic people when it comes to empathizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.378,
    "end": 1500.966,
    "text": "And more recently, we have computational approaches such as the aberrant or inflexible precision updating, which is grounded in predictive processing accounts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.667,
    "end": 1505.99,
    "text": "They claim that autism might result from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.999,
    "end": 1533.732,
    "text": " um aberrant way of updating precision and more concretely regulating the updating of beliefs as we saw by integrating previous previously gained experience with in face of newly incoming information so we see here that this type of account they are either",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.054,
    "end": 1545.1,
    "text": " more social accounts, like the theory of mind, social motivation, broken mirror neuron account, or even the aberrant precision updating when it comes to the social world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.94,
    "end": 1564.071,
    "text": "However, even in this case, where others are into the frame, the condition is exclusively attributed and examined within single individuals and especially single brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.287,
    "end": 1580.736,
    "text": " the most predominant approaches of autism focus on individuals and try to diagnose or even treat such conditions by paying attention primarily on the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.138,
    "end": 1594.064,
    "text": "So for example in research it's common to identify two groups for example one so-called neurotypical or non-autistic group",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.904,
    "end": 1620.48,
    "text": " and one autistic group and then by deploying a specific paradigm we try to identify traditionally differences in behavioral patterns or brain function and this kind of paradigms then attribute this kind of differences in a deficient functioning of the autistic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1623.328,
    "end": 1649.963,
    "text": " So however, as we will argue here and in line with an interactive and subjective turn in the research of psychopathology and specifically autism, we will see how by including real-time social interactions and social relationships, we can expand this focus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.609,
    "end": 1656.871,
    "text": " from individual brains to the process between people and especially in communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.631,
    "end": 1678.938,
    "text": "So this line of work would suggest that it's not enough to identify two different groups of people like neurotypical and autistic people, but already by beginning examining diets of people or groups of people, one can naturally see that we are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.69,
    "end": 1686.395,
    "text": " we have available here at least three different broad categories of partners.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.155,
    "end": 1702.166,
    "text": "For example, in our case, we have neurotypical partners, we have autistic partners, but we have also mixed partners, which means consisting of at least one autistic individual and at least one neurotypical individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.926,
    "end": 1707.089,
    "text": "So in this case, our hypothesis has been that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.053,
    "end": 1729.61,
    "text": " At least in certain levels, especially in the experiential level, the autistic individuals will entertain similar levels of smoothness, interactive smoothness as the neurotypical partners, whereas mixed diets might appear in certain levels interacting less efficiently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.091,
    "end": 1736.956,
    "text": "And if that hypothesis is correct, then one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.694,
    "end": 1752.917,
    "text": " can see that the deficiency doesn't lie in the individual brain of the autistic, but at least partially we can locate it in processes between individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.557,
    "end": 1763.219,
    "text": "This is very much in line with the double-empathy problem of Damian Milton, who has argued that the ontology of the autism condition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.68,
    "end": 1774.824,
    "text": " does not lie in the individual, but it comes from mismatches of social abilities of expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.704,
    "end": 1793.631,
    "text": "One can imagine even probing this framework further by not necessarily dichotomizing people in autistic or non-autistic or any other category we can imagine, but rather examining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.663,
    "end": 1813.038,
    "text": " substrates on a continuum and then examining the interaction smoothness based on the distance of people in a space of conditions rather than in a single-dimensional spectrum of conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.339,
    "end": 1817.561,
    "text": "Later we will see how this can be operationalized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.632,
    "end": 1840.317,
    "text": " After this illustrative example, as we already mentioned, the last decade, especially, but also before, through more sociological accounts, we have seen an intersubjective turn in the study of autism and other conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1841.437,
    "end": 1842.917,
    "text": "Just to give a few examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.238,
    "end": 1848.119,
    "text": "For example, the double empathy problem has argued that social difficulties",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.154,
    "end": 1856.058,
    "text": " in autism arises as a two-way complication and does not reside in single brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.678,
    "end": 1869.086,
    "text": "But also, as we saw, an activist and participatory sense-making accounts have claimed that atypicalities can be viewed as a different way of making sense of others and interacting with the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.147,
    "end": 1878.331,
    "text": "Or second-person neuropsychiatry perspectives have claimed that social difficulties are more likely or even only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.948,
    "end": 1889.631,
    "text": " manifest themselves in real-time social interactions, whereas more passive scenarios might be less problematic clinically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.512,
    "end": 1908.736,
    "text": "Finally, a part of this work, the electroemissive human hypothesis, has been together in the subjective approaches and predictive processing approaches, have reviewed conditions such as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.341,
    "end": 1917.145,
    "text": " autism, but also other conditions, not as a disorder of the individual, but rather as a cumulative interpersonal misadhumance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.666,
    "end": 1937.735,
    "text": "So, in a nutshell, interpersonal misadhumance can be thought of as disturbances of the dynamic and reciprocal unfolding of an interaction across multiple time scales, resulting in increasingly divergent prediction and interaction styles or patterns, and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.874,
    "end": 1946.138,
    "text": " As we saw, the hypothesis aligned with other accounts holds clear predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.099,
    "end": 1967.671,
    "text": "So before we start experimenting empirically, we made concrete hypotheses in terms of interactions, which we suggested that interactions within homogeneous and non-tuned diets are expected to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.678,
    "end": 1976.546,
    "text": " I'm sorry, or tuned diets, are expected to appear smoother compared to heterogeneous diets or non-tuned diets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.586,
    "end": 1982.071,
    "text": "We will see later what we mean by socially tuned and homogeneous or heterogeneous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.214,
    "end": 1992.341,
    "text": "Importantly, we see here an interplay between levels of description, between the intersubjective-communative gap",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.748,
    "end": 2001.233,
    "text": " and individual prediction and interaction styles, which might appear diverse across people of different conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.013,
    "end": 2017.963,
    "text": "And here we see how initially the subjective communicative gap can result in increasing individual diverse prediction and direction styles and how as we have people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.479,
    "end": 2028.602,
    "text": " that have formed diverse social expectations about each other, how this can result in increasing such an intersubjective community gap across various scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.242,
    "end": 2041.505,
    "text": "One can imagine, for example, at the scale of a dialogue, for example, let's say I start with making a comment that another person might take as insulting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.225,
    "end": 2046.186,
    "text": "Then the other person replies to me back in an aggressive manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.809,
    "end": 2051.01,
    "text": " I'm starting feeling angry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.09,
    "end": 2059.012,
    "text": "And this can escalate, potentially, in a major mission in the scale of just a few seconds or a few minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.053,
    "end": 2069.156,
    "text": "Especially, this can happen between people, for example, that have cultivated distinct systems of beliefs, for example, different cultures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.216,
    "end": 2075.758,
    "text": "And they don't have the chance to get to know other systems of beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.488,
    "end": 2090.771,
    "text": " In the case of autism, for example, one can imagine that this kind of interactions might play out during a cross-development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.951,
    "end": 2106.055,
    "text": "So a child in a school, for example, that other children are not informed about different communication styles might isolate, exclude and isolate this child.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.344,
    "end": 2118.347,
    "text": " and forcing this child to develop with a decreased level of social interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.947,
    "end": 2127.95,
    "text": "We see this not only in terms of autism, but also with regards to other social communicative differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.67,
    "end": 2131.651,
    "text": "People can be excluded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.791,
    "end": 2137.633,
    "text": "For example, immigration populations in new places",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.12,
    "end": 2145.425,
    "text": " might be excluded initially based on this kind of intersubjective communicative gaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.926,
    "end": 2165.818,
    "text": "So in our case, going back to autism, we will try to personalize the homogeneity of dyads of partners as a similarity in terms of autistic traits, which we can measure with standard questionnaire tests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.633,
    "end": 2195.696,
    "text": " and we will personalize in our experiments the smoothness of an interaction based on the perceived friendship quality again through questionnaires for example but later we will see how we can extend this work in a more fine-grained time scales for example in at the scale of milliseconds when it comes to interpersonal gaze behavior or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.412,
    "end": 2198.833,
    "text": " interpersonal facial expression behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.254,
    "end": 2215.6,
    "text": "So our experimental methodology takes the form of two-person psychophysiology or collective psychophysiology, which tries to expand the study of psychophysiological phenomena into the social or collective domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.741,
    "end": 2224.263,
    "text": "Here, our first study on the interpersonal human in real-time social interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.051,
    "end": 2249.45,
    "text": " make use of this methodology, which is grounded in second-person neuroscience accounts, which claim that in real-time social interaction, brain or other processes might be fundamentally different than simpler social passive observational scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.89,
    "end": 2253.373,
    "text": "So when we really interact with another in real time, for example, in a discussion,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.355,
    "end": 2272.468,
    "text": " These accounts hypothesize that our brain will function in a qualitatively different and quantitatively different way as when we just sit back and observe others without the opportunity to feed back to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.488,
    "end": 2277.551,
    "text": "I will not go in detail here about the brain processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.052,
    "end": 2282.955,
    "text": "In our study here we will see mainly behavioral results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.601,
    "end": 2299.654,
    "text": " So also our two-person psychophysiology framework is based on previous work of the last couple of decades, such as, for example, fMRI or EEG hyperscanning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.995,
    "end": 2309.362,
    "text": "Here you see one of the seminal works of Guillaume Dumas, which connected two EEG systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.966,
    "end": 2326.691,
    "text": " into the same computer in order to, at the same time, examine the brain function of two people while interacting through hand movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.512,
    "end": 2336.374,
    "text": "Also, other later works, such as work from Vicky Leonkor and Takaraki Kokoike,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.062,
    "end": 2347.306,
    "text": " have examined phenomena, for example, from deeper in the brain with the use of fMRI hyperscanning or across development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.847,
    "end": 2354.229,
    "text": "Our 2% setup looks like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.669,
    "end": 2356.67,
    "text": "So I will not go here also in detail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.71,
    "end": 2364.954,
    "text": "I just want to make clear that our system deploys several different recording modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.214,
    "end": 2394.993,
    "text": " completely symmetrical way in order to make sure that we in prefer synchronicity we can monitor the individual processes of two or more people from decision making to eye movements and facial expressions and brain function all at the same time so that we can interrelate first processes of different modalities within the same person like for how decision making is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.183,
    "end": 2413.859,
    "text": " connected to our emotional processing or facial expressions and how our brain function modulates eye movements and back how our perceived social information modulates brain function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.239,
    "end": 2422.126,
    "text": "And second, to interrelate the multimodal processes of individuals with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.326,
    "end": 2423.187,
    "text": "So how my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.83,
    "end": 2431.293,
    "text": " Visual information, for example, influence your behavior and how your behavior influence me in a closed loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.774,
    "end": 2437.236,
    "text": "So in reality, our setup looks like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.256,
    "end": 2454.624,
    "text": "So two persons are invited in the lab and they solve simple visual tasks while they are able to communicate and interact through a micro camera at the center of the screen, which deploys the face of the other person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.998,
    "end": 2481.043,
    "text": " So here, in our first experiment, the important manipulation was that while people were able to communicate in real time, like in Skype manner, in half of the game, people could not communicate in real time because we replayed a part of the video of the previous interaction without letting people know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.583,
    "end": 2483.884,
    "text": "So in our game, the two people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.434,
    "end": 2487.035,
    "text": " thought that they always communicated in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.916,
    "end": 2499.962,
    "text": "However, contrary to their perception, in half of the game, they really communicated, but in half of the game, they just observed the video of the other person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.483,
    "end": 2512.369,
    "text": "And so in this case, we will be able to disentangle quantitatively the impact of the social interaction dynamics, even in the absence of conscious interpretation of the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.741,
    "end": 2523.008,
    "text": " So here we can see our two main conditions of the live video feed, where it allows the two people to form essentially one system, interacting system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.308,
    "end": 2526.911,
    "text": "And in the other case, we have two distinct systems, cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.411,
    "end": 2532.756,
    "text": "We just observe recorded videos of the other without knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.776,
    "end": 2536.098,
    "text": "Our game looks like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.339,
    "end": 2542.744,
    "text": "It's based on a similar work of Bahadur Barami and colleagues in London.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.888,
    "end": 2558.799,
    "text": " It's a psychophysiological task where we ask people to identify the odd object on the screen without knowing that there is no odd object on the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.899,
    "end": 2567.945,
    "text": "So because we have four possible possibilities left, right, up or down, we expect just 25%",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.307,
    "end": 2579.608,
    "text": " chance of co-occurrence between the decisions of the two persons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.708,
    "end": 2600.952,
    "text": "So whatever we observe above and beyond 25%, in a statistical significant manner, we can attribute just on the dynamics of the social interaction, because every other piece of information remains the same for the two people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.206,
    "end": 2606.089,
    "text": " except for the dynamics of their interaction through gaze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.791,
    "end": 2611.073,
    "text": "So for example, here you can see case one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.554,
    "end": 2614.935,
    "text": "We have covered the eyes of people for privacy reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.716,
    "end": 2629.846,
    "text": "But here you can see how people in real time, even when they don't see the whole face of the other person, they are synchronized and happy interacting together at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.314,
    "end": 2637.777,
    "text": " Look here, for example, how perfectly aligned is even their facial expressions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2640.659,
    "end": 2643.98,
    "text": "The same here, we cannot see the eyes, but the same we'll see about the eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.02,
    "end": 2644.661,
    "text": "The same happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.261,
    "end": 2647.422,
    "text": "People tend to follow each other's eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.202,
    "end": 2657.687,
    "text": "But let's see now a second case where people, in the same game, the same day, after a few seconds, they played a version of the game where, without knowing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.371,
    "end": 2661.914,
    "text": " one person see only the video of the eyes of the other person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.455,
    "end": 2669.902,
    "text": "So in this case, you see, people start being confused, like, why don't you follow me as I follow you, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.482,
    "end": 2678.469,
    "text": "So this creates a misadhuman, an artificial misadhuman, where people, naive about our experimental control, cannot attribute to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.21,
    "end": 2691.936,
    "text": " our manipulations, but as we saw through questionnaires, they attribute through psychological interpretations, like the other person was bored or tired at some point of the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.477,
    "end": 2709.485,
    "text": "Here, for example, we can see how the interpersonal and human play out in the behavioural domain, and especially here in how the two gaze traces of the two persons coincide and follow each other, like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.395,
    "end": 2713.718,
    "text": " independent interacting little creatures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.639,
    "end": 2722.183,
    "text": "And here are former results based on our analysis of the gage trace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.483,
    "end": 2725.766,
    "text": "Here we can see we formed three experimental conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.666,
    "end": 2736.993,
    "text": "We have one pseudo condition where we suffered diets from different days and we see that their gage continuation, the green, is the lowest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.714,
    "end": 2750.603,
    "text": " Then we see that when people really observe the other person in the room, the orange distribution, we see that we have an increased gaze coordination metric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.123,
    "end": 2761.091,
    "text": "But what really made the difference is when people are allowed to really interact with each other, we see that their gaze space was synchronized the most.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.171,
    "end": 2764.393,
    "text": "Very interestingly, we observe exactly the same pattern",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.511,
    "end": 2790.452,
    "text": " um in terms of of a completely different level of description and this is the decision making alignment again here we see that when we analyze data from people of different partners we see that indeed the probability of agreeing on the same object was around 25 we see here the green distribution centers around 25",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.414,
    "end": 2798.996,
    "text": " Then we see that the orange distribution already on the about the observational scenario is slightly increased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.916,
    "end": 2806.478,
    "text": "But what was highly increased was the decision making alignment in the real time social interaction scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.959,
    "end": 2819.302,
    "text": "Also, this is reflected in the interrelationship between the two modalities we see here, both in the online and offline conditions, we see",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.62,
    "end": 2823.522,
    "text": " and statistical interrelationship between the two modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.023,
    "end": 2830.087,
    "text": "So the higher the gaze coordination, the higher was the decision-making alignment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.288,
    "end": 2838.913,
    "text": "And we also see that in the case of real-time social interaction, this interrelationship appeared stronger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2840.895,
    "end": 2846.259,
    "text": "Also, another interesting finding is that the confidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.723,
    "end": 2871.237,
    "text": " difference between the two conditions was significant so people without even knowing that there was two different conditions appeared more confident about their own choices depending in their real-time social interaction situations as opposed to the offline or social observation scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.977,
    "end": 2876.16,
    "text": "So here we see how the social interaction dynamics even when we don't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.684,
    "end": 2888.812,
    "text": " we are not aware of them consciously, influences us phenomenologically, even to the level of our confidence about our own decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.396,
    "end": 2902.782,
    "text": "So finally, we also see a relationship between gaze coordination and the perceived level of collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.582,
    "end": 2904.163,
    "text": "So the more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.636,
    "end": 2914.28,
    "text": " people follow each other's gaze, the more likely we are to report a higher level of satisfaction in collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.061,
    "end": 2927.505,
    "text": "So, we're going through the studies two, where we examine the personal misadhumance at this time in real-life social relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.065,
    "end": 2934.328,
    "text": "Here we try to move our empirical studies outside of the lab, in the real world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.922,
    "end": 2951.274,
    "text": " without performing any manipulation, just by registering the experiences, the real life experiences of people in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.874,
    "end": 2959.921,
    "text": "So here we study the link more concretely between the similarity of autistic traits and friendship ratings along a continuum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.961,
    "end": 2965.565,
    "text": "And for that, to this end, we invited pairs of friends to complete questionnaires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.368,
    "end": 2974.311,
    "text": " about their individual autistic traits and the quality of their friendship without being able to communicate their replies, of course, to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.951,
    "end": 2990.276,
    "text": "Then we analyzed this data that we gathered from 144 neurotypical adults, which formed 72 same-sex diets of friends, whose",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.364,
    "end": 3014.75,
    "text": " Friendship duration varied a lot from three months to 30 years and their meeting frequency again was diverse from a few times per year to daily in the ages of adulthood from 19 years old to 50 years old and in a balanced in terms of sex sample of participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.59,
    "end": 3022.352,
    "text": "Here we see the distributions of the main measures of our study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.421,
    "end": 3036.11,
    "text": " friendship quality, friendship duration, autistic traits and autistic traits mismatch, which is simply the difference of my autistic traits versus your autistic traits in a given diet of friendship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.811,
    "end": 3045.297,
    "text": "This study was recently published, so people that are interested can go back and see all the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.718,
    "end": 3051.701,
    "text": "So, in a nutshell, what we find here is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.546,
    "end": 3063.789,
    "text": " whereas individual autistic traits were related with the friendship quality in line with previous studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.369,
    "end": 3078.213,
    "text": "In our study of real-life social relationships, this apparent relationship was not significant statistically, at least in the amount of our sample size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.195,
    "end": 3086.637,
    "text": " as we see, and it only appeared as a very weak interrelationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.657,
    "end": 3097.561,
    "text": "What was more interesting was the, as hypothesized, the interrelationship between the mismatch of autistic traits and the friendship quality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.001,
    "end": 3109.525,
    "text": "And here we see that the more the mismatch of autistic traits, so the more different the two people were in a given diet, the less satisfied appeared in their friendship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.164,
    "end": 3119.366,
    "text": " And this result was irrespective of friendship duration, age, sex, or even the average dyadic autistic traits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.426,
    "end": 3125.887,
    "text": "Similar observations we found with regard to friendship duration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.287,
    "end": 3139.57,
    "text": "We found no interrelationship at all between friendship duration and individual autistic traits in our sample, but we indeed found an interrelationship between mismatch of autistic traits and friendship duration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.291,
    "end": 3149.339,
    "text": " So the key constituents of friendship quality that contributed to this kind of results were interpersonal acceptance, closeness and help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.303,
    "end": 3164.815,
    "text": "So based on our empirical observations, we can speculate and suggest the future directions of research, relevant work,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.166,
    "end": 3176.031,
    "text": " which will examine the dialectical phenomena between different levels of analysis from the collective to the individual and back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.492,
    "end": 3193.981,
    "text": "So, for example, in this case, we can speculate that potential higher interpersonal attunement between people might lead to smoother social interactions, which in turn might transform our interaction with another person in a more rewarding form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.52,
    "end": 3197.682,
    "text": " So we are more happy to communicate with this specific person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.163,
    "end": 3204.568,
    "text": "And these have been found to enhance even interpersonal attraction about each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.328,
    "end": 3209.511,
    "text": "And this attraction might increase the motivation to interact further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.531,
    "end": 3214.155,
    "text": "And more frequent interaction with the other might boost interactional success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.755,
    "end": 3221.3,
    "text": "And this interactional success might contribute back to higher interpersonal human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.375,
    "end": 3236.003,
    "text": " Of course, such a process is a simplification and more experiments are needed to examine the different stages of such a dialectical procedure in real life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.665,
    "end": 3245.129,
    "text": "So in our discussion, we'll examine some limitations and future direction of our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3245.249,
    "end": 3246.81,
    "text": "First, we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.991,
    "end": 3269.779,
    "text": " and should measure more fine-grain mechanisms in more clearly modulatory experiments using hyperscanning and computational modeling in order to tap into more detailed mechanisms of this kind of phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.579,
    "end": 3279.943,
    "text": "Also, in the future, we can deploy unmediated face-to-face interactions such as real-life monitoring of verbal and touching behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.096,
    "end": 3300.622,
    "text": " We should examine also more heterogeneous samples of the population, for example, mixed gender population or cross-cultural diets and groups, or even groups of the same culture but of different socio-economic background or educational background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.822,
    "end": 3304.983,
    "text": "Further scales of social interaction dynamics can be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.198,
    "end": 3313.221,
    "text": " incorporated, and here we are drawing on the dialectic misattunement hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.001,
    "end": 3334.249,
    "text": "We suggest to continue with longitudinal tracking of two-person and collective psychophysiology so that we also monitor the development of such kind of attunement or misattunement across several years in real life scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.959,
    "end": 3356.28,
    "text": " Also, clinical studies are needed in order to examine this kind of hypothesis across, as we saw, different types of diets or groups, which would include autistic or other conditional diets, neurotypical ones, but also mixed ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.522,
    "end": 3386.192,
    "text": " Indeed, we have already started in collaboration with Vicky Leong and Takahiko Koike to deploy such hyperscanning studies in order to tap into the brain mechanisms using both EEG hyperscanning and fMRI hyperscanning, hopefully soon in Japan when the situation stabilizes in terms of the pandemic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.013,
    "end": 3393.797,
    "text": " Also, we at the same time analyze facial expressions between two people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.419,
    "end": 3404.024,
    "text": "Here we already saw how two people might synchronize in facial expressions when they interact in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.465,
    "end": 3409.388,
    "text": "Hypothesis goes in similar line as with what we saw before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.389,
    "end": 3417.134,
    "text": "So before concluding, I would like also to draw a sketch of our future computational plans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3417.214,
    "end": 3417.774,
    "text": "Here we have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.255,
    "end": 3442.987,
    "text": " on a paper which is called Beyond One Bayesian Brain, which have suggested that we should go beyond individual Bayesian modeling of the isolated brain towards collective models, which will capture both intrasubjective beliefs and intrasubjective confidence of beliefs, but also intrasubjective coupling factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.708,
    "end": 3445.729,
    "text": "Here in this paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.399,
    "end": 3466.333,
    "text": " From 2007, we were based on previous work of Donnie Zhou and Chris Mattis, which is developed around a meta-based and two-level computational scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.817,
    "end": 3477.642,
    "text": "For concluding, we should mention that especially in the last two, three",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.226,
    "end": 3507.176,
    "text": " years more and more evidence appear in favor of viewing psychopathology as an interpersonal misattunement and not only as exclusively disorder of the brain and if this evidence at least in certain levels of description holds a valid and robust one can imagine that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.382,
    "end": 3538.117,
    "text": " Apart from examining and treating individuals and diagnosing individuals, we can pass through more comprehensive social approaches where we will at the same time treat an individual with a certain condition, but at the same time we will also inform the society about these conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.091,
    "end": 3567.052,
    "text": " and so in a way our approach point towards not tuning only persons with a specific condition into the incidental norm of our current cultural context but tries to foster an interpersonal meeting at the middle if you will so for example of course we don't suggest by deploying for example from psychopharmacology in the general population",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.452,
    "end": 3589.6,
    "text": " But for example, with informational campaigns in schools, we indeed suggest a tuning of social expectations or enrichment, if you will, in order to provide a more inclusive society for everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.62,
    "end": 3594.522,
    "text": "Also, our approach points towards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.265,
    "end": 3611.663,
    "text": " a treatment of interaction as such, in line with, for example, participatory sense-making suggestions, where we envision modern schools, for example, that would care about tuning the medium of communication between people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.703,
    "end": 3616.308,
    "text": "For example, in a previous work we have suggested",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.107,
    "end": 3639.703,
    "text": " developing educational systems mediated through computers or even social robotics or serious gaming between two individuals which could alleviate some initial social pressures and allow people to communicate smoother in the first steps of development of communication between two people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.405,
    "end": 3646.228,
    "text": "As we have seen before,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3647.416,
    "end": 3672.478,
    "text": " In this scheme, we can simply observe our suggestion is trying to treat this kind of interpersonal misattunement between two individuals, one autistic and one non-autistic, for example, which might diverge if left unnoticed by treating not only the autistic individual, but also the neurotypical individual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.201,
    "end": 3680.524,
    "text": " and also trying to take care of the interaction tuning between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.984,
    "end": 3689.569,
    "text": "But in a way that at the end we result, we are left with a tuned diet and not tuned individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.089,
    "end": 3695.052,
    "text": "So what we care is that people can communicate smoothly and satisfactorily with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.532,
    "end": 3703.716,
    "text": "And we don't care about identifying ideal, normal, against which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.953,
    "end": 3711.479,
    "text": " other types and styles of communication should conform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.162,
    "end": 3727.795,
    "text": "So, in this work, concluding, taking together, we have argued that social interaction does indeed matter across various contexts and timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.294,
    "end": 3734.398,
    "text": " And in fact, we even consider the question of social interaction as the fundamental philosophical question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.978,
    "end": 3743.303,
    "text": "And our argument here is a generally existential one, as without social interaction, we cannot even exist as humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.225,
    "end": 3749.587,
    "text": "Thank you very much for your kind attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.707,
    "end": 3757.232,
    "text": "And I would like also to thank several people that have collaborated with us across the last five, six years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.799,
    "end": 3779.73,
    "text": " in order for us to accomplish a vast amount of experiments of about 400 people, and especially my academic advisor, Leonard Zilbach, who assisted me in the journey of the last six years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3781.051,
    "end": 3781.611,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3781.771,
    "end": 3786.814,
    "text": "I would be happy now to receive any question and happily discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3789.693,
    "end": 3790.053,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.574,
    "end": 3793.476,
    "text": "Maybe you can unshare your screen and we can take it from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.216,
    "end": 3798.3,
    "text": "Well, thanks for this really amazing talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.32,
    "end": 3802.523,
    "text": "That was truly something special and we got a bunch of questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.823,
    "end": 3805.485,
    "text": "Maybe you can unshare and then you'll return to regular mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.567,
    "end": 3808.147,
    "text": "Excuse me?"
  },
  {
    "start": 3808.387,
    "end": 3810.269,
    "text": "You can unshare your screen in the JIT space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.449,
    "end": 3810.609,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.048,
    "end": 3820.093,
    "text": " For everybody who's watching live, we have a bunch of questions already and you can ask more and I'll just ask them just in the order that they were presented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.553,
    "end": 3822.414,
    "text": "So Alex wrote a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.195,
    "end": 3831.56,
    "text": "What are the connections or disconnections of the dialectical perspectives that you brought up and monism or Markovian monism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3833.668,
    "end": 3834.809,
    "text": " Can you please repeat this question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.069,
    "end": 3835.389,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.489,
    "end": 3845.474,
    "text": "How do we think about the similarities and dissimilarities of the dialectical perspectives that you addressed and Markovian monism, like kind of Markov blanket everything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3847.015,
    "end": 3847.235,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3847.775,
    "end": 3862.402,
    "text": "So I have recently come across a couple of works claiming Markovian monism, I think from Vania Vize and colleagues and Carl Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.598,
    "end": 3887.777,
    "text": " uh but unfortunately to be honest i haven't had the opportunity yet to go through these kind of accounts in order to draw the similarities but i can tell you for example our approach shares a lot of commonalities for example with work of maxwell ramstad for example and colleagues who have argued in favor of a multi-scale and nested",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.225,
    "end": 3893.328,
    "text": " Markov blankets processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3894.769,
    "end": 3900.354,
    "text": "So our account shares commonalities with such kind of multi-scale approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.454,
    "end": 3907.381,
    "text": "I'm not sure if Vania Vize's work also goes through this kind of directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.322,
    "end": 3915.047,
    "text": "Perhaps one difference might be that in our case, we don't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.095,
    "end": 3945.728,
    "text": " take the predictive processing active inference account strictly ontologically, but we use it as a tool in order to model and capture specific parts of the process, so we don't necessarily presuppose nested Markov blankets in reality, but we still view them as a very useful way of integrating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.014,
    "end": 3948.916,
    "text": " this kind of processes formally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.837,
    "end": 3957.165,
    "text": "Nice, that really maps to the realism instrumentalism discussion we've been having in these discussions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.646,
    "end": 3959.708,
    "text": "So here's another question from Sasha.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3960.249,
    "end": 3967.357,
    "text": "She wrote, what activities or mental states are amenable to creating interpersonal attunement for adults?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3969.571,
    "end": 3970.612,
    "text": " What kind of activities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.912,
    "end": 3972.012,
    "text": "What kind of activities?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.533,
    "end": 3975.834,
    "text": "What kind of improvisational or synchronous?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.014,
    "end": 3978.115,
    "text": "You're studying it in a very specific case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3978.576,
    "end": 3984.579,
    "text": "But as far as just our day-to-day life, what kind of activities do you think create that sort of interpersonal attunement for adults?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.739,
    "end": 3985.999,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.4,
    "end": 3986.64,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3986.8,
    "end": 3998.046,
    "text": "So as we saw in the presentation, I gave a simple example of interpersonal attunement between a caregiver and a child.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.025,
    "end": 4009.288,
    "text": " in order to stress how this kind of interpersonal achievement is crucial, not just about our interpersonal achievement, but also about survival.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.388,
    "end": 4019.491,
    "text": "So we cannot escape actually interpersonal achievement because otherwise we don't exist neither biologically, but not even as humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4019.752,
    "end": 4027.554,
    "text": "So whatever we learn from language and symbolic functions comes from developmentally acquired knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4028.044,
    "end": 4034.807,
    "text": " and which has been, of course, being possible through larger evolutionary scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.767,
    "end": 4055.556,
    "text": "But after we gather this kind of capacities, I think here actually another important point is that I feel that certain paradigms in the past have been helpful, but also misconstrued certain human functioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.492,
    "end": 4070.92,
    "text": " as starting taking, for example, processes theory of mind as a given statically, and then try to indicate how this kind of theory of mind process play out in interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.1,
    "end": 4082.727,
    "text": "So we see here that if we take a more historical developmental approach, we see that, of course, one feedbacks to the other, the individual level to the collective, but we see here a primacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.708,
    "end": 4087.75,
    "text": " in a Vygotskyan way, privacy of the collective level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.31,
    "end": 4092.972,
    "text": "First we are in tune with others and then we build ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.532,
    "end": 4107.238,
    "text": "And in the adult life, I believe social interaction itself and the experience of the other is what can allow us to attune to others in many different levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.458,
    "end": 4109.499,
    "text": "For example, as I said before,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4110.514,
    "end": 4125.386,
    "text": " in isolated places that people didn't have the chance to communicate with others might, if one wants to use Bayesian terminology, they might develop so strict priors in terms of their social expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.766,
    "end": 4133.171,
    "text": "But when they face other people from other places, they're unable to tune their beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.852,
    "end": 4137.014,
    "text": "And one, like here, just freely speaking, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.577,
    "end": 4165.748,
    "text": " In this case of so strictly formed beliefs, people might face such a tremendous difficulty in updating, like they need to use so much energy to update their prior beliefs that they formed across development, which might even escape to other malicious strategies in order to conform their inner expectations to the outer world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4166.218,
    "end": 4183.083,
    "text": " even by, for example, violence or even killing, exterminating the other, because they cannot just wrap their minds around the existence of other, the manifestation of other types of belief systems, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4183.503,
    "end": 4188.105,
    "text": "As you can see in the history, for example, a lot of times when people from different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.86,
    "end": 4200.512,
    "text": " belief systems or even different economic interests clashed together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4200.572,
    "end": 4207.999,
    "text": "And we see that many times, instead of being able to adapt to each other, people were violent to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4208.925,
    "end": 4224.718,
    "text": " I think the key here is early age exposure to various forms of life and beliefs so that naturally and organically people can attune to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4225.219,
    "end": 4234.086,
    "text": "I think as with other processes like language, there might even be maybe more liberal, but still a window of this kind of for a human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.186,
    "end": 4235.127,
    "text": "So I think we are more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.099,
    "end": 4258.176,
    "text": " open for attuning with others in the world in an earlier age than later, but still through experience, both through educating ourselves, for example, but more crucially, such an approach would even go further suggesting that individual training is not enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.677,
    "end": 4263.5,
    "text": "Like even if we try to educate ourselves and realize that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.334,
    "end": 4271.737,
    "text": " we have acquired biases against other people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.977,
    "end": 4288.525,
    "text": "This might not be enough even to eliminate all our implicit biases and perhaps only in real practice, in the practice of real time social interaction, these models, if you want, can be rebuilt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.854,
    "end": 4292.094,
    "text": " Really important points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4292.254,
    "end": 4293.055,
    "text": "Thanks for sharing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.835,
    "end": 4310.639,
    "text": "Another question in the chat from Steven is, is there a hypothesis that people on the autistic spectrum exhibit different traits due to perception and action dynamics being different rather than, for example, just the brain structures limiting their generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4312.54,
    "end": 4314.261,
    "text": " Could you please repeat the question one more time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.441,
    "end": 4314.721,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4315.962,
    "end": 4326.126,
    "text": "Is there a hypothesis that people on the autism spectrum exhibit different traits due to their perception and action dynamics being different rather than just their brain structures being different?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4331.348,
    "end": 4331.888,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.629,
    "end": 4333.149,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.829,
    "end": 4336.951,
    "text": "I'm sorry, but I'm losing connection at certain points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.471,
    "end": 4337.591,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4338.177,
    "end": 4339.637,
    "text": " I can hear you fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4340.178,
    "end": 4343.339,
    "text": "Perhaps my internet connection is not full.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.559,
    "end": 4345.559,
    "text": "How about just if you could reload on your page?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4347.46,
    "end": 4348.42,
    "text": "How can I access that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4349.0,
    "end": 4350.561,
    "text": "Just hit the reload on your browser.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.961,
    "end": 4352.442,
    "text": "On the window.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.803,
    "end": 4358.063,
    "text": "Nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.083,
    "end": 4366.626,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4366.929,
    "end": 4367.109,
    "text": " Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.289,
    "end": 4367.45,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.73,
    "end": 4370.533,
    "text": "Sound good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.593,
    "end": 4370.713,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.133,
    "end": 4372.735,
    "text": "I'm seeing you better and hearing you better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.755,
    "end": 4374.537,
    "text": "Could you please repeat the last question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4374.817,
    "end": 4375.037,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.418,
    "end": 4386.97,
    "text": "The last question was, is there any hypothesis that people on the autism spectrum have different traits due to their perception and action dynamics being different rather than just brain differences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.302,
    "end": 4397.644,
    "text": " So if I understood correctly, I disconnected my camera so that maybe I can hear better the sound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.964,
    "end": 4410.768,
    "text": "If I understand correctly, is that whether autistic people might differ not only in terms of brain function, but also action and perceptual styles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.108,
    "end": 4411.328,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.388,
    "end": 4411.868,
    "text": "Is that true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.748,
    "end": 4420.352,
    "text": " Yeah, this is exactly what our hypothesis is touching upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.793,
    "end": 4436.34,
    "text": "It argues that autistic people and other so-called neurotypical people might differ across different levels of description, from brain function to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.316,
    "end": 4450.645,
    "text": " to the way that they generate expectations, especially about the social world, and to the way that they express these expectations, especially about others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4450.965,
    "end": 4465.838,
    "text": "So grounded in individual accounts of predictive processing and active inference, we argue here that in taking predictive processing and active inference as our two main pillars,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.551,
    "end": 4493.22,
    "text": " We see here that when you confront two systems that entertain completely different, not completely, but different styles of generating and expressing social expectations, this might create a misadhuman situation where these styles, if left spontaneously,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.34,
    "end": 4502.485,
    "text": " evolve in a more and more divergent situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.085,
    "end": 4524.342,
    "text": "So starting from simply checking the precision updating in single brains, we can reach through predictive processing to generating of social expectations about others and through active inference to the way we generate or express these expectations through action to others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.921,
    "end": 4536.292,
    "text": " And especially when we take into account the other also, we see how the similarity of these ways can contribute in different scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.673,
    "end": 4544.561,
    "text": "So, for example, borrowing the terminology of dynamical systems, for example, one can see how considering",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.355,
    "end": 4565.81,
    "text": " this diode as a one system, how this system can evolve very differently even when a small mismatch is present in the beginning of an interaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.313,
    "end": 4567.633,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.174,
    "end": 4573.418,
    "text": "And it just sort of cracked me up because we're almost replicating your experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4573.638,
    "end": 4581.344,
    "text": "We're having a mediated dialectic, a dialogue, and then now you can see me, but I can't see your face.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.364,
    "end": 4587.868,
    "text": "And then there's even another level of the affordance with our friends and colleagues who can ask us questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.829,
    "end": 4617.019,
    "text": " and it's like everybody has their own perspective every question is coming to the top of the mind for someone and then it's through that interaction that we're who we are as individuals and as a lab so just really you know cool to hear how you brought complexity science and all these different world knowledge tradition together to also address like very very prescient social issues so another question from the chat yvonne asks",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4617.839,
    "end": 4621.561,
    "text": " How can I be sure that someone else's social beliefs are actually the same as mine?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.142,
    "end": 4623.783,
    "text": "How can I believe?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.123,
    "end": 4628.446,
    "text": "How can I be sure that someone's social beliefs are the same as mine?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.34,
    "end": 4630.9,
    "text": " Okay, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.361,
    "end": 4636.863,
    "text": "So for that, I guess you can never be sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.024,
    "end": 4640.965,
    "text": "Like this is exactly the Bayesian framework also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.405,
    "end": 4654.751,
    "text": "That's the beauty also, I think, that we don't necessarily dichotomize beliefs between, for example, sure or not sure, but we place on our beliefs different levels of confidence or precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.17,
    "end": 4670.0,
    "text": " And like in a recent collaboration with some colleagues, as Leo Christoph Moore, we examined conceptually the problem of trust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.721,
    "end": 4680.989,
    "text": "And there we argue, for example, that trust, interpersonal trust is fundamental in this kind of relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.513,
    "end": 4696.919,
    "text": " based on our belief of predictability of the other and consistency and also that the other would like to treat us well, so on a belief of belonging and also on shared values, so we just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.463,
    "end": 4700.884,
    "text": " accept that we share values with some certain people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4701.225,
    "end": 4720.953,
    "text": "Based on these three points, we argue that people should necessarily entertain trust about others in social interactions in order to make our social interaction functioning well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.173,
    "end": 4725.295,
    "text": "We, in fact, argue with Leo Christoph Moore that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.261,
    "end": 4741.427,
    "text": " This is an inescapable practice in real-life social interactions just because we are not able to track and monitor every possible incident in our world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.961,
    "end": 4753.749,
    "text": " The next possibility is just to get paranoid and try to control and monitor the behavior of everybody in order to have access to everybody's beliefs and actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.87,
    "end": 4772.323,
    "text": "But instead of that, I think we, as humans, deeply trust, which of course sometimes is, we argue that it's always crucial, like already from hunter gathering, from ancient societies, like from Tomasello work, we see how people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4773.272,
    "end": 4785.542,
    "text": " based on trust, they were able to hunt in more complex scenarios and provide for themselves the means to survive in ecological crisis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.963,
    "end": 4791.807,
    "text": "But we also argue that trust also can go wrong in certain times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.048,
    "end": 4802.215,
    "text": "Of course, in these cases, in a betrayal of trust, the consequence can be dramatic, both in individual and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.891,
    "end": 4804.694,
    "text": " social level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.895,
    "end": 4812.608,
    "text": "So this work where Leo Christoph Moor is the first author will be published soon in a book chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.595,
    "end": 4813.855,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4815.596,
    "end": 4817.937,
    "text": "Really nice point about the trust and the sense-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.657,
    "end": 4820.098,
    "text": "You're giving sentence after sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.158,
    "end": 4821.619,
    "text": "I just have to trust you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.279,
    "end": 4828.281,
    "text": "And anything cognitively that demands more than just simply trusting you is just not going to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4828.662,
    "end": 4831.083,
    "text": "So here's a question from Laura in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4831.503,
    "end": 4833.144,
    "text": "Laura writes, thank you, Dr. Bolas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4834.204,
    "end": 4844.566,
    "text": " I would like to know if it would be necessary to standardize the individuals from different cultures, conforming, composing a dyad to avoid distractors when you evaluate the interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4844.866,
    "end": 4847.027,
    "text": "So how do we think about culture and the dyad?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.267,
    "end": 4848.847,
    "text": "How do we control or explore that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4850.427,
    "end": 4850.667,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.707,
    "end": 4863.19,
    "text": "So our hypothesis would go beyond like we used autism as a paradigm example, but goes beyond that and how it could",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.854,
    "end": 4891.236,
    "text": " accommodate any cultural difference or difference in beliefs in a simple way, like I said, for example, by deploying a diet structure where we have homogenous diet structure, for example, people of the same A culture and people from the same B culture and mixed, for example, groups and see how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.901,
    "end": 4911.454,
    "text": " different processes play out, and then we can tease apart, at least at a certain extent, which processes play out within specific cultures or what process might emerge just out of the communication between cultures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.694,
    "end": 4918.819,
    "text": "And then we can maybe see how the meeting of cultures can provide new possibilities, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4919.279,
    "end": 4920.881,
    "text": "And just culture is just one aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.652,
    "end": 4927.636,
    "text": " in my mind also socio-economic background is also of huge importance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.296,
    "end": 4940.506,
    "text": "So people also don't differ only in cultural practices, but they differ a lot in their socio-economic background and their intentions and motivations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4941.026,
    "end": 4951.834,
    "text": "So some people try to change certain aspects of their socio-economic niches because they are not satisfied",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4953.451,
    "end": 4965.818,
    "text": " and even in the level that they cannot survive as a group, other people try to preserve and maintain certain socioeconomic contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.218,
    "end": 4976.243,
    "text": "So I think it's a very diverse... Even in our case that we studied the similarity of artistic traits, I consider it as an oversimplification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4977.343,
    "end": 4980.265,
    "text": "We found some interrelationship in friendship quality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.904,
    "end": 4983.986,
    "text": " But still, that's just one factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4984.126,
    "end": 4994.056,
    "text": "I think there are so many factors play out in interpersonal attunement, which is good to try to isolate certain aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4994.596,
    "end": 5001.203,
    "text": "But I think at the end of the day, we should try to see the big picture in real life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.717,
    "end": 5003.017,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.157,
    "end": 5009.279,
    "text": "It's almost like the ancients and their different concepts of friendship, different kinds of friendship or different words for friendship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.319,
    "end": 5013.441,
    "text": "And so quality is going to be a multidimensional attribute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.701,
    "end": 5015.121,
    "text": "So Tad asks a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5015.881,
    "end": 5023.784,
    "text": "One thing that humans seem to excel at is successfully interacting with complete strangers, people we have not yet had time to attune to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5024.244,
    "end": 5026.645,
    "text": "How does your approach explain or address this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5027.694,
    "end": 5035.216,
    "text": " Yes, so as I said, like interpersonal human in the early development, I think, and attachment theories are very important here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.696,
    "end": 5044.579,
    "text": "So I think that we are embedded from day one to the social net, social cultural net of our world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5045.279,
    "end": 5055.422,
    "text": "And that's why we are able to communicate with a complete stranger, because just simply because we both acquired common knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.943,
    "end": 5057.303,
    "text": "This can be language, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.331,
    "end": 5071.357,
    "text": " So we can still communicate with an animal, for example, with our dog, but less successfully usually than with other humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5071.757,
    "end": 5075.679,
    "text": "But also you see how dogs and humans also came closer across evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5076.4,
    "end": 5080.562,
    "text": "And we are more able, because we gain common ground here, and we are more able to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5081.102,
    "end": 5087.525,
    "text": "So imagine other type of animals, more wild animals, usually we are more difficult to communicate and make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.248,
    "end": 5088.949,
    "text": " of these animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.349,
    "end": 5091.37,
    "text": "But here again, trust, I think, is very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5092.471,
    "end": 5097.475,
    "text": "We grew up in completely different places, let's say, with completely different people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5097.495,
    "end": 5103.26,
    "text": "And we don't know how each other grew up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.88,
    "end": 5115.909,
    "text": "But just by sharing common values and common ground, and just by being able to trust others, this can make interaction functioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5116.89,
    "end": 5117.951,
    "text": "Like when, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.719,
    "end": 5124.062,
    "text": " people of different cultures invaded other places that they see for the first time people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.522,
    "end": 5133.226,
    "text": "We saw atrocities, for example, because people didn't trust the people that they met or they have, of course, other interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.066,
    "end": 5140.469,
    "text": "But we see that when we meet an unknown person, of course, both possibilities are open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5140.609,
    "end": 5142.39,
    "text": "We can be kind and functioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5142.75,
    "end": 5147.112,
    "text": "We can be also very vicious, I mean, as a human species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.854,
    "end": 5148.587,
    "text": " across our history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5149.181,
    "end": 5161.029,
    "text": " Yeah, it's interesting how you brought up the incentives and the intentions almost separately because there are situations that could be win-win, but then the communication or the narrative breaks down and then there's atrocity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5161.469,
    "end": 5165.012,
    "text": "Or there are cases when actually the game theory is set up adversarially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.032,
    "end": 5172.477,
    "text": "And then it also reminds me of our embodied and encultured nature as humans and what we share.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5172.657,
    "end": 5178.521,
    "text": "Even when we don't share language, like when I've been traveling and not spoken the language, I'll see some street food and it's like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5179.261,
    "end": 5206.83,
    "text": " it's you can communicate with your body and with your actions that you think it looks like great food or that you want the food and so it's like everyone tastes you know same taste molecules maybe it's a preference culturally whether it's spicy or sweet but then that's still like a communication and an interaction and an attunement that is with money that one person is not familiar with a language and a context so that's really nice um i'll ask one more question or is that cool",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5207.816,
    "end": 5208.136,
    "text": " Yes, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5208.637,
    "end": 5208.837,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5208.917,
    "end": 5211.018,
    "text": "Okay, I have two more questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5211.038,
    "end": 5213.9,
    "text": "The first one is, where does active inference come into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5214.081,
    "end": 5222.186,
    "text": "Or where do you see active inference being able to sort of meet this very large philosophical tradition that you're bringing here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5223.347,
    "end": 5223.968,
    "text": "Yeah, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5226.418,
    "end": 5250.544,
    "text": " As we saw in the beginning of the presentation, I see active inference and predictive processing as, let's say, a dialectical interplay of two strategies, as suggested from Carl Fritschmann and other people before, as an interplay for making sense of and acting upon the world in order for us to survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5250.744,
    "end": 5253.625,
    "text": "So I see active inference as the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.072,
    "end": 5262.276,
    "text": " the active possibility we have in order to maintain our living form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.416,
    "end": 5268.161,
    "text": "So not just by conforming with the environment, but changing the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.121,
    "end": 5283.732,
    "text": "And I found this very neat in this, what I found very neat in this account is that we can, with the same terminology, we can account for both perceptual learning processes and active action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5283.832,
    "end": 5284.513,
    "text": "So we see how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5285.174,
    "end": 5288.316,
    "text": " our perception, learning, and action becomes just one whole process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5288.796,
    "end": 5291.738,
    "text": "That's why I see them as a dialectical phenomenon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.618,
    "end": 5294.479,
    "text": "They are inseparable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5294.9,
    "end": 5312.389,
    "text": "And what I tried when I started studying these processes some eight, nine years ago in Zurich with Klaas and Stefan, this completely transformed the way I see even the world myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.661,
    "end": 5328.786,
    "text": " but gradually start feeling that just by focusing on individual processes or even both active inference and predictive processing might limit our scope of interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.166,
    "end": 5340.79,
    "text": "So this exactly, in my PhD, I tried to bring together different philosophical or scientific frameworks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.5,
    "end": 5349.302,
    "text": " to try to embed this kind of accounts in a more social cultural real life context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5349.882,
    "end": 5358.005,
    "text": "So in this effort, for example, also ecological and active approaches that I referred are instrumental also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5361.806,
    "end": 5367.087,
    "text": "So I would like to see in the future a fusion of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5367.911,
    "end": 5387.358,
    "text": " Philosophical approach is that they see the wholeness of the real life phenomena such as dialectics with more formal ways of interpreting data such as active inference and also more ecological and active approach and complexity approach such as dynamical system in one story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.058,
    "end": 5394.42,
    "text": "And CSI say, for example, one way I have seen this happening is that like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5395.006,
    "end": 5422.724,
    "text": " simply perhaps in one paper of ours we suggested that bringing together dialectics and then activisms with active inference we can still keep our emphasis on social interactions and the embedness of organisms in the social world but also using powerful computational tools",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.302,
    "end": 5427.603,
    "text": " to examine the individual brains, which are embedded in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5428.123,
    "end": 5449.387,
    "text": "So I think an extension of this kind of active inference accounts, perhaps through works such as Chris Mattis and Zhang Donizhou, where they have proposed two-level meta-Bayesian approaches, where by deploying this, they suggested this kind of framework for studying both learning and decision-making in two levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5450.766,
    "end": 5459.391,
    "text": " we have suggested that we can reappropriate this kind of models for studying individual brains and collective action in the same model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5459.911,
    "end": 5467.375,
    "text": "And these two, our suggestion is here that these two levels might not even entertain the same mechanisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.456,
    "end": 5471.217,
    "text": "So in the brain, we might have a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5471.761,
    "end": 5485.824,
    "text": " a certain way of minimize prediction error and keep consistent form in social interactions between people might have different mechanisms that might have been described more efficiently with an activist account, for example, or dynamical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5486.084,
    "end": 5497.787,
    "text": "But I think by bringing together these tools, a more complete picture of both the sociological processes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5498.473,
    "end": 5506.672,
    "text": " and the actual mechanisms at the biological level might, and how this feedback to one another might become more apparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.854,
    "end": 5509.094,
    "text": " Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5509.174,
    "end": 5512.076,
    "text": "You know, I was going to ask what the next research steps were.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5512.476,
    "end": 5513.717,
    "text": "That was quite an agenda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5513.817,
    "end": 5516.158,
    "text": "I mean, it's really awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5516.578,
    "end": 5523.922,
    "text": "Maybe just on a closing question note, what would you like to just close with or where are we going to go from here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5524.042,
    "end": 5529.025,
    "text": "What are your next research steps or what are you excited to see the community be looking into?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5530.386,
    "end": 5536.649,
    "text": "Yeah, as I just mentioned, I would be very excited to see this kind of school of thoughts coming",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.142,
    "end": 5560.805,
    "text": " more closely together i think more and more people are working lately on this bringing insights of of more social instructional approaches and more formal brain approaches together and also philosophy and practice i think it's very important here as we go to always argue that um like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5562.821,
    "end": 5570.086,
    "text": " a fact is data are never objective facts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5570.106,
    "end": 5574.028,
    "text": "So as soon as we gather specific data already, we employ theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5574.168,
    "end": 5586.976,
    "text": "So only the way we deploy, I think philosophy is very important here to form new experiments and new models, not only for interpreting data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.736,
    "end": 5590.838,
    "text": "And also this is from the research part, but also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5591.762,
    "end": 5617.684,
    "text": " uh practice is very important um so i would like really this kind of approaches to be used in practice in real life for example in psychiatry is one domain where we can re-examine more holistically certain conditions for example in the past we had more sociological more like social psychiatry examined also the external factors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5619.491,
    "end": 5622.032,
    "text": " like the impact of society in specific conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5622.752,
    "end": 5637.096,
    "text": "Later, we had more cognitive model and biological genetic models where we try to identify, redefine psychiatric condition based on the genetics or cognitive abilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.996,
    "end": 5643.938,
    "text": "I would be very happy to see now these two coming together and one informs the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5643.958,
    "end": 5645.498,
    "text": "So a more evidence-based",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5647.133,
    "end": 5661.049,
    "text": " holistic sociological approach in concrete applications of social policy such as psychiatry, education and other societal domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5663.854,
    "end": 5664.995,
    "text": " Wow, very cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5665.456,
    "end": 5669.52,
    "text": "So thanks a lot for joining this guest stream too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5669.88,
    "end": 5678.788,
    "text": "It was really a great discussion and really we're looking forward to seeing what happens with this line of research and hopefully talking to you and colleagues at future times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5679.129,
    "end": 5680.991,
    "text": "So we'll certainly see you around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5681.011,
    "end": 5686.996,
    "text": "Thank you very much for inviting and thank you very much for your great initiative in providing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5688.14,
    "end": 5690.862,
    "text": " these seminars, which are very illuminating so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.383,
    "end": 5691.623,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5691.983,
    "end": 5692.463,
    "text": "Talk to you later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5692.503,
    "end": 5693.224,
    "text": "Talk to you again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5693.504,
    "end": 5693.724,
    "text": "Ciao.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.125,
    "end": 5694.265,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]