[
  {
    "start": 10.865,
    "end": 13.287,
    "text": " Hello and welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.567,
    "end": 21.194,
    "text": "This is Active Inference guest stream number 3.1 and we're really excited to be here today with Sarah Hashkus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.995,
    "end": 28.12,
    "text": "We are going to be talking about, as the title slide suggests, Active Inference VR and psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.461,
    "end": 34.847,
    "text": "So Sarah, I'll leave it to you to just introduce the topic yourself and the ideas however you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.587,
    "end": 50.375,
    "text": " and it sounds like we're going to be having a first section of the presentation then a question and answer and then a second section of the presentation and then we're going to have a second overall discussion so with that kind of structure in mind just introduce yourself and please take it away",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.448,
    "end": 52.088,
    "text": " Hi, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.709,
    "end": 63.614,
    "text": "So yeah, we're going to be talking first about my research in VR and active inference, and then my research in psychedelics and how it relates to a few issues about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.254,
    "end": 66.736,
    "text": "And we'll have a short break in the middle of our questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.85,
    "end": 70.572,
    "text": " My name is Sarah Hashketh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.673,
    "end": 74.635,
    "text": "I have a master's degree in cognitive neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.276,
    "end": 88.527,
    "text": "I opened the first VR lab in the motor control department at Radboud, where I was researching VR's effects on our brain-body connection within the predictive coding framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.188,
    "end": 91.17,
    "text": "I am now CEO of Radix Motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 91.63,
    "end": 101.116,
    "text": " We're a startup that combines neuroscience and immersive technology, and we're focusing on empowering the psychedelic ecosystem with embodied tech.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.117,
    "end": 103.858,
    "text": "So yeah, let's get right to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 104.438,
    "end": 109.861,
    "text": "A lot of this is basically all of this lecture is based on my research from academia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.881,
    "end": 114.544,
    "text": "It was pretty nice to go back and reread all the things from 2017.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.383,
    "end": 125.07,
    "text": " But before I actually get into it, I'd like to activate our active inference and very short interactive experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.17,
    "end": 130.194,
    "text": "So wherever you are, especially if you've been sitting a lot, I actually suggest you stand up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.536,
    "end": 135.578,
    "text": "And hopefully you can see my hand on the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.598,
    "end": 139.061,
    "text": "And I'm going to ask you to put your hand in front of my screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.662,
    "end": 142.603,
    "text": " and just follow it for a few minutes or moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.623,
    "end": 144.683,
    "text": "How about do it with your mouse, move your mouse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.164,
    "end": 148.245,
    "text": "Oh, okay, well, okay, we can do that too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.265,
    "end": 152.286,
    "text": "If you can see the, oh, I see, you're not seeing my face in this, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.966,
    "end": 159.268,
    "text": "Yeah, so follow the mouse for a few seconds and see if you can track this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 160.408,
    "end": 162.209,
    "text": "So what just happened here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.229,
    "end": 162.589,
    "text": "So, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.404,
    "end": 168.667,
    "text": " I gave you auditory instruction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.168,
    "end": 177.594,
    "text": "That hit your brain and created a goal, a top-down prediction that you were supposed to, well, you didn't see my hand, you saw my mouse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.155,
    "end": 185.3,
    "text": "But basically, that prediction was that the position of your hand to the mouse should be the same position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.64,
    "end": 186.761,
    "text": "The difference should be zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.823,
    "end": 200.13,
    "text": " Now, your eyes were then giving you bottom-up sensory input that were telling you, oh, there's this difference between the mouse and the hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 201.011,
    "end": 205.654,
    "text": "And due to active inference, wanting to minimize this prediction error,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.192,
    "end": 208.174,
    "text": " your hand was moved towards the mouth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.234,
    "end": 222.925,
    "text": "So this is a very simple example of active inference, and this follow me instruction and activity is really quite basic for how we learn motor skills as children.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.985,
    "end": 234.754,
    "text": "And you can see this in the way kids play games, if it's Simon Says or Patty Cake, and the way children look to their adult figures to actually copy them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.851,
    "end": 238.496,
    "text": " and learn movement patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.516,
    "end": 242.444,
    "text": "And this follow me example was part of the research I was doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.524,
    "end": 243.626,
    "text": "So we'll get into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.734,
    "end": 248.675,
    "text": " So what exactly was I trying to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.735,
    "end": 265.322,
    "text": "Well, I was really hoping that if I could receive visual cues from inside of a body of a professional mover, I would be able to activate this active inference ability of my brain and actually improve my movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.902,
    "end": 273.705,
    "text": "I have a background in martial arts and dance, but I'm actually from childhood, a very clumsy human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.141,
    "end": 278.683,
    "text": " that took me really, really, I guess, a lot longer to learn motor skills.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.763,
    "end": 280.624,
    "text": "And I was looking for a way to hack this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.304,
    "end": 288.667,
    "text": "And I kept dreaming, oh, if I could just be inside the body of my martial arts teacher, would I be able to punch like him?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.387,
    "end": 292.969,
    "text": "Would my body learn to adapt and move faster and more accurately?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.729,
    "end": 298.451,
    "text": "Because I would be receiving this prediction that I am actually him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.258,
    "end": 305.941,
    "text": " So this is sort of where I started exploring how I could research this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.522,
    "end": 309.883,
    "text": "Now, why would I even think it's possible using VR?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.443,
    "end": 313.685,
    "text": "So part of the things about VR is that it doesn't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.252,
    "end": 329.675,
    "text": " just activate your visual sensation uh and sensory input it's actually a multimodal integration between your visual perception and your proprioceptive auditory and even haptic if you're currently using uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.095,
    "end": 331.435,
    "text": " like haptic controllers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.235,
    "end": 337.416,
    "text": "In my experiment, I just was like, we were using the SDK one of Oculus, no haptic controllers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.536,
    "end": 342.737,
    "text": "I was connecting them to lab equipment to get positions of the hands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.338,
    "end": 355.46,
    "text": "But we were still connecting visual and proprioceptive sensations, meaning basically when you move your neck around, the world is still moving the way you're expecting it to move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.075,
    "end": 365.082,
    "text": " So you're getting the same upper body and neck activations of muscles of where you are in space, along with your visual perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.162,
    "end": 373.068,
    "text": "And that activates these higher brain areas and really gives you this, what we call the sense of immersiveness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.108,
    "end": 373.488,
    "text": "Immersion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.508,
    "end": 374.389,
    "text": "You're in that place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.449,
    "end": 378.572,
    "text": "Your brain believes it's real, even though parts of you know that it's not real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.031,
    "end": 393.099,
    "text": " Now VR really gives us a very unique ability to influence the brain because we can start controlling the relationship between the different senses in ways that either fit these previous top-down biases or don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.86,
    "end": 401.504,
    "text": "So we can this way really modulate the amount of prediction error that we're receiving and activating in a person's brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.419,
    "end": 418.099,
    "text": " And there's really a lot of experiments out there that have been done, for instance, with anorexia patients and people with pain issues that really prove that we can give a new sense of self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.037,
    "end": 446.361,
    "text": " um to a person so when i talk about a sense of self what am i talking about from the predictive coding perspective it's the really really uh um great uh paper by absentus curious um that really i go about explaining this concept of a minimal self being uh the top down prediction that just explains the sensory correlations between the different senses",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.439,
    "end": 450.261,
    "text": " And a great example is the rubber hand experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 450.741,
    "end": 463.73,
    "text": "So if you don't know this, your hand is actually hidden from you, like in the photo, but it's receiving sensory input at the same frequency that you're seeing a rubber hand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 464.27,
    "end": 465.732,
    "text": " being stimulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.353,
    "end": 469.136,
    "text": "Now researchers are a bit cruel with this experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.196,
    "end": 480.611,
    "text": "They at some point take a hammer and smash the rubber hand and you can really see and register and record the physiological measurements from the person and how that person gets stressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 481.211,
    "end": 486.694,
    "text": " Now, newer research is actually showing that this isn't the same for everybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.094,
    "end": 491.356,
    "text": "There's some people that seem to be more susceptible to this versus others that don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.376,
    "end": 500.94,
    "text": "There's some amount of suggestibility and I guess maybe strength of what is your own self versus how mutable this top-down prediction is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.82,
    "end": 524.882,
    "text": " in society might be actually quite different and we'll talk about that later but generally this there is a very strong ability for us to change our sense of minimal self and we do this all the time when we wear clothing our predictive abilities become able to just predict away the sensation unless you know you're somewhere on their autistic spectrum and then every little itch and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 525.882,
    "end": 548.807,
    "text": " sock can drive you crazy but also using tools these ability to really extend what we call our minimal self so I was hoping that with VR I'd be able to transfer myself from a clumsy person into somebody that can do movements that are much much more difficult and a much faster time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.518,
    "end": 553.38,
    "text": " So what did I actually do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.46,
    "end": 558.924,
    "text": "I needed to find a task that was known to be a hard task that I could measure, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 559.044,
    "end": 560.124,
    "text": "What is the difference here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.605,
    "end": 563.607,
    "text": "So I went with a task that's called bimanual interference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.227,
    "end": 572.853,
    "text": "So bimanual interference is basically our inability to create different movements with different hands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.374,
    "end": 577.276,
    "text": " and get an actual interference pattern between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.057,
    "end": 586.383,
    "text": "A very simple game, which is what I coded in my experiment, is try to make a circle in one hand and a square with the other, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.863,
    "end": 588.845,
    "text": "And just try for a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.585,
    "end": 599.093,
    "text": "And what basically happens is that you go between phases of making circular movement and phases of making square movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.973,
    "end": 600.154,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.521,
    "end": 608.865,
    "text": " I set out to look at this task and see, can I improve this task in people with various VR interventions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.646,
    "end": 614.889,
    "text": "So, oops, I don't know why this is finding here, but okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.929,
    "end": 620.752,
    "text": "So let's look at a little bit at the experimental design exactly of all the different things that I was doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.772,
    "end": 624.054,
    "text": "And I'm not going to go into exactly all the analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.094,
    "end": 626.636,
    "text": "You can read the paper because I want to talk more about like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.523,
    "end": 634.709,
    "text": " the actual discussions and what are the ideas that come from this that we can implement in our daily lives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.23,
    "end": 639.632,
    "text": "But there were basically a few different conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.313,
    "end": 654.284,
    "text": "One condition was a follow me condition, similar to what we did at the beginning of this lecture where you had an avatar that was able to do these movements and you were instructed to follow the avatar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.244,
    "end": 657.186,
    "text": "The other instruction was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.935,
    "end": 659.317,
    "text": " complete the movements yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.598,
    "end": 664.485,
    "text": "So there's a self experiment and there's a follow experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.066,
    "end": 673.779,
    "text": "Now on the follow experiment, we were actually discovered that we needed to hide the square and circle because the minute people were",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 674.459,
    "end": 679.281,
    "text": " already predicting that we're doing a square and circle, they were not following as much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.781,
    "end": 690.584,
    "text": "So when you were following, you were doing random follow movements along with periodic small parts of circles and squares, which I then analyzed specifically those parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 692.345,
    "end": 701.948,
    "text": "So that was one, just like I'm going to say sort of baseline condition to see what is the difference between following someone versus doing these movements yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.081,
    "end": 712.641,
    "text": " And the second line that you can see on this design experiment was a bit of making things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.247,
    "end": 716.309,
    "text": " a stranger with what we can do with VR.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.769,
    "end": 722.955,
    "text": "So the second condition, when you moved your right hand, you actually saw your left hand move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.235,
    "end": 727.539,
    "text": "Now there's no way I can recreate this for you without putting you inside of VR.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.919,
    "end": 729.561,
    "text": "It's a very trippy experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.741,
    "end": 731.242,
    "text": "Everybody's like, wait, what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.843,
    "end": 736.267,
    "text": "You're like moving your right hand, but your left hand is moving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.088,
    "end": 740.23,
    "text": "And that really like messes up your predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.991,
    "end": 754.041,
    "text": " Now, the third experiment, I put you inside of the avatar that was able to do these movements and then told you follow the movements or just become this avatar and follow the movements from within this avatar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.661,
    "end": 757.884,
    "text": "So we actually manipulated two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.544,
    "end": 761.186,
    "text": "One is the high level task goal, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 761.566,
    "end": 763.267,
    "text": "Follow versus move yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.148,
    "end": 771.152,
    "text": " Now, we assume that the self movement has a very strong hyper prior of allowing only one task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.813,
    "end": 780.238,
    "text": "This is something that we're sort of meant to be doing naturalistically, one task at every given time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.358,
    "end": 790.645,
    "text": "We also have this basal ganglia that's really blocking more than one activation of a physiological motor activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.525,
    "end": 797.371,
    "text": " So that was one thing we manipulated, follow versus do yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.851,
    "end": 800.734,
    "text": "And the second manipulation was of the visual feedback, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.154,
    "end": 802.916,
    "text": "Do you see your own hands moving?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.936,
    "end": 805.799,
    "text": "Do you see your weird cross hands moving?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.359,
    "end": 812.285,
    "text": "Or do you see an avatar's hands moving from the perspective of your own hands?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.176,
    "end": 822.747,
    "text": " Now, there's, again, the difference here when I crossed your hands, we're really giving you lots of prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.988,
    "end": 829.857,
    "text": "This is prediction error that doesn't fit the normal minimal self activation and predictions that you have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.37,
    "end": 843.661,
    "text": " versus when I'm putting you inside of an avatar that's moving in the same way that you are trying to move, I'm actually not doing something that's against this minimal self prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 843.761,
    "end": 847.104,
    "text": "And we'll see how these things gave different results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.805,
    "end": 852.909,
    "text": "So let's start with the first thing that I was most",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.908,
    "end": 860.532,
    "text": " Hoping to get, oh, I'll just plop myself into an avatar that can do these movements and I'll be able to do them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 860.992,
    "end": 862.113,
    "text": "Well, that didn't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.313,
    "end": 865.295,
    "text": "In fact, we got the exact opposite.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 865.815,
    "end": 872.88,
    "text": "So when I say this increased the interference, it means that the people were less able to perform this difficult task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 874.037,
    "end": 885.193,
    "text": " They were having even more periods of both hands doing the same thing, either circle or square, and not able to differentiate each of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.074,
    "end": 907.716,
    "text": " What actually likely happened here, and this is sort of a theory because I was not looking at neural correlates, I was just looking at behavioral data, but there is a general consensus in literature that the visual modality, at least for most of us, is much stronger than proprioception data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.517,
    "end": 914.503,
    "text": " So it seems that we were getting this mismatch between the sensory input, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.783,
    "end": 922.271,
    "text": "Of I'm seeing my hands doing the thing, but I'm feeling my hand in a different place, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.751,
    "end": 925.994,
    "text": "Now I was hoping that would cause active inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.815,
    "end": 952.344,
    "text": " pulling your hand to where they're supposed to be but it seems that the actual actually the opposite happened and because when i i asked people they were all actually believing that they were doing the task better some of them actually thought they were the avatar they didn't even realize that this was a pre-programmed avatar they thought it was them um and all of them reported it to be easier",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.582,
    "end": 971.415,
    "text": " um so but when i looked at the data all of them were actually doing um much worse so it seemed that the visual modality caused the proprioception modality to actually uh lower and become you know less accurate and your brain decided when it has this this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.139,
    "end": 974.622,
    "text": " a higher prediction error, there's a few tactics it can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 975.062,
    "end": 976.203,
    "text": "One is active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.284,
    "end": 980.088,
    "text": "The other is modulate one of the sense modalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.168,
    "end": 981.629,
    "text": "And it seems that that's what it did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.09,
    "end": 988.577,
    "text": "Just lowered the proprioception, stuck with the sensation from the eye, which it could predict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.997,
    "end": 991.4,
    "text": "And that's the way it sort of minimized the prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 991.98,
    "end": 999.424,
    "text": " So we can talk a bit more in the discussion about the meaning of this and what it means for training.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.544,
    "end": 1008.769,
    "text": "But this was, again, it was against what I was hoping and against my initial prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.809,
    "end": 1020.616,
    "text": "But thinking about this a bit deeper, it doesn't make sense because accurate feedback of what you're actually doing seems to be incredibly, incredibly important for learning any type of skill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.596,
    "end": 1031.299,
    "text": " So giving this false feedback of somebody doing the movements seems to not be the way to go around actually teaching movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.319,
    "end": 1043.422,
    "text": "An experiment I would love to conduct in the future is having both of these as an overlay, like have the avatar that's able to do the movements, but still give you a physical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.443,
    "end": 1047.746,
    "text": " ability to actually know where your hands are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.766,
    "end": 1057.395,
    "text": "And this is something that if people have VR, they can actually download my VR app that's called Miu, which lets you play with these things yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.555,
    "end": 1065.022,
    "text": "It basically records 3D movements, and then you can move around them and also get haptic feedback and see where your hands are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.183,
    "end": 1082.937,
    "text": " So I played around with that a bit with like professional jugglers creating movements and then me stepping inside and needing to follow their hands, but also receiving the feedback of where my hands are through haptic feedback and visual perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.118,
    "end": 1086.78,
    "text": "But I did not do an academic research on that yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.261,
    "end": 1089.563,
    "text": "And that I think could be really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.604,
    "end": 1099.391,
    "text": " because I think there might be something there because obviously the prediction error was increased, meaning your brain needs to deal with this prediction error in some ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.992,
    "end": 1112.895,
    "text": " So there is a potential of still creating better updates and maybe activating this active inference ability, but we need to not only trust the visual perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.876,
    "end": 1122.498,
    "text": "Visual versus proprioception, the visual just wins and you don't feel where you are anymore at that same level of accuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.138,
    "end": 1152.53,
    "text": " so that was um interesting um now let's look at the other two conditions of what i found so um in the other two conditions i found that when i actually gave people the totally incorrect things that were against their minimal self i crossed their hands they were moving their right hand seeing the left hand something that they've never ever experienced before they were able to follow the avatar better",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.056,
    "end": 1157.859,
    "text": " but the self movements were worse, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.379,
    "end": 1180.495,
    "text": "And that actually does make sense because again, we're interfering with this self level prediction and having to maintain this goal of doing a self movement while your whole minimal self is just like totally wonky and doesn't know what's going on and has a much higher prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.356,
    "end": 1203.964,
    "text": " causing interference and making you not able to do this task as well but a follow task you don't actually need the goal is really different you don't actually need to have a goal high-level goal-oriented self structure that's creating these predictions you just need to really minimize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.52,
    "end": 1210.825,
    "text": " this location and space versus the other person, they were actually doing better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.926,
    "end": 1216.27,
    "text": "And we'll talk a little bit about why that might have happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.772,
    "end": 1219.953,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.633,
    "end": 1227.559,
    "text": "So just one more finding before we go into a bit more of the discussion is that there was actually,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.95,
    "end": 1236.018,
    "text": " Two very different strategies might have been employed here as we see between the two different tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.619,
    "end": 1237.881,
    "text": "When you're in the self-task,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.048,
    "end": 1262.49,
    "text": " um this higher prediction error that you need to deal with is you can't just make yourself disappear you need to keep maintaining this goal so maybe your brain created a weaker prediction right and then it would just like lower that prediction error by having a wider sort of um i guess i'm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.339,
    "end": 1265.802,
    "text": " there's a lot of between like stronger, weaker, and wider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.903,
    "end": 1278.397,
    "text": "My specific professor was very, in the predictive coding scheme, looking at things from actually not a continuous Gaussian, but more of a discrete level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1279.258,
    "end": 1280.499,
    "text": "And a lot of this is about like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1281.499,
    "end": 1300.301,
    "text": " details the level of detail of your prediction so if you have a less detailed prediction you're going to decrease your prediction error right if you say and we'll talk a little bit more about that when we talk about psychedelics because it's very relevant there but if you're just saying okay my hand needs to be around here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1302.236,
    "end": 1308.241,
    "text": " versus your hand needs to be exactly at a specific point, that's another way to decrease prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1308.701,
    "end": 1311.724,
    "text": "So on the self-task, that might be what was happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.084,
    "end": 1320.711,
    "text": "Your brain was just decreasing the detail of the prediction in order to decrease the prediction error, which would result in worse behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.893,
    "end": 1324.414,
    "text": "Versus the follow-up task,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.895,
    "end": 1352.005,
    "text": " your brain might have reduced the prediction error by actually reducing the visual perception and getting on the relative right between proprioception to visual, actually getting more of this proprioception, creating these closer feedback loops with where your body is in space and getting this more independence between your hands because you don't need to have this single task anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.586,
    "end": 1353.646,
    "text": "You're just following.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1355.492,
    "end": 1366.845,
    "text": " And an interesting finding, I don't have the quote of the paper here, but there was a paper that did the exact same task, but with eyes closed and just touch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.762,
    "end": 1377.707,
    "text": " So people had their eyes closed and were just touching something that was moving in a bimanual independent manner, and they were all able to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.827,
    "end": 1383.07,
    "text": "It suddenly from becoming a very difficult task became a very easy task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.73,
    "end": 1392.115,
    "text": "So this really shows that sometimes, and I think anybody that practices movement, it's sort of a common trope, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.495,
    "end": 1414.411,
    "text": " there's a thing of like thinking too much so goal-oriented movement can actually if we are taking this goal-oriented movement and putting it in a way that's too detailed we're telling our brains create these movement paths and create two separate movement paths that's a really not naturalistic state for our brain to be in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.379,
    "end": 1419.561,
    "text": " Um, versus when we're just like, okay, we're following things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.021,
    "end": 1428.905,
    "text": "That's a very naturalistic, uh, the low level feedback between our motor cortex and our proprioception and our sensation can just work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1429.966,
    "end": 1437.369,
    "text": "Um, so yeah, that, that, that's all sort of hopefully under understood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.554,
    "end": 1462.936,
    "text": " um now another finding that that happened was that um there was a much higher variance like i was expecting this to be a very hard task for everyone that's what the literature said um but i found that uh and again this is a small experiment i'm about like 13 uh psych students right um all healthy subjects um young but uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.828,
    "end": 1469.771,
    "text": " Two of them were very able to do the baseline task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.732,
    "end": 1471.673,
    "text": "And that was a surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.933,
    "end": 1483.423,
    "text": "Some of them, the task was so difficult that I could barely use the data because they were literally just moving one hand, the other hand was just freezing in space, and the other hand would move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.803,
    "end": 1485.965,
    "text": "So they weren't even able to maintain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.545,
    "end": 1492.829,
    "text": " these two goals have moved to have in separate ways at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.49,
    "end": 1498.913,
    "text": "So that really goes to show just how different our brains are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.174,
    "end": 1509.54,
    "text": "One of the interesting things to compare this experiment to is binocular rivalry, which has been written a lot about in predictive coding literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.401,
    "end": 1518.485,
    "text": " So for whoever doesn't know this binocular rivalry is when we project two different images onto each eye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.605,
    "end": 1521.827,
    "text": "So one eye is seeing one image you can see in the picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.848,
    "end": 1529.752,
    "text": "The right eye is getting a red image with one angle of direction and the left eye is getting a different one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.252,
    "end": 1532.654,
    "text": "Now, what happens to your brain is it actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.274,
    "end": 1547.201,
    "text": " switches your perception switches between seeing one of the images and the other images with some short phases usually of like mixed perception but really just bouncing mostly between one to the next",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.97,
    "end": 1551.172,
    "text": " Now, here, too, there is a lot of variance in the population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.512,
    "end": 1568.063,
    "text": "And one of the interesting things is that people on this autistic spectrum, which I have endless criticism about the DSM and how we're classifying autism and generally mental health and different types of brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1569.544,
    "end": 1570.986,
    "text": " brain abnormalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.827,
    "end": 1582.756,
    "text": "But some people definitely have much more mixed states than others and different drugs can also affect the ability to have mixed states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.236,
    "end": 1590.963,
    "text": "And it's sort of interesting to compare these two tasks because both of them are sort of creating a bi-stable system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.804,
    "end": 1600.431,
    "text": " coming from an unnaturalistic task or unnaturalistic input that you're not usually supposed to be doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.951,
    "end": 1610.559,
    "text": "Because the way our brain was really meant to be doing motor actions is around high level goals, completing high level goals, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.899,
    "end": 1617.405,
    "text": "Give me the water, turn on the thing, grab, bang.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.725,
    "end": 1620.027,
    "text": "There's always a high level goal that's oriented",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.407,
    "end": 1627.494,
    "text": " towards one of our higher level needs or lower level needs, but like a specific need that you're trying to complete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.576,
    "end": 1642.468,
    "text": "And with this task of telling people, oh, move your hand in this motor pathway and your other hand in this motor pathway, it's very unnaturalistic for our brain, very similar to giving someone",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.505,
    "end": 1646.808,
    "text": " these two different visuals, which we never see in real life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.609,
    "end": 1658.441,
    "text": "So again, this is really correlated to this having a very strong hyper prior in a binocular rivalry situation, your brain has a very strong hyper prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1658.501,
    "end": 1660.023,
    "text": "No, I can just be seeing one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.043,
    "end": 1663.086,
    "text": "This is how the world works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1663.126,
    "end": 1664.308,
    "text": "There can only be one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.788,
    "end": 1665.489,
    "text": " in one place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.869,
    "end": 1670.213,
    "text": "And then your brain activates in order to minimize this prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.333,
    "end": 1673.436,
    "text": "It goes between, okay, I guess I'm seeing this one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.776,
    "end": 1675.358,
    "text": "Now it keeps getting prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.738,
    "end": 1677.28,
    "text": "Oh, I guess I'm seeing the other one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.64,
    "end": 1682.324,
    "text": "So it keeps jumping between these two states in order to minimize the prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.945,
    "end": 1683.085,
    "text": "Now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.013,
    "end": 1696.286,
    "text": " The same thing quite likely is happening with this bimanual interference with having a very strong hyper prior of, oh, I'm only supposed to be doing one task at any given time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.586,
    "end": 1700.35,
    "text": "You're just giving me two different tasks to complete at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.37,
    "end": 1703.474,
    "text": "I'm going to be switching between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.744,
    "end": 1726.98,
    "text": " Now, possibly when you have this different sense of minimal self, this can actually create different activation patterns and let you be more in a mixed state, more in an independent state, have basically weaker hyper priors around either what you're seeing or what your task abilities are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.74,
    "end": 1741.324,
    "text": " So this might be an interesting way of generally like understanding a lot of what our hyper priors are doing to us and just the variance in the population might be around these hyper priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.645,
    "end": 1754.368,
    "text": "So now let's get into like more like what are these possible implications and how can we use this data to like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.336,
    "end": 1760.12,
    "text": " do cool things with rehabilitation and even just training and getting me to be less clumsy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1760.88,
    "end": 1767.665,
    "text": "So one of the things that comes up from this is really naturalistic design of movement goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.165,
    "end": 1774.65,
    "text": "Instead of telling people, you know, move your hand at this angle, reach over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.531,
    "end": 1783.557,
    "text": "And we see this a lot actually in traditional martial arts, they give movements names of activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.414,
    "end": 1786.775,
    "text": " Like in Kung Fu, you have stroking the horse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.755,
    "end": 1788.855,
    "text": "The horse is main.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.856,
    "end": 1795.577,
    "text": "In Karate, we have a move that's called breaking the wall or breaking the gate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.217,
    "end": 1801.759,
    "text": "So having these goals that are really oriented towards task",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1802.329,
    "end": 1813.133,
    "text": " completion versus goals that are too low level are much more likely to activate this active inference in ways that we want them to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1813.774,
    "end": 1826.879,
    "text": "When we put the goals into too low level patterns, we're then creating this sort of unnaturalistic activity and maybe even like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.692,
    "end": 1846.064,
    "text": " slowing things down like the the fast parts of our brain that deal with bringing together these sense modalities of visual sensation and motor actions they need to stay down there they need to not be part of this high level self um um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.103,
    "end": 1850.944,
    "text": " network, part of our hierarchical network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.484,
    "end": 1860.588,
    "text": "And I think that's really interesting because it really is like what I was saying, every martial arts teacher my whole life has told me, stop thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.228,
    "end": 1863.309,
    "text": "And I'm like, I don't know what to do about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.509,
    "end": 1864.669,
    "text": "How can you stop thinking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.15,
    "end": 1871.332,
    "text": "But part of it is letting these low level parts of your body",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.503,
    "end": 1880.967,
    "text": " do the movements while maintaining high level goals that are not oriented to exactly, oh, where's my elbow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1881.007,
    "end": 1882.068,
    "text": "Is it here or here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1883.308,
    "end": 1884.869,
    "text": "Where am I holding my fist?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.929,
    "end": 1897.676,
    "text": "Like all these little details work much better if you give them high level metaphors somehow that your brain, that the lower levels can then take those predictions and minimize prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.636,
    "end": 1913.209,
    "text": " So another interesting part of this is that it might actually explain some of why mirror box therapy works and why mirror box therapy is now something that's also being used in VR and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.258,
    "end": 1933.493,
    "text": " So for whoever doesn't know, mirror box therapy is used on amputees, on people that have pain in one hand, like chronic pain, or even stroke, people that have suffered through a stroke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.073,
    "end": 1944.061,
    "text": "So what you do is you take the body part that is actually okay, that doesn't have pain, that is working, and you use a mirror to then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.758,
    "end": 1954.501,
    "text": " get your brain to believe that your other body part is also moving and is healthy, or even there if it's an amputee.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.081,
    "end": 1962.743,
    "text": "And this was actually figured out by, I think the first person was Ramachandran, working with amputees that were suffering from just phantom pain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.064,
    "end": 1967.205,
    "text": "And how do you get rid of pain from a limb that doesn't exist anymore, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.605,
    "end": 1974.347,
    "text": "This was like a top-down prediction from the injury that was just not getting updated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.925,
    "end": 1977.966,
    "text": " And you see this a lot in chronic pain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.886,
    "end": 1989.209,
    "text": "Really, you see the neural circuitry even change as the predictions for pain just cement themselves and become biases in your brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.629,
    "end": 1993.95,
    "text": "So by using this type of mirror box therapy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.911,
    "end": 2023.938,
    "text": " it helps relieve the pain so why or how is this connected to what we just saw because the visual modality is stronger than the proprioception modality it's not too far-fetched to believe that the visual modality is also stronger than the nociceptors the pain receptors that we're getting so if we can actually cause your brain to believe and and just by seeing cause that visual perception of a healthy hand it might be enough to mute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.339,
    "end": 2026.42,
    "text": " the same way your proprioception was muting,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.789,
    "end": 2031.893,
    "text": " to mute your nociceptors and then reduce the pain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.733,
    "end": 2034.395,
    "text": "So that's really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.535,
    "end": 2040.619,
    "text": "And it's interesting to see they are also starting to use this with stroke victims to actually help them rehabilitate their hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.46,
    "end": 2054.99,
    "text": "And that's really interesting because that's a little bit not in accordance with what I saw from my experiment, but it might be different because they might not be getting current data about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.67,
    "end": 2061.073,
    "text": " And I think it might be really dependent on what the stroke has actually damaged in your brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2061.653,
    "end": 2075.939,
    "text": "If the stroke part has damaged your ability to receive any type of proprioceptive data, then maybe getting that visual perception might help reprogram that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.019,
    "end": 2078.16,
    "text": "There might be less of an interference going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.28,
    "end": 2078.78,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.82,
    "end": 2080.321,
    "text": "It's sort of interesting to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.414,
    "end": 2085.216,
    "text": " So let's see, what are we left with?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.496,
    "end": 2085.757,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.377,
    "end": 2092.804,
    "text": "So now there's basically that third, uh, condition why I gave this crossed hands condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2093.325,
    "end": 2105.398,
    "text": "And I think that's really an underutilized mechanism generally in any type of rehabilitation and training, um, messing your brain up even more in some ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.208,
    "end": 2118.298,
    "text": " And I think that that's a very strong intervention that we could play around with a lot more because it's, you know, 100% we're creating more prediction error that your brain needs to deal with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.778,
    "end": 2120.98,
    "text": "Now, how your brain will deal with that prediction error?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.1,
    "end": 2125.364,
    "text": "Will it actually remodel with a create active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.744,
    "end": 2127.666,
    "text": "Will it reduce some other sensation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.466,
    "end": 2132.85,
    "text": " might really depend on the task, on your brain, on how we do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.97,
    "end": 2138.214,
    "text": "But being able to increase prediction error in your brain is a very powerful ability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.775,
    "end": 2144.78,
    "text": "And I think that's something that really is worth looking into more when we're talking about rehabilitation tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.521,
    "end": 2155.429,
    "text": "And we see these types of things starting to emerge in VR more with like total body replacements, like I was talking about, about like anorexia patients,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.142,
    "end": 2162.726,
    "text": " putting them in a whole new avatar and creating a full body rubber hand experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.826,
    "end": 2170.09,
    "text": "So they're getting sensations on their body at the same time that they're seeing their avatar getting sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.21,
    "end": 2181.277,
    "text": "And it's been proven to help them remodel this top level belief and accurate belief that they have about their bodies being overweight, even though they're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.957,
    "end": 2183.718,
    "text": " So that's very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.758,
    "end": 2190.683,
    "text": "But I think there's really a lot that we can do with massively increasing prediction error in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.743,
    "end": 2202.432,
    "text": "And you see this in a lot of crazy experiments, like the upside down glasses experiment that people just within a short time were able to totally adapt and live in a world where everything is upside down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.233,
    "end": 2208.416,
    "text": "Or with training people on bikes that work in a totally different direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.417,
    "end": 2223.044,
    "text": " sometimes by making things harder, we're making things easier, um, for our brain or we're, we're forcing it out of this, um, minimal potential well that it might fall into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.064,
    "end": 2226.606,
    "text": "It's like, okay, now there's too much prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.686,
    "end": 2228.147,
    "text": "It's time to actually change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2228.767,
    "end": 2235.591,
    "text": "Um, because, you know, we've been talking about like, um, this, this minimal, uh, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2236.109,
    "end": 2243.258,
    "text": " prediction error, if you're in a stable state where you've minimized prediction error, that's not always a healthy thing for brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.521,
    "end": 2251.749,
    "text": "And side note, this is also a model of depression, basically not having enough prediction error in your brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.182,
    "end": 2255.984,
    "text": " falling into a too stable state, a low entropy state of your brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.464,
    "end": 2262.347,
    "text": "So increasing prediction error in many ways can be very important for our physical health, our mental health.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.348,
    "end": 2268.03,
    "text": "And it's something that I personally try to hack on myself all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.511,
    "end": 2271.372,
    "text": "I'll do like dark showers so I can't see anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2272.173,
    "end": 2274.654,
    "text": "I'll try to use my left hand to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.294,
    "end": 2287.181,
    "text": " To use toothbrushes just like very basic daily activities that you get very used to doing Just put another constraint on yourself And make it like a fun game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.261,
    "end": 2294.365,
    "text": "It's also a great way to train and any type of physical task Okay, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.434,
    "end": 2301.677,
    "text": " Yeah, we talked a lot about the visual dominating the proprioceptive, but why, why is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.777,
    "end": 2313.163,
    "text": "So there's a paper from 2009, I'm not gonna, I don't know how to pronounce that you, but their theory was that it's around using tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.783,
    "end": 2332.323,
    "text": " that in order for us to be able to use tools we need to be able to uh not trust the proprioceptive sensation as much as the visual perception because we don't have data from any proprioceptive data of any tool that we're using um so that's a very interesting theory but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.203,
    "end": 2340.205,
    "text": " But for my paper, I think there might be something actually deeper than that going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.545,
    "end": 2346.186,
    "text": "I also think, and this might be interesting to figure out a way to test this on animals that don't really use tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.307,
    "end": 2359.23,
    "text": "But I would expect it to possibly, and this might be very different because some animals, you know, actually smell, their smell world is much more dominant, their hearing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.11,
    "end": 2381.55,
    "text": " But I think that for this goal-oriented movement where we need to coordinate many body parts, you know, you're driving a car, you're just even getting out of bed and getting dressed or walking, all these things require lots of body movements working together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.457,
    "end": 2402.24,
    "text": " In order for that to happen, we really need to reduce the proprioceptive sensation so we can get this high level goal to dictate the lower level hierarchies of the brain to actually pull towards the active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.84,
    "end": 2412.262,
    "text": "If we had very strong perceptions of where we are right now, we wouldn't be able to move into the next state of where we want to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.393,
    "end": 2421.419,
    "text": " So we're taking, our brain is taking this high level goal and breaking it in to movement predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.019,
    "end": 2441.253,
    "text": "And for those movement predictions to be able to move your body into where we want it to be using active inference, we need to weaken where you are currently and have a weaker now in order to get to the future of this goal oriented movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.148,
    "end": 2444.72,
    "text": " That's sort of how I see it, at least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.469,
    "end": 2464.96,
    "text": " A sort of interesting thing that I'd like to talk about, and we can also open this to discussions and questions at the end, is how this connects to flow state and improv and dance and play and all these things that I am totally infatuated with and want to spend most of my time doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.98,
    "end": 2471.064,
    "text": "So flow states, for people who haven't heard this term before,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.64,
    "end": 2480.683,
    "text": " a term that's been coined when athletes or really anybody that's good at a specific task is at their peak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.924,
    "end": 2488.027,
    "text": "It's been sort of defined as being freed from self-consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.007,
    "end": 2490.568,
    "text": "Now, a way to look at it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.175,
    "end": 2513.436,
    "text": " through this lens of these experiments and these hierarchical levels and predictive coding and active inference is that it's basically inhibiting actually these higher level abstract goals and letting us get hyper accuracy within this proprioception modality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.056,
    "end": 2514.757,
    "text": "So really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.427,
    "end": 2517.747,
    "text": " what we call being in the now, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.048,
    "end": 2522.749,
    "text": "Getting incredibly fast feedback loops that aren't about the end goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.229,
    "end": 2527.67,
    "text": "It's not about, if you, I think talk to any of these athletes, it's not about winning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2527.83,
    "end": 2529.49,
    "text": "It's not about getting to the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.89,
    "end": 2538.792,
    "text": "It's just like this pure joy about being in the moment, um, and, and letting your body be right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2539.512,
    "end": 2539.612,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.016,
    "end": 2568.544,
    "text": " and a lot of this uh really might have to do with inhibiting this higher level of our neural hierarchy so we can get this hyper accuracy of proprioception so we can create these fast feedback loops between our body and the environment um to get to this like higher level of performance um and this takes us to more of like improv dance and play that are really non-goal oriented",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.281,
    "end": 2569.441,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.481,
    "end": 2575.645,
    "text": "This is sort of the definition and how I see, you know, there's a big difference between games and play games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.665,
    "end": 2579.847,
    "text": "There's always like you're winning, you're going towards a thing or you're losing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.188,
    "end": 2583.489,
    "text": "But in play, there's none of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.709,
    "end": 2585.15,
    "text": "There's just exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.07,
    "end": 2589.252,
    "text": "The same goes really with improv dance compared to, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.572,
    "end": 2591.513,
    "text": " like ballet or choreographed dance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.833,
    "end": 2596.595,
    "text": "You're just exploring the possibility space of what you can do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.276,
    "end": 2604.539,
    "text": "And that at least for me, and I think, well, not only for me, this is quite widespread.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.639,
    "end": 2612.203,
    "text": "Anybody that is into these things, I think finds them the most joyous and kids find them the most joyous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.403,
    "end": 2618.366,
    "text": "And it's very, very healthy part for our brain to not be in a goal oriented,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.746,
    "end": 2630.392,
    "text": " movement pattern and to just let go and explore without having a high level active inference happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.752,
    "end": 2648.12,
    "text": "Active inference, it's still happening, but it's being sort of driven more by the bottom up signals and really the moment to moment possibilities without having this like, okay, let's do like a pretty move, let's do a pirouette, let's do something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.98,
    "end": 2657.181,
    "text": " Yeah, so I don't think I actually want to show this video right now, but it's more about focused on VR.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.241,
    "end": 2663.563,
    "text": "But if you want to look at it, it's a cool video that's called This is Your Brain on VR that we made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.583,
    "end": 2667.884,
    "text": "Just predicting the sound and stuff won't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2668.696,
    "end": 2694.335,
    "text": " but it sums up a bit about these what we've been talking about uh how different modalities get expressed uh activated in your brain on vr reprogramming your predictions and how we can play with these things okay so yep this this one this was it that's awesome wow i wrote down um a ton of stuff so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.916,
    "end": 2699.297,
    "text": " Shall I ask some questions and then we'll head into another part?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.638,
    "end": 2703.018,
    "text": "Many places to jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.038,
    "end": 2709.1,
    "text": "I really just caught on to this weaker now, like a weaker current moment in order to get further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.601,
    "end": 2715.863,
    "text": "So that, the way you connected that to accessible experiences like the play and the martial arts, really awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.163,
    "end": 2719.004,
    "text": "So when you talked about active inference kicking in,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.708,
    "end": 2727.9,
    "text": " What is happening there and what did you mean by active inference as far as the way that an individual person might relate to it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.192,
    "end": 2733.592,
    "text": " In what like domain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.612,
    "end": 2734.373,
    "text": "Give me more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.573,
    "end": 2745.599,
    "text": "You talked about how you talked about predictive coding and how active inference would kick in or would go into a different mode depending on whether a task was being selected at a high level or a low level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.619,
    "end": 2746.239,
    "text": "Or low level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.339,
    "end": 2747.159,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.219,
    "end": 2752.662,
    "text": "Like we're always going to be, I mean, there's always prediction error in our brain, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.122,
    "end": 2754.743,
    "text": "Depending on what's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.264,
    "end": 2759.566,
    "text": "Now, are we going to minimize it with what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2760.353,
    "end": 2763.3,
    "text": " there's again, these three different tactics that your brain can implore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.32,
    "end": 2763.381,
    "text": "One,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.481,
    "end": 2771.382,
    "text": " reducing sensations, two, updating your prediction, three, doing an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.082,
    "end": 2783.584,
    "text": "So when you're just in this free play, there's still a need to create a prediction of your movement pattern for it to actually happen, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.964,
    "end": 2787.905,
    "text": "But it's happening at a much lower level of your neural hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.305,
    "end": 2794.586,
    "text": "It's not happening because there's a high level part that's saying, oh, I wanna look pretty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2795.345,
    "end": 2798.286,
    "text": " I wanna get my teacher to like me, so I'll do something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.866,
    "end": 2812.13,
    "text": "It's happening at a level of the sensation, at the level of what feels good from the proprioception, the haptic, the pure, like your body,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.579,
    "end": 2825.051,
    "text": " knows what's joyous to your body or these lower level predictions and biases that your body has about what is joyous, healthy for your body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.151,
    "end": 2826.993,
    "text": "The knowledge is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.554,
    "end": 2829.536,
    "text": "There are these lower level biases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.148,
    "end": 2837.551,
    "text": " So we're allowing our system to collapse into a state that's being led by these lower level biases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.912,
    "end": 2848.395,
    "text": "And this goes, I think like in both ways, this can go very much into like your body knows and has biases around what's healthy and fun and feels good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2849.296,
    "end": 2852.017,
    "text": "But there's also, that's where trauma is stored too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.537,
    "end": 2856.439,
    "text": "There's an amazing book, I think it's called The Body Remembers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2858.259,
    "end": 2871.125,
    "text": " Both emotional and physical trauma really are stored in our low-level biases of our prediction around our movements and our body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.546,
    "end": 2877.909,
    "text": "That too can be a big issue for many, many people that need to deal with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.189,
    "end": 2886.953,
    "text": "Being able to go from a state where your brain is triggered, and the mental health basis is called when you're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.506,
    "end": 2896.433,
    "text": " when you've been triggered, um, and these bias, these negative biases appear that are predicting, Oh, pain's how it's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.993,
    "end": 2905.68,
    "text": "Even though there's no objective reason for that, except your history, um, uh, something's triggered that prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2906.12,
    "end": 2910.163,
    "text": "So being able to switch into that, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.974,
    "end": 2921.541,
    "text": " placed in your brain that knows what feels good for your body and what's healthy for your body is super important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.621,
    "end": 2925.843,
    "text": "And we don't really know how to do that in a very reliable way yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.944,
    "end": 2931.227,
    "text": "You know, there's mindfulness practices, breathing and stretching and massage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.128,
    "end": 2938.772,
    "text": "But I think like my biggest fear is that we're with technology, we're actually being pulled away from our body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.233,
    "end": 2939.553,
    "text": "And that's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.953,
    "end": 2944.784,
    "text": " generally what I'm trying to close that gap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.66,
    "end": 2945.96,
    "text": " Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.02,
    "end": 2947.801,
    "text": "If that makes any sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.341,
    "end": 2951.722,
    "text": "Thanks for this answer, and it's actually related to this next question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.162,
    "end": 2959.425,
    "text": "You talked about how when the avatar was getting almost like false perfect feedback, it didn't improve the actual performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.885,
    "end": 2966.368,
    "text": "So it really highlighted how the technology can't just simply mechanically demonstrate like a scaffold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2966.468,
    "end": 2969.509,
    "text": "It has to give somehow accurate feedback, yet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.129,
    "end": 2974.592,
    "text": " it's often fantastical scenarios or abstract scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.632,
    "end": 2978.975,
    "text": "So I wondered what were your thoughts for technology design?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.496,
    "end": 2986.421,
    "text": "How could technology be used to actually enable and enable these kinds of states that you're getting towards?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.242,
    "end": 2990.824,
    "text": "Yeah, without constraining us in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.755,
    "end": 2994.596,
    "text": " Yeah, so I think this was a very big learning for me, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2994.796,
    "end": 3003.559,
    "text": "You need to give a person accurate feedback of where they are to and what they are actually doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3004.7,
    "end": 3013.623,
    "text": "And again, there might be an ability to impose two such things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3013.703,
    "end": 3018.925,
    "text": "Like you might be able to still be in a first person perspective with somebody doing the movements,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.244,
    "end": 3022.167,
    "text": " but also either feel with vibrations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.207,
    "end": 3024.289,
    "text": "Like if you try and mute, that's what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.389,
    "end": 3030.454,
    "text": "I just use the haptic feedback to tell you if you are in the right place, you'll get a vibration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.474,
    "end": 3034.298,
    "text": "So I'm strengthening your ability to know where you actually are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3034.358,
    "end": 3034.698,
    "text": "So there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.038,
    "end": 3043.805,
    "text": " sort of ways to hack our other sense modalities with music, really it's a bit of gamification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.945,
    "end": 3056.034,
    "text": "When you're on the path of doing the things that you're trying to learn, activate the dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.314,
    "end": 3062.678,
    "text": "Dopamine, at least within the predictive coding framework, it's really like a precision signal for a prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.307,
    "end": 3073.679,
    "text": " Give some more bling, bling, bling with a little bit randomness when you are doing the things that you're trying to learn correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.059,
    "end": 3078.905,
    "text": "But you need to get that feedback of when you're doing things correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3081.307,
    "end": 3087.733,
    "text": " And I think that's what was missing from this experiment was giving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.053,
    "end": 3095.68,
    "text": "And the faster and tighter these feedback loops are, the more your brain will perceive them and actually activate them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.74,
    "end": 3103.648,
    "text": "So there's some really great meditation tools that you'll meditate and afterwards you'll see your heart rate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.655,
    "end": 3116.979,
    "text": " There's some more professional like biofeedback rhythms that you can see what's happening either with EEG or heart rate in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.999,
    "end": 3130.004,
    "text": "And that's also actually I talked to before we started, like I'm building, I'm starting my first hardware project to do that and give a real time biofeedback of heart rate with LEDs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.024,
    "end": 3132.525,
    "text": "If you want to go, it's called the Wisdom Truffle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.645,
    "end": 3134.326,
    "text": "You go to wisdomtruffle.com.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.506,
    "end": 3136.948,
    "text": " You'll see a trippy truffle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.568,
    "end": 3149.981,
    "text": "And basically, that's the idea of helping people reach some of these tighter feedback loops on a lower level by hacking their visual modality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.061,
    "end": 3150.941,
    "text": "Like, let's use it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.961,
    "end": 3153.704,
    "text": "We figured out, okay, the visual modality is super strong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3154.485,
    "end": 3159.69,
    "text": "Can we connect it to other sensations that we don't have as much insight to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.233,
    "end": 3162.635,
    "text": " Like, could I connect the visual modality to heart rate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.795,
    "end": 3163.716,
    "text": "Yeah, pretty easy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.196,
    "end": 3166.457,
    "text": "Could I connect the visual modality to perception?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.598,
    "end": 3166.798,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.918,
    "end": 3174.123,
    "text": "If you go to Mew, when you dance and move, your actual, your avatar changes color and the sparkles change color.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.663,
    "end": 3181.829,
    "text": "So by hacking the visual modality that really is like our brain's graphics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3182.697,
    "end": 3183.157,
    "text": " computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.217,
    "end": 3185.378,
    "text": "It's like super strong, it's dominant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.659,
    "end": 3195.162,
    "text": "Can we use it in different ways to connect sensations that we don't have as strong and are not as dominant in us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.342,
    "end": 3196.543,
    "text": "That's one of the things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.228,
    "end": 3221.457,
    "text": " awesome and that point you made really um about the high level priors like both my eyes are looking at the same thing and you can kind of play with that by pushing on one lightly and you know it just does distort the image and it's sort of it just demonstrates uh it's one of those examples like the high acuity in the periphery or color vision the periphery or the blind spot one of those examples that help",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.117,
    "end": 3244.15,
    "text": " bridge between for example input output information processing understandings of cognitive sciences versus this really extended and predictive way that you're talking about things so it's really awesome and thanks for making it really accessible with this presentation so you want to go to the second part and then if anyone has questions live otherwise i'll just keep on writing cool things down thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3245.47,
    "end": 3246.491,
    "text": " So, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.632,
    "end": 3250.454,
    "text": "Context, context reset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3250.594,
    "end": 3252.115,
    "text": "It's like context switch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.375,
    "end": 3257.599,
    "text": "There's a context switch, but we're still staying within the predictive coding framework and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.119,
    "end": 3266.184,
    "text": "But yeah, I'm going to just give, you know, I really like this idea of giving visual metaphors based on all the things that I've talked about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3266.224,
    "end": 3271.108,
    "text": "I think that's a great way to learn and have this intuitive understanding of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.989,
    "end": 3272.73,
    "text": " both of math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.77,
    "end": 3281.921,
    "text": "I don't know if you follow the three blue, one brown videos, but they're just phenomenal and mathematical understanding because it's all visual coded math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3282.482,
    "end": 3287.348,
    "text": "But I'm going to give a visual metaphor you can imagine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.061,
    "end": 3290.142,
    "text": " either look at the images or even close your eyes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.202,
    "end": 3302.285,
    "text": "And just imagine that when your brain is creating reality, it's very similar to playing in the sand with some buckets and making sand castles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.925,
    "end": 3307.367,
    "text": "And the sand is just this constant incoming bottom up signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3307.407,
    "end": 3308.707,
    "text": "There's just so much of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.807,
    "end": 3313.389,
    "text": "Constant sand is just flooding into your room, into your space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3313.789,
    "end": 3317.81,
    "text": "And you have these buckets and you're trying to take all the sand and like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3318.166,
    "end": 3323.947,
    "text": " spit them into the bucket constantly to create this reality, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.027,
    "end": 3337.111,
    "text": "And this is pretty much what your brain is doing with, at least in the predictive coding framework, with the buckets being these top-down priors and the sand being the bottom-up incoming signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3337.591,
    "end": 3347.013,
    "text": "So there's a constant buckets trying to predict and put the incoming signals into a specific bucket that then turns off",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.677,
    "end": 3371.58,
    "text": " the sand basically now let's talk a bit about the classical psychedelics psychedelics they're starting to expand to be you know like basically everything but um classical psychedelics are whatever activates the 5ht2a receptor agonist just means activating um so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.256,
    "end": 3383.33,
    "text": " What really happens when we take a classical psychedelic is that your brain's buckets are getting broken down into smaller and differently shaped buckets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3383.885,
    "end": 3403.778,
    "text": " So your priors are getting broken down, they're getting diffused into sort of weaker but more accurate or more detailed buckets that let your brain create an actual different reality for itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3404.518,
    "end": 3406.699,
    "text": "Now, where is this coming from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.52,
    "end": 3410.642,
    "text": "When we look at the actual microcircuit of the brain,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3411.87,
    "end": 3419.913,
    "text": " and this is of the cortical, you have seven layers of your cortex and how the neurons are actually laid out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.973,
    "end": 3423.895,
    "text": "This is a very amazing paper by Bastos et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.295,
    "end": 3430.737,
    "text": "We can see exactly the feedback loops that are correlated to predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.997,
    "end": 3435.639,
    "text": "Where's the data going upwards of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3436.047,
    "end": 3439.428,
    "text": " which we see in these forward connections in purple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.488,
    "end": 3440.828,
    "text": "It's coming in from layer four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.888,
    "end": 3445.67,
    "text": "It's going up to layer two and then looping to layer five.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.91,
    "end": 3453.392,
    "text": "And then where are the backwards connections that are coming from these higher level brain areas that are correlated to our predictions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.473,
    "end": 3455.873,
    "text": "And we see that in green.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3457.24,
    "end": 3462.303,
    "text": " coming from layer five, going down to layer four, doing these feedback loops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.803,
    "end": 3476.81,
    "text": "So when we look at where the 5-HT2A receptor is, we see that they're situated very specifically on these layer five, on the backwards connections, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3477.41,
    "end": 3505.535,
    "text": " so we're seeing that they're activating uh hyper activating and making the sensitivity of these neurons uh uh much more sensitive so that's that's why um the theory is that it's causing these predictions to fire at a much lower threshold if beforehand let's imagine a whole neuronal population you'd need to get you know x amount of neurons resonating together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.415,
    "end": 3509.616,
    "text": " to create a prediction, now you need much less of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3509.816,
    "end": 3518.618,
    "text": "Just a few neurons are like throwing out their own prediction and a few other neurons are throwing out their prediction and you're getting many more competing predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.318,
    "end": 3522.678,
    "text": "So very simple metaphor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.078,
    "end": 3528.5,
    "text": "If you're walking down a forest in a usual state, you might have a probability of 0.4%.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.3,
    "end": 3535.621,
    "text": "Oh, I'm gonna see some animals and a 0.6% prediction of I'm gonna see some plants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.261,
    "end": 3548.464,
    "text": " But after you've taken psychedelics and these predictions have decomposed, you might get a much more detailed prediction possibility space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3548.804,
    "end": 3552.105,
    "text": "You know, maybe you're going to see a dog, a cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.385,
    "end": 3553.885,
    "text": "Hey, maybe you're going to see an elf.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.085,
    "end": 3557.306,
    "text": "That's, you know, a low probability, but it's suddenly there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.826,
    "end": 3563.367,
    "text": "So things that were below the threshold of probability are now becoming more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.687,
    "end": 3568.07,
    "text": " a higher threshold and part of your predictive probability space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.87,
    "end": 3580.938,
    "text": "Now, what really happens here and what's really sort of important is how this correlates with the rest of your bottom observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3582.361,
    "end": 3603.915,
    "text": " If you are getting very clean bottom-up signal, which almost never happens, but let's imagine a very clear auditory signal, at least for a moment, or very clear visual perception that you're getting, suddenly you can have much higher accurate predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.702,
    "end": 3609.864,
    "text": " And this is, you know, people on psychedelics, including myself, will report this quite often.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.904,
    "end": 3615.546,
    "text": "Like, oh, wow, I can see footprints in the forest the way I've never seen them before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.566,
    "end": 3626.429,
    "text": "Or this perception of hearing music and like the audio is just so crisp and so detailed in ways that I don't perceive them when I'm not on psychedelics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.9,
    "end": 3651.51,
    "text": " If you are in a bottom-up environment where you're getting noisy signals, it's dark, things are constantly changing, there's various sounds, suddenly the possibilities and the predictions that you might be getting might not be as correlated to, you know, quote, unquote, objective reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.963,
    "end": 3660.011,
    "text": " suddenly your predictions can become much stronger and just or much less, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.655,
    "end": 3683.219,
    "text": " accurate but still a type of overfitting might happen that's i think a good word to use here where you know oh i'm in this forest it's dark and gloomy there's something moving oh it's an elf right because that was part of the probability space of your prediction and with the noisy bottom-up incoming sensation that was enough to reduce prediction error",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3684.31,
    "end": 3711.133,
    "text": " um but what's important to note and you can see sort of in in this very uh simple image that the decomposed predictions are all uh less strong so they're not going to turn off as much prediction error so your your brain is going to constantly be while you're on psychedelics in a state that has higher prediction error which as we saw before and we've been talking about when you have a higher prediction error your brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3711.553,
    "end": 3714.394,
    "text": " has a few different tactics that it can use to deal with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3715.154,
    "end": 3716.814,
    "text": "One, modulating the senses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3717.334,
    "end": 3719.174,
    "text": "Two, updating predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3719.455,
    "end": 3721.075,
    "text": "Three, active inference, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3721.655,
    "end": 3731.497,
    "text": "So this is why psychedelics offer a very, very unique opportunity of updating your model because there's a much higher level of prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.917,
    "end": 3737.638,
    "text": "And then under some situations, your brain might decide to actually update the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.078,
    "end": 3749.044,
    "text": " And if people are suffering from trauma and depression, we're seeing absolutely amazing results in research around using psychedelics to update people's biases around these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.925,
    "end": 3753.007,
    "text": "And again, very much depending on the setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.167,
    "end": 3761.532,
    "text": "Don't expect to take psychedelics and go to a place where you don't feel safe in and you don't have a support structure and to get these benefits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.372,
    "end": 3767.175,
    "text": "In order to update your model, you need to be getting bottom-up sensory inputs that are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.735,
    "end": 3771.736,
    "text": " very strong and accurate around what's happening to you right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.616,
    "end": 3795.98,
    "text": "But if you do that and you are able to feel safe in your body, like we talked before, be in play situations or improv or flow, that might allow your brain to really, really heal deep traumas, to really reprogram deep biases from childhood when your brain had this extra neural plasticity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3797.518,
    "end": 3801.059,
    "text": " So now let's get to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.459,
    "end": 3809.582,
    "text": "So the interesting part about these 5-HT2A receptors is that we don't have so many of them in our motor cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.622,
    "end": 3810.802,
    "text": "There's a lot less of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.622,
    "end": 3819.525,
    "text": "So we can actually say that active inference modulates psychedelic experiences and makes them weaker.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.545,
    "end": 3826.667,
    "text": "And we see this both in the instructions that people are given when they're doing psychedelic therapy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3827.587,
    "end": 3852.868,
    "text": " uh right now in um at maps for instance or other um universities and hospitals that are researching this they really tell people lie down don't move uh and when i talk to therapists about this they could really say we know when something's bubbling up with a person we see this in their body when it's becoming too much they start really moving and we try to encourage them to actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.626,
    "end": 3861.271,
    "text": " stay still because when we start moving, we're actually weakening the prediction error, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3861.652,
    "end": 3870.978,
    "text": "Our brain is creating a prediction that's still pretty stable because we don't have as many 5-HC2A receptors that have been hyperactivated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3873.94,
    "end": 3876.181,
    "text": " Because we took psychedelics in the motor cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3876.701,
    "end": 3882.223,
    "text": "So our motor predictions are able to modulate this psychedelic experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3882.804,
    "end": 3891.267,
    "text": "And, you know, the benefit of this is that, oh, wow, if you are doing psychedelics and you're feeling really overwhelmed, move, do a bunch of jumping jacks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3891.806,
    "end": 3905.672,
    "text": " pushups, move around space, that's gonna really help lower the prediction error in your brain and help you be more back to, I guess, the reality you were used to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3907.112,
    "end": 3920.038,
    "text": "So yeah, this was a short connection between psychedelics and active inference that I just wanted to bring to the space too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.657,
    "end": 3923.018,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.038,
    "end": 3924.159,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.942,
    "end": 3927.765,
    "text": "There was so much even in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.246,
    "end": 3929.227,
    "text": "That I could.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.428,
    "end": 3930.63,
    "text": "Yeah, you can unshare that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.77,
    "end": 3932.813,
    "text": "I will just turn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.638,
    "end": 3957.26,
    "text": " i'll just yeah that's perfect and i'll just then i'll just re-crop it um i guess i'll crop it while i ask this first question which is um you pointed out that a lot of even the clinical work on psychedelics is done in a way where they actually prevent movement and also like education stay at the best because they prevent but don't encourage it yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.785,
    "end": 3957.925,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.025,
    "end": 3958.205,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.765,
    "end": 3959.085,
    "text": "Totally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.125,
    "end": 3959.305,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3959.346,
    "end": 3960.266,
    "text": "Like putting people in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3960.306,
    "end": 3965.507,
    "text": "Not restraint, but it's, it's on, it's on, you know, continue with a, um, authority as a restraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.527,
    "end": 3967.528,
    "text": "So just, um, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.588,
    "end": 3979.652,
    "text": "What is maybe the role of the body in, uh, remote work or in now that we're also in, um, again, not physically restrained to our chairs yet, but it feels like that some days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.492,
    "end": 3981.632,
    "text": "It's a disaster.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.813,
    "end": 3982.973,
    "text": "It's, it's, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.505,
    "end": 3991.473,
    "text": " Yeah, I think we're, and I'm a total motor chauvinist when it comes to our brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3991.513,
    "end": 3993.295,
    "text": "I don't know if you've heard that term before, but.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.695,
    "end": 3994.696,
    "text": "No, explain that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.217,
    "end": 3995.497,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.778,
    "end": 4000.463,
    "text": "So basically we have a brain and cognitive functions because we move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4001.038,
    "end": 4013.955,
    "text": " You know, when you look at the designation between tree to algae to creatures in the crazy ocean to animals that move, when do you start getting brains is when they move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.275,
    "end": 4018.401,
    "text": "And there's a great example of some really insane sea creature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4018.837,
    "end": 4024.841,
    "text": " that moves around and has a brain, then it finds a place to plop itself down and digest its own brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.861,
    "end": 4028.963,
    "text": "So once, yeah, it doesn't need it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.183,
    "end": 4034.006,
    "text": "Our brain is needed to create predictions with the environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.026,
    "end": 4037.108,
    "text": "This is the whole predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4037.228,
    "end": 4040.991,
    "text": "And Andy Clark has a beautiful book and papers about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4041.591,
    "end": 4044.792,
    "text": " about the feedback loops that we create within the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4044.812,
    "end": 4052.655,
    "text": "And if our environment is relatively highly predictable because we're staying in the same place, then guess what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.395,
    "end": 4054.616,
    "text": "We don't need this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4055.416,
    "end": 4070.181,
    "text": "And us as humans, and Andy Clark also goes into that quite a lot, because we want to minimize prediction error, that's part of this whole free energy thing in our brain, but we've done it a bit",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.761,
    "end": 4071.622,
    "text": " too well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4072.263,
    "end": 4084.277,
    "text": "You know, we've created these large-scale active inferences with our environment shaping, our supermarkets looking the same, the roads, our house.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4086.159,
    "end": 4093.301,
    "text": " And I think that's a really a big cause of generally the mental health crisis that we're seeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.841,
    "end": 4104.543,
    "text": "And especially when it comes to then not even moving your body, being in the same state, physiological state, that's just too low entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.503,
    "end": 4114.445,
    "text": "And that's really, really, I think I'm going to even go to the extent of saying like my main goal in my in my work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.651,
    "end": 4124.796,
    "text": " is that one metric, improve the amount of states your body is in for humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.096,
    "end": 4138.804,
    "text": "If I can do that, then for modern citizens that have a total lack of this, I am absolutely certain that we're gonna see improvement on many metrics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4140.165,
    "end": 4140.946,
    "text": " that we're lacking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.546,
    "end": 4150.275,
    "text": "So when it comes, and I try as much as I can to like not fall into this like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4151.388,
    "end": 4156.19,
    "text": " I've been working remotely even before this crazy COVID thing happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.391,
    "end": 4162.153,
    "text": "Do calls while you're walking outside or stretching outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.173,
    "end": 4169.376,
    "text": "Anything that doesn't require you to be in front of a 2D screen, bring toys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4169.796,
    "end": 4174.078,
    "text": "We do have the ability to gamify and bring toys into our environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4174.898,
    "end": 4195.07,
    "text": " they have rings outside and punching bags and um any anything that will create constraints around your movements you'll move your desk change your table don't work from the same space if you possibly can just keep bringing in that prediction or both into your body and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.121,
    "end": 4201.823,
    "text": " And I think that's a very like incorrect way that ergonomics is looked at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4202.323,
    "end": 4207.764,
    "text": "You know, ergonomics is all about like, let's find the perfect position for you to be in for many hours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.824,
    "end": 4208.825,
    "text": "That doesn't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.025,
    "end": 4212.906,
    "text": "We're not supposed to be in a perfect position just going like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.946,
    "end": 4240.476,
    "text": " um well it's it's really it's like a modern mental ergonomics and it's the um ergo the work the dynamics of a dynamical system that's us and so the ergonomics is now the back angle for the chair but then there's actually a ratio of the chair and the exercise ball or whatever that's not my specialty but it's all about changing those ratios um because whatever there is no such thing as as the the perfect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4241.197,
    "end": 4244.042,
    "text": " sitting state or not moving state for your body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.402,
    "end": 4251.976,
    "text": "You know, lying down too much gives us pressure problems and people in hospital need to be turned around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.834,
    "end": 4253.855,
    "text": " to not get these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.975,
    "end": 4256.737,
    "text": "We are a dynamic physiological system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.418,
    "end": 4273.429,
    "text": "And I think there's a very big gap between people that are studying these systems a lot of the times and like math people and computer science people that are just really not spending enough time connecting to their own bodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.891,
    "end": 4279.474,
    "text": "So I think like I highly encourage everyone to like just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.887,
    "end": 4283.732,
    "text": " find the time to figure out what you are as a full human being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4283.752,
    "end": 4297.95,
    "text": "It's like blood, blood pressure, bones, tendons, and be in that space and let those predictions take precedence at least a little bit of your day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.622,
    "end": 4327.837,
    "text": " know one thing you mentioned is this like top down almost standardization and and synchronization and stabilization of the lower level states and then the the two affordances we have are kind of like our physical movement and our communication and we've seen how those are subject to top down as well as bottom-up constraints but that is kind of what's being remapped is the constraints on our movement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.908,
    "end": 4331.971,
    "text": " variously and our communications networks variously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.431,
    "end": 4346.224,
    "text": "And so to have a multiscale framework like active inference where we can talk about the remote team having input and output and then the body, we can be like, okay, here's an algorithm that's awesome for this sector, for this team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4346.325,
    "end": 4351.129,
    "text": "But I want to be not reinforcement learning driven or not reward driven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4351.149,
    "end": 4353.511,
    "text": "I want to have a framework that allows me to express",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4354.252,
    "end": 4361.518,
    "text": " these kinds of playful states or even have a rationale to construct these states and design for them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.298,
    "end": 4363.219,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4363.239,
    "end": 4367.182,
    "text": "So I think that was a lot, a lot of good points you brought up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.783,
    "end": 4370.345,
    "text": "So maybe first the communication thing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.386,
    "end": 4377.491,
    "text": "We're doing this 2D, sometimes only voice, sometimes 2D screens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.071,
    "end": 4379.252,
    "text": "None of this is naturalistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.693,
    "end": 4380.753,
    "text": " for our brains, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.793,
    "end": 4381.794,
    "text": "We're 3D creatures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.054,
    "end": 4388.195,
    "text": "We pick up social cues from being able to gaze into each other's eyes, predict where you're looking at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.635,
    "end": 4392.737,
    "text": "And it gets worse the number of people you bring in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.897,
    "end": 4397.518,
    "text": "It's just like group Zooms for me are torture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.158,
    "end": 4422.936,
    "text": " there's so much awkward silence so much inefficiency who's next who what is the level of even when we're in a normal social group you know i usually put little numbers around people how much i think they understood me okay this person understood 70 30 zero and i do the same for myself and i try to be very honest with people i like i understood around 30 of what you just said",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.221,
    "end": 4426.444,
    "text": " And that's how we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4426.484,
    "end": 4430.915,
    "text": "Like we have different just data structures internally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4431.405,
    "end": 4437.427,
    "text": " And managing to like minimize the differences in these data structures is a very difficult task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4438.728,
    "end": 4443.69,
    "text": "Even when you're not working remote and remote work has definitely made that a lot more difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.511,
    "end": 4456.615,
    "text": "I've tried to use things like VR and found it sometimes okay, but also it's, and I'm a super VR, you know, enthusiastic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.435,
    "end": 4463.157,
    "text": " and still spending more than 15 minutes in there at a period of time is just too much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.177,
    "end": 4467.619,
    "text": "It's heavy, it's clunky, it's a close point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.719,
    "end": 4471.64,
    "text": "So that's a difficult thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4471.74,
    "end": 4481.003,
    "text": "But we do try, what we do try to do a lot of the times is create mock-ups directly in VR and share the mock-ups in VR so we understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4481.483,
    "end": 4485.708,
    "text": " what we're trying to build together from this 3D perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4487.59,
    "end": 4494.317,
    "text": "Generally, me, we have like an AR app where I'm trying to create interactive holograms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4494.738,
    "end": 4497.941,
    "text": "So more on the social connection instead of just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.356,
    "end": 4509.243,
    "text": " getting you on like a 2D screen or the Facebook and Instagram, but getting something that moves in my face and actually interacts with me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4509.263,
    "end": 4511.044,
    "text": "Like you can blow kisses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4511.104,
    "end": 4516.268,
    "text": "I don't know if you've ever seen the Roger Rabbit movie, but I realized, I think I got it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4516.308,
    "end": 4518.89,
    "text": "Like I started when I was a kid and then I built this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4518.951,
    "end": 4522.834,
    "text": "I saw the movie again and I was like, oh wow, I just built the Roger Rabbit thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4522.854,
    "end": 4525.075,
    "text": "Does it blow kisses through the screen or something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.576,
    "end": 4528.138,
    "text": "You blow kisses and it goes into your 3D space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4528.999,
    "end": 4529.84,
    "text": " an AR space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4530.08,
    "end": 4533.982,
    "text": "So you can actually move around your space and catch the person's kisses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4534.022,
    "end": 4541.766,
    "text": "So I'm really excited about the possibility of creating what's called joint action in cognitive neuroscience remotely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4542.247,
    "end": 4546.489,
    "text": "And joint action is a physiological thing more than anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.929,
    "end": 4557.175,
    "text": "Like if I even shake your hand or just passing you that pen is when I start predicting you and starting to predict you is starting to build empathy with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4558.064,
    "end": 4578.295,
    "text": " Um, so these empathy things really, uh, are naturalistically based on very low level of physiological data and without this, because we're currently constantly on zoom and, you know, I, I click here to send you a button to send you a chat, or I raise my hand by clicking a thing and you see a thing over there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4578.715,
    "end": 4581.797,
    "text": "It's much, much weaker, uh, and not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.438,
    "end": 4584.782,
    "text": " really creating these joint actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.443,
    "end": 4597.28,
    "text": "So I think there's a lot to explore with technology with just joint actions and team building activities that are in VR, even if for a short period of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4597.853,
    "end": 4612.322,
    "text": " and just simple things like let's build blocks together or things that you would do in physical space if you could be together to just understand a bit more on this low level prediction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4613.39,
    "end": 4615.312,
    "text": " who a person is, how they move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.752,
    "end": 4618.715,
    "text": "Now VR is very strange because you can like mess things up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.755,
    "end": 4632.608,
    "text": "I don't know if you've ever been in VR chat, but you can interact with someone as like, oh, I'm now a three meter giant with fire wings and I'm a tiny pixie and you're just interacting this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.449,
    "end": 4641.612,
    "text": " So I think that's really interesting and actually can be a very interesting way of also de-biasing things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.632,
    "end": 4655.438,
    "text": "Like, oh, what happens if we conduct interviews that are not, like we know, we know there's a huge bias in the whole hiring system and building teams to begin with that is not solved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.458,
    "end": 4657.139,
    "text": "There's like, okay, you do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.541,
    "end": 4661.183,
    "text": " You know, you don't even write.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.263,
    "end": 4665.849,
    "text": "Sometimes HR doesn't look at the names and there's all these things to try to hide who the person is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4665.889,
    "end": 4671.996,
    "text": "But the moment there's interviews, you know who the person is and these racial biases come in, these gender biases come in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.958,
    "end": 4690.515,
    "text": " So there's a lot of really interesting ways that we could be de-biasing ourselves by, again, this excessive prediction error and the ability to really detach ourselves from the normal perception that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4693.187,
    "end": 4705.633,
    "text": " That's really interesting about the physical components of remote, whether it's a physical object that's going to be moving and I don't know, like a little jellyfish that does a movement or just synchronizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4705.753,
    "end": 4712.637,
    "text": "And it made me wonder if there was like an exercise, like could people just say, okay, beginning of this video meeting,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.357,
    "end": 4739.217,
    "text": " yeah maybe we all just switched over a context like let's do you know three claps and take a deep breath and just do something think of a you know purple cow and then just coordinate that way and then prepare or here's our narrative here's what we're here to do because that kind of stuff the mission which comes back to your earlier idea about like giving the information in the way that's naturalistic and what is the natural unit it's kind of the the goal the end",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.737,
    "end": 4767.99,
    "text": " and so having the group assemble with the synchronization and also a remembrance of the end is like really an interesting implication i think of active inference but not some of these other um sub-component theories per se yeah and uh so that's also what i'm trying to do with this hardware is let people synchronize their heartbeat let me you're over there i'm over here let me send you my heartbeat as beautiful glowing pulses and you can send me your heartbeat and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4768.61,
    "end": 4776.736,
    "text": " get this biophysical data that, honestly, if we were even in the same room together, I wouldn't necessarily get unless I was touching you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.116,
    "end": 4796.33,
    "text": "So I think we are, and this is the exciting part of immersive and embodied technology, we are getting to the stage where we can start moving beyond 2D video into biophysical data that lets us get a deeper understanding, a deeper connection, a deeper synchronization with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4799.841,
    "end": 4818.755,
    "text": " Well, I'm happy to talk for a little bit longer if you want, but I guess my closing thought or at least direction, because maybe we'll see or hear from you again, would be like, what are the next steps for applied active inference or for an individual who's curious about these kinds of topics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.795,
    "end": 4822.158,
    "text": "Is there like a website or is there a research direction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4822.298,
    "end": 4826.361,
    "text": "Where is active inference coming into play in the next months to years?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4827.83,
    "end": 4828.03,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4828.07,
    "end": 4837.753,
    "text": "So honestly, before I heard about your, um, podcast, I've never heard about any, uh, stuff like focus within the predictive coding framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4838.333,
    "end": 4843.035,
    "text": "I would be very excited about, um, connecting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.055,
    "end": 4847.256,
    "text": "And this is something I've, I've been trying to do is bring movers into this space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.336,
    "end": 4849.217,
    "text": "It seems that there's these two different worlds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.777,
    "end": 4855.739,
    "text": "There's movers that hate technology because they feel it's taking them away from their bodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4857.459,
    "end": 4864.247,
    "text": " And there's technology and science, and there's a very, unfortunately, very small overlap between them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.267,
    "end": 4869.212,
    "text": "And that's what, you know, I was very lucky I found a co-founder who's in both these worlds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4871.397,
    "end": 4885.872,
    "text": " But if there was a way to bridge this gap, and like you're saying, these movement exercises, it's a thing that we do constantly in improv classes, building physiological synchronization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.972,
    "end": 4892.599,
    "text": "And the things you'll see there sometimes are just like, this is one organism, like people moving together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4893.219,
    "end": 4895.0,
    "text": " not pre-decided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4895.02,
    "end": 4907.982,
    "text": "And there's a beautiful research paper, I think Noy, it's from Israel, the Rehobotha faculty, I can link to it afterwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4909.123,
    "end": 4917.785,
    "text": "But what they did there is they tried to figure out what's going on in the brains of improvisers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4919.879,
    "end": 4926.045,
    "text": " And they have a beautiful like mathematical paper about the double feedback loop that's created.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4926.466,
    "end": 4930.249,
    "text": "So it's not, and they tested two conditions, leader versus follower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.349,
    "end": 4936.535,
    "text": "That was more what I was testing versus there is no leader and follower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.575,
    "end": 4938.057,
    "text": "You're doing things together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4938.717,
    "end": 4947.643,
    "text": " And they found a much higher degree of synchronization and a very, they built a very cool paradigm of just like moving your hand on one up and down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4947.663,
    "end": 4948.144,
    "text": "That's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4948.264,
    "end": 4950.565,
    "text": "Very easy to measure, but it was there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4950.645,
    "end": 4951.526,
    "text": "The data was there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4951.606,
    "end": 4965.355,
    "text": "They managed to find a much higher degree of synchronization when there was no leader and follower between improvisers that were either musical improvisers or dancers and trained their brain to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4965.782,
    "end": 4968.205,
    "text": " to tune in to the other person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.485,
    "end": 4982.982,
    "text": "Because when you're doing this, and this is a very, you know, when you're talking about teams and synchronizing and play, I think we really need a shift in the hierarchical structure of teams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.603,
    "end": 4984.664,
    "text": "Like, I don't,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4986.116,
    "end": 4990.7,
    "text": " And this is something that I'm really exploring as a CEO of a startup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.061,
    "end": 4998.588,
    "text": "How do I get these ideas that I want out there, but how do I bring in people's ideas so they feel that they're a part of this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4999.088,
    "end": 5006.294,
    "text": "And how do we then get a cohesive product at the end of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5006.415,
    "end": 5011.819,
    "text": "None of these are easy questions, but having this ability to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.208,
    "end": 5035.503,
    "text": " double feedback so it's not just a top-down manager right that's saying oh this and this and this you guys understand this and this and this this is my vision don't expect people to be excited about your vision right that's not how these things work if you want them to be excited and attuned you need as a you know manager in this hierarchical structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5036.023,
    "end": 5055.069,
    "text": " be attuned to their visions what they're seeing their perspective why did they join this project and try to get that coordinated um into a global vision that is um you know doesn't break apart because there's too many voices so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5057.005,
    "end": 5071.431,
    "text": " None of this is easy, but I think that a lot of the times, yes, going to the low-level physiology first and building this low-level physical trust with each other and understanding with each other is really unique.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5071.491,
    "end": 5073.752,
    "text": "Like me and my co-founder, we dance together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.832,
    "end": 5076.893,
    "text": "We climb on trees together before he moved to Hawaii.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.274,
    "end": 5081.675,
    "text": "Now we try to hang out in VR and do things together, but it's really not the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5083.677,
    "end": 5094.499,
    "text": " So figuring out how to do these joint physical actions together, I think will really get us into the future somehow, or a future I want to be part of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5095.419,
    "end": 5117.486,
    "text": " nice or unlikely future or one that i expect to be finding myself in um yeah but on that um tech and movers and sort of the transdisciplinary nature and the potentially productive conversation uh we we kind of think about these guest streams like it's two directional because maybe for those with a physics background or a philosophy background",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.246,
    "end": 5125.948,
    "text": " you've inspired them to think about how they're doing their physical activities or wanting to go deeper into a knowledge or movement tradition they were already a part of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.408,
    "end": 5128.829,
    "text": "And then there's people who that's their daily life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.969,
    "end": 5131.79,
    "text": "And then maybe this is the first time they're hearing about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5132.33,
    "end": 5143.193,
    "text": "So we can always do like event series or discussions or working groups or events like that or projects like that to help make that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5144.153,
    "end": 5166.265,
    "text": " two-lane freeway like accessible for everybody and respect both directions of the interchange and it's a really important part like you said with the moving away from the hierarchy like of disciplines you know is physics the top dog discipline physics is awesome but it's actually a really i survived a bs in physics it was dramatic yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5167.734,
    "end": 5194.639,
    "text": " it's great and then different people will be drawn to different parts and that will be sort of like the colony phenotype and um when we uh when we constrain what the lower level looks like we increasingly infringe on what the higher level can be as well so it's about that balance and so that's a common theme with these active inference discussions well yeah this is awesome i really appreciate this conversation and it was uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5195.592,
    "end": 5198.896,
    "text": " I'm sure something that a lot of us will listen to and think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5199.057,
    "end": 5205.285,
    "text": "So we hope to maybe interact with you or other communities in the future, but this was really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5205.465,
    "end": 5206.566,
    "text": "So thanks a lot, Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5207.227,
    "end": 5207.808,
    "text": "Peace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.008,
    "end": 5208.208,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]