[
  {
    "start": 4.402,
    "end": 8.208,
    "text": " Hello everyone and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.688,
    "end": 13.035,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I'm talking with Marilyn Sendera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 13.736,
    "end": 18.482,
    "text": "Marilyn is a lecturer in philosophy at the University of Wollongong, Australia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.823,
    "end": 29.278,
    "text": "Her research focuses mainly on the phenomenological tradition, particularly its intersections with cognitive science, and she has a particular interest in the role of time and how it shapes our cognition and experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.495,
    "end": 42.612,
    "text": " In 2015, she wrote the paper Being in the World, Temporality and Autopoiesis, which explored the inextricable intertwining of age in the world, the confluence of Heideggerian perspectives and inactivism and self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.793,
    "end": 50.822,
    "text": "And to my eyes, at least, her focus on these domains makes her work amenable, at least in principle, to the insights of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.704,
    "end": 59.113,
    "text": "And among other things, it is the viability of that project, that sort of coming together, that we will be investigating today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.465,
    "end": 62.289,
    "text": " Marilyn, thank you so much for joining me and welcome to the show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.55,
    "end": 65.072,
    "text": "Thank you so much for having me, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.132,
    "end": 66.534,
    "text": "I'm really pleased to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 66.554,
    "end": 67.755,
    "text": "Yeah, it's an absolute pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 67.855,
    "end": 72.201,
    "text": "I mean, I sort of came across you by finding that 2015 paper and I love it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.661,
    "end": 78.549,
    "text": "I went back and read it again, sort of in preparation for our podcast today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.149,
    "end": 82.153,
    "text": "And it's so insightful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.654,
    "end": 87.7,
    "text": "And yeah, just as a starting point for anyone listening, I highly recommend they go check that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.102,
    "end": 91.546,
    "text": " But let's dive into some of the things that you spoke about in that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.347,
    "end": 102.377,
    "text": "There's a quote that you took that you referenced from Varela, Francisco Varela, who sort of introduced the term autoparesis with Maturana into the biological literature in 1980.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.338,
    "end": 107.983,
    "text": "And he wrote, a universe comes into being when a space is severed in two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.044,
    "end": 113.569,
    "text": "I wondered if you could help us unpick what he meant by that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.118,
    "end": 120.972,
    "text": " Yeah, so firstly, thank you so much for your kind words about my paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 120.992,
    "end": 123.117,
    "text": "I think everybody loves hearing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 123.197,
    "end": 129.673,
    "text": "So yeah, so Varela in general has been a huge influence on how I look at cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.713,
    "end": 132.84,
    "text": "I think since I wrote that paper, I've kind of come to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.82,
    "end": 140.896,
    "text": " a more nuanced, I guess, understanding of what autopoiesis and autonomy and activism are about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.936,
    "end": 151.015,
    "text": "But yeah, this idea of the cognitive process as being fundamentally relational and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.995,
    "end": 161.287,
    "text": " precarious and something that can't be understood by looking at any of the one components involved in that process in isolation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.307,
    "end": 168.054,
    "text": "It's that fundamental idea of, in a sense, cognition is always this precarious process in tension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.516,
    "end": 171.878,
    "text": "It's the creation of a boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.898,
    "end": 176.023,
    "text": "It's the creation of a separation, a barrier, but also always at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.003,
    "end": 205.538,
    "text": " a barrier that has to be porous and a barrier that is always something that is under threat that has to be maintained and there's always that question which is something that's fascinated me of the kind of the tension between just how much that barrier has to be maintained versus how much it has to be open to change which is I think also one of the really interesting points of conversation with that inference but yeah this idea of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.518,
    "end": 221.937,
    "text": " of cognition, world and action, there is a boundary, there's a separation, there is this sense of what in subsequent kind of inactive literature is called both self-production and self-distinction especially, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.997,
    "end": 228.184,
    "text": "So that something brings itself into being, something maintains itself, something distinguishes itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.164,
    "end": 233.092,
    "text": " And thereby we get this kind of whole complicated, wonderful condition is having world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.613,
    "end": 233.813,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.014,
    "end": 234.534,
    "text": "Fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.955,
    "end": 235.035,
    "text": "Yay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.115,
    "end": 245.953,
    "text": "It's interesting that you mentioned that there's a kind of philosophical question there about the point to which, you know, where does where does that self-distinction start and end?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.17,
    "end": 257.387,
    "text": " Yeah, I mean, I think a lot of the active inference literature is converging on a point of vagueness, sort of a Sorais paradox perspective that, you know, when does a grain of sand become a pile or a heap and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.008,
    "end": 265.68,
    "text": "I guess another philosophical question is, does it, just to start with the really fundamentals here about like this coupling,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.167,
    "end": 276.666,
    "text": " Does it even make sense to think of anything as having a kind of autonomous essence or nature without some coupling environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.536,
    "end": 279.638,
    "text": " That's a brilliant question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.719,
    "end": 289.56,
    "text": "And so ultimately, in a sense, I think what a lot of the literature that my work moves and wants to do is move away from this idea of having an essence, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.6,
    "end": 295.192,
    "text": "So there's already that kind of prior question of, can you have an entity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.272,
    "end": 296.154,
    "text": "Can you have a system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.174,
    "end": 297.777,
    "text": "Can you have an organism that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.988,
    "end": 307.611,
    "text": " that is clearly kind of itself and is clearly kind of distinctive without having, you know, anything as kind of substantive as an essence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.493,
    "end": 309.576,
    "text": "And what does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.636,
    "end": 314.128,
    "text": "Can there be a kind of, I guess, non-teleological concept of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.108,
    "end": 323.522,
    "text": " of what it means to be alive that so some folks look at it or, you know, yeah, just is, is there a way of, of talking about essence without talking about essence, um, in a sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.303,
    "end": 336.021,
    "text": "Um, and so yeah, so, so overall, uh, to me, I think, and then I think all of the discourses that my work moves in and, and what strikes me about active inference as well is this idea that yeah, coupling is, is fundamental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.061,
    "end": 339.306,
    "text": "There is no such thing as a non-relational,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 339.286,
    "end": 343.112,
    "text": " at least not a non-relational living system, a non-relational cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.172,
    "end": 348.782,
    "text": "Cognition life is always a matter of structural coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.583,
    "end": 353.269,
    "text": "And yeah, that in a sense is kind of what we have to start from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.87,
    "end": 354.151,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.391,
    "end": 357.396,
    "text": "Yeah, I think that's a good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.68,
    "end": 373.742,
    "text": " We're definitely skeptical of substantive essences, the substantive, say it right that time, selves in the sense that active inference casts thingness as a statistical distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.963,
    "end": 382.253,
    "text": "And that sort of builds off dynamical systems theory about this kind of idea of attractor sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.823,
    "end": 385.027,
    "text": " or sort of the peak of probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.067,
    "end": 391.076,
    "text": "I was actually just reading Manuel de Landa's book that came out last year, The Phenomenology of, no, Materialist Phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.096,
    "end": 396.645,
    "text": "And he, without even referencing active inference, talks also about these kinds of basins, these attractor basins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.665,
    "end": 406.16,
    "text": "And I guess if we did want to just take a broad brush, I guess we could start defining things as being, in some ways, the statistical manifold or this attractor base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.18,
    "end": 406.741,
    "text": "And that's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.402,
    "end": 409.185,
    "text": "Yeah, that's a nice perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.773,
    "end": 412.636,
    "text": " So let's sort of jump then to autopoiesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.658,
    "end": 427.312,
    "text": "Maybe it would be useful for you to just give our audience a kind of overview of what that term means, sort of coming from the Varela literature, and then we can kind of fold in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.994,
    "end": 429.535,
    "text": "Yeah, awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.555,
    "end": 430.275,
    "text": "That sounds great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.335,
    "end": 431.817,
    "text": "It's funny that you mentioned that book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.837,
    "end": 434.24,
    "text": "I literally just bought that last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.26,
    "end": 435.982,
    "text": "It's flying around to you somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.002,
    "end": 436.762,
    "text": "It's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.782,
    "end": 437.083,
    "text": "It's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.103,
    "end": 437.804,
    "text": "I'm enjoying it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.144,
    "end": 438.244,
    "text": "Yeah."
  },
  {
    "start": 438.545,
    "end": 438.965,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.025,
    "end": 440.066,
    "text": "That's, that's good to hear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.087,
    "end": 441.128,
    "text": "I look forward to reading it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.148,
    "end": 441.388,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.408,
    "end": 450.317,
    "text": "So, um, so I should flag firstly that, you know, this, this is like my, um, attempt to explain what these concepts mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 450.337,
    "end": 457.283,
    "text": "So of course, on the one hand, there are very kind of clear definitions, especially in Varela and Maturana's initial proposal of these terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.363,
    "end": 468.214,
    "text": "But since then the whole kind of, you know, so-called autopoetic inactive approach, a term that in itself is contested because lots of people point out, it's not just about autopoiesis anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.565,
    "end": 477.157,
    "text": " Um, all of these terms are, you know, super contested and, um, the whole literature is about, you know, kind of defining them in relation to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.197,
    "end": 489.814,
    "text": "And so, yeah, so I, um, I kind of, I follow a bunch of contemporary folks in, in cashing out, um, Outer Poies as, as, as a kind of a, a type of organization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.148,
    "end": 497.758,
    "text": " wherein an organism essentially both produces and reproduces itself and distinguishes itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.679,
    "end": 506.609,
    "text": "And so one of those contemporary folks is Ezequiel de Paola, who conveniently has those, those self-production, self-distinction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.129,
    "end": 511.074,
    "text": "And he points out, you know, you can't have an algebraic system without having both of those.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.095,
    "end": 513.878,
    "text": "So you can have a system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 513.858,
    "end": 523.371,
    "text": " And that kind of manages to define and distinguish itself, but if it doesn't reproduce the kind of processes that define it, then it's not autopoetic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 523.391,
    "end": 536.288,
    "text": "And you can have a system that is able to kind of reproduce its components and processes, but if it's not able to maintain kind of a precarious boundary, then it's not autopoetic either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.448,
    "end": 541.114,
    "text": "And so the idea that this is kind of an organizational principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.094,
    "end": 547.54,
    "text": " So in Varela and Maturana's original account, this was meant to be a definition of life as such, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.361,
    "end": 551.023,
    "text": "And since then, it's become a lot more complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 551.063,
    "end": 556.308,
    "text": "So, of course, Varela and Maturana themselves developed this much more extensively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.628,
    "end": 561.552,
    "text": "And these days, I guess the more appropriate term to kind of use is autonomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.053,
    "end": 562.213,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.273,
    "end": 571.101,
    "text": "So there's this kind of general idea of a self-producing self-identity that can be kind of instantiated in lots of different ways, lots of different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.081,
    "end": 579.411,
    "text": " structures and there's, there've kind of been lots of other tools added to the, to that conceptual repertoire.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.471,
    "end": 580.956,
    "text": "So one of the reasons",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.172,
    "end": 588.121,
    "text": " So one of the main innovations, for example, has been the addition of this concept of adaptivity, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.181,
    "end": 603.54,
    "text": "So where autopoiesis is no longer seen as being sufficient for capturing what cognition is all about, there's also this idea that every living system, every cognitive system, essentially produces these kind of standards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.88,
    "end": 610.048,
    "text": "How do these fundamental features both scale down and scale up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.028,
    "end": 615.197,
    "text": " That idea of, of aiming to do well rather than aiming to do worse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.217,
    "end": 624.033,
    "text": "So there is, there is the idea, and I do think it's, it's plausible that this is something that happens, you know, at the most basic level of, of life and cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.093,
    "end": 626.738,
    "text": "That's kind of the, where the switch flips.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.718,
    "end": 653.468,
    "text": " uh in a sense to to a living cognitive system um and you'll notice so far you know for for this kind of branch of an activism life and cognition are essentially intertwined so you've got a living system you've got a cognitive system and so i think um i think just the the capacity to respond to uh to to stimuli and circumstances and what's happening in the environment the capacity to kind of have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 654.275,
    "end": 666.235,
    "text": " a meaningful perspective, um, in a kind of not a very, you know, thick psychological sense, but just in kind of basic respond to the Celine that way, rather than that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.275,
    "end": 670.883,
    "text": "I think it is, you know, it is, it is absolutely plausible that that's kind of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.863,
    "end": 700.347,
    "text": " fundamental aspect of what it means to be alive and so then the interesting question kind of is how do you get from that how do you get from you know a bacteria moving away from areas where there's I don't know less nutritional concentration or where there's bad stuff moving towards the good stuff how do you get from that to kind of our complex reflective metacognitive psychological processes and yeah I think that's that's kind of where a lot of these discourses can kind of come together to flesh out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.327,
    "end": 719.884,
    "text": " That developmental scale, that scale of cognitive complexity, how does this basic responsiveness, this basic kind of world involving, world producing, not wanting to die aspect of life, how does that then scale up to the very kind of complex reflection that we're able to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.924,
    "end": 730.013,
    "text": "And it's, yeah, it's really interesting, I think, to consider how active inference can kind of potentially contribute to that, maybe quantify some stuff, add some tools to the repertoire.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 730.87,
    "end": 734.436,
    "text": " Yeah, I think, again, I can't speak for everyone in the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.817,
    "end": 740.046,
    "text": "I'm like everyone else, I guess, kind of a newcomer, well, at least for a lot of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.627,
    "end": 748.761,
    "text": "But I think what's really fundamental to the complexity of cognition under an active inference framework is the depth of temporal planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.146,
    "end": 752.411,
    "text": " So again, as I said in my introduction, you're really interested in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.451,
    "end": 761.787,
    "text": "And I think what we're finding is that a complex organism like us, what might make us definitively complex is our capacity to do counterfactual reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.287,
    "end": 766.294,
    "text": "So take your example of a bacterium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.544,
    "end": 778.746,
    "text": " It doesn't have a model of the world where it can sort of, at least not in any significant way, use retrospective inference to inform future inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.766,
    "end": 787.422,
    "text": "So it doesn't know, for example, okay, there's nest nutrients over here, but actually I might suffer a short-term loss for the long-term gain of being in this region, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.942,
    "end": 795.539,
    "text": " So it's exploitation, exploration, distinction is just less nuanced, I guess, than humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.24,
    "end": 803.436,
    "text": "How does that sort of sound to your ears that maybe what we're looking at here is a depth of temporal planning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.766,
    "end": 806.127,
    "text": " Yeah, that sounds great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.348,
    "end": 820.582,
    "text": "So generally speaking, so I love the idea, and this is something that I kind of try to pursue, of cashing out the spectrum of cognitive complexity in terms of temporal complexity, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.622,
    "end": 824.346,
    "text": "So largely, you know, including along the lines that you've just mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.366,
    "end": 830.132,
    "text": "And so there is some, you know, really interesting literature already on this, that kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.112,
    "end": 848.732,
    "text": " points out some of the ways in which, yeah, those basic structures of kind of future directedness and anticipation and planning can become more complex, especially through, as you said, right, through our relationship to essentially a more complicated kind of future, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.752,
    "end": 850.315,
    "text": "So counterfactuals,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.295,
    "end": 852.439,
    "text": " unpredictability, uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.76,
    "end": 857.589,
    "text": "There's some cool new work looking at, you know, spikes of entropy, that sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.789,
    "end": 866.165,
    "text": "And that to me is also one of the places where really the phenomenological tradition becomes super relevant and super interesting, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.206,
    "end": 866.987,
    "text": "Because there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.967,
    "end": 892.3,
    "text": " there's this kind of consistent idea that um as and this this this starts before and since so not quite before but a little bit outside of phenomenologies in the work of olby burks and this idea that uh so for him cognitive complexity and the complexity of embodiment is explicitly linked to kind of more radical confrontations with uncertainty which also comes with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.28,
    "end": 894.522,
    "text": " those confrontations being more meaningful, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.542,
    "end": 901.228,
    "text": "So the more complicated you get, the difference between us failing and anabacterium failing, there are all these existential meanings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.408,
    "end": 908.034,
    "text": "Risk, failure, carry so much more significance in the scaling up of those mechanisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 908.074,
    "end": 922.287,
    "text": "And then you get that in the phenomenological tradition too, this idea that, yeah, we have more and more complicated futures, but also, you know, kind of more complicated relationships between our own histories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.267,
    "end": 949.438,
    "text": " and the future and um and yeah i i like the idea of as you said you know cashing that out in terms of of more complicated different richer forms of things like anticipation yeah there's so much there um i mean yeah i've been saying stuff that you know people are even grounding consciousness or you know trying to resolve the hard problem through this route so the you know maybe the function of consciousness let's not get to the kind of deep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.537,
    "end": 979.138,
    "text": " qualia i don't think we need to go there is to kind of you it's it's fundamentally episodic to use what's happened in the past to inform what's happening uh you know what's going to happen in the future or what might happen in the future um yeah that's that's really beautiful and that has a as you say a kind of scale up to significance i mean it made me think of ernst becker and the denial of death um and this idea that like that finality i mean again and heidegger that that finality is kind of fundamentally framing of our being in the world um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.777,
    "end": 989.026,
    "text": " As you can tell, I like to use this podcast also to point people in directions of where they could read or listen to learn more about these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.106,
    "end": 1002.16,
    "text": "I think a really wonderful paper outlining some of these themes is by Andrew Corcoran, Giovanni Pezzullo, and Jacob Howey, From Outer Static Agents to Counterfactual Cognizers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.18,
    "end": 1004.502,
    "text": "That's a 2020 paper, and it's really wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.482,
    "end": 1019.617,
    "text": " So anyone who's listening who's interested in maybe like how are we going to carve out these distinctions between simple organisms or non-active organisms, simple living organisms, complex living organisms, they do a really good job at giving a kind of framework in which to assess those ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.358,
    "end": 1030.388,
    "text": "Another sort of interesting philosophical question that's really rearing its head at the moment for some reason is this distinction between realism and instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.958,
    "end": 1045.434,
    "text": " I was wondering, you know, it's a live question in active inference, for example, whether the Markov blanket, which acts as the boundary between internal states and external states, whether that's an instrumental tool for us as scientists, or whether that actually had some kind of true ontological status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.475,
    "end": 1056.966,
    "text": "I was wondering if you'd had any thoughts about whether autopoiesis, so self-organization, self-production, and self-distinction, is a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.3,
    "end": 1060.687,
    "text": " Just actually an instrumentalist thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.907,
    "end": 1068.562,
    "text": "So it's just a way of us to describe what seems to be happening at different levels of biology, but it can even go broader than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.444,
    "end": 1079.123,
    "text": "Or whether it's actually an imperative, it's actually a genuine thing, it's a mechanism that's occurring within these organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.297,
    "end": 1084.141,
    "text": " Yeah, that's a really, really interesting question, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.161,
    "end": 1084.662,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.742,
    "end": 1094.096,
    "text": "And yeah, I did see when I was trying to do a little bit of homework for this and then trying to read up on an active inference a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.197,
    "end": 1101.468,
    "text": "I saw there was one paper that kind of made a throwaway remark of, you know, whatever the metaphysical stages of the Markov blanket might be in, I thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1101.548,
    "end": 1101.668,
    "text": "Right."
  },
  {
    "start": 1101.648,
    "end": 1102.429,
    "text": " What's that about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.489,
    "end": 1114.646,
    "text": "So that, I think that like kind of explains, explains what that was, but yeah, I mean, it's, it's in a sense, that's kind of a fundamental meta philosophical and methodological question in again, kind of all of these discourses, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.666,
    "end": 1126.141,
    "text": "It's, it's, it's something that affects all of these different models of cognition, something that you find in the phenomenological tradition too, like are these, these structures, are they heuristics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1126.281,
    "end": 1128.364,
    "text": "Are they kind of, you know, the best",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.344,
    "end": 1158.132,
    "text": " possible thing that we can come up with to to make sense of what's going on or are they actually out there what does it mean for anything to actually be out there in this sense and on the one hand i i don't want to you know get away from the kind of the the materiality of of cognition which is you know kind of crucial to all this like you can you can see this this stuff happening uh you know in different kind of cognizers and i guess it becomes these are structures that become more and more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.112,
    "end": 1180.204,
    "text": " heuristic and instrumental as you kind of move up in cognitive complexity and you know and when it comes to especially kind of structures like outer poiesis and autonomy I mean you know you get applications of this sort of thing to the behaviors of groups for example and you know you you get this kind of scaled up and things like systems theory and I guess there it becomes more and more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.184,
    "end": 1196.995,
    "text": " um, instrumental, but one, one thing that kind of comes to mind, uh, as you're raising that point is, is kind of this, this really interesting insistence in the corner of an active discourse that interests me the most in, in the embodied mind that there is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1198.325,
    "end": 1219.121,
    "text": " we don't have to, and this is kind of deeply phenomenological as well, we don't have to worry that much about these questions because there is this kind of, we do have an insight into what is really out there, so to speak, and into the processes of life and the processes of cognition because we're living cognizers ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.181,
    "end": 1222.847,
    "text": "There's this idea, which kind of actually echoes, I think, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.827,
    "end": 1233.658,
    "text": " Heidegger's famous idea that we're particularly well positioned to do ontology because we're these beings who have insight into and who care about the structure of being itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1233.878,
    "end": 1246.111,
    "text": "And within the embodied mind, there's this idea that as living cognizes, being alive and being cognizes, which are the same thing, gives us an insight into the structures of life and cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1246.191,
    "end": 1251.737,
    "text": "So any heuristics that we use, even if they do end up being purely instrumental heuristics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.717,
    "end": 1257.126,
    "text": " kind of give us something genuinely important and insightful about what's happening out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.146,
    "end": 1261.933,
    "text": "Because in a sense for us, there is no such thing as, you know, just a neutral out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.354,
    "end": 1270.988,
    "text": "There's an interesting idea of like a privileged insight into cognition by virtue of being cognizant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.008,
    "end": 1277.218,
    "text": "So I guess, yeah, as in terms of the phenomenological tradition, it's less of a question that I'm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.198,
    "end": 1278.84,
    "text": " particularly concerned with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.86,
    "end": 1292.558,
    "text": "It's interesting, but yeah, there's more of a sense of, you know, let's look at what this stuff is like from the inside without being too concerned about what kind of actually is out there, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.578,
    "end": 1293.059,
    "text": "Fair enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.539,
    "end": 1301.67,
    "text": "I guess like the harder scientists might, you know, their ears might prick up when they hear that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.65,
    "end": 1324.452,
    "text": " actually our stance the fact that we take a stance on the world uh yields a greater possibility for insight because they might say well every insight that you're going to have is going to be colored in a way by your own personal experience your history your cultural baggage i mean a very post-modern take as well so do you also in a sense do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.617,
    "end": 1341.343,
    "text": " do phenomenologists have to recognize the bias or yes, the coloring of these insights and to what extent therefore is objectivity off the cards for a phenomenologist?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.893,
    "end": 1344.916,
    "text": " Yeah, that's another great question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.936,
    "end": 1346.117,
    "text": "And yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.177,
    "end": 1356.19,
    "text": "So in a sense, the idea that any insight that you come up with, any knowledge, any claims are always going to be situated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1356.25,
    "end": 1365.542,
    "text": "They're always going to be richly shaped and informed by not just your personal history, but of course, you know, broader history, social norms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.522,
    "end": 1375.696,
    "text": " your cultural expectations, the situatedness of knowledge is a fundamental starting point for phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.876,
    "end": 1382.265,
    "text": "It's less about taking objectivity off the table and more about redefining what objectivity is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.345,
    "end": 1387.632,
    "text": "I think that's one of the key points of resonance, for example, between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.612,
    "end": 1413.4,
    "text": " phenomenology and an activism right so it's this idea that again knowledge is always fundamentally situated it's always historical it's always socially culturally embodied and embedded and so that means we have to think about what it is that that we're actually aiming for and and you know there's there's there's no problem in getting rid of this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1413.38,
    "end": 1422.72,
    "text": " or in not being able to achieve this kind of sense of neutrality that isn't really possible for a sense-making organism anyway, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.74,
    "end": 1431.76,
    "text": "Because we enact our world and we bring forth our worlds in ways that mean we're not going to encounter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.74,
    "end": 1457.089,
    "text": " uh the world and in kind of neutral you know gray pure brute matter terms um and yeah that's that's i mean that's you know a widespread point across a whole bunch of discourses the interesting question then is how do we reconfigure what we actually mean by objectivity and especially of course how do we build intersubjectivity into that um and yeah so i think you know that's that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.913,
    "end": 1464.453,
    "text": " The idea that knowledge is fundamentally situated is very much, it's not a problem for phenomenologists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.493,
    "end": 1469.83,
    "text": "Of course, there is, you know, there's this kind of history of, well, phenomenology is trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.721,
    "end": 1474.928,
    "text": " discover these, you know, general structures that make cognition possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.948,
    "end": 1483.08,
    "text": "So isn't there, you know, some kind of tension in saying all knowledge is situated, but also here are the universal structures that make all situate knowledge possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.461,
    "end": 1487.066,
    "text": "So that's kind of, that's an ongoing kind of interesting tension and problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.086,
    "end": 1493.877,
    "text": "But yeah, I think it's more about redefining what kind of, what we mean and want by objectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1494.076,
    "end": 1503.762,
    "text": " Well, it's a, you know, it's a self-defeating element of kind of any non-objective or theory that postulates non-objectivity, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.782,
    "end": 1507.512,
    "text": "I mean, like if the postmodern claim that truth is relative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.048,
    "end": 1510.291,
    "text": " is relative than that claim itself is relative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.311,
    "end": 1514.417,
    "text": "So anyway, it's a kind of wormhole that we don't necessarily need to go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.437,
    "end": 1526.614,
    "text": "I mean, it would be also interesting to have a mathematician on here because I could imagine they would have some gripes with our inability to get hold of the objective, but again,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.982,
    "end": 1528.926,
    "text": " There's no need to go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.748,
    "end": 1531.251,
    "text": "I did have a question, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.551,
    "end": 1541.211,
    "text": "I mean, again, it might be one of those that isn't too relevant to the discourses that you're engaging in, but it's a question sort of about ends and purposes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1541.36,
    "end": 1551.489,
    "text": " So you write in one of your papers, I'm not sure it's the 2015 one, it might be another one, that an autopoetic system is autonomous in that it is its own product.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.609,
    "end": 1560.598,
    "text": "It does not exist in order to bring about something else, to accomplish some externally defined end, but rather to be and perpetuate itself, its identity as its task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.618,
    "end": 1568.565,
    "text": "You also say in the same paper, the organism's purposive aiming towards the overall end of survival",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.967,
    "end": 1577.004,
    "text": " as well as its more immediate needs in successfully navigating environmental circumstances, are structured by a directedness towards something which has not been reached yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.666,
    "end": 1582.656,
    "text": "I guess at first glance, there might be a superficial tension there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.939,
    "end": 1588.95,
    "text": "Can it be dissolved just by saying that what we're talking about with self-perpetuation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.285,
    "end": 1593.64,
    "text": " in the first quote is survival in the second quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.68,
    "end": 1596.048,
    "text": "Is that to do with the kind of identity conflation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.088,
    "end": 1599.058,
    "text": "Is that the way out of that potentially tricky tension?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.135,
    "end": 1606.644,
    "text": " Yeah, yeah, so that's more just kind of a problem of that particular expression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.704,
    "end": 1619.682,
    "text": "So the point about an organism's kind of identity being its own task rather than anything else is not to say that, you know, a cognizer literally doesn't have anything else to do except vibe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.063,
    "end": 1629.535,
    "text": "It's more about this idea that in order to count as an autonomous living system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.515,
    "end": 1633.024,
    "text": " It has to have endogenous ends, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.064,
    "end": 1644.191,
    "text": "And so its survival has to, it's kind of its drive to persist, to maintain itself, to resist the possibility of annihilation has to come from within itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.391,
    "end": 1646.376,
    "text": "It's not something that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.356,
    "end": 1654.408,
    "text": " It's kind of one of the classic ways of distinguishing, say, an artificial from a living system or a living from a non-living system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.428,
    "end": 1673.275,
    "text": "A living system is not something that has been given its end by somebody outside itself, like, say, a designer or a programmer, and where its end is to do something, whether it's a line of code that's meant to do something or whether it's, I don't know, a sort of basic machine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.255,
    "end": 1674.617,
    "text": " intended to do something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.677,
    "end": 1680.104,
    "text": "The point of the living organism is itself, is its maintenance of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.124,
    "end": 1699.549,
    "text": "And then of course, in pursuit of that self-maintenance, that resistance against, you know, the constant threat of annihilation, it pursues all sorts of other projects, which, you know, you can kind of think of almost as, and I think this is where Heidegger is especially helpful, it's kind of arranged around",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.529,
    "end": 1703.294,
    "text": " you know, this kind of fundamental self-concern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1703.614,
    "end": 1714.689,
    "text": "And, you know, as organisms get more complex, you get more and more sorts of complicated projects arranged around what Heidegger conveniently calls, you know, the for the sake of myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.431,
    "end": 1717.252,
    "text": "Thanks, Heidegger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.873,
    "end": 1718.854,
    "text": "Yeah, yeah, no worries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.273,
    "end": 1722.096,
    "text": " Gotta, gotta love the hyphens, but, um, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.116,
    "end": 1729.163,
    "text": "And, you know, and, and there is those, those projects kind of take on more existential, uh, significations as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.223,
    "end": 1740.234,
    "text": "And what it actually means to be self-concerned is no longer just, I want to not starve, but you know, I have a particular conception of what I want the story of my life to look like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.695,
    "end": 1740.995,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.335,
    "end": 1741.596,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.616,
    "end": 1747.041,
    "text": "This is a really interesting avenue because it sort of rears its head in active inference literature as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.161,
    "end": 1748.723,
    "text": "Active inference conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.057,
    "end": 1750.499,
    "text": " Because I think it's still a live question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.3,
    "end": 1757.908,
    "text": "I might be wrong, but I see it still as a live question is to what degree is all the organisms do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.129,
    "end": 1762.153,
    "text": "To what degree is that just a minimization of free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.234,
    "end": 1768.32,
    "text": "And I guess the problem, at least in active inference, is that basically everything can be cast as Bayes optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.421,
    "end": 1771.223,
    "text": "So this is called the complete class theorem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.504,
    "end": 1777.731,
    "text": "So even if I do something which seems antithetical to my survival under some priors, it's Bayes optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.335,
    "end": 1792.548,
    "text": " And so I guess we either could cost this as not being a form of self-organization or we could just expand the notion of self, I guess, in a deflationary way to meet everything that a thing does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.728,
    "end": 1794.75,
    "text": "And it's just based optimal under that scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.27,
    "end": 1803.538,
    "text": "So again, it might be a kind of, um, empty question, but it's just to say it's, it's live at least, um, within active inference as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.578,
    "end": 1808.022,
    "text": "I mean, you know, you've thought about this on the inactivist or auto poetic end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.592,
    "end": 1825.656,
    "text": " It was a question that I had, which is, you know, I think you, you, you said both in your paper and here that autoparesis is certainly necessary in the same way that minimizing free energy is necessary in some quite trivial sense for the persistence of an organism, but it might not be sufficient to define exactly what that organism is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.676,
    "end": 1826.898,
    "text": "And again, that's the open question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.02,
    "end": 1833.127,
    "text": "Um, if it's not sufficient, just, it might be a very silly question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.708,
    "end": 1837.333,
    "text": "What else do organisms or cognizers do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.473,
    "end": 1840.355,
    "text": " Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.435,
    "end": 1849.235,
    "text": "So, yeah, so generally speaking, autocracies and autonomy aren't, you know, they are seen as necessary but not sufficient conditions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.496,
    "end": 1854.908,
    "text": "And so that's where the concept of adaptivity, which I touched on earlier, comes in, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.948,
    "end": 1855.71,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.69,
    "end": 1872.316,
    "text": " One of the key discourses has, for the past probably couple of decades or so, maybe a bit less actually, maybe closer to 15 years, suggested that the necessary and sufficient conditions for cognition and life are autonomy and adaptivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.336,
    "end": 1873.918,
    "text": "That idea of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1873.898,
    "end": 1879.99,
    "text": " being able to respond to whether you're doing better or worse and steering away from doing worse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.051,
    "end": 1892.616,
    "text": "So that the idea is that that might be a kind of, you know, basic enough condition that can still be instantiated by lots of very, very simple organisms, but that can scale up in all sorts of interesting ways, including",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.596,
    "end": 1914.903,
    "text": " um, you know, some of the, the kinds that we talked about, but there is, you know, there, there is still kind of this, this live debate and this, um, this, this ongoing question of, yeah, is, is that enough in terms of sufficient conditions for life and cognition, but also generally, you know, um, how do you draw the line between, uh, is that enough to draw the line between a living and a non-living system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1914.923,
    "end": 1922.232,
    "text": "And I know that, um, so like I said, I, I, you know, I tried to do a little bit of reading, especially on, on some of the dialogues between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.212,
    "end": 1927.15,
    "text": " folks working in active inference and folks working in an activism before this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.191,
    "end": 1930.804,
    "text": "And I saw, you know, that's kind of been one of the questions where folks have kind of asked each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.953,
    "end": 1936.621,
    "text": " You know, maybe this is something where these perspectives can collaborate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1936.641,
    "end": 1939.785,
    "text": "It seems like, you know, across all of these discourses, there's the concern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.165,
    "end": 1943.85,
    "text": "It looks at these theoretical frameworks can apply to all sorts of different systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.171,
    "end": 1951.981,
    "text": "How do we, for example, go from this to explaining what it means for an organism, a living organism, to have a meaningful perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1952.001,
    "end": 1958.31,
    "text": "Do we have enough resources to be able to flesh out what that is and how it becomes so much more complicated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.29,
    "end": 1966.18,
    "text": " Um, and yeah, so I think, I think that kind of that continues to, to remain alive issue in lots of really interesting ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.681,
    "end": 1966.921,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.161,
    "end": 1973.829,
    "text": "And also quite a, at times heated debate, uh, between certain researchers, which I will not get into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.47,
    "end": 1975.712,
    "text": "Um, I don't want to get out to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.333,
    "end": 1978.395,
    "text": "Um, let's, let's go to Heidegger then.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.136,
    "end": 1985.284,
    "text": "Uh, cause he's a sort of, uh, speciality, I guess, if he was, or a, or a focus, a topic of focus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.945,
    "end": 1986.205,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.012,
    "end": 1993.203,
    "text": " You know, scanning through just the active inference literature, researchers might not know too much about Heidegger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.343,
    "end": 1995.146,
    "text": "There have been papers on Herschel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.166,
    "end": 1998.812,
    "text": "Merleau-Ponty obviously is very important because of the embodied aspect of his work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.774,
    "end": 2006.987,
    "text": "I had Inés Ippolito on last week and she spoke about Simone de Beauvoir and how her existentialism can be married to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.367,
    "end": 2012.496,
    "text": "But Heidegger for some reason seems to be the elephant in the room who never really gets mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.083,
    "end": 2020.974,
    "text": " I think a good place to start, and you're going to be far better placed to do this than me, is to tell us why Heidegger is just so radical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.815,
    "end": 2027.403,
    "text": "And my thinking about this is just framing him as kind of the anti-Descartes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.663,
    "end": 2034.212,
    "text": "So sort of setting up that philosophical history, that might be a complete broad brush misidentification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.033,
    "end": 2040.981,
    "text": "But where the kind of Cartesian tradition was and how that kind of got collapsed by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.383,
    "end": 2044.002,
    "text": " Heidegger and others might be a good place to start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.163,
    "end": 2046.144,
    "text": " Yeah, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.204,
    "end": 2058.56,
    "text": "And, and so, yeah, so one thing I, I, I'd want to say at the start too, is that, so even within an active discourse, there hasn't been that much, um, looking at, at Heidegger broadly speaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.58,
    "end": 2072.537,
    "text": "So it's always, you know, as you said, Merleau-Ponty, Husserl, it's great to hear that, um, Inez is doing some work on Simone de Beauvoir and, cause yeah, I, I, um, I've done some work on her myself and from what I know of her, I think I'd agree with, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.517,
    "end": 2077.026,
    "text": " With that perspective, yes, yeah, it's interesting that there is this kind of significant gap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.046,
    "end": 2086.125,
    "text": "And so in terms of what makes Heidegger radical and interesting and useful in kind of opposing that Cartesian tradition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2086.165,
    "end": 2092.298,
    "text": "So to me, the first thing that kind of stands out, and this is something that I touch on in that book,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.278,
    "end": 2105.19,
    "text": " older paper that you came across, Being in the World, Temporality and Outer Poiesis, is that the way he talks about the relationship between cognizer and world, so I'm using the word cognizer,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2106.031,
    "end": 2108.576,
    "text": " I don't read Heidegger in a particularly orthodox way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2108.596,
    "end": 2112.583,
    "text": "I don't particularly care about reading Heidegger in an orthodox way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2112.603,
    "end": 2128.292,
    "text": "And so the way that he talks about the cognizant world relation is both startlingly similar to and also particularly useful for all of these kinds of discourses that look at cognition as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2128.272,
    "end": 2135.962,
    "text": " active, situated, action-oriented, being about, you know, meaning generation, being relational, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.003,
    "end": 2156.17,
    "text": "Because in Heidegger's account of being in the world, you essentially have the same problem that we're still talking about in these discourses, which is on the one hand, emphasizing the kind of the relationality, the extent to which cognizer and world are intertwined such that you can't understand either part from the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.42,
    "end": 2162.087,
    "text": " while, on the other hand, not kind of completely dissolving the cognizer into the world, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.187,
    "end": 2172.079,
    "text": "So unlike some models of embodied cognition, there is still this sense of holding on to a core of self-concern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.76,
    "end": 2179.849,
    "text": "And this is why I argue it's especially resonant with the inactive tradition, holding on to this idea of those boundaries, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.889,
    "end": 2182.292,
    "text": "Again, we've got that central question of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.272,
    "end": 2185.516,
    "text": " A living system is one that defines itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.677,
    "end": 2189.141,
    "text": "It has to be a porous boundary, but it nonetheless has to be a boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.181,
    "end": 2192.926,
    "text": "So again, for Heidegger, the subject's not dissolved into the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.046,
    "end": 2209.208,
    "text": "It's fundamentally, it produces the world, it enacts the world, it's integrated with the world, and yet it still has that kind of core of self-concern and of what, you know, an activist call adaptivity, this kind of future-directed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.188,
    "end": 2210.811,
    "text": " self-concerned planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.432,
    "end": 2234.588,
    "text": "And so, yeah, as phenomenologists are often accused of kind of being unfair to Descartes, and I do think in many ways we are, but thinking as of the Cartesian tradition more specifically than Descartes, there is, yeah, that kind of radical insistence on undermining dualism, insistence on undermining",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.568,
    "end": 2242.663,
    "text": " separation of mind and world, subject and object, but also mind and brain, brain and world, subject and body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.304,
    "end": 2247.972,
    "text": "This idea that these are all kind of fundamentally, constitutively connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.034,
    "end": 2252.22,
    "text": "And so I know this has already been a long answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.26,
    "end": 2257.69,
    "text": "One other thing I wanted to throw in too, and this is something that I think is especially underappreciated,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.67,
    "end": 2261.135,
    "text": " in all of these literatures is how Heidegger then links all of that to time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.037,
    "end": 2268.146,
    "text": "So all of the phenomenologists, and this is something I try to argue too, like time is fundamental to phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.186,
    "end": 2274.615,
    "text": "Every phenomenologist has an account of time and they're all cool and great and interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.857,
    "end": 2281.686,
    "text": "Heidegger's account stands out in particular because it is fundamentally linked to practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2281.666,
    "end": 2297.025,
    "text": " It's fundamentally linked to kind of salient responsiveness, to self-maintenance, to motivation, to this kind of very basic practical normativity, and to what we've been talking about, that kind of temporal complexity that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.005,
    "end": 2320.735,
    "text": " that you know that sense of like life itself is fundamentally kind of anticipatory and that then gets complicated in all sorts of rich and cool ways and so yeah so you've got this model of time that's kind of fundamentally linked to practice normativity motivation self-concern adaptivity so yeah my contention there is like hey look if you know if we're looking at time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.715,
    "end": 2324.5,
    "text": " And then time is super important to all these embodied cognition discourses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.98,
    "end": 2331.869,
    "text": "Why not look at this model of time that kind of comes pre-packaged with this idea of relational cognition and practice?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.889,
    "end": 2332.109,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.39,
    "end": 2332.83,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.85,
    "end": 2345.266,
    "text": "I mean, the parallels there, or at least the way that inactivism and active inference are clear, well, even if it's implicit, clearly informed by Heideggerian perspectives, it's kind of very transparent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.286,
    "end": 2346.047,
    "text": "They're very obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.449,
    "end": 2355.964,
    "text": " Yes, I think the disdain that later phenomenologists have for Descartes might be influenced by the disdain that the earlier phenomenologists had for Descartes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.305,
    "end": 2366.34,
    "text": "I was just searching up, I just think there's a good story about Heidegger throwing Sartre's book in the bin because Sartre had sort of re-invoked a Cartesian self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.482,
    "end": 2370.046,
    "text": "You know, probably quite an angry chap as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.687,
    "end": 2373.472,
    "text": "I'm not making it into Heidegger's personal life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.153,
    "end": 2374.313,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.917,
    "end": 2399.811,
    "text": " yeah there's a lot that i mean actually the a complete side note there's um the the history of philosophical arguments between like you know supposedly quite like stoic uh placid men because it's all men is is a fascinating one i read a really good book uh this year about um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2400.449,
    "end": 2408.836,
    "text": " this fight that Wittgenstein and Karl Popper had at Cambridge's Philosophy Society, which I recommend highly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.976,
    "end": 2410.338,
    "text": "It's called Wittgenstein's Poker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.478,
    "end": 2413.46,
    "text": "Anyway, it's a complete side note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.601,
    "end": 2429.494,
    "text": "I think it might be quite useful for people to, because they might not know what you mean by practice and this notion of practice and tool and how this all links into being and being in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.474,
    "end": 2432.093,
    "text": " Perhaps an example would be useful because I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.545,
    "end": 2440.356,
    "text": " I've been thinking about this because I just wrote a paper with some really wonderful co-authors as well, so credit to them, about flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.498,
    "end": 2454.497,
    "text": "And my thinking about flow states is that it's, again, this is a live question, but it might be rooted in the same mechanisms that Dreyfus called skillful coping and Heidegger would have called at-handedness, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.537,
    "end": 2462.468,
    "text": "So maybe rock climbing is kind of part of the same category as opening a door or gripping a water bottle, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.157,
    "end": 2471.532,
    "text": " Um, so I think, you know, this might, again, this is another live question is the degree to which people conceive themselves as Cartesian egos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.893,
    "end": 2484.355,
    "text": "There might be an intuition, at least when we're talking intellectually to say, well, I am this reified self that has this kind of separation in time and space and identity from the things on which I act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.672,
    "end": 2497.922,
    "text": " Perhaps you can give us an example just from everyday life where Heidegger reveals to us that that intuition or that perspective might not actually correspond to the phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.742,
    "end": 2501.585,
    "text": " Yeah, that's a, that's a great point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.765,
    "end": 2506.892,
    "text": "And, um, just on the, the, the Wittgenstein book, I think I came across the same one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.932,
    "end": 2513.622,
    "text": "It also talks about fantastic case where I think he, he threw chalk or keys or something at one of his students head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.682,
    "end": 2518.449,
    "text": "And it actually, yeah, I think he was like, he would be quite abusive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.471,
    "end": 2525.399,
    "text": "Um, but also, yeah, uh, obviously extremely acute and intelligent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.419,
    "end": 2526.741,
    "text": "I'm not going to demean Wittgenstein.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.001,
    "end": 2528.564,
    "text": "Again, he's also not here to defend himself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.584,
    "end": 2529.445,
    "text": "So who am I to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.425,
    "end": 2530.39,
    "text": " All right, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.431,
    "end": 2532.924,
    "text": "There is a point to this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2533.005,
    "end": 2535.84,
    "text": "So there is kind of, I think you can always see this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.546,
    "end": 2554.886,
    "text": " like this continuing of, in a sense, a Cartesian tradition of thinking about what it is that philosophers do and the kind of activities that are important, whereas there's this idea that you can divide what's, you know, what's happening in here, the really important stuff from, you know, kind of acting in the world and practicing in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2555.647,
    "end": 2565.017,
    "text": "And that, you know, yeah, these so-called geniuses, they get away with terrible behaviors like that because we privilege, we prioritize what's going on in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.997,
    "end": 2590.684,
    "text": " it's as opposed to to kind of how they actually act in in the world and so yeah so coming back to um your point then about um about practice or just in terms of what i mean when i talk about practice it's just a kind of the very basic means ends kind of connection that you have through time right and so controversially and i don't think other heideggerians would agree here it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2590.664,
    "end": 2601.715,
    "text": " you know, even like bacterium swimming away and swimming towards, you know, a better nutrient gradient is kind of like a primordial instantiation of practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.735,
    "end": 2607.88,
    "text": "And then also get, you know, more complicated, as you said, with Heidegger's equipment and tool being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.921,
    "end": 2614.327,
    "text": "So just to kind of to give a quick overview of those concepts and then maybe try and come up with an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2616.489,
    "end": 2619.912,
    "text": "So for Heidegger, it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.892,
    "end": 2626.364,
    "text": " Something that will be familiar to folks who work in, you know, embodied cognition or potentially even active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.985,
    "end": 2638.305,
    "text": "It's just kind of overturning the traditional hierarchy of how we do things, where the idea is that you encounter the world in practical terms first, before you then kind of encounter them in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.91,
    "end": 2662.032,
    "text": " you know, more quantified theoretical terms so that, you know, you're not, and, and I, yeah, I think even within active inference, this holds like you're, you're not, you know, the terminator walking around with kind of, you know, numbers scrolling across your vision, figuring out, you know, that object classified as a table made out of cedar wood is, you know, three meters tall, so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.052,
    "end": 2665.736,
    "text": "Where you, you encounter it first in terms of, well, I've got heavy stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.776,
    "end": 2667.297,
    "text": "I want to put stuff down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.58,
    "end": 2670.946,
    "text": " Or, you know, I don't want to bump into the sharp edge of that table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.986,
    "end": 2675.654,
    "text": "And you're not even, you know, explicitly thinking about this necessarily in such terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.376,
    "end": 2686.874,
    "text": "It's more about encountering the world in terms of calls to action, what the folks in ecological psychology call affordances, you know, different possibilities for doing things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.716,
    "end": 2689.639,
    "text": "And there is, I think, a risk of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.619,
    "end": 2693.904,
    "text": " of kind of under-intellectualizing this process, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.924,
    "end": 2706.88,
    "text": "So for Heidegger, there is still very much this sense that what you encounter isn't like, you know, there's this kind of just pure mass or complete non-conscious absorption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.94,
    "end": 2710.144,
    "text": "You're still kind of encountering things as things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.584,
    "end": 2718.073,
    "text": "And there is still very much the possibility of at least transforming some of those practical relationships into, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2718.29,
    "end": 2720.605,
    "text": " linguistic relationships if you need to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.243,
    "end": 2725.989,
    "text": " But yeah, so in terms of examples, I mean, you know, Heidegger gives us the classic example of the hammer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.631,
    "end": 2737.523,
    "text": "But something that I actually like using in class when I talk about this is, so I game a lot too much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.084,
    "end": 2745.352,
    "text": "And I feel like this is something that fundamentally kind of made Heidegger's account of practice more feasible to me, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.372,
    "end": 2751.199,
    "text": "Because, you know, say you're playing with a keyboard and mouse or you're playing with a controller.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2751.179,
    "end": 2763.249,
    "text": " You are very much so immersed in the game world that you're not really consciously reflecting on these tools that you're using.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.269,
    "end": 2766.758,
    "text": "You don't have this kind of consistent...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.738,
    "end": 2773.076,
    "text": " uh, metacognitive reflection on yourself as being separate to the mouse, separate to the control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2773.156,
    "end": 2775.382,
    "text": "You're just, you are just acting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.144,
    "end": 2776.345,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.365,
    "end": 2781.76,
    "text": "Um, and it's, it's when they, as you know, Heidegger famously says with the Hamets, when they break down that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.74,
    "end": 2784.704,
    "text": " they become apparent as objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2784.824,
    "end": 2787.188,
    "text": "And phenomenologists like doing this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.208,
    "end": 2799.606,
    "text": "They like using so-called breakdown cases because the idea is that we're so immersed in kind of everyday practical existence that it's hard to philosophize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.646,
    "end": 2801.028,
    "text": "It's hard to gain that distance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.068,
    "end": 2809.82,
    "text": "And so we sometimes need to wait for things to go wrong in order for, as Heidegger says, the structures of the world to illuminate, to light up, to become apparent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.401,
    "end": 2811.122,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.132,
    "end": 2818.179,
    "text": " when the mouse runs out of battery at the worst possible moment, the controller drifts or lags.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.56,
    "end": 2829.212,
    "text": "And all of a sudden, you know, it's not just that you become aware of yourself as holding this object, you kind of all of these different structures of the world light up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.252,
    "end": 2831.816,
    "text": "You remember that this is a game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2831.856,
    "end": 2841.447,
    "text": "You become more aware of the hit boxes, the game physics, all of the different little mechanics, all of the numbers that the game is constantly generating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.427,
    "end": 2843.17,
    "text": " And it's like the whole world lights up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.931,
    "end": 2848.359,
    "text": "And at the same time, you have this kind of this tragic moment of distance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2848.379,
    "end": 2862.945,
    "text": "And the interesting thing is that that breakdown is both an interruption, but it's also super useful if you happen to be in a philosophical mood when the controller breaks down, because then you can go, aha, now I'm aware of all of these structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2863.263,
    "end": 2868.51,
    "text": " Right now that's, that's really convergent with, yeah, my, my perspectives on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.89,
    "end": 2874.137,
    "text": "Um, yes, I think the hammer example, so how the good gives this example of a hammer hammering at nails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.479,
    "end": 2882.708,
    "text": "I also don't think it's the best example, like the most canonical example of handedness or, or, or definitely not flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.61,
    "end": 2889.237,
    "text": "I mean, I guess Heidegger is lacking examples because he didn't have, we didn't have rock climbers or surfers or gamers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.162,
    "end": 2896.289,
    "text": " But I'm hard pressed to imagine a hammerer so immersed in hammering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.429,
    "end": 2905.499,
    "text": "I mean, to be honest, I think it would involve a lot of, yeah, metacognitive processes, what we call epistemic foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2905.619,
    "end": 2909.103,
    "text": "So a lot of exploratory behavior, even if that's mind wandering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.724,
    "end": 2910.965,
    "text": "So I take your point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.985,
    "end": 2912.507,
    "text": "I think the game example is a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.926,
    "end": 2913.387,
    "text": " Better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2913.407,
    "end": 2914.83,
    "text": "And yes, you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.87,
    "end": 2919.639,
    "text": "It's not just that this rarefied sense of self emerges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.82,
    "end": 2925.651,
    "text": "As you say, the world itself shifts or is modulated by that breakdown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.433,
    "end": 2935.17,
    "text": "So I talk about how the, you know, I give an example in my paper about a violin string breaking during a concerto and the violin had been in flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.859,
    "end": 2939.145,
    "text": " you know, the violin no longer seems to be presenting affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.205,
    "end": 2941.028,
    "text": "So the violin itself seems to be changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.088,
    "end": 2944.274,
    "text": "And suddenly you get all of this sort of concomitant self-talk as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.374,
    "end": 2947.059,
    "text": "And you get all the doubts and you're suddenly very aware of the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.099,
    "end": 2951.607,
    "text": "And the reason, at least the reason why we postulate that that might be the case is because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.975,
    "end": 2956.48,
    "text": " your free energy minimizing system has kind of entered into a epistemic mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.66,
    "end": 2958.723,
    "text": "It needs to resolve uncertainty about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.323,
    "end": 2966.852,
    "text": "It doesn't have the availability of just like very high expected utility or pragmatic affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.392,
    "end": 2973.339,
    "text": "So yes, we can split this notion of affordances, shout outs of JJ Gibson, into epistemic and pragmatic affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.359,
    "end": 2976.042,
    "text": "And that's a really nice distinction with an active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.494,
    "end": 2989.587,
    "text": " A question that popped into my head, actually the question for, I was, I spoke to John a couple of weeks ago and that was published and it was a wonderful conversation and John was really, really insightful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.447,
    "end": 3003.7,
    "text": "And I said something like, well, I think there's a intuition of, you know, which guides us to see ourselves as some kind of Cartesian ego and John",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.051,
    "end": 3026.042,
    "text": " i and yes i think it's very much contextual bound but i think underlying that at least i think it's a you could propose that there is this intuition john said well i actually think that might be more of a cultural phenomenon um and actually it's a very western idea and it's sort of built off the way that we structure society in the way that we see ourselves do you think that uh there's a kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.512,
    "end": 3033.848,
    "text": " I won't use the word innate, but instinctual or intuitive sense in which we model ourselves as a kind of reified ego?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.888,
    "end": 3042.827,
    "text": "Or do you think, as John says, it's very much bound up in context, whether that be cultural or the kind of practice that we're undertaking at that moment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.41,
    "end": 3046.815,
    "text": "Yeah, I think that's a fantastic question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3048.584,
    "end": 3052.133,
    "text": " I don't know, I find myself kind of leaning in both directions, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3052.153,
    "end": 3059.391,
    "text": "Because on the one hand, I do think there are significant cultural, social, historical factors that are going to shape this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.431,
    "end": 3064.483,
    "text": "You know, there's of course the kind of famous distinction of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.463,
    "end": 3074.998,
    "text": " I guess, Western, if you want to use that word, individualism, as opposed to, you know, kind of other views of thinking about the self in relation to community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3075.038,
    "end": 3091.281,
    "text": "And I was reading a wonderful paper about Ubuntu philosophy, for example, which kind of, you know, says it's not the Cartesian thing of, you know, I think, therefore I am, it's we are, therefore I am, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.341,
    "end": 3092.783,
    "text": "So that kind of fundamental thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.763,
    "end": 3094.367,
    "text": " community and relationality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3094.387,
    "end": 3100.384,
    "text": "And so yes, I absolutely do think that there are kind of specific factors influencing this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3101.026,
    "end": 3108.105,
    "text": "On the other hand, so one of the interesting things that kind of, I guess the phenomenological tradition, which is also super Eurocentric,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.085,
    "end": 3117.959,
    "text": " brings up is this idea that the way that cognition works kind of almost perversely encourages us to forget how cognition works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.005,
    "end": 3125.79,
    "text": "These processes cover their own tracks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.77,
    "end": 3133.179,
    "text": " and make us kind of, you know, overlook just how practically immersed we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3133.219,
    "end": 3154.123,
    "text": "And yeah, there's this kind of interesting idea of, you know, again, for example, in Heidegger, there's this idea that because we are fundamentally practical creatures, that means we're likely to kind of lose ourselves in the practical everyday to an extent that we start kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3154.103,
    "end": 3157.366,
    "text": " you know, forgetting the existential ramifications of what's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.426,
    "end": 3164.473,
    "text": "And we kind of start losing, in a sense, that kind of explicitly futural aspect of ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.314,
    "end": 3169.858,
    "text": "Or, you know, and we forget our mortality, our finitude, and all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.878,
    "end": 3179.588,
    "text": "And you get this kind of throughout the phenomenological tradition that the very things, the very kind of purposiveness, the embodiment, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.568,
    "end": 3187.57,
    "text": " I guess the depth of our investment as well, just how meaningful the world is to us, meaning that kind of the precariousness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.613,
    "end": 3197.601,
    "text": " of our condition and, and all of these kind of the cogs underneath are things that we like to try and ignore and that we tend to turn away from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.641,
    "end": 3217.978,
    "text": "And that is also something that, you know, you, again, you do find in lots of philosophical traditions around the world, this idea that we do kind of have this, this maybe not innate, but we certainly have a very common tendency to lose sight of ourselves, forget ourselves in the very kinds of practices that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3217.958,
    "end": 3220.54,
    "text": " you know, are fundamental to the kinds of creatures that we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.701,
    "end": 3223.041,
    "text": "So there's always this kind of danger of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.0,
    "end": 3225.362,
    "text": " losing sight of ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.382,
    "end": 3232.654,
    "text": "There's always this kind of danger of seeing ourselves in an atomized, isolated, individualistic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.775,
    "end": 3250.564,
    "text": "I was actually, just earlier this year in Ethics 101, we were going through various forms of Confucianism and there is this brilliant idea in kind of one of the schools of Confucianism that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.573,
    "end": 3270.253,
    "text": " Once you kind of start mistakenly thinking of yourself as an isolated object rather than as being part of the fabric of everything and being involved in everything being relational, then it's almost a snowball effect where you actually become more and more self-isolating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.313,
    "end": 3273.136,
    "text": "You feel lonelier because you're thinking of yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.538,
    "end": 3279.403,
    "text": "That makes you more selfish and it has all of these kind of flow and effects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.383,
    "end": 3286.932,
    "text": " I guess, yeah, on the one hand, I absolutely think there are immensely important historical, social, cultural specificities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3287.593,
    "end": 3297.144,
    "text": "On the other hand, I find it really interesting that lots of philosophical traditions talk about our tendency to kind of misconceive of ourselves as these aged individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.184,
    "end": 3298.546,
    "text": "So that might be quite widespread.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.986,
    "end": 3302.37,
    "text": "Yes, that's really useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.127,
    "end": 3319.408,
    "text": " Yes, I mean, I guess it comes to a philosophical question about what selfhood is and how much we're being swayed by our own... Well, it's only a sort of misconception or illusion if you buy the notion in the first place that the self is a kind of atomistic, rarefied thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.428,
    "end": 3323.193,
    "text": "So again, it's kind of up for grabs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.774,
    "end": 3329.841,
    "text": "But I think what's lovely about active inference, and again, I'm going to toot its horn, is that it kind of gives a computational account of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.542,
    "end": 3332.745,
    "text": "So I think what...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.265,
    "end": 3353.923,
    "text": " way it would be answered now and i you know this is actually an area of work i really want to keep delving into personally is that this heideggerian notion that we tend to forget exactly how cognition is when we're immersed in the world i think that makes sense because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.511,
    "end": 3363.283,
    "text": " What we're doing when we do have a reified sense of self is accessing all the parts of our cognitive machinery that rely on a memory, on proposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.904,
    "end": 3366.788,
    "text": "Because we're in this epistemic mode, we're resolving uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3366.808,
    "end": 3370.193,
    "text": "We're testing our model parameters, all these kind of technical things in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.694,
    "end": 3383.171,
    "text": "Whereas when we're in flow or when we're in skillful coping, to use Dreyfus' term, we're not deploying attention onto that part of the cognitive machinery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.211,
    "end": 3384.433,
    "text": "So it makes perfect sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.886,
    "end": 3410.725,
    "text": " why we you know it's almost a contradiction a you know to say that um yeah to say that you could propositionally know who you are whilst you're immersed in the unfolding of reality that you're a part of so i think i think active influence actually gives a computational account of of where that of where that kind of disconnect comes from but again i i think it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.532,
    "end": 3434.451,
    "text": " think the important thing to remember as well at least from an active influence perspective is that like one one isn't really privileged from the other um because again one's a pragmatic mode and one's an epistemic mode and you need both to minimize free energy you need both to survive fundamentally um and so although yes that isolation that atomism is uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.768,
    "end": 3463.223,
    "text": " painful in a way uh and you know you could go all the way down to the buddhism and say that the craving the dukkha that comes from that self is the kind of heart of suffering perhaps but at the same time uh i would rather be a creature that can balance epistemic and pragmatic needs than just i i just don't think it's feasible given the type of things we are to be to be solely pragmatic cool well that's me that's my sort of rant over um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.777,
    "end": 3465.524,
    "text": " No, I, I, I agree actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.665,
    "end": 3471.289,
    "text": "Um, yeah, just sorry to jump in just because I just, yeah, I want it to highlight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3472.096,
    "end": 3498.441,
    "text": " pretty much that that i agree and i think again that's kind of one of the interesting things especially about um you know heidegger's account that kind of often gets missed there's not this idea that you know theoretical cognition is bad science is bad quantification is bad or that it's something that we could ever actually put aside um so again it kind of gets under intellectualized and a lot and you know there's there's this tendency to kind of overemphasize like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.421,
    "end": 3510.507,
    "text": " you know like you said kind of the importance of uh immersed practical coping but the idea is that yeah we absolutely need both we need all of these states um and when things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.111,
    "end": 3522.264,
    "text": " What happens when things go awry, philosophically speaking, is when we forget that relationship and when we kind of focus on one to the exclusion of the other and forget how they interrelate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.284,
    "end": 3524.446,
    "text": "So, yeah, I absolutely agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.546,
    "end": 3534.077,
    "text": "It's very much this sense of, yeah, you not only can we not put these tendencies aside, but we shouldn't want to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.117,
    "end": 3534.978,
    "text": "We don't have to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3535.018,
    "end": 3539.363,
    "text": "They're fundamentally part of what makes cognition as complex as it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3539.512,
    "end": 3539.812,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.073,
    "end": 3540.633,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.653,
    "end": 3550.383,
    "text": "And again, there's a kind of self-perpetuating loop, perhaps, in which when we're in this kind of more epistemic mode, we tend towards wanting that certainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3550.503,
    "end": 3551.944,
    "text": "Okay, this is the way to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.984,
    "end": 3556.689,
    "text": "And I think we've seen this in the kind of westernization of something like a mindfulness practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.149,
    "end": 3565.097,
    "text": "Well, if I could just be mindful the whole, you know, whatever that means, and it's a very loose, it depends, one, what mindfulness practice you're doing, but also like, will you be mindful too?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.668,
    "end": 3567.271,
    "text": " How deep is that metacognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.291,
    "end": 3568.673,
    "text": "There are loads of questions that come up from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3568.733,
    "end": 3583.356,
    "text": "But my point is that because we're seeking something to resolve our uncertainty, and it's an existential uncertainty about how the world is, again, it's a very nascent thought in my mind, we're looking for that kind of singular solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.278,
    "end": 3589.326,
    "text": "Because that's the way we resolve most of our uncertainty is just to find out the facts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.087,
    "end": 3590.848,
    "text": "But actually...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.52,
    "end": 3614.676,
    "text": " maybe the the deeper truth is that this these binary distinct like it's all it's all dynamic you don't want to have one over the other and actually maybe that you know there's plenty of cases where i'm doing both pragmatic skillful coping and some epistemic exploration right when i open the door yes i'm not reifying the door handle i'm not doing epistemic foraging about the door handle but i might be about what i'm gonna have for dinner",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.432,
    "end": 3623.646,
    "text": " Occupy a very privileged position where there's this complete absorption and we have a kind of technical detailing about why that might be the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.367,
    "end": 3629.095,
    "text": "I think the other thing is that I don't know whether this is a strictly Heideggerian idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.115,
    "end": 3635.365,
    "text": "I know Dreyfus talks about it, is that this kind of Dasein, this being in the world brings a bit of sense of familiarity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.239,
    "end": 3639.683,
    "text": " A, uh, you know, Dreyfus would talk about skillful coping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3640.183,
    "end": 3642.446,
    "text": "Um, Heidegger talks about our handedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3642.786,
    "end": 3648.933,
    "text": "And as you say, we're kind of, yes, we are practical creatures and the world is made for us and we're made for the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3648.973,
    "end": 3650.695,
    "text": "And there is this kind of mutual coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.576,
    "end": 3656.562,
    "text": "So how fundamental is the notion of familiarity to phenomenology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3657.583,
    "end": 3663.649,
    "text": "And I guess a question that comes up is, are we at risk of losing that familiarity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.89,
    "end": 3665.031,
    "text": "And if so, how?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.087,
    "end": 3668.67,
    "text": " Yeah, brilliant question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.69,
    "end": 3669.331,
    "text": "Thanks, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3669.411,
    "end": 3685.52,
    "text": "And I've actually been thinking about this too, from kind of a different direction of, yeah, kind of looking at different discourses that talk about the importance, as active inference does too, of course, of uncertainty and unpredictability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.64,
    "end": 3686.361,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3686.341,
    "end": 3700.456,
    "text": " I think there's very much this need to, again, you know, as we've been saying before about practice and theory to resist binaries and then kind of resist, you know, prioritizing one over the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.516,
    "end": 3703.945,
    "text": "And so, yeah, on the one hand, absolutely, as you said, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.925,
    "end": 3713.58,
    "text": " Being in a world involves this sense of not only that, you know, the world is made for us, but more that, you know, we're enacting this world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3713.66,
    "end": 3716.144,
    "text": "This is our world that we're bringing forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.805,
    "end": 3721.933,
    "text": "And so, of course, you know, the world that you navigate is going to, in a sense, reflect yourself back at you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3721.913,
    "end": 3726.56,
    "text": " you're encountering it in terms of, you know, your needs, your capacities, your projects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3727.221,
    "end": 3733.05,
    "text": "And so there is this, this intimate familiarity with kind of practice as such, right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.09,
    "end": 3747.533,
    "text": "With this idea of, I mean, that kind of, um, there's a point where Heidegger talks about in a sense like that, the weirdness, if you really step back and think about it, of the fact that, yeah, we're, we're these creatures who just put us in the world and, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.513,
    "end": 3752.563,
    "text": " doing stuff in order to stay alive, in order to, striving for goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.623,
    "end": 3754.867,
    "text": "That's just something that we can naturally do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3754.907,
    "end": 3756.571,
    "text": "That's just what it means to be alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3757.372,
    "end": 3769.977,
    "text": "And so, yeah, so there is this, this kind of important sense of familiarity, but at the same time, um, especially, you know, broadly in the phenomenological tradition, um, and, you know, kind of tangential",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3769.957,
    "end": 3799.963,
    "text": " theorists from hans jonas to again all the books on there's there is this this emphasis on uncertainty as well and so yes this is our world but we are fundamentally future directed creatures um we have to confront not just confront but embrace uncertainty at every point and it's kind of that fundamentally in many ways that we're running away from a lot of the time but yeah there's this sense that you know and we we try to reduce",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.943,
    "end": 3807.338,
    "text": " our relationship to uncertainty and unpredictability by just cashing it out as planning, anticipation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.378,
    "end": 3812.048,
    "text": "I can, you know, I can tame the week by writing down exactly what's going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.068,
    "end": 3813.812,
    "text": "But of course, life doesn't work like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3813.892,
    "end": 3819.724,
    "text": "So, you know, Heidegger talks about confronting and kind of being directed to possibility as such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.704,
    "end": 3842.32,
    "text": " um and this importance of these moments where the world isn't familiar anymore right so he he talks about unheimlichkeit um which you know is is kind of it's it's it's horror it's eeriness um but it it it is quite literally not at home this right so where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3842.3,
    "end": 3859.212,
    "text": " that familiarity that we take for granted is kind of the rug is pulled out from under us and we need those moments again not only to do philosophy but actually to get a sense of the existential import of what we're confronting so there is this kind of constant duality of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3859.192,
    "end": 3884.187,
    "text": " familiarity yes we're intimately familiar with practice as practical beings but also we're creatures of uncertainty we're creatures of unpredictability and that is kind of what it means to be alive to confront and grapple with unpredictability all the time well i'm so happy you brought up the future as well there because i think uh that's that's kind of one of the big themes i do want to touch upon before i do that um and so that was kind of just a memo to myself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3885.365,
    "end": 3889.833,
    "text": " I think a lot of what you're talking about here in terms of Heidegger maps onto his account of mood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.055,
    "end": 3899.51,
    "text": "I might be speaking out of place here, but I think Heidegger puts a real emphasis on anxiety and boredom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.151,
    "end": 3906.242,
    "text": "Almost like these are these kind of two axes or the end of the axis of mood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.695,
    "end": 3908.258,
    "text": " Is that right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.759,
    "end": 3911.664,
    "text": "And if so, why those two moods?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.485,
    "end": 3925.868,
    "text": "Seems one, quite pessimistic, and two, maybe not totally faithful to our lived experience where there's joy and relief and other such experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.113,
    "end": 3928.996,
    "text": " Yeah, no, that's a brilliant question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.036,
    "end": 3930.939,
    "text": "Yeah, that's exactly right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.959,
    "end": 3935.806,
    "text": "So that's the kind of part of his account, his framework that I'm looking at here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.866,
    "end": 3944.218,
    "text": "This idea of, you know, the world matters to us and it matters to us in a particular way because we're attuned in a particular way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3944.238,
    "end": 3954.994,
    "text": "And yeah, there are some moods that are kind of particularly fundamental, especially from the perspective of somebody who wants to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3955.919,
    "end": 3959.385,
    "text": " make the everyday just strange enough to be able to do philosophy about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.405,
    "end": 3962.87,
    "text": "And so Heidegger does talk about, you know, other effective states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.91,
    "end": 3967.217,
    "text": "He does talk about joy and love and anger and hate and all of that sort of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.958,
    "end": 3977.794,
    "text": "But the existential import of anxiety and boredom, I think, is, yeah, the capacity to kind of, again, be like the broken hammer, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.894,
    "end": 3980.138,
    "text": "Cast the world into light, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3980.118,
    "end": 3988.566,
    "text": " by disrupting how we navigate everyday sense-making in particularly radical ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.246,
    "end": 3996.533,
    "text": "Especially with anxiety, the key is that you're not afraid for yourself as such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.813,
    "end": 4007.543,
    "text": "You're experiencing this dread at the loss of, or at your world, at your normal ways of sense-making being put into question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4007.523,
    "end": 4013.854,
    "text": " which reveals how those operations of sense-making actually function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.776,
    "end": 4023.812,
    "text": "And so, yeah, so it seems like a particularly grim account, but again, it's something that you find in phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.832,
    "end": 4025.194,
    "text": "I mean, what was it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.102,
    "end": 4030.189,
    "text": " I'm trying to remember the three ones that Satra focused on in particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.209,
    "end": 4036.781,
    "text": "So there was shame as, you know, shame being kind of the proof of the existence of other minds, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.801,
    "end": 4046.92,
    "text": "So we could only feel shame if other minds actually did, because nothing could make us feel shame the way that another free, like, human being, another four itself could.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4046.94,
    "end": 4049.865,
    "text": "And so it's that sense of, you know, it's not deliberately...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.845,
    "end": 4052.432,
    "text": " It's not saying this is all there is to the human condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.452,
    "end": 4063.602,
    "text": "It's not saying these are the only important effective states, but it's saying these are particularly significant because of what they show us about how the world and relational cognition operates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.919,
    "end": 4066.664,
    "text": " Yes, they were cheery, weren't they?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.525,
    "end": 4068.928,
    "text": "Jean-Paul, thank you for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.948,
    "end": 4076.1,
    "text": "Well, yes, he did say you must act as if the whole world is watching you, which is slightly ominous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.121,
    "end": 4077.562,
    "text": "Maybe true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.963,
    "end": 4078.644,
    "text": "Slightly ominous, though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.706,
    "end": 4079.926,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.946,
    "end": 4083.312,
    "text": "Well, yes, let's jump to futurity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4083.393,
    "end": 4086.658,
    "text": " My word of the week, because I've been reading your papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.479,
    "end": 4100.259,
    "text": "You quote Heidegger, who says that self-projection upon for the sake of itself, again, back to the hyphens, is grounded in the future and is an essential characteristic of existentiality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.64,
    "end": 4104.085,
    "text": "The primary meaning of existentiality is the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.166,
    "end": 4107.07,
    "text": " You then also say, and I'll get it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.471,
    "end": 4112.979,
    "text": "Secondly, I think that we can also read the temporality of autopoetic cognition in future weighted terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4113.4,
    "end": 4129.684,
    "text": "The meaningful world generated by the activity of the organism in collaboration with its environment is arguably defined by an orientation towards futurity in that the future survive of the system that provides the framework for all its actions and the salience that it produces in conjunction with the situations it encounters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.664,
    "end": 4139.077,
    "text": " So we've got kind of two strands there and a dual focus on the future, one from Heidegger and one from the inactivist tradition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.079,
    "end": 4145.887,
    "text": "Obviously, active inference is the future and the unfolding of the future is very important in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.907,
    "end": 4149.512,
    "text": "But before we go there, let's start with Heidegger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.113,
    "end": 4153.798,
    "text": "Why is the future such a critical part of his philosophy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.382,
    "end": 4157.204,
    "text": " Yeah, great question, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4157.284,
    "end": 4170.219,
    "text": "So Heidegger's account of time in general, just to kind of step back a bit, is an account that fundamentally looks at lived time in kind of non-linear terms, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.259,
    "end": 4180.671,
    "text": "So the idea is that you can't kind of nicely, neatly separate past, present and future into these, you know, these kind of separable moments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4180.731,
    "end": 4184.055,
    "text": "They're always intertwined and they have these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.035,
    "end": 4207.343,
    "text": " feedback loops in a sense where you know past and future kind of shape each other and in ways that we wouldn't expect if we had a purely linear conception of time and and just to you know to kind of to add a little footnote to that i think so just from the little that i've read of active inference that seems again a particularly interesting point of resonance right this idea of you know past and future kind of revising each other because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.458,
    "end": 4214.726,
    "text": " what you're, what you experience, what you're acting, what you're doing, your predictions kind of help you to revise your priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4214.746,
    "end": 4222.073,
    "text": "And there's this kind of feedback loop of like updating both predictions and, and, and kind of prior beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4222.093,
    "end": 4222.714,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4223.635,
    "end": 4233.465,
    "text": "And just to jump in there before I forget, um, I think a paper that I see you would really enjoy, but I think everyone would really enjoy is, um, Jakob Howie's got one called distrusting the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.833,
    "end": 4238.838,
    "text": " where he basically takes the phenomenology of, I think William James called it the specious present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.878,
    "end": 4246.626,
    "text": "And I know Hussle talked about this kind of seeping of the past and the future into the present and how this yields a kind of flow of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4247.327,
    "end": 4252.952,
    "text": "And he gives a theoretical account of that under active inference terms in terms of attention and precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.993,
    "end": 4255.936,
    "text": "So just a little addendum there for anyone who's interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.976,
    "end": 4261.601,
    "text": "Active inference has dabbled into the phenomenology of time, and that's a really good place to start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.641,
    "end": 4263.283,
    "text": "But anyway, back to Heidegger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4264.259,
    "end": 4264.84,
    "text": " Yeah, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.88,
    "end": 4266.301,
    "text": "No, that's super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.721,
    "end": 4267.842,
    "text": "I'll have to check out that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4267.862,
    "end": 4268.823,
    "text": "I'll send you a link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.504,
    "end": 4277.291,
    "text": "We're kind of operating with this non-linear sense of time where all of these different aspects of time can revise each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.352,
    "end": 4283.457,
    "text": "So kind of moving away from this focus on the now and this focus on neat linear sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4284.418,
    "end": 4291.465,
    "text": "And within that, though, so on the one hand, Heidegger argues for what he calls typically Heideggerian terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.445,
    "end": 4297.674,
    "text": " The equi-primordiality of past, present and future, which just means they're equally primordial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4298.134,
    "end": 4299.977,
    "text": "So you're not just focused on the now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4300.017,
    "end": 4309.47,
    "text": "Each of these aspects is kind of meant to be equally significant, equally fundamental in kind of structuring the way that we experience things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.45,
    "end": 4315.441,
    "text": " But then there is, within all of that, still this kind of emphasis on the future, this stretching into the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4316.222,
    "end": 4322.514,
    "text": "And, you know, so Heidegger says that explicitly a whole bit, but then of course the question is, why does he say that explicitly a whole bit?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4322.574,
    "end": 4329.366,
    "text": "And so part of the reason for that, I argue, is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.818,
    "end": 4336.33,
    "text": " The conception of ourselves, or of the living organism, I don't think that this is just restricted to the human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.65,
    "end": 4352.198,
    "text": "The conception of the living organism as a creature that has, that fundamentally wants to stay alive, that's concerned about itself, that has projects to fulfill, whether that project is, you know, going from here to there, or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.178,
    "end": 4357.545,
    "text": " You know, I want to become a best-selling writer or whatever someone's existential project might be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.086,
    "end": 4361.47,
    "text": "The very idea of a project is always future-directed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.511,
    "end": 4373.547,
    "text": "So if we're defined, the very idea of self-concern, the very idea of persistence, self-maintenance, survival, is always kind of going to be fundamentally future-directed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.647,
    "end": 4377.172,
    "text": "It doesn't make sense except in futural terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4377.252,
    "end": 4381.257,
    "text": "And the reason that we need to try and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.237,
    "end": 4388.246,
    "text": " survive, the reason that persistence is an effort, the reason that annihilation is a potential threat, is because of uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.807,
    "end": 4403.485,
    "text": "So if there were no openness, if there were no sense of something that could happen that you need to adjust your responsiveness to, then there would just be stagnation, there would be nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.166,
    "end": 4409.573,
    "text": "And again, going back to that concept of adaptivity that we've touched on a few times,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.553,
    "end": 4416.946,
    "text": " And this is why I think there are particular resonances between Heideggerian phenomenology and inactivism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.407,
    "end": 4422.636,
    "text": "This very idea of being able to respond to what happens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4422.676,
    "end": 4431.932,
    "text": "And of course, for Heidegger, all of that is caught up in the overarching importance of our limitations, our precariousness, our finitude, our mortality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4432.469,
    "end": 4440.579,
    "text": " Because there is this ultimate endpoint to our future and everything before that is open-ended.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.139,
    "end": 4449.049,
    "text": "That's the reason, the ultimate structural orientation that shapes everything else that falls into place around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.91,
    "end": 4460.282,
    "text": "You've got, like I said, on the one hand, this non-linear account of time, but everything about it privileges the future because the future in a sense,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4460.903,
    "end": 4463.226,
    "text": " explains cognition, explains life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.246,
    "end": 4465.088,
    "text": "You couldn't be the kind of creature that we are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.108,
    "end": 4471.956,
    "text": "You couldn't be a living creature without this kind of future directedness and then having to grapple with uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.476,
    "end": 4472.757,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.297,
    "end": 4490.117,
    "text": "And I guess before we make that convergent point with autoprocessing and activism, which should be becoming clearer for the audience, I think what's really special about this account that Heidegger gives us is, and I think it's your term, which I completely love,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.468,
    "end": 4492.931,
    "text": " is an ongoing futurity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.672,
    "end": 4497.938,
    "text": "I said that to my master's supervisor because I have only done my master's, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.998,
    "end": 4499.38,
    "text": "I haven't done my PhD yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.242,
    "end": 4503.566,
    "text": "So yes, still very much a layman to all of these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.586,
    "end": 4513.759,
    "text": "But I said it to my master's supervisor because he loves Hydro and actually did his doctoral thesis on skillful coping and situator cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.779,
    "end": 4515.481,
    "text": "So this would really be up his street.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.002,
    "end": 4517.384,
    "text": "I said, I absolutely love this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.424,
    "end": 4518.546,
    "text": "I think this is an amazing idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.826,
    "end": 4519.447,
    "text": "Because yes, you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.467,
    "end": 4520.408,
    "text": "I mean, we think of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.299,
    "end": 4533.469,
    "text": " Maybe again, it's this cognitive bias, the past, the present, the future as these kind of, I don't know, these kind of rarefied extensions and the future kind of going on ad infinitum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.377,
    "end": 4537.822,
    "text": " Heidegger's got this different perspective of an ongoing futurity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.862,
    "end": 4553.343,
    "text": "And I think if I read your work correctly, it points to this notion that everything we have to do has to be grounded in some sense because we're fundamentally self-concerned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.884,
    "end": 4558.09,
    "text": "And to be self-concerned is to take into account",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.559,
    "end": 4560.342,
    "text": " the future of yourself, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4560.362,
    "end": 4566.472,
    "text": "There's no self, there's no self concern without a reference point for you're going to be at time n plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.153,
    "end": 4576.028,
    "text": "So maybe it'd be really useful because I probably butchered that to just give a little bit more about what this concept is of kind of an ongoing futurity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.763,
    "end": 4578.124,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4578.144,
    "end": 4578.344,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4578.364,
    "end": 4579.526,
    "text": "And you didn't butcher that at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.566,
    "end": 4582.75,
    "text": "That was actually really incredibly well articulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.633,
    "end": 4585.514,
    "text": "No, that was awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.534,
    "end": 4585.875,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.935,
    "end": 4595.248,
    "text": "So I don't have much to add on top of what you've said, but yeah, just to kind of essentially to highlight what you've mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.228,
    "end": 4611.398,
    "text": " exactly as you said, the very idea of self-concern means that there's always going to be this future-directedness, you know, there's like the, all of these concepts that we talk about in, you know, embodied cognition and activism, active inference to the, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.378,
    "end": 4616.985,
    "text": " All of them only make sense in terms of a relationship between N and N plus one, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4617.286,
    "end": 4618.628,
    "text": "Or T and T plus one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4618.648,
    "end": 4622.633,
    "text": "The current state of the system and the next state of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4622.653,
    "end": 4624.535,
    "text": "Is that a desirable relation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.575,
    "end": 4627.119,
    "text": "Is it an undesirable relation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4627.159,
    "end": 4630.243,
    "text": "What does the system do to get from this state to that state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4630.323,
    "end": 4631.665,
    "text": "What happens when that goes wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4632.446,
    "end": 4638.314,
    "text": "Motivation, normativity, agency, action, all of those only make sense in those terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4638.354,
    "end": 4640.136,
    "text": "They're all about relations between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.521,
    "end": 4643.029,
    "text": " the current and future states of the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.912,
    "end": 4649.992,
    "text": "And exactly as I said for Heidegger, the future and self concern are fundamentally linked in these ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.695,
    "end": 4653.484,
    "text": "And there is very much this emphasis that this is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.713,
    "end": 4660.001,
    "text": " this is a futurity that stretches out until it doesn't, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4660.021,
    "end": 4662.805,
    "text": "So it's never a future that arrives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.106,
    "end": 4670.076,
    "text": "And I think that especially that's something that appeals to me about an activism, this idea that stagnation is death, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.096,
    "end": 4673.802,
    "text": "That there is, the system's not going to stop changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4673.782,
    "end": 4700.447,
    "text": " um it can't the system is always going to be responding to stimuli it's always going to be grappling with uncertainty um and i guess that's also something that happens in active inference you're always you know the brain doesn't suddenly go okay i've i've predicted it i've done it i'm done boxes ticked i'm gonna sit here now and that's it um that only happens in that only happens when the system ends yeah um that yeah it's it's always it's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4701.068,
    "end": 4705.513,
    "text": " always this, this kind of this, yeah, this, this stretched out futurity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.553,
    "end": 4719.887,
    "text": "And even when you accomplish a particular goal that, you know, that still is kind of organized in this broader framework of future-directedness, of goal-directedness, where there's always this overarching goal of self-concern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4719.927,
    "end": 4722.31,
    "text": "That's not something you can achieve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.41,
    "end": 4724.432,
    "text": "That's not something you can be done with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4725.093,
    "end": 4725.513,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.533,
    "end": 4727.515,
    "text": "You're only done with it when it ends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.917,
    "end": 4756.573,
    "text": " yeah yeah exactly that's wonderfully uh well said yes without being morbid it does sound nice to just have a bit of stasis though but unfortunately no unfortunately we're just open and we're going to keep being uh openly dynamic um i think just to you know cap off what we've been talking about here in terms of this ongoing futurity if i may um i'd like to read the sort of extension of that bit where you know i talked about autopoiesis being in couched in future weighted terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.739,
    "end": 4765.875,
    "text": " You say, the survival of the organism is not merely a simple not yet that is to be anticipated or drawn out in a concrete plan, however.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.376,
    "end": 4769.361,
    "text": "This is a future that will never arrive or be finally accomplished.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.742,
    "end": 4776.233,
    "text": "It is an ongoing futurity that orients everything else and that can never be closed off for the striving towards it can only end",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.213,
    "end": 4784.323,
    "text": " not with being grasped or secured, for these are not possible, but with the annihilation of the framework they are rendered meaningful with the disintegration of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4784.844,
    "end": 4788.528,
    "text": "For the autopoietic adaptive system, stasis is death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.668,
    "end": 4797.299,
    "text": "There is no endpoint, only the ultimate ceasing of those processes of resistance and precariousness that define the organism's very life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4798.2,
    "end": 4799.662,
    "text": "Ah, I love that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.882,
    "end": 4801.044,
    "text": "That's so good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.025,
    "end": 4802.626,
    "text": "Well, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.166,
    "end": 4804.448,
    "text": "It's really beautiful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.428,
    "end": 4831.262,
    "text": " What I will say, again, I'm not making a criticism, but I think it's just interesting, is that you also say, Heidegger's account, again, we'll jump in, you know, without viewing Heidegger, the enactment of kind of one extension, but jumping back to Heidegger, Heidegger's account advised us to view the future world I mentioned as having a special significance, one that can be cashed out in terms of a radical indeterminacy that transcends mere predictive or anticipatory models of futurity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.681,
    "end": 4837.067,
    "text": " Now, I'm sure everyone's ears are just going mental because they heard the word predictive and we all get very excited when we hear predictive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.407,
    "end": 4846.258,
    "text": "So yes, I take the philosophical and phenomenological point that there is, yes, that being itself has to contend with the indeterminacy of the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4846.318,
    "end": 4855.528,
    "text": "And that irregularity, that unpredictability shapes itself concern in the sense that everything is projected to some T plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.078,
    "end": 4863.932,
    "text": " I sense that there isn't actually a conflict here or a tension with Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.026,
    "end": 4867.589,
    "text": " because I think we're probably talking about two different things here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.049,
    "end": 4877.66,
    "text": "One is that we have the kind of very mechanistic technical capability to predict in some deep temporal way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4877.7,
    "end": 4890.414,
    "text": "And then the other is actually what is the phenomenological experience in terms of like how I live, where all my living is guided by some future orientated self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.895,
    "end": 4894.999,
    "text": "Is that, would you say that's a kind of sufficient way to resolve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.979,
    "end": 4904.078,
    "text": " that not underplaying of prediction but let's just say like that prediction itself is not sufficient for a Heideggerian account of being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.526,
    "end": 4907.648,
    "text": " Yeah, I think that's a great way of putting it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.709,
    "end": 4911.773,
    "text": "So especially, yeah, that last point, as you said, so that prediction is not sufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4912.754,
    "end": 4924.849,
    "text": "So it is worth noting that, you know, when Heidegger, for example, uses words like anticipation or prediction, he's trying to contrast different ways that we have of relating uncertainty, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4924.889,
    "end": 4934.74,
    "text": "And so, yeah, where the kind of the more flatter or more reductive ways of relating to uncertainty are in a sense about trying to tame uncertainty, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4934.72,
    "end": 4957.35,
    "text": " Um, and so if, if there's, I assume that, you know, that the way that we'd be using prediction in that circumstance isn't the way that, you know, prediction is cashed out in, for example, predictive processing that it it's, I'm assuming that, you know, that is a much kind of richer, more complicated process as well, especially where things can go wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.37,
    "end": 4957.63,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4957.711,
    "end": 4961.115,
    "text": "So the, the possibility for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4961.247,
    "end": 4970.588,
    "text": " Yeah, for things to go awry, for what happens to be other than predicted, for there to be risk, there to be failure, that's particularly important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4970.889,
    "end": 4978.767,
    "text": "And yeah, for a relationship to, again, to what it is that we're predicting that is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4979.202,
    "end": 4995.321,
    "text": " you know, is less about kind of plotting out a straightforward path that rules out future uncertainty and is kind of more, I don't want to use the word surfing uncertainty because that immediately sounds like the title of Andy Clark's wonderful book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.162,
    "end": 4997.944,
    "text": "But yeah, that's not what I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4998.264,
    "end": 5000.547,
    "text": "You know, embracing uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5000.567,
    "end": 5001.328,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5001.308,
    "end": 5003.353,
    "text": " that ruling out the future uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.373,
    "end": 5013.194,
    "text": "And so I guess, yeah, if there's room in prediction as it's cashed out in active inference for more richer ways of relating to the future, then yeah, there's not really a conflict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.214,
    "end": 5013.836,
    "text": "No, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.896,
    "end": 5014.156,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.257,
    "end": 5017.123,
    "text": "I think the Heideggerian",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5018.352,
    "end": 5028.502,
    "text": " anxiety of prediction is probably very couchable within a broader mathematical understanding of what prediction or prediction error is in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.522,
    "end": 5033.606,
    "text": "I think it's just good to iron that out in case anyone stumbles across that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.627,
    "end": 5045.357,
    "text": "The final thing, I know it's getting late, you're in Australia, I'm in London, it's not getting late here, the sun's coming up, is much more a kind of meta conversation about philosophy of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5046.979,
    "end": 5048.14,
    "text": "This is actually really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5048.575,
    "end": 5066.876,
    "text": " you know, really what your doctoral thesis and later works have been looking at, which is what is the possibility for finding convergence points or finding enriching dialogue between phenomenology and natural sciences?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.837,
    "end": 5076.287,
    "text": "And one approach has been to say that the natural sciences are explanatory and phenomenology is descriptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5076.537,
    "end": 5082.676,
    "text": " I know that's not the approach that you or other contemporary phenomenologists adopt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.081,
    "end": 5088.555,
    "text": "Given that, why is that a problematic duality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.919,
    "end": 5090.46,
    "text": " Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.56,
    "end": 5091.883,
    "text": "I'm so glad that you bring this up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5091.943,
    "end": 5095.972,
    "text": "And so, yeah, so that's something I've been turning my attention to more recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5096.012,
    "end": 5103.428,
    "text": "So I've got a paper specifically about phenomenologically motivated views of explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.029,
    "end": 5107.877,
    "text": "And so I think ultimately that distinction of kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5108.92,
    "end": 5120.955,
    "text": " relegating phenomenology to whatever is not explanatory ends up missing out on a lot of interesting resources that both the phenomenological tradition and contemporary phenomenology have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5122.497,
    "end": 5132.97,
    "text": "It ends up kind of giving us this reductive view of phenomenology where, you know, phenomenology is often cashed out as kind of just describing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5132.95,
    "end": 5145.932,
    "text": " what a particular experience is like, and something I point out in this paper, which is dangerous, not just because that's not what phenomenology does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5146.012,
    "end": 5149.538,
    "text": "Phenomenology is a lot more rigorous and systematic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5149.558,
    "end": 5156.089,
    "text": "It's about looking at what's underneath those experiences, what's not obvious at the surface of the experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5156.069,
    "end": 5165.245,
    "text": " But, you know, if we start talking about, so Dan Zahavi makes this great point that phenomenology is not just about the phenomenal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.986,
    "end": 5173.919,
    "text": "And if we just start restricting phenomenology to describing the phenomenal, we might make all sorts of commitments to what that phenomenal is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5174.0,
    "end": 5175.462,
    "text": "We might, you know, think phenomenology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.442,
    "end": 5188.645,
    "text": " phenomenology is just about qualia, a concept that I'm always very wary of and not as interested in as maybe I'm expected to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.685,
    "end": 5191.51,
    "text": "But also generally I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5191.49,
    "end": 5206.512,
    "text": " There are models and instances of phenomenological explanations that are genuinely useful and insightful about the mechanisms that explain why phenomena are the way that they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5206.492,
    "end": 5211.68,
    "text": " And I think that's especially the case if we kind of complicate how we think of explanations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5211.74,
    "end": 5217.849,
    "text": "And that's where I argue that phenomenology and inactivism again kind of converge, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.97,
    "end": 5231.25,
    "text": "And I assume again that active inference has lots of useful things to say here too, because it's about looking away from that very linear asymmetrical model of explanation of here is the cause, here is the effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5231.23,
    "end": 5234.78,
    "text": " They're kind of, you know, a nice, neat sequence in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5234.84,
    "end": 5236.625,
    "text": "They're linear, they're cut off from each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5236.665,
    "end": 5242.742,
    "text": "Whereas what all of these discourses about cognition show us, whether it's inactivism, whether it's active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5243.245,
    "end": 5248.993,
    "text": " is as we've already talked about, there's a lot more complex feedback between past and present and future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5249.013,
    "end": 5252.759,
    "text": "There's a lot more feedback between cause and effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5253.64,
    "end": 5259.228,
    "text": "And so, yeah, we need models of explanation that are able to trace out those interesting feedback loops.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5259.789,
    "end": 5265.237,
    "text": "And so I think phenomenology especially has a lot to offer in kind of that regard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5265.217,
    "end": 5287.749,
    "text": " Yeah, I guess someone listening might be curious about if there's a kind of example in the literature where phenomenology has been able to give an explanatory account of a phenomenon that might otherwise be sort of only in the purview of the natural sciences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5288.671,
    "end": 5293.097,
    "text": "Just wondering if you can think of one off the top of your head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5294.545,
    "end": 5300.731,
    "text": " Yeah, so in that paper that I mentioned, I look at various accounts of psychological explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5300.751,
    "end": 5315.744,
    "text": "And I also look at a couple of recent attempts to conceptualize evolution or kind of to take up an inactive concept of evolution and to look at things like minimal and basal cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5316.825,
    "end": 5324.552,
    "text": "But perhaps for a kind of more accessible example, I think just going back to the history of the development of embodied cognition is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5324.532,
    "end": 5327.416,
    "text": " is always, is always useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5327.436,
    "end": 5338.932,
    "text": "And this is kind of, you know, something that comes up whenever, or that I try to throw in whenever people talk about the dialogue between phenomenology and cognitive science or the natural sciences in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5339.493,
    "end": 5341.415,
    "text": "What could phenomenology actually offer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5341.455,
    "end": 5344.459,
    "text": "What could it bring that might be missed otherwise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5344.78,
    "end": 5350.067,
    "text": "And I mean, the, you know, embodied cognition developed the way that it did because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.233,
    "end": 5369.019,
    "text": " people read phenomenology and, you know, because Dreyfus and, you know, the mid-20th century thought, hey, look, there's stuff that these problems we're running into when we're trying to develop, you know, the most kind of primitive forms of artificial systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5370.321,
    "end": 5377.911,
    "text": "They're actually problems that are kind of predicted and addressed and set out in all of these different phenomenological traditions from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5378.262,
    "end": 5380.365,
    "text": " from Heidegger to Merleau-Ponty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.346,
    "end": 5389.275,
    "text": "And, you know, of course, I mean, for Dreyfus that kind of pointed to an almost irresoluble problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5390.477,
    "end": 5401.57,
    "text": "But yeah, the, you know, embodied cognition has taken the shape that it has as a kind of huge set of different discourses, because these models of the relation between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5401.718,
    "end": 5406.566,
    "text": " cognizer and body and world as they were cashed out and phenomenology proved useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5406.586,
    "end": 5412.035,
    "text": "So that, I think that in itself is kind of a useful, like meta discursive example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5412.455,
    "end": 5413.096,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.116,
    "end": 5416.602,
    "text": "I mean, Dreyfus wrote, when did he, what computers can't do yet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5416.622,
    "end": 5417.223,
    "text": "Is that the name of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5417.243,
    "end": 5419.086,
    "text": "It was like the early seventies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5419.522,
    "end": 5420.663,
    "text": " Yeah, that's right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5420.743,
    "end": 5428.392,
    "text": "I love, so it's still my favorite sequel idea for a sequel title, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5428.412,
    "end": 5431.796,
    "text": "So what computers can't do followed by what computers still can't do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.136,
    "end": 5435.38,
    "text": "Yeah, what computers still can't do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5435.72,
    "end": 5437.242,
    "text": "I mean, yeah, it's fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5437.262,
    "end": 5442.108,
    "text": "It's a complete, you know, it could be another hour and a half just on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5443.589,
    "end": 5444.23,
    "text": "But you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.25,
    "end": 5448.735,
    "text": "I mean, as far as I can tell, the AI folk are struggling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.61,
    "end": 5465.31,
    "text": " with just LLMs for stuff where you might want a little bit more embodiment and you can, um, you know, we can point people to a company like versus who, for example, uh, applying active inference, uh, the active inference framework to artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5466.091,
    "end": 5475.904,
    "text": "And hopefully there are going to be some, you know, I'm sure exciting developments already happening, but I think the future is bright, um, for the role of embodied cognition in developing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.255,
    "end": 5479.562,
    "text": " intelligent agents, intelligent artifacts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.605,
    "end": 5482.729,
    "text": "Marlon, this was super.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5482.91,
    "end": 5487.46,
    "text": "I mean, for me, an opportunity to discuss Heidegger with a Heideggerian is wonderful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5487.54,
    "end": 5492.07,
    "text": "Again, I'm a complete layman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5492.05,
    "end": 5494.913,
    "text": " I give a lot of credit to my master's supervisor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5495.173,
    "end": 5503.983,
    "text": "Again, I only finished my master's this year, but actually, I can imagine having just left university to have an education like you would be a complete privilege.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.003,
    "end": 5504.784,
    "text": "So thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.824,
    "end": 5507.106,
    "text": "I actually learned a wonderful amount.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.227,
    "end": 5514.434,
    "text": "And I mean, actually, before you go, maybe let people know, I said you're a lecturer of philosophy at Wollongong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5514.834,
    "end": 5516.256,
    "text": "What are you focusing on at the moment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5516.276,
    "end": 5519.239,
    "text": "What can people keep their eyes out for in terms of your output?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.282,
    "end": 5520.743,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5520.763,
    "end": 5521.564,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5521.624,
    "end": 5524.088,
    "text": "So firstly, I wanted to thank you for having me on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5524.108,
    "end": 5526.432,
    "text": "This has been absolutely fantastic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.472,
    "end": 5529.618,
    "text": "It's been such a fun conversation and you were so brilliant to talk to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5529.778,
    "end": 5530.079,
    "text": "Oh, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5530.099,
    "end": 5533.524,
    "text": "I think it's so cool that you're doing this at this stage in your career.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5533.585,
    "end": 5535.568,
    "text": "I thought you were, you know, a postdoc or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5535.628,
    "end": 5540.957,
    "text": "So you certainly don't come across as a layman and this is like a really, really cool experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5541.865,
    "end": 5558.777,
    "text": " initiative um and so yes in terms of what people can keep an eye out for um so i do have a book on heidegger in time coming out co-written with my wonderful friend emily hughes uh it's coming at april next year through routledge so heidegger's alternative history of time i should plug",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5559.533,
    "end": 5567.469,
    "text": " And yeah, and other than that, I'm working on a whole bunch of projects, actually looking at synesthesia and countersexuals, among other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5569.193,
    "end": 5569.453,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.934,
    "end": 5571.818,
    "text": "Well, that book is extremely exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5572.199,
    "end": 5573.542,
    "text": "And thank you so much for your kind words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5573.582,
    "end": 5578.672,
    "text": "Yeah, I mean, all credit goes to the Institute for letting me do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.712,
    "end": 5579.955,
    "text": "Yeah, I mean, to be honest...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5579.935,
    "end": 5582.943,
    "text": " I've never actually announced who I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5583.564,
    "end": 5587.214,
    "text": "We sort of just kicked off this series with Carl as me being completely random.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.234,
    "end": 5596.438,
    "text": "But yeah, I mean, I yeah, as I said earlier, I mean, I finished my masters in September, but discovered active influence about a year ago, and I've just absolutely fallen in love with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.558,
    "end": 5596.999,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5597.333,
    "end": 5609.826,
    "text": " just its capacity to bring into the picture insights from phenomenology, philosophy, physics, maths, which I think is exactly the interdisciplinary approach that people have been talking about, but haven't been fulfilling their promise on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5610.987,
    "end": 5611.527,
    "text": "But thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5611.567,
    "end": 5613.249,
    "text": "That's really very kind of you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.309,
    "end": 5620.937,
    "text": "And yeah, I mean, hopefully we're going to keep getting wonderful guests like you on to educate me and our audience even more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5621.938,
    "end": 5624.08,
    "text": "Marilyn, thank you so much once again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.1,
    "end": 5626.342,
    "text": "Thank you so much, Darius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5626.382,
    "end": 5627.003,
    "text": "It's been awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.303,
    "end": 5627.999,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5628.019,
    "end": 5628.531,
    "text": "Thank you guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.615,
    "end": 5629.922,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]