[
  {
    "start": 1.81,
    "end": 26.141,
    "text": " hello and welcome we're in cohort two of the par at all textbook group we are in our final discussion on chapter 10 the last of the topical discussions so we'll see where it goes then next week will be the final meeting of this cohort",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 27.301,
    "end": 32.962,
    "text": " where we'll have unrecorded feedback, discuss some project ideas and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 33.603,
    "end": 48.586,
    "text": "So this will be the last recording in this series for cohort two, and please go to future textbook groups to fill out the feedback form and, or share the link to register for future cohorts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 50.147,
    "end": 55.228,
    "text": "That being said, let us turn to chapter 10 and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 58.154,
    "end": 60.017,
    "text": " go wherever people are interested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 60.117,
    "end": 66.788,
    "text": "So Michael, maybe you can restate what area you want to look at, and then let's see if it relates to anything in 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 70.68,
    "end": 71.28,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.38,
    "end": 72.181,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.201,
    "end": 77.423,
    "text": "So my question was related to priming effects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.483,
    "end": 94.551,
    "text": "So priming is very much used paradigm in psychology, which assumes that the stimulus activates somehow a network of semantic related items or phonetic or somehow related items.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.311,
    "end": 101.319,
    "text": " which facilitates recognition of successive items, and then according also action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.379,
    "end": 111.572,
    "text": "And I was wondering how this is represented in active inference, because it's a kind of an action perception loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.212,
    "end": 138.307,
    "text": " and how the difference between more conscious or more higher level kinds of decisions are distinguished in this active inference framework, whether we have a possibility to distinguish between these kinds of more priming action perception loops and more consciously activated action perceptions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.167,
    "end": 158.757,
    "text": " Are there any papers, is there any research that somehow maps these distinctions into the terminology that we have in active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 159.797,
    "end": 160.038,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 161.418,
    "end": 162.299,
    "text": "Ali, any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 166.745,
    "end": 173.69,
    "text": " Nothing immediately comes to mind, but you go on, please, and then I'll think if I can add to it later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.71,
    "end": 175.571,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 176.632,
    "end": 187.521,
    "text": "One, this one appears to at least address attentional priming in the context of motor behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 187.541,
    "end": 192.104,
    "text": "I'll add the link into the notes section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 195.407,
    "end": 211.108,
    "text": " i think as we're coming to see the framework is going to be minimally opinionated on complex extremely heterogeneous cognitive phenomena like priming you can construct a cognitive model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.665,
    "end": 237.115,
    "text": " that embodies that through any number of ways like you could imagine a um nested perceptual model where um the first the higher level is what genre of movie we're watching comedy or horror and then the stimuli are the sounds and then like hearing a laugh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 238.909,
    "end": 264.061,
    "text": " uh then updates the belief that it's a comedy not a horror and then that makes certain stimuli more attended to in the future but that wouldn't be like an opinionated active inference framework describing how priming is approached but rather a way that you could use the kinds of techniques that we discussed in the textbook",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.02,
    "end": 268.722,
    "text": " to write your own generative model that has some of the features that you'd like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 271.805,
    "end": 280.09,
    "text": "And I'm not exactly sure how they've done it in this motor paper all the way from 2011.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.13,
    "end": 286.014,
    "text": "Ali, anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.034,
    "end": 292.578,
    "text": "Yeah, I just wanted to add that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 294.639,
    "end": 311.27,
    "text": " I'm not sure if it directly relates to this specific question or not, but at least I haven't seen much paper doing direct empirical experiments trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.4,
    "end": 322.884,
    "text": " I mean, trying to observe or confirm some of the ideas of active inference framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.964,
    "end": 328.346,
    "text": "In other words, most of the papers in the literature are mostly concerned with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 329.577,
    "end": 334.701,
    "text": " modeling the existing experimental data or empirical data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 336.182,
    "end": 352.054,
    "text": "But there are some important works that's being done, not directly trying to prove or confirm the active inference framework, but they have done some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 353.895,
    "end": 363.657,
    "text": " research in other areas, but they've used active inference in the modeling of the phenomena being observed or studied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 364.557,
    "end": 380.12,
    "text": "So in this case also, I vaguely remember seeing some related studies that's being done and ultimately modeled with active inference framework, but I'm not sure if there's anything",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.0,
    "end": 401.517,
    "text": " specifically putting active inference claims as hypothesis and trying to confirm those hypothesis well sorry go ahead",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 403.174,
    "end": 410.749,
    "text": " Yeah, so as you said, active inference cannot be falsified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.789,
    "end": 413.675,
    "text": "So it's not really a hypothesis in this way, no?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.12,
    "end": 424.005,
    "text": " But I was wondering, so there are these different variables that we have in this framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.045,
    "end": 428.387,
    "text": "For instance, we have priors on hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.468,
    "end": 443.975,
    "text": "Could something like this be interpreted as a prime, something that facilitates successive action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.975,
    "end": 458.919,
    "text": " Versus, for instance, then we have habits or we have preferences, which might reflect more conscious kinds of decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.52,
    "end": 464.581,
    "text": "Would that make sense to think about the distinction this way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.461,
    "end": 468.282,
    "text": "Well, I'll let you go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 472.029,
    "end": 475.472,
    "text": " Yeah, just about the first point you mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 476.253,
    "end": 487.082,
    "text": "Actually, it's FEP that, because of its being a kind of principle, is inherently unfalsifiable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.822,
    "end": 495.048,
    "text": "But active inference, at least as far as I understand it, is totally a falsifiable theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.128,
    "end": 499.192,
    "text": "So, for instance, we have some work done by...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 502.467,
    "end": 506.65,
    "text": " Daniel, what was the name of the Japanese research?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 507.211,
    "end": 507.731,
    "text": "Isamura.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 507.831,
    "end": 510.934,
    "text": "Isamura, if I'm not mistaken, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.134,
    "end": 512.094,
    "text": "Yes, Isamura.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 512.795,
    "end": 514.436,
    "text": "Isamura, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 514.556,
    "end": 518.239,
    "text": "Which have tried to find some neural correlates that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 521.475,
    "end": 547.049,
    "text": " for some of these active inference or some of the claims made within active inference framework and also there are other various studies that shows the psychological evidence for those claims actually happening in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 549.366,
    "end": 565.359,
    "text": " and model in the organism or agent of interest so that's about the first point but i actually forgot the second point you make so if you don't mind to reiterate it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 566.704,
    "end": 577.613,
    "text": " Yeah, so I was wondering whether those different kinds of variables that we have, for instance, priors on hidden states, and then we have habits and preferences and all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.174,
    "end": 587.361,
    "text": "So in different places, they sneak into this whole framework, and whether they could be associated with those different kinds of cognitive processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.042,
    "end": 594.967,
    "text": "So for instance, that we have priors which condition somehow the sequence of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.908,
    "end": 608.816,
    "text": " states, whether this could be interpreted as a prime that facilitates certain kinds of activities of states that follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.556,
    "end": 616.14,
    "text": "Whereas, for instance, preferences or habits are more long term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.941,
    "end": 629.507,
    "text": " kinds of entrenched routines, and that could maybe reflect more conscious kinds of processes, something like this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.907,
    "end": 632.408,
    "text": "Would it make sense to see it in this way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.42,
    "end": 638.941,
    "text": " I'll give a first thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.802,
    "end": 641.002,
    "text": "But first, the falsification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 641.042,
    "end": 642.663,
    "text": "So the principle cannot be falsified.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 643.323,
    "end": 652.728,
    "text": "And then active inference might be being deployed in a way where somebody is looking to explore whether it's adequate or not for a given setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 654.228,
    "end": 659.171,
    "text": "Or it can merely be deployed where it's not even being...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 661.587,
    "end": 668.271,
    "text": " tested against alternatives or evaluated as a framework itself, but merely being used to explain data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.794,
    "end": 678.418,
    "text": "The different variables and the interpretation of cognitive phenomena is the whole point of cognitive modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 679.159,
    "end": 688.025,
    "text": "So the prior in terms of it conditioning or initiating inferences on hidden states is what that variable does in the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 690.859,
    "end": 699.929,
    "text": " However, there are a lot of open interpretations on, like, what is awareness and what is consciousness and all these other questions about timescale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 700.69,
    "end": 703.894,
    "text": "Like, someone could argue that the slower things are not aware of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 704.975,
    "end": 710.782,
    "text": "But in the end, it's really going to come down to just writing the generative model and then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 712.856,
    "end": 713.837,
    "text": " it can be seen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 714.457,
    "end": 719.319,
    "text": "In figure 4.3, there's no consciousness, awareness, metacognition, et cetera, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 719.899,
    "end": 738.128,
    "text": "So the phenomena that this basal module provides are actually quite flexible, which is why PU MDPs are broadly used even outside of ACT-INF, but they don't necessarily tackle the hard problem or anything like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 739.029,
    "end": 741.47,
    "text": "So mapping it to what is experienced",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 742.745,
    "end": 756.023,
    "text": " is certainly an area of open work, but understanding how different cognitive phenomena arise in a model from the interplay of different parameters is what cognitive modeling is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 762.378,
    "end": 774.191,
    "text": " And there's very few attempts to try to relate this to this kind of psychological research or these kinds of psychological models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.329,
    "end": 778.69,
    "text": " It depends what you would mean by a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 778.79,
    "end": 786.952,
    "text": "Like, for example, association of precision or variance estimators with anxiety has been done in theory and in practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 787.933,
    "end": 798.716,
    "text": "And association of different parametric evaluations with different cognitive states and pathologies is reviewed in Table 9.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.756,
    "end": 798.836,
    "text": "So...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 803.427,
    "end": 808.589,
    "text": " parameters are mapped to cognitive states, that's why this kind of modeling is done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 810.509,
    "end": 815.291,
    "text": "But that doesn't mean that the framework has one singular way of interpreting it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.991,
    "end": 829.135,
    "text": "It's like you could make a linear model that does this or that, and you could test whether there's an effect of this condition on that outcome, but you'd be talking then with your referent as the system of interest,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.35,
    "end": 853.903,
    "text": " not with your referent as somehow like confirming or disconfirming something about linear models so that's why there are papers that just use active inference modeling to explain data like everything that ryan smith is doing everything that we see in table 9.1",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 857.938,
    "end": 868.347,
    "text": " But although sometimes those kinds of studies are taken as evidence for active inference, like look at these papers that use active inference empirically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.368,
    "end": 874.993,
    "text": "And they do support the notion that active inference can be used empirically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.934,
    "end": 880.237,
    "text": "But in these cases, there might be some, but I don't think most of them are this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 880.978,
    "end": 882.94,
    "text": "They're not necessarily comparing evidence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.761,
    "end": 890.423,
    "text": " continuous time generative models in ocular motor syndromes versus an alternative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 893.565,
    "end": 908.671,
    "text": "Such a comparison would put it more clearly into the category of like unique explanation prediction value of active inference, as opposed to other proposed, which is to say hypothesized cognitive models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 914.861,
    "end": 922.483,
    "text": " But without comparison of multiple methods in a paper, it's not evidence for that framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 923.343,
    "end": 926.744,
    "text": "It just, it's evidence that that framework can be used.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 932.525,
    "end": 943.688,
    "text": "And the mapping of cognitive phenomena to parameters is sometimes seems pretty clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.746,
    "end": 974.429,
    "text": " other times especially if one is getting into more uh complex models it's not going to be localized to like a single parameter because the cognitive phenomena will arise from different interacting parameters like well when the learning rate on b is low then this or that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 975.72,
    "end": 1004.442,
    "text": " irregularity gets partitioned this way but when the learning rate on B is high then this might happen in this environmental setting but again there's so many conditioning factors that at the level of of abstraction across all possible possible cognitive models it's only right and good that active inference doesn't have such a one-to-one mapping between parameters and phenomena",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1007.699,
    "end": 1026.567,
    "text": " if there were such a mapping we wouldn't have the expressivity to generate complex models and cognitive phenomena have many manifestations and many um factors that influence them",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1034.192,
    "end": 1063.251,
    "text": " there's some promising avenues for that but I I'll keep it more focused on a textbook for here so okay thank you thank you with respect to this Marvin Minsky quote in general we are least aware of what our minds do best and which of these aspects are mapped onto experiential awareness well you could create",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1064.241,
    "end": 1087.554,
    "text": " multiple possible structural alternative cognitive models so i wonder if people are experiencing the oh i wonder if they're experiencing the hidden state i wonder if they're experiencing b i wonder if and then you could design the right experiment or maybe the data already exists where you you show something and you say now what did you remember about that or what was your experience while that was happening",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1089.642,
    "end": 1090.383,
    "text": " And you could find out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1090.663,
    "end": 1096.247,
    "text": "And then you could evaluate and falsify one of those structural models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1096.267,
    "end": 1105.973,
    "text": "Or you could take a more Bayesian approach and just describe the Bayes factor or the posterior model probability across those structural alternatives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1116.401,
    "end": 1116.481,
    "text": "Ali?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1116.501,
    "end": 1116.581,
    "text": "Ali?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1119.298,
    "end": 1141.504,
    "text": " Yeah, that quotation by Minsky also maps perfectly, I think, with Mark Solms' claim on page 303 of his book in spring, which claims that briefly we only need consciousness or at least are aware of our consciousness when we're trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1142.924,
    "end": 1153.168,
    "text": " correct for the more divergent divergence between our priors and our perceptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.727,
    "end": 1163.514,
    "text": " In other words, consciousness is something that's required for that correction or belief updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1164.475,
    "end": 1176.845,
    "text": "And as more precise our predictions become, the less we'll need our awareness of our consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.406,
    "end": 1205.534,
    "text": " interesting that makes me think about the flow state like uh sent mahali and the kind of awareness associated with automatic performance but that's that's on the path towards empirical and experimental phenomenology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.17,
    "end": 1211.273,
    "text": " Again, with all of the report biases and challenges associated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1213.936,
    "end": 1233.332,
    "text": "And once you got to that point of specifying, just like figure 9.1, with the person and showing them different colors and then the self-report and here's the input and output, it wouldn't be making claims about active inference overall, let alone the FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1233.352,
    "end": 1233.532,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1236.027,
    "end": 1264.004,
    "text": " again any more than some extensively developed multilinear model for healthcare data is making claims about linear modeling they're like kind of they're related but evidence of one is not the same type of evidence for the other but here they are going to abstract away from the specific active inference models and focus on integrative aspects",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1265.117,
    "end": 1270.722,
    "text": " So now we're in the space of integrative models of cognition and behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1271.442,
    "end": 1277.808,
    "text": "And so with respect to that, if we merely see an area for improvements of active inference, great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1278.529,
    "end": 1280.11,
    "text": "Then we're active inference researchers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1282.052,
    "end": 1287.176,
    "text": "But it also makes sense to ask, what is active inference being compared with?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.018,
    "end": 1292.701,
    "text": "And because of the unifying scope being so vast...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.157,
    "end": 1310.0,
    "text": " it's hard to even conceptualize or name some alternative unified perspective, but there are unifying things that might just be like even more general that end up being less helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1310.08,
    "end": 1313.221,
    "text": "Like just saying, well, it's computation or it's information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1313.461,
    "end": 1315.281,
    "text": "You know, memory is information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1315.801,
    "end": 1316.822,
    "text": "Perception is information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1318.322,
    "end": 1323.423,
    "text": "That might not be differentiated enough",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.841,
    "end": 1345.119,
    "text": " Whereas hopefully the positioning of active inference is on one hand unifying diverse cognitive phenomena in different systems, but on the other hand, not so bland and generic that it's equivalent to just saying, you know, physics did it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.252,
    "end": 1359.173,
    "text": " This book offers a systematic account of the theoretical underpinnings and practical implementations of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1360.034,
    "end": 1361.534,
    "text": "Do you fellows agree with that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1362.254,
    "end": 1364.035,
    "text": "Or how does that claim strike you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1376.618,
    "end": 1381.319,
    "text": "Not so much practical, but systematic and theoretical, yes, I would think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.967,
    "end": 1388.628,
    "text": " Thanks, I broadly agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1396.932,
    "end": 1399.793,
    "text": "They're going to summarize the previous chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.595,
    "end": 1405.195,
    "text": "Chapter one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1406.869,
    "end": 1436.201,
    "text": " organisms or really just things engage in adaptive exchange which from a cybernetics perspective we can frame in terms of action perception and they laid out the two roads low road we're using bayesian statistics high road things must",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1437.85,
    "end": 1442.253,
    "text": " from the outside at least be remeasurable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1443.573,
    "end": 1448.916,
    "text": "If it's not remeasurable, it doesn't have a stable identity from the outside to an observer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1449.897,
    "end": 1451.858,
    "text": "That's like the low bar on the high road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1453.079,
    "end": 1457.882,
    "text": "If the volatility is so high that the thing is changing and not being what it is, then it isn't that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1459.142,
    "end": 1466.967,
    "text": "And then the high bar on the high road is that actions must actually be taken to persist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1469.472,
    "end": 1498.159,
    "text": " whether those actions are trivial or not is another question that's where we get into that taxonomy of things with the um path integrals paper but just broadly low road we're using bayesian statistics is there really a modern alternative high road we're at least asking for repeated measurements if not adaptive action for persistence again",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1500.592,
    "end": 1523.424,
    "text": " uncontentious chapter four approaches the generative models in active inference exact bayesian inference may be implausible so they very rapidly move to variational inference as one approach to approximate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1524.403,
    "end": 1526.685,
    "text": " challenging Bayesian statistical settings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1527.646,
    "end": 1529.587,
    "text": "Commonly used outside of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1530.087,
    "end": 1530.708,
    "text": "Uncontentious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1532.689,
    "end": 1536.572,
    "text": "Even the use of a variational free energy is uncontentious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1537.233,
    "end": 1538.174,
    "text": "Energy-based learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.594,
    "end": 1539.535,
    "text": "Evidence lower bound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1540.475,
    "end": 1547.661,
    "text": "Now being applied to a comprehensive generative model that includes perception, cognition, and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1550.779,
    "end": 1557.161,
    "text": " thus unifying, for example, signal processing on the inbound and control theory on the outbound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.262,
    "end": 1572.546,
    "text": "Chapter five, they went through three mammalian nervous system examples and gave a little bit of information on each of those systems in isolation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1573.466,
    "end": 1577.548,
    "text": "And then in the concluding figure, wired them together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.653,
    "end": 1596.294,
    "text": " show how cortical inference could um play a role in dopaminergic tone of the basal ganglia which could then modulate the trade-off between reliance on habit or conversely on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.597,
    "end": 1622.382,
    "text": " expected free energy based updating of action priors into action posteriors and then the ways that those selected action policies could then be enacted through a kind of simple differential mechanism in the spinal cord from an epistemic perspective what else would you fellows have wanted to see in the first half of the book",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1629.426,
    "end": 1644.569,
    "text": " Again, considering that chapters one through five were like the theory and the underpinnings, and seeing this as just the first version of what it can be, epistemically, what else might be important to include in these chapters?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1645.709,
    "end": 1652.53,
    "text": "Whether it's just a micro edition, like, oh, they could have added this citation or this variable, or whether you have a more structural comment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1655.631,
    "end": 1656.211,
    "text": "Ollie, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.159,
    "end": 1677.935,
    "text": " I'm not sure if I've said this before or just talked about it casually, but in my opinion, some of the material from chapter 10 could be moved to some of the earlier chapters in order to give",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1678.63,
    "end": 1683.854,
    "text": " a kind of bigger picture in which active inference fits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.775,
    "end": 1706.072,
    "text": "So reading the first chapters, the reader, at least in my view, doesn't get so much... I mean, doesn't learn about the historical context of the ideas as much as needed because, frankly enough, readers...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.074,
    "end": 1721.158,
    "text": " I suppose will not be familiar too much with active inference framework because obviously it's a relatively new framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.258,
    "end": 1729.843,
    "text": "So it might help them to see the distinction between active inference and the other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.798,
    "end": 1737.34,
    "text": " earlier frameworks such as Bayesian brain hypothesis, predictive coding, predictive processing, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.541,
    "end": 1749.084,
    "text": "And, yeah, just see how active inference it's within that bigger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1752.425,
    "end": 1753.606,
    "text": "Yes, thank you, Ali.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1754.926,
    "end": 1756.407,
    "text": "What do you think about reading chapter 10?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1756.487,
    "end": 1756.767,
    "text": "First,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.18,
    "end": 1764.16,
    "text": " Outlining all the chapters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1764.18,
    "end": 1765.4,
    "text": "That would be ideal, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.621,
    "end": 1769.441,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1770.301,
    "end": 1770.561,
    "text": "Wow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1771.721,
    "end": 1772.302,
    "text": "Unbelievable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1775.262,
    "end": 1775.882,
    "text": "We could try it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1776.882,
    "end": 1777.482,
    "text": "We could try it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1778.383,
    "end": 1778.663,
    "text": "Michael?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1780.183,
    "end": 1786.044,
    "text": "Yeah, we cannot really know because we did it the other way around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1786.744,
    "end": 1791.905,
    "text": "But you can maybe try it in the next cohort to see how that works out for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.809,
    "end": 1795.851,
    "text": " Yeah, that would be a funny frame.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1796.091,
    "end": 1798.212,
    "text": "Like, we're going to read chapter 10.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.613,
    "end": 1801.555,
    "text": "So truly do not worry about the earlier references.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.715,
    "end": 1803.116,
    "text": "They might mention an earlier chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1803.196,
    "end": 1805.158,
    "text": "Again, you don't have to worry because you won't have read it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1805.998,
    "end": 1806.919,
    "text": "But this is where we're going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1808.12,
    "end": 1808.9,
    "text": "Now you've been there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1810.902,
    "end": 1811.843,
    "text": "That's the big picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1812.803,
    "end": 1818.748,
    "text": "And now we're going to work forwards via backwards to get to that integrative point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1820.055,
    "end": 1825.257,
    "text": " Um, conclusion, and then we can ask whether that, um, was reached.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1825.817,
    "end": 1826.917,
    "text": "Was that where we want it to go?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1827.778,
    "end": 1832.779,
    "text": "And did we reach it with integrity, but it's not going to be a math test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1834.28,
    "end": 1835.28,
    "text": "I think that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1836.4,
    "end": 1837.841,
    "text": "So go that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.861,
    "end": 1840.041,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.283,
    "end": 1844.823,
    "text": "Interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1846.989,
    "end": 1854.39,
    "text": " Because this is so epistemic and 10 is a relatively long chapter with no equations, no figures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1856.871,
    "end": 1866.932,
    "text": "And so in that way, it's like a super version of chapter one, including bringing up many of the same ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1871.633,
    "end": 1876.574,
    "text": "So definitely for our consideration in the coming weeks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1881.533,
    "end": 1887.554,
    "text": " Okay, in chapter six, this is the pragmatic section of the book, allegedly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1890.635,
    "end": 1892.295,
    "text": "Chapter six provided a recipe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.895,
    "end": 1900.337,
    "text": "I'm sure we had many questions about what else was happening at that restaurant and a little bit more detail from the sous chef and all of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1901.217,
    "end": 1906.558,
    "text": "But a recipe was provided, which we can continue to build out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1909.571,
    "end": 1920.035,
    "text": " And they just buzz through chapter seven, eight, nine in review, merely saying that seven and eight focused on discrete and continuous time generative models, respectively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1921.176,
    "end": 1937.462,
    "text": "And chapter nine opens the door to computational phenotyping in terms of some of the framings and opportunities and challenges associated with modeling empirical data and uses of generative models for statistical ends.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1941.883,
    "end": 1967.382,
    "text": " so more review on the first five then a little bit on six speed through seven and eight self-evidencing as a first principle not reward as a first principle",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1968.47,
    "end": 1975.755,
    "text": " self-evidencing relative to some active generative model as a first principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1978.497,
    "end": 1981.299,
    "text": "If you're on board, enjoy the ride.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.259,
    "end": 1983.74,
    "text": "Go back to chapter one, read the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.121,
    "end": 1993.567,
    "text": "If you're not convinced about self-evidencing as a first principle, then there might be some other approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1993.747,
    "end": 1997.51,
    "text": "Still go back to chapter one and read it, but once somebody is on board,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1998.973,
    "end": 2014.101,
    "text": " that perception and action being in the same game of self-evidencing with a common information theoretic currency information related currency active inference is that model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2022.148,
    "end": 2047.454,
    "text": " we do more than integrate perception and action we don't homogenize them or blend them it's actually very clear what they are but they're in the same game and they have that same currency and when we take that kind of a first principles approach it's compatible with these kinds of inactivist languages but also we have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2050.686,
    "end": 2074.387,
    "text": " extensible ways to deal with other diverse cognitive phenomena like memory and attention how do we deal with all these cognitive phenomena in different systems with different architectures and so on well everything is reflected through structural or parametric specification in the generative model part one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2075.418,
    "end": 2081.423,
    "text": " Part two, generative models are evaluated according to their free energies, just like any other Bayesian model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2082.284,
    "end": 2082.664,
    "text": "Part two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.685,
    "end": 2087.508,
    "text": "So part one, say what you mean in the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2088.069,
    "end": 2091.792,
    "text": "If it's not in the generative model, it's just a secret in your mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2092.953,
    "end": 2102.121,
    "text": "Part two, if it's a Bayesian graph generative model, then we have techniques for model fitting, message passing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.424,
    "end": 2131.111,
    "text": " variational free energy and so on so step one don't make it a secret step two fit the model like all models can be fit super clear super powerful sometimes hard to even convey because it's so removed from the presentation of other cognitive science approaches",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2141.539,
    "end": 2147.644,
    "text": " Earlier, Schenck and the neat scruffy distinction was introduced, chapter one, probably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2151.347,
    "end": 2161.895,
    "text": "Active inference is not reifying the nouns in English associated with cognitive functions and trying to cobble them together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2163.377,
    "end": 2164.317,
    "text": "It's not a mosaic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.959,
    "end": 2169.762,
    "text": "It starts from a unified perspective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.098,
    "end": 2191.816,
    "text": " and then elaborates or differentiates in order to realize cognitive functions but not by reifying them as modular items that can be like picked up and moved again really key different than how it's often addressed in other areas",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.885,
    "end": 2205.268,
    "text": " Probably a lot of philosophical depth that could be explored not for today in these Jamesian categories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2211.692,
    "end": 2226.06,
    "text": "When we take that perspective of starting with a unified whole iguana, a whole conceptual iguana, whole behavioral ethologist looking at an iguana",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2227.441,
    "end": 2257.201,
    "text": " situation figure 9.1 then we can understand so much better structural and parametric similarities and differences amongst different cognitive models we couldn't ask for a better way to do it if one appears it'll be a gift but within some pretty broad considerations this ethologists set up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2259.688,
    "end": 2273.916,
    "text": " is the one that we want for this making a map about a map and that's why um saktive devel ramstad and friston are such vociferous advocates for everything that we're seeing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.53,
    "end": 2292.596,
    "text": " The trade-offs amongst all kinds of behavior, one example being like so-called explore exploit, but all kinds of cognitive trade-offs like forgetting versus attention and risk versus, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2293.397,
    "end": 2304.242,
    "text": "All of those, when approached as if they could be these modular standalone patterns, they are only reified through investigation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2305.453,
    "end": 2326.859,
    "text": " rather than seeing these trade-offs, these Pareto optimal trade-offs or these manifolds of measured outcomes, rather than looking at the generative model or the generative process that gives rise to those manifolds, the manifold becomes reified as if there was somehow a fundamental trade-off between exploration and exploitation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2328.68,
    "end": 2335.082,
    "text": "When, depending on the regularities of the niche and the affordances available to the agents,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2336.451,
    "end": 2338.553,
    "text": " Those two might literally not be at odds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2339.173,
    "end": 2344.297,
    "text": "Like what if you're just munching through a field and there's food everywhere and you're just munching all around?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2345.778,
    "end": 2346.919,
    "text": "Then there's no trade-off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2347.88,
    "end": 2350.782,
    "text": "So the trade-off is not fundamental to these English words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2351.983,
    "end": 2357.647,
    "text": "It's about the interplay of the generative model and the generative process, which is our stance on everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.828,
    "end": 2363.552,
    "text": "It's about the interplay between the generative model as specified and the generative process as specified.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2365.765,
    "end": 2369.267,
    "text": " Trade-offs don't exist in some other abstract space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2374.331,
    "end": 2391.603,
    "text": "Beyond helping us at the algorithmic layer here using Mars taxonomy, we can also peek deeper into neural computations and representations, signatures, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2393.004,
    "end": 2408.031,
    "text": " And here one can look at the work in SPM, in human neuroimaging and sensor fusion, and then build from there to incorporate more sophisticated generative models and action policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2410.552,
    "end": 2412.613,
    "text": "Now they're going to sketch a psychology textbook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2415.155,
    "end": 2421.618,
    "text": "And this is where the earlier point about TEN providing a lot of the conceptual and historical context",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2422.68,
    "end": 2434.664,
    "text": " is very salient because these are the kinds of things, these are the buoys or the signposts that other people are going to be familiar with when they're wanting to know more about Act-Inf.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2443.307,
    "end": 2450.949,
    "text": "They introduce and discard the sandwich model and they highlight",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.356,
    "end": 2480.139,
    "text": " primacy or the centrality of the generative model that explicitly makes predictive and arguably goal-directed but at the very least predictive dimensions of that model absolutely primary what imperative is downstream of the primacy of prediction self-evidencing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2483.16,
    "end": 2488.121,
    "text": " At the stimuli processing level, we see predictive coding, predictive processing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2489.381,
    "end": 2499.184,
    "text": "At a slightly slower time scale, which we could model with a nested model, we see learning, neuromodulators, slower inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2500.624,
    "end": 2504.385,
    "text": "And action is fundamentally embedded within this process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.785,
    "end": 2508.986,
    "text": "For example, eye saccades moving across a page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2513.163,
    "end": 2539.064,
    "text": " this allows the dual drives which epistemic and pragmatic are one decomposition of free energies expected free energy in this case to integrate the sort of preference oriented gold realizing and information oriented components to behavior",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2544.434,
    "end": 2548.636,
    "text": " Predictive processing, what is there to say?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2548.976,
    "end": 2552.838,
    "text": "This is basically predictive processing plus action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2553.998,
    "end": 2558.78,
    "text": "And Livestream 43 makes that pretty clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.161,
    "end": 2561.481,
    "text": "The paper in Livestream 43.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2564.342,
    "end": 2564.823,
    "text": "Perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.083,
    "end": 2567.844,
    "text": "You don't see with your eyes, you see with your mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2568.644,
    "end": 2570.065,
    "text": "What you're seeing is generated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2571.752,
    "end": 2574.574,
    "text": " You're not getting the video camera raw feed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.996,
    "end": 2578.117,
    "text": "That's a classic idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2579.378,
    "end": 2583.801,
    "text": "Maria did great work reporting on the history of these ideas in 43.0.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2583.841,
    "end": 2596.15,
    "text": "Bayesian brain, putting that perceptual predictive paradigm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2597.259,
    "end": 2602.181,
    "text": " into the jargon or into the methodology of Bayesian statistics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2604.462,
    "end": 2605.643,
    "text": "It's just a last name.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.303,
    "end": 2609.705,
    "text": "Bayesian statistics is modern statistics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2615.087,
    "end": 2616.208,
    "text": "They return to predictive coding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2618.089,
    "end": 2618.389,
    "text": "Action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.83,
    "end": 2622.991,
    "text": "Action is another variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2624.815,
    "end": 2627.236,
    "text": " We make predictions about action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2627.276,
    "end": 2628.437,
    "text": "We have priors on action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2629.217,
    "end": 2635.16,
    "text": "We have a policy prior, and then we update it or not into the policy posterior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2636.241,
    "end": 2638.042,
    "text": "That's that basal ganglia, chapter five.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.282,
    "end": 2645.605,
    "text": "So action, selection, planning as inference is just another variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2646.586,
    "end": 2650.028,
    "text": "And so all of the meta on Bayesian statistics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2651.033,
    "end": 2666.518,
    "text": " is going to hold whether we're talking about inference on perception, the kind of under part of figure 4.3, or inference on action, the upper part of figure 4.3 within each of the GMs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.359,
    "end": 2678.723,
    "text": "And that leads to some different thinking about, for example, motor control and interactionism versus instructionism,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2682.239,
    "end": 2708.864,
    "text": " sensory attenuation and all these other diverse motor phenomena also being integrated because we took a first principles perspective we didn't choose to reify sensory attenuation as some discrete phenomena rather we chose to model action as a kind of inference action selection as a kind of inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2710.165,
    "end": 2712.386,
    "text": " that an embodied agent takes in the niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2714.186,
    "end": 2723.11,
    "text": "And that led to a complete collusion with sensory attenuation as an empirical phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.45,
    "end": 2725.991,
    "text": "This isn't falling out of reward learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2726.931,
    "end": 2729.052,
    "text": "This isn't falling out of Excel spreadsheets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2738.43,
    "end": 2764.739,
    "text": " idea motor theory and various other paradigms have been proposed to understand this bi-directionality with action and effect so it's like a little bit jarring to read because it's kind of um not in the active inference ontology how it's being stated by them of course but many of the terms are resemblant enough and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2765.859,
    "end": 2772.342,
    "text": " Active inference encompasses it and bolsters it and provides ways to compute, message passing, all of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2773.663,
    "end": 2776.285,
    "text": "Anything that's just like a way of thinking, it's like, that's cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.365,
    "end": 2777.385,
    "text": "It's a cool way of thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2777.805,
    "end": 2779.026,
    "text": "Can you do message passing on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.046,
    "end": 2782.788,
    "text": "So that's where the pragmatic value comes into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2784.689,
    "end": 2787.931,
    "text": "There's a variety of ways of thinking about the action perception loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2788.451,
    "end": 2792.013,
    "text": "There's the TOTE, test, operate, test, exit loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2792.571,
    "end": 2795.912,
    "text": " There's the OODA, Observe, Orient, Decide, Act, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2797.012,
    "end": 2812.437,
    "text": "And broadly, we're talking about the same kinds of agents, and active inference helps us understand frameworks that have often been qualitatively applied or quantitatively applied to cybernetic systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2818.573,
    "end": 2824.074,
    "text": " On the inbound, optimal perceptual processing is a signal processing challenge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2825.155,
    "end": 2830.596,
    "text": "On the outbound, optimal action selection has been approached from this area of control theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.696,
    "end": 2839.879,
    "text": "We're unifying the inbound signal processing and the outbound control theoretic dimensions of cybernetics into a unified imperative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2841.339,
    "end": 2844.52,
    "text": "How exactly they're balanced in a given realization of a model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.365,
    "end": 2849.867,
    "text": " That is for the researcher to specify, not for the framework to be opinionated upon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.048,
    "end": 2866.616,
    "text": "But we have the grammar and the space to have blind systems that act wisely or not and perceptive systems that act intelligently or not or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2868.037,
    "end": 2874.1,
    "text": "The framework is not going to have an opinion on those kinds of balances in their specifics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2877.754,
    "end": 2893.026,
    "text": " Special cases of the unified imperative, for example, the expected free energy when there is no epistemic value to gain, fully observable setting, perfect understanding of the consequences of the self and the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2894.107,
    "end": 2898.571,
    "text": "Or on the other hand, a setting where there's a lot to learn, but there's no pragmatic value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2899.151,
    "end": 2900.672,
    "text": "All outcomes are equally preferred.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2901.673,
    "end": 2904.495,
    "text": "Special cases of decision-making,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2905.518,
    "end": 2929.686,
    "text": " map on to special cases of the unified imperative so just from a very narrow and technical view active inference is simply a generalization of for example bayesian decision theory reinforcement learning but let's see how they differ they differ in a usage of a few ontology terms",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.206,
    "end": 2936.447,
    "text": " They talk about model-based and model-free RL.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2942.228,
    "end": 2943.288,
    "text": "Policy gradient methods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2943.308,
    "end": 2944.909,
    "text": "A lot of similarities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2945.049,
    "end": 2948.95,
    "text": "Of course, it'd be awesome to have a notebook where we can compare and contrast side by side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2955.631,
    "end": 2958.552,
    "text": "Action planning as inference, it's just another variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.533,
    "end": 2961.913,
    "text": "And other people have suggested it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2966.112,
    "end": 2971.355,
    "text": " Approximate Bayesian computation, bounded rationality, Bayes optimal behavior, including pathology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2972.135,
    "end": 2975.717,
    "text": "These are all totally plausible for us to explore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2977.157,
    "end": 2978.498,
    "text": "Valence emotion motivation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2978.658,
    "end": 2982.04,
    "text": "These are quite diffuse and complex cognitive phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2984.381,
    "end": 2987.282,
    "text": "There are ways to specify them in generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2988.863,
    "end": 2991.284,
    "text": "Doesn't mean that ACT-INF tells us what these things are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2992.605,
    "end": 2994.467,
    "text": " They're just strings of English letters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2994.587,
    "end": 2996.268,
    "text": "They're just pixels on a screen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2997.329,
    "end": 3004.556,
    "text": "But we can use them semiotically and build cognitive models that have these kinds of patterns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3008.259,
    "end": 3014.504,
    "text": "Homeostasis, of course, considered broadly, is critical to the high road.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.478,
    "end": 3023.383,
    "text": " And so we have a lot about how intero and exteroceptive inference interact in order to support persistence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3024.544,
    "end": 3030.308,
    "text": "Attention and salience, relevance realization, these are core for the epistemic drive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3031.128,
    "end": 3038.273,
    "text": "Homeostasis can broadly be seen as being about pragmatic value, whereas epistemic dynamics are about epistemic value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3042.011,
    "end": 3043.732,
    "text": " Different cognitive modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3044.752,
    "end": 3049.113,
    "text": "Again, not just being proposed ad hoc by a TED talk or a pop psychology book or a research paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3050.154,
    "end": 3064.778,
    "text": "Starting from a solid grounding and then differentiating the generalized framework to embody these patterns, not to reify the patterns as actual phenomena that then need to be plugged and played.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3067.899,
    "end": 3070.56,
    "text": "And we know there are so many open directions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.644,
    "end": 3097.067,
    "text": " applications to human scale social cultural systems integration with contemporary machine learning systems embodied cyber physical systems sometimes called robotics and just like the cover of the book was the one ring not to rule them all here we have the tolkien quote and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.212,
    "end": 3102.174,
    "text": " the journey comes to a conclusion, unless you read on to the appendices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3105.036,
    "end": 3106.337,
    "text": "They proposed an introduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3107.658,
    "end": 3114.644,
    "text": "And at least from the author's view, you will pursue active inference in some form.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3115.524,
    "end": 3121.789,
    "text": "So in our closing minutes, how does this strike either of you fellows?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.389,
    "end": 3125.812,
    "text": "What are your reflections upon completing the book one or more times?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.25,
    "end": 3135.951,
    "text": " Yeah, I'm very much convinced about this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.071,
    "end": 3139.892,
    "text": "And I guess I will pursue this for some time to come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.573,
    "end": 3145.234,
    "text": "Lots of work to fit the data into this whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.254,
    "end": 3149.075,
    "text": "But that's my intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.156,
    "end": 3154.517,
    "text": "And thanks very much for your very insightful guidance through this book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3154.617,
    "end": 3156.097,
    "text": "It was extremely helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3156.358,
    "end": 3156.738,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.038,
    "end": 3157.678,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.151,
    "end": 3160.731,
    "text": " Thank you, Michael.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3160.751,
    "end": 3169.738,
    "text": "Ali, upon this nth reading of the textbook, what is standing out to you more and more or differently?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3172.38,
    "end": 3189.133,
    "text": "In fact, more generally, I feel that with each reading, a kind of nested markup blanket is building up inside my cognition framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3191.412,
    "end": 3204.542,
    "text": " With each reading, I become much aware of some of the connections between different parts and different sections of the theory, which I was not aware on the first reading at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3205.463,
    "end": 3215.09,
    "text": "So hopefully this growing nested markup blanket will continue to grow with future reading as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3215.11,
    "end": 3220.995,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3224.147,
    "end": 3224.507,
    "text": " Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3226.828,
    "end": 3228.668,
    "text": "What to even say?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3228.888,
    "end": 3232.169,
    "text": "It was a great cohort.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3232.229,
    "end": 3235.41,
    "text": "We spanned from the end of 2022 on through April 23.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3235.51,
    "end": 3240.291,
    "text": "And that brings this cohort to a conclusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3250.211,
    "end": 3255.513,
    "text": " So thanks a lot to Cohort 2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3256.634,
    "end": 3260.836,
    "text": "Next week we'll return and it won't be recorded.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3261.056,
    "end": 3264.157,
    "text": "We'll just be talking about feedback, project ideas, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3266.038,
    "end": 3268.899,
    "text": "And thanks again.",
    "speaker": "SPEAKER_03"
  }
]