[
  {
    "start": 8.924,
    "end": 9.925,
    "text": " All right, hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.126,
    "end": 11.427,
    "text": "It's May 24th, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.488,
    "end": 21.662,
    "text": "We're in Act-Inf live stream number 57.0 doing background and context video for the active data selection and information seeking paper and series.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.623,
    "end": 24.145,
    "text": "So welcome to the Act-Inf Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.746,
    "end": 29.813,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.534,
    "end": 32.457,
    "text": "This is a recorded and archived live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.918,
    "end": 34.84,
    "text": "Please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.461,
    "end": 37.564,
    "text": "All backgrounds and perspectives are welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.595,
    "end": 39.477,
    "text": " and we'll follow video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.458,
    "end": 46.164,
    "text": "Head over to ActiveInference.org to learn more about any of the projects, including the live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.665,
    "end": 63.602,
    "text": "So today we're going to do together a background first pass on a very interesting paper from Thomas Parr, Carl Friston, and Peter Zeidman, Active Data Selection and Information Seeking from 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.97,
    "end": 85.704,
    "text": " In this video, we're going to introduce ourselves, talk about big questions, go through the keywords of the paper, then most of the sections, section by section, and as always with the dot zero, it's just like a first pass, and we'll look forward to speaking with hopefully some of the authors in the coming weeks, and also looking at what people ask about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.064,
    "end": 91.733,
    "text": "So, Christopher, let's introduce ourselves and go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.472,
    "end": 95.445,
    "text": " Thanks a lot also for helping in the .Zero preparation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.349,
    "end": 97.769,
    "text": " Happily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.83,
    "end": 100.111,
    "text": "Yeah, so I'm Christopher Bennett.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.251,
    "end": 101.873,
    "text": "I'm a bioinformatics scientist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.133,
    "end": 107.397,
    "text": "I do a lot of data mangling, data analysis, and that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.659,
    "end": 126.934,
    "text": "This paper was of great interest to me as we kind of go into this more data-driven era in making sure that with such large data sets that we have, making sure that we can actually select relevant data for any of our applications going forward, be it machine learning or whatever we're trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.521,
    "end": 132.222,
    "text": " And I'm Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.422,
    "end": 149.471,
    "text": "I'm a researcher in California and also was drawn to this on one hand on the applied side, the idea of more efficient and effective data sampling, and then on the more theory side, the connection with epistemic value information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.973,
    "end": 152.616,
    "text": "So here are some of the big questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 152.856,
    "end": 156.482,
    "text": "Why don't you add some detail to this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.289,
    "end": 158.072,
    "text": " Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.092,
    "end": 162.186,
    "text": "So there's five major big questions that I had after reading this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.771,
    "end": 166.32,
    "text": "For the most part, it boils down to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.359,
    "end": 173.886,
    "text": " During our sampling, you can do sampling over time and sampling of different data sets in different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.167,
    "end": 184.818,
    "text": "Is there a way that we can intelligently select the data that we're going for the time that the time that we're trying to select?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.58,
    "end": 196.392,
    "text": "Is there a way that we can understand how the time aspect of sample through time instead of just doing a. Like a dynamic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.372,
    "end": 202.878,
    "text": " or more dynamic, instead of doing a static, like we're going to do time zero, time seven, time 14, time 21.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.679,
    "end": 210.044,
    "text": "Can we say, hey, the differences between time one and time two are very, time point one, time point two are very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.445,
    "end": 212.266,
    "text": "It's a lot of data in there alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.667,
    "end": 216.21,
    "text": "So we'll sample one and two, and then maybe sample 10.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.47,
    "end": 224.117,
    "text": "Is there a way that we can intelligently select the time points that we are sampling from when we get into the time series aspect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.823,
    "end": 237.716,
    "text": " There's a number, the paper mentioned a number of different time dimension models that you can add to the core model that they're utilizing, one of which was a hidden Markov model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.137,
    "end": 246.265,
    "text": "Another was, they mentioned a differential equation in the actual model itself, in the equation itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.286,
    "end": 252.231,
    "text": "Is there one, are there situations that one performs better over than the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.582,
    "end": 260.398,
    "text": " or is what they have selected to use in the paper the optimal solution in most cases, if not all cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.003,
    "end": 285.002,
    "text": " um you know that it in when it comes to clinical trials that was a little section um in this uh that they discussed um there's a lot of fda regulations of the clinical trials and it's very uh heavy red tape right now um is there a way that there's minimums ends that you need in many clinical trials to actually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.982,
    "end": 286.225,
    "text": " be considered passing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.445,
    "end": 300.696,
    "text": "Is there a way that you can bound this model that they've developed into something that you can guarantee a minimum number, a minimum sampling that the FDA requires, or any regulatory body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.279,
    "end": 313.071,
    "text": " Another point is the next step of how are we going to integrate this in with other machine learning models or any downstream applications that you're going with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.712,
    "end": 324.645,
    "text": "Is there a selection method that we can, or how do you see these, this method kind of pre, kind of before machine learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 325.125,
    "end": 330.852,
    "text": "How are we going to attach these things together so that we feed the right data into machine learning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.912,
    "end": 337.421,
    "text": " And then scalability and computational demands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.441,
    "end": 338.563,
    "text": "That's going to be a big one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.664,
    "end": 347.96,
    "text": "If this is going to be something that is used routinely in industry, you need to make sure that this is something that is as scalable as you can get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.961,
    "end": 356.434,
    "text": "You know, go from small scale, which is a lot of what they show in this paper, and then all the way up to the very large scale data sets that we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.393,
    "end": 360.417,
    "text": " used to train MLMs and other models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.078,
    "end": 365.243,
    "text": "Those are kind of the five major points that I have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.263,
    "end": 365.603,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.643,
    "end": 367.406,
    "text": "Those are very insightful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.587,
    "end": 371.751,
    "text": "Here are some of the big questions that I was excited about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.652,
    "end": 385.088,
    "text": "So first, from a more general information gain, epistemic forging perspective, how do we model the implicit and explicit constraints or trade-offs or dynamics of information seeking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.068,
    "end": 409.354,
    "text": " which is often addressing a question that is left unaddressed in data science of where the data comes from it's just about doing analysis with the data that's there but even there as this paper will kind of get into there's still sub-sampling and all these other factors to consider the clinical trial example brings a very serious and very real plot twist into the paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.469,
    "end": 417.932,
    "text": " which moves through several levels of adding theoretical generalization and incorporating like the time dimension and other features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.533,
    "end": 424.71,
    "text": "And then the plot twist is when the preferences for certain kinds of observations is specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.416,
    "end": 428.945,
    "text": " then there's all this interesting behavior and decisions that come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.246,
    "end": 430.991,
    "text": "So I'm sure that'll be a great discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.094,
    "end": 441.619,
    "text": "And then also in section four, they mentioned the streetlight effect, which is quote, the tendency to search where data are generated in a minimally ambiguous way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.987,
    "end": 442.427,
    "text": " i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 442.447,
    "end": 445.93,
    "text": "under a street lamp compared to searching elsewhere on a darkened street.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.491,
    "end": 450.534,
    "text": "And so there it's an interesting scenario and there'll be some fun art coming up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.055,
    "end": 464.866,
    "text": "And also how they distinguish the sampling method with the full information seeking from the maximum entropy sampling is a very subtle but very important point that I look forward to hearing more from the authors about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.791,
    "end": 471.572,
    "text": "Okay, so just to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 473.257,
    "end": 495.552,
    "text": " summarize the uh paper is active data selection and information seeking 2024 thomas parr carl friston peter zeidman and just a few of the aims and claims of the paper and then christopher will read the abstract this paper aims to unpack the principles of active sampling of data by drawing from neurobiological research on animal exploration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.532,
    "end": 498.055,
    "text": " and from the theory of optimal experimental design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.716,
    "end": 507.006,
    "text": "Our overall aim is to provide an intuitive overview of the principles that underwrite active data selection and to illustrate this with some simple examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.807,
    "end": 517.118,
    "text": "Our interest is in the selection of data, either through sampling subsets of data from a large data set or through optimizing experimental design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.098,
    "end": 520.687,
    "text": " based upon the models we have of how those data are generated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.349,
    "end": 529.35,
    "text": "Optimizing data selection ensures we can achieve good inference with fewer data, saving on computational and experimental costs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.433,
    "end": 532.137,
    "text": "So if you could read the abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.382,
    "end": 534.123,
    "text": " Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.183,
    "end": 541.649,
    "text": "So the main points in the abstract are that Bayesian inference is typically focused on two major issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.33,
    "end": 546.373,
    "text": "The first one is that you have to estimate the parameters of the model of the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.774,
    "end": 554.18,
    "text": "And the second is that you need to quantify the evidence for alternative hypotheses and formulate an alternative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.461,
    "end": 563.288,
    "text": "But this paper is actually looking at a third issue, which is in how you're going to select the data for your models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.268,
    "end": 577.007,
    "text": " um and either through sampling subsets of large data is typically used or optimizing experiments of design um based upon the models we have net these of how these data are generated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.392,
    "end": 585.993,
    "text": " Optimizing data selection, what's going into the models, can achieve a very good inference with fewer data points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.013,
    "end": 593.832,
    "text": "So you're saving on computational time, costs, that sort of thing, by actually reducing the amount of information that you're putting into the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.858,
    "end": 620.916,
    "text": " So what they're doing here is trying to unpack how you're going to actively select data, and I mean actively select data through a machine optimization protocol by drawing from some of these neurobiology concepts and trying to optimize the maximum information that the information can provide, maximum information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.233,
    "end": 639.124,
    "text": " So they offer overview of some basic points from the field and illustrates the application in some of the toy examples that they have that we'll go through, ranging from different approximations with basis sets to inference about how the process can evolve over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.403,
    "end": 662.853,
    "text": " And finally, they'll go through and consider how the approach to the data selection could be applied to design of clinical trials in this case, and specifically Bayes adapted clinical trials, something that is more and more seeing headlines and it's more and more used today now that we have the technology to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.873,
    "end": 663.133,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.034,
    "end": 664.395,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.815,
    "end": 670.022,
    "text": "For the roadmap, the paper begins with introduction section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.154,
    "end": 699.385,
    "text": " goes into Bayesian inference generative models and expected information gain they go through a simplest worked example and then consider a few more ways to level up that model with function approximation consideration of time dimension with dynamic processes and then bring in the preference for certain observations in the clinical trials then there's a discussion and conclusion and they also have a paragraph explaining their kind of logic there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.394,
    "end": 707.442,
    "text": " The keywords for the paper were experimental design, active sampling, information gain, and Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 707.462,
    "end": 712.488,
    "text": "So the next slides are going to go into those four background topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 713.389,
    "end": 720.176,
    "text": "After the four background topics, we'll speed through the sections and just plant a few seeds for what we want to explore more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.997,
    "end": 723.28,
    "text": "So first, experimental design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.749,
    "end": 734.269,
    "text": " Here's two kind of classical views of experimental design in the active inference and free energy principle eras.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.289,
    "end": 746.753,
    "text": "So on the left is the statistical parametric mapping, textbook, toolbox, documentation, etc., has multiple chapters and kinds of analyses included in the package.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.037,
    "end": 769.686,
    "text": " to specify and simulate and also to recognize data according to different experimental designs and one very hallmark or common visualization of these kinds of patterns of experimental design are these design matrices and it's just represented in this black to white gray scale",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.902,
    "end": 774.808,
    "text": " And it summarizes different kinds of measurements across different experimental settings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 774.968,
    "end": 778.733,
    "text": "Like here might be six settings in the larger white blocks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.213,
    "end": 781.917,
    "text": "And then there was variability within each of those trials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.517,
    "end": 784.159,
    "text": "And those are the smaller row levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.179,
    "end": 785.461,
    "text": "So that's like where the data are collected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.941,
    "end": 793.43,
    "text": "And a lot of this has to do with the linear operations that can occur on this kind of matrix in a general linear modeling framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.131,
    "end": 798.036,
    "text": "And then on the right is the experimental design",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.117,
    "end": 824.158,
    "text": " experimenter's perspective where the experimental stimuli they output as actions are the observations going into the subjective model like of the rat in the tea maze and then the action output of the rat is the observations of the experiment of the experimenter so there's kind of two different perspectives spm with more of a matrix multiplication fmri",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.51,
    "end": 847.412,
    "text": " optimal design and then active inference with the more general graphical bayesian modeling starting to broaden the consideration of what optimal foraging and what information gain epistemic value mean these are kind of the experimental design themes and how they connect a little bit with other experimental design factors want to add anything",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.898,
    "end": 860.299,
    "text": " Yeah, and keep in mind that a lot of these experiments, experimental design is a very big and very important consideration when you're actually running any sort of science or analytics of any variety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.82,
    "end": 863.545,
    "text": "And these experiments can actually get very large with,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.757,
    "end": 887.49,
    "text": " huge huge amounts of data and not all of that data is relevant for every application that you want so you want to be able to design your experiment in a way that you can collect information in a intelligent way rather than trying to go through and just collect every data point that you can because humans in many cases are running some of these experiments and they have limited time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.47,
    "end": 890.553,
    "text": " I certainly do when I'm running these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.593,
    "end": 897.24,
    "text": "I have to be very intelligent in how I set things up and how I actually collect data and what data I collect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.44,
    "end": 900.644,
    "text": "In many of these cases, you only get one shot to collect the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.764,
    "end": 902.085,
    "text": "You miss it, it's over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.886,
    "end": 905.048,
    "text": "You won't have that data point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.188,
    "end": 910.034,
    "text": "It's very critical that you actually take the experimental design seriously when you're setting these things up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.915,
    "end": 913.377,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.386,
    "end": 923.704,
    "text": " connecting that kind of experimental design, experimenter on a budget perspective with a more statistical and biologically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.224,
    "end": 929.433,
    "text": " statistical based perspective, active sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.175,
    "end": 938.55,
    "text": "So they wrote, when we look at the world around us, we are implicitly engaging in a form of active data sampling, also known as active sensing or active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 938.57,
    "end": 941.294,
    "text": "So this is referencing the visual saccades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.875,
    "end": 947.245,
    "text": "And just to kind of highlight how extreme the relative acuity difference is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.225,
    "end": 973.249,
    "text": " between the sensor of the eye where the gaze is focused on and the off center among other visual changes and vision is just being taken as one sensory example here it could also be thought of as like looking for books within a library or any other kind of selection of what data are going to come in even if it seems like all of it is coming in that still is going to be uh perhaps addressed with a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.853,
    "end": 980.47,
    "text": " different sensors that have different variability profiles or like there's different RNA sequencing kits that you could buy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.51,
    "end": 988.611,
    "text": "And so how do you balance the kind of more samples or which samples, especially as those spaces grow massive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 989.132,
    "end": 990.917,
    "text": "And then just to contrast that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.897,
    "end": 1010.998,
    "text": " whereas digit recognition in a cicade based paradigm would focus on the motor patterns and the small centrally focused visual acuity and then the motor patterns that relate to cicading around a digit whereas in the kind of machine learning taken all at once approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1010.978,
    "end": 1019.963,
    "text": " a matrix corresponding to like the pixels in the MNIST dataset are simply taken in all at equivariance level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1020.485,
    "end": 1021.989,
    "text": "So that's just kind of taking in the data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.31,
    "end": 1026.642,
    "text": "There's still another higher order data selection question of like, which digits do you take?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1026.841,
    "end": 1029.464,
    "text": " if there was a large number of digits in that library.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.864,
    "end": 1042.277,
    "text": "So this is active data sampling on multiple scales, which records you pull at all, and then how the resolution and all the trade-offs that are associated with using the data processing or making the experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.918,
    "end": 1043.799,
    "text": "Yeah, add more though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.301,
    "end": 1056.072,
    "text": "And keep in mind that when you're talking about something like the visual system, our visual system has access to untold amounts of information, but our brain can't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.587,
    "end": 1059.389,
    "text": " Take advantage of all of that at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.489,
    "end": 1064.595,
    "text": "There's a low energy usage of the brain that needs to optimize the relevant information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.655,
    "end": 1067.539,
    "text": "Think, you know, your nose is right at the end of your face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.579,
    "end": 1071.503,
    "text": "Your eyes are always seeing your nose, but your brain is filtering it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.104,
    "end": 1074.767,
    "text": "And this is happening all the time at all points in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.807,
    "end": 1082.937,
    "text": "There are literal blind spots in what you are actually capable of intaking and processing all at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.102,
    "end": 1095.38,
    "text": " And then additionally, when you're moving away from something like the eye or biological systems and into the experiment design itself, you know, you oftentimes can't run a full factorial design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.42,
    "end": 1100.928,
    "text": "And there are other methods like a fractional factorial design, but those are random base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.008,
    "end": 1107.878,
    "text": "And this is trying to actually talk about actively selecting how you're going to set up that design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.898,
    "end": 1110.983,
    "text": "So it's kind of a, you can think of it multiple different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.87,
    "end": 1113.251,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.153,
    "end": 1121.271,
    "text": "The factor that's going to come into play as driving the active sampling is going to be the information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.634,
    "end": 1126.744,
    "text": "And there's some quotes here and equation two is shown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1127.72,
    "end": 1133.607,
    "text": " They write, we have conditioned our model upon the variable pi, which represents a choice we can make in selecting our data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.127,
    "end": 1142.397,
    "text": "So data recognition, interpretation, analysis, and so on, it's often framed as kind of like an observation type or a sense-making type activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1143.037,
    "end": 1154.25,
    "text": "Here, pi for policy, as with usual, is being framed as a control or an active data selection policy we're applying to some data set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.45,
    "end": 1164.968,
    "text": " So it adds an action element into this sequential epistemic foraging rather than just taking a large data set and just munching it like all at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.449,
    "end": 1173.623,
    "text": "It brings in this sequential question of where to sample and potentially updating where is informative to sample through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1173.603,
    "end": 1188.625,
    "text": " and the i of pi is the functional on that policy distribution or specific choice that can be decomposed all these interesting ways that we can explore more in the coming discussions what else would you add though about information gain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.533,
    "end": 1200.856,
    "text": " I think this is one of the biggest points in this whole paper is you're measuring how much information you are gaining in your model by adding these different variables in here and selecting different variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.297,
    "end": 1208.892,
    "text": "You're effectively automatically taking out or trying to remove things that have high mutual information that don't add as much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.872,
    "end": 1220.927,
    "text": " So if you have parameter A and parameter B that are effectively just transformations of the same data, then you can easily remove one of those and still have all the information that you need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.987,
    "end": 1234.643,
    "text": "So it's a really, really powerful way of saying I'm trying to optimize and maximize the amount of information that I'm adding into the model by selecting data that actually has the information that is going to improve the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.205,
    "end": 1237.605,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.746,
    "end": 1250.081,
    "text": "One other interesting angle here is often in the control literature, utility, reinforcement learning, et cetera, the epistemic value component is added in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.322,
    "end": 1257.77,
    "text": "Whereas in the structure of this paper, they start with the pure information gain perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.29,
    "end": 1262.115,
    "text": "And then in the clinical trial, they bring the preference in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.213,
    "end": 1271.764,
    "text": " So the pragmatic value comes in secondary to the information gain in how they build it up step by step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1272.204,
    "end": 1274.367,
    "text": "Bayesian inference is the last keyword.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.387,
    "end": 1277.691,
    "text": "A lot of places to go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.451,
    "end": 1281.054,
    "text": "Here's what they showed for equation one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.356,
    "end": 1291.326,
    "text": "And they wrote, Bayesian inference is the process of inverting a model of how data, y, are generated to obtain two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.458,
    "end": 1315.744,
    "text": " marginal likelihood and the posterior probability so anything you want to say about bayesian inference or do you want to say something about bayesian networks and graphs i think that you've kind of covered it here and it's i think fairly textbook on this part yeah how about graphs on the bayesian graph side of it um there's multiple different ways that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.808,
    "end": 1319.373,
    "text": " these Bayesian statistics is done nowadays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.794,
    "end": 1324.26,
    "text": "And the Bayesian networks and graphs is a really powerful method going forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.841,
    "end": 1343.368,
    "text": "I know that right now in the Institute, we have an RxInfer group working right now, which is a Julia package for actually just building these network graphs, these Bayesian graphs, and doing message passing between the different factors and the different nodes of the graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.348,
    "end": 1347.592,
    "text": " So this is a very big up-and-coming area right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.672,
    "end": 1352.837,
    "text": "It's very early in the timeframe that this is going to become big.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.897,
    "end": 1364.927,
    "text": "It's kind of on the upswing right now, and it's kind of, at least I would predict, going to be kind of the next big thing going forward in the next five years or so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.947,
    "end": 1372.174,
    "text": "Yeah, we've been having a great epistemic time, and Livestream 55 explores some of this in more detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.998,
    "end": 1389.218,
    "text": " okay that was the background now on to the paper so first just to get the last part of the paper out of the way they have a github thomas pars github with the active data selection repo",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.451,
    "end": 1397.82,
    "text": " and maybe in one of the upcoming discussions or somebody in the time between can explore and transform and play with the code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.901,
    "end": 1412.216,
    "text": "And also all these different ways that we have fun discussions around the language of the active inference model and how building it in different languages or using different styles like is or isn't plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.376,
    "end": 1418.783,
    "text": "These have been very fun discussions that help us get out what the core of the math really is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1419.134,
    "end": 1423.682,
    "text": " and how that's independent of whether it's written in MATLAB or any other language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.764,
    "end": 1428.471,
    "text": "And then also as it is simulated, it's written here in MATLAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.491,
    "end": 1429.853,
    "text": "And so that's kind of interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.554,
    "end": 1434.882,
    "text": "Any thoughts on that or just like coding in RxInfer or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.887,
    "end": 1449.685,
    "text": " Yeah, I think that with RxInfer being, I think, relatively new on the scene, you have some of these other traditional approaches with MATLAB and PyMD and that sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.586,
    "end": 1464.565,
    "text": "It'll be very interesting to see how these techniques evolve over time with packages like RxInfer really, I think, changing how we approach building these models and designing them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.545,
    "end": 1483.545,
    "text": " I think that it's going to be even more critical now in this current environment to select the data intelligently going in so that you're not muddying up your models or having to build too big of models that might have information that's not as useful to the application at hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.166,
    "end": 1485.847,
    "text": "Yeah, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1486.408,
    "end": 1487.889,
    "text": "All right, section one, introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.969,
    "end": 1490.772,
    "text": "So we'll try to hit on some of the key points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.19,
    "end": 1518.362,
    "text": " i'll say something briefly and then feel free to add something if you want section one situates that inference and action cycle or loop or partition in terms of a statistician's job or process in modeling observations data as sampled and latent variables as models and the process by which there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1518.578,
    "end": 1533.617,
    "text": " kind of snapshot or bulk summarization or generativity or and how it's possible to have a continuous resampling of informative data or how you even evaluate how data are informative in which way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.319,
    "end": 1535.84,
    "text": "Want to add anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.901,
    "end": 1539.104,
    "text": "I think you've captured that very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.325,
    "end": 1543.59,
    "text": "I'm going to actually pull out my notes so that I can actually remember all the symbols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.287,
    "end": 1571.704,
    "text": " y are going to be used for data and theta for the latent variables so distributions of data distributions of latent variables conditioned upon data coming in so that could be seen as just one data point sequentially or a big bulk vector coming in like all at once um just continuing to move through this section they wrote",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.713,
    "end": 1592.983,
    "text": " careful data selection is especially important when we consider the problems associated with very large data sets of the sort that are now ubiquitous in machine learning and artificial intelligence settings so just to summarize a little bit or add a few notes that came up in the paper so other than this topic being",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.963,
    "end": 1622.346,
    "text": " very fascinating and very integrative in terms of a unifying approach for information and behavior etc also this is definitely one of the active inference questions that has a lot of pragmatic relevance as dealing with with data sets of different kind is totally day to day and especially the way that even the examples specify important settings is very clear very direct though also the mathematics are very general about epistemics and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.389,
    "end": 1635.207,
    "text": " this motivation that they lay out in the first section about how if this challenge could be addressed, then there would be all these kinds of benefits that could be realized with current systems and data sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.109,
    "end": 1645.884,
    "text": "And then they provide the approach to at least getting there or towards it to optimize data selection, we first need to identify an appropriate optimality criteria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.425,
    "end": 1651.793,
    "text": "And so they're gonna kind of go through several stages of with different generative models,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.33,
    "end": 1655.426,
    "text": " how that optimality criterion is defined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.417,
    "end": 1658.02,
    "text": "Anything else, Ted?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.13,
    "end": 1663.856,
    "text": " And keep in mind that this is the expected information gain that they're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.316,
    "end": 1669.503,
    "text": "It's effectively how much do we think we're going to gain by adding this information in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.023,
    "end": 1678.233,
    "text": "And then you can, of course, train your model by looking at the actual information gain if necessary, and go through kind of a learning cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.273,
    "end": 1683.72,
    "text": "But we're basing this all off of what do we expect to gain from this information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.843,
    "end": 1713.555,
    "text": " right section two basing inference generative models and expected information gain in this equation three i won't read it all it models the markov blanket formalism in terms of upstream and downstream causal relationships in terms of messages that are passed along edges of a factor graph they introduce in this paper the lambda operator to indicate either summation or integration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.058,
    "end": 1718.387,
    "text": " So this is across continuous variables or discrete variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.59,
    "end": 1723.759,
    "text": "And we'll explore this more with the authors, hopefully.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1723.879,
    "end": 1725.823,
    "text": "Anything you want to add on equation three?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.339,
    "end": 1733.949,
    "text": " More that, you know, the information gain is a function of the data that you sample.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.289,
    "end": 1739.617,
    "text": "So depending on how you sample that data, you're going to get different information gain out of it, as you would expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.298,
    "end": 1750.814,
    "text": "And then you start to get into the message passing, which is that Bayes graph and factor graph, I guess, challenge going forward that construct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.854,
    "end": 1756.823,
    "text": "When you build it in a factor graph model, you have to be able to pass the messages between the nodes effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.697,
    "end": 1781.477,
    "text": " yeah and to kind of ground that in the data science situation if you have a latent state estimate and you're generating data generative ai synthetic data then the latent variable is upstream causally statistically from the data pseudo observation but that might be the actual real observation if you're interested in the computer model whereas the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.2,
    "end": 1809.793,
    "text": " data recognition case where the data are upstream of the estimate of a parameter like a risk score or something like that then the parent of the latent state estimate is the data so that's the recognition direction so this kind of covers the whole Bayesian update possibility spectrum in this essentially Markov blanket but it could be in face space or time or a few other situations they explore",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1810.955,
    "end": 1839.308,
    "text": " all right three a worked example this section lays out the overall pipeline for how you get from the graphical notation of the bayesian network whether it's viewed visually graphically like with a variable dependency structure or whether it's just written out in terms of the plain text with the analytical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.013,
    "end": 1845.5,
    "text": " The Bayesian network is transformed into a factor graph, probably a constrained factor graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.562,
    "end": 1847.403,
    "text": "Discussion for another day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.624,
    "end": 1853.891,
    "text": "On that graph, certain messages are passed at inference runtime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1856.154,
    "end": 1862.983,
    "text": "Conditional and predictive entropies are calculated as part of the way that this system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.132,
    "end": 1892.785,
    "text": " outputs or is described by different probability distributions understand in a kind of statistical mechanical way in terms of entropy and then that is going to come together into calculation of the objective function which is the expected information gain which is basically conditioned upon the cognitive model of the sampler so just because the sampling is active data sampling doesn't mean that it's going to lead to like an adaptive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.883,
    "end": 1920.19,
    "text": " behavior it just means that where the learning rate is perceived to be highest informationally iteratively there is a ranking by which those can be uh which this the space of experiments can be ranked by and it can connect to pragmatic value in terms of epistemic and pragmatic coming together for the full expected free energy like in the clinical trial",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1920.794,
    "end": 1921.295,
    "text": " Anything to add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.437,
    "end": 1933.554,
    "text": "And you'll notice in this Tor example that they are discussing here, the factors that they have in their graph in each of their nodes is actually a cosine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.574,
    "end": 1939.643,
    "text": "So that's why you get that kind of oscillation in that bottom plot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.325,
    "end": 1948.978,
    "text": "So you'll have areas of maximal information and then areas of minimal information just based on the Tor example that they have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.414,
    "end": 1953.64,
    "text": " And this doesn't always have to be cosine, but in this example it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.661,
    "end": 1966.36,
    "text": "And so it just kind of gives you a really good graphical understanding of how your information gain can be viewed over a sinusoidal sort of oscillation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.47,
    "end": 1979.488,
    "text": " yeah just to kind of double down on that if you sample right here on the number line or right here the lines are indistinguishable so the information gain is expected to be low",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.11,
    "end": 2000.008,
    "text": " under understanding the parameter family that is being generated and sampled from which in this first example is the same same type of equations whereas where the functions are maximally distinct the information gain associated with reducing uncertainty about which one of those five",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.258,
    "end": 2021.625,
    "text": " the the data point is coming from those are the informative points at the zero on the number line and far out that's where just perceiving one point uncolored would give you the most ability to even perfectly resolve which one of the five situations it was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.419,
    "end": 2055.274,
    "text": " so oh they're right in effect this model amplifies or attenuates the amplitude of the predicted data depending upon a periodic function of our data sampling policy pi so here the the policy distribution is like that kind of around the clock direction which is not a common setting but the the general idea of sampling amongst a finite set of alternatives where a control variable is going to result in the most informative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.642,
    "end": 2081.228,
    "text": " data point is a theme that is going to be expanded upon and also one interesting mathematical move once all terms that are constant with respect to pi are eliminated we are left with equation six so equation five comes down to equation six or maybe not exactly only five six but six has removed all the the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.372,
    "end": 2100.178,
    "text": " variables that don't change as policy changes so if the question of policy selection is taken alone like gradients on policy updating then everything that's constant with respect to it doesn't come into like the delta pi delta something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.698,
    "end": 2103.483,
    "text": " So it just simplifies it down to only a function of policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.244,
    "end": 2113.278,
    "text": "And that just kind of reflects how like the sense making and belief updating component is partitioned off from the policy selection component here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.742,
    "end": 2121.492,
    "text": "Yeah, you're looking for change in your belief based on the observations that you've gained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.993,
    "end": 2126.52,
    "text": "So if it's not changing, it's not as informative in your information model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.913,
    "end": 2131.035,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.115,
    "end": 2143.289,
    "text": "Continuing on equation six there, which is modeling the policy dependent components of information gain as an objective function that ranks decisions about where to sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.791,
    "end": 2154.482,
    "text": "Equation six is a special case of the third row of table one, which highlights analytical expressions for expected information gain for a few common model structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.643,
    "end": 2167.281,
    "text": " As we might intuit, the most informative places to sample data align with those in which differences in theta lead to large differences in the predicted data in which our choice of pi maximizes the sensitivity with which y depends on theta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2167.982,
    "end": 2172.589,
    "text": "So here are the categorical, the Dirichlet,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.801,
    "end": 2201.428,
    "text": " and other functions in terms of how they'd be written out in the probabilistic like specifying a distribution way and then how there's this relationship analytically to a related distribution which is an objective function that ranks the information content of sampling the likelihood distribution in a certain way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2202.505,
    "end": 2205.449,
    "text": " And that's closed form in certain situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2206.19,
    "end": 2209.894,
    "text": "And then also the explorer where it's intractable formally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.134,
    "end": 2213.579,
    "text": "And so then that's where the variational approximation comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2214.219,
    "end": 2215.06,
    "text": "Anything to add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.162,
    "end": 2220.187,
    "text": "No, I think that summarizes this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.207,
    "end": 2221.168,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.188,
    "end": 2223.771,
    "text": "Section four, function approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2225.81,
    "end": 2255.428,
    "text": " next turn to a generic supervised learning problem that of trying to approximate some function based upon known inputs and the observable outcomes they stochastically cause pretty general neural network or latent state observation setup um that information is composed and concatenated so so that there's a common",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.813,
    "end": 2283.542,
    "text": " variable that's describing the statistical object that's going to be describing the inputs and the relationship with the observable outcomes and then that function approximation from sequential data in figure three is simulated with random but potentially you could call all of them random but this one is a flatter",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2284.012,
    "end": 2290.482,
    "text": " or a less informed and iterated model of data sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.263,
    "end": 2309.991,
    "text": "Just going to show that samples of random data with even this minimal non information gain driven model has a certain baseline prediction that's associated with certain choices about sampling sequentially from this generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.833,
    "end": 2312.955,
    "text": "Want to add anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.391,
    "end": 2327.152,
    "text": " Yeah, it's just I like that they highlighted in this, that choice diagram there that you can actually get the inefficient sampling just by random that you start to rent, you can randomly select two things very close together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.192,
    "end": 2337.688,
    "text": "And you've effectively, maybe not wasted a choice, but you know, not gotten the maximum gain from that choice that you could have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.571,
    "end": 2339.871,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.977,
    "end": 2345.562,
    "text": " They write a little bit more about Figure 3.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2347.105,
    "end": 2353.534,
    "text": "Figure 3 illustrates a depiction of this model as a Bayesian network and a visual representation of the data generating process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.139,
    "end": 2359.142,
    "text": "Now they're going to bring in information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.863,
    "end": 2364.39,
    "text": "So they write, this is where information gain becomes relevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.809,
    "end": 2372.466,
    "text": " into designing a more informed way to sample data than from a flat or a non-updating prior data sampling distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2372.726,
    "end": 2377.958,
    "text": "It's like equivalent to having a policy prior that's fixed, which might be a heuristic in a certain space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.401,
    "end": 2382.969,
    "text": "They write substituting equation seven into equation three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.011,
    "end": 2384.893,
    "text": "So here's that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.903,
    "end": 2412.636,
    "text": " um markov blanket parent child concept and here equation three is describing the policy dependence on the joint distribution of the observed and the unobserved and this is combined into equation 10. to show what equation 10 does in terms of now that we're sampling from this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.207,
    "end": 2424.356,
    "text": " distribution or like statistical distributions that this describes, they'll differentiate figure three from figure four, kind of like bring in this model change between those two figures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.897,
    "end": 2430.622,
    "text": "Now samples are drawn from a distribution whose log is proportional to the information gain in equation 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.102,
    "end": 2440.01,
    "text": "So it takes the flat policy prior and in a fixed way has remapped it to be proportional to the information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.73,
    "end": 2442.792,
    "text": "So here's three on the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.987,
    "end": 2463.902,
    "text": " and then four on the right and um the figure uses the same format as figure three but now each choice is sampled to maximize anticipated information gain and they point to some specific uh quantitative patterns but also like qualitative patterns so want to add anything on figure four",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.81,
    "end": 2491.442,
    "text": " Just that now if you focus on those choices, because I really did, I think, like that choice plot there, you can see that the walks around kind of choices around your data space are a little bit more distributed, evenly distributed, a little bit less random, but you start to get, I think, a more cohesive sampling of the data without entire randomness, putting things too close together, putting selections too close together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.51,
    "end": 2517.683,
    "text": " yeah okay continuing on uh well they set up the question as this raises the question as to how many samples should we collect so within a foraging bout where should one look and then at the kind of like pulling a layer back in the strategy when should you halt looking like if you have already sampled all three records from a data set",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.764,
    "end": 2541.73,
    "text": " then unless you had some other reason you could fully stop sampling there but you also might want to have a softer stopping criterion that would relate to how much information you're gaining from continuing to sample in that way before like halting and so they include that by having like an exit policy in the state space of foraging possibilities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2542.233,
    "end": 2543.796,
    "text": " So how do you resolve that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.778,
    "end": 2550.349,
    "text": "An answer to this question can be drawn from behavioral neuroscience and the so-called exploitation exploration dilemma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.073,
    "end": 2559.087,
    "text": "And they introduced the notion of sampling costs to help decide that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.888,
    "end": 2563.836,
    "text": "So this method is still going to require parameterization",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2564.187,
    "end": 2569.216,
    "text": " situation-specific modeling of the relative costs versus the relative information gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.657,
    "end": 2577.992,
    "text": "However, at least there's an accounting that includes costs into the sampling equation to give any possibility of exiting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.353,
    "end": 2586.668,
    "text": "Because if no costs are provided for sampling, then the model might just converge and continue to eke out very small amounts of variance explained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.154,
    "end": 2607.154,
    "text": " if it doesn't explicitly have that stop option so they take the policy vector the list of locations that can be sampled from and adds a zero element which reflects the information gained if we were to stop sampling and then there's a preference over those observations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.163,
    "end": 2610.206,
    "text": " expressed in the C vector, preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2611.367,
    "end": 2617.775,
    "text": "And this brings in the information seeking and the cost-aversive imperatives into the same objective function in 11.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.636,
    "end": 2619.617,
    "text": "Anything to add on 11?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.739,
    "end": 2636.719,
    "text": "Yeah, eventually the idea is that it just gets to a point where you're no longer, whatever you set your kind of stopping energy to be, kind of your breaking energy, eventually it's just going to get to a point where the model just says, hey,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.699,
    "end": 2638.041,
    "text": " I've reached what I can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.121,
    "end": 2639.142,
    "text": "You've set this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.422,
    "end": 2641.925,
    "text": "You're not gaining anything beyond this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.386,
    "end": 2650.595,
    "text": "We can just stop at this point, which is nice, since in the random selection case, there's not necessarily a stopping parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2650.915,
    "end": 2660.226,
    "text": "As Daniel mentioned, you could continue to get eke out very, very small marginal changes, but you're not going to gain anything else, and so you're just spinning your wheels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.13,
    "end": 2688.947,
    "text": " way of saying hey i've reached kind of an inflection point of data gain i'm done so figure five they're continuing in this genre of three four five and now they've added in to the policy decision which which has an upstream dependency on the data that's the active policy edge they add in this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.699,
    "end": 2713.652,
    "text": " uh cost to sampling so we can explore more however it now includes not just the information gain driven choices within the trial but it includes a specific probabilistic but decisive stopping point for that trial as parameterized by how sensitive it is to information gained and preference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2715.134,
    "end": 2736.467,
    "text": " so this is one of the most interesting parts and and discussions in the paper they they ask it out loud a reasonable question to ask at this stage is why bother with the full information seeking objective and basically how does this differ from maximum entropy sampling and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.0,
    "end": 2752.093,
    "text": " let's look forward to the authors or other guests but here's just a few notes on this because i think it'll be a great place to explore what it really means to do a statistical and physical modeling on cognitive systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.423,
    "end": 2779.92,
    "text": " they directly contrast maximum entropy sampling and their whole information gain family against each other and then the rebuttal is in figure six so just to show figure six six for a second the measurement noise increases in variance from the center of the function domain so the the variability profile of the function is non-uniform",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.238,
    "end": 2787.108,
    "text": " This means the amount of unresolvable uncertainty is heterogeneous through the domain of potential sampling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.128,
    "end": 2800.187,
    "text": "So in some kind of ways of thinking about what they're really getting at and just putting this out as a speculation or starting point for this key technical point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.167,
    "end": 2816.978,
    "text": " if there were a case where the latent states were equivariant they had iid variability profiles then sampling the most variable sensory data is the most informative like if you're taking a picture of a solid black image",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.958,
    "end": 2835.456,
    "text": " then sampling from the noisy pixels is going to potentially provide more information gain you're reducing uncertainty more about something it might be overfitting but you can select as a heuristic wanting to sample from where variability is high at just kind of a first pass layer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.82,
    "end": 2863.485,
    "text": " however as we start to think about richer or more specified statistical patterns generative models there become dependencies that are sparse but important amongst all different kinds of things so things that are variable from a sensory perspective provide high information gain potentially to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.073,
    "end": 2891.127,
    "text": " one part of a generative model like a screen and static but then other events might be less variable from a sensory perspective but smaller differences even in that variable relate to some other component of uncertainty resolution from some other component of the the model like those are going to be the cases where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2891.782,
    "end": 2897.831,
    "text": " cognitive modeling does differ from just dispersed decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.851,
    "end": 2907.285,
    "text": "However, they're both going to result in dispersed decision-making profiles, like looking at the choices in the figures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.727,
    "end": 2920.725,
    "text": "But the choices to sample from the less ambiguous parts of the actual distribution, that leads to a much narrower policy path",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.807,
    "end": 2942.089,
    "text": " in this cognitive control setting versus in a variability sampling where it would go for the areas that were just more variable but not necessarily providing more information question mark on this with the maximum entropy or anything",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.318,
    "end": 2955.502,
    "text": " And I would even highlight on the next slide, effectively what it is doing is accepting that you're not going to gain a lot of resolution in these highly variable regions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.003,
    "end": 2960.331,
    "text": "And so you don't really have to sample into those deeply because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.311,
    "end": 2990.318,
    "text": " you've accepted that it is variable it is not something it is inherently variable in the data we're not going to gain a lot of information from these regions um and i it's highlighted in blue down there and i think that's one of the big highlight notes of this figure is this less information gain available in these highly variable regions and that's something that makes this method more robust and powerful when you're dealing with some of these non",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.298,
    "end": 2992.403,
    "text": " uniform variable data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.986,
    "end": 2995.65,
    "text": "Yeah, awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.67,
    "end": 3000.541,
    "text": "And then the streetlight effect is brought in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.523,
    "end": 3006.113,
    "text": "So the avoidance of sampling in ambiguous locations is sometimes referred to as a streetlight effect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3006.548,
    "end": 3010.573,
    "text": " The tendency to search where data are generated in a minimally ambiguous way, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.593,
    "end": 3013.676,
    "text": "under a street lamp compared to searching elsewhere on a darkened street.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.357,
    "end": 3020.163,
    "text": "So I made some GPT-4-0 images, some fun streetlight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.804,
    "end": 3027.512,
    "text": "And on one hand, there's kind of this sense of like, is it constraining to look under only the streetlight?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.632,
    "end": 3028.973,
    "text": "Isn't that kind of absurd?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3029.314,
    "end": 3034.8,
    "text": "And then there's the joke about how what the person's looking for is elsewhere, but they're still searching under the streetlight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.135,
    "end": 3053.194,
    "text": " they're looking for something they they know is elsewhere so that's the kind of tragic element of it then there's this limited element however there's also this realistic element which is like well are you supposed to search where you can't sense or outside of where you are at that moment so how could you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.372,
    "end": 3083.586,
    "text": " you know say that that wasn't just and then this paper is more framing it as just a general condition of perception like you're in your tactile street light that is the part you can see at all you can have latent modeling of any and other things but if it's not grounded in some way to a measurement made in a street light under the metaphor where the light allows for observation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.836,
    "end": 3093.323,
    "text": " then you're not connected to data unless you're connected to that streetlight so that's just a very interesting kind of topic and reference that the authors use what do you think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3093.657,
    "end": 3094.378,
    "text": " Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.458,
    "end": 3098.682,
    "text": "I mean, it kind of boils down to you can't know what you don't know or you can't observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.263,
    "end": 3104.949,
    "text": "You know, if you can only observe what's underneath the streetlight, then you can't really know what else is outside of there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.969,
    "end": 3110.155,
    "text": "And so your inference necessarily should be constrained to what you are able to actually observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.575,
    "end": 3111.817,
    "text": "You can't observe the unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.257,
    "end": 3117.663,
    "text": "And so not necessarily in this case, because you don't even know if it even exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.683,
    "end": 3120.306,
    "text": "You have no data to confirm or refute it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.294,
    "end": 3125.041,
    "text": " All right, section five, dynamic processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3125.201,
    "end": 3137.974,
    "text": "So in that previous example, there was a data selection challenge, whether it was approached from the flat, fixed prior, or all these other kind of subsequent variants with adaptivity and or with the cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.629,
    "end": 3143.175,
    "text": " Now there's going to be a time element brought into the underlying generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3143.375,
    "end": 3145.698,
    "text": "We'll just go quickly here because that's the big point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.938,
    "end": 3153.668,
    "text": "They take the static distribution that was sampled from and now give the underlying process also variability through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.728,
    "end": 3160.497,
    "text": "So this is like a very SPM, brain, latent state, causal modeling type set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.577,
    "end": 3162.159,
    "text": "Yeah, anything you wanna say on that before we go in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.06,
    "end": 3164.943,
    "text": "Oh, no, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.963,
    "end": 3165.183,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.203,
    "end": 3168.147,
    "text": "So they consider processes that evolve in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.734,
    "end": 3176.73,
    "text": " Equation 12 can be interpreted similarly to equation 8, in which the expectation of the data is treated as a function approximation, which now includes a time argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3177.171,
    "end": 3177.572,
    "text": "So here was 8.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3177.612,
    "end": 3185.107,
    "text": "Expectation of the data given latent state parameterization and policy equals so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.009,
    "end": 3188.734,
    "text": "And then here, there is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.068,
    "end": 3214.772,
    "text": " data also being a function of parameterization and policy and then also bringing in an element with a subscript tau for time uh then you mentioned in your big questions the different approaches that they raise here with the three ways to bring temporalities into a model so let's definitely talk about that but just to show their images",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.752,
    "end": 3231.512,
    "text": " 7 and 8 are the pair for this dynamical section so figure 7 shows a graphical representation of the matrices involved in generating our data and the inferences obtained after sampling so here it is sampling from a time variance function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.252,
    "end": 3247.797,
    "text": " And then figure eight goes into more detail and notes predictions based upon current data can be used to inform predictions about nearby spatial locations and to predict and post-dict the values of the function at different points in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.777,
    "end": 3268.502,
    "text": " so just like you could have a 2d plane grayscale and infer the location of the street light by pursuing like a gradient up the light and then there would be this optimal sampling like if you just got one observation you would want to sample on a line that was orthogonal to the one that you couldn't resolve",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.225,
    "end": 3298.0,
    "text": " lots of ways to think about this sequential prediction but now the underlying landscape also changes so there's some temporal dynamics and then that can be fit with all these different time series models and autocorrelation and so on however that's specified statistically in the generative model but this section just shows however you do make a statistical model for time it's basically going to be the same thing where information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.081,
    "end": 3302.286,
    "text": " is gonna be drawn from a distribution and now time is a variable in that distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.869,
    "end": 3318.285,
    "text": " They write, in this in the previous section, we have demonstrated the way in which smart optimal sampling may be used to select data in a manner that balances the cost of sampling or performing further experiments against the information gained from those samples or experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.186,
    "end": 3324.092,
    "text": "Each of these examples has relied upon relatively simple and analytically comfortable linear Gaussian systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.652,
    "end": 3330.018,
    "text": "Next, we address active sampling in a situation where analytical solutions are no longer possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3330.779,
    "end": 3333.522,
    "text": "So to highlight the key",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.704,
    "end": 3362.361,
    "text": " formalisms that they're working with in that kind of background section or setup section they kept one thing constant which was that the generative model the generative process or however it's considered with the family of equations that the agent is inferring and tracking hidden states with and that being the same as the actual family of equations that's generating the function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3362.341,
    "end": 3389.648,
    "text": " of observations and here that is relaxed so that opens it up to all empirical settings where you can just say right off the bat we do not have access to the generative model of those data so we're making a map statistical map with all the associated trade-offs and statuses of like that genetic data or that transcriptomic data all those different kinds of data sets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.067,
    "end": 3405.932,
    "text": " starting from a position where it's going to have to be statistically approximated and it isn't going to be based unless explicitly otherwise on actual knowledge about the causal elements of the system any thoughts on that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.992,
    "end": 3423.094,
    "text": " Well, in something else that they noted in the paper, by adding this time element, when they're actually going through the time series, the model itself will preferentially select different data beyond what it just recently selected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.134,
    "end": 3429.422,
    "text": "So if time point one, it selects X and Y data, time point two, it might select L and M data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.402,
    "end": 3434.369,
    "text": " So it actually will go through and select different types of data, and it'll take a little bit of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.429,
    "end": 3444.805,
    "text": "What the time is can be variable, but it'll take a little bit of time before it revisits some of that previous data at a previous time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.885,
    "end": 3450.754,
    "text": "So by this, you kind of have a sliding window of data that you're selecting over different time periods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3453.278,
    "end": 3454.279,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3454.681,
    "end": 3462.429,
    "text": " All right, that's all going to come to play in this clinical trial, which is the big final contribution section of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.39,
    "end": 3470.238,
    "text": "In our final example, we demonstrate the potential utility of the ideas outlined above in the context of a more concrete example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.219,
    "end": 3480.449,
    "text": "So they model the statistical setting here as an adaptive Bayesian clinical intervention methodology experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.15,
    "end": 3483.692,
    "text": "For example, the kind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.79,
    "end": 3487.295,
    "text": " that was done during the 2014 West African Ebola outbreak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.437,
    "end": 3494.686,
    "text": "The active sampling approach advocated in this paper offers two main opportunities to augment adaptive trial designs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3495.407,
    "end": 3501.335,
    "text": "First, it allows us to adapt the design to maximize the information we obtain about treatment efficacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.116,
    "end": 3511.57,
    "text": "So that's the pure sense-making information gain learning sampling from where it's informative, not from where like we habitually or prefer to look.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.685,
    "end": 3524.378,
    "text": " and then second to balance and bring together that information gain with costs and that was brought in with the cost of the sampling section",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.712,
    "end": 3549.842,
    "text": " which was done in this paper by adding the stop policy option which can be probabilistically selected and then as other sampling locations become less informative or if somebody was just sampled and you know that there's a slow decay through time then on that subject the stop policy cost would outweigh the information gained from an experiment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.683,
    "end": 3554.987,
    "text": " And this is also, I think, will be a very interesting discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.007,
    "end": 3566.277,
    "text": "This blurs the line between clinical trial and public health intervention and can be seen as analogous to animal behavior that is never fully exploitive or explorative, but is a balance between the two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.337,
    "end": 3573.944,
    "text": "So how do we think about that in terms of biomedical and health security and all these different topics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.985,
    "end": 3578.108,
    "text": "And any thoughts on this before we go into the formalism of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.493,
    "end": 3580.977,
    "text": " clinical trial, just think about clinical trials or anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3582.037,
    "end": 3588.086,
    "text": " Yeah, and I think that that's going to be like that last point there is going to be a big one going forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3588.166,
    "end": 3595.538,
    "text": "It's like, how do you balance benefits to the patient, benefits to your trial, benefits to essentially the company?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3595.618,
    "end": 3599.844,
    "text": "Like there's a lot of different benefits and costs that you have to weigh into this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.885,
    "end": 3608.618,
    "text": "And so these models are going to get very complicated when you start to distill this into something, especially with health related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.121,
    "end": 3612.565,
    "text": " So it'll be very interesting to see how this evolves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3615.389,
    "end": 3617.512,
    "text": "Okay, so here's how they do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.413,
    "end": 3619.554,
    "text": "Our setup is as follows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.815,
    "end": 3625.742,
    "text": "For each new cohort of participants, we decide upon the randomization ratio to adopt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.183,
    "end": 3630.128,
    "text": "That's the orange subscript R of policy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3630.488,
    "end": 3633.492,
    "text": "So this is policy on a randomization ratio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.062,
    "end": 3649.962,
    "text": " there's three options so this is a discrete but linearly ranked not fully categorical policy decision where one half would be the 50 50 sampling between the two groups whereas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.532,
    "end": 3657.745,
    "text": " you know a priori that sampling in a skewed ratio is going to be less informative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3658.125,
    "end": 3662.072,
    "text": "Like if you sampled only from one, you would obviously be maximally uninformed about the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.673,
    "end": 3671.629,
    "text": "However, what's going to end up being reflected in the policy decision to shift to a one-third or a two-third",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.609,
    "end": 3699.793,
    "text": " which is focusing observations on one branch of the study more than the other is going to focus on the explicit quantitative preference for observations of survival so that's going to be very interesting to see how the time variable which relates to the experimental design but by way of modeling the death curves of the participants and how different preferences for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3701.09,
    "end": 3718.187,
    "text": " complementary processes of reducing uncertainty about the treatment-specific death curves and not preferring to see death observations because that would introduce the pragmatic imperative to measure low survival experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3718.505,
    "end": 3736.503,
    "text": " So there's a lot of complexity in there from the public health side, also in this very simple and interpretable way that like, this is like a Bayesian light switch with 50-50 information seeking mode, or tilt it one way or the other to bias observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3737.124,
    "end": 3745.052,
    "text": "Whereas if no information had to be resolved, then the policy selection would orient towards observing long survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.808,
    "end": 3753.089,
    "text": " Whereas if that was somehow changed, then it would have to be adaptively sampled on the fly and changing these ratios and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.13,
    "end": 3754.654,
    "text": "What do you think about this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.056,
    "end": 3763.649,
    "text": " Yeah, and what we're going to kind of get into is, especially with these sorts of health decisions, you want people to survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.769,
    "end": 3766.614,
    "text": "Like that's your primary goal in a lot of these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.954,
    "end": 3768.036,
    "text": "You want to see an effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.076,
    "end": 3772.262,
    "text": "You want to see a positive effect of your treatment one way or the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3772.302,
    "end": 3778.913,
    "text": "You know, if it's the placebo that's the positive or it's the actual treatment that's the positive, you want people to survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.953,
    "end": 3783.78,
    "text": "So this is kind of getting into the ethics of making sure that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.828,
    "end": 3800.482,
    "text": " when you design these things, that you're doing the maximum good to your participants who may not have much hope to stand on during some of these crises or epidemics or whatever they are experiencing at the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3802.366,
    "end": 3805.212,
    "text": "So you want to design this in such a way that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.748,
    "end": 3809.294,
    "text": " You keep them, the patients in mind, that is the whole point of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.976,
    "end": 3824.061,
    "text": "And so by having a Bayesian kind of preference and bias to keeping the patient alive and the best outcome, you are maximizing how the patient's outcome in the patient's life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.712,
    "end": 3826.655,
    "text": " Thanks for adding that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3826.775,
    "end": 3838.928,
    "text": "Another point to make, this is from Figure 9 that's going to come up, but it really highlights how sparse and few and interpretable the Bayesian graphical formalism is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.127,
    "end": 3860.068,
    "text": " And message passing, which a lot of the equations describe and the discussion about Rx and Fur touched upon, message passing gives procedural ways to implement this in computational systems, because it's sometimes hard to go from the simplicity of like this graphical model to fitting iteratively on complex data sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3860.568,
    "end": 3864.612,
    "text": "But it's pretty clear to see how different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3864.659,
    "end": 3892.303,
    "text": " variables are upstream or downstream of other variables and also how the time sampling can be shown to be which is upstream of data sampled as these other factors are but it has a separable interpretable calculable epistemic value that doesn't have a certain kind of connection to randomization ratio for example",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3893.043,
    "end": 3913.33,
    "text": " So being able to have explicit statistical calculations and directednesses where the follow-up time doesn't influence the treatment group ratio or the randomization ratio or other processes gives a type of interpretability that the generative model gives us the equations for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3913.31,
    "end": 3917.157,
    "text": " And then the pragmatic challenges are about actually implementing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.718,
    "end": 3929.26,
    "text": "And then even if the computational component were totally addressed and abstracted away, that would basically center these broader questions, which I think the health examples are great, like jumping off point four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.607,
    "end": 3947.67,
    "text": " Yeah, and you have probably recalled from all the other different figures, despite how simple this figure is, the other figures, the plots were very basic, the models themselves, like you just had the three nodes converging on the Y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.65,
    "end": 3954.678,
    "text": " So despite how simple this looks, you are adding more complexity to these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.758,
    "end": 3961.546,
    "text": "And the more complexity that you add, the harder it is, the more computationally intensive it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.566,
    "end": 3964.69,
    "text": "And so this is that question of how big can you go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.731,
    "end": 3967.533,
    "text": "How many nodes can you add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.593,
    "end": 3969.335,
    "text": "How many parameters can you add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.355,
    "end": 3976.003,
    "text": "How much complexity can you add to the system before it starts to break down or not perform as well as you would hope?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.418,
    "end": 3983.428,
    "text": " yeah so other than bringing in that randomization ratio kind of expression of preference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.927,
    "end": 4013.297,
    "text": " this model differs from the prior one in that it's defined that the kind of cognitive map is not the territory they're different families so that's what motivates this approximation approach so this is a simple displacement where still it's a trackable problem as they'll unfold however the simulation family chosen for the for like the approximation basically the approximation could apply to any data set",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4013.277,
    "end": 4030.29,
    "text": " but it might be woefully inadequate like it might fit only one component of it so that's again part of the interesting question is like how similar does the statistical model have to be or what information does it really bring in and how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4030.962,
    "end": 4054.152,
    "text": " to to model or work with the empirical side um but just on a more general statistical level uh equations 15 16 17 describe some of the technical details of the incremental optimization gradient scheme the newton optimization variational applause we'll talk to thomas at all figure nine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.486,
    "end": 4079.397,
    "text": " is displaying the kind of before picture for the randomized control trial so here's where that graphical model is that was shown earlier and then here are these two groups and their survival through time and different sampling choices that are made then just to to jump to figure 10",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.165,
    "end": 4087.511,
    "text": " has the same layout as figure nine, but now using the expected information gain from equation 18 to guide sampling of data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.152,
    "end": 4093.557,
    "text": "So this is just to show the impact of that active data sampling, and then we'll drop back to the equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.679,
    "end": 4098.262,
    "text": "There are some notable differences between the choices made in figure 10 compared with nine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.203,
    "end": 4102.687,
    "text": "Nine choices, 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4104.528,
    "end": 4111.155,
    "text": "The most obvious of these is that the follow-up times selected have been moved later once optimal sampling is employed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.35,
    "end": 4138.932,
    "text": " makes intuitive sense as a later follow-up time is informative about the survival probabilities at all prior times whereas an earlier follow-up time is not informative about survival probabilities at later time um where it gets in the final uh simulation brings in the random sampling plus the preference element",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4140.11,
    "end": 4169.273,
    "text": " here's where the symmetry is broken to also want the measurement of survival as more likely than death which is how the preferences are specified in active inference and then the policy switch is reflected in this like part where the observations are shifted later because there's less than a threshold of information to gain by having them earlier and then they",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4169.253,
    "end": 4184.089,
    "text": " even if there is equal variance I'm not exactly sure we can ask between the two branches there's an over sampling for the group with the higher survival which in this case was the placebo group so anything to add on this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.082,
    "end": 4198.903,
    "text": " Yeah, I think this is the crux of the whole making sure that you optimize the patient's outcome on this because the treatments in this scenario were not beneficial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.923,
    "end": 4200.085,
    "text": "They're actually harmful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4200.545,
    "end": 4209.739,
    "text": "And so throughout the course of the study, by utilizing this model, you actually randomized more people into the placebo group, which caused a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.719,
    "end": 4231.018,
    "text": " greater survival of these uh individuals and so you're you can already see the effect that this sort of methodology has on clinical trials because you're optimizing the outcome and i think that is exactly what you want to do in these health decisions in these trials in these things that impact human health",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4230.998,
    "end": 4256.145,
    "text": " or humanity in general you want to optimize the outcome uh and you know in this way you're actually reducing the overall harm to patients yeah interesting um here's the specification for the information game so uh bringing in the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.425,
    "end": 4285.204,
    "text": " form of the message is required for equation three now with all these extra components that have been added in with time variability demographic and the sampling they write out some of the technical details for the approximations in the variational Laplace and then some aspects about those models which we can ask about but figure 11 basically shows the big",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.403,
    "end": 4307.26,
    "text": " change which is that as you go from having a flat sampling distribution across time and across treatment groups you can actually do better than that basically by choosing a sampling regime that makes sense given the costs of sampling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4307.948,
    "end": 4319.129,
    "text": " So that's just very interesting because it really does look like given the possibility for these two lines to diverge, their divergence would be largest later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4319.99,
    "end": 4323.156,
    "text": "Whereas if you could only schedule like one check,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.558,
    "end": 4349.093,
    "text": " for every person if it was something that was expected to happen later in life then sampling all the young wouldn't even make sense so then one approach is like flat sampling but that is kind of sometimes erroneously called uh like unbiased or or uninformative but it is very informative and then this is pointing towards how there can be better sampling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.14,
    "end": 4372.684,
    "text": " than just trying to go flat across the entire latent state estimate if there are priors relating to something they can be leveraged as part of the probabilistic sampling and adapted to the data set at the in the end however for picking prior families for the active data selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4373.592,
    "end": 4378.759,
    "text": " that's a big question about how much it will change how the algorithms work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.199,
    "end": 4382.663,
    "text": "So I guess that kind of takes us to the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4385.687,
    "end": 4402.148,
    "text": "The paper's focus has been on illustrating how we might make use of information-seeking objectives, augmented with costs, which gave kind of the exit criterion, or preferences, which gives the biased, pragmatic part of data selection, to choose the best data to optimize our inferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.837,
    "end": 4414.095,
    "text": " and they highlight that the maximum entropy would yield identical results in several of our examples so that'll be interesting like what were the examples where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.413,
    "end": 4439.442,
    "text": " maximum entropy and the information gain are identical and then what are the real world or the statistical settings when the variance around predicted outcomes is inhomogeneous how does the full cognitive epistemic model based objective do differently than the max and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.772,
    "end": 4444.281,
    "text": " distribution dispersal kind of null hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.404,
    "end": 4446.588,
    "text": "Any thoughts on this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.994,
    "end": 4450.478,
    "text": "I think you've captured it very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.825,
    "end": 4458.332,
    "text": " Okay, then there are several technical points worth considering for how we might advance the concepts reviewed in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4458.352,
    "end": 4460.074,
    "text": "So let's talk about each of these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4460.855,
    "end": 4463.198,
    "text": "One, refinement of the active selection process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.898,
    "end": 4468.183,
    "text": "Two, empirical evaluation of active versus alternative sampling methods.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4468.383,
    "end": 4472.128,
    "text": "And three, identifying the appropriate cost functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.748,
    "end": 4475.631,
    "text": "So we'll talk about those coming up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.812,
    "end": 4478.895,
    "text": "Conclusion, here's the entire conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4480.613,
    "end": 4488.184,
    "text": " The key ideas involved an appeal to foveal like sampling of small portions of the total available data to minimize computational cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4488.945,
    "end": 4491.348,
    "text": "That's a very cool way to put it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4492.189,
    "end": 4504.967,
    "text": "And it highlights that kind of like sequential scanning, but also opens up some very exciting directions about how efficient that could be for some but not other kinds of problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.521,
    "end": 4514.093,
    "text": " and how those problems could be identified or those patterns could be filtered for to where different kinds of circadian models would be adaptive or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.473,
    "end": 4516.856,
    "text": "So like these are all fun discussions we'll have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.878,
    "end": 4533.098,
    "text": "And then they kind of brought all the theoretical components together at the end with the Bayes adaptive clinical trial, with the costs of sampling, constraints on sampling, and also the preference for survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4534.833,
    "end": 4538.999,
    "text": " what are your overall thoughts or what are you excited about for the ones to come?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4540.581,
    "end": 4544.266,
    "text": "I'm excited to kind of see, I mean, this is a fairly recent paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.287,
    "end": 4548.933,
    "text": "I'm excited to see kind of where they have gone since this paper was published.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4548.973,
    "end": 4552.218,
    "text": "You know, they had a number of kind of next directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4552.759,
    "end": 4561.431,
    "text": "I would love to see what are those directions that they've taken, what they've compared it to, other sampling techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.411,
    "end": 4576.602,
    "text": " um this show shows a lot of promise going forward for very complex and you know ethical uh situations or situations where ethics are going to be a huge component so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.582,
    "end": 4598.708,
    "text": " kind of where that is what they're going into and kind of where they see you know further improvements i still kind of want to know what would happen or what of these other time metrics um or what other situations these time metrics uh would our alternative time models would be applicable to or if this really is like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4599.059,
    "end": 4603.204,
    "text": " the de facto, just the way it needs to be done, totally, totally fair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4603.224,
    "end": 4605.026,
    "text": "I think that could very well be the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.046,
    "end": 4610.833,
    "text": "I would just love to hear exactly if you did a hidden Markov model, how would that look?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4611.253,
    "end": 4615.939,
    "text": "Is there a benefit of that over the selection that they have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.199,
    "end": 4619.443,
    "text": "Does it provide more or less versatility in the models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4620.344,
    "end": 4623.808,
    "text": "These are things that are going to be, I think, very interesting going forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.848,
    "end": 4626.231,
    "text": "And then how do we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.274,
    "end": 4632.181,
    "text": " like you noted in the discussion, how do you optimize those cost functions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.281,
    "end": 4633.322,
    "text": "What's a cost?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.562,
    "end": 4637.668,
    "text": "You know, you're dealing with clinical trials, it's a human life, that's a cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.868,
    "end": 4638.829,
    "text": "Time, it's a cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.21,
    "end": 4641.753,
    "text": "But there's also just computer time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.773,
    "end": 4647.14,
    "text": "How much you can actually get, how much compute you can get in a given moment of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.18,
    "end": 4656.673,
    "text": "Some of these machine learning models that you might want to apply this to or, you know, select data going into, sometimes takes a long time to train.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4656.788,
    "end": 4662.337,
    "text": " How are you going to sample data that's going into those models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4662.377,
    "end": 4668.287,
    "text": "How are you going to continually feed those models appropriate data going forward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.347,
    "end": 4673.736,
    "text": "So this is a huge broad category of directions that you can go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.816,
    "end": 4681.108,
    "text": "Clinical trials was a very wonderful example of a complex situation that is, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.308,
    "end": 4683.15,
    "text": " right there applicable to human life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.131,
    "end": 4686.894,
    "text": "But then you also have just data science in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4687.174,
    "end": 4691.398,
    "text": "How are you going to utilize this to going more broad?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4691.659,
    "end": 4694.822,
    "text": "How are you going to utilize this just going forward in any data sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.302,
    "end": 4696.023,
    "text": "Data is growing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4696.323,
    "end": 4697.284,
    "text": "It will continue to grow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.405,
    "end": 4698.766,
    "text": "It will never really stop growing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.447,
    "end": 4705.933,
    "text": "So it's going to be more and more important going forward to have these methods more broadly used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.274,
    "end": 4707.675,
    "text": "And random's nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4707.955,
    "end": 4710.538,
    "text": "Random's really, really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.261,
    "end": 4718.568,
    "text": " But this holds a lot of promise to being... I would love to just hear their thoughts on where that's going, where they see that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4721.811,
    "end": 4722.172,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4723.573,
    "end": 4726.155,
    "text": "A lot of interesting directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4726.516,
    "end": 4738.247,
    "text": "A few things that made me think of, one was about search and about relational search concepts, page rank and everything, syntactic, semantic, new kinds of search algorithms and personalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.295,
    "end": 4763.273,
    "text": " for search and learning and updating and to what extent like explicit cognitive modeling would change the way that different recommendation algorithms or different kinds of um computer systems would work i'll read a question um and then any any other questions otherwise this is our last slide so thank you christopher um okay glia maximalist wrote",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.721,
    "end": 4768.433,
    "text": " Interesting point about biased and unbiased sampling schemes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4768.774,
    "end": 4774.814,
    "text": "Perhaps this points out the fact that unbiased approaches are the wrong thing to strive for in research study design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4776.279,
    "end": 4777.262,
    "text": "What do you think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4778.322,
    "end": 4781.025,
    "text": " Unbiased research in study design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.045,
    "end": 4787.031,
    "text": "I think there's a time and place for unbiased, and I think there's a time and place for bias.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.632,
    "end": 4797.202,
    "text": "I think that when you accept a bias into your model or take bias out of your model, you need to understand why you're doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.723,
    "end": 4804.65,
    "text": "Certain bias you don't want to have, researcher bias is something that's a huge bias that you want to not have, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.339,
    "end": 4818.04,
    "text": " But in certain cases, like in this paper, where you actually do want to have a bias, you want to make an intelligent decision, note while you're making that decision, call it out, and then build it into your model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.06,
    "end": 4821.085,
    "text": "That would be my thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4821.105,
    "end": 4822.146,
    "text": "Yeah, that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.166,
    "end": 4832.443,
    "text": "Like there are certain statistical distributions, the bias or the constraints on which define the research study, whereas other ones that can have an explicitly, strictly negative bias.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4833.082,
    "end": 4860.608,
    "text": " like data loss or something but then the trade-offs of how that distribution actually interacts with others can enter into this more complex experimental calculus that relates to like well all these different experimental factors and so the optimal experiment for for different labs or different moments for the lab could look extremely different and that's going to be the case",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4860.773,
    "end": 4869.746,
    "text": " There's going to be dispersed behavior either way, but then the question is, how is that actually driven in a way that is doing better than drawing from distributions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4870.787,
    "end": 4875.814,
    "text": "However, even that does interestingly well for the right variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.897,
    "end": 4879.9,
    "text": "And you can mine bias all over the place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4880.741,
    "end": 4884.847,
    "text": "Bias in data design in experiments can be very useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.868,
    "end": 4886.87,
    "text": "So it'll just be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4886.91,
    "end": 4889.093,
    "text": "I think it'll be case by case is the way I see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.941,
    "end": 4901.709,
    "text": " OK, well, do you have any last comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.729,
    "end": 4907.637,
    "text": "I think that the main thing here is I'm just very excited to see this paper come out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.777,
    "end": 4916.429,
    "text": "I would love to see how this is going to evolve over time, see if this can be applied to different technologies, different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.31,
    "end": 4924.48,
    "text": "I'm really excited just to see where this is going, because I think this is just right on the cusp of what's needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.248,
    "end": 4926.83,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4926.85,
    "end": 4927.212,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4927.392,
    "end": 4927.713,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4927.854,
    "end": 4928.958,
    "text": "We will look forward to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.223,
    "end": 4930.604,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4931.788,
    "end": 4932.069,
    "text": "See you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4933.093,
    "end": 4933.354,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4933.374,
    "end": 4933.896,
    "text": "Thanks, guys.",
    "speaker": "SPEAKER_01"
  }
]