[
  {
    "start": 8.705,
    "end": 10.728,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.748,
    "end": 12.21,
    "text": "It's May 28th, 2024.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.27,
    "end": 15.354,
    "text": "We're in Active Livestream 57.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.217,
    "end": 18.779,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.38,
    "end": 24.467,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.328,
    "end": 27.571,
    "text": "This is a recorded and archived livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.192,
    "end": 30.755,
    "text": "Please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.597,
    "end": 37.024,
    "text": "All backgrounds and perspectives are welcome and will follow video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.342,
    "end": 41.566,
    "text": " Check out ActiveInference.org to learn more about live streams and other projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.448,
    "end": 54.278,
    "text": "Okay, today in 57.1, we're continuing the discussion of the paper on active data selection and information seeking with Carl Fristen and Thomas Parr joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.878,
    "end": 56.299,
    "text": "So thank you both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.561,
    "end": 65.728,
    "text": "We did 57.0 covering some of the background and to begin the 57.1, whoever would like to go first, how about Thomas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.873,
    "end": 77.22,
    "text": " lead us into the active data selection setting slash challenge and introduce yourself however you would like thank you though and go for it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.546,
    "end": 82.472,
    "text": " Okay, so to introduce myself, I'm Thomas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 82.732,
    "end": 100.187,
    "text": "I've been working in active infants for a few years and I split my time between research and clinical practice, which I think is part of the motivation for some of the later parts of this paper that relate to some of the clinical type problems that we might face with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.336,
    "end": 124.656,
    "text": " I guess the background of this particular paper is that a couple of years ago I was in Australia to present at the Australasian Basin Network Modelling Society, if I've got that right, who ran a really fascinating conference using basin networks to model everything from volcanoes to coastal erosion and various other things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 124.788,
    "end": 132.24,
    "text": " And there are quite a few clinicians involved in that conference as well and interested in things like respiratory diseases and diagnostics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.482,
    "end": 140.834,
    "text": "And one of the organizers of that conference happened to be running a special issue on basic networks and kind of invited us to take part in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 141.054,
    "end": 143.438,
    "text": "And so this was our contribution to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 143.823,
    "end": 160.862,
    "text": " And the idea is to take some of the same principles that we use in active inference and some of the long-standing principles from people like to apply to the problem of experimental design and to think about how active inference-like principles can be applied outside of biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 166.629,
    "end": 168.211,
    "text": "Sorry, I'm talking too fast for you to type.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 171.795,
    "end": 173.577,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.607,
    "end": 175.37,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.39,
    "end": 181.42,
    "text": "Carl, do you want to add anything to that, or as we kind of begin?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.64,
    "end": 185.246,
    "text": "No, no, no, I repeat, I'm an admiring spectator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.306,
    "end": 187.49,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.011,
    "end": 198.568,
    "text": "I enjoy Thomas's lucid account of this very pertinent application of some basic principles of optimal Bayesian design and epistemic foraging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.51,
    "end": 212.018,
    "text": " okay then no heckling okay let's go to some of chris's questions and also as people ask questions in the live chat we'll go in there um okay so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.137,
    "end": 217.599,
    "text": " Let's just start with time sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.18,
    "end": 230.05,
    "text": "How did you or in what equations or in what conceptual ways did you bring in time and the kind of time sampling that was explored in this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.313,
    "end": 243.102,
    "text": "So time is a really interesting issue in terms of how you model a lot of these sorts of processes, partly because a lot of interesting processes evolve in time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 243.385,
    "end": 251.151,
    "text": " but it also brings in some really interesting issues in terms of how you sample and how you gather information about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 252.397,
    "end": 257.846,
    "text": " And the most obvious problem there is that some things change and some things don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 258.848,
    "end": 265.398,
    "text": "So that brings you into the world of a lot of what psychologists often deal with, things like inhibition of return.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.458,
    "end": 270.006,
    "text": "The idea that when you look at something, you learn something about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 272.109,
    "end": 278.64,
    "text": "The time it takes for it to be worth looking back there will depend on how unexpectedly things might change in that location.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.734,
    "end": 290.554,
    "text": " So that's a really important part of a lot of the sorts of generative models that we deal with both in biology and out of that area, because you need to be able to deal with worlds that change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 292.154,
    "end": 296.881,
    "text": " And that sort of calls into question, how do you actually approach time in generative models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.242,
    "end": 300.667,
    "text": "There are a whole range of different approaches that one can take to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 301.929,
    "end": 319.495,
    "text": "So I think a lot of early work in active inference was formulated in terms of continuous time models, working with differential equations, generalized coordinates of motion, which is a way of representing trajectories in terms of positions, velocities, accelerations, as if you're doing a Taylor series expansion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 319.947,
    "end": 322.392,
    "text": " and taking the coefficients of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 322.592,
    "end": 325.878,
    "text": "And that would be one very good way of representing a temporal progression.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 327.321,
    "end": 337.72,
    "text": "A lot of the more recent work we do in Active Influence is based upon discrete time models, where you see things as being a sequence of events and you just represent what happens at a sequence of different time points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 338.797,
    "end": 353.818,
    "text": " In this particular paper, we ended up using a slightly different approach and that was to essentially use a basis set or a set of basis functions to allow there to be some smooth progressions in time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 354.288,
    "end": 358.293,
    "text": " rather than dealing with specific time steps themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.633,
    "end": 370.688,
    "text": "It sort of blurs the gap between using discrete time steps where there's a clear boundary on the side of it and continuous progressions where there's no boundaries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 370.888,
    "end": 380.7,
    "text": "By using a series of basis functions placed at different points in time, you end up getting this sort of smooth progression from one blurry time step to the next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 381.254,
    "end": 397.497,
    "text": " So I think time is sort of incredibly important in how we think about these sorts of things, again, in terms of thinking about how things change, but also in terms of thinking what's the right way even of representing time in a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 404.527,
    "end": 405.308,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.328,
    "end": 406.89,
    "text": "Welcome, Chris, as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.676,
    "end": 415.785,
    "text": " This definitely is reminiscent of figure 4.3 from the textbook, which I'll bring up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.146,
    "end": 423.035,
    "text": "How would you contrast it, or which figure should we look at to explore which variables are continuous or discrete?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.641,
    "end": 430.144,
    "text": "This figure is the one, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 431.407,
    "end": 434.371,
    "text": " So this paper won't have anything specific, but you're right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 434.391,
    "end": 438.616,
    "text": "There probably is one from the textbook that deals with exactly this distinction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 439.977,
    "end": 447.166,
    "text": "So here, I think one of the later figures does use a sort of basis set type representation to look at temple progressions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 450.991,
    "end": 452.513,
    "text": "I can't remember which figure that is, I'm afraid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 454.395,
    "end": 456.958,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 458.069,
    "end": 461.014,
    "text": " Did you want to talk through this figure that's up at the moment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.415,
    "end": 463.037,
    "text": "Yeah, maybe summarize this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.961,
    "end": 480.988,
    "text": "So this figure was trying to demonstrate in a sort of relatively simple analytic case what it might mean, and sort of taking time out of it for the moment, what it might mean to select those data points that are going to be most informative about some underlying model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 481.542,
    "end": 496.466,
    "text": " And the way it's been set up here is to start with, so in the sort of upper left plot here, we're just showing a function with a whole series of different possible parameters that might exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 496.606,
    "end": 504.799,
    "text": "So you can imagine these theta parameters that are sort of shown as one being bigger than the next, each represent which function might be used here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 505.673,
    "end": 513.303,
    "text": " And you can see that in some of those, there's a lot of variation in certain parts of the function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 513.483,
    "end": 521.213,
    "text": "So the green one, you can see there's a sort of very big peak around zero, but a slightly smaller peak for the purple one, slightly smaller for the yellow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 523.095,
    "end": 529.604,
    "text": "But actually, there are also certain points where it's not so obvious, and you wouldn't really be able to distinguish it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 529.624,
    "end": 533.048,
    "text": "So they all more or less cross the x-axis at the same point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 535.289,
    "end": 537.734,
    "text": " and on both sides of zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 538.535,
    "end": 555.627,
    "text": "So if you were to choose somewhere on this plot to work out which function you are sampling from, you're much better off choosing from somewhere around zero than you are choosing at the points where it's actually crossing the x-axis, where all look very, very similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 556.248,
    "end": 571.024,
    "text": " And so this is just to get across the intuition behind this process of selecting your data efficiently to be able to resolve between alternative hypotheses the best you can, or even to estimate along some continuous parameter value, as it would be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 572.686,
    "end": 583.858,
    "text": "So following the sort of sequence around this graphic, the idea is that we can represent these things in terms of several different kinds of generative models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 584.446,
    "end": 602.392,
    "text": " So here we're representing either a Bayesian network where you say my explanatory variable is this theta that's generating some data y. And then we have this pi variable, which, like in a lot of active inference notation, represents our policy or our choice of where we want to sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.412,
    "end": 613.288,
    "text": "So here this is choosing somewhere along the x-axis that we might want to work out what the corresponding y might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.572,
    "end": 623.346,
    "text": " The factor graph representation deals with exactly the same model, but now expressed by putting the factors in explicitly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 623.706,
    "end": 642.313,
    "text": "And by factors I mean that our probability distribution, which is made up of our prior beliefs about theta, and our likelihood, which maps from theta to our data y, are now sort of explicitly put in as squares that represent the different bits of that generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 644.183,
    "end": 652.393,
    "text": " And the next step is to use a normal or a fawny factor graph, which essentially just omits the circles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 652.894,
    "end": 657.9,
    "text": "So now the variables are represented by the edges, the points that connect the different factors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 658.721,
    "end": 671.237,
    "text": "So you can imagine if we take our probability distributions, the probability of latent states or parameters, and the probability of the data given them, and we separate those out into factors,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 671.69,
    "end": 679.04,
    "text": " And we draw a square for each of the factors of that probability distribution and connect those up whenever they share a variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 679.401,
    "end": 684.528,
    "text": "So the edges or the connections between the factors are the random variables we might want to estimate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 686.29,
    "end": 690.576,
    "text": "And then I'm trying to see behind the cameras.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 691.147,
    "end": 708.818,
    "text": " So the next step is to use the Forney factor graph because it's often quite a nice notation to use when trying to understand message passing and the different things that contribute to the way we estimate these variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 709.625,
    "end": 715.433,
    "text": " So here, for each different square, we can see there being messages being passed between the neighboring edges.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 716.715,
    "end": 725.427,
    "text": "And when we combine those edges, we can arrive at a posterior estimate of the marginal of the variable we're dealing with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 725.447,
    "end": 728.331,
    "text": "So this would be how we might go about estimating the theta there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 729.833,
    "end": 738.045,
    "text": "But the key twist here is that we're now not just interested in message passing for the process of inference, but we can also now start to interpret those messages",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 738.278,
    "end": 746.152,
    "text": " in terms of how they contribute to various different entropies that together make up our information game.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 746.172,
    "end": 759.797,
    "text": "So here we have both a conditional entropy, which we sometimes refer to as an ambiguity, and that conditional entropy essentially says, if I were to sample over here, in a more biological setting, if I were to look over here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 760.857,
    "end": 764.525,
    "text": " How confident am I in terms of what I would see?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 764.886,
    "end": 770.499,
    "text": "How confident am I that the parameters will map to something meaningful and informative?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 772.544,
    "end": 779.44,
    "text": "The predictive entropy is another form of entropy or uncertainty that essentially says, before I've looked anywhere,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 780.179,
    "end": 785.609,
    "text": " regardless of its parameters, even if I've marginalized them out, how uncertain am I about the data I'm going to get?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.25,
    "end": 792.221,
    "text": "So the conditional entropy is how precise is the mapping or how imprecise is the mapping between parameters and data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 793.083,
    "end": 799.234,
    "text": "Predictive entropy is just my uncertainty a priori about what I'd see if I looked over there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 801.61,
    "end": 818.289,
    "text": " Those things are quite interpretable when you start thinking in terms of experimental science, because a predictive entropy, if I'm already very certain about what I'd see or what would happen if I performed a particular experiment, there's almost no point in doing that experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 818.93,
    "end": 823.635,
    "text": "There's only a point acting to find something out if I don't already know what I'm going to observe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 825.05,
    "end": 833.059,
    "text": " So this predictive entropy is a positive thing that if I'm uncertain about what I'd see, then I should go out and seek that out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 833.119,
    "end": 836.583,
    "text": "I should get those data points because there's something potentially to learn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 838.486,
    "end": 848.357,
    "text": "However, there are certain circumstances where all you get is noise and you may be completely uncertain about what you're going to get.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.911,
    "end": 855.379,
    "text": " just keep running a random number generator over and over again, you're never going to become much more certain about what you're going to see next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 856.561,
    "end": 859.885,
    "text": "And so that's not a terribly useful thing to seek out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 860.025,
    "end": 867.695,
    "text": "And that's where this conditional entropy or ambiguity comes in, in that it penalizes those things that are not going to resolve any uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 868.556,
    "end": 874.564,
    "text": "So the way I often think about it is if you take predictive entropy, you have the total amount of uncertainty about what I'm going to observe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 875.371,
    "end": 883.187,
    "text": " If you then subtract the conditional entropy from that, then you're left with the amount of uncertainty that you might be able to resolve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 884.146,
    "end": 890.432,
    "text": " And I think this comes back in a bit more detail, and we can discuss that a little bit more in some of the later figures if we can get to those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 891.473,
    "end": 902.384,
    "text": "But essentially the difference between these two things is our expected information gain, which is also a mutual information, which can often be expressed as the difference between those two attributes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 903.045,
    "end": 904.907,
    "text": "How much am I going to update my beliefs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 905.167,
    "end": 910.272,
    "text": "How much am I going to change what I believe as a consequence of making a particular observation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 913.137,
    "end": 913.998,
    "text": " Thank you, Thomas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.418,
    "end": 916.641,
    "text": "That was a great summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.681,
    "end": 917.922,
    "text": "I think we'll return to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.423,
    "end": 922.087,
    "text": "I wanted to bring up figure 4.3 from the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.469,
    "end": 924.87,
    "text": "Ah, yes, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 925.571,
    "end": 942.891,
    "text": "And yes, anything on this and to kind of juxtapose the conditional entropy with the A matrix and the sensemaking and the mapping and then the predictive entropy to the B matrix and the transition among latent states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.744,
    "end": 945.685,
    "text": " Yes, that's right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 947.368,
    "end": 957.803,
    "text": "For those who haven't seen these before, these are again factor graph type representations where we're now dealing with temporal progressions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 958.804,
    "end": 965.233,
    "text": "The graph at the top represents a series of states as they transition from one to the next over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 965.213,
    "end": 968.298,
    "text": " there may be more or less uncertainty in those transitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 968.398,
    "end": 974.689,
    "text": "So I might be very confident as to how a sequence progresses if there's very low volatility, dynamics are very precise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 977.033,
    "end": 980.459,
    "text": "And so those are the factors labeled three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 980.499,
    "end": 987.711,
    "text": "The factors labeled two represent the way in which my data are generated given some states of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 988.18,
    "end": 994.229,
    "text": " So I might not be able to directly observe the S's, but they will give rise to the O's or the observable outcomes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 995.27,
    "end": 1007.708,
    "text": "And exactly as Daniel says, there's a link between the two different terms in this expected information game.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.329,
    "end": 1019.866,
    "text": " So the conditional entry will depend almost entirely upon this mapping from states to outcomes upon this conditional entry will depend upon this likelihood distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1022.55,
    "end": 1031.022,
    "text": "And so it will say that if I'm in this state, then there's a very precise mapping to the data, whereas in alternative states, there might not be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.903,
    "end": 1038.032,
    "text": "And so that allows me to select between these things based upon policy pi I choose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1039.582,
    "end": 1045.771,
    "text": " the predictive entropy will actually be a function of both forms of uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.791,
    "end": 1047.413,
    "text": "So uncertainty in the transitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1047.913,
    "end": 1054.843,
    "text": "So if things change a lot since I last looked there, then my predictive entropy might be very high and I might want to look back there sooner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1056.786,
    "end": 1060.331,
    "text": "Again, in psychological terms, that's a... Sorry, the lights have gone off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1060.351,
    "end": 1061.592,
    "text": "I'll see if I can turn those back on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1064.456,
    "end": 1067.901,
    "text": "So the predictive entropy...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1068.488,
    "end": 1074.737,
    "text": " deals with that sort of inhibition of return if it's due to the transition uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1075.198,
    "end": 1084.171,
    "text": "However, if it's due to the uncertainty in the likelihood, then that will remain relatively fixed over time, and I won't be able to resolve that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1085.553,
    "end": 1087.276,
    "text": "Sorry, let me see if I can sort out those lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1095.948,
    "end": 1096.369,
    "text": "It's better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1099.285,
    "end": 1108.517,
    "text": " So the figure on the lower part of the screen, so the lower graph, is actually a similar representation, but now in continuous time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.598,
    "end": 1113.923,
    "text": "So here we're dealing with the states x might be continuous variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1114.664,
    "end": 1123.455,
    "text": "The x prime is the rate of change of my state x. The x double prime is the acceleration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1124.176,
    "end": 1127.841,
    "text": "And if you know all of these things and further coordinates of motion,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1128.395,
    "end": 1140.558,
    "text": " you can start to construct a trajectory or predict, anticipate both the future or the near future based upon these variables and the recent past as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1141.92,
    "end": 1148.833,
    "text": "And exactly as Daniel's written there, it's effectively a Taylor series expansion where these are the coefficients of that Taylor series.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1155.378,
    "end": 1162.246,
    "text": " So these would be sort of the two ends of the spectrum dealing with sort of a purely discrete time process and a continuous time process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.427,
    "end": 1168.855,
    "text": "There are various ways of either blurring those boundaries or even combining the two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1170.316,
    "end": 1183.933,
    "text": "So maybe now, having brought this out, could you return to the basis sets and comment on how it's similar or different to the time handling in the discrete time or the continuous time settings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.314,
    "end": 1195.664,
    "text": " Yeah, so the use of basis sets will often imply that you're dealing with a continuous function, but rather than have variables that represent either positions and velocities and those things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1196.345,
    "end": 1201.53,
    "text": "I mean, one could argue that actually a generalized coordinates and motion system is a form of basis set in itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1201.71,
    "end": 1203.753,
    "text": "It's just a polynomial basis set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1204.213,
    "end": 1211.22,
    "text": "So you're just weighting sums of different orders in a polynomial series.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1211.943,
    "end": 1227.42,
    "text": " But there are other basis sets that one could use, and those include things like Fourier basis sets or cosine basis sets, where it would be difficult to sort of localize things in a specific point in time, but it's much more frequency based.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1228.058,
    "end": 1235.79,
    "text": " or as happens to be done in this particular paper, it's a series of Gaussian basis functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1236.751,
    "end": 1245.625,
    "text": "And those are centered on different points in time, but because they're Gaussian shaped, the boundaries between them are a little bit blurred.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1246.406,
    "end": 1256.682,
    "text": "So the value at any particular point, how much you weight that particular function localized around a specific time point will also have an effect on the neighboring time points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1257.067,
    "end": 1266.181,
    "text": " And that's effectively a way of putting in a prior belief that although there's a temporal progression and perhaps a series of discrete steps, there's actually a smoothness to that as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1267.083,
    "end": 1275.976,
    "text": "There are no discrete jumps in this, that actually I'm just adding, subtracting functions that vary smoothly to construct that overall picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.337,
    "end": 1281.505,
    "text": "And that gives you quite a flexible way of representing a lot of often quite nonlinear functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1284.522,
    "end": 1300.792,
    "text": " I think from memory that Arl actually used a sort of basis set type functions in some of the COVID modeling as well in some of the later papers to model things like seasonal fluctuations and changes in transmissibility at the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1301.874,
    "end": 1305.501,
    "text": "So there's quite a broad way of using this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.223,
    "end": 1320.891,
    "text": " The downside of using a lot of those functions is that they're often less mechanistically interpretable, so they're something that are often quite convenient in terms of getting a flexible function representation, but wouldn't necessarily speak to a specific mechanism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1323.638,
    "end": 1341.495,
    "text": " thank you thomas yeah also basis sets are brought up in spm and i think one advantage that's raised there is how it allows the pre-specification of all of the oscillatory patterns of a given frequency range",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.475,
    "end": 1365.711,
    "text": " and then filtering the data with that pre-specified sieve in a way um interesting and and compressing information about the hypothesis of what structure the data could have like nearby things being more related events in time being more related if they're close and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.691,
    "end": 1373.387,
    "text": " Yes, and compression is a good point there, that actually as soon as you start using a basis set, you've now got the option to stop after a certain number of functions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.97,
    "end": 1379.059,
    "text": "So in generalized coordinates of motion,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1379.9,
    "end": 1395.603,
    "text": " there's a limit to how many additional coordinates it's normally useful to put in because the degree of accumulation of the uncertainty means that once you're beyond a certain point, it becomes so uncertain that it doesn't necessarily contribute to the earlier terms of the sequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1396.645,
    "end": 1402.093,
    "text": "And that sort of arises as a function of autocorrelations over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.867,
    "end": 1412.479,
    "text": " And you're right to say that using things like frequency-based or Fourier-type basis sets also gives you that opportunity for compression.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.239,
    "end": 1431.962,
    "text": "And I think a lot of image processing does use things like the discrete cosine transform, which is based upon a series of cosine basis sets, where you can throw away certain orders of that or certain frequency bands without losing too much information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1434.727,
    "end": 1435.187,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.268,
    "end": 1446.418,
    "text": "Okay, let's go to a second question by Chris, but Carl or Chris, just raise your hand or totally go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.078,
    "end": 1447.939,
    "text": "Let's go to the second one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.221,
    "end": 1452.423,
    "text": "Let's ask this question by Upcycle Club.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.284,
    "end": 1463.653,
    "text": "Do you think that there might be any algorithmic modifications, meta heuristics or hybrid approaches that could potentially lead to even better data selection optimization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.206,
    "end": 1474.508,
    "text": " Probably.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1475.009,
    "end": 1484.119,
    "text": "I suppose it's a matter of thinking about what, so hybrid approaches, it's a question of what it's being hybrid with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1485.861,
    "end": 1490.326,
    "text": "And I imagine we may come on to some of those questions later on as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1492.728,
    "end": 1499.656,
    "text": "So meta heuristics, well, I suppose a heuristic from a basic perspective is just a prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1500.256,
    "end": 1500.897,
    "text": "And so I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1501.265,
    "end": 1509.335,
    "text": " it's exactly right to say that with the right priors in place for the right sorts of models and the right sorts of settings, this process can be made much more efficient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1510.497,
    "end": 1528.018,
    "text": "So if you know a reasonable amount about the structure of your problem, then you don't necessarily need to rely on basis sets and that sort of thing, but actually often you can write down something with a good deal of information in it already, and then your model doesn't necessarily need to learn all of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1528.078,
    "end": 1530.141,
    "text": "It's able to then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1530.779,
    "end": 1539.691,
    "text": " use the resulting predictive entropies and conditional entropies to pin down the more specific things that you want it to now find out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1543.676,
    "end": 1549.343,
    "text": "So yes, I'm sure that it's probably not going to be a one-size-fits-all in many ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1549.383,
    "end": 1556.433,
    "text": "The priors are going to be those that are most appropriate to the particular problem you're dealing with, the particular agent you have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1556.453,
    "end": 1558.255,
    "text": "But ultimately, they all, I think, lead",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1558.775,
    "end": 1571.634,
    "text": " come under the same underlying problem and the same underlying principle, which is that if you select things in order to optimize your model of the world, then it's about finding the best fit with your model of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1572.475,
    "end": 1578.184,
    "text": "And that fit would normally be quantified using something like a free energy or a marginal one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.805,
    "end": 1591.559,
    "text": " So I think it all comes from the same principle, but if you're a different sort of creature or a different sort of agent, then the implicit model, the way in which that directs your exploration to find out more, to improve your model fit can be very different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1598.887,
    "end": 1604.053,
    "text": "Chris or Carl want to ask anything or bring up anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.674,
    "end": 1609.637,
    "text": " Not quite yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1609.677,
    "end": 1614.83,
    "text": "I'm kind of thinking through, you know, talking about the time series and that sort of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1614.911,
    "end": 1617.056,
    "text": "So I think we can kind of keep going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.096,
    "end": 1620.566,
    "text": "Yeah, Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.576,
    "end": 1624.877,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.675,
    "end": 1644.503,
    "text": " Sorry, I was just thinking about heuristics and what it means to people in a certain kind of economics, something about giga renza and the like, which I just read as priors, the right kind of priors that have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.837,
    "end": 1669.039,
    "text": " a minimal complexity um but i was just talking my head what is a meta heuristic it's a heuristic next door to a heuristic so daniel or thomas can somebody defy for me hyper prior perhaps yes that's what it must be it must be a hybrid prime that's what i'd assume okay thank you although you know what even is a hyper prior it's effectively just a prior isn't it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.116,
    "end": 1676.11,
    "text": " Yeah, I suppose it's a prior in the context of a certain kind of hierarchical generative model, absolutely, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.38,
    "end": 1691.012,
    "text": " Also, there's a very practical element, I think, about chapter six of the textbook and the recipe for modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.713,
    "end": 1709.742,
    "text": "So maybe to kind of bring in this practical element in the modeling of these adaptive data sampling, what is the recipe for active inference generative modeling, maybe even as you've learned or updated in the two years since chapter six?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.451,
    "end": 1715.555,
    "text": " I mean, I think the basic recipe is still the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1717.078,
    "end": 1731.865,
    "text": "So often I think what we do is think about what sort of model that we're interested in and what sort of question that's supposed to address.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1732.823,
    "end": 1760.957,
    "text": " and ultimately when you're using modeling in the context of data, the sorts of questions you might want to ask are things like which of several alternative models is the best explanation, so doing a sort of discrete hypothesis test, or trying to actually recover particular parameter estimates, so coming up with posterior distributions over",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1761.562,
    "end": 1767.21,
    "text": " in an active inference context, that will be over particular kinds of beliefs that then determine behaviour.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.592,
    "end": 1790.505,
    "text": "And that's particularly important in the context of things like computational phenotyping in clinical populations, so trying to understand which beliefs might be, and by beliefs I mean sort of implicit Bayesian beliefs, not necessarily something explicit that you might be able to articulate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1790.89,
    "end": 1798.68,
    "text": " but what sort of beliefs might vary between different populations that then lead to particular kinds of what we might think of as pathological behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1799.862,
    "end": 1810.195,
    "text": "And so you can start to then ask questions in terms of if you can phenotype different people, you can start to use those beliefs almost as if they were data that you can then ask other questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1810.416,
    "end": 1814.881,
    "text": "So how does this vary with a particular diagnosis of therapeutic intervention?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1817.885,
    "end": 1818.366,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1819.865,
    "end": 1834.742,
    "text": " There was a figure in the book, which I can't remember the sequence of now, setting out the sort of sequence that you might follow if you were trying to develop a model and then use that to actually answer a question based upon some empirical data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1835.402,
    "end": 1838.826,
    "text": "But I think the key idea is, are you going to bring that up?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1840.048,
    "end": 1843.071,
    "text": "I think the key idea was if you have your model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.473,
    "end": 1868.957,
    "text": " predict some behavior from it you can then use use that model of that is effectively someone's brains model of the world but then you're modeling someone else modeling the world and here we are yeah so I think in the this one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1871.536,
    "end": 1885.229,
    "text": " So the figure you've sort of copied into the lower left there is quite a nice way of thinking about this process in active inference of modelling other people or things doing modelling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1886.49,
    "end": 1892.616,
    "text": "So someone's brain that you're trying to explain is itself modelling the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1892.636,
    "end": 1901.104,
    "text": "So from that brain's perspective, the data that need to be explained are sensory data, so visual data, somatosensory data, auditory data, whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1901.405,
    "end": 1914.705,
    "text": " And then as a scientist, you're trying to explain the way in which that brain is behaving and generating behavioral outputs or electrophysiological signals or whatever you might be measuring as a neuroscientist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1915.327,
    "end": 1920.773,
    "text": " And so my model of this brain's model ends up becoming the key thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1921.273,
    "end": 1924.096,
    "text": "And that's sort of sketched out in this particular figure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1925.498,
    "end": 1936.049,
    "text": "And the other figure that you had up for a moment, sort of talking through the sequence that one might adopt in terms of how you might construct this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1936.069,
    "end": 1939.733,
    "text": "And it's not necessarily linear, I think, as the arrows show.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1940.934,
    "end": 1944.658,
    "text": "But essentially you need to think about what sort of task you want to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1944.908,
    "end": 1947.433,
    "text": " form or what experiments you want to form.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1948.695,
    "end": 1950.779,
    "text": "You need to think about what model that's optimising.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1951.982,
    "end": 1961.5,
    "text": "And here it's showing the partially observed Markov decision process model, which might in this case be the internal model of, as shown here, a rat in a maze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1963.083,
    "end": 1974.577,
    "text": " From that, you then need to construct a likelihood function which says, given that the rat had this sort of model and these parameters in it, what's the likelihood that it would behave in a particular way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1975.018,
    "end": 1982.948,
    "text": "So that p of u is the probability that they would have behaved in a particular way given that model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1984.109,
    "end": 1988.835,
    "text": " And then we might equip that likelihood with some prior beliefs about parameters in that RATS model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1989.776,
    "end": 1996.786,
    "text": "And combining the prior and the likelihood, we can then invert that model in much the same way we do any other sort of Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1998.648,
    "end": 2001.872,
    "text": "And there are further analyses we could then do on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2001.892,
    "end": 2005.577,
    "text": "So this is what I was sketching out earlier on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2005.928,
    "end": 2023.472,
    "text": " If you have parameter estimates and you know the posteriors for a number of different rats in a maze or patient populations or even artificial systems of some sort, you can then perform other analyses on that almost as if those posteriors were data points themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.612,
    "end": 2030.822,
    "text": "And you can start to ask, how do these beliefs vary as a function of diagnosis or experimental condition or whatever else?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2038.008,
    "end": 2048.49,
    "text": " thank you okay let's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.652,
    "end": 2078.697,
    "text": " in the in these beginning parts focus on what the model is and then as we kind of move towards the ends in the second time talking we'll look more at the clinical trial and maybe the questions with um that are more open for the future how about connection with machine learning so chris wrote um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.677,
    "end": 2082.961,
    "text": " Your examples primarily focus on statistical modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.382,
    "end": 2091.71,
    "text": "How do you see active data selection methods integrating with other machine learning models, especially deep learning architectures that typically require large data sets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.15,
    "end": 2095.233,
    "text": "Are there specific challenges or considerations in this context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.535,
    "end": 2106.844,
    "text": "I mean, I would argue that almost in a sense, the answers in the question that these large data sets that they often seem to require",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.415,
    "end": 2113.87,
    "text": " is exactly the opposite sort of principle as to what we'd be working with in this sort of paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2114.812,
    "end": 2118.661,
    "text": "So the idea is how do I work with more efficient datasets?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.822,
    "end": 2125.778,
    "text": "How do I design not just models, but also the selection of data to make sure that even with a smaller dataset, it can be more informative?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.838,
    "end": 2142.062,
    "text": " So I think there's a bit of a difference in the underlying philosophy, but I would also say that most machine learning models are forms of statistical modeling in some sense, whether or not they explicitly represent the uncertainty that you get out of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2143.223,
    "end": 2152.135,
    "text": " I mean, I think it is also worth, you know, the comment about hybrid approaches that was discussed in one of the previous questions as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2152.776,
    "end": 2164.932,
    "text": "One way of thinking about that might be in terms of using things like neural network architectures and function approximators as part of a basinal statistical model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.193,
    "end": 2169.918,
    "text": "And that's sometimes referred to as a process of amortization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2170.319,
    "end": 2171.34,
    "text": "You can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.725,
    "end": 2174.148,
    "text": " fix certain parts of your function approximation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2174.528,
    "end": 2197.395,
    "text": "And in a sense, using the basis sets is also a form of function approximation that then simplifies or in some ways makes it cheaper to do the process next time you need to do that inference that you can sort of save a function that says, given this input, this is the outcome I should end up with, or this is the inference I should arrive at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.489,
    "end": 2209.36,
    "text": " One of the challenges there is being able to go in the other direction and to be able to say, if I'm going to actively select data, then I need to be in a position where I can predict or generate the outcomes I might get.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2210.302,
    "end": 2218.935,
    "text": " And that might be something that is possible to do in the context of generative approaches in machine learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2219.456,
    "end": 2223.922,
    "text": "And I suppose all of the approaches we've been discussing really are generative approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2225.264,
    "end": 2234.318,
    "text": "But because I can now generate not just the outcome itself, but I can generate a distribution over the outcome conditioned upon what I might do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2235.074,
    "end": 2241.204,
    "text": " That's one of the key things in being able to select those data appropriately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2241.905,
    "end": 2252.401,
    "text": "And if you're using a model where it's very difficult to project that into that space and to ask what are these conditional entropies, then it does become very difficult to select data appropriately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2252.902,
    "end": 2260.694,
    "text": "So using something that's sort of very highly non-linear and difficult to be able to work with those things, it does become more challenging to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2261.356,
    "end": 2262.297,
    "text": "Sometimes people might",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2262.715,
    "end": 2271.645,
    "text": " sort of approach it using sort of sampling-based methods to come up with an empirical distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.765,
    "end": 2275.809,
    "text": "But by the time you start doing that, you end up with something that is much more costly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2277.211,
    "end": 2290.225,
    "text": "So if the problem you're working with is one where you want to try and bring it down to use fewer data points and select your data more intelligently, then often that does require particular kinds of models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2290.778,
    "end": 2292.9,
    "text": " that let you do that in a very efficient way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2300.227,
    "end": 2307.073,
    "text": "There's an interesting area, and it'd be interesting to see how you might interact with these sorts of approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2308.915,
    "end": 2317.663,
    "text": "One thing you might imagine is that actually, if you've got a very clear, unambiguous mapping that you can learn with the deep learning type model,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2318.656,
    "end": 2347.06,
    "text": " it might be that you could actually just treat the outcome or the labels that they should produce by that deep learning model as data from the perspective of another model might go about selecting the right sorts of labels that are going to be helpful in terms of learning about things so there may be levels of the model that can be when they're sufficiently unambiguous sufficiently precise mapping where you might not need to go level of detail and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2347.478,
    "end": 2357.944,
    "text": " and select things in that way, but it may be that the outputs of that are things that then need to be combined to form interesting mechanistic hypotheses about what happens next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2362.953,
    "end": 2388.792,
    "text": " That's very interesting like thinking about different kinds of communications and reliabilities of different kinds of analyses or computer systems and then it's actually the active data sampling conditional entropy in practice which is that reliable sources are pursued",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.987,
    "end": 2408.468,
    "text": " as part of the information foraging adaptive play out that every agent has to be involved in like reliability is its own suitability for an information resource",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.241,
    "end": 2436.868,
    "text": " then the other side of it is actually resolving the the variability of the latent states however those may have extremely high fundamental variability so often pursuing the the conditional entropy the agent has more control over because they can resolve something more at least they can resolve that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2439.38,
    "end": 2441.563,
    "text": " Yes, it's knowing what is and isn't resolvable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2442.084,
    "end": 2443.045,
    "text": "I think that that's key.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2443.967,
    "end": 2461.692,
    "text": "Because if you were to just seek out things that were very uncertain, you might be sat there pressing the random number generator over and over again without being able to learn anything new from it and attract a state that you end up being stuck in, unless you can contextualize that with how resolvable it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.494,
    "end": 2474.672,
    "text": " I think one of the simulations we put together in this particular paper explicitly varied the uncertainty as a function of where you are along a particular number line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2476.374,
    "end": 2485.429,
    "text": "And that was just to illustrate the point that actually there is a... So it was before this section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2486.19,
    "end": 2488.253,
    "text": "Yes, it would have been this one, that's right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2488.486,
    "end": 2499.923,
    "text": " So here you can see that we're dealing with a function where the variance grows as you move away from about x is zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2501.806,
    "end": 2513.143,
    "text": "And if you know that, then you know that actually the informativeness of the data at the peripheries is much less because you're not going to be able to resolve a lot of that uncertainty no matter how much you look there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2514.322,
    "end": 2540.413,
    "text": " And so you see in the choices plot in the lower right here, the solution it arrives at looks like a very sensible, deliberate solution, which is to start in the middle where things are most precise, then fan outwards, moving left and right to resolve as much uncertainty as it can before it's then resolved enough that the cost of sampling further data is more than the amount of uncertainty that might be resolvable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2546.519,
    "end": 2561.279,
    "text": " Whereas if the ambiguity of the conditional entropy were consistent across the entire line, then you might expect a much more even pattern of sampling, and something that in practice might not be very different from random sampling, except for the sort of sequential effects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.823,
    "end": 2576.34,
    "text": "I'd love to hear a first pass on how this figure addresses some of the similarities and differences between active data sampling and maximum entropy sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.683,
    "end": 2601.703,
    "text": " yes so um i don't know whether you have one of the graphics of one of the previous figures where it doesn't have this ambiguity um but so perfect yeah um so so this figure shows an example where the ambiguity is actually the same everywhere so the way in which the data are generated and you can see that because the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.325,
    "end": 2613.744,
    "text": " you can see that in the sample data plot, there is a sort of well-defined function, but the amount of variance around that function is more or less constant throughout that entire line, throughout that function.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2615.767,
    "end": 2620.755,
    "text": "So in this circumstance, the conditional entropy or ambiguity is the same everywhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2621.191,
    "end": 2628.763,
    "text": " That means that the only thing that really differs when you're deciding where to look next and where to sample next is actually the predictive entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2629.824,
    "end": 2634.772,
    "text": "And so here it will just choose locations about which it's most uncertain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2635.393,
    "end": 2643.165,
    "text": "And that's quite a sensible thing to do because there's nowhere that's limited any more than anywhere else in terms of the amount of resolvable uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2643.145,
    "end": 2651.9,
    "text": " And so you can see that the prediction it arrives at after making a series of choices, and you can also see the series of choices it makes are fairly well distributed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2651.94,
    "end": 2657.61,
    "text": "They're quite evenly spaced and cover a lot of that ground.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2658.248,
    "end": 2667.196,
    "text": " And so the prediction it comes to actually matches that uncertainty quite well in a maximum entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2667.376,
    "end": 2675.103,
    "text": "So this is completely identical in this particular setting, the maximum entry approach of selecting those locations that have the maximum predictive entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2675.943,
    "end": 2682.669,
    "text": "That's very different to what we were seeing on the previous figure that Daniel was showing, the one where it starts in the center and fans outwards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2683.83,
    "end": 2687.293,
    "text": "Because if you were to adopt a maximum entry approach here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2687.577,
    "end": 2699.179,
    "text": " then you can see that you'd spend much more time sampling in the far peripheries, which is actually not a terribly useful thing to do here because you're going to just get a lot of uncertain data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2699.219,
    "end": 2701.603,
    "text": "You're not going to be able to resolve it very effectively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2702.039,
    "end": 2726.35,
    "text": " And so here the big difference is that ambiguity aversion forces you to start in the least ambiguous places, and only once you've got the most information you can out of that do you start fanning outwards and going for the more uncertain regions either side, where there's actually less information overall that you can gain, because most of the uncertainty is now unresolved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2726.37,
    "end": 2730.375,
    "text": "The other thing that we've done with this plot, and I think the other one as well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2731.064,
    "end": 2737.37,
    "text": " is specify a cost to sampling, a cost to choosing the next data point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2738.511,
    "end": 2751.023,
    "text": "And this is very much like we do in active inference simulations where we might trade off exploration and exploitation, so trade off having preferences for one thing over another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.504,
    "end": 2757.409,
    "text": "And this is just to get across that idea that there often are going to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2757.71,
    "end": 2764.04,
    "text": " energetical, computational, or even financial costs to going out and getting more data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2765.281,
    "end": 2775.617,
    "text": "And those costs are specified just as prior beliefs about what I will tend to do in the absence of any potential information that I might gain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.188,
    "end": 2796.306,
    "text": " So being a prior belief that can just be added to the log probability of me stopping sampling can just be added to the mutual information or expected information gain, which then gives you an automatic trade-off between exploitation and exploration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2796.758,
    "end": 2815.052,
    "text": " And in fact, it means that if I keep exploring one area exactly, so this C here, so once the expected information gain, once the amount of unserved air can resolve drops below the probability that I would stop sampling, then I will effectively just stop sampling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.112,
    "end": 2820.302,
    "text": "So you get an automatic cutoff as to when you want to stop doing your experiment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2824.298,
    "end": 2841.143,
    "text": " that's a very interesting piece this was this was kind of a cool aspect of it and thank you for that connection to the maximum entry Chris want to ask anything or we can ask a question from live chat or one of your prior questions um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.848,
    "end": 2851.067,
    "text": " Not sure it's necessarily a question, but more I appreciate your answer for that last question that we were just discussing, because it makes a lot of sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2851.107,
    "end": 2858.001,
    "text": "And it almost seems like at some point in more complex models that you can't really",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2857.981,
    "end": 2864.33,
    "text": " necessarily know exactly what you're feeding, some sort of machine learning or neural net.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.77,
    "end": 2874.865,
    "text": "You might want to take a hybrid approach where you have something that you select a small amount, select down your sample, your data down to a certain size.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.905,
    "end": 2881.854,
    "text": "And then you can tweak and optimize your model a little bit more by throwing a couple of random things in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.874,
    "end": 2886.621,
    "text": "But at least you have a smaller set that you're starting from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.546,
    "end": 2895.666,
    "text": " I mean, is that something that you can kind of see doing is like instead of trying to sample down to something that's most informative, sample out what is the least informed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2898.093,
    "end": 2911.652,
    "text": " Yes, and I suppose that's the same sort of approach there, isn't it, as to this starting in the least ambiguous place with the low-hanging fruit and then moving out from there until you feel you're not really gaining anything further.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2912.032,
    "end": 2923.408,
    "text": "And I think you're absolutely right, because as long as you're able to specify the cost of carrying on something and seeking out new data, that gives you quite a principled way of working out when you stop doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2923.507,
    "end": 2930.597,
    "text": " because a pure maximum entry approach will carry on going because there's lots more entry, there's lots more uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2931.083,
    "end": 2936.531,
    "text": " And so you might want to resolve that unless there is cost to doing so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2936.551,
    "end": 2937.813,
    "text": "And it's a perfectly reasonable thing to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2937.853,
    "end": 2939.156,
    "text": "There is no cost to doing so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2939.216,
    "end": 2941.499,
    "text": "You can just keep looking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2941.94,
    "end": 2958.205,
    "text": "But as soon as you're dealing in a realistic setting where actually by doing this, you're not doing something else or you're investing some resource, be that energetic, computational, financial, then taking account of that can be quite a useful way of doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2958.573,
    "end": 2962.46,
    "text": " I mean, it's an interesting point about more complex and large models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.121,
    "end": 2968.069,
    "text": "And I suppose one of the key points there is that the best models are always going to be the simplest models you can get away with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2969.572,
    "end": 2974.761,
    "text": "So if you have very large models with lots of parameters, the advantage is they're very expressive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2974.801,
    "end": 2982.454,
    "text": "You can fit lots and lots of functions or different patterns of data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2983.109,
    "end": 2990.077,
    "text": " The downside is, first of all, that they become less interpretable, but second of all, that you expose yourself to problems of overfitting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2991.399,
    "end": 3002.011,
    "text": "And one of the key things in the active inference approach is that by minimizing free energy or marginal likelihoods, you're implicitly minimizing complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3002.031,
    "end": 3004.594,
    "text": "So the best models will always be the simplest you can get away with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3005.165,
    "end": 3032.387,
    "text": " by get away with i mean as simple as you can get without compromising the accuracy right but that's the key point so sometimes actually there is quite a complex process generating data and you do need a relatively complex model to be able to capture that without compromising the accuracy um so in in that setting it you know it's a really good question how would you go about actually selecting data um in a model that is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3032.789,
    "end": 3036.075,
    "text": " sufficiently expressive that it's fit for purpose in a particular domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3036.996,
    "end": 3046.934,
    "text": "And I think a large part of that is being able to actually quantify the likelihoods and the uncertainties in terms of how that model works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.775,
    "end": 3052.904,
    "text": "And that is a challenge in a lot of deep learning based models and neural network based models, but not all of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.964,
    "end": 3056.13,
    "text": "Some of them will explicitly account for these sorts of things as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3064.885,
    "end": 3066.708,
    "text": " Carl, yeah, anything, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.13,
    "end": 3073.038,
    "text": "Yeah, no, that was just very nicely expressed, a key issue here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3073.578,
    "end": 3092.007,
    "text": "I was just taking my mind back to when I first learned about active learning as of the kind described by people like David McKay, where the objective was to try and find",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.324,
    "end": 3101.885,
    "text": " the right data features that will resolve the uncertainty in exactly the way that we've been talking about, because we've been talking about it largely in the context of inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.226,
    "end": 3108.139,
    "text": "You're inferring latent states of affairs out there, given some data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.355,
    "end": 3120.936,
    "text": " and clearly the original notion of active learning pertains to learning the parameters of a generative model, but you can also apply the same notion to model selection or structural learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.697,
    "end": 3127.246,
    "text": "And that resonates very much with the conversation with Christopher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.67,
    "end": 3135.139,
    "text": "One can either look at seeking out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.777,
    "end": 3149.937,
    "text": " those informative data, the data features that are good and good simply in the sense that they inform your generative model in terms of ultimately maximising the evidence or the marginal likelihood of your generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.259,
    "end": 3156.486,
    "text": "Or you can look at it as triaging bad data that's uninformative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.429,
    "end": 3161.413,
    "text": "You can imagine that process a little bit like Maxwell's demon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.748,
    "end": 3186.885,
    "text": " So the data that you don't go and actively seek out, or if you're in a big data setting and you're trying to ingest or simulate large data, what this notion of active learning and active selection brings to the table is that you don't just blindly ingest all the data as current deep learning does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.446,
    "end": 3190.911,
    "text": "You carefully assess, should I ingest this data point or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3191.245,
    "end": 3219.278,
    "text": " um um you know implicit in what tom was thomas was saying possibly explicit but i'll have to ask him um what what's that kind of objective function what is the if you like um another way of talking about the information gain that i would get if i accepted as maxwell's demon this next bit of data and that information gain is just a mutual information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.815,
    "end": 3232.795,
    "text": " so what you're saying is that you want to only take those data that are literally good because they are informative that will technically or operationally increase the mutual information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.332,
    "end": 3252.387,
    "text": " of inherent in your model between cause and consequence so i think that you know there's something really quite fundamental about this sort of whole notion of being active in the way that you deal with data and gather information that you know that underwrites active inference as you know um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.367,
    "end": 3262.161,
    "text": " with its special focus on active sensing and active vision and active inference and active learning, that you can actually go right through to active natural selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.942,
    "end": 3269.251,
    "text": "And one has to wonder now whether there's a homologue in evolutionary thinking of this kind of active learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.835,
    "end": 3273.698,
    "text": "Thanks for those points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.218,
    "end": 3274.819,
    "text": "Those are great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.879,
    "end": 3275.841,
    "text": "Yeah, Thomas, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.985,
    "end": 3280.888,
    "text": "I don't think I had anything really to add to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3281.375,
    "end": 3282.516,
    "text": " It's exactly that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.678,
    "end": 3287.922,
    "text": "It's being able to decide also upon your model space, isn't it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3287.942,
    "end": 3297.473,
    "text": "I think it's part of the point that Carl's making there that it's actually, it's the selecting your model, but it's also knowing which models even to select between is another key part of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3298.955,
    "end": 3303.179,
    "text": "That's certainly been an interesting area in terms of structure learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3304.181,
    "end": 3306.984,
    "text": "Absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3307.004,
    "end": 3309.947,
    "text": "I really like the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3310.282,
    "end": 3314.528,
    "text": " a call to evolutionary biology, I think that there may be an analog there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3315.309,
    "end": 3320.896,
    "text": "You can kind of wrap your mind around some of the things that you're doing if you frame it from an evolutionary standpoint, too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.897,
    "end": 3324.681,
    "text": "It's an alternative way of looking at it, but I think it's quite valid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3327.745,
    "end": 3333.032,
    "text": "Yeah, also, speaking of those two points there,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.417,
    "end": 3339.624,
    "text": " they speak to a key issue in structural learning read as Bayesian model selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.664,
    "end": 3342.627,
    "text": "Do you take a top-down approach or do you take a bottom-up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.647,
    "end": 3360.927,
    "text": "Do you grow your models carefully by accepting this mutation or this extra state in the factor or indeed an extra level in a deep generative model in the face of this data or this evidence for how good this model is, almost in the sense of adaptive fitness in an evolutionary context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.907,
    "end": 3369.701,
    "text": " Or do you use good old Bayesian model reduction and start with something that can do everything and then prune away the bits that you don't want?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.342,
    "end": 3379.877,
    "text": "I'm just thinking from a biometric point of view or an evolutionary slash developmental, at least neurodevelopmental perspective, so vivo-devo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3380.212,
    "end": 3403.114,
    "text": " it looks as though biology does both doesn't it so we start off with a brain which is over parameterized over wired over connected and then carefully prune away using basic model reduction what we don't want and yet of course at the level of exploring that model hypothesis space i would imagine we rely a lot on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.533,
    "end": 3417.099,
    "text": " carefully crafted mutations split and merge like operators that gently feel out into different... From that perspective, each of us is a data point for evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.279,
    "end": 3418.622,
    "text": "That's quite chilling, isn't it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3424.441,
    "end": 3425.523,
    "text": " A lot to say on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.923,
    "end": 3442.59,
    "text": "One really practical note with the cost of sampling and the opportunity to stop is to have different information foraging locations that have different costs, like different APIs you could call or different costs associated with taking on or holding a record.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.01,
    "end": 3447.377,
    "text": "So it's really true what multiple of you have alluded to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.357,
    "end": 3476.419,
    "text": " it does reframe the question into creating this semantic kernel of understanding for example the clinical trial setting something that can be shown up on a graphical representation and then being able to use that purely in the generative forward direction to generate synthetic data with whatever other evaluative criteria apply to that or just to learn active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.399,
    "end": 3502.272,
    "text": " and then also to use that generativity not just to make more data which is often of limited utility for retraining but actually it includes that adjacency of being able to ask how much another piece of information or evaluating the last incoming piece of information or rank the informativeness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.353,
    "end": 3522.117,
    "text": " however in a way it moves all the challenge into how you define the generative model surprise surprise because you could have a model of information in the world that would lead to very various uh attractor states repetitive looking fixed looking and so on so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.097,
    "end": 3545.438,
    "text": " it's it's pretty interesting how i guess that's the high road and the low road kind of coming to meet each other in the information foraging setting because the fundamental constraints and trade-offs associated with sampling they do come into play and it does not solve the question it just sets up some of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.418,
    "end": 3568.202,
    "text": " objective functions that can be used and have interpretability for these uncertainty situations okay i'll ask another question from the live chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.241,
    "end": 3577.435,
    "text": " All right, Demetrios asks, what is the nature of the precision weighting mechanism in this process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.237,
    "end": 3584.79,
    "text": "Is it possible that high precision of the prior blocks the prediction error to convey the newsworthy information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.605,
    "end": 3611.453,
    "text": " so um precision and the balance between priors of likelihoods and what determines which procedure we might use and i suppose relating that explicitly back to this this question of information seeking so um so precision",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3611.686,
    "end": 3615.07,
    "text": " can be applied to any probability distribution, essentially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3615.09,
    "end": 3621.717,
    "text": "So you could have a precise prior, you could have a precise likelihood, or imprecise versions of either of those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3622.578,
    "end": 3633.831,
    "text": "And this gets particularly interesting and sometimes quite confusing in the context of hierarchical models, where the prior from one level is effectively the likelihood or conditional distribution from the perspective of the level above.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3635.293,
    "end": 3640.579,
    "text": "And so you end up with questions, am I increasing prior or am I decreasing the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3641.065,
    "end": 3646.773,
    "text": " the effect of the likelihood, and it often depends upon exactly where you are in these models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3646.933,
    "end": 3654.244,
    "text": "But taken to its simplest level, imagine you have a prior likelihood and the data that you're evaluating likelihood in relation to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3657.068,
    "end": 3667.663,
    "text": "The relative precision, and it is the relative precision that's important between the prior likelihood will determine which one of those has more of a sort of final beliefs on your posterior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3668.487,
    "end": 3669.849,
    "text": " We have a very precise prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3669.889,
    "end": 3675.795,
    "text": "It says, I'm so confident about this that no matter what I see, I'm not going to shift my beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3676.977,
    "end": 3686.167,
    "text": "And relating this back to the concept of information seeking, that would be the situation where we're in a dynamic setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3686.948,
    "end": 3694.697,
    "text": "I think there's been so little change from the last time I saw something that even if I saw something new, it wouldn't make any difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3695.555,
    "end": 3701.704,
    "text": " The likelihood, if that is very precise, leads to very low ambiguity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3702.405,
    "end": 3724.178,
    "text": "So if I believe there are very precise regions of space from the perspective of my likelihood or regions of whatever process I'm selecting between the different policies I could adopt, then I'm more likely to select those locations compared to others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3725.17,
    "end": 3729.655,
    "text": " And this is often in the context of neurobiology and psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3729.695,
    "end": 3733.8,
    "text": "These are often how people talk about processes like attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3734.361,
    "end": 3751.701,
    "text": "So being able to say that my likelihood is very precise in the context of spatial attention associated with these particular spatial channels or this area of space, then that means I'm going to update my beliefs much more based upon this thing that I'm paying attention to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3753.368,
    "end": 3764.897,
    "text": " The link back to information seeking is that because I might update my beliefs much more based upon this location in space, I might act in such a way that I get more information from it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3765.67,
    "end": 3774.703,
    "text": " move my eyes to look over there, or take whichever action is relevant for whichever data set I'm dealing with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3774.944,
    "end": 3789.906,
    "text": "And we can think of that as essentially saying this region of space, this region of policy space is more salient than others, because when I choose to do something that leads to that outcome, I'm going to update my beliefs much more as a consequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3789.886,
    "end": 3796.214,
    "text": " So I think that gives you a brief summary of how priors and likelihoods interact with one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3796.714,
    "end": 3811.312,
    "text": "The notion of prediction error came up as well, which I think is an important one to think about, particularly when you're dealing with continuous states-based models and perhaps most simply when it's a simple linear Gaussian model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.332,
    "end": 3819.201,
    "text": "Because the degree of update that you might make is effectively going to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3820.058,
    "end": 3826.828,
    "text": " a linear error function where that error is the difference between what I predicted and what actually happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3827.669,
    "end": 3830.954,
    "text": "And that weighting is going to be weighted by the precision of the likelihood.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3831.375,
    "end": 3836.683,
    "text": "So the degree of update I'm going to make to my beliefs depends both on the precision",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3836.95,
    "end": 3844.589,
    "text": " how unambiguous I think it is, and on the amount of discrepancy from what I'd originally predicted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3845.09,
    "end": 3852.428,
    "text": "And that's the same idea that then underwrites a lot of predictive coding and a lot of neurobiological models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3853.707,
    "end": 3863.467,
    "text": " Of course, even that needs to be weighted very carefully by the prior precision and the equivalent errors that you get once you deviate from your priors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3863.487,
    "end": 3868.597,
    "text": "And that probably brings us back to this notion of complexity and the need to keep things simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3868.617,
    "end": 3874.669,
    "text": "Because one reading of keeping your model simple is that you keep things as close as possible to your priors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3876.151,
    "end": 3892.219,
    "text": " If you have lots of parameters and they're all deviating from their priors quite a lot in order to come up with an explanation, then that's effectively a very complex model, one that I think would be penalized relative to a simpler model where everything stays much closer to the priors you have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3896.823,
    "end": 3897.404,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3897.424,
    "end": 3900.147,
    "text": "Let's go a different direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3900.688,
    "end": 3906.917,
    "text": "There was a very interesting and ambiguous use of the streetlight effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.038,
    "end": 3910.181,
    "text": "So what is the streetlight effects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.102,
    "end": 3917.171,
    "text": "And how is it kind of a representative setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.191,
    "end": 3919.233,
    "text": "And what do we do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3919.434,
    "end": 3924.18,
    "text": "Oh, there were so many fun, fun representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.325,
    "end": 3949.29,
    "text": " so what what what is it is it is it a um joke how did you find one how did you find one with a pie oh just typing in different symbols to see underneath the spotlight very good yeah gpt40 um so the the idea of the street light effect comes back to this idea of ambiguity aversion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.452,
    "end": 3957.323,
    "text": " And it's an idea that, I can't remember where it first came from, but I first came across it in psychology literature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3958.204,
    "end": 3961.229,
    "text": "I think possibly a reviewer mentioned it in a paper at some stage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3962.671,
    "end": 3969.802,
    "text": "But the streetlight effect is originally set up to be something to describe an unhelpful bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3971.064,
    "end": 3979.176,
    "text": "And the idea was that if you're sort of coming home late at night and it's a dark street and you drop your keys,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3979.24,
    "end": 3982.663,
    "text": " the first place you might look is underneath the streetlight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3984.305,
    "end": 3991.512,
    "text": "And that's unhelpful in the original reading because your keys are not more likely to go into the streetlight than they are anywhere else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3992.013,
    "end": 4003.164,
    "text": "And so it's a metaphor for seeking out those sources of information that are most easy to acquire and that you can learn the most from very quickly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.265,
    "end": 4008.91,
    "text": "Of course, from an active inference perspective, that's actually a completely optimal thing to do, that if you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4009.261,
    "end": 4018.683,
    "text": " have some uncertainty to resolve, the very first thing you should do is look under the streetlight because then you'll quickly establish that your car keys or your house keys are not there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4019.926,
    "end": 4021.67,
    "text": "And then you might start looking elsewhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4023.755,
    "end": 4027.303,
    "text": "So another way of putting that is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4027.537,
    "end": 4036.491,
    "text": " The least ambiguous place, the place where there's the clearest mapping between the location of my keys and the visual data I would get is under that streetlight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4036.591,
    "end": 4051.975,
    "text": "So if I'm ambiguity-averse, if I choose those places where that conditional entropy is lowest, then I'll start at the space under the streetlight, and maybe I'll then fan out from there, just as we saw in the simulation results that you put up earlier on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4056.123,
    "end": 4085.067,
    "text": " yes what a what a comical plot twist that it's like it's a joke because it brings us to the point of laughing at the person looking under the streetlight and then it leaves it open like but what should they have done and then this isn't exactly what they should have done um in this paper but just like you said it's a reasonable starting location especially if it's where one finds one to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.65,
    "end": 4089.333,
    "text": " So it's kind of interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.238,
    "end": 4094.58,
    "text": "Carl or Chris?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4098.144,
    "end": 4099.325,
    "text": "No, I love that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4101.088,
    "end": 4102.489,
    "text": "I haven't heard it phrased like that before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.509,
    "end": 4106.454,
    "text": "It's very nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.474,
    "end": 4106.735,
    "text": "Chris?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4107.836,
    "end": 4109.338,
    "text": "Nothing really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4109.518,
    "end": 4111.24,
    "text": "I do like that analogy, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4118.695,
    "end": 4147.302,
    "text": " let's how was equation three and this seemingly very general usage of of information gain on uh base graphs how did that come into play and maybe if you could just define how that was used",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.201,
    "end": 4169.998,
    "text": " So the idea here was that just as in a lot of Bayesian inference problems where you're dealing with relatively complex generative models, appropriately complicated generative models to help you accurately explain data,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4171.058,
    "end": 4185.792,
    "text": " then there's often quite a lot of sparsity in those models and there might be multiple different nodes and edges that one might need to take advantage of, or sorry, that represent variables one might want to draw inferences about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4186.873,
    "end": 4199.445,
    "text": "And so there's a long series of papers and advances that have been looking at ways to do that efficiently from an inference perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4200.657,
    "end": 4213.537,
    "text": " And that has led to many, many forms of message passing algorithm, relying upon different approximations to posterior probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4214.238,
    "end": 4229.061,
    "text": "Those include sort of, trying to remember what the very early ones were, I think the Baumweltschart algorithm and things like that were sort of early versions of what then ended up becoming fully Bayesian type approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4229.783,
    "end": 4236.21,
    "text": " And the more general forms would be things like variational message passing, which relies upon field approximation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4236.33,
    "end": 4243.297,
    "text": "So the idea that I can factorize all my variables or the posterior probability over all the different variables I'm dealing with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4243.898,
    "end": 4258.693,
    "text": "And by not having to deal with all the posterior covariances and conditional dependencies, I can come up with a much more efficient, but still relatively good and useful set of beliefs about the causes of my data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4260.412,
    "end": 4268.442,
    "text": " Then there are more accurate algorithms that were then developed as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4268.843,
    "end": 4283.601,
    "text": "So things like belief propagation, some product type algorithms, which implicitly do take account of pairwise dependencies between different variables, but still allow you to come up with good marginal inferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4284.374,
    "end": 4288.079,
    "text": " Often these rely upon subtly different free energy functionals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4289.121,
    "end": 4296.812,
    "text": "So, for instance, belief propagation implicitly comes from something known as the Bethe free energy, which is B-E-T-H-E.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4297.693,
    "end": 4313.976,
    "text": "And that effectively assumes that the posterior factorizes in such a way that I can take account of all the pairwise dependencies and then renormalize by all the singleton distributions over each single margin in my system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4314.395,
    "end": 4322.586,
    "text": " And that allows you to achieve exact inference from the perspective of the marginal distributions you get out at the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4322.606,
    "end": 4338.327,
    "text": "The point of doing all of these sorts of things, and you know, there are many others, expectation propagation and various others that are based upon other free energy approximations, and one in general is a Kikuchi free energy that can be factorized again in different ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4338.863,
    "end": 4365.073,
    "text": " But the purpose and advantage of doing these things is that it allows us to make use of the conditional dependency structures, the sparsity structures, and the Markov blankets in a network and ask questions about specific variables, solve that in quite an efficient way to be able to say what are the beliefs we have about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4366.977,
    "end": 4383.462,
    "text": " The idea behind the way this equation was phrased is that you can actually use those same messages in the same cursive structures where beliefs depend upon the other beliefs in the network and the message passing that results from that to work out the information gain about specific variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4384.203,
    "end": 4395.82,
    "text": "So you can make use of exactly the same technology that was used in things like belief propagation schemes and which underwrite a lot of neurobiological message passing schemes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4397.285,
    "end": 4409.638,
    "text": " So this equation uses the notation CH to mean children, so the things that depend upon the variable we're interested in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4410.66,
    "end": 4414.724,
    "text": "The parents, which are the things that it depends upon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4414.784,
    "end": 4424.895,
    "text": "And the parents of the children, which you'll see also in a couple of locations here, which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4425.145,
    "end": 4451.22,
    "text": " together so the children the parents and the parent the co-parents of the same children together make up the markov blanket which is all the things that um that if i knew about would give me all the information i needed about the thing i'm trying to infer so i only need to know about the local blanket surrounding a particular node and not the rest of the network because if i know about those things that tells me everything i need to know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4452.28,
    "end": 4468.038,
    "text": " And so this is just a simple way then of taking advantage of, again, that sparsity to be able to come up with an efficient way of estimating not just the posteriors, but the information gain I could potentially achieve about those posteriors given a particular policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4471.161,
    "end": 4476.347,
    "text": "Or the information I could gain about those variables with posterior relative to the prior variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4480.512,
    "end": 4487.901,
    "text": " So in the textbook there's an example where the generative process and the generative model have the same form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.921,
    "end": 4492.787,
    "text": "Like if they're both generating from a Gaussian, then those distributions can truly lock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.807,
    "end": 4498.154,
    "text": "But also it's possible to have the form of the generative process and the generative model differ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.174,
    "end": 4508.427,
    "text": "So like the generative model is doing some categorical too cold, just right, too hot, and then actually temperature is a continuous variable and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.318,
    "end": 4527.023,
    "text": " how how does the selection of family of distribution that's even used to relate to the um information gain like in table one uh okay i i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4527.307,
    "end": 4531.493,
    "text": " I'll just try and unpick possibly two different things there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4531.513,
    "end": 4542.489,
    "text": "So one was this notion of whether the generative model that we might use are prior and could actually match the way in which the world around us generates those data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4542.509,
    "end": 4545.113,
    "text": "And I think that's a really important thing to consider.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4546.354,
    "end": 4552.403,
    "text": "And exactly as you say, there are often situations where the best model is, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4552.484,
    "end": 4564.283,
    "text": " sort of lay sense the wrong model in that it doesn't match how data are actually generated but is a simpler explanation that it complies with Occam's razor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4564.415,
    "end": 4568.341,
    "text": " And the reason for that is you can always generate the same data in a more complex way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4568.721,
    "end": 4572.547,
    "text": "So if you can get down to the simplest way of generating it, that's often the best way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4573.488,
    "end": 4582.422,
    "text": "One of my favorite examples of this was something I found out a while back when we were doing some work on modeling of eye movements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4583.623,
    "end": 4591.435,
    "text": "And one of the things I found is that it's much simpler to model your eyes moving together as if you just had one eye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4591.685,
    "end": 4601.156,
    "text": " and then make predictions from the perspective of both eyes because both eyes move together, excluding sort of subtle things like convergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4602.077,
    "end": 4608.225,
    "text": "Most of the time, when you want to decide upon a gaze direction, you don't need to decide on separate gaze directions for each eye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4609.086,
    "end": 4613.331,
    "text": "You might if you're a chameleon or another sort of creature that can move their eyes independently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4613.791,
    "end": 4621.0,
    "text": "But from our perspective, actually, you can make do with a generative model that's much simpler than the physics of your eyes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4621.368,
    "end": 4628.24,
    "text": " where actually there's nothing to say that you couldn't rotate two different spheres in completely different directions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4629.682,
    "end": 4641.503,
    "text": "So by doing that, you actually end up with a model that is wrong, but is also a much better model than one that includes lots of additional parameterization and degrees of freedom that are just never used in reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4643.12,
    "end": 4653.578,
    "text": " So I think that sort of is quite a nice intuitive example of where your model might differ from that in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4654.72,
    "end": 4664.436,
    "text": "And then perhaps related to that is the other point you were making about whether the particular distributions in your model are consistent with the distributions in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4665.091,
    "end": 4675.582,
    "text": " Or even how do particular kinds of distribution, forgetting whether or not they're accurate models of the world, how do they affect how you then seek information?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4677.043,
    "end": 4681.227,
    "text": "And it, of course, there is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4681.247,
    "end": 4690.997,
    "text": "So one of the reasons for including the table that you showed is that the form for the information game will be different depending upon which kind of model you have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4692.277,
    "end": 4702.452,
    "text": " And that's just useful to know in the sense that if you're writing down a model and you want to know an efficient way of sampling from it, it's going to depend upon what form that model has.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4702.472,
    "end": 4710.504,
    "text": "So one of the big distinctions that we often see and often make use of is this distinction between categorical models and continuous models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4712.667,
    "end": 4721.76,
    "text": "So the two middle rows here are dealing with categorical or Dirichlet priors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4722.247,
    "end": 4727.398,
    "text": " And they have a particular form in terms of the information gain and the way in which you do that updating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4728.48,
    "end": 4731.767,
    "text": "Pull out of that the ambiguity bits, the predicted entropy bits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4733.191,
    "end": 4736.678,
    "text": "The lowest row, the third row here, shows the formula Gaussian model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4737.367,
    "end": 4753.104,
    "text": " And one of the key things you can see in the Gaussian model is that the covariance predicted, so this sigma subscript y, is the predicted variance for the data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4754.145,
    "end": 4756.708,
    "text": "And so that is going to scale with the ambiguity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4757.108,
    "end": 4766.378,
    "text": "So you can immediately pull out from that how much ambiguity there's going to be just by looking at this term here, exactly what you're highlighting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4767.269,
    "end": 4770.935,
    "text": " Now, if that depends upon pi, then the ambiguity really matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4771.856,
    "end": 4784.316,
    "text": "If that's constant, as we saw in some of the earlier ones, and it doesn't depend upon pi, then the only thing you need to take account of is actually the first bit, which is the maximum entry bit of these equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4785.978,
    "end": 4792.028,
    "text": "So the form that you choose for your model is absolutely key in terms of how you then go about sampling the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4792.75,
    "end": 4797.517,
    "text": " And how you optimize your model is then absolutely dependent upon how you've sampled the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4797.537,
    "end": 4812.177,
    "text": "So you get this sort of nice circularity that then determines how you build your model based upon what you see, but based upon how your model currently is and what's uncertain about and what there is to resolve, you're going to simply change how you go about sampling it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4813.793,
    "end": 4842.855,
    "text": " that's a really fascinating point and it makes me think about learning like in a given situation one could over or under learn or however it comes to be that their policies do matter for resolving uncertainty and then that could set up the balance between continuing to sample from distributions and or stopping them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4844.0,
    "end": 4862.702,
    "text": " Yes, that's an interesting thought, because you could start with a model in which you don't know about how your policy affects, for example, this covariance, but it may be that over time you realize that when I do this and end up in this sort of state, actually it does affect it, or when I take a particular action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4864.124,
    "end": 4870.632,
    "text": "And so if you were then optimizing your model, and then you go one step further and you say, well, how do I learn this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4871.219,
    "end": 4877.047,
    "text": " which, or how do I infer which parts of my model will be affected by the actions I take?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4877.948,
    "end": 4882.293,
    "text": "And how do I choose the right actions so that I can best learn about which bits of my model will be affected?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4883.215,
    "end": 4888.061,
    "text": "And I think that's a really interesting question as to how you might approach that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4889.483,
    "end": 4896.011,
    "text": "So we could have parameterized here, or we could have included additional parameters that are how does the covariance depend upon the policy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4896.852,
    "end": 4901.158,
    "text": "And it might be that if those parameters were all zero, there's no dependence at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4901.425,
    "end": 4907.434,
    "text": " But as you learn more about it, you might then learn actually there is a function that affects the ambiguity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4908.235,
    "end": 4915.526,
    "text": "And if that's the case, then I will change my behavior quite considerably once I've learned where the least ambiguous places are to go and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4919.793,
    "end": 4927.905,
    "text": "To connect this to language interfaces and chat and just different kinds of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4929.151,
    "end": 4950.754,
    "text": " language models that people can interact with so in human interacting with with other and with how we design these generative models to be this kind of awareness of of what parts could be influenced if i were to prompt this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.734,
    "end": 4980.268,
    "text": " looking into the how much learning would be expected from a distribution of what responses are being generated from the chatbot so like the distribution that the chatbot actually fleshes out is its irresolvable uncertainty and then the question of which prompt to enter next or which prompt to provide",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4980.89,
    "end": 4995.088,
    "text": " could be guided by wanting to select the single best or from among the best next policy selections to reduce some uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4996.77,
    "end": 5010.407,
    "text": "And so understand if it were a deterministic API on the other side, like a chess game, then it would be a simplified decision of what to prompt, like a calculator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.94,
    "end": 5026.489,
    "text": " whereas with the probabilistic model there's sometimes small sometimes very large uncertainties on what it actually is out there so sometimes it dwarfs what can be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.275,
    "end": 5053.641,
    "text": " resolved but we don't necessarily have an awareness or ability to estimate in these different situations what that balance might be however these these methods whether the models generating process is like an active inference model or whatever happens to be a sensor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5053.621,
    "end": 5078.211,
    "text": " this can help interoperate the different information resources and patterns by putting them in a common epistemic plus pragmatic plus cost setting yes i think that's right maybe if you've got if you've got a sufficiently expressive model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.815,
    "end": 5089.972,
    "text": " and a reasonable degree of uncertainty about that model space, you can actually start to exactly learn how you even go about doing these things as your model becomes more sophisticated of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5091.033,
    "end": 5099.847,
    "text": "You learn how to interact with it better in all three of those domains, epistemic, pragmatic, sorry, two domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5099.987,
    "end": 5101.189,
    "text": "You mentioned three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5101.249,
    "end": 5102.01,
    "text": "What's the third one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5102.19,
    "end": 5103.412,
    "text": "Epistemic, pragmatic, and?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5103.973,
    "end": 5104.654,
    "text": "Cost.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5106.338,
    "end": 5113.572,
    "text": " Ah, okay, so I normally think of the pragmatic as effectively accomplishing the cost, but yes, yeah, absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5113.592,
    "end": 5122.55,
    "text": "But the cost playing a special, clear role in this paper with a finite stopping threshold for sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.572,
    "end": 5123.672,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5125.913,
    "end": 5135.848,
    "text": " But in a sense, the cost is affecting the sampling, but it's not sort of just putting a clear time threshold on, I'm going to stop at this stage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5135.908,
    "end": 5142.538,
    "text": "It's something that sort of automatically reweights itself relative to the amount of information that might be left to resolve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5145.05,
    "end": 5149.074,
    "text": " I think that'll be something very relevant that will be explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5150.035,
    "end": 5171.597,
    "text": "For example, if there is a value that can be placed on a given piece of information and that could be how much it influences some trade or it could take into account like the cost of paying the employee for that much time or using the computational resources, then it's possible to allocate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5172.708,
    "end": 5199.019,
    "text": " fixed or variable costs and stopping times was completely separated from the epistemic and pragmatic generative model itself but with a cost as purely an exit boundary and not be not directly consuming the output of the free energy calculations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5201.885,
    "end": 5204.107,
    "text": " Yes, and that made me think of a couple of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5204.228,
    "end": 5213.057,
    "text": "One is that one of the advantages of that sort of cost is that in a dynamic environment, it may be appropriate at some points to rest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5213.658,
    "end": 5218.523,
    "text": "And then as uncertainty accumulates beyond a certain point, you might want to go back to sampling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5218.543,
    "end": 5227.993,
    "text": "So if you have a sort of time or cutoff after which you just stop, then that's no good for anything that might have changed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5229.205,
    "end": 5238.562,
    "text": " But if you've stopped for a little while and decided not to put in those costs, you can then decide when's the appropriate place to start, not just to stop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5239.523,
    "end": 5252.847,
    "text": "The other thing I thought was interesting about what you said is, again, this notion that to some extent, although from an active interest perspective and certainly from the perspective of this paper, information in itself is valuable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5252.867,
    "end": 5253.829,
    "text": "And so the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5254.147,
    "end": 5265.099,
    "text": " the value of information is in terms of how informative it is, regardless of how it affects what you might gain in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5265.82,
    "end": 5271.246,
    "text": "However, how much you might gain in the future may also be relevant in terms of that pragmatic level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5271.486,
    "end": 5281.237,
    "text": "And this brings in some of the ideas that have come through sophisticated inference like schemes, where you start to evaluate these things recursively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5281.257,
    "end": 5284.12,
    "text": "So in a lot of reinforcement learning,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5284.758,
    "end": 5297.18,
    "text": " in probably most of it, where there is information gain, it's often seen as the information that will lead me to the result I want, it will lead me to more reward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5298.181,
    "end": 5308.96,
    "text": "And so creatures may learn a path through their environment that is the one that more reliably leads them to reward because it tells them where to go earlier on, something along those lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5309.463,
    "end": 5319.312,
    "text": " However, one could say that, and that is important, one could also say that it's important to learn about your environment for its own sake as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5320.332,
    "end": 5331.462,
    "text": "And one of the things active inference does is it doesn't put any special focus on either the fulfillment of your preferences or the seeking of information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5333.124,
    "end": 5338.288,
    "text": "But the interesting connection between the two is that often seeking out information will help you fulfill your preferences in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5338.606,
    "end": 5342.915,
    "text": " So if you're able to recursively evaluate, if I knew this, what would I do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5342.935,
    "end": 5346.061,
    "text": "And if I did that, what would I learn?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5346.341,
    "end": 5357.644,
    "text": "And if I knew that and keep going into the future, you can also select things that will give you information that will help you satisfy your pragmatic values as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5358.299,
    "end": 5375.633,
    "text": " So information ends up having a dual purpose, first of all, in being valuable in its own sake, but also being valuable in terms of what else you can gain from it in the future, both in terms of information, but also in terms of the pragmatic value to be able to achieve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5379.022,
    "end": 5389.313,
    "text": " I think we'll come to that with the pragmatics of epistemic value, but just one note on the message passing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5391.876,
    "end": 5407.493,
    "text": "You mentioned how with the stopping criterion, it's possible to think about the information foraging setting, not just as like where to look every time a metronome clicks, but scheduling bouts, like batching emails or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5407.473,
    "end": 5433.683,
    "text": " And that reminded me of our recent discussion with some of the RxInfer team about the RxEnvironment package, which uses the reactive message passing to uncouple the timing of, for example, the nestmate and the niche in a generative model so that they can be on different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5434.895,
    "end": 5455.35,
    "text": " timings and the computations occur on demand like in a node local way and can have uncoupled timings so it's just very interesting how this pathway that is laid out in the paper about how on one hand we have the graphical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5457.136,
    "end": 5472.343,
    "text": " semantic layout of what these variables are and then how many preparation stages before it all gets played out as the relationship of the equations that we get from the entropies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5477.116,
    "end": 5486.647,
    "text": " So in a sense, this is sort of setting out the process that someone might go through if they were trying to unpack this sort of modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5486.667,
    "end": 5495.937,
    "text": "In practice, you might assume that actually a lot of it just starts from this message parsing stage, and so it's the interaction directly with message parsing and what you sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5497.078,
    "end": 5502.364,
    "text": "And a lot of the graphics are on top, really, to set out the equivalence between different sorts of formulas in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5503.762,
    "end": 5506.526,
    "text": " which some people are very familiar with using one sort.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5507.086,
    "end": 5513.375,
    "text": "In principle, you could tell this story without referring to a Bayesian network, without referring to a factor graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5514.496,
    "end": 5524.269,
    "text": "And one of the big focuses really here was just trying to point out the way in which they're interrelated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5524.289,
    "end": 5527.373,
    "text": "Carl or Christopher, we can go any direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5535.014,
    "end": 5538.719,
    "text": " I go in two directions because there are two really interesting issues there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5539.4,
    "end": 5541.362,
    "text": "I can't resist commenting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5541.382,
    "end": 5558.845,
    "text": "Perhaps in reverse order, the notion of reactive message passing, I think, is not only crucial and again very biomimetic, but also very relevant in terms of computer science and efficiency in terms of implementing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5559.28,
    "end": 5584.292,
    "text": " um any kind of active inference or learning scheme um it actually inherits from something called the actor model in computer science which is a big thing which led to the development of a whole suite of different programming languages you know one of the most popular nowadays is rust um that is predicated very much on this notion of um responding to queries and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5584.508,
    "end": 5595.798,
    "text": " requests for computation and the products of that computation, which fits very, very comfortably with the, you know, the maths of message passing on factor graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5595.838,
    "end": 5614.414,
    "text": "So I think the RxInfer reactive message passing is exactly the right way to go, not only in terms of understanding biomimetic dynamics and belief updating, but also in engineering the next generation of deep learning or artificial intelligence of a more generalized sort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5614.985,
    "end": 5619.291,
    "text": " But the other direction I want to do is come back to this, I think, really important discussion about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5621.315,
    "end": 5629.867,
    "text": "Is information is the value of information intrinsic to the information game or is it always conditioned upon your ultimate goal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5631.169,
    "end": 5641.926,
    "text": "I think that's a really kind of profound point, and I have a very specific take on that that inherits from the physics that you get from the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5641.946,
    "end": 5644.249,
    "text": "So if you just write down",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5644.769,
    "end": 5671.047,
    "text": " what is the probability distribution over paths into the future and then you take the logarithm of that probability to create a potential that is the expected free energy so the expected free energy that can be carved into the expected information gain and the expected log prior preference or expected value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.735,
    "end": 5691.212,
    "text": " falls out of the physics of self-organization and that decomposition tells you that these things are linearly separable it means that there is no value of information about the reward that does not exist because about the reward suggests you can't linearly separate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5691.901,
    "end": 5718.702,
    "text": " the expected information came from the expected value so this notion i think that you um only have to learn about that which you need to know in order to get your reward i think is fundamentally wrong and one has to ask where did it come from and i think it's by putting a certain kind of teleology and semantics on the physics of sentience and your sentient behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.103,
    "end": 5720.945,
    "text": " that leads you to that false conclusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5721.005,
    "end": 5723.387,
    "text": "Because now, what does value mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5723.707,
    "end": 5726.87,
    "text": "Oh, well, everything has to be in relation to the reward or the goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5728.291,
    "end": 5731.033,
    "text": "But of course, the value of information is not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5732.294,
    "end": 5748.688,
    "text": "Another way of looking, or if you like, dissolving that sort of disconnect between the intrinsic value of resolving your uncertainty about the world as opposed to the extrinsic value of avoiding expected surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5749.073,
    "end": 5763.236,
    "text": " where surprise is read as a sort of negative log of your prior preferences, is just to think about, to acknowledge that we're talking about effectively Lagrangians or potential functions because they're log probabilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5763.637,
    "end": 5765.8,
    "text": "So when I say you can linearly separate them,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.455,
    "end": 5779.857,
    "text": " what we are separating in a linear non-interacting way are the log probabilities when you actually combine the two probabilities what that actually means is that i will only go for information gain if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5780.073,
    "end": 5807.835,
    "text": " it satisfies my um my goals or equivalently and symmetrically um i am only going to satisfy my goals if i get a sufficiently high information gain so they do with contextualize each other in probability space even though uh they are they don't interact in terms of information or um in terms of potentials or log probabilities the final point is that you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5809.013,
    "end": 5834.785,
    "text": " this non-theological conflation of the value of information and the value of conforming to the constraints supplied by the prior preferences is that that is exactly what you get when acknowledging that the free energy principle is dual to james's principle of constrained maximum entropy so in this instance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5835.271,
    "end": 5860.502,
    "text": " you can just rewrite or reinterpret um the free energy principle as an instance of constraint maximum entry principle and you were talking before about you know the benefits of maximum entropy and this is one very simple extent instantiation of it where the entropy in question is the entropy of your posterior or your measurement but it's constrained so now rewards",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5860.786,
    "end": 5881.258,
    "text": " are just ways of writing down constraints on an information maximizing system or a maximum entropy system and where do those constraints come from they come from the generative model where does the general model what constitutes general model it's just the prior preferences in your generative model from the point of view of the free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5881.238,
    "end": 5894.37,
    "text": " So by, if you like, appealing not just the free energy principle, but Jane's constrained maximum entry principle, mathematically, that speaks to a very, very clear picture that the intrinsic value of information has got nothing to do",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5894.772,
    "end": 5917.928,
    "text": " with rewards or goals or constraints it's just a way of writing down a constraint and you can actually articulate this in terms of lagrange multipliers where you can either look at the information seeking as constrained by reward or you can look at rewards seeking as constrained by information but in log space they're completely independent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5918.482,
    "end": 5920.064,
    "text": " That's what came to mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5920.624,
    "end": 5936.801,
    "text": "I think it's a really interesting point, which confused me for years and also is a recurrent question when you talk to people in reinforcement learning who have this gambler's fallacy about the relationship between the two kinds of value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5939.544,
    "end": 5940.385,
    "text": "Thank you, Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5940.465,
    "end": 5941.246,
    "text": "That was amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5941.326,
    "end": 5942.287,
    "text": "A few notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5943.508,
    "end": 5948.353,
    "text": "The additivity of the log probabilities is the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5949.565,
    "end": 5965.836,
    "text": " in the is the um multiplication of the probabilities non log it's just properties of logs so it's fascinating how they are both cross calibrated and referenced",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5965.816,
    "end": 5989.36,
    "text": " and decomposed from generalized free energy or expected free energy considerations and in practice there's the parameterization of uh what the actual values are however you have given a very full-throated defense of the pure value of information gained",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5990.69,
    "end": 6020.393,
    "text": " And that was something in the approach of this paper that Christopher and I had explored a little bit, how it starts with the information gain and then the end of the paper brings in the pragmatic value, as opposed to looking to expand the epistemic scope of reward and reinforcement",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.795,
    "end": 6026.563,
    "text": " and introduce some kind of variability or learning or intelligence layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.583,
    "end": 6033.954,
    "text": "Other than that, starting with the information gain and then tuning the regimes of attention and action from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6033.974,
    "end": 6038.601,
    "text": "So that's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6049.162,
    "end": 6052.847,
    "text": " Chris, do you have any other thoughts or directions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6055.912,
    "end": 6067.249,
    "text": "No, I think that really everything's kind of been captured here very nicely, and I'm still trying to process through some of the things that we've discussed now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6068.431,
    "end": 6074.68,
    "text": "I just really appreciate how the paper's written, how well it has, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6075.571,
    "end": 6080.586,
    "text": " mentioning what Daniel said, how it builds from a single kernel of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6081.224,
    "end": 6090.398,
    "text": " mutual information gain, and then it just builds out a model from there into something that is more and more applicable to different regimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6090.918,
    "end": 6104.558,
    "text": "So you can kind of stop at any point that you want, and then it just kind of grows into something that is immediately applicable to clinical trials, which is quite wonderful, and I really did appreciate that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6105.6,
    "end": 6110.387,
    "text": "I'm just going to have to sit through and probably process some of the things that we've discussed here today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6112.257,
    "end": 6141.488,
    "text": " yeah i think that uh let's just in the last minutes think about what we might want to process over the next week and prepare some questions it might be cool to see the code so thomas if you want to have it loaded up or we can uh try to prepare it on one of our machines christopher um we uh yeah or thomas what would you look forward to discussing or doing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6142.447,
    "end": 6148.363,
    "text": " If you'd like to, it's all available on GitHub repository.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6148.905,
    "end": 6156.726,
    "text": "And I think it's set up so that if it's run, it will generate a series of animations showing the process of sampling as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6158.191,
    "end": 6173.635,
    "text": " so if you could if you could yeah that would be awesome yeah let's um return on that and look at the code what's the easiest thing would you like me to send you something there and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6173.733,
    "end": 6185.728,
    "text": " If you could just prepare to share your screen with the code running, and then we can start with just a little bit of looking at it, just seeing what the code does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6186.189,
    "end": 6199.285,
    "text": "And then in the second part, talk more about the clinical trial setting and how it is all brought together in Section 6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6204.395,
    "end": 6204.755,
    "text": " Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6205.256,
    "end": 6205.537,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6208.04,
    "end": 6209.862,
    "text": "Any last thoughts from any of you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6213.027,
    "end": 6213.447,
    "text": "None here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6218.233,
    "end": 6219.435,
    "text": "Thank you, Thomas and Carl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6220.176,
    "end": 6223.32,
    "text": "This is awesome to have you join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6223.581,
    "end": 6227.085,
    "text": "Thank you, Chris, for helping prepare this too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6227.105,
    "end": 6229.288,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6229.308,
    "end": 6230.069,
    "text": "See you next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.131,
    "end": 6231.691,
    "text": "Thank you, guys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6231.892,
    "end": 6232.392,
    "text": "Have a good one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6232.753,
    "end": 6232.933,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]