[
  {
    "start": 7.435,
    "end": 8.436,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 9.016,
    "end": 18.864,
    "text": "It's July 27th, 2023, and we're here in Act In, guest stream number 15.1 with Valeria Beccatini and Anna C. Junica.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.884,
    "end": 31.735,
    "text": "This is going to be a very interesting and cool presentation and discussion on selfless minds, unlimited bodies, homeostatic bodily self-regulation, and meditative experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.455,
    "end": 35.778,
    "text": "There will be a presentation followed by a discussion, so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.049,
    "end": 40.05,
    "text": " And to you, Valeria, for the presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.871,
    "end": 43.092,
    "text": "Thank you, Diana, very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.372,
    "end": 52.037,
    "text": "I'm very happy to be here with Anna presenting Path of a Wider Project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 52.898,
    "end": 60.603,
    "text": "It's a paper about what happens in selfless state from a homo-subtly-body self-regulation perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 61.383,
    "end": 67.807,
    "text": "So as I said, it's part of a wider project that consists in both theoretical and experimental approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.568,
    "end": 97.684,
    "text": " um components and so today we're gonna look at um meditation um so for people that are not really familiar with that meditation is a practice engaged attention to self-regulate physiological and cognitive activity and what we're interested here is that people that meditate with a certain experience so for example",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 98.402,
    "end": 126.988,
    "text": " meditating in the past two years with regularly like some hours per week they consistently consistently report losing oneself uh one sense of the self or having selfless experiences but only not only that they also report to have bodily uh alterations so alterations in the perception of the body that has been called expansion oceanic boundlessness dissolution of body boundaries",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.799,
    "end": 137.309,
    "text": " And since you are particularly interested in this kind of phenomenal experience, we have proposed to frame them at unlimited body for clarity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 138.129,
    "end": 151.823,
    "text": "So our question here is what exactly, and the question that will follow the whole presentation in the background is what exactly is lost when experienced meditators report losing their self and the body?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 153.14,
    "end": 160.022,
    "text": " So let's first look very briefly at what the self is or the sense of self is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 160.802,
    "end": 168.403,
    "text": "So this concept is so complex and so wide that it has been debated since the beginning of philosophy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.084,
    "end": 174.905,
    "text": "And of course, it might be so intrusive that it's also very hard to define.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 175.585,
    "end": 179.466,
    "text": "But one very old and used definition is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 181.167,
    "end": 186.11,
    "text": " the unitary or unique individual I, the first-person perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 186.47,
    "end": 197.236,
    "text": "That in Latin was called the subiectum, so something that lay under all our stream of experience, thoughts, and whatever else happens to us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.156,
    "end": 198.957,
    "text": "That's the subject.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 200.457,
    "end": 208.222,
    "text": "However, more recently in cognitive science, we are appealing to a more common definition of sense of self, a bit more exhaustive, that is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 209.798,
    "end": 211.981,
    "text": " defined as a multidimensional constraint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 212.041,
    "end": 219.469,
    "text": "And here we will come back on this concept later and we'll unpack it a bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.532,
    "end": 225.016,
    "text": "So the aim of this presentation will be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 226.107,
    "end": 236.853,
    "text": " to, first of all, lay down the fact that in selfless experiences, the biological organism, so to speak, the human body, remains successfully self-regulated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 237.693,
    "end": 255.363,
    "text": "And this might be very intuitive, but it needs us then to see that during selfless experiences, what we propose is that they may be tacitly accompanied or implicitly underlined by enhanced connectedness with this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.939,
    "end": 265.844,
    "text": " successful self-regulation that we propose to link it with a perceptually attenuated body or what has been already called transparent body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 268.765,
    "end": 284.413,
    "text": "And this allows us to propose, but it's of course on a working process and we are very open to feedback at any stage of the presentation that the term selfless states may be misleading because what is lost",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 284.966,
    "end": 291.128,
    "text": " is an ordinary way to mentally model the self in relation to the body and the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.148,
    "end": 297.109,
    "text": "So our roadmap is composed as follows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 298.05,
    "end": 305.652,
    "text": "First, I will pass through debates and definitions of losing oneself and the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.712,
    "end": 314.254,
    "text": "So that means I will go through alterations in these two dimensions during the massive state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 315.99,
    "end": 326.454,
    "text": " And then I will introduce key concepts of predictive process and active input framework that are useful in our explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 328.355,
    "end": 342.741,
    "text": "So that then I can unpack the role of the biological self-organization and homostatic self-regulation in constituting our sense of self and then pass it to our",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 343.442,
    "end": 353.785,
    "text": " or claim that somatosensory attenuation and transparent self-modelling are key mechanisms underlying the phenomenology of deep metatube states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 354.585,
    "end": 359.926,
    "text": "And this then will allow us to draw our conclusions and present ongoing related projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 363.547,
    "end": 366.088,
    "text": "So let's come back to the sense of self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.328,
    "end": 368.948,
    "text": "So in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 372.699,
    "end": 379.564,
    "text": " When one has to investigate the sense of self, of course, as I said, it's a wide concept.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 380.125,
    "end": 387.43,
    "text": "So many definitions and characterization of the sense of self has come up in philosophy and cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.45,
    "end": 394.735,
    "text": "So we have terms like minimal self, self-experience, selfhood, sense of ownership, and all of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 395.616,
    "end": 401.14,
    "text": "And for Arthur Clarke, I think we have just to stick to a common definition,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.264,
    "end": 416.81,
    "text": " that comes, for example, from a similar paper from Gallagher 2000 that defines it as a multidimensional construct composed by minimal or embodied components and narrative or reflective components.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.19,
    "end": 427.155,
    "text": "So to unpack a little bit these two concepts, the minimal or embodied experience of the sense of self is the basic implicit functioning of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 428.413,
    "end": 430.455,
    "text": " body of the ongoing moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.495,
    "end": 437.781,
    "text": "So the stream of experience that happens to me right now can be defined as my minimal sense of self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 437.841,
    "end": 446.488,
    "text": "So I don't really need to have an explicit knowledge about myself to have this kind of dimension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 448.029,
    "end": 454.394,
    "text": "And these can be further unpacked through the concept of pre-reflective self-consciousness that comes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 455.409,
    "end": 473.272,
    "text": " from a phenomenological tradition, tracing back from Bach to Menlo-Ponty, argue that part of our self-consciousness does not really need any reflection to happen there, or implicit, explicit thought.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.753,
    "end": 480.994,
    "text": "It happens, in a way, tambourine is consciously before reflection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.843,
    "end": 487.13,
    "text": " And then on top of this, we build our narrative or our reflections about ourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.33,
    "end": 495.881,
    "text": "And this is more linked to self-identification processes or self-monitoring, self-recognition and introspection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.921,
    "end": 499.705,
    "text": "Introspection is the ability of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.855,
    "end": 507.579,
    "text": " introspective, so perceive yourself or reflect about yourself in an explicit way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 508.44,
    "end": 516.026,
    "text": "So you do need to have a biography or an explicit memory about yourself in order to tackle this aspect of the sense of self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.987,
    "end": 524.092,
    "text": "So in deep mental states, there is alterations in the sense of self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 524.978,
    "end": 530.243,
    "text": " And it's up to debate which dimension are affected by that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.943,
    "end": 541.513,
    "text": "And it's far from clear what actually happens to this kind of dimension and many more other dimensions of the sense of self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.694,
    "end": 546.197,
    "text": "And we are here to unpack a little bit this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.117,
    "end": 549.339,
    "text": "We propose these quotations from fashion 2008.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.963,
    "end": 580.363,
    "text": " uh where um it's suggested that in during deep massive states one experiences oneself as this very moment of consciousness this is a quotation that may reveal some uh position about this um the debate what happens to the sense of self so in this case it's argued that meditation reveal a very moment of consciousness so there is something uh that is true consciousness",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 581.371,
    "end": 584.853,
    "text": " or something that is the real consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.473,
    "end": 589.335,
    "text": "And this actually has brought to the concept of pure consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 589.855,
    "end": 599.42,
    "text": "So something that stays there and it's purified by everything, by almost the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 599.9,
    "end": 603.261,
    "text": "And there is so many definitions of this pure consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 603.341,
    "end": 610.605,
    "text": "We brought some examples like ownerless consciousness, the consciousness that doesn't have an owner, that doesn't have a self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 611.624,
    "end": 617.408,
    "text": " so it doesn't have a proper sense of self that owns this consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.629,
    "end": 626.214,
    "text": "Metzinger has worked on the meaning of phenomenal experience, defining an atemporal dimension of consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 627.335,
    "end": 634.059,
    "text": "And this is very supported because it's consistent with the Buddhist philosophical stand of no-self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 634.36,
    "end": 637.602,
    "text": "For most of the tradition of Buddhism,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.54,
    "end": 640.221,
    "text": " There is no self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.441,
    "end": 642.422,
    "text": "The self is an illusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 642.783,
    "end": 654.531,
    "text": "And it comes to our psychology when we enter in contact with the world and with the sensations of the world and certain patterns of behavior that elicit the sense that we have a self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.333,
    "end": 668.262,
    "text": "So as I said, meditation allows us to access this pure consciousness for support of this thesis and reveals one's true and essential nature and subjectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 669.299,
    "end": 672.4,
    "text": " And we bring this into debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 673.64,
    "end": 684.943,
    "text": "There are also people that argue against this and it's called, it has been called by Matthew during their special issues, the ubiquity thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.823,
    "end": 697.866,
    "text": "So the ubiquity thesis claimed that the sense of self is ubiquitous to all states of consciousness and sometimes it appeals to the immunity to error through misidentification",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 698.956,
    "end": 718.145,
    "text": " argument of self-assumption reports which is simpler than this long name and it's basically the fact that I can say that I had a wonderful experience or I can and this wonderful experience may be true or false this is a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 719.667,
    "end": 722.269,
    "text": " On this weekend, I can do mistakes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.71,
    "end": 723.51,
    "text": "I can make mistakes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 723.991,
    "end": 730.115,
    "text": "But I cannot not say that I didn't have this wonderful experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.436,
    "end": 735.8,
    "text": "Because the moment in which I report, I have a perspective on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 736.02,
    "end": 739.122,
    "text": "So I cannot really be mistaken on the fact that I'm reporting this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 739.523,
    "end": 740.383,
    "text": "Maybe I was dreaming.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 740.523,
    "end": 742.425,
    "text": "Maybe it wasn't a wonderful experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 742.765,
    "end": 744.606,
    "text": "But it's me that I'm reporting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.626,
    "end": 747.989,
    "text": "So the moment I'm reporting this, it means that I have to be there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.198,
    "end": 756.724,
    "text": " And this applies also to when I ascribe myself a selfless state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.944,
    "end": 758.645,
    "text": "I had a selfless state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.045,
    "end": 760.306,
    "text": "This is very controversial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 761.927,
    "end": 766.411,
    "text": "Other problems on top of that are cross-cultural problems also addressed in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 767.031,
    "end": 776.498,
    "text": "So this experienced selfless state may be influenced by certain vows or certain beliefs that meditators are endorsed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.689,
    "end": 796.723,
    "text": " especially during especially expert meditators and the other thing is these all cross-cultural analyses and debates about the self may be also partially due to our verbal",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 798.13,
    "end": 811.193,
    "text": " misunderstanding, so that the Western philosophy may have problems about itself, that actually the Eastern philosophy is not really addressing, so there might be some incommensurability of problems there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 811.993,
    "end": 823.075,
    "text": "But as also we said in the paper, it's not that we want to address the Buddhist philosophical problems, but rather we want to bring insight from these to our problems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.175,
    "end": 831.496,
    "text": " So, given this debate, we want to propose a shift in the focus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 831.716,
    "end": 839.418,
    "text": "So, we don't want to start by looking at consciousness and trying to solve things about the self, but we want to start by focusing on the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 840.038,
    "end": 846.34,
    "text": "So, we propose a shift in focus in the bodily experience, examining this deep, massive state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.101,
    "end": 853.762,
    "text": "So, let's start by the subjective experience of the body or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 854.127,
    "end": 857.588,
    "text": " the study of the subjective experience of the body, which is phenomenology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.709,
    "end": 861.63,
    "text": "In the tradition, our body has a unique status.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 862.71,
    "end": 868.492,
    "text": "So the anatomical structure of the body has been called by usurper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 868.772,
    "end": 873.234,
    "text": "So the living body, the body that I can observe and others can be observed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.254,
    "end": 876.675,
    "text": "So it's the object among the other object, they would say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.535,
    "end": 878.876,
    "text": "But it's not only that, because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.597,
    "end": 882.519,
    "text": " it's an object that I can live from inside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 883.019,
    "end": 888.524,
    "text": "So it has been called the libe, the lived body, or the body as I live it from inside, as I said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.585,
    "end": 894.288,
    "text": "So what happens to this kind of dimension again?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 894.628,
    "end": 899.052,
    "text": "We can unpack this and see how the meditation states affect them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 899.993,
    "end": 908.759,
    "text": "So from the point of view of the libe, the lived body, we already know and I will unpack a little bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 909.858,
    "end": 921.748,
    "text": " We have already said that we have called unlimited body experiences, the reports that spoke about this fading of the body boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.768,
    "end": 928.233,
    "text": "So the body boundary has been defined as a cognitive emotional perception of one's bodily surface, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 928.273,
    "end": 929.434,
    "text": "That's just a definition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 930.231,
    "end": 938.953,
    "text": " We can also debate about this, but what it's important for us is that our sense of body boundaries is flexible and dynamic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 939.173,
    "end": 944.213,
    "text": "It's not fixed because we are in the realm of the body as felt from inside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.074,
    "end": 954.675,
    "text": "There is an interesting study that exemplified this concept in relation to meditation and it's by John Brown in 2016, though it has worked further on this as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 959.602,
    "end": 980.669,
    "text": " But I find it interesting to look at this image because this is part of a self-report measurement that they used on a sample of people that has been trained in meditation, in particular with the body scanning, so that people had to systematically scan sensation rising in the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 981.889,
    "end": 984.99,
    "text": "And the result is that in less than four",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.214,
    "end": 1012.235,
    "text": " months of practice so not actually not the expert they already started to report an increased tendency to go towards the almost imperceptible perception of the body so they conclude that meditation can be actually studied in this sense where it affects our sense of body boundaries and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1013.591,
    "end": 1026.062,
    "text": " they saw significant results also in relation to increased mood, happiness and decreased anxiety and rumination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1026.703,
    "end": 1029.706,
    "text": "This is another story that will come back later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.322,
    "end": 1035.943,
    "text": " I find interesting also this quotation by Fink.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1036.804,
    "end": 1042.426,
    "text": "Here in this paper, it's talking about why ego dissolution may be better understood as ego expansion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1043.486,
    "end": 1049.888,
    "text": "And then ego dissolution becomes a later interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.269,
    "end": 1053.13,
    "text": "And so I will read it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.75,
    "end": 1061.893,
    "text": "It's not the feeling of self that dissolves, but the boundary between a feeling of self and the feeling of anything else in consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.947,
    "end": 1064.989,
    "text": " So here again, Pinky is talking about consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1065.729,
    "end": 1073.895,
    "text": "But from our perspective, this position is pretty informing because it goes in our direction as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.976,
    "end": 1079.32,
    "text": "Because he says, it's not that you're losing really yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.8,
    "end": 1088.667,
    "text": "This experience is dependent on how you actually perceive your boundary with you and what you don't consider you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1088.767,
    "end": 1092.75,
    "text": "So fading of the self-other distinctions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1093.444,
    "end": 1093.864,
    "text": " ability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1096.546,
    "end": 1116.436,
    "text": "So here it comes, predictive processing acting from framework, because we want to basically breach these phenomena, subjective experiences, phenomena and underlying mechanistic explanations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.515,
    "end": 1128.725,
    "text": " Indeed predictive processing activities have recently been used for this purpose, also meditation research and psychopathology research and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1129.446,
    "end": 1140.836,
    "text": "So in this presentation I will use them in an interchangeable way, following certain trends, but it doesn't have to be, it is also under debate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1142.674,
    "end": 1150.759,
    "text": " And I will also give a purely, I don't know how to say it, theoretical perspective on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.339,
    "end": 1154.461,
    "text": "I will not go too much technical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1154.781,
    "end": 1169.47,
    "text": "So briefly, this framework considers brains as predictive machine, or as Frisson likes to say, consider brain as a fantastic organ.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.062,
    "end": 1178.864,
    "text": " which is because it's not only able to do amazing things, but also because it really generates fantasies about the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.444,
    "end": 1199.288,
    "text": "And this is because in order to act, interact with itself and the world around, the brain constantly anticipates the current state of affairs in order to make sense of the sensorium or the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.192,
    "end": 1228.139,
    "text": " uh stream of experiences that happens and so on uh so it possesses or embody or uh utilizes it depends on the commitment uh a generative model which is a model that uh take keep tracks or regularity of the world and forms prediction out of it in a hierarchical way so highly prediction uh goes down to match uh sensory data",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1229.829,
    "end": 1239.396,
    "text": " and sensory data goes up to map to affect the predictions to update the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.797,
    "end": 1248.703,
    "text": "However, every prediction comes with a degree of error, which sometimes is called prediction errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1249.303,
    "end": 1258.21,
    "text": "So this prediction error is a discrepancy between prediction and sensory input so that a new model is generated and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.593,
    "end": 1275.623,
    "text": " they say the first imperative or the only imperative of the system is actually minimizing the prediction errors so that the model can more efficiently cope when interacting and acting in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1276.764,
    "end": 1288.272,
    "text": "However, it's not the only imperative because, as I will introduce in this slide, the system has also to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.422,
    "end": 1301.912,
    "text": " estimate the confidence or likelihood or precision of prediction in order to evaluate the prediction errors that are coming from the discrepancy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1303.073,
    "end": 1314.561,
    "text": "So that the generative model has to compute in a fine way how much precision to assign to the prediction or prediction errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1316.123,
    "end": 1317.764,
    "text": "And I choose this image",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1318.65,
    "end": 1329.496,
    "text": " because it renders how the distributions are set depending on the precision of the situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.536,
    "end": 1337.701,
    "text": "So if you have a precise prediction error, then the posterior distribution will be closer to the prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.961,
    "end": 1347.587,
    "text": "While the imprecise prediction error has little effect on the prior, so the posterior distribution will be closer to the prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.069,
    "end": 1366.837,
    "text": " And this is very important because if the precision estimates are not weighted correctly, then the system generates false inference that will not enable the system to interact efficiently and update model efficiency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1367.597,
    "end": 1375.44,
    "text": "So far, we have mostly talked about prediction error minimization by updating the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.956,
    "end": 1391.004,
    "text": " However, the system can also active sample the world, active modify the prediction error of the world in order to fit the prediction errors to the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1391.865,
    "end": 1398.428,
    "text": "And this comes into play active inference that builds upon the free energy principle where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1400.706,
    "end": 1411.931,
    "text": " is based on the idea that living organisms maintain themselves with an optimal set of states that comes from the second law of thermodynamics of Schrödinger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.953,
    "end": 1427.479,
    "text": "So, given that it comes into play how attention is analysed or examined under this framework,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.522,
    "end": 1455.761,
    "text": " so given that the organism has to maintain within these optimal assessor states by maintaining an optimal balance between computation and precision optimization so weighting between prediction and prediction errors attention comes into place as a modulation of this precision of sensory data working as a search light so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1456.801,
    "end": 1460.302,
    "text": " In other words, it optimizes signal-to-noise ratio.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.382,
    "end": 1472.787,
    "text": "It's one of the ways that we have to put in place this local optimization of precision estimates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1473.607,
    "end": 1474.687,
    "text": "And this is very important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1475.628,
    "end": 1477.268,
    "text": "Why we bring it into attention?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1477.668,
    "end": 1485.691,
    "text": "Because meditation has a systematic and a restorative use of attention resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1488.138,
    "end": 1493.04,
    "text": " And we'll come back into that a bit further on in this presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.08,
    "end": 1503.862,
    "text": "And given that we are interested in, okay, we have seen the lived body, what happens to the phenomena experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.362,
    "end": 1515.105,
    "text": "Now we're interested in what happens to the corporate, what happens to the living body that can be observed by the organism during medicine states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1516.735,
    "end": 1533.383,
    "text": " And this brings into play other two important concepts in active inference, which is a way to self-regulate the underlying all embodied experiences, so all subjective experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.364,
    "end": 1539.166,
    "text": "So two ways, or one way that then is also active.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1539.707,
    "end": 1550.531,
    "text": " So the first way is homeostasis, which is the maintenance of required optimal state by survival and reproduction of self-organizing biological systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1550.571,
    "end": 1564.115,
    "text": "So for example, I'm cold and I use my internal resources to keep my state into optimal state, so I start shivering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1564.635,
    "end": 1566.316,
    "text": "However, I can also put in place",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.449,
    "end": 1572.651,
    "text": " active modification in the world so that I'm not cold anymore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1573.591,
    "end": 1574.892,
    "text": "So, for example, I take a blank.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1575.292,
    "end": 1584.075,
    "text": "This is called allostasis, so it's active engagement and modification of the environment in order to maintain myself in optimal states for survival.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1585.776,
    "end": 1595.56,
    "text": "So we can say, of course, human bodies are self-regulating biological system aiming at keeping these internal states within a certain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1596.516,
    "end": 1597.677,
    "text": " viable range for survival.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1599.178,
    "end": 1604.801,
    "text": "Now, given that, we will come back again to phenomenology off-touch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.641,
    "end": 1612.405,
    "text": "I'm going to do this for the second time to then wrap up everything again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1612.425,
    "end": 1618.509,
    "text": "So, we have talked about phenomenology of the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1619.449,
    "end": 1624.192,
    "text": "However, we haven't underlined the importance that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.602,
    "end": 1629.287,
    "text": " the touch and proximal sense has for our lived body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1629.987,
    "end": 1642.28,
    "text": "So our, as Chao Nuka and colleagues has already proposed, our proximal sense are central for our minimal sense of self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1643.761,
    "end": 1647.725,
    "text": "And on top of that, we bring into",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1649.308,
    "end": 1655.031,
    "text": " play the fact that different kinds of touch can convey different experience of the sense of self or sense of boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1655.632,
    "end": 1667.378,
    "text": "So, for example, imagine yourself that you are in a city of Portugal or California and you touching the whole environment with your body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1668.438,
    "end": 1676.503,
    "text": "You may feel that you have a sense of immersiveness or that your body boundaries are slowly becoming less clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1677.239,
    "end": 1690.048,
    "text": " And this experience is actually a bit similar to the experiences of sensory deprivation states, where people are put in a salty water and they let them flow for some moments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.109,
    "end": 1702.217,
    "text": "Sensory deprivation states are not really, really all deprived because you have other activities in the body and movements that produce signals that you are actually aware of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1703.157,
    "end": 1705.639,
    "text": "However, in both these experiences,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1706.109,
    "end": 1708.35,
    "text": " the body boundary seems to fade a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.17,
    "end": 1721.176,
    "text": "However, if you're in the scene and you're swimming and then you touch the rock with your hand, you clearly will feel yourself as separated, as something different from what you're actually touching, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1721.576,
    "end": 1722.436,
    "text": "Sense of separation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1724.757,
    "end": 1735.442,
    "text": "This phenomenology can be brought into active inference through the mechanism of somatosensory attenuation, which comes from the sensory attenuation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1736.269,
    "end": 1742.776,
    "text": " So this process happens when the system anticipates its own action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1744.157,
    "end": 1747.18,
    "text": "So, for example, I take a glass.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.742,
    "end": 1756.329,
    "text": "And in this moment, my renaissance has already created efferent copies of this action and the sensory consequences of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1756.83,
    "end": 1758.031,
    "text": "So whenever I grab these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1761.469,
    "end": 1789.428,
    "text": " this class the sensory concept that happens to my body are slightly attenuated and this is why we cannot tickle ourselves because the prediction earth comes at not surprising this has a implication for our embodied experience in the world because we are feel that we are immediately in immediate contact with ourself in the world and this is because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1791.118,
    "end": 1803.485,
    "text": " Our conscious experiences are mediated by transparent or non-perceived cognitive processes, so that the system can leave behind or disattend self-related sensory processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1803.785,
    "end": 1810.829,
    "text": "And these allow to allocate resources to perception and action involved in the processing of the object of interest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1811.709,
    "end": 1818.133,
    "text": "So, for example, when LeMans can present this example of the cherry, when I have to take a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1818.863,
    "end": 1830.428,
    "text": " object that is salient for me, I'll be much more interested in picking the object and I will not really focus on my arm in picking that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1831.489,
    "end": 1838.872,
    "text": "So that the system needs to compute and maintain a fine balance between external and internal components of somatosensory intonation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1839.673,
    "end": 1842.154,
    "text": "And this is very important for the sense of self as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1845.515,
    "end": 1855.977,
    "text": " We need to understand, and it's not that we need, but in order for us to have a sense of self, we normally have a sense of what we are and what we are not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1856.537,
    "end": 1866.099,
    "text": "But for the brain, it has to, or as agents that end up with the brain, we compute this distinction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.139,
    "end": 1873.381,
    "text": "So where the self ends and where it begins, or do I move my arm, or my arm is moved by something or someone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1875.222,
    "end": 1891.194,
    "text": " So amatocentric attenuation plays a role in these distinctions and in building multi-sensory bodily self-representations, so that the sense of the self and body is subjectively and phenomenally transferred.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.334,
    "end": 1895.897,
    "text": "That means that when we act in the world and we interact, we normally disattend",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1899.585,
    "end": 1904.848,
    "text": " way we are in the world, because we need to be in direct contact with the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1904.908,
    "end": 1919.095,
    "text": "If we always attended to our body and our self in the sense that we will be hyper-reflexive, then we will be impaired in what we normally do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1919.195,
    "end": 1922.197,
    "text": "And this is actually a condition that we will talk about later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.965,
    "end": 1930.331,
    "text": " inactive units in the sense of self is an ongoing inferential process entering the body.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.351,
    "end": 1936.939,
    "text": "So what we propose is what is lost during selfless experience",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.589,
    "end": 1942.69,
    "text": " is an ordinary way to mentally model self in relation to the body and the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.291,
    "end": 1956.514,
    "text": "So that if we think about the self as I propose here, the iceberg, where the narrative tells you what we see, but the renewal of self is what we actually are composed of, and it's actually larger, what we are not aware of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1957.174,
    "end": 1966.257,
    "text": "Similarly, when we have self-experience, we may have also this inferential process where we think we have lost our self",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1969.322,
    "end": 1982.207,
    "text": " However, we have gathered some evidence in the fact that meditation facilitate autonomic regulation involved in homostatic processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.288,
    "end": 1989.31,
    "text": "That means, for example, that meditation increase the synchronization of cardiac and respiratory system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1991.536,
    "end": 2000.583,
    "text": " This is connected with reduced levels of blood glucose or blood pressure and heart rate variability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2003.465,
    "end": 2013.773,
    "text": "So meditation helps to successfully self-regulate the body, especially in comparison to stress that actually does the opposite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2016.895,
    "end": 2019.417,
    "text": "And on top of that, meditation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2020.031,
    "end": 2023.974,
    "text": " help us to attune us to our physiological interceptive awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.175,
    "end": 2047.755,
    "text": "And this, it does it so, they say, by enhancing the processing of interceptive-interceptive stimuli, which doesn't have to be understood as a maladaptive increased body awareness, but rather an adaptive body awareness, which is a distinction that we can come back to later if you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2048.729,
    "end": 2050.61,
    "text": " if people are interested or they ask about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2054.591,
    "end": 2061.034,
    "text": "These evidence are also in line with evidence of meditation that promotes self-regulation of pain and pain and placement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2061.074,
    "end": 2077.841,
    "text": "So through the attentional training that meditation allow, you're actually able to self-regulate the pain and not really like the sensation of the pain because it actually gets",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.616,
    "end": 2086.643,
    "text": " very fear, but the automatic behavioral patterns that comes in association with the pain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2087.663,
    "end": 2093.708,
    "text": "So there is also self-regulation on emotions and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2095.61,
    "end": 2108.12,
    "text": "So the body does not literally disappear, it actually stays at the very center, as I propose here, at the center, as we propose it in the paper and I propose it through this image, at the center of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2111.74,
    "end": 2124.447,
    "text": " So self-regulatory processes allow the subjective experience to lose oneself so that the sense of the body remains present in the background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2125.187,
    "end": 2137.414,
    "text": "And this, for example, it's very clear from this report from a person undergoing this kind of experience that they say that there remains a sense that there is a body",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2137.901,
    "end": 2140.442,
    "text": " without any experience of a sense of boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2144.842,
    "end": 2153.664,
    "text": "So, this is not the very last slide, but we come to the wrap-up of our claim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2155.945,
    "end": 2160.766,
    "text": "Attenuating the Self, Unlimiting the Body, which is also the title of our paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2162.671,
    "end": 2176.657,
    "text": " Starting from the fact that all medicine practices across the tradition require systematic and currently fully crafted body preparation to enter this deep methodic selfless state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.257,
    "end": 2188.742,
    "text": "So it doesn't happen that all of a sudden you just have a selfless state, which actually may happen more similarly with psychedelic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.162,
    "end": 2190.423,
    "text": "But with meditation, you need...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2192.062,
    "end": 2212.748,
    "text": " You need to castrate gradually many different state or many different level of concentration that happens when you have around a predictable environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2213.008,
    "end": 2215.749,
    "text": "And you do so by building prior expectation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.429,
    "end": 2221.831,
    "text": "So you have to keep your body in a certain position of posture, as you say in this image,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2222.349,
    "end": 2229.775,
    "text": " The person is seated with a very straight, not very, but a straight back, relaxed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.015,
    "end": 2231.616,
    "text": "This is very important realization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.057,
    "end": 2233.178,
    "text": "Bend the legs and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.619,
    "end": 2248.91,
    "text": "And then you need, at least in the most part of your practice, you need safe, predictable environments with temperature that enables you to maintain your homostatic analysis and processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2251.089,
    "end": 2255.771,
    "text": " So all these conditions are necessary for your successful homostatic self-regulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2257.411,
    "end": 2276.199,
    "text": "In this sense, when these first parts of preparation to enter, then after the state of concentration, the meditator can let go and leave behind self-related processes and process the body transport, or it can attenuate them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.679,
    "end": 2277.619,
    "text": "The body can be attenuated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.837,
    "end": 2294.563,
    "text": " So our claim is that a transfer of essential cells in the body may underline the phenomenology of losing oneself and blurring body boundaries, as reported during meditative states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2298.145,
    "end": 2306.709,
    "text": "So our conclusion is that we have proposed a shift in focus on homostatic body self-regulation in examining deep meditative states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2308.424,
    "end": 2314.549,
    "text": " The experience of having a body, a living, self-organized and biological system is never lost in this process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2315.41,
    "end": 2330.122,
    "text": "Rather, it stays transparent at its very center, self-attenuated, yet very much present and hands-alive, so that the self-mode is attenuated to become transparent and hands-processed in the background.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2331.923,
    "end": 2335.806,
    "text": "Now, giving this conclusion, I'm going to present related projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2336.047,
    "end": 2337.188,
    "text": "The first one is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2339.309,
    "end": 2341.769,
    "text": " still on the theoretical side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.45,
    "end": 2346.37,
    "text": "So we are in the realm of active inference model in meditation research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2346.97,
    "end": 2366.674,
    "text": "There is already literature about that, that have studied different kinds of meditation techniques, like focused attention, open monitoring, non-dual awareness, and they all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2367.893,
    "end": 2374.978,
    "text": " a study from Lacanen in 2023 or Lacanen and Zlachter in 2021.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2377.119,
    "end": 2386.105,
    "text": "They have, for example, showed that these attention techniques profoundly alter typical mental experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2388.827,
    "end": 2393.97,
    "text": "And for example, focused meditation is the meditation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.578,
    "end": 2400.662,
    "text": " that engage attention on one specific object experience, for example, the breath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2402.583,
    "end": 2415.454,
    "text": "And in active inference theory, it means that precision is estimated one sensory input, which means that it reduces the impact of the other thoughts and parallel processes that are going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.675,
    "end": 2423.62,
    "text": "Or open monitoring meditation is the engaging of attention to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.338,
    "end": 2443.924,
    "text": " one's experience as a whole, so the whole stream of experience without selecting anything in particular, so that in an activatory terms, it has been described as assigning equal precision to all these experiencing, promoting non-reactive sensing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2444.004,
    "end": 2449.666,
    "text": "And this is connected also why meditators are good in self-regulate pain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2453.246,
    "end": 2465.293,
    "text": " So we will also build our model on self-modelling based on the previous literature, which is in preparation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2467.875,
    "end": 2479.282,
    "text": "And then going experimental, we want to bring into the table applications of what we are researching and potential benefits maybe for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.266,
    "end": 2505.113,
    "text": " uh case or people or yeah individual that suffer from disrupted body awareness uh or disrupted self-awareness and there is a uh relatively recent condition that has been um studied that is the personalization so the personalization um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.945,
    "end": 2509.046,
    "text": " is the destruction of both body and self-awareness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2509.166,
    "end": 2512.447,
    "text": "And it's a very heterogeneous condition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2512.487,
    "end": 2516.488,
    "text": "There is a lot of different dimensions that occurs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.148,
    "end": 2532.633,
    "text": "But generally, it's connected with feelings of heaviness, disconnection, feeling the body as an object rather than a transparent medium of experience, which simply is called disembodiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.238,
    "end": 2542.325,
    "text": " It is linked with difficulties in concentration and attention, often comorbid with depression, rumination and anxiety.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.285,
    "end": 2552.393,
    "text": "And recently, Chaunuka and colleagues have also proposed aids characterized by failures in attenuating somatosensory signals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2554.134,
    "end": 2561.42,
    "text": "So, based on what we have previously said, and based on how these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2562.984,
    "end": 2567.987,
    "text": " condition affects a large number of population.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2568.067,
    "end": 2571.269,
    "text": "We want to test certain hypotheses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.83,
    "end": 2581.135,
    "text": "So the first one would be that higher somatosensory attenuation correlate with more feeling of aliveness and wide openness in experienced meditators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.736,
    "end": 2591.481,
    "text": "And rather lower somatosensory attenuation correlate with feelings of unrealness, deadness in people experience deeper rationalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2593.7,
    "end": 2604.146,
    "text": " And on the other hand, severe homostatic dysregulation of bodily states during deep meditation states may lead to negative emotional outcomes and a burnout self-experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2604.806,
    "end": 2619.055,
    "text": "This comes to the fact that the personalization and meditation can both create stressing negative outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2619.295,
    "end": 2622.977,
    "text": "And it's interesting to see how this happens and what are the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2623.459,
    "end": 2625.58,
    "text": " commonalities and differences in that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2627.24,
    "end": 2641.346,
    "text": "And also we have dealt in the realm of spatial temporal perception, which is connected also with mood disorders or like depression and anxiety, and also with depersonalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2642.726,
    "end": 2649.749,
    "text": "However, in depersonalization, there is no specific items in the questionnaire that is usually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2651.183,
    "end": 2655.605,
    "text": " used for measuring, which is the Cambridge Depersonalization Scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2655.985,
    "end": 2658.346,
    "text": "So we want to test this as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.287,
    "end": 2668.351,
    "text": "And we want to test it in people reporting selfless and disembodied experience, so both pathological and non-pathological conditions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2670.352,
    "end": 2674.254,
    "text": "So part of these hypotheses we are already going through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2675.776,
    "end": 2686.6,
    "text": " This is our team coming from Humboldt University, where I come from as well, Simon Gwendelman, but also University College London with Ines and Joseph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.101,
    "end": 2691.582,
    "text": "The first study is, as I said, about time perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2691.622,
    "end": 2702.506,
    "text": "So we want to analyze how people with high rates of depersonalization correlate with dimension of the time perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.526,
    "end": 2705.067,
    "text": "So they are more future-oriented,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.118,
    "end": 2707.759,
    "text": " or more negative oriented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.099,
    "end": 2730.167,
    "text": "Our hypothesis is that they're more negative past oriented, so they're stuck in a very long present moment, but also the tendency of ruminating, so always going to past negative memories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2733.129,
    "end": 2739.011,
    "text": " Since this is titled Lasting Dark Times, the effect of the personalization experiencing on time perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.712,
    "end": 2750.155,
    "text": "And these, we are already in the analysis of the data, but it's an ongoing still study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.835,
    "end": 2753.516,
    "text": "So we have preliminary data on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2755.537,
    "end": 2762.099,
    "text": "Well, studies too, we're in the recruitment phases, but we're almost there and encompassed",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.304,
    "end": 2768.727,
    "text": " individual with high traits of the personalization and meditators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.687,
    "end": 2780.393,
    "text": "I want to see through a set of questions and a behavioral task, how they may differ in the sense of self, body and emotion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2780.473,
    "end": 2790.958,
    "text": "Of course, they are very wide and complex concepts, so there is always room for feedback and replication and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2795.393,
    "end": 2815.152,
    "text": " We have selected this task, the EMBODY task, adapted from NU-MENMA, where individual participants have two-coloured parts of the body in relation to activations that they feel by reading certain emotional stories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2816.926,
    "end": 2837.194,
    "text": " These stories are supposedly invalidated to elicit certain emotions in the body, and then people color parts of the body, and then we will see how people with high traits and depersonalization imitators will differentiate this, and we will also compare with other questionnaires that we have put this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2837.474,
    "end": 2845.037,
    "text": "And potential title is Emotional Body Maps of Self-Detachment in Depersonalization and Meditation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2846.112,
    "end": 2848.333,
    "text": " And with this, I thank you all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2849.354,
    "end": 2850.535,
    "text": "And that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2850.575,
    "end": 2852.576,
    "text": "We are open for discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2852.836,
    "end": 2853.217,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2853.237,
    "end": 2858.98,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.741,
    "end": 2861.022,
    "text": "Thank you very much, Valeria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.202,
    "end": 2863.283,
    "text": "You are muted, Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.664,
    "end": 2865.104,
    "text": "Thank you, Valeria.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.124,
    "end": 2865.264,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.284,
    "end": 2866.585,
    "text": "Of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.266,
    "end": 2867.446,
    "text": "Well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2870.407,
    "end": 2872.529,
    "text": " very fascinating presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.25,
    "end": 2885.4,
    "text": "Perhaps Anna first and then our other colleagues who have joined would be awesome to hear your path to be here on this work and any reflection or questions you have on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2890.305,
    "end": 2891.025,
    "text": "Is it my turn?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.766,
    "end": 2892.026,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2892.046,
    "end": 2892.547,
    "text": "Did I miss?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.007,
    "end": 2893.167,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2895.319,
    "end": 2900.605,
    "text": " Yeah, so obviously I don't have many questions because it's like we wrote this together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2902.848,
    "end": 2913.161,
    "text": "But I think what I would like just to add, that's really a question, is I'd really like to see...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.234,
    "end": 2940.59,
    "text": " um so for for instance like in um in ideal world would be nice to you know uh get all the um the traditional meditative experiences and how they relate to the body and make a very precise prediction and what exactly they will kind of like predict in terms of uh certain um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2942.334,
    "end": 2948.582,
    "text": " sensory experiences and how this can be interpreted through different theoretical lenses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2948.642,
    "end": 2952.506,
    "text": "I think that could be really, really interesting because I think one of the problems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2953.912,
    "end": 2961.274,
    "text": " The challenges that we have right now is that we have so many concepts, so many approaches scattered all over the map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2961.755,
    "end": 2972.658,
    "text": "And I think it would be really nice to narrow it down because, as you said, Daniel, so everybody knows what meditation is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2973.098,
    "end": 2978.52,
    "text": "Everybody knows at least one person that meditates in life and everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2978.56,
    "end": 2982.001,
    "text": "But it's really unclear what exactly we are after.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2983.221,
    "end": 3002.828,
    "text": " and why in certain cases this is kind of like beneficial and one is in other cases basically it has a negative consequences and this is why precisely we are doing this our project on our depersonalization and meditation and i can share with you informally scoop",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3004.048,
    "end": 3015.435,
    "text": " But data is here, so we can share with... So what we did in this project, basically, we took people with typical controls that don't have the personalization and never meditated, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.475,
    "end": 3017.897,
    "text": "So it's kind of like, yeah, never did that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.499,
    "end": 3027.265,
    "text": " And then we took people that meditated, and then we looked at whether they have kind of like high or low traits of depersonalization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3027.285,
    "end": 3031.508,
    "text": "And then we took people with depersonalization that never meditated, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3033.089,
    "end": 3038.012,
    "text": "So we have this inclusion and exclusion criteria.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3038.372,
    "end": 3042.695,
    "text": "And yeah, it's really interesting to find what our findings is like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3042.735,
    "end": 3047.759,
    "text": "It's really difficult to find people that have experience with meditators",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3048.719,
    "end": 3064.549,
    "text": " and low depersonalization skills low depersonalization traits right so most of them they actually have high depersonalization but then it's interesting to see how that contrasts with like the people that have the personalization and no meditation experience right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3066.129,
    "end": 3086.234,
    "text": " So that's something I would like to carry on and, yeah, so to reach the community and, yeah, that's something we will definitely carry on with Valeria and the next steps and also with some people that I have here in the chat, Julia and Simone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3087.474,
    "end": 3093.356,
    "text": "So Simone will going to work with us on also for some other sensory attenuation, yeah, through different senses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3094.216,
    "end": 3100.681,
    "text": " And Julia, we have some, without scooping, we have also some very, very interesting results coming up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3101.921,
    "end": 3108.026,
    "text": "We just finished data collection on intentional binding and depersonalization, so related to the sense of agency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.81,
    "end": 3113.073,
    "text": " So, yeah, so that's all from me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3113.113,
    "end": 3124.784,
    "text": "It's just like for now we're kind of like in between because we represented very well like the theory part and the studies are literally just getting hot from the over now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3124.964,
    "end": 3130.208,
    "text": "And we hope that in September it's like we're going to get them out there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3130.649,
    "end": 3130.849,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.43,
    "end": 3132.511,
    "text": "But the data is in the box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3132.671,
    "end": 3133.872,
    "text": "So that's very exciting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.972,
    "end": 3135.373,
    "text": "And yeah, we have the results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.174,
    "end": 3136.294,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3138.126,
    "end": 3164.469,
    "text": " you danielle again for uh this platform it's really nice and as i said i really hope that after this discussion we'll have more um um you know opportunities to change exchange and um yeah discuss we also plan to organize something around alteration of self-consciousness in across various conditions and also the personalization in lisbon next year so maybe you can cross the pond",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.769,
    "end": 3168.71,
    "text": " And check for yourself that we have a nice airport in Lisbon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3169.09,
    "end": 3169.31,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3171.611,
    "end": 3171.891,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3171.951,
    "end": 3175.452,
    "text": "Well, good to get the appetizer before the entree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.792,
    "end": 3186.635,
    "text": "So that's very awesome about just how much theory and even unconventional scientific theory like world knowledge traditions come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.875,
    "end": 3194.317,
    "text": "And then what it looks like to take that experimental step to make it scientific is definitely what I saw in the talk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.807,
    "end": 3200.31,
    "text": " Julia or Simone, do you want to give any reflection or any thoughts or questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3201.411,
    "end": 3203.772,
    "text": "Yes, I actually have a... Can you hear me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.673,
    "end": 3204.813,
    "text": "Yep."
  },
  {
    "start": 3205.253,
    "end": 3207.555,
    "text": "I actually have three questions, I noted down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.336,
    "end": 3220.363,
    "text": "I think the first one, because it's just for me personally, I'm curious about that, is that those deep meditative selfless states, I think they can also be reached while doing yoga, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.428,
    "end": 3226.291,
    "text": " Basically, the opposite of sitting still is like a sort of repetitive movement, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.931,
    "end": 3233.214,
    "text": "So I'm wondering, do those movements have to be perfectly predictable in order to be attenuated and then reaching the same state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.314,
    "end": 3236.216,
    "text": "Or is that like a different concept?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.476,
    "end": 3239.838,
    "text": "Or how do you put that in your framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.319,
    "end": 3243.74,
    "text": "Can I answer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3244.701,
    "end": 3247.442,
    "text": "I think here you brought mainly to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3250.206,
    "end": 3251.067,
    "text": " two topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3251.607,
    "end": 3259.111,
    "text": "One is, is it possible to reach the metatarsal states also not sitting in a still position?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.191,
    "end": 3260.092,
    "text": "And the answer is yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.014,
    "end": 3265.955,
    "text": "However, there is not so much research on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.415,
    "end": 3276.561,
    "text": "So I can talk about anecdotical knowledge, but I did not read so much about walking meditation in fact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3277.642,
    "end": 3279.143,
    "text": "Usually walking meditation or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3280.548,
    "end": 3291.295,
    "text": " Of course, you talk about yoga, I know, but that's what I would say, that walking meditation is used as a complementary practice to the sitting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3292.416,
    "end": 3302.522,
    "text": "So I would say it's hard to reach deep mastery states only by walking meditation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3302.562,
    "end": 3305.884,
    "text": "Regarding to yoga, also yoga means unity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.545,
    "end": 3306.765,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3307.426,
    "end": 3319.148,
    "text": " What we think about yoga now, we think about movement, but it's always accompanied by reaching states of concentration through meditation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3320.728,
    "end": 3325.649,
    "text": "So you cannot have yoga without meditation, otherwise we'll be stretching our glasses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3326.829,
    "end": 3336.231,
    "text": "But second topic is that can it happen when you don't have prediction of movement?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3337.492,
    "end": 3337.732,
    "text": " Right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3338.693,
    "end": 3342.114,
    "text": "I meant like, because in yoga, I mean, at least I don't really do yoga, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.134,
    "end": 3350.098,
    "text": "But I can imagine that when people reach those states doing yoga, then they kind of do it almost like in a trance type of way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.118,
    "end": 3356.6,
    "text": "They're always doing the same movement over and over and over again, so that they don't have to attend to those movements, but it's just like an automatic process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.64,
    "end": 3357.461,
    "text": "I was wondering if it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.197,
    "end": 3382.422,
    "text": " if that also can i can i jump in so um actually this is precisely the opposite what is what what valerio was saying is so valerio was saying this is precisely the opposite you want to reach through yoga just like the opposite of automatic yeah so basically when you do these movements you need to be united with yourself doing it so you really need to um yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3384.724,
    "end": 3399.41,
    "text": " So yeah, I'm doing yoga, so the past 10 years, and precisely this is like they're trying to tell us, it's like, don't do it on automatic because it's like when you have your thinking happening there and your body is doing some stuff there, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3399.95,
    "end": 3406.633,
    "text": "You need to be basically be present in every single type of mood, so you have like fully, fully a presence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3406.673,
    "end": 3410.295,
    "text": "If you do it automatic, that's more like gymnastic or something, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3410.855,
    "end": 3437.983,
    "text": " so it's um but it's interesting uh so your point is really interesting because then would be really nice to have a control condition where we have people doing like movement meditation and yoga and then um contrast with the phenomena of like um uh some other sensory attenuation and uh whether they have what type of like embodiment and disembodiment and gentility experiences they have yeah okay but yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3438.43,
    "end": 3447.535,
    "text": " I don't know exactly what I was trying to get at, but I think it was also more related to, because you said that when meditating, you have to sort of let yourself... Yeah, letting go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.196,
    "end": 3448.916,
    "text": "Letting go, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.956,
    "end": 3452.518,
    "text": "And the idea is then everything has to be perfectly sort of predictable, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3452.538,
    "end": 3453.879,
    "text": "That's the idea behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.279,
    "end": 3466.166,
    "text": "So then I'm thinking, so you always, within yoga, don't you have to do like the exact same movements in order for it to be predictable, in order for you to let go and not over-attend to the environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3466.666,
    "end": 3467.547,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.567,
    "end": 3467.687,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.306,
    "end": 3486.793,
    "text": " I thought when you both, Anna and Simon, were speaking, I think on one side you, Simon, maybe you're referring to the implicit procedural knowledge that you can acquire through yoga.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3487.594,
    "end": 3492.576,
    "text": "And you, Anna, are talking about doing things without being aware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3493.396,
    "end": 3495.997,
    "text": " which is also automatic and left in them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3496.157,
    "end": 3505.7,
    "text": "And you both are right, I think in this, because on one hand, if you, Anna, you would say like, if you do yoga, you learn how to do yoga, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3506.18,
    "end": 3521.225,
    "text": "So you learn how to move yourself in this way so that when you do a certain position, you know, that you have to arrange your body and for arranging your body, you always have to keep monitoring yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3521.505,
    "end": 3522.926,
    "text": "So there is the continuous,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.493,
    "end": 3529.797,
    "text": " going back to your body, keeping track of your body, and continue to monitor yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3530.377,
    "end": 3541.864,
    "text": "But in this way, because you have learned to do this constant going back and being aware of yourself, and this comes also when you do your movement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3541.924,
    "end": 3550.989,
    "text": "You have learned that certain postures are made in a certain way so that it becomes more or less predictable, actually, what you're going to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3551.55,
    "end": 3551.79,
    "text": " right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3551.97,
    "end": 3555.211,
    "text": "But it doesn't mean that you don't have to be aware of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3555.491,
    "end": 3567.155,
    "text": "Actually, there is a trick here, because you're very attentive with what's going on, but at the same time, the more you're attentive, the more somatosensory attenuation may happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3567.675,
    "end": 3572.136,
    "text": "And actually, it's what we are trying to argue in our active inference model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3573.057,
    "end": 3577.798,
    "text": "The more predictable it gets, the more it gets attenuated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3577.818,
    "end": 3579.259,
    "text": "But it doesn't mean that you're not aware.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3579.739,
    "end": 3579.959,
    "text": "That's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3582.122,
    "end": 3586.664,
    "text": " Yeah, thank you for this input because it helps us elaborate this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3587.045,
    "end": 3594.108,
    "text": "I think it's super interesting because it's like when you look at people that climb or surf or whatever, any type of sports, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3594.428,
    "end": 3598.27,
    "text": "In the beginning, in order to learn the skill, you have to put a lot of attention to the individual movements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.59,
    "end": 3601.731,
    "text": "But then later on, in order to actually be good at it, you have to take the attention away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.312,
    "end": 3607.374,
    "text": "And then in those moments is when the people report that they're actually feeling sort of selfless states, these flow states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.342,
    "end": 3611.727,
    "text": " when the movements are internalized, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.747,
    "end": 3613.67,
    "text": "I think that's super interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.05,
    "end": 3615.913,
    "text": "Can I just shoot the other two questions I had?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.054,
    "end": 3617.536,
    "text": "They're sort of different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.616,
    "end": 3618.938,
    "text": "Or should we go to Julia first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.98,
    "end": 3620.561,
    "text": "Maybe it's Julia.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3620.621,
    "end": 3621.162,
    "text": "I don't know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3624.73,
    "end": 3625.39,
    "text": " Hi, sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3625.63,
    "end": 3626.571,
    "text": "Yeah, sorry for the lighting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3626.611,
    "end": 3628.131,
    "text": "And sorry, because I'm in the lab.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3628.151,
    "end": 3630.872,
    "text": "So it's probably not the best position.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3630.912,
    "end": 3632.453,
    "text": "Thank you very, it was very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3632.493,
    "end": 3639.136,
    "text": "And I'm really looking forward to, yeah, look at the results you you have in your study.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3639.936,
    "end": 3646.539,
    "text": "Especially Yeah, I mean, since I, as I mentioned, we had something interesting with the international binding and depersonalization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3646.659,
    "end": 3649.64,
    "text": "And yeah, kind of happy about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3650.0,
    "end": 3652.641,
    "text": "And what I saw, I'm really sorry, because I listened",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3653.509,
    "end": 3671.276,
    "text": " kind of doing something else unfortunately in the lab i was busy um while you were talking but i kind of like the idea of um yeah does the self is attenuated or not or increasing and kind of goes back to just simon the last comment from simon about expertise um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3672.634,
    "end": 3678.956,
    "text": " I think in terms of motor interaction, there is some literature about the expert.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3678.996,
    "end": 3695.26,
    "text": "I was trying to Google that, but I attended a workshop last year and I think it was about once you're an expert, at the beginning you have this kind of flexible, you have a better understanding consciousness and then at the end you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3696.13,
    "end": 3724.291,
    "text": " of learn to let it go to ride the flow of the motion kind of so it's not that you are and i think it's probably made me the same i don't know whether yeah but attention in meditation is that you have this maybe more like not focused attentional state but more like uh open um sorry i forgot the name of the meditation type of mission you know but open meditation monitoring yeah yeah exactly so you and i don't know it's uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3724.83,
    "end": 3746.794,
    "text": " it would be interesting as that and i suggested to see a what kind of meditation what type of meditation maybe change the sense of the self maybe at the beginning it's more acute because you really scrutinize your sensation and and then after i don't know this is something that you plan to do right or should i go or do you want to go on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3750.55,
    "end": 3773.549,
    "text": " uh the the first question was i uh ah there is a body of evidence it actually say that in expert meditators uh attention to start decreasing but there is also because you allocate less and less attention but i would be careful with that because with with this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3774.212,
    "end": 3780.935,
    "text": " Because they say there is a decrease activity in anterior cingulate cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3782.775,
    "end": 3784.716,
    "text": "So they make inference about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3786.497,
    "end": 3794.68,
    "text": "As a meditators as well, and having to know other people that are more experienced than me,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.871,
    "end": 3807.579,
    "text": " they would never say we lose our attention to that because our experience is so rich of sensory signals and related thought process that you cannot afford to not be attentive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3808.219,
    "end": 3811.822,
    "text": "However, we can bring into the play different kinds of attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3812.242,
    "end": 3820.828,
    "text": "As you said, there is focused attention or there's an attention that requires more explicit thought about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3821.268,
    "end": 3822.869,
    "text": "So more explicit kind of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3824.114,
    "end": 3828.537,
    "text": " way to focus on things and there is more like a bare attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3828.757,
    "end": 3841.628,
    "text": "So when you focus on the whole experience and you let it go with a non-judgmental attitude and a more open attitude, and it's actually this attitude, they're very stressed in meditation techniques.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3841.788,
    "end": 3850.295,
    "text": "That's why they're a bit under looked in research, I feel, because it's a lot about how we use attention, but not the intent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3850.774,
    "end": 3874.28,
    "text": " attention but not how we use intention so uh our attitude has the attitude of the measures has to be very open and very non-judgmental and these reduce the non-reactive sensing for for example and reduce the ability to self-regulate the your experience your life you have partially answered",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3876.4,
    "end": 3900.852,
    "text": " Yeah, no, I mean, I kind of like the idea that you, you linked that with attention and, um, it's just, I think maybe it would be interesting to look at different type of attention because, um, you know, you have like, so maybe there is a difference between, I don't know, different type of meditation may develop different type of, I don't know, maybe the open, um, meditation is more prone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3900.892,
    "end": 3906.075,
    "text": "I don't know, because you mentioned the insular cortex and to me, it's more associated with a certain type of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3906.787,
    "end": 3916.418,
    "text": " attention, like more like maybe, um, more prone for like, uh, feedback, um, or negativity or these kind of, you know, uh, error monitoring process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3917.059,
    "end": 3919.061,
    "text": "So it's not like your attention, you lose your attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3919.121,
    "end": 3921.223,
    "text": "It's just, it's more like in the background.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3921.243,
    "end": 3923.526,
    "text": "And then when there's a mistake or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3924.111,
    "end": 3949.125,
    "text": " kind of pops up more quickly i don't know and you may have more like uh frontal or sustained attention i don't know i mean i'm not a specialist of attention at all so please take that with a bit of self um yeah i was wondering if this is something i don't know obviously i mean because it's only you're not trying to do any eg or neural physiological measurement right",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3950.626,
    "end": 3954.067,
    "text": " So this is maybe like a follow-up study that would be interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3954.167,
    "end": 3954.927,
    "text": "Yeah, not yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3955.527,
    "end": 3955.727,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3956.687,
    "end": 3959.528,
    "text": "But in the pipeline, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3959.788,
    "end": 3960.328,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3960.408,
    "end": 3975.11,
    "text": "What we really want with Valeria and other collaborators is to basically push against this idea that you can have selfless experiences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3975.41,
    "end": 3979.811,
    "text": "I know it's controversial and many people talk about, oh, selfless experience, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3981.918,
    "end": 3991.846,
    "text": " So basically we want to say radically speaking, okay, so that works if you buy the bullet in your mind-body dualism and somehow consider that actually the body kind of like disappears in the process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3991.906,
    "end": 4008.199,
    "text": "But if you're not mind-body dualist, then you need to basically put the body into the equation and realize that actually what allows the mind to disappear is the fact into the pureness of the experiences, the fact that the impure body",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4008.755,
    "end": 4019.683,
    "text": " It's kind of like put in a stable condition in such a way that basically you can afford to leave it in the background and, yeah, to have, like, this type of, like, experience arising.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4020.164,
    "end": 4027.629,
    "text": "But without that in place, you can't really afford to, you know, go through the selfless experiences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4028.05,
    "end": 4035.976,
    "text": "And this is why we want to be provocative in the title, that, well, actually, maybe the experience of, like, selfless, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4036.816,
    "end": 4062.859,
    "text": " selfless experiences actually comes necessarily as to sign of the same coin of this experience of like having a unlimited body that actually expands to through the world but the body is there i mean the the thing the the entity that has the experience of no experience is that um a body that kind of like is um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4063.639,
    "end": 4088.75,
    "text": " self-regulate in a certain way like the homeostasis is put at like a set point and we are using this metaphor of like think of um a cyclone right moving cyclone so you have the steel eye of the cyclone in the middle doesn't mean that actually is not there it's just like it's around everything and because we are self-organizing biological systems uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4089.79,
    "end": 4115.002,
    "text": " we kind of like this animal this thing needs to keep track of this internal bodily states and there i mean this a successful system does this all the time all the time literally from second one when we basically get from one cell to you know the self so this is some sort of like fascinating self-organization that is happening the cellular level already and it like needs to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4115.802,
    "end": 4117.804,
    "text": " And death is basically, this is what is happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4117.864,
    "end": 4122.909,
    "text": "It's like this disintegration of like this, you know, self-organization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4123.449,
    "end": 4127.153,
    "text": "But that's clearly, that's not what is happening on meditation, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4127.213,
    "end": 4131.157,
    "text": "Because hopefully you don't die when you meditate in that sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4131.477,
    "end": 4136.882,
    "text": "There is disintegration of a certain way to experience yourself in relation to the body and the world, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4137.222,
    "end": 4141.827,
    "text": " But clearly, there's something that stays there, needs to stay there for you to have those experiences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4142.287,
    "end": 4146.011,
    "text": "So that's a bit of a controversial, radical claim that we like to defend.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4146.152,
    "end": 4150.256,
    "text": "And yeah, we already had this discussion with several people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4150.977,
    "end": 4155.682,
    "text": "For instance, like Valeria and I, we were meant to enlighten this workshop on...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4157.163,
    "end": 4178.505,
    "text": " of knowledge in neurocomputation when we met there with people like thomas spetz again everything and obviously they have a different opinion so kind of like have a lively discussion about why we think it's like uh what does it mean to actually lose yourself and what is the self and what is a pure experience and why we basically need whether we're like it or not the connection with the impure body",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4179.52,
    "end": 4182.722,
    "text": " to make sure that you can have, at a certain point, a pure experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4183.363,
    "end": 4187.065,
    "text": "But then again, this is something that's just speculation at the theory level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4187.105,
    "end": 4200.354,
    "text": "And this is why I have this brilliant team here, that we can do some studies and actually measure stuff, put the finger on it, put the number, and see what we get.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4200.374,
    "end": 4203.977,
    "text": "These are awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4205.572,
    "end": 4210.319,
    "text": " points, and there's so many ways it could go, I'll read a question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.04,
    "end": 4219.391,
    "text": "So, G. Pagnani wrote, The notion of increased somatosensory transparency in experienced meditators as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4221.085,
    "end": 4223.246,
    "text": " liveliness of the experience is intriguing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.986,
    "end": 4236.512,
    "text": "Can you say something about which levels in the hierarchical structure of the internal model are more likely to be affected by the meditative attentional task in terms of precision deployment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.172,
    "end": 4247.917,
    "text": "Do you think the attenuation of somatosensory prediction error concerns more intermediate levels, in a way increase meta-awareness rather than sheer sensory attention?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4250.874,
    "end": 4270.931,
    "text": " can take this one so uh i i can i can give a first go and then you can go yeah no i just wanted to ask rather than ensuring uh rather than sheer sensory attention yeah you can go on now please yeah so uh um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4272.529,
    "end": 4300.212,
    "text": " yeah so this is something i i'm i'm trying to develop this idea right now where um a phd student of mine um uh liby uh liberty service basically uh and this is why it's connected with the question that you ask you'll see is that um you know your platform is active inference right and so people are kind of like you know um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4302.014,
    "end": 4328.543,
    "text": " lately kind of like realized wait a minute actually we're active and we need to explain action in the world and everything is kind of like comes late right but uh if you look uh going back to the animal basically um the action and the movement is there from the very beginning so this means that this is why it's so important to basically relate the um you know self-organization self-awareness self-perception necessarily related with movement",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4329.543,
    "end": 4352.696,
    "text": " not so movements or an action is not something that you add on the top of this right like uh and some of like intention so you can have an intention but basically the first movements are kind of like automatic and need to be there right and basically our body moves all the time because we breathe all the time and our heart beats all the time so this means that for me this type of like attenuation is happening",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4353.496,
    "end": 4367.431,
    "text": " at the sensory level because that's the basic one so can you have sensory stuff without metacognitive stuff yes can you have metacognitive stuff without sensory stuff no so it's like what what is basic that's the first things needs to be um um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4369.092,
    "end": 4394.379,
    "text": " uh attenuated and then uh then it has to be a balance between metacognitive and sensory uh attenuation because uh this is precisely what i think it is happening in the personalization because if you if you focus too much right so you lose the the balance right uh between then you you basically um yeah it's kind of like this type of um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4395.802,
    "end": 4398.539,
    "text": " You cannot afford to forget yourself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4399.11,
    "end": 4404.935,
    "text": " Yeah, and then it's kind of like the self stands in the way, and that gets you even more disconnected, so to speak.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4406.736,
    "end": 4427.072,
    "text": "So this is why I think it's important to contrast different type of meditative experiences and meditative practices to see which one of them actually has more focus on what you do with the metacognitive, meta-awareness, awareness, self-awareness, and which one are actually involving more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4427.532,
    "end": 4429.774,
    "text": " like sensory movement, for instance, like, let's say, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4430.434,
    "end": 4434.858,
    "text": "So that's, that's something that needs to be empirically tested, but I would speculate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4435.579,
    "end": 4446.868,
    "text": "And then obviously, we can put it at test either by doing a simulation or, you know, actually collecting data to see how that plays into this distinction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4452.132,
    "end": 4455.395,
    "text": "I think Simon wants to say something, but I'm not the moderator.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4455.415,
    "end": 4456.376,
    "text": "So Daniel, you decide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4457.922,
    "end": 4463.345,
    "text": " Valeria first, then Simone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.365,
    "end": 4464.626,
    "text": "Thank you, Anna.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4467.008,
    "end": 4481.016,
    "text": "I don't have so much more to say because I agree with her, but I thought when Diana and you were reading the question, for me the answer was more or less clear in the sense that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4482.409,
    "end": 4507.127,
    "text": " As I see the somatosensory attenuation happens at the very low level predictions, so in a very pre-reflecting self-consciousness, so that the person was asking, in the meditation techniques, when you put the attention on, for example, your bodily signals,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4507.904,
    "end": 4516.83,
    "text": " there you have a top-down modulation of this, of precision weighting, but the top-down modulation is on low-level predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4517.53,
    "end": 4521.332,
    "text": "So you're not putting top-down on what you think about your body is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4521.733,
    "end": 4523.014,
    "text": "You're actually doing the opposite.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4523.054,
    "end": 4536.242,
    "text": "You're trying to forget about your previous expectations about the body because you're trying to have this non-judgmental awareness about what's going on in your experience and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4537.446,
    "end": 4556.761,
    "text": " with this, let's say, less biased way to attend your body, you start piercing and perceiving bodily sensations in your body or other kinds of experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4557.141,
    "end": 4566.288,
    "text": "So I would say this increasing precision on somatosensory signals happens at the low level of the hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4567.279,
    "end": 4573.642,
    "text": " Um, that then attenuates the sensory consequences of this, um, of the procedure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4574.723,
    "end": 4596.194,
    "text": "Um, and the math awareness comes, uh, when you learn the, when you're, I think when you start having increased body awareness, so you, you know, make more experience, I think then you started developing math awareness about, uh, how your body's actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4596.896,
    "end": 4622.203,
    "text": " um about higher uh representation of the body of your body but in the moment when this happens uh i think it really happens at the low level sub personal beliefs and then later on the longer time scales then it starts becoming uh more abstract and ingrained in your personal uh at the personal level of your beliefs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4623.643,
    "end": 4631.468,
    "text": " That's how I say, of course, if Simon has something to do with it, it's really open.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4631.488,
    "end": 4632.869,
    "text": "I didn't want to comment on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.889,
    "end": 4635.131,
    "text": "I just selfishly raised my hand to ask another question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.211,
    "end": 4640.474,
    "text": "Or Daniel, I don't know if you have an opinion on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4642.636,
    "end": 4651.342,
    "text": "Well, certainly resonated with this comparative approach to studying the diversity of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4652.966,
    "end": 4670.739,
    "text": " and protocols we already have for mind and body and attention, broadening the scope and just kind of putting darts in the space of what practices do people engage their mind and body in, and then how can that territory be explored?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.908,
    "end": 4683.092,
    "text": " of theoretical models and how does that relationship connect to the kinds of empirical work that we might do in a brain scanner or with other kinds of measuring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4683.112,
    "end": 4701.72,
    "text": "And I think one thing I want to explore more is like in a hierarchical nested cognitive model, which we often speak of ourselves and other types of sophisticated entities as,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4703.68,
    "end": 4705.201,
    "text": " Where's our awareness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.561,
    "end": 4707.903,
    "text": "Where's awareness in that picture?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.883,
    "end": 4721.932,
    "text": "And also to Simone's question about when we're moving, but we're expecting what we're moving",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.987,
    "end": 4746.681,
    "text": " then how does the exteroceptive flow like the visual field you might be very familiar with walking and so you might be able to proprioceptively kind of zero out on your walking but there's this exteroceptive um flow of novelty in the world so i think that that how um and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4751.741,
    "end": 4762.112,
    "text": " or darkness and all these different methods, there's a lot that these questions bring up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.033,
    "end": 4763.253,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.014,
    "end": 4764.675,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4764.735,
    "end": 4768.199,
    "text": "So I have something to add to that because I think it's super important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4770.347,
    "end": 4775.971,
    "text": " So for me, it's not so, you know, my background is like embodied cognition and activists and everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4776.031,
    "end": 4785.737,
    "text": "And for me, it's really not at all surprising the fact that many of these techniques have been developed by people that kind of like lived in closed communities, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4785.917,
    "end": 4790.18,
    "text": "So it's like you have a space where people can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4790.814,
    "end": 4813.465,
    "text": " you know meditate walking i don't know and then they have this ritual they wake up at this time and they do this thing and so so you put yourself and yeah it's a ritual right like all the rituals so so this means it's like as i said it's like high predictability right um and then that's that's something super super uh important yeah and even if even in the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4814.491,
    "end": 4817.893,
    "text": " Wookie meditation, you need to follow a certain path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4820.094,
    "end": 4822.335,
    "text": "Yes, that's that's super interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4826.357,
    "end": 4836.042,
    "text": "Well, um, in the last five or 10 minutes, I would love to hear from each of you, like, what are your directions heading forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.182,
    "end": 4840.084,
    "text": "And what's the what's exciting to you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4840.104,
    "end": 4841.705,
    "text": "And where would you like to take this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4844.454,
    "end": 4865.022,
    "text": " maybe um Simone and Julia first and then we'll kind of make our way back to the authorship I mean I mean I'm not not myself not working on the project right uh but like what I what I was really interested in sort of extending this is trying to understand um because the way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.171,
    "end": 4877.979,
    "text": " the way those deep meditative states are reported sometimes and the way people with depersonalization disorder report their experience is very similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4878.419,
    "end": 4880.421,
    "text": "They almost use like the same words, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.181,
    "end": 4882.723,
    "text": "And to describe how they feel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.943,
    "end": 4891.73,
    "text": "And I wonder why one is experienced positively and one is experienced so negatively as in it being a disorder and in completely disrupting someone's life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.47,
    "end": 4894.812,
    "text": "So that was like this comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.852,
    "end": 4896.854,
    "text": "I think I'll be very curious about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.38,
    "end": 4928.77,
    "text": " awesome julia if you wanna add anything um well it's it's very interesting and um yeah i mean again i'm not so involved in this study so it's a bit hard but i mean i'm really interested in the i mean all the self is affected by yeah our interaction with the world external world so uh and i'm completely already spoiled with the result we have with the international binding so um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4930.056,
    "end": 4930.637,
    "text": " It's very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4930.717,
    "end": 4940.746,
    "text": "I mean, yeah, if the self is attenuated or if it's disappeared, kind of, I think that's the key question we want to answer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4941.166,
    "end": 4953.617,
    "text": "And yeah, I would be very curious to know, I mean, what value I found in data to see if we can have a common narrative about what's happening also with depersonalization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4955.378,
    "end": 4956.799,
    "text": "Yeah, it's very interesting to see how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4957.972,
    "end": 4976.492,
    "text": " moving our body i mean attention um to the body can really change the self kind of the way we process self-information um yeah so very interesting cool anna yes so um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4977.245,
    "end": 4981.188,
    "text": " It's like lots of work to do ahead, but that's exciting, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4982.89,
    "end": 4989.335,
    "text": "Yeah, so very short term, it's like we need to write up this result that we just got.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4990.375,
    "end": 4992.317,
    "text": "So, yeah, in relation to the body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4992.337,
    "end": 4994.359,
    "text": "So basically, we're going to have some numbers to show.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4994.539,
    "end": 4995.8,
    "text": "So that's super nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4997.101,
    "end": 4999.883,
    "text": "And then the next steps would be to, you know...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5003.755,
    "end": 5028.761,
    "text": " create or develop a computational model around this with basically contrast the real-world data with simulation data and then have a multi-layered type of approach with different methods from physiological to behavioral to phenomenological to computational, potentially also neural.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5028.861,
    "end": 5032.142,
    "text": "So that's something that would be nice to do in the next steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5033.822,
    "end": 5060.951,
    "text": " um so yeah um and apart from that i think that's all for now uh and i'll let uh i'll leave uh the floor to valeria well again thank you um uh and by everybody uh yeah i i also want to thank you a lot for this platform this invitation it was yeah really nice uh a nice person and a nice conversation um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5062.279,
    "end": 5067.181,
    "text": " I'm working with Anandi's project, so she already said what's the next direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5067.601,
    "end": 5082.188,
    "text": "What I can add in this, I think it would be on the theoretical side, also start engaging with more closely to bodily reactions to meditation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5082.688,
    "end": 5086.51,
    "text": "Because the body boundaries, the solution is just one part of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5086.97,
    "end": 5091.012,
    "text": "It's like one part of the phenomenology, but it's not the only thing that happens during meditation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5091.97,
    "end": 5117.775,
    "text": " um there is a lot of potential that can be discovered uh on this because um because the body boundaries solution again it's really study a lot but it's a phenomenon and there is so many other things that happens in our body while we meditate and you i i speak for first first person experience but in the community it's really like already sad other kinds of also um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5119.087,
    "end": 5141.203,
    "text": " more healing traditions like rest work for example there there is a lot of potential where people already work on that but there is no bridge uh with the academic communities so people work pragmatically with this intuitive knowledge as well what happens in the body during these altered states of consciousness but still we need to bridge it with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5142.374,
    "end": 5148.139,
    "text": " trying to make sense from a phonological and scientific point of view and experimental point of view as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5148.539,
    "end": 5161.649,
    "text": "So I think I see myself in, yeah, trying to step in this toward and like bring insight from one world to the other and hoping to help myself and the other people around me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5161.829,
    "end": 5162.049,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5164.551,
    "end": 5164.871,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.271,
    "end": 5165.471,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.442,
    "end": 5168.003,
    "text": " Lots of luck with the work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5168.043,
    "end": 5169.303,
    "text": "That sounds really exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5169.543,
    "end": 5187.79,
    "text": "Love the idea of the two-way street with different bodily and cognitive practices and collaboration and conversation that can bring in all these different expertises that maybe don't have an fMRI study already, whatever that's worth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.991,
    "end": 5189.491,
    "text": "Thank you, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.951,
    "end": 5195.033,
    "text": "Always, any of you are welcome back and really appreciate that you all came out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5196.715,
    "end": 5197.356,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5198.136,
    "end": 5198.397,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5198.417,
    "end": 5198.857,
    "text": "See you soon.",
    "speaker": "SPEAKER_01"
  }
]