[
  {
    "start": 9.753,
    "end": 10.614,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.094,
    "end": 16.797,
    "text": "Welcome to the Act-Inf Lab and to our 2021 quarterly roundtable number two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.458,
    "end": 25.403,
    "text": "It's June 1st, 2021, and we're excited to be sharing with you some updates and some plans for our lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.243,
    "end": 33.608,
    "text": "If you're watching it live, feel free to ask questions or provide ideas in the live chat, or afterwards, you can do that in the comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.506,
    "end": 37.627,
    "text": " Welcome to the Active Inference Lab, everybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.248,
    "end": 44.511,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.972,
    "end": 47.613,
    "text": "You can find us at our links here on this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.474,
    "end": 54.157,
    "text": "This is recorded in an archived live stream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.958,
    "end": 61.762,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good and normal video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 63.51,
    "end": 75.993,
    "text": " Today in the quarterly roundtable, number two, we're going to first start with a brief rehearsal of some of our lab goals, and that will serve to update as well as to motivate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.633,
    "end": 92.576,
    "text": "Then we will go through each of the three organizational units of the lab, .edu, .coms, and .tools, and be providing updates on what has happened over the last quarter and about where we want to be going in the coming quarter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 94.892,
    "end": 98.713,
    "text": " Any thoughts at the outset, or we can go right into the goals?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.533,
    "end": 101.353,
    "text": "So, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.913,
    "end": 103.514,
    "text": "Here are ActInflab goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.234,
    "end": 121.797,
    "text": "For the one slide here, we've just put up a screenshot of our updated website because we want our website to be the point of reference and the sort of interface for our lab to the external world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.777,
    "end": 149.547,
    "text": " so our first line there is the goal of act and flap is to produce cutting edge research and enable real world applications of active inference and enabling architecture in the systems engineering way of thinking about enabling systems can be hardware it can be software it can be people in teams so by thinking broadly about what actually enables real world applications of active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 150.367,
    "end": 157.211,
    "text": " it will hopefully help us stay open to enabling what needs to be enabled and catalyzing what needs to be catalyzed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.491,
    "end": 159.533,
    "text": "Stephen, and then anyone else with a raised hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.594,
    "end": 174.462,
    "text": "Yeah, I think that point you make about what needs to be enabled is a good one because there's this idea of pushing beyond what's currently possible, if that makes sense, in terms of how these applications happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.862,
    "end": 177.804,
    "text": "So I think one thing that has been quite interesting is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.925,
    "end": 186.31,
    "text": " practical applied desire to apply active inference has been quite fertile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.65,
    "end": 195.015,
    "text": "So even if it's actually happening or it's that edge of trying to make it happen, I think that's a good struggle to be together in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.097,
    "end": 197.417,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.597,
    "end": 203.0,
    "text": "And I think in tools, we'll return to talking a bit more about what those applications could be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.801,
    "end": 204.922,
    "text": "But I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.202,
    "end": 208.004,
    "text": "And the systems engineering approach of the enabling system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.184,
    "end": 218.669,
    "text": " at least for me, opened up to being focused on what we want to see happen while also being open-minded to different things that could be outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.369,
    "end": 226.373,
    "text": "And along the way of those outcomes, any enabling system that needs to come into play is going to be the right one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.733,
    "end": 235.598,
    "text": "So if we have to set up a new tool or a new communication mechanism or do some other application, it's all part of the enabling architecture of the lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 236.849,
    "end": 244.391,
    "text": " All right, any comments on the website, ActiveInference.org overall, or we can just head right into the updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.751,
    "end": 250.712,
    "text": "Cool, because this is hopefully an informative roundtable lab meeting presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.092,
    "end": 252.633,
    "text": "So here we come to the updates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.293,
    "end": 261.655,
    "text": "First, there's going to be a general admin or organizer update, and then we're going to go into the organizational units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.648,
    "end": 274.094,
    "text": " So first, there's a special announcement, which is that ActInflab has a new steady state as a nonprofit organization registered in California, United States of America.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.135,
    "end": 288.822,
    "text": "And the registration as a nonprofit organization has been consistent with our lab strategy to be a center of gravity for education and open science research related to active inference, and also increasingly incorporate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.762,
    "end": 316.192,
    "text": " governance and informational activities that are related to our values registering as a non-profit will allow us to enact the kinds of policies that we expect to see as consistent with ourself while we also figure out what kind of a lab we are and we want to see the active inference community be as participatory accessible and productive as possible so that's sort of a special announcement on that front and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.032,
    "end": 326.798,
    "text": " And a big rationale or motivator behind all of our activities, as well as the nonprofit here, is this topic of research debt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 327.879,
    "end": 336.844,
    "text": "So Alex, maybe you could give us just a couple of minutes breakdown on what is research debt and how does it apply to active inference at this moment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.284,
    "end": 339.826,
    "text": "And then anyone feel free to ask a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 343.356,
    "end": 343.896,
    "text": " Yeah, thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 345.578,
    "end": 369.597,
    "text": "First, I saw that notion for research depth in a blog post of Jared Timoil in his syllabus for active inference, and he mentioned that he's trying to work with research depth, and it's very well accepted",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 371.259,
    "end": 398.086,
    "text": " for developers and developers works a lot with their depth on programming and usually it's happening when people work with some new domain or some cutting edge technologies and trying to work on new fields and developments and they just don't have enough time",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 399.09,
    "end": 412.082,
    "text": " to make some additional work on bringing their developments more closer to other people to have understanding, to start learning it and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 413.303,
    "end": 422.973,
    "text": "And definitely we understand that for Active Inference as a new knowledge area and for community",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 424.519,
    "end": 433.658,
    "text": " A lot of very bright minds working on research part of it and produced a lot of works and papers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 434.978,
    "end": 464.368,
    "text": " and they should continue but somebody should take wet results and try to to simply simplify it in some way to maybe to make it more clear and precise and create some informational materials and artifacts for people who are not so well developed in area and start just starting to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 464.91,
    "end": 494.012,
    "text": " learn active inference that's why somebody just have to do it and in the lab we decided that that it should be our concern and we have time and energy start that work and actually i think we started it already and what all what we are doing for now in some sense related to this big area",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 495.293,
    "end": 524.169,
    "text": " so that's why we decided to make it like explicit statement about it like one of the goal of the lab and for activities of the lab so let's start think and talk about it and think how we should structure it again in engineering way because it's just a part of knowledge life cycle and if we are working with",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 524.775,
    "end": 525.757,
    "text": " knowledge engineering.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 526.918,
    "end": 533.008,
    "text": "It's a part of knowledge lifecycle and in our case knowledge about active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 534.991,
    "end": 535.211,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.511,
    "end": 536.532,
    "text": "Thanks, Alex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.193,
    "end": 543.497,
    "text": "It just makes me think of code that needs comments to be really understandable and accessible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.138,
    "end": 551.563,
    "text": "That's a problem on the cutting edge if code is not being applied properly to its fullest extent or in a non-confusing way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.163,
    "end": 554.565,
    "text": "But it's also a problem for learners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.985,
    "end": 559.469,
    "text": "Everybody other than the cutting edge is also suffering from that lack of commented code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.049,
    "end": 573.554,
    "text": " And so we can just imagine if it was just a script that had a one input and one output, having a function that didn't have an explanation would still be a hindrance to the advanced performance as well as to accessibility and onboarding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.954,
    "end": 574.995,
    "text": "But we're talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.655,
    "end": 580.118,
    "text": " a rapidly moving and evolving body of theory and practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.599,
    "end": 583.501,
    "text": "So it's even more than just commenting code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.101,
    "end": 590.786,
    "text": "It comes down to hopefully a lot of the kinds of projects that we're going to be exploring and collaborating on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.806,
    "end": 592.567,
    "text": " Welcome, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.128,
    "end": 606.785,
    "text": "Anyone want to give a thought on research debt or like what's one area of active inference that seems especially underwater or is at the risk of going into a debt mode?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.194,
    "end": 615.259,
    "text": " something we can think about and hopefully draw out in this roundtable and beyond, like the mathematical underpinnings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.62,
    "end": 619.703,
    "text": "What is the relationship between free energy principle and active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.483,
    "end": 624.807,
    "text": "All these kinds of questions, we can't just leave them unresolved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.267,
    "end": 631.071,
    "text": "We might be able to paint around them and make a clear demarcation, but that will be so that we can address it later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.372,
    "end": 631.632,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.084,
    "end": 639.689,
    "text": " Could I ask a question as much as a comment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.791,
    "end": 650.725,
    "text": "Could you just say a bit more about some of those concerns around this research that have been overwhelming in some way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.745,
    "end": 652.127,
    "text": "I get a sense that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.339,
    "end": 664.472,
    "text": " People might think depth is just going to the most ultimate abstract detail, but we're talking about a richness in a way, I sense, that you're talking about a richness of depth that can be accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.593,
    "end": 667.656,
    "text": "So maybe just explain a bit more about that would be helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.51,
    "end": 685.619,
    "text": " Well, two similar sounding words like research depth, like how deep the field is, we would hope that it's a field with depth and richness, but research debt is the hindrance that prevents us from having deep research and deep technology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.099,
    "end": 695.404,
    "text": "The debt is like if somebody puts in a hundred hours of work to learn something and then it never gets distilled and reintegrated into the knowledge community,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.224,
    "end": 699.747,
    "text": " it's kind of like we're building out very unsteady bridges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.507,
    "end": 705.491,
    "text": "And so then there becomes 20 hours of work to comment the code, but then nobody does that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.571,
    "end": 710.275,
    "text": "So somebody else spends 100 hours and then they don't have the 20 hours to comment the code.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 710.635,
    "end": 714.118,
    "text": "And then someone spends 10 hours, but it gets half done and never gets completed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.538,
    "end": 718.942,
    "text": "And so we accrue this debt, just like financial debt, about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 719.702,
    "end": 730.486,
    "text": " inexplicable models and partially performed projects and just ways that make the field internally and externally incoherent, which prevents deep research and deep thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.087,
    "end": 736.529,
    "text": "But we want to approach it from an engineering and almost like a sort of information economy perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.729,
    "end": 736.949,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 738.223,
    "end": 749.932,
    "text": " So it's almost like, you know, they have these bad instruments or bad derivatives that they had in the financial markets where they sort of bundled up debts, which basically are non-productive in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.952,
    "end": 752.894,
    "text": "And they just, so you're saying that type of thing could happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.914,
    "end": 764.823,
    "text": "There can be a lot of stuff that can happen and it ends up being not as productive and just sort of jamming up the system when it could actually be leveraged and used potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.902,
    "end": 776.208,
    "text": " Yep, like bloatware, we won't call out any operating systems or programs, but there's entire engineering departments that are just focusing on very low level bugs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.769,
    "end": 783.313,
    "text": "And so then they're treading water trying to fix the bugs or security flaws in a really large piece of software.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.233,
    "end": 787.415,
    "text": "And that is a difficult struggle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 788.155,
    "end": 794.82,
    "text": "Whereas we want to be moving forward in a way where we're not carrying and multiplying our debts, but maybe we could even be...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.871,
    "end": 821.793,
    "text": " improving our returns and distributing them informationally in an appropriate way so research it's worth the time to unpack that because it is kind of a core idea for us the non-profit registration updates the phenotype of our lab and provides us with several new affordances and also access to a few new niches so this is information that was in our mailing list if you didn't see it but we're better able to scaffold",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.731,
    "end": 824.533,
    "text": " what our lab does essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.254,
    "end": 838.571,
    "text": "And we'll be able to interact with some new opportunities like grants and institutional partnerships and be able to provide a really credible and durable onboarding interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.855,
    "end": 855.985,
    "text": " And at this point, we're opening the invitation to participation in our lab from individuals with various kinds of experience, especially related to nonprofit management or research program management, grant applications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.846,
    "end": 866.433,
    "text": " the kind of legal and financial services that support all these operations, as well as a few perhaps new kinds of things like crypto economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.933,
    "end": 870.055,
    "text": "Could we make non-fungible tokens NFT?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.275,
    "end": 872.817,
    "text": "Could we use a governance approach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.897,
    "end": 874.518,
    "text": "Could we use quadratic funding?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 875.359,
    "end": 883.544,
    "text": " This is something we're exploring on a few different domains, as well as people who can help with graphic design or user interface tool development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.944,
    "end": 891.009,
    "text": "So hopefully, if you're curious about any of these areas and want to contribute to the Actif Lab, there's a spot for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.289,
    "end": 891.509,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.096,
    "end": 916.666,
    "text": " I was just wondering if you could speak a little bit more, and you might talk about, you know, the ONFT, the ontology, formal documents, narrative, and tools, which is, you know, kind of... I actually mapped that recently against my infusion framework, which was quite useful for how that gets embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.907,
    "end": 923.29,
    "text": "So I noticed it's quite a practical way to leverage knowledge in an engineering way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.53,
    "end": 924.451,
    "text": "So I was wondering that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.171,
    "end": 935.017,
    "text": " that's a particular focus as opposed to, for instance, people doing a focus on how to leverage stuff for use in dance events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.658,
    "end": 944.302,
    "text": "They may take a slightly more of a focus on affect and kinesthetics and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.862,
    "end": 947.984,
    "text": "So would you be able to speak to that if that's okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.525,
    "end": 953.307,
    "text": "Alex, would you like to give a first comment on ONFT or I'm happy to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.315,
    "end": 956.956,
    "text": " Please go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.276,
    "end": 957.496,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.916,
    "end": 970.345,
    "text": "So in our September 2020 paper with some of us on this conversation, we proposed the ONFT model, which is ontologies, narratives, formal documents, and tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.437,
    "end": 973.417,
    "text": " ONFT or font works both ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 974.358,
    "end": 988.501,
    "text": "And the idea is those are different domains that describe especially remote teams, where the formal specification of the team is kind of an almost perfect map for the actual team dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.961,
    "end": 998.443,
    "text": "So if you have an ontology of communication, like there's video, audio, text, and file sharing, then you can have a structured system for thinking about those pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.943,
    "end": 999.883,
    "text": "That's ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.623,
    "end": 1023.515,
    "text": " it becomes manifest and used through formal documents, whether it's a spreadsheet or a cloud document, as well as tools, which kind of covers the whole range of what we work on on our computer, whether it's an interactive cloud notebook or a .docx, that's sort of in the tools and formal documents domain, structured by ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.156,
    "end": 1026.157,
    "text": "And then narrative is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.239,
    "end": 1028.619,
    "text": " what threads it all together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.18,
    "end": 1038.682,
    "text": "And active inference hopefully provides us with a way of thinking about multi-scale narratives and holding space for differences in narrative and perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.282,
    "end": 1050.445,
    "text": "So then we can have a team where individuals have a different narrative sense of the ontology, or they understand different aspects of the ontology, or they understand a different meaning for the different tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.826,
    "end": 1055.507,
    "text": "But what coordinates them is the relationship of the tools, the ideas, and the people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1056.167,
    "end": 1068.958,
    "text": " So that's kind of how we're using ONFT to hopefully keep the human in mind during the design and maybe even integrate it with those kinds of performance insights that are really important elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.238,
    "end": 1069.458,
    "text": "Alex?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.201,
    "end": 1073.402,
    "text": "Yeah, I want to add to that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1075.498,
    "end": 1098.578,
    "text": " was thinking about it also in connection to communication structure for remote teams and trying to find the ways how to increase efficiency of such communications for people with which use different languages which have different cultural backgrounds and all that different",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1100.632,
    "end": 1126.184,
    "text": " difficulties that we meet when we start working together and we have that notion in the beginning about communication nightmare for especially for actually it's happening even in classic form like in corporations in big companies people trying to discuss something but they use they might use the same words",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1126.969,
    "end": 1154.712,
    "text": " but just understand different under that words and we was trying to find some object that we can like make more formal and make explicit to think about and maybe we will add something later but for now that ontology formal documents tools narratives looks like basic object",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1155.908,
    "end": 1158.17,
    "text": " but we team need to pay attention for.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1159.23,
    "end": 1165.535,
    "text": "Yep, and it helps us generalize beyond the language that we're using to deliver a formal document in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.995,
    "end": 1174.421,
    "text": "So then adding a translation on a cloud document or adding text-to-speech or speech-to-text, those are not bolted on second layers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1174.902,
    "end": 1180.286,
    "text": "It's part of the delivery mechanism for the information that everybody should be receiving in a given project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.546,
    "end": 1184.409,
    "text": "So we can incorporate accessibility and differences in people's tech setup",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.989,
    "end": 1194.114,
    "text": " into a fundamental of the team, rather than imagining that there's some single style of default team member, and then we're going to have correction terms or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.512,
    "end": 1202.336,
    "text": " So here is a graphic of a few of the parts of the lab and ecosystem we're gonna now go into.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.617,
    "end": 1215.144,
    "text": "Internal to the lab in Q2 and in Q1, we have three organizational units, which are .edu, education, .coms, communications, and .tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.284,
    "end": 1242.969,
    "text": " and you'll see that dot coms is having an interface with a live stream like the one right now which is the production of the comms unit as well as comms now and in the future potentially could have interfaces with broader communities adjacent communities um whether through the participants in those communities like the blue square on the right or whether to organizers who then are able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.809,
    "end": 1268.244,
    "text": " participate in the lab or somehow integrate active inference into how they think about their work the live stream interfaces publicly so that is the external niche to the lab and that includes those who are learners and practitioners of active inference self-identified or otherwise as well as those who are not self-identified as active inference learners and practitioners",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.625,
    "end": 1283.995,
    "text": " edu also has an interface with a body of knowledge which we'll return to but that's an ongoing project that will include multiple components and that's drawn from the systems engineering body of knowledge concept alex and then anyone else",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.992,
    "end": 1314.907,
    "text": " yeah this notion and with graphics for interfaces it's not only from system engineering but also we was trying to apply it concepts and understanding from active inference and to show that boundaries for us as a lab and have an understanding that such lab should have some interfaces to environment and more that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1316.3,
    "end": 1323.785,
    "text": " As we understand it, for example, interfaces should be connected to communication units.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1323.925,
    "end": 1329.469,
    "text": "So tools, for example, or EDU shouldn't have external connections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1330.07,
    "end": 1341.058,
    "text": "Just to have that consistency on the lab scale to understand how that interfaces work and how we can manage it in the most efficient way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1343.68,
    "end": 1343.86,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1344.969,
    "end": 1346.67,
    "text": " Any other thoughts here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.77,
    "end": 1349.57,
    "text": "Otherwise, Stephen, and then we'll head into the units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.591,
    "end": 1354.812,
    "text": "Well, just to comment, I like also that you refer to niche there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.032,
    "end": 1365.015,
    "text": "And I think talking about niches and we talk about systems, we're talking about system boundaries and where might Markov blanket type interpretations been used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.055,
    "end": 1369.377,
    "text": "So I think that way of thinking is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.325,
    "end": 1375.866,
    "text": " is we're kind of getting used to it, but actually it's kind of quite unusual in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.046,
    "end": 1380.127,
    "text": "There is some work with niches in regimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.187,
    "end": 1395.431,
    "text": "Some socio-technical system work does use regime, but this ability to move into thinking about things as a niche, types of niche, types of system, having an internal state that's actually got an agent involved as well at a smaller scale,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.411,
    "end": 1399.417,
    "text": " And I think we're wrestling with that a little bit, exactly where that all lands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.457,
    "end": 1403.966,
    "text": "But I just sort of noticed, because you used that term, that's been quite interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.114,
    "end": 1405.734,
    "text": " Good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.135,
    "end": 1406.395,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.555,
    "end": 1407.775,
    "text": "Yep, we agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.256,
    "end": 1414.799,
    "text": "Thinking about interfaces is natural to computer science, the idea of an API, as well as to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.259,
    "end": 1420.842,
    "text": "So it's kind of like a bridge idea between those two ontologies or perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.723,
    "end": 1433.709,
    "text": "And now we're seeing an increasing amount of work from the computational, the ecological, all these different angles that are coming together that are describing systems the way that you just laid out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.727,
    "end": 1440.113,
    "text": " Okay, so .edu is our first organizational unit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.059,
    "end": 1451.246,
    "text": " The goal of educationunit.edu is to create a participatory and dynamic active inference body of knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.946,
    "end": 1469.398,
    "text": "So the body of knowledge, which we've described more thoroughly in I think probably our first round table, the body of knowledge is an idea drawn from the systems engineering body of knowledge, and it includes various kinds of products and enabling architecture,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1470.499,
    "end": 1491.627,
    "text": " all defined through interfaces and relationships with an ontology like this group creates this one or this one consumes this one pays for this one is paid by that one and that allows us to have seemingly disparate kinds of units in the body of knowledge like certification practices competency training of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.707,
    "end": 1514.51,
    "text": " course educational material and curriculum all these kinds of structures can exist within a broader network and we can identify where is something needed where something redundant where is something needing to be tweaked and as far as our progress or actions on that front we have uh developed the ontology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.187,
    "end": 1532.812,
    "text": " little bit which we'll walk through and we'll also mention the ontology working group we've released our terms list v1 and we're in the process of updating terms to v2 with an increasing number of language translations and we'll cover the next steps in a second so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.769,
    "end": 1557.237,
    "text": " here on 14 and 15 we're just showing a snapshot of this document which everybody is welcome to view and comment on this is the first tab of our working ontology document and the first tab has the core terms in green followed by their references up to five per",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1558.397,
    "end": 1577.622,
    "text": " term at this point and citable definitions where the term is used so not just papers where it's relevant but actually where we can point to and say the term was used in this way or defined this way by these authors at that time so this has been a big literature review effort and that's been quite fun",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.584,
    "end": 1589.991,
    "text": " Then on the second slide, we have those same exact core terms, and there's the introduction of the columns reflecting natural human language translations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.872,
    "end": 1602.92,
    "text": "So at this point, with the help of many on this call, we have Russian, Portuguese, Spanish, French, and Italian, all to reasonable degree of completion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.525,
    "end": 1609.838,
    "text": " and other ideas for how we could improve the state of those languages as well as introduce",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.078,
    "end": 1613.039,
    "text": " other languages and symbol systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.719,
    "end": 1622.403,
    "text": "So we also have a supplementary terms list, which is sort of our holding area for words that are relevant, but maybe not in the core.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1622.983,
    "end": 1635.288,
    "text": "And one thing that we're looking to is the kinds of governance mechanisms and collective decision-making mechanisms that would help us understand when to elevate a term from the supplement to the core and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1636.499,
    "end": 1641.583,
    "text": " So any comments on just the terms, translations, references, definitions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1642.985,
    "end": 1643.225,
    "text": "Alex?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.447,
    "end": 1652.052,
    "text": "I just wanted to share news from yesterday that we have full completion for Portuguese and Russian.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1653.373,
    "end": 1653.633,
    "text": "Nice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1654.534,
    "end": 1655.375,
    "text": "Crucial languages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1657.237,
    "end": 1664.663,
    "text": "Let's look at where this ontology working document is in our broader past, present, and future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.539,
    "end": 1673.325,
    "text": " So here we have drawn from a figure, a systems engineering dynamic lifecycle ontology paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.246,
    "end": 1680.892,
    "text": "From the left to the right, there's a continuum or a spectrum of levels of formality of ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.492,
    "end": 1691.721,
    "text": "So the entire left side you can see is defined as informal and lightweight ontologies, whereas increasingly expressive and formal ontologies and ontological systems are towards the right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1692.742,
    "end": 1701.164,
    "text": " So in the Q1 roundtable of 2021, what we had was a list of core and supplemental English terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.884,
    "end": 1708.386,
    "text": "So we were just then deciding what terms should we make the first pass for core terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.766,
    "end": 1713.107,
    "text": "Since then, we have updated the term membership.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.147,
    "end": 1715.128,
    "text": "We've added terms as well as we've",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.949,
    "end": 1720.992,
    "text": " started to think about how we can clarify the distinction between core and supplement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.012,
    "end": 1744.367,
    "text": "And what you've seen in these previous two slides were the introduction of references and definitions, which is as stated right now, it's a literature quest, but eventually we'll be looking to synthesize and integrate definitions and be able to say, here is two senses of this term, or this paper is using it in this sense, or even in this sentence, it's used in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.427,
    "end": 1746.669,
    "text": "And then in the next sentence, it's used in a different way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1747.649,
    "end": 1750.831,
    "text": " We've also introduced and really improved the translations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.551,
    "end": 1756.794,
    "text": "So that's something where everybody who's willing to would be welcome to contribute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.555,
    "end": 1765.779,
    "text": "And then we've continued our march from the terms to the blue highlighted boxes, which are web directories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1766.219,
    "end": 1768.26,
    "text": "The references are a web directory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.36,
    "end": 1769.621,
    "text": "They point to links on the web.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1770.521,
    "end": 1773.223,
    "text": "User classifications into the core and supplement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.349,
    "end": 1781.376,
    "text": " data dictionaries and structured glossaries, which are describing how definitions were used in papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.477,
    "end": 1786.401,
    "text": "And then we have this sort of pink line that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.406,
    "end": 1811.476,
    "text": " written as expert help and ontology working group and then here's ontology working group like a train kind of pushing to the right and in the ontology working group where we're working through this awesome book by adam peace ontology um we're going to be making that sort of two hands reaching out to each other so as we improve our ontological competence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.332,
    "end": 1815.715,
    "text": " we're also going to be increasingly engaging with experts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.975,
    "end": 1821.861,
    "text": "And so experts are welcome to assist whatever their level of interest is in Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.522,
    "end": 1831.27,
    "text": "And over the coming months, we're going to be working out in the ontology working group how we can be making an Active Inference ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.07,
    "end": 1832.831,
    "text": "Hello again, Ivan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.583,
    "end": 1839.987,
    "text": " Any other comments on this ontology slide overall?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.468,
    "end": 1845.833,
    "text": "Otherwise, we can just close and just say, everyone's welcome to get involved with project-based learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.714,
    "end": 1849.317,
    "text": "And broadly, this is knowledge engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.877,
    "end": 1853.881,
    "text": "We're learning by doing, and we're learning by doing by engineering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.382,
    "end": 1855.042,
    "text": "And it's about language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1855.723,
    "end": 1873.995,
    "text": " So especially people who are interested in language translations, if they see a language and they have a friend or they know a language that could be added, there's just millions to billions of people who don't have the English skill per se to read the research literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.636,
    "end": 1876.077,
    "text": "So we can reach out to them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.337,
    "end": 1878.778,
    "text": "And one way to do that is through translation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.679,
    "end": 1882.02,
    "text": " We can explore definitions and references better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.56,
    "end": 1898.626,
    "text": "So for those who like searching the literature for how things were said and meant, EDU will, as part of the body of knowledge, focus on curriculum development, which is the structuring of those core ideas into curriculum that makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1899.742,
    "end": 1905.986,
    "text": " and in our ontology working group, where we have a total range of skills, but we're all learning by doing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.546,
    "end": 1920.794,
    "text": "And we're trying to integrate best practices from the ontology lifecycle models of systems engineering, as well as ontology developments from Sumo, for example, starting with a list of core terms and a narrative that concisely describes the space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.414,
    "end": 1922.635,
    "text": "Stephen, and then anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.124,
    "end": 1942.255,
    "text": " I'd also comment how it's actually been very useful from a knowledge synthesis, just a learning perspective to go through the terms and see how they fit together and get a bigger picture on what can be quite overwhelming if you're just reading papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.396,
    "end": 1944.597,
    "text": "So things like what,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.811,
    "end": 1947.592,
    "text": " What are action states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.792,
    "end": 1949.674,
    "text": "What are sensory states?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.994,
    "end": 1952.096,
    "text": "And then you start to see there's a number of these types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.556,
    "end": 1955.678,
    "text": "What's it to be a non-equilibrium steady state?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.718,
    "end": 1959.661,
    "text": "So those questions are starting to sit in the background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.681,
    "end": 1962.123,
    "text": "We're holding back from getting too sucked in by them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.604,
    "end": 1971.931,
    "text": "But there's certain patterns, I think, that have come up with the terms, which has been quite useful, especially having done these live streams with different people over the last...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.632,
    "end": 1979.921,
    "text": " and seeing how some of those same ontological questions have come up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.021,
    "end": 1981.643,
    "text": "So I just thought I'd mention that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.985,
    "end": 1983.265,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.946,
    "end": 1986.75,
    "text": "Ivan, did you want to add something there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.83,
    "end": 1987.451,
    "text": "Yep, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.608,
    "end": 1990.068,
    "text": " Yeah, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1990.088,
    "end": 2014.074,
    "text": "I just want to mention that this schema is quite linear and it has a lot of checkpoints and during this quarter we made for six, I guess, six points and if we have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2017.695,
    "end": 2034.806,
    "text": " we will have the same speed, maybe we will make all this ontological work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2035.766,
    "end": 2046.052,
    "text": "But I think now we are just starting point and we have a lot of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2048.535,
    "end": 2054.939,
    "text": " difficult and interesting work within this anthology working group.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2056.445,
    "end": 2056.745,
    "text": " Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.086,
    "end": 2057.746,
    "text": "Totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2057.966,
    "end": 2063.071,
    "text": "This shouldn't be understood as us being 40% done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.751,
    "end": 2069.957,
    "text": "Even when we're way, way on the right side, we still won't even be a little bit done because there's so much to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2070.577,
    "end": 2079.385,
    "text": "And also it's so true that whatever level of skill we entered into this ontology working group with, we've all learned about domains that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.056,
    "end": 2108.323,
    "text": " just weren't working on so we weren't on projects that involved translation and just the issues that were raised regarding the subtlety of translation and about how terms were used through different epochs in the literature these are insights that just cannot be achieved outside of learning by doing there's no one who is waiting to tell us that information and then we called them this was like team working and finding out cool things about active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.074,
    "end": 2112.856,
    "text": " Okay, so onto comms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.516,
    "end": 2116.718,
    "text": "So this live stream, a comms presentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.418,
    "end": 2130.745,
    "text": "The goal of comms is to organize the lab's internal projects and activities, and that's driven by an active inference and communication-oriented worldview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.245,
    "end": 2137.929,
    "text": "So for example, a world unto themself, active inference and communication, one of the early papers we read,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.869,
    "end": 2156.678,
    "text": " we started to see the organization of teams especially remote teams as being related to the structure and the quality of communication so just like the capacity of the thing on your desk to be a computer is related to how the wires are connected which is a communications network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.358,
    "end": 2169.461,
    "text": " the structure or the capacity of a social system is related to the communication patterns that it is using at rest or in activity or during realignment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.961,
    "end": 2178.844,
    "text": "So communication engineering is a key principle that integrates what's happening inside of the computer to between computers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.304,
    "end": 2188.607,
    "text": " to the human and the computer, the human and the human, computer in the middle, all these combinations are subsets of broader ways of thinking about communications architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2189.787,
    "end": 2191.908,
    "text": "So that's how we think about communications internally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.488,
    "end": 2206.433,
    "text": "And then we, of course, think about communication on the interface between our lab and external stakeholders, because comms is in charge of carrying out all the forms of communication with external entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.813,
    "end": 2212.538,
    "text": " comms is the one who picks up the phone when you email active inference at gmail.com.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.978,
    "end": 2219.905,
    "text": "It is the interface that we have, and then information can be passed to other organizational units or roles as needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.44,
    "end": 2229.489,
    "text": " Our progress on this front was we continued the podcast and Blue, you're welcome to add anything about the podcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.99,
    "end": 2237.758,
    "text": "We also continued and developed with the help of especially Dean and Steven and Blue on the live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.499,
    "end": 2243.743,
    "text": " where the dot zero video is becoming contextualizing and a lot more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.204,
    "end": 2247.347,
    "text": "It helps us learn the paper and prepare for the discussions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2247.947,
    "end": 2266.263,
    "text": "And that's really been allowing us in the point one and the point two, along with authors who in almost every case have just been extremely generous with their time and in their interactions with our lab, it's helped the dot one and dot two be real jumping off points like hop, skip and a jump.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.883,
    "end": 2272.388,
    "text": " So a triple jump with the three sections rather than just logging through the content three times the same way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.348,
    "end": 2277.452,
    "text": "And we'll talk more about it in a second, but we also continued several of our streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.212,
    "end": 2279.834,
    "text": "Blue, what would you like to add there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2281.345,
    "end": 2282.405,
    "text": " Yeah, just about the podcast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2282.445,
    "end": 2291.828,
    "text": "I think we were just launching it in the last quarterly roundtable, like maybe had one episode out or maybe not, but we've been trying to release them weekly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2292.288,
    "end": 2302.951,
    "text": "Still trying to get interface with iTunes, but it's up on Android, Google Podcast, and there's one more platform that it's on, but it should be available and it's available through the RSS platform.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2304.031,
    "end": 2326.817,
    "text": " feed so there's a like sequential episodes that are already ready just backlogged i'm just releasing them weekly to try to make it like more regular as i remember to release them weekly like some i'm trying to do it on the weekend but sometimes it's like tuesday like oh no i forgot or it's like i'm going out of town this weekend so i'll release it early but um hopefully that'll be automated at one point also so just update there",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2327.597,
    "end": 2327.837,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.217,
    "end": 2331.038,
    "text": "And the podcast is awesome for those who haven't listened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.458,
    "end": 2345.283,
    "text": "It takes audio sections from live streams, earlier ones maybe that you haven't listened to, and it slightly recombines them and provides introductory context that makes it a lot more direct listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.943,
    "end": 2352.245,
    "text": "And so to pick out the trail to walk from just the map is an awesome skill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.285,
    "end": 2353.466,
    "text": "And so thanks, Blue, again for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.727,
    "end": 2358.569,
    "text": " Yeah, it's also just good for people who are maybe not looking at a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.669,
    "end": 2366.892,
    "text": "You know, I mean, it's like if you're, it's not an attempt to really get into the technical, like dive into active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2366.932,
    "end": 2379.757,
    "text": "So it's very much just like an interesting discussion because like, even though these concepts can be very technical, the FEP and active inference, and there's lots of equations and math going on and we are going through a paper, this is like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2380.157,
    "end": 2390.58,
    "text": " you can step away from the paper and just listen to like the interesting conversations that have been sparked by the paper, which that's kind of cool too, to just see how people approach it and how they think about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2391.48,
    "end": 2398.162,
    "text": "And also in many of the episodes, somebody's introduction is placed before the first time they speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.722,
    "end": 2404.344,
    "text": "So like a question will be asked and then it will go to the introduction, which probably happened 20 minutes earlier in the stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.784,
    "end": 2408.225,
    "text": "And then someone says, I'm in XYZ area working on this topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.185,
    "end": 2416.172,
    "text": " And what I think about culture and communication, and then it's like, ah, that connected the dots because that was very linearly distant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.533,
    "end": 2420.517,
    "text": "And during the stream, listening to it, it doesn't always pop out that same way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.057,
    "end": 2423.219,
    "text": "Stephen, or Blue, and then Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.52,
    "end": 2424.701,
    "text": "Yeah, let me just say one more thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2424.741,
    "end": 2426.483,
    "text": "So I am working on...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2427.924,
    "end": 2431.725,
    "text": " like smoothing out the audio because we all have different microphones.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2431.905,
    "end": 2437.566,
    "text": "And as like, I'm cutting different like excerpts out, sometimes the audio is not like smooth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2438.026,
    "end": 2444.907,
    "text": "So if anybody has any resources or skill, like with audacity, maybe I'm doing what I can with OBS and the filters in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.327,
    "end": 2451.449,
    "text": "But if anybody has any pointers on how to smooth out the audio, like I'm so happy to take that advice on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2451.469,
    "end": 2453.609,
    "text": "Thanks, Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.478,
    "end": 2457.319,
    "text": " Yeah, good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2457.619,
    "end": 2474.684,
    "text": "I just wanted to add that I think it's really useful for being able to go to just certain bits and re-listen to them, because often it's really good to see or go back and see the whole of the live stream, but sometimes the useful bit is there's a certain...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.055,
    "end": 2490.575,
    "text": " 20 seconds and sometimes it's useful just to listen it again and again and it's like oh i get it now you know or because it's just too much sometimes the first time you listen to it and you know sometimes people probably see our eyes go a little bit panicky when it starts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.616,
    "end": 2508.4,
    "text": " trying to track what exactly has just been said so sometimes though having the chance to yeah listen to it a few times because once you get one bit then you start to unlock the other pieces start to make sense and that that's quite useful so so yeah thanks for doing that blue it's really helpful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.525,
    "end": 2527.373,
    "text": " yep it's like a many coats of paint on a really big mural so okay communication we're thinking about it this way instead of this other way okay got it and then you hear communication in another context so we add to the depth of our understanding we as we link ideas and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.556,
    "end": 2531.457,
    "text": " see people who have come to the ideas from a lot of different angles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2532.518,
    "end": 2537.16,
    "text": "Here is some of our live streams that are just screenshotted out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2537.921,
    "end": 2548.206,
    "text": "So we're up to almost 60 after we do 23.1 and two in the coming weeks, almost 60 classical live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.366,
    "end": 2551.627,
    "text": " That's the regular Tuesday's session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.607,
    "end": 2555.228,
    "text": "We're up to seven completed guest streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.028,
    "end": 2565.731,
    "text": "So in the past quarter, we had some excellent discussion on the technical side and also on the technical critique side, which is very important for the field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.681,
    "end": 2575.887,
    "text": " in five guest stream from Martin Beale, and then in guest stream seven with Miguel Aguilera and others, and also with Anasia Yunica.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.488,
    "end": 2578.929,
    "text": "Heard about co-embodiment and about first prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.989,
    "end": 2589.837,
    "text": "So spanning the gamut and those guest streams are our open invitation to anybody who wants to present on something that's relevant to be brought to the lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2590.217,
    "end": 2593.619,
    "text": "And hopefully we'll continue to show that there's many ways to do a guest stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.56,
    "end": 2595.361,
    "text": "In the model streaming,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.081,
    "end": 2616.938,
    "text": " just a couple of days ago we had uh ozan katal and tim verbellen talking about robotics and that was some of our first foray into robotics and it was just awesome and inspiring to see a little robot in the aisle and to understand how all of these different sensors could be integrated on the fly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.839,
    "end": 2621.522,
    "text": " and then to hear their distinction between reinforcement learning and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.002,
    "end": 2624.844,
    "text": "So that's some awesome engineering work, and it's exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.324,
    "end": 2634.61,
    "text": "We also had a model stream two with Noor, Sajid, and Philip Ball, also extremely helpful from their demystifying active inference paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.343,
    "end": 2637.204,
    "text": " cool streams there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2637.844,
    "end": 2653.274,
    "text": "We had six streams with John Boyk, four background streams where we went through on a jam board, his tripartite paper on sustainability and social systems change and science-driven transformation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.895,
    "end": 2661.28,
    "text": "So John just really took it to the next level with an author engaging with us before the guest appearances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.84,
    "end": 2665.763,
    "text": "And then we were able to have a dot one and a dot two that was also really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2666.643,
    "end": 2671.966,
    "text": " And then on the bottom left there, we've had two math streams, both with Shauna Dobson.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.507,
    "end": 2679.071,
    "text": "And then we'll have another one with more of a group discussion with Blue and Shauna and others next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2679.611,
    "end": 2689.377,
    "text": "And so math stream, again, just there's so many cool ideas that come into play, like dynamical systems or control theory, category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.997,
    "end": 2691.538,
    "text": " Those are big topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.098,
    "end": 2697.902,
    "text": "You could have a whole section of a bookstore or a whole major on those kinds of topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2698.422,
    "end": 2699.923,
    "text": "And math is a big area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.243,
    "end": 2703.565,
    "text": "Math is the generalization layer for science in a lot of ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.146,
    "end": 2708.389,
    "text": "So we can work towards each of these series being able to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2709.696,
    "end": 2721.747,
    "text": " raise up different aspects of active inference, as well as be like a two directional highway, connecting those who are interested in active inference to ideas that they might not have considered or known about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.288,
    "end": 2729.235,
    "text": "And also people who are considering those ideas every single day, bringing them a new perspective on active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.735,
    "end": 2731.517,
    "text": "So Yvonne, and then Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2734.502,
    "end": 2735.162,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2735.663,
    "end": 2761.895,
    "text": "I just want to totally recommend for all who just starts to deep active inference thema to watch .Zero streams with our colleagues Dean and Blue and say",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2764.091,
    "end": 2788.781,
    "text": " thank thank you guys it's uh it's totally helpful streams and uh for me now it's preferable uh type of watching streams it's uh just online youtube because when i watched it online with the room with people inside the room i",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2790.825,
    "end": 2792.666,
    "text": " often find myself lost.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2792.786,
    "end": 2810.654,
    "text": "So when I see it on YouTube, I have a chance to go back and after that, just on double speed to get it almost online.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2812.394,
    "end": 2813.035,
    "text": "Thank you, Ivan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.555,
    "end": 2815.015,
    "text": "Stephen, and then anyone else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.135,
    "end": 2818.477,
    "text": "Maybe Dean, if you have a thought on the dot zeros as well, but Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2819.963,
    "end": 2822.055,
    "text": " Yeah, those dot zeros are really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.075,
    "end": 2823.825,
    "text": "And it's been really, really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.915,
    "end": 2852.394,
    "text": " exciting to have these real specialists in math so we think oh the active inference has got a lot of math but then these are the people that are more into the math than even the active inference that the active inference people are often talking to you know in some and to have them given a voice and I think they really appreciated that but to have a voice and to be questioned and to be brought back the other way I think it's really helpful because I think you see there's a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.214,
    "end": 2861.259,
    "text": " people come in attacking, the word attacking, I'm not being too dramatic with that, but attacking active inference from a math formalism perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.78,
    "end": 2874.628,
    "text": "And so to have it just coming from people, and they talk about their own area, their own fields of math, which might have stuff that isn't so clear, they're questioning, they're trying to explore, particularly category theory, stuff right on the edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.129,
    "end": 2877.33,
    "text": "I think that's really, really valuable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.131,
    "end": 2881.773,
    "text": "And I think that's going to be something that I haven't seen anywhere else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.073,
    "end": 2883.054,
    "text": "So I think that's really great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.534,
    "end": 2885.975,
    "text": " Yep, it's been really fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.555,
    "end": 2893.877,
    "text": "So anyone else want to add a comment on just the live stream repertoire or diversity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2893.977,
    "end": 2895.357,
    "text": "Dean, and then anyone else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.578,
    "end": 2905.56,
    "text": "Yeah, thanks, Ivan, and thank you to Stephen and Blue and Daniel and anybody else that's done those point zeros.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2907.637,
    "end": 2911.801,
    "text": " So I just want to talk for one second about the getting lost piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2911.901,
    "end": 2920.028,
    "text": "I think that's something that should... I know it doesn't sound like a... It doesn't sound fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2920.088,
    "end": 2921.389,
    "text": "Who likes to be disoriented?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2923.011,
    "end": 2927.615,
    "text": "And if you are, if that's the kind of personality you are, the disorientation is your...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.812,
    "end": 2931.233,
    "text": " is your drip, I guess, then that's cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2931.273,
    "end": 2936.056,
    "text": "But for most people, they want to kind of get the control back, today being a perfect example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2936.616,
    "end": 2938.097,
    "text": "I didn't have the slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2938.477,
    "end": 2944.601,
    "text": "I had to figure out how to get the YouTube on a second window and turn the sound off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2944.901,
    "end": 2949.843,
    "text": "And so I was dealing with my own Markov blanket for the first 25 minutes of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.464,
    "end": 2956.307,
    "text": "And I think one of the things about the point zero is, and I think it really matters, is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.907,
    "end": 2961.149,
    "text": " Nobody wants to be serially disoriented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.629,
    "end": 2966.512,
    "text": "People want to be able to get into that place where they find themselves reoriented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.832,
    "end": 2972.815,
    "text": "And I think however we go forward with the point zeros, we always want to kind of keep that in front of mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.416,
    "end": 2977.338,
    "text": "We want to really be explicit about the fact that at any given moment,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2978.778,
    "end": 2986.706,
    "text": " your ability to sort of keep up, I keep talking about this all the time, the ability to sort of keep up with the rate at which this information is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.463,
    "end": 2995.327,
    "text": " unfolding isn't you're not always going to be able to keep your optimal grip or hold the butterfly or insert metaphor here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2995.887,
    "end": 2998.369,
    "text": "Thankfully, we have Daniel who's really good at metaphors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2999.709,
    "end": 3011.176,
    "text": "But most of the time, if you can't bring it off the abstraction shelf and put it into some sort of material sense of something that you're familiar with, you're constantly feeling like you're catching up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3011.276,
    "end": 3011.656,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3013.908,
    "end": 3018.492,
    "text": " I know there's going to be a lot of time spent on getting some sort of a standardization process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.532,
    "end": 3029.361,
    "text": "And I know, I understand that you're trying to create an engineering piece that's not too instructionalist and is more interactionist and all that stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3029.421,
    "end": 3031.243,
    "text": "And I think that's happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.663,
    "end": 3040.11,
    "text": "But I think at the base of it is just a real empathy for the fact that people who do join, I joined this partway through this quarter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3040.939,
    "end": 3043.7,
    "text": " So I'm like a two-thirds of a quarter kind of guy right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3043.74,
    "end": 3045.501,
    "text": "That's why I kept my mouth shut.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3047.022,
    "end": 3063.809,
    "text": "But I think if we have that empathy for people who jump into this, regardless of what their experience level is, I just think that that's going to be really good in terms of maintaining and maybe building on this in terms of more people feeling comfortable with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3064.724,
    "end": 3069.448,
    "text": " Like me, I don't even like to open my mouth in these situations, but you guys have pulled it out of me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.528,
    "end": 3071.85,
    "text": "So I'm just trying to figure out why that happened.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3071.89,
    "end": 3075.032,
    "text": "And I think it's because there's a certain kindness and an empathy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.954,
    "end": 3077.734,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.875,
    "end": 3078.175,
    "text": "Ivan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.577,
    "end": 3087.422,
    "text": "I think all time along the lab will be exist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3087.522,
    "end": 3089.084,
    "text": "Every time will be...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3091.827,
    "end": 3097.189,
    "text": " people who just started to try and understand active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3098.13,
    "end": 3111.236,
    "text": "And it's this case where we will be in the same point as we are now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3111.256,
    "end": 3115.818,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3116.058,
    "end": 3116.278,
    "text": "Lou?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3118.099,
    "end": 3120.96,
    "text": "So just in response to Dean, I'm like...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.438,
    "end": 3123.459,
    "text": " way farther in, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3123.499,
    "end": 3127.26,
    "text": "Maybe like, I don't know, nine months or something into the active inference study.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.34,
    "end": 3130.662,
    "text": "And I still feel like I'm catching up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.102,
    "end": 3133.283,
    "text": "So I think it has to do with your background.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.343,
    "end": 3135.004,
    "text": "There's like a relational framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.364,
    "end": 3137.225,
    "text": "We're all coming from different perspectives.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3137.265,
    "end": 3141.887,
    "text": "Some people are well-versed in philosophy or mathematics, or for me, it's neuroscience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.308,
    "end": 3146.61,
    "text": "So whatever your background is, like you kind of can fit into the active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3147.11,
    "end": 3150.851,
    "text": " from that angle, but then like, you're still trying to catch up in every other angle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3150.911,
    "end": 3154.093,
    "text": "Like, I don't know anything about philosophy, so it's all like new to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3154.793,
    "end": 3161.555,
    "text": "And some of like the, like I'm good with math, but not like the formalisms of math and how like, you know, there's lots of symbols in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3161.575,
    "end": 3162.936,
    "text": "I'm like, what does that even mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3163.796,
    "end": 3167.438,
    "text": "So, you know, I think we're all kind of approaching it from a different space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.538,
    "end": 3169.718,
    "text": "I'm still, I still feel like I'm catching up all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.179,
    "end": 3172.319,
    "text": "So I don't know if that feeling is ever going to go away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3172.339,
    "end": 3173.48,
    "text": "I kind of hope not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3175.791,
    "end": 3197.517,
    "text": " nice totally agreed it's not a uh finished skyscraper it's not like everybody who has caught up is waiting on the 100th floor just laughing or something like that it's like a diffusion of an ink spill and so is any ink molecule catching up with what the edge well if they want to they could probably get there in time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.377,
    "end": 3217.444,
    "text": " and um those questions what is active inference and how do we apply it just like what is complexity how do we apply complexity those are the questions that bring in in in introductory person and also remind those who have been in the area a long time to have a beginner's mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3218.024,
    "end": 3230.671,
    "text": " So having a question that can be understood on multiple levels is really important for integrating the community because it's not like there's one question that gets you in the door and then we switch out the question for another question later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3231.271,
    "end": 3240.736,
    "text": "We can be working as an integrated whole on what active inference is and clarifying that for ourselves and through our constructed niche, Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.213,
    "end": 3261.603,
    "text": " Yeah, I think that also Dean makes quite a good point that the new affordance of the dot zero to help that orientation process, it does help because often we're bringing someone in for the first time to meet us, to share a paper, and we may have slides we've prepared.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.663,
    "end": 3266.725,
    "text": "They may want to suddenly bring in some other slides because a couple of days before they suddenly had a synthesis themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.366,
    "end": 3271.528,
    "text": "So having that dot zero is quite a nice way to sort of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.983,
    "end": 3287.13,
    "text": " like you had in mind there as a way to orientate people and maybe even feed a couple of bones, so to speak, for people to chew on for their journey, even if it doesn't go into all the details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.25,
    "end": 3298.696,
    "text": "So maybe we'll learn some strategies or how .zeros work and how to become more expert at using those opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.574,
    "end": 3305.762,
    "text": " Yep, we hopefully show the authors and our participatory audience that we're taking it seriously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.182,
    "end": 3311.409,
    "text": "We haven't just asked them three months ago to show up at a random link and then we didn't think about it before then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.57,
    "end": 3317.496,
    "text": "It's also the work that we have to do to have the slides and the fluidity ready",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3318.417,
    "end": 3342.087,
    "text": " and it does so many things and dot zero the prerequisite for participating isn't understanding the paper you'll find there was papers where we just traced out the section titles and said okay we want to learn about that we want to learn about that we're curious about this so those who can um come on a live stream and be curious or can assist in the slides if they don't want to come on live",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.927,
    "end": 3358.93,
    "text": " that could include every single background because we're not evaluating on a rubric of how tall are you on the active inference understanding scale which doesn't even exist at this point so cool about the dot zeros let's talk about another production of comms that will be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3360.011,
    "end": 3363.634,
    "text": " the Carl Fristen mini symposium on June 21st, 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.215,
    "end": 3368.497,
    "text": "So this is going to be, and anyone's welcome to raise your hand and give a thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3368.537,
    "end": 3370.659,
    "text": "I'll just give kind of a logistical overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.599,
    "end": 3384.388,
    "text": "Carl has written to us and said in fancy italics, I generally find these kinds of sessions most productive if we are, I am, in response mode and deal with questions that people bring to the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3384.929,
    "end": 3388.672,
    "text": "So to that end, we've decided to structure the symposium",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.412,
    "end": 3394.073,
    "text": " along three sessions, each driven by one of our organizational unit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.834,
    "end": 3401.716,
    "text": "And then we've also been soliciting and compiling and integrating a lot of awesome questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3402.156,
    "end": 3405.657,
    "text": "So everybody here has helped generate questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.717,
    "end": 3409.838,
    "text": "And Maria, thanks so much for also helping on a few other aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.638,
    "end": 3417.284,
    "text": " For anybody who wants to get involved, there's a Google form they can fill out if they want to stay updated when the videos are released.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.805,
    "end": 3420.908,
    "text": "It won't be live streamed, but we'll release the videos shortly after.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.305,
    "end": 3449.084,
    "text": " and it's an opportunity if somebody wants to co-organize with us on this event and then be able to participate in the proceedings live that's totally an option and yes we're mentioning it on this live stream because we want to solicit the kinds of questions and foci for this event that would be most becoming of the special opportunity that it is so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.35,
    "end": 3457.344,
    "text": " Anyone want to add a thought on what might be exciting about this Carl Fristen Symposium?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.546,
    "end": 3460.971,
    "text": "It's also a little bit like our end of semester",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.283,
    "end": 3487.171,
    "text": " moment so it'll be a amazing first semester and then we'll pull back for a few weeks continuing our operations and learning but preparing for the next semester to begin in august but it will be an awesome way to end the semester stephen and then yvonne and then anyone else yeah well i'm hoping carl friston be really interested by the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.672,
    "end": 3498.815,
    "text": " interdisciplinarity or transdisciplinarity of the participants that are in this mix that we've been sort of inside and exploring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.875,
    "end": 3515.459,
    "text": "So I'm really curious how we can bring those kind of applied questions to the table and keep it all within sort of a manageable scope because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.84,
    "end": 3519.201,
    "text": " we're seeing so many things that could come up, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.241,
    "end": 3521.842,
    "text": "And there's a lot of huge areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.882,
    "end": 3533.268,
    "text": "So I think as we start to refine the vision of Active Inference Lab, that also is helping a little bit, give him an anchor to where we're coming from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.368,
    "end": 3538.61,
    "text": "So I'm looking forward to this next couple of weeks as it starts to shape up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.511,
    "end": 3541.071,
    "text": "Totally agreed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.171,
    "end": 3541.531,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3542.412,
    "end": 3544.993,
    "text": "Yvonne, and then if anyone else wants to add a comment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.768,
    "end": 3547.249,
    "text": " Yeah, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3549.351,
    "end": 3567.725,
    "text": "To meet Carl here in lab, it's a very big pleasure, a big honor, and saying thanks for all participants and for all guests that we have Carl's attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3568.726,
    "end": 3574.31,
    "text": "And for the community as well as like other participants,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3575.727,
    "end": 3598.68,
    "text": " other community we can have some special special event for one one year to have carl once a year it will be like like our holiday cool thank you dean",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3601.489,
    "end": 3615.781,
    "text": " One of the things I want my participating in this is to get hopefully some more insights because I did a lot of programming using active inference before I joined this and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.338,
    "end": 3632.762,
    "text": " Most of the time, my colleagues, I couldn't even broach the idea of active inference with them because they were so, this was so, in their opinion, this was so out there that it wasn't even as accessible to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3632.802,
    "end": 3637.703,
    "text": "And I understand that this process here is to try and build a foundation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3638.323,
    "end": 3649.085,
    "text": " And one of the things I'd like to talk to Dr. Fursten about is, so when does this become more available to the general masses?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.125,
    "end": 3660.528,
    "text": "Because I truly believe, you know, based on the conversation of the last live stream, there's still things that are being done every single day, just because that's the way we've always done it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3661.568,
    "end": 3669.876,
    "text": " And I think what he's introduced is some new ways of looking at things, not to discard everything that was ever been done, because that's not very respectful, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3671.141,
    "end": 3690.471,
    "text": " I would really like to know how you can make this accessible so that when you're sitting in your backyard having some pops with some friends, you don't even want to talk about it because even though you find it super exciting, they look at you like you just grew a third eye and I just came here to relax, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3690.491,
    "end": 3693.392,
    "text": "Because I think part of this for a lot of people is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3696.044,
    "end": 3706.649,
    "text": " It sounds really, really cool and interesting, but it also sounds like you need Erickson's 10,000 hours just to begin looking at it with any degree of sentience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3707.109,
    "end": 3714.612,
    "text": "So talking to Dr. Friston about how we make that anthill a little bit more accessible would be really cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3716.155,
    "end": 3739.704,
    "text": " cool for some reason sitting in the backyard it just made me think of some friends they're watching a bird are they going to understand the bird's behavior in terms of reward maximization or will they understand the bird's behavior in terms of reducing its uncertainty about its generative model and its niche and the evolution of birds or will it be framed in the economic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3740.444,
    "end": 3743.406,
    "text": " quote, rational agent reinforcement learning framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3743.826,
    "end": 3747.108,
    "text": "So the shift could take place in the backyard as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3747.408,
    "end": 3747.668,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.69,
    "end": 3755.473,
    "text": "Yeah, and I think that's a good point that those different ways of seeing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.493,
    "end": 3763.298,
    "text": "And of course, active inference in application, it moves to approximate each of those at different times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.318,
    "end": 3765.139,
    "text": "So I think that's what's quite interesting is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.379,
    "end": 3778.166,
    "text": " The general desire to give someone the answer is so ingrained in our culture because we happen to think we've got the answer to everything at some subliminal level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.726,
    "end": 3784.91,
    "text": "So we're a little bit trapped, and we all are to some extent in that because it's so ingrained, even though we try not to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.93,
    "end": 3794.375,
    "text": "And therefore, this idea that this question about, you know, what's this more like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.142,
    "end": 3799.963,
    "text": " gets into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.043,
    "end": 3802.667,
    "text": "So maybe having some different types of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.132,
    "end": 3807.153,
    "text": " work around the types of metaphors, the types of examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.213,
    "end": 3815.815,
    "text": "He has that classic one with the cat that looks like the cat's ears, which in the shadow looks like a wolf howling, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3816.155,
    "end": 3819.996,
    "text": "And then you realize, you know, but at the end of the day, it did the job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.076,
    "end": 3828.958,
    "text": "So, you know, there may be some of these questions around the sort of what would we say about this in the back garden could be actually quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.978,
    "end": 3831.279,
    "text": "Because I've had this very similar experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.639,
    "end": 3833.48,
    "text": " trouble in many different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.78,
    "end": 3840.762,
    "text": "And, you know, sometimes you just wish I hadn't brought it up, you know, because, but that, that is changing now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.063,
    "end": 3843.263,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.763,
    "end": 3844.263,
    "text": "Fun stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.624,
    "end": 3845.844,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.864,
    "end": 3848.585,
    "text": "And then just anyone raise their hand if they want to add anything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.645,
    "end": 3848.845,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.905,
    "end": 3849.525,
    "text": "Alex, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3851.686,
    "end": 3851.906,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3851.986,
    "end": 3852.266,
    "text": "Thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3852.366,
    "end": 3854.467,
    "text": "I just want to add shortly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3855.487,
    "end": 3860.929,
    "text": "We had that conclusion in some discussion that person need to be active in front.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3861.808,
    "end": 3865.655,
    "text": " before he started to learn Active Inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3866.637,
    "end": 3866.837,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3866.857,
    "end": 3871.506,
    "text": "The first question is, how is this going to increase my paycheck tomorrow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3872.432,
    "end": 3897.522,
    "text": " know that's easy to answer it won't but for those who are wanting to reduce their uncertainty and understanding that exploratory play you know early on playing with a toy just like i'm playing with now it's exploratory and then maybe i'll make something rewarding with it later or maybe not maybe i never need to turn the dial that way and so people who approach the conceptual world with that kind of a spirit um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.332,
    "end": 3913.696,
    "text": " with play and reward on a sort of fine-tuned balance and a sensitivity for uncommon patterns and just being in relationship with the material, I think that they'll always go far in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3913.796,
    "end": 3916.957,
    "text": "And by doing so, they'll push the whole field ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.318,
    "end": 3918.438,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.733,
    "end": 3936.761,
    "text": " One other piece here is just our live stream checklist, which we kind of increasingly hope that individuals follow before they go on a live stream, ranging from just things that they can do ergonomically to improving their internet bandwidth and their cognitive bandwidth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.461,
    "end": 3956.747,
    "text": " These are things that could hopefully help us propagate good practice for online team communication in live streams at first, where the performance is of the utmost, but also in other situations, like thinking about video chats that you're in as respecting your partner's time and requiring preparation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.087,
    "end": 3962.469,
    "text": "And then we'll just close this section with the affordances for participating in .com's blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.529,
    "end": 3962.809,
    "text": "Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.477,
    "end": 3979.629,
    "text": " So just from the, hi, I'm evaluating the quality of your audio side, just something to put in there in the facilitator checklist, like having my shiny new condenser microphone, which I know some of us have, it's like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3980.109,
    "end": 4006.506,
    "text": " life-changing in terms of how audio quality sounds so if you are replaying the um the live stream videos and you're wondering like why do i sound like crap well it's because your microphone is crap i just want to put that out there it's a small investment like 50 bucks i know it can be like life bank breaking if you're a college student sometimes but um you know really just as someone who's evaluating the quality of your audio do us a favor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4007.87,
    "end": 4010.972,
    "text": " Audio engineer blue saying it so that others don't have to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4011.913,
    "end": 4017.376,
    "text": "Anyone who is a repeat participant will provide them the hardware to participate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4017.997,
    "end": 4026.102,
    "text": "And that is gonna be fun, I think, as we continue to explore hardware and software affordances for participants, maybe a kit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.342,
    "end": 4028.564,
    "text": "Do you need just the microphone, but your internet is good?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4028.644,
    "end": 4030.886,
    "text": "Do you need just a connection to the internet?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4031.806,
    "end": 4035.809,
    "text": "There will be participants who will be able to contribute with that enabling architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4037.383,
    "end": 4042.644,
    "text": " Those who want to participate in .coms, well, there's several things that can be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4043.264,
    "end": 4058.208,
    "text": "First, anyone is welcome to get involved with contributing to the current series that we have, whether the podcast, which has been mostly Blue's effort, or any of these series that we have, like the live stream paper discussions, the guest stream, model stream, math stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.948,
    "end": 4082.456,
    "text": " so for these formats it's possible to help us co-organize make the connection to somebody who you think should come onto a stream or help structure a collaboration in another way but if you saw one of those videos and you liked it or you wish that there could have been one like another episode of the model stream with a different robotics lab or another math stream on a different math topic that's the right way to go about it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.476,
    "end": 4096.087,
    "text": " and also it's possible to introduce a new series or format maybe we'll have so many robotics discussions we'll have a robo stream or we'll have enough mere mycology research to have an ant stream",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.472,
    "end": 4102.156,
    "text": " We can also focus on onboarding new participants to live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.576,
    "end": 4106.48,
    "text": "So people who've come on once and kind of thought it was fun, maybe they want to help others do the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.441,
    "end": 4113.145,
    "text": "We also want to explore other communications format and media like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4113.886,
    "end": 4141.678,
    "text": " events uh series like a discussion series could be recorded or not you know what steven just brought up with the metaphors or you know making active inference tangible you know active inference in your hands those are kinds of things that could be a fun different series also there's different formats blogs short writings tutorials meme generation of course always a job opening for meme engineering",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4143.406,
    "end": 4145.988,
    "text": " But .coms is the interface with the external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.328,
    "end": 4155.295,
    "text": "So anybody who likes that sort of communication oriented work is going to find a home in comms and also comms plays a role in the internal structuring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4155.815,
    "end": 4166.523,
    "text": "So for those who want to understand a little bit about how communications engineering internally is used for an efficient and an inclusive and accessible teams,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.364,
    "end": 4174.426,
    "text": " That's a different environment operating than to the external, but both kinds of communications are really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4175.407,
    "end": 4175.647,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.247,
    "end": 4184.309,
    "text": "Going on to tools, anyone just raise their hand if they have any questions and the live chat people can ask if they have any comments or questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.05,
    "end": 4185.27,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.39,
    "end": 4189.251,
    "text": "So here we are in our third organizational unit of tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.53,
    "end": 4198.534,
    "text": " The goal of tools is to enable effective tool and instrument use for everything that is happening in our lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.715,
    "end": 4215.864,
    "text": "The tools organizational unit explores and designs affordances for our niche, which will result in effective action as well as innovations and probably product developments that are downstream of working on the areas that we see as important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4217.179,
    "end": 4232.012,
    "text": " There's been awesome progress related to weekly meetings for sharing resource needs and ideas, as well as a series of brainstorming and product development meetings, which I'll leave anyone else to describe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4232.973,
    "end": 4261.592,
    "text": " and the current next steps are focusing on onboarding participant into the tools operations understanding the lab tool use and needs as well as some other outcomes of again this series that was undertaken by alex and others so alex do you want to describe what transpired there or with the tools um yeah yeah i just want to the comment and with connection for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4263.77,
    "end": 4284.863,
    "text": " needs from blue that she mentioned so and it will be like an example for what the tools will will do so bloom mentioned about some needs for automation for podcast and also some maybe tools for smooth out audios",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4285.754,
    "end": 4313.961,
    "text": " so we will need to have some special session or just make it asynchronous to document such needs and then the tools as enabling system to support technical parts of our organizational units jobs we will work on it and provide some solution to needs for working with podcasts",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4314.804,
    "end": 4326.598,
    "text": " And so it's for all other possible needs from organizational units, what we have now or will be in future, this entity will support them in technical needs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4327.88,
    "end": 4328.1,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4328.821,
    "end": 4329.041,
    "text": "Ivan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4331.303,
    "end": 4347.034,
    "text": " I just wanted to add that there is no main unit in the lab, so all three units are like each scuffles the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4349.264,
    "end": 4372.542,
    "text": " from auto-enabling system that every... so every one is the main and every is... and each has special program to help others.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4373.632,
    "end": 4374.733,
    "text": " Thanks, great point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4374.913,
    "end": 4378.156,
    "text": "It's like organs with specialized function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.036,
    "end": 4385.782,
    "text": "You can't have one organ that does it all, and so they co-enable each other in the context of a broader whole.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4386.863,
    "end": 4389.745,
    "text": "This is a figure from our September 2020 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.815,
    "end": 4394.137,
    "text": " active inference and behavior engineering for teams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4395.097,
    "end": 4404.543,
    "text": "And this was our representation of thinking about how teams were linked through basically informational blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.164,
    "end": 4408.046,
    "text": "And so inside of the team blanket, the team Markov blanket,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.048,
    "end": 4438.348,
    "text": " you have team members who are bounded by their human computer interface, and they are able to pass information back and forth to databases, single source of truths, whether it's the Jitsi server that all of our video information is relayed to before it gets rebroadcast back out to us, or whether team member B is watching the live stream and YouTube's database is the one that is taking in my video streaming and outputting on their screen video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4439.228,
    "end": 4440.951,
    "text": " However, we want to model this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.351,
    "end": 4444.676,
    "text": "This is kind of our big picture for thinking about for online teams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.477,
    "end": 4450.544,
    "text": "What kinds of tools and systems are we engineering?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.904,
    "end": 4451.145,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4452.759,
    "end": 4458.686,
    "text": " Yeah, I like how you've got the database sort of inside the team Markov blanket as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.706,
    "end": 4468.036,
    "text": "So it sort of shows how you can have parts of the niche on the external world on the inside or the outside of another scale of blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.056,
    "end": 4472.541,
    "text": "Um, so you know, that type of, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.894,
    "end": 4477.657,
    "text": " way of interacting that's not so common with other systems approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.977,
    "end": 4484.823,
    "text": "So this nestedness of there's no definitive inside outside as the scaling blends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.904,
    "end": 4487.565,
    "text": "So I just thought I'd mention that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.945,
    "end": 4488.106,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4488.866,
    "end": 4489.146,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.987,
    "end": 4496.853,
    "text": "And here's how we hierarchically nest in our Google Drive, our cloud storage folder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4498.103,
    "end": 4506.588,
    "text": " we have an admin folder for organizer information, and then each organizational unit has information that's accessible to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.128,
    "end": 4523.057,
    "text": "And so in a unit and project-based way, we have nesting of reading and writing privileges that allows us to sort of unambiguously understand what information does somebody need to see, and then what information are they contributing on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.077,
    "end": 4524.638,
    "text": "Yvonne, do you still have your hand raised?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.161,
    "end": 4528.363,
    "text": " Okay, so that's our Google Drive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4528.463,
    "end": 4530.485,
    "text": "Just sort of walk through a couple of our other tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.866,
    "end": 4535.729,
    "text": "On the right, we have a lot of Google documents and sheets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.369,
    "end": 4537.831,
    "text": "This is our formal documents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4537.871,
    "end": 4541.113,
    "text": "So we use various kinds like slides and sheets and docs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4542.145,
    "end": 4559.597,
    "text": " on the ontology tool side we a little bit have used the online although there's a downloadable as well ontology editor protege and then also we've been with some help from tim and others working on setting up a sigma ontology development environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.714,
    "end": 4564.657,
    "text": " which is related to Sumo, the ontology approach that we're pursuing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.378,
    "end": 4569.981,
    "text": "So this is a formal approach for ontology modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.181,
    "end": 4575.366,
    "text": "And an example of a statement in Suo Kif is written here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.926,
    "end": 4578.588,
    "text": "So that's what the ontology working group is developing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.249,
    "end": 4585.714,
    "text": "And it shows again, the power of working on a team, because how many of us could have ever set up the cloud,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4587.475,
    "end": 4590.457,
    "text": " Sumo environment, none or maybe one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4590.817,
    "end": 4592.197,
    "text": "How many could even set it up locally?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.457,
    "end": 4594.739,
    "text": "Again, none or maybe even a few.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.339,
    "end": 4598.02,
    "text": "But we do have somebody who has experience with cloud setups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.48,
    "end": 4611.727,
    "text": "So we will have a cloud working space, and that is going to enable participants who want to have that ramp from not having Sigma, not knowing ontology, to maybe having both and understanding both,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4612.327,
    "end": 4620.035,
    "text": " It's going to be an easier and a better ramp when we can share resources in our team, especially the Sigmontology development environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4621.836,
    "end": 4627.141,
    "text": "We still use Keybase as our backend and single source of truth for organizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4628.423,
    "end": 4632.647,
    "text": "Although we have a Discord as well that has been awesome for a lot of collaboration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.246,
    "end": 4642.113,
    "text": " For communicating externally, our primary source is our monthly newsletter, which sometimes sends out other announcements as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.794,
    "end": 4650.32,
    "text": "And then we have a Discord with people who want to be in a more web platform interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.38,
    "end": 4656.166,
    "text": "It's been great for the collective intelligence project that Blue and several others have been involved in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4657.106,
    "end": 4658.327,
    "text": "And then Twitter, we've...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4659.168,
    "end": 4681.057,
    "text": " use that social media affordance as it's where a lot of the community is then on the audio visual side this is sort of all down onto one slide using youtube for live streaming and viewing using jitsi and gather town for video chat we're on a jitsi right now and then using obs broadcaster role",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.509,
    "end": 4685.731,
    "text": " Okay, any comments on tools?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.851,
    "end": 4688.613,
    "text": "Otherwise we'll head to future and the next steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.633,
    "end": 4694.496,
    "text": "All right, so hashtag future and really our next steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4696.498,
    "end": 4699.72,
    "text": "As we are heading into our third quarter of activity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.754,
    "end": 4707.261,
    "text": " We, first off, are going to be taking the next steps that we described in each of those organizational units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.721,
    "end": 4718.653,
    "text": "So, EDU, comms, and tools will continue navigating, wayfinding, sensemaking along the ways that they've been describing in this conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4720.45,
    "end": 4744.403,
    "text": " As the lab as a whole heads into the third quarter of activity, though, we will be focusing more on defining governance structures and exploring new affordances that are now available to the nonprofit, which was part of our strategy from the beginning, achieve the nonprofit, understand which affordances would now be possible or even likely, and then enact those possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.29,
    "end": 4747.351,
    "text": " So at the lab level, that's what we would like to see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.931,
    "end": 4772.658,
    "text": "And also experimenting and defining governance structures, whether it's a governance structure that we don't need any new technology or tools for, like just clarifying, how do we make a vote on whether a certain guest is appropriate for a guest stream or not, all the way up to the token engineering of NFTs and more DeFi or distributed governance type applications for,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4773.678,
    "end": 4775.078,
    "text": " who knows what the next steps may be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.639,
    "end": 4780.96,
    "text": "And then also during June, it'll be an awesome note to end the semester on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.781,
    "end": 4786.522,
    "text": "And then we'll have a third and a fourth round table before the year ends.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4788.663,
    "end": 4795.185,
    "text": "Well, we can be on this closing slide, which is just anyone is, we can open it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4795.305,
    "end": 4797.006,
    "text": "I see Dean and then everyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4797.426,
    "end": 4799.386,
    "text": "Feel welcome to raise your hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4800.587,
    "end": 4801.527,
    "text": "Dean, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.134,
    "end": 4804.294,
    "text": " Just a quick question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.955,
    "end": 4824.539,
    "text": "I noticed that the terms of whatever they call it on YouTube changed and now when I've gone back to some of the active inference live streams, before there was no advertisements and now I have to click through two advertisements, for example, to actually access the live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4826.907,
    "end": 4833.951,
    "text": " Would we get somebody to look at the AdSense piece and start, if it's a nonprofit, start collecting some money for people?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4833.971,
    "end": 4839.153,
    "text": "Because the advertisements have been actually front-end loaded on some of those live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4839.653,
    "end": 4844.755,
    "text": "We probably weren't aware of it because it's just happened in the last, I think, 10 or 12 days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4846.216,
    "end": 4846.496,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4846.976,
    "end": 4847.737,
    "text": "I'll give a thought on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.777,
    "end": 4847.977,
    "text": "Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4849.81,
    "end": 4850.951,
    "text": " Yeah, just to respond to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4851.031,
    "end": 4857.674,
    "text": "So, like, we as the Active Inference Lab, like, can't... We can't pay to remove the ads.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4857.934,
    "end": 4862.076,
    "text": "It's a user end payment, which I... That's my understanding of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4862.297,
    "end": 4863.917,
    "text": "So, just a quick update.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4864.438,
    "end": 4864.658,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.958,
    "end": 4868.86,
    "text": "I think there is a way to, like, have a channel under monetized or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.9,
    "end": 4872.182,
    "text": "I'm not sure if it removes all the ads, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.092,
    "end": 4873.372,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4874.173,
    "end": 4875.634,
    "text": "That's what changed, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4875.814,
    "end": 4878.255,
    "text": "So even if you're... That's exactly what changed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4878.515,
    "end": 4889.722,
    "text": "There used to be, like, you could pay as a producer so that no one had to view ads, but they flipped it so that now you have to buy the YouTube premium because they figured they would make more money that way, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4890.563,
    "end": 4890.683,
    "text": "Ah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4891.644,
    "end": 4893.124,
    "text": "Yeah, I just searched ads.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.305,
    "end": 4901.59,
    "text": "Maybe we can confer with the YouTube terms of service or whatever, but if it just recently changed, then that totally could be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4902.998,
    "end": 4904.819,
    "text": " And okay, good to keep in mind, Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4905.819,
    "end": 4922.166,
    "text": "And that also can be where having a nonprofit status can help because they will, if they see you have those values and you are registered, then they often can give you either a free or much reduced access to some of those services.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.738,
    "end": 4946.126,
    "text": " i just looked at the uh youtube monetization and it says as a youtube partner you'll be able to earn money from your videos etc etc and it requires 1 000 subscribers and a 4 000 watch hours we're not at either of those so we have no uh levers maybe when the channel is eligible it can be done or not but um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4947.128,
    "end": 4973.317,
    "text": " we'll figure it out and of course have a spirit of cognitive security and attentional regime engineering and not having ads when we don't need them to be there and eventually working on avenues to self-sufficiency in a way where we won't be at the behest of any other platform but we could have some more subscribers that'd be cool dean and then anyone else yeah i just think it's interesting because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4974.332,
    "end": 4983.935,
    "text": " I don't think search engine optimization is active inference, but what would happen if we got to those minimum numbers in those thresholds, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4985.936,
    "end": 4986.116,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4986.696,
    "end": 5000.641,
    "text": "Well, there's a lot on our channel and it'd be awesome to reach out to more people and let the search engines make of it what they may because we'll be optimizing for something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5002.642,
    "end": 5019.565,
    "text": " So this closing slide is just, again, people can raise their hand if they wanna add anything, just what we'd like to learn more about and how we wanna apply questions that every expert in the field will tell you that they are curious about as well and beginners too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.365,
    "end": 5028.947,
    "text": "And then the questions that we ask usually in a more paper discussion context, what does a good understanding of our lab enable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5029.87,
    "end": 5036.757,
    "text": " Since we're discovering what kind of lab we are and creating what kind of lab we are, what would it mean if we understood that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5037.657,
    "end": 5041.301,
    "text": "What would be the predictions and implications of different understandings?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5041.361,
    "end": 5043.383,
    "text": "What do we know now that we didn't know two hours ago?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5044.664,
    "end": 5051.13,
    "text": "What are some next steps for free energy principle and active inference, the ideas or the community?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.071,
    "end": 5081.593,
    "text": " tools too and then what are the goals of our research and of our system of interest which is the lab as organizers and then the participants as the lab so cool stuff and um thanks everyone for participating we hope that you stick around share the information with anyone else and um yeah if there's no other comments we'll end it there awesome",
    "speaker": "SPEAKER_01"
  }
]