[
  {
    "start": 28.851,
    "end": 30.753,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.093,
    "end": 34.416,
    "text": "This is Act-Inf live stream number 49.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.317,
    "end": 38.239,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.1,
    "end": 45.365,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.681,
    "end": 52.287,
    "text": " This is a recorded and an archived livestream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.308,
    "end": 58.434,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.936,
    "end": 68.045,
    "text": "Head over to ActiveInference.org to learn more about the Institute and how to get involved in projects such as the livestreams and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.682,
    "end": 97.297,
    "text": " okay we are here in live stream number 49.1 we are having our second discussion on the paper a worked example of the bayesian mechanics of classical objects in number 49.0 along with yakup and ali we did some background and context and now the gloves come off the curtain comes up and we'll begin slash continue our discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.617,
    "end": 120.536,
    "text": " and we're really appreciative Dalton that you've joined today looking forward to how these discussions go so we can begin just by saying hello and anything that we want to explore or discuss today and then we'll just jump right into it so I'm Daniel I'm a researcher in California and I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.179,
    "end": 149.103,
    "text": " think some of the questions that are really motivating me today is what is mechanical about Bayesian mechanics and how do we take concepts that have physical interpretations like center of gravity or even some of these more atomic level terms that were brought into play how do we apply those kinds of terms and ideas to cognitive science and I'll pass to Ali",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.355,
    "end": 154.057,
    "text": " Hello, I'm Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.238,
    "end": 163.671,
    "text": "I'm an independent researcher from Iran, and I can't find enough words to express how excited I am to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.953,
    "end": 169.158,
    "text": "Actually, we talk a lot about Dalton's work and how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.363,
    "end": 171.543,
    "text": " groundbreaking it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.203,
    "end": 178.785,
    "text": "And personally, I had immersed myself for the past several months in Dalton's paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.045,
    "end": 185.766,
    "text": "And for the past couple of months, we had fascinating discussions around this particular paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.266,
    "end": 189.007,
    "text": "So I'm feeling kind of starstruck right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.767,
    "end": 193.288,
    "text": "And I'm very much looking forward to our discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.708,
    "end": 194.968,
    "text": "And I'll pass it to Jakob.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.637,
    "end": 198.882,
    "text": " Hello, I'm Jakob.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 199.063,
    "end": 201.332,
    "text": "I'm a student in the UK and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 203.982,
    "end": 227.539,
    "text": " I suppose I'm also very excited to be here today and to discuss the different implications of Bayesian mechanics and how it's related to other areas in contemporary physics and how that can then be applied to cognitive sciences and neuroscience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 230.925,
    "end": 231.185,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.545,
    "end": 232.625,
    "text": "So welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.765,
    "end": 233.566,
    "text": "Thanks again, Dalton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.606,
    "end": 238.147,
    "text": "Feel free to just begin where you'd like and bring us to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.447,
    "end": 240.407,
    "text": "Of course, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 241.167,
    "end": 250.329,
    "text": "I guess I'll also introduce myself, just in case there are people in the audience that don't recognize me or have a face to a name.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 251.449,
    "end": 252.129,
    "text": "I'm Dalton.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 253.21,
    "end": 254.57,
    "text": "I'm a researcher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 254.61,
    "end": 259.851,
    "text": "I'm based at Stony Brook University in New York, where I spend most of my time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 260.293,
    "end": 263.534,
    "text": " in the Department of Mathematics and the Department of Physics and Astronomy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 264.295,
    "end": 272.098,
    "text": "I'm also at the Versys Lab, where I'm the mathematics and the physics of the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 273.778,
    "end": 276.74,
    "text": "So it's a pleasure to meet all three of you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 277.84,
    "end": 279.481,
    "text": "And thank you, of course, for the kind words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.082,
    "end": 284.563,
    "text": "I think we can maybe begin with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.123,
    "end": 287.588,
    "text": " very broad overview of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 287.608,
    "end": 288.651,
    "text": "I will say, so one of my...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 292.304,
    "end": 312.353,
    "text": " One of the aims of my research program is to get a better understanding of the mathematics of random dynamical systems, especially coupled random dynamical systems or systems that model non-equilibria phenomena.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 313.293,
    "end": 315.915,
    "text": "And one of the interesting things to me",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 317.176,
    "end": 337.487,
    "text": " is the idea that within cognitive science or neuroscience, there are some algorithms that have been developed over time that have been built specifically to cope with these kinds of problems, which are problems that we don't know really how to make sense of mathematically, even physically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 339.048,
    "end": 341.049,
    "text": "We're on the back foot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 343.991,
    "end": 354.395,
    "text": " But in neuroscience, the primary object of study is a non-equilibrium system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 354.535,
    "end": 359.477,
    "text": "It is non-equilibria and understanding non-equilibrium phenomena in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 360.698,
    "end": 368.741,
    "text": "And so one supposes that the methods that have been developed over time in this area, just maybe by trial and error,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.681,
    "end": 388.749,
    "text": " or at least trial and error by the standards of perhaps a pure mathematician, may have some insights into maths and physics in the same way that there's a very rich history of physics inspiring more advanced mathematics and then mathematics circling back and making physics more rigorous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 389.189,
    "end": 393.231,
    "text": "I think there's a great opportunity to do that in biophysical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 393.991,
    "end": 399.636,
    "text": " And I think the free energy principle is a source of great inspiration along those lines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 400.928,
    "end": 421.758,
    "text": " So with that meta commentary out of the way, one of the things that I wanted to do with this paper is to actually drill down on that point, because I think it's something that maybe gets lost in translation if you just read kind of traditional active inference papers that are all about modeling cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 422.638,
    "end": 425.64,
    "text": "I think there's something on the other side of the aisle to be said about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 426.761,
    "end": 432.647,
    "text": " what do those models of cognition say about modeling systems that are cognitive?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 432.908,
    "end": 437.873,
    "text": "Or what does it say about complex systems that are cognitive-like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 438.493,
    "end": 441.216,
    "text": "And how can we make sense of those things mathematically?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.077,
    "end": 446.578,
    "text": " So that's in some sense the motivation for Bayesian mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 446.638,
    "end": 450.159,
    "text": "And that goes back to... Well, it goes back a long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 450.759,
    "end": 453.399,
    "text": "It goes back to probably Carl himself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 453.6,
    "end": 459.301,
    "text": "He mentions something like this at a couple of points in the 2019 monograph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 459.981,
    "end": 464.202,
    "text": "But it was worth writing a paper specifically with the motivation that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 465.876,
    "end": 479.188,
    "text": " If we consider what's been written about the free energy principle so far, there's a very nice foundation for better understanding the mathematics and physics of coupled or non-equilibrium stochastic processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 479.708,
    "end": 482.411,
    "text": "And so that was the motivation for this particular paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 483.211,
    "end": 497.942,
    "text": " And in addition to building out the fundamental mathematics in the first few sections, it's then possible to contextualize all that work with a kind of nice worked example of what does this mean for some kind of simple systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.442,
    "end": 502.825,
    "text": "How can we actually take this foundational maths and make it algorithmic again?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 504.106,
    "end": 507.809,
    "text": "And then foreshadowing maybe even greater complexity in the very last section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 510.417,
    "end": 522.004,
    "text": " So, yes, a lot of this goes back to a paper that I co-authored with a number of other people earlier in the summer called On Bayesian Mechanics, where it's proposed that, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 523.206,
    "end": 534.577,
    "text": " complex systems have a kind of informational physics about them, and that maybe the material physics or the maths for these systems is quite challenging in general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 535.178,
    "end": 543.085,
    "text": "But maybe if you map these systems into the informational world, you can utilize new techniques and make sense of these kinds of systems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 544.927,
    "end": 547.748,
    "text": " by approaching it from a different kind of viewpoint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 548.348,
    "end": 562.953,
    "text": "That is, I think, the strength of Bayesian mechanics, as, again, Carl and others have construed it, is it is a way of talking about informational physics or the physics of Bayesian beliefs, the laws of motion on a statistical manifold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 563.373,
    "end": 566.794,
    "text": "There's various ways of kind of couching that in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 567.654,
    "end": 568.514,
    "text": " more formal language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 569.075,
    "end": 571.096,
    "text": "But again, that was the motivation for the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.116,
    "end": 580.019,
    "text": "And then as that gets developed, eventually there's a point where we really get into the trenches and actually try and deploy this in some useful way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 580.7,
    "end": 585.162,
    "text": "I think that those are really the kind of two aims that come together in some sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.864,
    "end": 591.865,
    "text": "Thank you for the summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.066,
    "end": 597.35,
    "text": " Well, there's many ways to begin and start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.871,
    "end": 604.358,
    "text": "Perhaps we could start with the context that we brought, which was thinking about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.398,
    "end": 609.643,
    "text": "And you touched on some of these threads as well, such as the key literature and some of the history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.612,
    "end": 629.29,
    "text": " Let's continue on in this context setting before we get to the formalisms and the worked examples and talk about the three kinds of theories, including what you mean by a theory, and then the three non-Bayesian mechanics, and that'll set us up really well to see where Bayesian mechanics comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.211,
    "end": 647.22,
    "text": " so this was in that paper just mentioned on bayesian mechanics of physics of and by beliefs so what are dynamics mechanics and principles and how were you using theory and why was it so important to be clear about what a theory was and the distinctions amongst these three terms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.493,
    "end": 648.933,
    "text": " Yeah, of course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 649.614,
    "end": 661.482,
    "text": "So in that paper, there is this kind of trichotomy that gets introduced where we talk both about dynamics and mechanics and principles and disentangle them in a very particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 662.402,
    "end": 666.285,
    "text": "So we think about dynamics as a kind of observational thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 667.446,
    "end": 672.669,
    "text": "And it's important to separate that from mechanics because complex systems...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 673.67,
    "end": 676.452,
    "text": " as a science, is very interested in dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 676.832,
    "end": 691.701,
    "text": "Can I kind of infer the laws of these kinds of systems just by modeling them using some kind of curve fitting or using some kind of set of canonical models that I know sort of fits this situation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 693.002,
    "end": 702.207,
    "text": "But at the end of the day, yes, dynamics are mostly about the particular trajectories that a system takes through state space or physical space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.428,
    "end": 713.637,
    "text": " And this is conflated sometimes with what I call mechanics in that paper, which is something a little bit different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 713.877,
    "end": 718.1,
    "text": "It is the laws from which these trajectories are determined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 718.841,
    "end": 725.426,
    "text": "So, for instance, dynamical systems people, especially in pure maths, really like the example of billiards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 726.327,
    "end": 753.65,
    "text": " So you send one billiard ball crashing into another one and you could talk about the trajectory that the ball takes and you could write down the equations of motion for this system and just add up all the forces acting on it and figure out what direction is this ball that got collided with, what direction is that going to go into, with what momentum and all of these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 754.13,
    "end": 754.43,
    "text": "But then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 755.706,
    "end": 774.695,
    "text": " Figuring out that trajectory, once you plug in all of these kind of boundary conditions, the mass of the ball, the angle of the initial contact, and so forth, the way that you can kind of compose all that information together, that needs to come from somewhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 775.255,
    "end": 778.556,
    "text": "And that's what we call, or what I call, a mechanical principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 778.736,
    "end": 779.177,
    "text": "And this is not...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 780.197,
    "end": 782.738,
    "text": " a distinction that is new to the literature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 782.758,
    "end": 797.723,
    "text": "I'm not breaking new ground here, but I think it is one of those things that's not made sufficiently clear in the FEP literature, or at least in the places where it's adjacent to physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.263,
    "end": 801.024,
    "text": " So mechanics are about the laws that give you those trajectories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 801.384,
    "end": 808.627,
    "text": "So we know that the forces acting on one or another billiard ball sum together because of Newton's law of motion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 808.987,
    "end": 810.148,
    "text": "That's a mechanical theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 810.568,
    "end": 817.61,
    "text": "If I have F, then I get M times A. And I can plug in F, and I can plug in A, and I can get a trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 818.231,
    "end": 825.874,
    "text": "But if I abstract away from those particulars, I get some kind of law that tells me, OK, how are trajectories generated in the physical world?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 827.214,
    "end": 840.408,
    "text": " um abstracting one more step we can then ask okay so where do mechanical theories come from what tells me that i have the right mechanical theory generating the right dynamics and this is about um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 841.485,
    "end": 847.752,
    "text": " the kinds of very fundamental laws that we know hold everywhere in the universe at a given scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 848.352,
    "end": 858.043,
    "text": "These are principles like conservation of energy, and this gives you the behavior of collisions or the principle of stationary action, which actually gives you back Newton's law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 858.463,
    "end": 863.048,
    "text": "So you can now chain these things together and say one ball hits the other one,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 863.689,
    "end": 870.932,
    "text": " It goes in this direction because if you sum the forces and you add up all the directions, you get a net movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 871.413,
    "end": 878.376,
    "text": "And you can do that because these billiard balls minimize or at least make stationary their action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 878.776,
    "end": 882.258,
    "text": "So their motion must follow this particular mechanical law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 882.638,
    "end": 884.399,
    "text": "And that's the law that generates these trajectories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 885.299,
    "end": 894.904,
    "text": " So the reason why this is mentioned in the Bayesian mechanics paper is because these have, I think, been conflated in the literature previously, because you have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 896.604,
    "end": 900.306,
    "text": " the idea of the free energy principle, which is a principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 900.506,
    "end": 908.969,
    "text": "It's a thing that gives you back some kind of generative rule for the dynamics of specific systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 909.81,
    "end": 923.896,
    "text": "And that is usually something to do with the motion of internal states on a statistical manifold in the sense of, for instance, Thomas Parr, Lance de Carsten, and Carl Friston's article, Stochastic Thermodynamics, Markov Blankets, and Information Geometry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 924.861,
    "end": 925.883,
    "text": " I think that's the title anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 926.664,
    "end": 937.061,
    "text": "So if you say, okay, the dynamics of a system whose parameter performs approximate Bayesian inference minimizes the surprisal,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 938.208,
    "end": 944.631,
    "text": " then you get approximate Bayesian inference as a law of motion for the dynamics of some object.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 944.991,
    "end": 952.014,
    "text": "And this law is usually written as a particular gradient flow relation on the space of beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 952.494,
    "end": 956.016,
    "text": "So it tells you how do beliefs change as those parameters doing the inference change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 956.696,
    "end": 963.466,
    "text": " And then if you add in progressively more details, okay, what do those internal states actually mean in the context of the system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 964.347,
    "end": 965.609,
    "text": "What are those beliefs about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 966.049,
    "end": 971.877,
    "text": "These are the kind of boundary conditions that give you the trajectories, the specific dynamics of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 972.318,
    "end": 984.806,
    "text": " And there's an interesting sense in which these boundary conditions are literal boundary conditions because understanding what's internal and what's external and being inferred is precisely the specification of a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 985.166,
    "end": 998.455,
    "text": "So as soon as you actually give the system a very particular partition, as soon as you carve it up in a specific way, you start to get a sense of the actual evolution of a system as one might see it in the real world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 998.895,
    "end": 1000.056,
    "text": "But this is, I think...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1000.996,
    "end": 1028.025,
    "text": " um separating things out in a formal sense like this is useful because it avoids skipping from step one which is minimize variation of free energy or surprisal and i'm going straight away to this is how um something like an active inference system uh does prediction and action you know there's there are some steps in the middle that haven't really been filled out if you just go from a to b directly and when you when you begin to talk about the maths and the physics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1030.066,
    "end": 1037.933,
    "text": " collapsing things together like that starts to throw away some important details that actually do make a difference in the way that you tell the story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1041.596,
    "end": 1041.916,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.617,
    "end": 1045.659,
    "text": "Ali or Jakob, anything you want to add in or ask there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.323,
    "end": 1050.904,
    "text": "Yeah, Jakob.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1053.243,
    "end": 1059.847,
    "text": " Yeah, I would maybe ask regarding the kind of laws of motion of Bayesian mechanics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1059.887,
    "end": 1062.168,
    "text": "You mentioned approximate Bayesian inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1063.949,
    "end": 1076.516,
    "text": "Would that imply that the three phases of Bayesian mechanics, the mode matching, mode tracking, and path tracking, would you say those are also specific laws of motion within Bayesian mechanics?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1078.057,
    "end": 1079.337,
    "text": "You could say that, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.778,
    "end": 1079.998,
    "text": "I think...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1081.523,
    "end": 1084.545,
    "text": " At this point, the distinction gets very fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1085.125,
    "end": 1088.587,
    "text": "And so there is a place to usefully truncate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1088.607,
    "end": 1092.208,
    "text": "But yeah, these are three different kinds of approximate Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1093.089,
    "end": 1100.212,
    "text": "And so they are three different kinds of motion under free energy principle minimization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1102.053,
    "end": 1105.997,
    "text": " And so this is kind of, I guess, a middle area between dynamics and mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1106.037,
    "end": 1114.965,
    "text": "You've started to specify some things like, am I doing approximate Bayesian inference over states or am I doing it over paths?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1115.746,
    "end": 1120.129,
    "text": "But you're still lacking actual dynamical details about what do those states of paths mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1122.151,
    "end": 1136.775,
    "text": " So this is maybe a middle area that blends the idea of approximate Bayesian inference as a law of motion under surprise minimization and actually getting down to the very bottom of this pyramid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1137.535,
    "end": 1143.017,
    "text": "So if I were to put it somewhere into this figure, I'd maybe slot it in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1144.417,
    "end": 1149.619,
    "text": "Yeah, that's pretty much what I'm imagining is you have approximate Bayesian inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1150.379,
    "end": 1161.625,
    "text": " sort of roughly up here, and then there are different expressions of that, just as there are different expressions of Newton's laws, depending on if you're in fluids or rigid bodies or celestial mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.706,
    "end": 1165.648,
    "text": "So you can introduce even finer partitions than these three.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1169.35,
    "end": 1170.651,
    "text": "There's many places to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.168,
    "end": 1176.131,
    "text": " One question is, what are these modes about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.171,
    "end": 1180.613,
    "text": "Who or what is tracking what and when?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.314,
    "end": 1185.096,
    "text": "Yeah, so this is kind of about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1186.724,
    "end": 1195.114,
    "text": " The idea being approximate Bayesian inference tells you that systems match their parameters in such a way that they perform inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1195.154,
    "end": 1204.745,
    "text": "So when we think about Bayesian inference, we can talk about it as simply inferring the parameters of a probability density.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.063,
    "end": 1221.291,
    "text": " So in the free energy principle, when you get approximate Bayesian inference saying, OK, systems that are coupled synchronize certain parameters, this is Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.792,
    "end": 1239.328,
    "text": " And conversely, if you have that synchronization, you have Bayesian inference, or you have approximate Bayesian inference if you're inferring the parameters of an approximate density, which is where you get into the factorization of the free energy functional that we are familiar with, where you have...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1240.569,
    "end": 1253.877,
    "text": " a variational density matched to a joint density, but you can split it into the variational density matched to a conditional density plus an extra surprisal term that kind of measures how good that approximation is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1256.278,
    "end": 1272.575,
    "text": " So this descends from that idea that you can deduce what a system is doing just by saying, okay, it's performing approximate Bayesian inference, because that allows you to say its parameters are synchronizing to the parameters of the environment or of another system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1274.487,
    "end": 1277.369,
    "text": " So that's what we mean when we say modes in this case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1277.769,
    "end": 1281.872,
    "text": "A mode is just a parameter of the distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1282.332,
    "end": 1290.197,
    "text": "And it comes from some of Carl's earlier literature where he uses the Laplace approximation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1290.818,
    "end": 1299.324,
    "text": "So specifically, we're kind of fitting a Gaussian density to some arbitrary probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.964,
    "end": 1307.372,
    "text": " And then the mode of that Gaussian is one of the parameters because it tells you, OK, where is the center of that density?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1307.833,
    "end": 1316.942,
    "text": "And if you also get a sense of where the variance of that density is now suddenly by fitting those two parameters, you can talk about the system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1317.603,
    "end": 1323.568,
    "text": " Because now you can say, okay, the physical parameters of the system are encoding these parameters of some density.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.288,
    "end": 1334.396,
    "text": "And in a very natural way, this gets you back much of statistical physics, because it's all about how does a system reflect the statistics of another system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1335.697,
    "end": 1337.618,
    "text": " probabilistically, how does this look?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1338.618,
    "end": 1349.66,
    "text": "But this is kind of upgraded in Bayesian mechanics to noting that, well, that inference happens because the physical parameters of the system are matching the physical parameters of the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1350.24,
    "end": 1352.361,
    "text": "And that's where the probabilities come from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1352.421,
    "end": 1353.801,
    "text": "That's why we talk about beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.862,
    "end": 1361.143,
    "text": "So when we say modes, we're referring to parameters that are fit for synchronization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1365.566,
    "end": 1366.227,
    "text": " Excellent, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.347,
    "end": 1366.667,
    "text": "Jakob?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.59,
    "end": 1383.563,
    "text": "Since we have the schema on the slide there, I just wanted to ask, where do you think that the g-theory formulation fits into this diagram?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1383.583,
    "end": 1389.028,
    "text": "Because with g-theory, there is approximate Bayesian inference, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1390.749,
    "end": 1392.57,
    "text": " It's not necessarily density over state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1393.13,
    "end": 1398.453,
    "text": "So is it another node directly from the Bayesian mechanics?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1399.474,
    "end": 1399.714,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1400.094,
    "end": 1408.239,
    "text": "So in this figure, the approximate Bayesian inference lemma is a very specific thing that originally goes back to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1409.164,
    "end": 1416.667,
    "text": " I believe originally it's in a 2012 paper by Carl in Entropy called The Free Energy Principle for Biological Systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1417.187,
    "end": 1423.709,
    "text": "But certainly a much bigger deal is made in the 2019 monograph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1424.15,
    "end": 1430.052,
    "text": "And it's the approximate Bayesian inference lemma, as he calls it, is specifically about mode matching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1430.892,
    "end": 1455.075,
    "text": " approximate Bayesian inference is a bit more general so if you were to kind of slot that in somewhere in here it would maybe be parallel to Bayesian mechanics because just like classical mechanics the law of motion is Newton's laws for Bayesian mechanics the law of motion the thing that generates specific physical dynamics is approximate Bayesian inference or the law that when you do a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1456.016,
    "end": 1465.418,
    "text": " have synchronized systems, you can write it as variational free energy minimization in virtue of the parameters of the two systems matching up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1466.178,
    "end": 1471.36,
    "text": "And that's the parameter that minimizes the distance between a held density and an observed density.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1471.98,
    "end": 1476.481,
    "text": "So approximate Bayesian inference lemma is that result specifically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1477.401,
    "end": 1478.782,
    "text": "But that's more general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1479.362,
    "end": 1483.803,
    "text": "The idea of approximate Bayesian inference is more general and probably",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1485.518,
    "end": 1493.643,
    "text": " someone needs to write down a generalization of the approximate Bayesian inference lemma to paths specifically to talk about path tracking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1494.343,
    "end": 1511.113,
    "text": "But once you have a path that fits the bill as a mode, and once you have two systems evolving together, tracking each other's modes or each other's paths, and if you have a probability density over those paths, you can now talk about approximate Bayesian inference in the path setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1511.753,
    "end": 1524.402,
    "text": " Now, where that has to do with g-theory, so g-theory, the name and kind of the vision is actually due to Maxwell Ramstad, a colleague of mine, also here in the Versys lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1525.562,
    "end": 1527.444,
    "text": "And he has suggested that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1529.76,
    "end": 1538.411,
    "text": " G-theory kind of lies in the intersection between a few different things that fall out of the path-based formalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.812,
    "end": 1545.26,
    "text": "So if you have approximate Bayesian inference over paths, if you're doing path tracking,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1546.441,
    "end": 1551.985,
    "text": " then there are lots of things that do come out of this, almost canonically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.926,
    "end": 1559.97,
    "text": "One of them is everything that comes along with path integral formulations in quantum mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.551,
    "end": 1564.213,
    "text": "And this is, I take advantage of this at various points in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1564.513,
    "end": 1570.858,
    "text": "At one point, I use it to explain, okay, why does Bayesian mechanics actually make sense in the classical world?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1571.518,
    "end": 1575.16,
    "text": "And then later on, I use it to relate it to chaos.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1576.425,
    "end": 1578.347,
    "text": " So that's a specific example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.427,
    "end": 1591.059,
    "text": "I think more generally, path tracking deals with non-stationary systems very well, because you're allowed to talk about now how does the density, how does the belief change in time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1591.519,
    "end": 1596.123,
    "text": "How does the mode of a single belief change over time to make a kind of modal path?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1596.944,
    "end": 1597.805,
    "text": " And what are the marginals?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.865,
    "end": 1601.208,
    "text": "If you slice up the density along that path, what do you get?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1601.228,
    "end": 1603.65,
    "text": "So you can talk about non-stationary systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1604.691,
    "end": 1608.195,
    "text": "You can talk about systems out of equilibrium this way because you can relate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1610.171,
    "end": 1623.666,
    "text": " the free energy principle over paths to what's called the principle of maximum caliber in statistical physics, which is all about non-equilibria and entry production and non-equilibrium steady states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1624.707,
    "end": 1625.768,
    "text": "So I think...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1628.098,
    "end": 1642.597,
    "text": " As we have written about it, g-theory is the duality between path integrals and the FEP over paths, or the duality between maximum caliber and the FEP over paths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.518,
    "end": 1644.039,
    "text": "But it's...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1645.475,
    "end": 1652.141,
    "text": " I think that's selling it short a little bit because it's also the thing that brings in all these other ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1653.201,
    "end": 1656.104,
    "text": "And stochastic thermodynamics is a really interesting one as well, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.224,
    "end": 1658.766,
    "text": "Also falls out of the path-based formulas very well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.226,
    "end": 1661.608,
    "text": "Also does very well with non-equilibria.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1663.67,
    "end": 1682.462,
    "text": " So g-theory is kind of this larger object that makes sense of why that column of Bayesian mechanics actually works and explains a little of the true power of the path tracking as opposed to mode tracking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1682.742,
    "end": 1685.284,
    "text": "Why are we interested in forgetting about states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1686.724,
    "end": 1699.791,
    "text": " And that's the explanation for that, or the justification for that resides in g-theory, which is supposed to explain why do all of these things just come out of the path-based formalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1700.592,
    "end": 1701.572,
    "text": "Why does it make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1702.673,
    "end": 1710.577,
    "text": "And why does the FEP over paths lie at the center of a lot of disparate fields, which I think is one of the real problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1711.357,
    "end": 1734.567,
    "text": " very powerful statements that may be possible in the near future is, is the FEP actually canonically the theory of everything in the sense that there are lots of approaches in statistical physics and stochastic process theory that trace back to the FEP or the FEP subsumes or implies or something like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1735.307,
    "end": 1736.448,
    "text": "G-theory is supposed to kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1737.228,
    "end": 1743.2,
    "text": " plug into that last column, but that is somewhat outside of the hierarchy in that sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1745.945,
    "end": 1746.326,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.646,
    "end": 1747.408,
    "text": "Thank you, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.74,
    "end": 1774.781,
    "text": " Well, yeah, when I was reading about geo-theory, I thought it somehow relates to Ralph Landor's principle, which basically says that if an observer loses information about a system, the corresponding entropy in a non-information-bearing process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1775.58,
    "end": 1781.742,
    "text": " degrees of freedom of the information processing system or its environment is increased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.003,
    "end": 1789.525,
    "text": "Because Landar believed that information is physical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.665,
    "end": 1795.787,
    "text": "So he somehow put it in terms of a kind of thermodynamical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.711,
    "end": 1813.304,
    "text": " point of view, but how does it fit or can g-theory be viewed through the lens of Landar's principle, which I think is not a completely non-controversial principle as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1814.622,
    "end": 1816.282,
    "text": " Yeah, that's an interesting question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1816.462,
    "end": 1824.164,
    "text": "I think insofar as it does give you some technology to talk about entropy production at non-equilibrium steady state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1824.865,
    "end": 1834.707,
    "text": "So it does give you a way of saying, okay, if I'm exchanging with my environment, if information is flowing out and flowing back in, then there is some increase in the entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1835.727,
    "end": 1842.249,
    "text": "And with respect to things like control theory, this is pretty interesting because it allows you to talk about, okay, if the system is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1843.469,
    "end": 1860.125,
    "text": " observing something about its environment, if it's constantly maintaining a steady state, so engaging in control, then you can talk about that entropically, and you can talk about the irreversibility of processes, even at steady state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1861.206,
    "end": 1866.111,
    "text": "And there are things that connect to that, like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1867.648,
    "end": 1873.835,
    "text": " the Crookes fluctuation theorem or Yasinski equality and things of that nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.017,
    "end": 1883.506,
    "text": "So my guess would be it probably covers something like Landauer's principle in that context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1884.487,
    "end": 1894.651,
    "text": " Talking about the energy required to erase a bit of information, say, is ultimately the energy required to insulate yourself from the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1895.171,
    "end": 1898.212,
    "text": "That minimizes your surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1898.232,
    "end": 1900.853,
    "text": "It means the environment does not offer information to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1901.333,
    "end": 1904.154,
    "text": "But that does take energy and sometimes quite a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1905.635,
    "end": 1918.193,
    "text": " So that's probably where that connects to Landau's principle, is talking about and quantifying the kind of cost of maintaining a Markov blanket in probably entropic terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1921.172,
    "end": 1921.452,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.913,
    "end": 1932.068,
    "text": "I think this points towards somewhere we may explore over this multi-scale engagement, which is unconventional computing and low energy computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.669,
    "end": 1937.035,
    "text": "For example, the often remarked upon energy expenditure of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.856,
    "end": 1960.19,
    "text": " compared to, say, a neural network operating on traditional computational architectures using many, many light bulbs, many, many calories of energy versus a brain which is able to carry out some tasks with seemingly low energy expenditure while other tasks it does not seem to be able to perform at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.131,
    "end": 1962.352,
    "text": "I want to pull back",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.274,
    "end": 1970.342,
    "text": " before we go into the three non-Bayesian mechanics and ask, what is Bayesian?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.323,
    "end": 1974.226,
    "text": "What does it mean for something to be Bayesian?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.547,
    "end": 1977.589,
    "text": "Yeah, in my mind,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1980.054,
    "end": 1982.677,
    "text": " Bayesian is about inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.837,
    "end": 1993.826,
    "text": "It's about a particular method of doing inference that gives you consistent unbiased results and fits in very nicely with the rest of probability theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.147,
    "end": 2009.642,
    "text": " In the context of Bayesian mechanics, it is the idea that the physics of material systems, or the material physics of complex systems, maps into a physics of beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2009.902,
    "end": 2010.983,
    "text": "So you can talk about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2011.744,
    "end": 2017.187,
    "text": " the parameters that are doing approximate Bayesian inference, or you can talk about approximate Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2017.207,
    "end": 2022.649,
    "text": "You can talk about, okay, what are the beliefs parameterized by that mode doing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.129,
    "end": 2026.091,
    "text": "And how does that reflect something about the dynamics of the system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2027.843,
    "end": 2051.998,
    "text": " The reason why this is interesting is not just because it's a different approach to the problem and dealing with interacting systems and systems out of equilibrium is an area that does need new approaches because it is a very poorly understood area within mathematics and physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2053.619,
    "end": 2054.079,
    "text": "It still is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2054.119,
    "end": 2056.281,
    "text": "It has been for some time, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2058.298,
    "end": 2065.202,
    "text": " But it's also interesting because complex systems are informational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2065.642,
    "end": 2070.165,
    "text": "So there's some sense in which this brings us closer to the metal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2071.105,
    "end": 2072.826,
    "text": "So it's not just a new view.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2073.066,
    "end": 2079.93,
    "text": "It is the right new view because complex systems are systems that compute and capture data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2080.73,
    "end": 2082.111,
    "text": "They are systems that have memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.732,
    "end": 2097.124,
    "text": " So it's not as simple as even here's a new way of writing down the dynamics of random or stochastic processes based on the parameterization of some action functional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2097.464,
    "end": 2100.967,
    "text": "That's valuable because that's a new thing, but it's also...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2102.248,
    "end": 2111.514,
    "text": " It fits very nicely into our understanding of complex systems as things that have an informational physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2112.115,
    "end": 2118.699,
    "text": "Understanding the dynamics of things like the brain is contingent upon understanding what the brain is doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.82,
    "end": 2125.183,
    "text": "And the brain is capturing and computing over data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.604,
    "end": 2126.704,
    "text": "It is storing memories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.785,
    "end": 2130.027,
    "text": "It is learning and sensing and inferring.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.425,
    "end": 2143.688,
    "text": " it's not just that it's a new view, it's really the right view because it gets to the idea that complex systems do things physically because they are doing something in informational space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2144.728,
    "end": 2146.449,
    "text": "And the brain is a wonderful example of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.149,
    "end": 2149.229,
    "text": "The brain is a coupled random dynamical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.269,
    "end": 2150.47,
    "text": "It's coupled to its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2150.89,
    "end": 2159.872,
    "text": "So you can talk about this parameterization thing, this synchronization thing, but it's even more insightful than just that because the brain is doing things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2160.552,
    "end": 2161.594,
    "text": " approximate Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2162.155,
    "end": 2171.99,
    "text": "So I suppose it's no coincidence that the synchronization of coupled random dynamical systems gets you back this idea because I think that is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2173.473,
    "end": 2192.763,
    "text": " empirically just based on observations, I think that is as close to a physical law as one might be able to get at this stage in complex systems theory, is that things that synchronize do perform approximate Bayesian inference, because things that synchronize are things that are controlled systems or computational systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2194.765,
    "end": 2196.706,
    "text": "So in that sense, I think it's right on the mark.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.866,
    "end": 2204.133,
    "text": " And as I said, it's interesting that this goes way back to trying to figure out things about the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.773,
    "end": 2221.307,
    "text": " It goes way back to Carl Friston's original work on generalized filtering and SPM and these kinds of algorithms that were designed to make sense of what is the brain doing physically based on what we think it's doing inferentially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2221.327,
    "end": 2229.433,
    "text": "The relationship between structural and functional connectivity and the relationship between neural representations and neural firing patterns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.174,
    "end": 2238.124,
    "text": " But it has become something massively more general because it is the right kind of maths to talk about these sorts of systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.705,
    "end": 2244.592,
    "text": "And that's in turn because these sorts of systems do this kind of approximate Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.793,
    "end": 2249.255,
    "text": " So when you ask, yeah, what is Bayesian about Bayesian mechanics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2249.855,
    "end": 2267.303,
    "text": "It is about the relationship between Bayesian beliefs and Bayesian inference and physical parameters representing something about the information available to that system or the statistics of a system coupled to that system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2270.669,
    "end": 2270.969,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.349,
    "end": 2275.87,
    "text": "Just a few notes before we then go into the non-Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.63,
    "end": 2296.374,
    "text": "One is from ecological psychology, where many of our terms are drawn from, such as affordances, people have long pointed to the way that we use language like, can you grasp it, optimal grasp of ideas, and so tangible and peripersonal spatial ways of talking about ideas and cognitive processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.134,
    "end": 2322.014,
    "text": " and then well what is the first thing you want to know after you get optimal grasp how much does it weigh and you said it has become massively more general well is that in grams or in what so i see this as part of the development of the physicality of cognition in that the ecological psychology brought in relationality and uh action orientation the pragmatic turn",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.155,
    "end": 2325.478,
    "text": " And then now what about those objects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.079,
    "end": 2328.042,
    "text": "If we drop the idea, what happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.583,
    "end": 2331.246,
    "text": "If we drop it from the discussion, what happens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.067,
    "end": 2338.576,
    "text": "And then the second piece is the very interesting historical note about the development of complex systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.517,
    "end": 2358.147,
    "text": " and about the appropriateness of this kind of a formalism because at the very least standing as extremely on the instrumental spectrum as we can be we're going to need to bake relationality into our analysis of any system whatever it is that it is doing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.491,
    "end": 2369.747,
    "text": " And then it may come to be the case that if those systems are also cognitive or understood in terms of informational manifolds...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.945,
    "end": 2397.462,
    "text": " then it's a doubly appropriate approach and the kind of double ratcheting of cognition makes it difficult to see how a framework that doesn't have some of these characteristics could be adequate to describe that kind of a relation so great points let us go to the non-bayesian mechanics so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.175,
    "end": 2404.326,
    "text": " The non-Bayesian mechanics are classical, statistical, and quantum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.413,
    "end": 2431.981,
    "text": " so however you'd like maybe just uh on each of the following three slides just what are classical mechanics statistical mechanics and quantum mechanics uh kind of steel personning the argument and just what do they explain what will they continue to be useful for and how can we see them as special cases or adjacencies or however you'd like to frame it with respect to Bayesian mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.735,
    "end": 2434.455,
    "text": " Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2434.996,
    "end": 2442.419,
    "text": "Yeah, so beginning with classical mechanics, I think, is probably the simplest example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.16,
    "end": 2449.763,
    "text": "You have kind of the physics of very large, very slow things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2450.403,
    "end": 2457.227,
    "text": "Large is kind of a relative term, large compared to atoms maybe, and slow compared to the speed of light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2457.687,
    "end": 2458.407,
    "text": "But nonetheless,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2460.328,
    "end": 2485.4,
    "text": " This is a broad region of physics that describes things that don't have relativistic effects, things where observations commute, so it's non-quantum, things that are not noisy, so there's no probabilities, it's not statistical, and things that do not require relativistic corrections, so things that are below the speed of light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2487.908,
    "end": 2499.358,
    "text": " When you have all four of those ingredients, I think I listed four anyway, you have classical physics, or at least you have a classical object, and the physics of that thing is classical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2500.419,
    "end": 2509.347,
    "text": "So this arises from, you may have inferred, four limits of other kinds of physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2509.927,
    "end": 2513.368,
    "text": " So you want to be now infinitely precise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2514.309,
    "end": 2517.29,
    "text": "So this is the kind of no-noise limit of statistical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.13,
    "end": 2522.552,
    "text": "It's the slow speeds limit of special relativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2523.552,
    "end": 2533.416,
    "text": "And it's a very interesting limit of quantum mechanics that I can get into a little bit, but it begins to get a bit complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.136,
    "end": 2536.917,
    "text": "Maybe I'll save that for the third slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2537.657,
    "end": 2538.278,
    "text": "So yes, but...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2539.378,
    "end": 2552.829,
    "text": " Until then, I'll say there is a classical limit of quantum mechanics, that you take a quantum field theory and you can produce a classical theory out of that in a relatively well-defined way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2554.23,
    "end": 2557.072,
    "text": "And again, I can talk a little about the nuances to that statement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2557.673,
    "end": 2558.173,
    "text": "There are some.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2558.633,
    "end": 2562.256,
    "text": "But regardless, classical physics is about...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2564.474,
    "end": 2565.475,
    "text": " large things, really.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.096,
    "end": 2574.386,
    "text": "The interesting thing is that all four of these limits kind of coincide to some extent when you have a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.516,
    "end": 2578.778,
    "text": " very large system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2579.938,
    "end": 2588.764,
    "text": "So very large systems allow you to use the law of large numbers to kind of sharpen your beliefs about a system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2589.185,
    "end": 2594.468,
    "text": "So you can imagine this as placing greater precision on the measurement of your system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.028,
    "end": 2603.374,
    "text": "And that recreates sort of the no noise limit, because you get more and more precise in your estimate of the dynamics of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2605.115,
    "end": 2614.078,
    "text": " Many body systems with very small objects are systems where you start to see quantum corrections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.458,
    "end": 2627.061,
    "text": "So particles, like atomic particles, for instance, you begin to run into a regime where things are small enough that quantum physics becomes relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2629.617,
    "end": 2643.928,
    "text": " And also large systems tend to move pretty slowly as just a general rule in what's called effective field theory, which talks about how one theory is a limit of another theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2644.369,
    "end": 2649.133,
    "text": "And in particular, it talks about as you increase in scale, you get simpler theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2650.033,
    "end": 2663.441,
    "text": " So I think we would probably all agree classical physics is a lot simpler than quantum physics, and that's because effective field theory says that large things have simpler physics in very rigorous senses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2664.261,
    "end": 2665.322,
    "text": "One expression of that is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2667.162,
    "end": 2671.884,
    "text": " kind of the momentum scale is inverse to the mass scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2672.204,
    "end": 2676.465,
    "text": "So larger things generally have lower momenta, lower energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2676.845,
    "end": 2679.946,
    "text": "Very small things whiz around at very fast speeds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2679.966,
    "end": 2680.807,
    "text": "They have high momenta.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2683.382,
    "end": 2699.034,
    "text": " So once you start to talk about large systems, things begin simplifying in such a way that more often than not, you run into classical physics as a sufficient description of the scale of observation that you're at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2700.215,
    "end": 2702.817,
    "text": "So classical physics, that's where it comes from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2704.038,
    "end": 2706.3,
    "text": "It is about Newton's law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.86,
    "end": 2710.623,
    "text": "Classical mechanics, Newtonian mechanics, as we might call it, is about Newton's law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2710.723,
    "end": 2712.105,
    "text": "It says that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.342,
    "end": 2715.925,
    "text": " well, Newton's three laws, I suppose I should say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2717.046,
    "end": 2723.693,
    "text": "They say that every action has an equal and opposite reaction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2724.513,
    "end": 2726.175,
    "text": "So this is the idea that things that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2728.39,
    "end": 2734.653,
    "text": " So contact forces have, at the classical level, an equivalent force in the opposite direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2735.413,
    "end": 2748.499,
    "text": "You can think of this as a kind of, if you're familiar with exercises in school in this area, you're often asked to calculate the normal force of something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.7,
    "end": 2754.462,
    "text": "The normal force is just what pushes up on me when I push down on something else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2755.082,
    "end": 2756.142,
    "text": "So this is why I don't...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2757.563,
    "end": 2763.17,
    "text": " phase through the ground when I stand up is because there is an equal and opposite reaction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2763.691,
    "end": 2768.517,
    "text": "I'm not only putting a force on the ground, but the ground is acting on me and keeping me up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2771.107,
    "end": 2771.967,
    "text": " That's one of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2772.427,
    "end": 2775.128,
    "text": "The other one is the very famous F equals MA.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2775.148,
    "end": 2782.85,
    "text": "It says that the force acting on a system is the mass times the acceleration of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2783.23,
    "end": 2788.452,
    "text": "And likewise, you can deduce the acceleration of a system by taking the force acting on it and dividing out the mass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2789.752,
    "end": 2797.716,
    "text": " So this tells you, okay, how do we generate dynamics out of some boundary conditions, like what is the mass, what direction is the force acting in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2798.936,
    "end": 2804.078,
    "text": "And classical mechanics comes from a, what we call, least action principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2804.478,
    "end": 2814.523,
    "text": "And there are a number of equivalent ways of writing this, but this generalizes to what some people call Lagrangian mechanics, and that tells you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2816.354,
    "end": 2823.636,
    "text": " Imagining what are the energies that those forces came from, how does the system behave with respect to its energies?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2824.396,
    "end": 2833.979,
    "text": "And if you talk about stationary action, you talk about minimizing energy, then you can recover Newton's laws as a system accelerates along force gradients.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2834.679,
    "end": 2839.06,
    "text": "And it doesn't waste energy by going any faster or going any slower.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2839.72,
    "end": 2841.241,
    "text": " It does exactly what it's told to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2841.701,
    "end": 2844.483,
    "text": "So it uses precisely the energy budget available to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2845.264,
    "end": 2857.291,
    "text": "There's a very nice, well, maybe I shouldn't say it about my own paper, but there's a very lengthy exposition of this in the physics of and by beliefs paper that we've talked about once already.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2857.311,
    "end": 2863.895,
    "text": "I think it's section two where I run through why is the analogy to classical mechanics even useful here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.455,
    "end": 2868.078,
    "text": "And it's because of the stuff that we talked about previously with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2868.718,
    "end": 2874.402,
    "text": " the very nice dichotomy or trichotomy between principles, mechanics, and dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2874.982,
    "end": 2892.793,
    "text": "But anyway, more broadly than that, classical mechanics is a very good example of a least action principle because it's the idea that the dynamics of classical things comes from a particular scale-appropriate limiting least action principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.876,
    "end": 2898.216,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.861,
    "end": 2903.182,
    "text": " Ali or Jakob, anything to add, or we'll move to statistical mechanics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.243,
    "end": 2907.483,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.724,
    "end": 2910.764,
    "text": "Classical descriptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.904,
    "end": 2912.905,
    "text": "On to statistical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.605,
    "end": 2916.866,
    "text": "Yeah, so statistical mechanics is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2918.635,
    "end": 2919.795,
    "text": " A bit of an interesting one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2921.256,
    "end": 2938.722,
    "text": "Statistical mechanics is a lot broader than I think one might initially think, because at the end of the day, it is to some extent just about systems with, as you've written here, probabilistic degrees of freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2939.802,
    "end": 2940.583,
    "text": "And that is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2942.145,
    "end": 2944.106,
    "text": " That covers a lot of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2944.686,
    "end": 2946.307,
    "text": "Probability theory is just maths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2946.808,
    "end": 2953.471,
    "text": "So anywhere you can use probability theory to describe some system, you can use statistical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2954.212,
    "end": 2955.953,
    "text": "And we know that this is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2957.468,
    "end": 2963.053,
    "text": " This generality does exist because you can talk about quantum statistical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.534,
    "end": 2969.779,
    "text": "So you can take the physics of very small, very fast things and use statistical mechanical methods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2970.18,
    "end": 2972.882,
    "text": "You can use probability theory and entropy in these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2974.223,
    "end": 2979.026,
    "text": " And you can also go all the way up to black hole thermodynamics, and you can do the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2980.047,
    "end": 2988.833,
    "text": "So black holes are very large things, but you can still talk about the thermodynamics or statistical mechanics of black holes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2989.453,
    "end": 2991.514,
    "text": "So it's worth saying that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2993.723,
    "end": 3004.957,
    "text": " We can talk about the no noise limit of a particular kind of statistical mechanics, but then we need to be a little bit more precise about what that generates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3007.136,
    "end": 3010.759,
    "text": " In this case, I'm thinking of classical statistical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3011.239,
    "end": 3026.129,
    "text": "So it's the statistical mechanics of interacting particles or systems with microstates that relate to macrostates via some kind of Gibbs relation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3027.69,
    "end": 3032.654,
    "text": " and things that have free energy, and in particular, Shannon entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3033.455,
    "end": 3043.903,
    "text": "So this is a little bit more of a narrower idea of what statistical mechanics is, just because we need to constrain ourselves a little bit even to get off the ground.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3044.383,
    "end": 3047.245,
    "text": "Otherwise, we'd be covering way too much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3048.026,
    "end": 3053.65,
    "text": "But it is the case that if you take statistical descriptions of things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.591,
    "end": 3065.253,
    "text": " ensembles of objects and you become more and more precise and you get rid of the noise, then you can reproduce kind of classical equations of motion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3067.833,
    "end": 3069.614,
    "text": " And there are ways of doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3070.835,
    "end": 3073.237,
    "text": "One such thing is called mean field theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.697,
    "end": 3084.524,
    "text": "So in mean field theory, you get rid of the noise in a system and you just say, okay, here is the trajectory of the system in the same way as we might do with...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3086.105,
    "end": 3086.926,
    "text": " classical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3087.946,
    "end": 3095.61,
    "text": "I'm skipping some details there, and the analogy is a little bit more nuanced than that, but it's kind of a useful mental picture, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3097.271,
    "end": 3105.896,
    "text": "And one of the interesting things to note, I think, is what you've written here, is that there is a principle that's relevant for statistical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3107.197,
    "end": 3114.101,
    "text": "Because StatMech is very general, it's very mathematical, it requires an equally mathematical principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3115.341,
    "end": 3131.965,
    "text": " And so in probability theory, we have what's called the maximum entropy principle, which is just a way of designing probability densities around inferences that satisfy some mathematical desiderata.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.985,
    "end": 3133.886,
    "text": "So they should be consistent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.966,
    "end": 3136.046,
    "text": "They should be unbiased.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.146,
    "end": 3139.727,
    "text": "They should lead back to Bayesian inferences under suitable conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3140.247,
    "end": 3141.648,
    "text": "And MaxEnt is that thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3142.948,
    "end": 3160.816,
    "text": " And we know due to, well, work by James, but more recently work by people like Ken Dill, also here at Stony Brook, and before him, mathematicians like Markovic and Villani,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3162.336,
    "end": 3171.061,
    "text": " All of this is a large body of work that points to the idea that if you maximize entropy, you get the mechanics of diffusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3171.501,
    "end": 3178.065,
    "text": "So you get the mechanical rules that generate mass action like diffusing particles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3182.267,
    "end": 3182.668,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.048,
    "end": 3186.33,
    "text": "I just want to ask about one word, which was unbiased.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.83,
    "end": 3188.671,
    "text": "So what does unbiased mean here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.829,
    "end": 3195.311,
    "text": " I think you can think of it as avoiding overfitting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3195.831,
    "end": 3205.794,
    "text": "So one of the things that you can consider MaxEnt to be is a recipe for doing inference that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3207.503,
    "end": 3212.747,
    "text": " maximizes ignorance subject to some constraints.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3213.248,
    "end": 3218.652,
    "text": "So if you have some known unknowns, then you want to incorporate those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.232,
    "end": 3226.338,
    "text": "But if you have unknown unknowns, you don't want to risk overfitting for those things that you're not aware of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3226.678,
    "end": 3231.001,
    "text": "So if you're not aware of something, you don't want to falsely incorporate it into your inferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3231.622,
    "end": 3236.685,
    "text": "You could consider this as avoiding overfitting, or you could consider it as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.247,
    "end": 3241.409,
    "text": " kind of optimizing for subclasses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3241.909,
    "end": 3250.916,
    "text": "If you're thinking of probabilistic stuff as a problem of classification, then you can think of it as optimizing for subclasses that you don't have information on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3251.577,
    "end": 3265.768,
    "text": "But either way, it is the idea that you don't want to introduce extraneous information into your inference because that extraneous information biases you in a direction that the data doesn't support.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3267.457,
    "end": 3270.859,
    "text": " So that's really the idea behind Unbiased.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.34,
    "end": 3289.073,
    "text": "And one of the things that Janes did, and not only Janes, but also Shannon before him, who worked on the probabilistic aspects of this, and then after Janes and Shannon did,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3290.194,
    "end": 3306.767,
    "text": " Shore and Johnson, who also were probability theorists and worked on MaxEnt axiomatically, not like Jaynes, who took it more as a physical rule for a long time and then got into the probability theory of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3308.328,
    "end": 3317.935,
    "text": " Either way, all of these people are able to justify with rigorous proofs that maximum entropy is the best way of making unbiased inferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3318.756,
    "end": 3320.217,
    "text": "And there's lots of literature on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3320.797,
    "end": 3327.342,
    "text": "Those are three useful names, but there's a lot more due to Ariel Katicha.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3328.223,
    "end": 3331.385,
    "text": "I already mentioned Ken Dill, Adam Giffen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3332.065,
    "end": 3334.167,
    "text": "Lots of people have taken an interest in this area.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.007,
    "end": 3335.708,
    "text": "Rightly so, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3338.402,
    "end": 3338.722,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.063,
    "end": 3349.107,
    "text": "We're going to keep moving to now quantum, and then already many of the seeds that bring us to Bayesian are planted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.607,
    "end": 3352.608,
    "text": "So quantum, what is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.928,
    "end": 3354.309,
    "text": "How did it come into play in your work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.009,
    "end": 3357.51,
    "text": "Yeah, so quantum mechanics is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3359.281,
    "end": 3364.846,
    "text": " I think, qualitatively different from classical and statistical physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3366.367,
    "end": 3371.191,
    "text": "It's about very small things or very fast things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3371.612,
    "end": 3375.775,
    "text": "And as I was saying, effective field theory tells us these things usually go together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3378.633,
    "end": 3384.796,
    "text": " And it talks about kind of when you get things that are not classical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3385.637,
    "end": 3394.542,
    "text": "Well, at least it started as when you get things that are not classical, what do you need to add to your theory to make the right predictions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3395.162,
    "end": 3397.863,
    "text": "So quantum mechanics began as a kind of modeling effort.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3400.687,
    "end": 3407.71,
    "text": " It grew from what we might call semi-classical physics, which is just about quantum corrections to classical stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3408.591,
    "end": 3420.256,
    "text": "It grew from semi-classical physics to its own genuine branch of physics in and around the 20s, I suppose, certainly the early 1900s anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3424.272,
    "end": 3438.963,
    "text": " So one of the things that becomes relevant is probability theory, because quantum mechanics, you may have heard about Heisenberg uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3439.084,
    "end": 3442.126,
    "text": "It's about the fact that measurements do not commute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3442.927,
    "end": 3446.109,
    "text": "So the order that you do a measurement in matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3447.31,
    "end": 3452.014,
    "text": "A consequence of this is that there is always some inherent uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3452.594,
    "end": 3461.237,
    "text": " when you measure so-called conjugate variables, which are just things that fit into the theory as noncommuting pairs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3461.777,
    "end": 3464.798,
    "text": "So you measure two noncommuting pairs, there is some uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.818,
    "end": 3465.918,
    "text": "You can measure one precisely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3466.238,
    "end": 3467.618,
    "text": "You can't measure both precisely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3468.539,
    "end": 3470.899,
    "text": "And moreover, there's a trade-off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3471.279,
    "end": 3475.881,
    "text": "If you measure one with infinite precision, you know absolutely nothing about the other one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3476.341,
    "end": 3478.321,
    "text": "If you try and play half and half, then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3480.523,
    "end": 3481.684,
    "text": " that's what you get.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3481.745,
    "end": 3486.392,
    "text": "You get kind of blanket uncertainty about both measurements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3487.746,
    "end": 3512.397,
    "text": " So because of the non-commuting of variables, and this is kind of an empirical fact, this doesn't come out of nowhere, but it is one of those things where it just happens to be right because it's so elegant that it wouldn't make a lot of sense if it weren't, much like, I guess, the coincidence of synchronization and Bayesian inference in complex systems theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3513.597,
    "end": 3538.812,
    "text": " because non-commuting variables gives us all of the rest of quantum mechanics, the stuff that we really know and love, and also is a relatively well-defined way of getting back classical physics, because all you have to do is take the theory and make things commute, and then you get classical physics back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3540.393,
    "end": 3568.621,
    "text": " um i'm i'm brushing some difficulties under the rug it's as you might imagine it's not that simple and um technically it doesn't work but it sort of does uh and and if you're interested i guess um you can look into what's called deformation quantization which is exactly the idea that if you take a classical system and you uh deform it in such a way that things no longer commute then you get back quantum physics but um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3570.475,
    "end": 3572.536,
    "text": " You can't really do it the other way around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3573.837,
    "end": 3576.578,
    "text": "There's a bit of subtlety to the other direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3577.919,
    "end": 3584.542,
    "text": "Nonetheless, that is one route to making quantum stuff, classical stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3585.102,
    "end": 3587.343,
    "text": "Another route is just focusing on the probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3587.843,
    "end": 3593.666,
    "text": "So because of this inherent uncertainty, quantum particles, their equations of motion,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3595.127,
    "end": 3601.652,
    "text": " have what we call transition amplitudes, which gives the probability of moving from one state to another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3602.133,
    "end": 3604.535,
    "text": "But again, nothing is certain in quantum mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3605.516,
    "end": 3612.362,
    "text": "If you, however, make it certain, mathematically, you can go in and just take the no-noise limit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3614.292,
    "end": 3620.553,
    "text": " More properly, you should do something called wick rotation first, which just allows that limit to make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3622.134,
    "end": 3628.075,
    "text": "Although, well, yes, you should do that first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3628.115,
    "end": 3635.076,
    "text": "If you do that, you take the kind of no-noise limit, then you get certain state transitions, and this just gives you back a classical dynamical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3635.256,
    "end": 3637.697,
    "text": "You know where it's going once you have the equations of motion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3639.432,
    "end": 3649.101,
    "text": " And this is the route that I take in the paper because it fits very nicely into the path integral formulation in a way that kind of just makes things make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3650.422,
    "end": 3658.83,
    "text": "And one of the nice things that I then go on to say is if you have a parameter sitting inside that path integral,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3659.551,
    "end": 3667.799,
    "text": " then you can make sense of why classical physics comes from the no-noise limit by writing it as a Bayesian mechanical problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3668.139,
    "end": 3675.066,
    "text": "You can write about synchronization and get back the Bayesian mechanics of classical stuff just by doing this very well-defined procedure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3675.726,
    "end": 3680.371,
    "text": "This is something that already exists in physics and is fairly uncontroversial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3682.416,
    "end": 3685.118,
    "text": " So that's what you get in quantum mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3685.378,
    "end": 3686.239,
    "text": "It's about small stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3686.799,
    "end": 3691.682,
    "text": "It's fundamentally probabilistic because there is fundamental uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3692.183,
    "end": 3694.804,
    "text": "And again, this traces back to empirical facts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3697.826,
    "end": 3699.207,
    "text": "I think that about covers it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3699.227,
    "end": 3702.89,
    "text": "I don't know if I should have said more or if you have other questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3702.93,
    "end": 3707.032,
    "text": "I think that's sufficient at this benchmark for that slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3707.052,
    "end": 3708.834,
    "text": "Oh, it's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3709.034,
    "end": 3709.314,
    "text": "Jakob?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3711.383,
    "end": 3728.558,
    "text": " Yeah, I realize the paper dealt mainly with Bayesian mechanics for classical objects, but do you see Bayesian mechanics being applied to non-classical phenomena like quantum tunneling or entanglement?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3730.299,
    "end": 3734.2,
    "text": " which cannot really be explained in the limit of large numbers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3734.58,
    "end": 3741.362,
    "text": "And then also, second question, which is kind of on the intersection of quantum mechanics and statistical physics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3742.142,
    "end": 3749.704,
    "text": "Is there any change in the formalism when you introduce the notion of indistinguishability between particles?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3751.724,
    "end": 3752.024,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3752.584,
    "end": 3753.705,
    "text": "Well, those are really good questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3754.585,
    "end": 3758.526,
    "text": "I think, yes, there is probably an idea",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3760.607,
    "end": 3782.411,
    "text": " of um quantum tunneling that that could be achieved maybe um because uh quantum tunneling if if you're a physicist this is something that you're um familiar with on the nose if you're a mathematician this is what you would think of as uh an instanton uh so instanton solutions to the uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3782.931,
    "end": 3788.838,
    "text": " equations of motion of a quantum field theory are tunneling dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3789.379,
    "end": 3794.644,
    "text": "And so the idea becomes, okay, can we describe instantan solutions using Bayesian mechanics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3795.906,
    "end": 3797.588,
    "text": "And the answer is, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3798.349,
    "end": 3799.27,
    "text": "But it seems like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3800.968,
    "end": 3817.322,
    "text": " it should maybe be possible, because there is at least an understanding of where points A and B are, if not how to get from A to B. But that is something that would be interesting to do more work with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3817.923,
    "end": 3827.651,
    "text": "And more generally, it would be interesting to think about quantum physics through the Bayesian mechanical lens, just because you do get this...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3829.451,
    "end": 3832.533,
    "text": " you do recover this classical limit of the path integral.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3833.313,
    "end": 3842.939,
    "text": "And morally, path integral quantization should be equivalent to things like deformation quantization and geometric quantization and other methods even.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3843.92,
    "end": 3846.721,
    "text": "And actually, one other one is worth saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3847.041,
    "end": 3856.567,
    "text": "There's a thing called stochastic quantization, which begins from real valued probabilities and then makes quantum stuff out of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3859.056,
    "end": 3868.987,
    "text": " the Bayesian mechanics as it is construed today is very close to stochastic quantization in a few very key senses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3869.708,
    "end": 3872.11,
    "text": "So one supposes it should be possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3874.83,
    "end": 3875.531,
    "text": " That would be nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3875.551,
    "end": 3881.557,
    "text": "So that's the answer to one question, is should be, but I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3882.338,
    "end": 3882.919,
    "text": "It would be cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3883.72,
    "end": 3888.705,
    "text": "As far as entanglement and other kinds of information theory,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3890.74,
    "end": 3892.32,
    "text": " I actually don't know very much about this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3892.42,
    "end": 3902.722,
    "text": "Quantum information theory is something that is relatively new, and a lot of people kind of in and adjacent to things like condensed matter theory are very interested in this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3903.502,
    "end": 3905.843,
    "text": "But I am behind on the literature, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3906.803,
    "end": 3918.165,
    "text": "One of the things that does kind of lend itself to information theory in general is the fact that Bayesian mechanics has these connections to Maxent and Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3919.425,
    "end": 3925.19,
    "text": " And these are of course ways of talking about information and information theory So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3928.351,
    "end": 3937.275,
    "text": " So yes, my thought is something like entanglement, which has information theoretic undertones, should also be possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3938.096,
    "end": 3943.378,
    "text": "But again, I don't know initially what precisely that would look like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3943.418,
    "end": 3948.841,
    "text": "There is some literature out there that has to do with the free energy principle in the context of information theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.401,
    "end": 3954.003,
    "text": "I am thinking of work due to Carl James Glazebrook and Chris Fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3954.523,
    "end": 3956.705,
    "text": "They've published a lot of work in this direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3958.325,
    "end": 3960.486,
    "text": " which is also something I'm not totally familiar with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3962.507,
    "end": 3967.35,
    "text": "But again, it seems like a very rich area to eventually pursue connections in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3969.911,
    "end": 3970.151,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.411,
    "end": 3975.754,
    "text": "And then the second question was about indistinguishability of particles, FN Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.054,
    "end": 3976.434,
    "text": "Ah, yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3976.534,
    "end": 3976.774,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.355,
    "end": 3977.515,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.181,
    "end": 3996.279,
    "text": " Yeah, so I suppose you're thinking of passing to these kinds of bosonic field theories where you just pack a whole bunch of equivalent field states into your Fox space and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3997.06,
    "end": 3999.402,
    "text": " see if you can make that make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4001.663,
    "end": 4020.135,
    "text": "I think you may notice this when we get into the supersymmetry results, is there is a conceptualization that yes, things do change when you introduce bosonic-looking things as opposed to fermionic-looking things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4021.316,
    "end": 4039.249,
    "text": " So it does become important to keep track of the statistics of these particles, because that recovers things like BRST charges relating the two genres of particle, and that is what gets the classical chaos in the last section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4039.91,
    "end": 4043.953,
    "text": "So yes, there is a reason to distinguish between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4046.57,
    "end": 4048.811,
    "text": " the behavior of the particles in each theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4049.971,
    "end": 4064.956,
    "text": "I think the precise nature of that will become clearer once someone actually knuckles down and does out Bayesian quantum mechanics, where we'll be able to couple directly to that kind of idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4067.532,
    "end": 4067.832,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.852,
    "end": 4070.894,
    "text": "A lot of fun topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.895,
    "end": 4072.495,
    "text": "The tunneling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.995,
    "end": 4076.257,
    "text": "Do we have to visit every belief on the way from A to B?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4077.238,
    "end": 4084.862,
    "text": "Or, as it sometimes can seem, are we in one position and then we are in a different cognitive position?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.183,
    "end": 4095.628,
    "text": "All different kinds of experimenter, experimented questions in cognitive science, even potentially collective thought questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.868,
    "end": 4099.511,
    "text": " and ways of communication in terms of these formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.572,
    "end": 4104.094,
    "text": "Yeah, and the instanton question is pretty interesting as well, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4104.134,
    "end": 4124.77,
    "text": "Because it talks about, okay, if we have a system with multiple classical minima, so if we can say, okay, there are multiple optimal Bayesian beliefs, instantons are the things that zip between those minima.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4125.49,
    "end": 4132.056,
    "text": " So it's a qualitatively different way of thinking about dynamical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4132.516,
    "end": 4137.06,
    "text": "It's not a single minima, and it's not a single classical trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4137.521,
    "end": 4141.584,
    "text": "It's multiple minima, and it's almost like phase transitions between the two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4143.826,
    "end": 4163.64,
    "text": " Certainly that's interesting from the point of view of physics, excuse me, from physics, but tracing it back to something like cognitive science, thinking about, okay, what are the sort of phase transitions between our beliefs and can we actually access other phases, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4163.7,
    "end": 4165.982,
    "text": "Do those instant and solutions actually exist?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4166.802,
    "end": 4170.285,
    "text": "And do they describe some kind of zipping between beliefs",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4170.825,
    "end": 4176.127,
    "text": " maybe generative models or perceptory regimes or something of that nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4176.428,
    "end": 4180.229,
    "text": "It's very kind of nebulous, but it's a provocative question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4181.81,
    "end": 4182.19,
    "text": "Excellent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4182.51,
    "end": 4182.75,
    "text": "Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.872,
    "end": 4199.038,
    "text": "Well, I was on the understanding that as we go from classical to statistical and ultimately to quantum mechanics, the role of information and uncertainty in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4200.137,
    "end": 4208.583,
    "text": " describing and formulating the dynamics and mechanics of the physical systems becomes more explicit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.704,
    "end": 4223.874,
    "text": "So is it a correct assumption to say that Bayesian mechanics somehow aims to put information back in the game and make it equally explicit through all of those mechanics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.632,
    "end": 4226.413,
    "text": " Yeah, absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4226.833,
    "end": 4229.094,
    "text": "I think that's a good way of thinking about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4229.174,
    "end": 4238.6,
    "text": "The reason why Bayesian mechanics is so general, much like statistical mechanics is very general, is because it's just about information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4239.181,
    "end": 4243.103,
    "text": "And lots of things have information, even at the classical level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4243.404,
    "end": 4246.366,
    "text": "We just usually neglect it because we don't need to think about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4247.586,
    "end": 4249.347,
    "text": "But it becomes very apparent...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4250.468,
    "end": 4267.096,
    "text": " and this is part of the explanatory power of doing something like that, it becomes very apparent that classical stuff comes about when that information goes away or rather when those probabilities, that uncertainty goes away, that information becomes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4268.837,
    "end": 4271.5,
    "text": " sort of limitingly large or infinite.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4272.821,
    "end": 4285.392,
    "text": "So what Bayesian mechanics allows you to do is actually keep track of how does information change between these different scales, which is one particular payoff that I think makes it very valuable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4286.632,
    "end": 4292.254,
    "text": " but not just bridging scales, also applying to many different scales, because lots of things do have information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4292.634,
    "end": 4297.316,
    "text": "Information is just a mathematical apparatus that we can use to describe lots of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4297.816,
    "end": 4306.139,
    "text": "So if that's all that your physics is built on, then it will be, by consequence, something very general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4308.58,
    "end": 4308.9,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.8,
    "end": 4310.681,
    "text": "The way that it's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.287,
    "end": 4327.257,
    "text": " coming to me today is in classical mechanics we get uh especially once we understand these limits which classical mechanics is like a point within a broader space of physics or mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.058,
    "end": 4347.479,
    "text": " we get principles of least action and stationarity and laws of large numbers not unlike the central limit theorem in statistics and a lot of the esoteric gaussian statistics in statistical mechanics the probabilistic nature becomes formal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.766,
    "end": 4357.134,
    "text": " For example, in the billiards case in classical mechanics, you might want to do statistics across many slightly similar billiards games.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.194,
    "end": 4366.603,
    "text": "And so at that point, you could either do the plug and chug frequentist statistics, or at some point, you're going to want to think a little bit more broadly about the distribution of billiards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.504,
    "end": 4369.666,
    "text": "And then quantum, especially,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4370.547,
    "end": 4396.759,
    "text": " makes the relationality and the modeler modeled dialectic formal because just by doing statistics you're already in an area of explicit relationality map territory distinguishing and then quantum takes that to another level and could it be said that with bayesian we're even going a layer deeper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.91,
    "end": 4425.698,
    "text": " into the modeler's approach to the system where do you see this yeah i think so i think so um the idea would be eventually we introduce an actual idea of information um which naturally kind of depends on the observer or the modeler",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4426.418,
    "end": 4430.301,
    "text": " because information is kind of modeler dependent, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4430.661,
    "end": 4432.662,
    "text": "Information has a context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4433.343,
    "end": 4436.865,
    "text": "It has, or is contingent on observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4437.906,
    "end": 4450.354,
    "text": "So when we start talking about surprisal and the dynamics of beliefs and inference, all of these are very explicitly putting the modeler back in the situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4450.975,
    "end": 4455.077,
    "text": "And that may be in the very metaphorical sense of a system,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4456.558,
    "end": 4458.14,
    "text": " synchronizing with its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4458.22,
    "end": 4464.465,
    "text": "It doesn't necessarily have to be a cognitive observer or a panpsychist kind of modeler.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4465.666,
    "end": 4468.209,
    "text": "I don't really think there's remit for that within the maths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4469.49,
    "end": 4474.054,
    "text": "But the point is that the maths works with or without those assumptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4474.534,
    "end": 4477.936,
    "text": " So in a sense, it's actually agnostic to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4478.857,
    "end": 4486.042,
    "text": "And you can conjure an image of a modeler that is pure metaphor, just talking about synchronization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4486.842,
    "end": 4489.704,
    "text": "However, the language is pretty instructive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4490.165,
    "end": 4498.931,
    "text": "And it does relate back to the idea that lots of systems have and can capture information, maybe in a very trivial, not...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4499.731,
    "end": 4514.076,
    "text": " cognitive, not conscious-like sense, but nonetheless, they do capture and synchronize to information, and therefore they do model and they do inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4517.217,
    "end": 4517.477,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.977,
    "end": 4522.739,
    "text": "It's the classical, if a tree falls in the forest, does anyone hear it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.819,
    "end": 4523.219,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.299,
    "end": 4524.88,
    "text": "If a tree falls, does it make a noise?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.32,
    "end": 4528.241,
    "text": "Yeah, I mean, I think the answer would be...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4530.061,
    "end": 4532.763,
    "text": " It depends on what's synchronizing to the tree, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4533.163,
    "end": 4549.912,
    "text": "If the tree falls on, okay, this is going to be a pretty grim example, I guess, but if a tree falls on some sort of small woodland critter, then yes, I think the tree definitely fell because the statistics of one thing synchronizing to the other one would say, yeah, pretty unequivocally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4551.012,
    "end": 4551.813,
    "text": " the tree just fell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4552.253,
    "end": 4555.095,
    "text": "But if you're not there, you're not synchronizing to the tree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4555.515,
    "end": 4558.437,
    "text": "And so that information has no meaning to you whatsoever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4559.117,
    "end": 4566.262,
    "text": "So it is very much about, as you've written, modeler-dependent information in a very mathematically rigorous way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4568.806,
    "end": 4575.731,
    "text": " really powerful and also connects to a lot of qualitative and contemporary ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.791,
    "end": 4580.854,
    "text": "So it's really exciting to think about where and how Bayesian mechanics can be applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.336,
    "end": 4595.104,
    "text": "This brings us as we head into the z-score of plus one downhill on the Gaussian of the dot one into the paper itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.061,
    "end": 4600.207,
    "text": " So we'll pause, Ali and Jakob, if you have any questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.468,
    "end": 4607.439,
    "text": "Otherwise, we're going to go to the roadmap and have some overview notes on the paper and its structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.819,
    "end": 4608.4,
    "text": "Does that sound good?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.704,
    "end": 4610.904,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4612.068,
    "end": 4629.945,
    "text": " so pardon the meme but um here's the road map of the paper the sections and subsections so maybe just a general comment what did you include in the paper what did you not include in the paper why did you structure it how you structured it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4631.209,
    "end": 4631.97,
    "text": " Yeah, absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4632.05,
    "end": 4643.068,
    "text": "So the structure was kind of meant to reflect, I think, an unmet need in the literature, which is both",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4644.258,
    "end": 4648.44,
    "text": " a single place for all of these results to be reviewed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4649.18,
    "end": 4655.063,
    "text": "And then once that review has been done, an application of all those results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4655.543,
    "end": 4659.925,
    "text": "So organize everything and then use it in a kind of insightful way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4661.226,
    "end": 4665.908,
    "text": "And having all the rigorous stuff in the beginning makes the application make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4666.468,
    "end": 4672.291,
    "text": "And having the application makes or provides context for all the very rigorous stuff at the beginning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4673.491,
    "end": 4678.433,
    "text": " So to do that, it's kind of split almost down the middle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4680.214,
    "end": 4687.658,
    "text": "You have the sections one through four, all the foundational stuff, and then sections five, six, and seven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4688.738,
    "end": 4689.979,
    "text": " are the actual applications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4691.399,
    "end": 4698.862,
    "text": "So I began with a very brief introduction, just motivating precisely this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4699.902,
    "end": 4701.583,
    "text": "Here are the questions that we're going to answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4701.603,
    "end": 4704.264,
    "text": "Here's how we're going to answer them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4704.644,
    "end": 4705.825,
    "text": "Here's why it even matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4707.886,
    "end": 4716.429,
    "text": "In section two, I just very briefly review classical physics to set the stage for some of the stuff that we've already discussed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4718.674,
    "end": 4721.956,
    "text": " then I talk about Bayesian mechanics itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4722.896,
    "end": 4729.319,
    "text": "And 2B through 2D are fairly long because this sets up all the basic machinery.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4730.159,
    "end": 4742.604,
    "text": "We begin with, I believe, to begin with, we talk about what does it mean for Bayesian mechanics to be like classical mechanics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4743.524,
    "end": 4744.785,
    "text": "What are the basics of it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4745.973,
    "end": 4747.234,
    "text": " What is variational free energy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4747.314,
    "end": 4748.814,
    "text": "What is surprisal?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4749.234,
    "end": 4750.395,
    "text": "What is least surprisal?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4752.556,
    "end": 4761.8,
    "text": "And then in C and D, these basic ideas can be used to figure out, OK, what does it mean then to minimize surprisal?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4762.34,
    "end": 4766.342,
    "text": "How does that matter to Bayesian inference, physics of beliefs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4766.962,
    "end": 4770.984,
    "text": "Physics by beliefs is then inverting the story and talking about, OK,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4773.075,
    "end": 4782.964,
    "text": " So we know now that systems, when they minimize their free energy or minimize their surprisal, they synchronize to their environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4782.984,
    "end": 4785.387,
    "text": "So you can write this nice story about parameters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4785.927,
    "end": 4787.589,
    "text": "Can you do it the other way around?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4787.789,
    "end": 4789.771,
    "text": "Can you begin from the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4791.272,
    "end": 4792.553,
    "text": " Now, I think I gave that in the wrong direction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4792.593,
    "end": 4795.715,
    "text": "So when systems synchronize, they minimize their free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4795.735,
    "end": 4797.056,
    "text": "So you can read this as Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4797.076,
    "end": 4799.318,
    "text": "So then I ask, OK, can you do this the other way around?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4799.638,
    "end": 4801.099,
    "text": "Can you begin from Bayesian inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4801.44,
    "end": 4803.021,
    "text": "And can you get the dynamics of parameters?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4804.182,
    "end": 4807.544,
    "text": "Which is just kind of flipping the story, but it involves...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4808.985,
    "end": 4812.046,
    "text": " a bit of work to actually make it follow through.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4812.886,
    "end": 4813.906,
    "text": "In the end, however, it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4814.426,
    "end": 4825.428,
    "text": "And the relationship between the two, so I say physics of beliefs, because one is taking the motion of parameters and relating it to the motion on statistical manifolds, Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4826.468,
    "end": 4836.99,
    "text": "Physics by beliefs is saying, OK, if we begin with some information theoretic idea of Bayesian inference, do we get back the mechanics of systems carrying those beliefs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4838.311,
    "end": 4847.665,
    "text": " That relies on some work that I did earlier this year, which espoused a kind of duality between",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4849.352,
    "end": 4852.913,
    "text": " the free energy principle and maximum entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4853.713,
    "end": 4864.036,
    "text": "So using that as a kind of technology, you can flip the story and say, okay, if I start from an inferential principle, can I get physical stuff back?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4864.557,
    "end": 4871.879,
    "text": "Whereas the FEP is, I would think of it more as if I start with physical stuff, can I then understand the beliefs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4872.699,
    "end": 4874.279,
    "text": "They are two sides of the same coin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4875.44,
    "end": 4875.54,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4877.573,
    "end": 4881.455,
    "text": " On the nose, it's a very trivial symmetry between the two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4882.336,
    "end": 4887.099,
    "text": "Of course, it takes a lot more work to make it formally make sense, but in the end it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4887.679,
    "end": 4888.96,
    "text": "So that's section two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4890.101,
    "end": 4904.551,
    "text": "Section three moves us into the first idea of actual results in the paper is to say, okay, so if I have a classical system doing Bayesian inference or approximate Bayesian inference, what does that look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4904.771,
    "end": 4906.652,
    "text": "And does it look like the free energy principle?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4908.832,
    "end": 4924.596,
    "text": " And then conversely, if I have an inferential principle or if I have an informational physics, can I use MaxEnt as the dual to the FEP to get back the physical mechanics of this classical object?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4925.356,
    "end": 4926.956,
    "text": "And in both cases, the answer is yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4927.516,
    "end": 4932.437,
    "text": "And at the end of that section, I give an equation that does precisely that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4932.837,
    "end": 4934.898,
    "text": "It takes the idea of mode matching",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4936.199,
    "end": 4940.022,
    "text": " and says, okay, here is how probabilities behave when you do mode matching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4940.522,
    "end": 4948.189,
    "text": "And conversely, here is how modes behave when you minimize the free energy of those probabilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4950.396,
    "end": 4958.202,
    "text": " So in Section 4, I then talk about, okay, does this actually make sense in a physical setting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4958.342,
    "end": 4960.163,
    "text": "Does it tell us anything insightful?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4960.684,
    "end": 4969.531,
    "text": "Or is it just a tautology that if you build in a classical mode and then take the limit to the mode, then you get classical physics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4969.631,
    "end": 4972.813,
    "text": "If you phrase it just like that, it doesn't seem very remarkable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4973.314,
    "end": 4976.356,
    "text": "But for the reasons that I described about...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4977.697,
    "end": 4982.52,
    "text": " path integrals and the classical limit of the path integral, it becomes a little bit more subtle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4982.9,
    "end": 4993.166,
    "text": "And so we can actually derive something kind of interesting from the idea that classical stuff is the mode of quantum stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4993.867,
    "end": 5001.752,
    "text": "So in the classical limit of quantum mechanics, systems that do approximate Bayesian inference exhibit classical physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5003.471,
    "end": 5006.495,
    "text": " I think that's really the payoff of that section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5006.956,
    "end": 5019.052,
    "text": "And so it kind of justifies the rest of the set of questions that I ask, because it becomes not just a worked example, but it does say something interesting about physics more broadly, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5021.069,
    "end": 5023.81,
    "text": " Now we get into the application section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5023.87,
    "end": 5031.433,
    "text": "So once that's done, we cool off a little bit and we just do an example of what does it mean to do mode matching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5032.533,
    "end": 5034.334,
    "text": "This is simple enough to formulate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5035.494,
    "end": 5041.336,
    "text": "And you can see in this case, the mode, so mode matching is about stationary modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5041.837,
    "end": 5045.058,
    "text": "And it makes sense to talk about the classical physics of something at rest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5046.238,
    "end": 5047.719,
    "text": "Now things that are at rest,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5049.38,
    "end": 5049.86,
    "text": " don't move.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5050.62,
    "end": 5058.082,
    "text": "So synchronization, in this case, is matching a mode to a stationary environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5058.102,
    "end": 5060.422,
    "text": "So when a force is not acting on you, you don't move.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5060.862,
    "end": 5065.043,
    "text": "And this requires very little maths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5066.503,
    "end": 5076.545,
    "text": "And at the end, one of Newton's other laws pops out, that objects in motion stay in motion, objects at rest stay at rest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5079.013,
    "end": 5081.435,
    "text": " So you get that back from Section 5.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5081.495,
    "end": 5086.34,
    "text": "From Section 6, you can talk about modes that move.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5086.8,
    "end": 5089.303,
    "text": "Well, you can talk about systems that move.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5090.103,
    "end": 5099.572,
    "text": "And there's actually a finer distinction in there that I precipitated just saying, which is in one case, you can talk about...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5101.42,
    "end": 5108.848,
    "text": " a system that moves towards a mode, so a system that tracks a mode, but eventually finishes in a stationary place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5109.609,
    "end": 5113.914,
    "text": "And you can also talk about a system that chases a mode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5115.095,
    "end": 5117.478,
    "text": "So we call this infinite mode tracking, or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5119.251,
    "end": 5123.215,
    "text": " You could think of this as mode chasing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5123.275,
    "end": 5127.238,
    "text": "You could think of this as a primitive form of path tracking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5127.758,
    "end": 5133.463,
    "text": "It's just the idea that things that go around in a circle, you can look at it one of two ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5133.503,
    "end": 5135.585,
    "text": "You can look at it as an object.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5136.105,
    "end": 5143.672,
    "text": "And the example I use is satellite motion, so the classical physics of celestial bodies, say, one thing orbiting around another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5144.673,
    "end": 5159.59,
    "text": " You can either talk about this as a mode that is being tracked, that is constantly in motion, so you get infinite mode tracking, or you can talk about this as path tracking, where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5160.848,
    "end": 5163.39,
    "text": " the path is the circular path around the object.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5163.91,
    "end": 5166.012,
    "text": "And what we track is just that path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5166.993,
    "end": 5168.895,
    "text": "And that is what is in 7a.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5169.055,
    "end": 5175.46,
    "text": "So I say in 6b, you can talk about this example as infinite mode tracking, but it's kind of ugly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5175.6,
    "end": 5176.761,
    "text": "It doesn't work very well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5177.942,
    "end": 5183.947,
    "text": "So this justifies going to path tracking instead, which is a much more elegant picture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5184.367,
    "end": 5186.008,
    "text": "Conceptually, it makes a lot more sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5186.949,
    "end": 5204.798,
    "text": " And one of the problems specifically with 6b is that the idea of minimizing the surprisal of a mode becomes kind of difficult because this system is non-stationary, the mode is constantly moving, and so the surprisal is constantly fluctuating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5205.298,
    "end": 5209.18,
    "text": "But when you talk about the surprisal over paths, it's much easier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5209.22,
    "end": 5215.283,
    "text": "You can say, okay, we are actually genuinely minimizing the surprisal of paths because we are picking the path of least surprisal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5218.079,
    "end": 5219.486,
    "text": " one thing that I didn't include",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5220.62,
    "end": 5223.983,
    "text": " in this section, which is possibly interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5224.183,
    "end": 5230.127,
    "text": "And I don't know, one of the nice things about preprints is they are, to some extent, living documents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5230.247,
    "end": 5233.81,
    "text": "So I could come back and add this in if I was so inclined.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5233.87,
    "end": 5234.571,
    "text": "In fact, I might.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5236.032,
    "end": 5239.514,
    "text": "It's the idea of moving centers of mass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5240.135,
    "end": 5246.019,
    "text": "So path tracking combined with some kind of moving frame of reference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5247.2,
    "end": 5251.623,
    "text": " The reason why I didn't include this is because the maths for that is not quite worked out yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5252.923,
    "end": 5255.184,
    "text": "But since then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5257.983,
    "end": 5265.546,
    "text": " Lance da Costa and others in a paper that is probably about to be released.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5266.647,
    "end": 5274.45,
    "text": "It's co-authored between myself, Lance da Costa, Carl Friston, Thomas Parr, Connor Hines, and Greg Pavliatis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5275.07,
    "end": 5281.173,
    "text": "So all of the big mathematical minds behind the last few years of the FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5282.633,
    "end": 5285.395,
    "text": " I think I've named all the names.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5285.455,
    "end": 5288.217,
    "text": "If I forgot anyone, then you'll have to excuse me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5291.14,
    "end": 5299.368,
    "text": " There's some work in that paper that's about to be pre-printed that formulates path tracking in the context of moving frames of reference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5299.889,
    "end": 5305.034,
    "text": "So not just moving modes along a path, but also moving paths themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5305.854,
    "end": 5315.283,
    "text": "So one extra kind of layer of generalization is now you can talk about, okay, what about when the path that I'm tracking is itself moving?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5316.225,
    "end": 5322.397,
    "text": " And there is probably the machinery to handle that in this paper that's about to be released.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5323.258,
    "end": 5326.785,
    "text": "Again, it's Lance, it's Carl, it's Greg, Thomas, Connor, and myself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5329.881,
    "end": 5353.718,
    "text": " So keep an eye out for that, because there will be something about moving frames of reference in that paper, and I may decide to go back and add something like, if I'm orbiting a body that is itself in motion, so if the center of mass that I'm orbiting is itself orbiting around something else, what does that look like from the perspective of the thing in orbit?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5355.971,
    "end": 5357.812,
    "text": " That's an interesting case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5358.632,
    "end": 5366.395,
    "text": "It's something that I didn't include because it was still... I think there wasn't an elegant way forward with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5366.755,
    "end": 5367.596,
    "text": "Now there probably is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5369.156,
    "end": 5380.321,
    "text": "But carrying on, 7b is now relating the idea of path trackings, the idea of a surprisal over paths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5381.401,
    "end": 5403.644,
    "text": " relating that to the um path integral approach to uh basing mechanics and extracting some insights from what it means to be a path integral and one of the things that one is allowed to do in that context is to then develop a story about um classical chaos and i think uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5404.943,
    "end": 5407.865,
    "text": " We have probably some slides later about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5408.666,
    "end": 5410.548,
    "text": "That deserves a much longer conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5411.388,
    "end": 5416.192,
    "text": "But the idea of that section is to say, okay, so we've done all this arguably pretty trivial stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5417.233,
    "end": 5421.377,
    "text": "Now, what about interesting systems like systems that exhibit chaos?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5421.777,
    "end": 5424.679,
    "text": "Can we actually describe those things using Bayesian mechanics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5425.32,
    "end": 5433.727,
    "text": "And the answer is we can, and it comes out of the path integral description in the nice way that we have gestured at",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5434.167,
    "end": 5435.147,
    "text": " with the name G-theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5443.11,
    "end": 5443.39,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5443.97,
    "end": 5444.33,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.53,
    "end": 5444.911,
    "text": "Jakob?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5448.052,
    "end": 5454.314,
    "text": "I was waiting to ask this a bit later on, but since you mentioned reference frames, I'm wondering",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5455.575,
    "end": 5466.697,
    "text": " what different sorts of reference frame Bayesian mechanics deals with, especially in connection to recovering classical mechanics from Bayesian mechanics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5468.438,
    "end": 5473.319,
    "text": "The way I understand it right now, reference frame is basically imposed by the Markov blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5473.739,
    "end": 5483.301,
    "text": "So when we're talking about the tree branch performing inference over its environment and being shaken by the incoming wind,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5484.381,
    "end": 5489.105,
    "text": " that's from the reference frame of the tree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5489.806,
    "end": 5497.972,
    "text": "How would that be different if we considered our own reference frame looking at the tree?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5498.773,
    "end": 5502.536,
    "text": "Could that still have a formulation within Bayesian mechanics?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5502.896,
    "end": 5507.941,
    "text": "And also, how could this relate to multi-agent systems where we have the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5508.601,
    "end": 5520.708,
    "text": " classic example that comes to mind is clock synchronization, where pendulum clocks initially start out of phase, but over time go, again, in phase.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5522.448,
    "end": 5525.35,
    "text": "I think there's a lot of different ways to partition that system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5525.57,
    "end": 5535.996,
    "text": "One clock is performing inference over the other, is performing inference over the other, but then maybe we can also treat it as a coupled system altogether, where we consider both at the same time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5537.197,
    "end": 5548.833,
    "text": " So I'm thinking there might be some equivalent of like a non-inertial reference frame in Bayesian mechanics versus an inertial one given by the Markov blanket on that specific system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5549.835,
    "end": 5551.397,
    "text": "So I would be interested to hear your thoughts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5553.199,
    "end": 5556.002,
    "text": " Yeah, that's also a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5556.722,
    "end": 5568.231,
    "text": "So one of the things that you can begin to talk about in this setting is that, to some extent, the precise placement of a Markov blanket is a bit arbitrary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5569.352,
    "end": 5577.158,
    "text": "And this kind of flexibility is actually a good thing, because you do want to be able to nest blankets within blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5578.239,
    "end": 5581.201,
    "text": "There's reason to believe that that kind of multi-scale",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5583.371,
    "end": 5601.027,
    "text": " self-organization, well, that multi-scale patterning behavior, that multi-scale separation and being able to infer not only what my neighbors are doing, but being able to infer what the scale above me is doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5602.047,
    "end": 5607.848,
    "text": " There's reason to believe that that is where self-organization comes from under the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5608.588,
    "end": 5621.751,
    "text": "And one of the reasons to believe that is work by, for instance, Mike Levin in the context of the kind of cognitive nature of developing cells, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5622.431,
    "end": 5625.732,
    "text": "Cells that are in a kind of soup of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5626.932,
    "end": 5630.773,
    "text": "How do they know to develop into tissues?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5631.892,
    "end": 5646.078,
    "text": " There must be some kind of notion of nested blankets, not only knowing what am I in relation to others, but what are we in relation to a larger scale other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5646.879,
    "end": 5651.381,
    "text": "So that's very important, nesting blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5651.801,
    "end": 5658.524,
    "text": "Another really good example of this is in a paper by Maxwell, Alec Chance,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5659.464,
    "end": 5683.609,
    "text": " some other people that i don't remember offhand so i apologize uh called neural and phenotypic representations under the free energy principle and it's exactly the same sort of thing if you have a soup and they know something about themselves and also something about something at a higher level then uh you get self-organization so it's it's not just about um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5685.677,
    "end": 5695.88,
    "text": " kind of self-organization at the constituent level, but it's knowing something about the pattern that one is organizing into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5696.781,
    "end": 5698.421,
    "text": "And these are two good examples of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5698.481,
    "end": 5699.622,
    "text": "There are lots of others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5702.139,
    "end": 5710.606,
    "text": " So one imagines the arbitrariness of the Markov blanket is important because it allows you to nest things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5711.367,
    "end": 5714.11,
    "text": "More generally, it allows you to change context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5714.61,
    "end": 5721.176,
    "text": "And the context of information is kind of observer dependent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5724.03,
    "end": 5737.198,
    "text": " In a way, you do want to be able to introduce kind of arbitrary frames and get different kinds of contexts for a given observation set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5737.239,
    "end": 5743.402,
    "text": "You want to be able to reassign self and other and still get approximate Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5744.523,
    "end": 5747.525,
    "text": "This is what we would think of as a gauge theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5747.925,
    "end": 5751.848,
    "text": "It's a symmetry at the level of the system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5752.796,
    "end": 5765.604,
    "text": " that is not reflected in the physics of the system, by which I mean, you can make free changes at the level of the system that don't change the physics of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5766.184,
    "end": 5782.034,
    "text": "So in this case, it's the idea that we can change a reference frame, we can change the context of an inference, but it shouldn't change the idea that systems do approximate Bayesian inference, much in the same way that we can change the way we label coordinates in general relativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5782.574,
    "end": 5792.702,
    "text": " But it shouldn't change the idea that gravitation is the curvature of spacetime in some suitable sense that has to do with metric tensors that I won't talk too much about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5795.094,
    "end": 5807.209,
    "text": " So something like that is absolutely, I think, not only kind of useful, but is absolutely essential to not only making Bayesian mechanics make sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5807.65,
    "end": 5812.155,
    "text": "It would be kind of suspicious if inference just fell apart if you redrew the boundaries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5813.137,
    "end": 5819.045,
    "text": " especially given our conversation about the scale friendliness of the FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5819.786,
    "end": 5827.698,
    "text": "It should apply and reapply, but also that application and reapplication and contextualizing inferences within inferences",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5828.499,
    "end": 5838.425,
    "text": " is kind of right now what is reflected in the literature when we really think about, OK, how does self-organization work in these situations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5839.365,
    "end": 5842.747,
    "text": "And how does individuation work in these situations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5842.967,
    "end": 5844.228,
    "text": "Or how are patterns formed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5846.678,
    "end": 5856.24,
    "text": " And I think there's lots of work in this direction about reference frames and the contextuality of information outside the FEP as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5857.841,
    "end": 5864.802,
    "text": "And I happen to be familiar with very specific literature about this in category theory, but I'm sure it's more general than that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5865.643,
    "end": 5870.444,
    "text": "So you can talk about how does context shape an observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5871.184,
    "end": 5886.716,
    "text": " So yes, I think, yeah, on the subject of reference frames and synchronization, it's important to be able to redraw boundaries, to take new frames of reference and still get inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5887.456,
    "end": 5899.225,
    "text": "In the case of synchronizing pendulums, you can imagine, okay, maybe the pendulums do inference on each other, or maybe they do inference on the kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5900.146,
    "end": 5904.368,
    "text": " if they're on some sort of table or moving beam, maybe they do inference on the beam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5905.008,
    "end": 5907.029,
    "text": "And they synchronize with the beam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5907.309,
    "end": 5908.89,
    "text": "And therefore, they synchronize with each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5909.51,
    "end": 5910.23,
    "text": "That's one frame.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5910.51,
    "end": 5918.954,
    "text": "The other frame is one kind of looking at the rhythmic motions of the other one and just matching up like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5919.594,
    "end": 5921.195,
    "text": "In both cases, you get inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5922.135,
    "end": 5925.456,
    "text": "We probably prefer one reference frame or another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5926.977,
    "end": 5934.939,
    "text": " but both are in principle mathematically valid, even if they tell kind of different physical stories about what's being synchronized to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5936.899,
    "end": 5946.622,
    "text": "And the example of half-tracking in a moving frame of reference is interesting as well, because if you think about something like the Moon orbiting the Earth,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5949.068,
    "end": 5963.05,
    "text": " you can zoom way out and you can look at it as the moon spiraling around the earth as the earth goes around the sun, but you can also pick a reference frame where the earth is stationary and the moon is just orbiting around the earth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5964.84,
    "end": 5967.762,
    "text": " So this is the relativity of motion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5969.103,
    "end": 5977.17,
    "text": "Or if you want to imagine sitting in a train, it looks like the outside is moving and you're stationary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5978.411,
    "end": 5981.473,
    "text": "So that would be mode matching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5981.513,
    "end": 5982.114,
    "text": "You're not moving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5983.271,
    "end": 5988.832,
    "text": " But from the perspective of the outside, the train has just gone past pretty quickly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5989.512,
    "end": 5991.573,
    "text": "And you're in the train, and so you're moving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5992.593,
    "end": 5993.933,
    "text": "But from your perspective, you're not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5994.373,
    "end": 6003.115,
    "text": "So the relativity of what is being matched to is an important consideration for those reasons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6003.175,
    "end": 6009.537,
    "text": "Just to produce a consistent theory, we have to acknowledge that we can freely assign these inferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6012.138,
    "end": 6017.842,
    "text": " The important aspect is that we get the same inferences back, or at least we get inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6018.963,
    "end": 6022.145,
    "text": "They might not be the same inferences if you wrote them down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6022.565,
    "end": 6024.647,
    "text": "They might be in different coordinates, so to speak.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6025.147,
    "end": 6028.07,
    "text": "But at the end of the day, you should still get Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6029.391,
    "end": 6032.693,
    "text": "Now, I don't remember your second question, so you'll have to ask it again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6032.713,
    "end": 6037.757,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6039.082,
    "end": 6046.465,
    "text": " I'm actually not aware if there was a second question, but I do have a follow-up question to your answer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6047.125,
    "end": 6061.33,
    "text": "Since you mentioned nested Markov blankets, I'm just wondering whether in the formalism of Bayesian mechanics, we can also admit a kind of dynamics on the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6062.506,
    "end": 6085.773,
    "text": " topological structure of the of the blanket itself because in the case of cells forming other layers uh intuitively it seems to me that it's a kind of discrete way of thinking about how we're adding an extra layer of the markov blanket and maybe the markov blanket initially admits uh some uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6087.755,
    "end": 6103.125,
    "text": " some non-integer index connecting to your prior work on the weak Markov blankets, and then it evolves over time to form into actually statistically significant Markov blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6103.445,
    "end": 6112.611,
    "text": "But perhaps there might be also a way for having just one Markov blanket that evolves through time, and that might also change the inferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6112.711,
    "end": 6114.972,
    "text": "So I'm wondering whether...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6117.125,
    "end": 6131.992,
    "text": " mechanics, whether the dynamics of particular blankets can also be taken into account in the path tracking formulation or any other one within approximate Bayesian inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6133.226,
    "end": 6135.649,
    "text": " Yeah, so there are a couple of interesting things there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6136.65,
    "end": 6151.307,
    "text": "For one thing, the idea that perspective matters, the idea that you pick a reference frame and carve up your environment that way does kind of go back to this question of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6152.268,
    "end": 6157.631,
    "text": " How do we understand blankets forming in developing cells, say?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6158.412,
    "end": 6163.034,
    "text": "And the idea would be that blankets have characteristic scales.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6163.755,
    "end": 6175.142,
    "text": "The reason why we see something like a stone in nature and not a lattice of crystalline molecules is because at our level of observation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6175.922,
    "end": 6184.466,
    "text": " The blankets that allow these molecules to be self-organized is completely meaningless.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6185.126,
    "end": 6196.651,
    "text": "But what is interesting to our level of observation, our kind of canonical reference frame, is the stone itself, the blanket around the stone itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6196.731,
    "end": 6197.671,
    "text": "It's the stone's blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6197.691,
    "end": 6202.233,
    "text": "It's not the blankets that make the molecules that make the stone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6203.405,
    "end": 6221.497,
    "text": " So, yeah, you know, eventually we would want a much more complete theory of individuation that covers not just dynamical blankets, but nested blankets and blankets with perspective and things of that nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6222.138,
    "end": 6232.645,
    "text": "The perspective-based idea is an interesting one to me because it allows you to talk about things like sparse coupling at certain levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6233.906,
    "end": 6240.053,
    "text": " And if we acknowledge that the Markov blanket is coming to a blanket store near you, yeah, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6241.114,
    "end": 6245.599,
    "text": "If we acknowledge that the blanket is somewhat arbitrary, then we're free to say that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6247.277,
    "end": 6260.947,
    "text": " Any system with enough couplings has a blanket at some scale because the kind of multi-scale systems in physics that we're interested in at some scale are sparsely coupled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6261.708,
    "end": 6262.948,
    "text": "Probably not every scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6264.009,
    "end": 6270.553,
    "text": " And certainly within a blanket there's not sparse coupling, given a particular reference frame.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6271.194,
    "end": 6279.8,
    "text": "Because given the reference frame of myself looking at the stone, looking at the stone's blanket, within that blanket",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6280.956,
    "end": 6287.364,
    "text": " I would want to see the stone's molecules cohere in a way that is not sparsely coupled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6288.165,
    "end": 6289.626,
    "text": "Otherwise, I wouldn't see things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6290.187,
    "end": 6293.451,
    "text": "But then at the level of the stone, it is sparsely coupled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6293.851,
    "end": 6300.539,
    "text": "So this kind of arbitrariness allows us to actually do the carving up in a very interesting way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6301.821,
    "end": 6309.05,
    "text": " As for dynamical systems perspectives on Markov blankets, I think this is also possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6310.432,
    "end": 6316.139,
    "text": "I am working on something right now that takes the whole story about physical boundaries",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6317.418,
    "end": 6321.82,
    "text": " and conditional independence and writes it in terms of random variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6322.16,
    "end": 6325.241,
    "text": "So you have a whole suite of possible blanket states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6325.662,
    "end": 6334.406,
    "text": "And you can look at blankets kind of flickering on and off or blankets that occupy different states over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6336.464,
    "end": 6349.58,
    "text": " This is not nested yet, but it's one step towards that direction where you can think about how the blanket at a higher level turns on or off, given the dynamics of its constituents, whether they're cohering or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6352.283,
    "end": 6353.885,
    "text": "So yeah, maybe that answers your question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6355.984,
    "end": 6377.129,
    "text": " this is a great topic to chill on for a few more minutes in our final bit of the dot one there's really a lot here i'll just give a few dots and then ali happy to hear your perspective as well um you even discussed it as scale friendly but it's almost like a one and a half layer model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6378.189,
    "end": 6393.216,
    "text": " And that is actually preceded by even simple Bayesian hidden state observed variable distinctions, expectation maximization, just partially observable Bayesian models in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6394.056,
    "end": 6409.277,
    "text": " under an interpretation where observables are happening at a given scale of a system of interest and a hidden phenomena or a hidden cause is at a higher level of organization connects the sort of multi-scale systems approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6409.958,
    "end": 6412.28,
    "text": " with a self-organization approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6413.04,
    "end": 6416.843,
    "text": "And we've talked many times about that lateral and the vertical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6417.323,
    "end": 6424.348,
    "text": "There's the nest mates interacting laterally, and then there's the real or as if colony level organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6425.489,
    "end": 6437.518,
    "text": "Another point I think it's really interesting to pull out and explore is you discussed how important it is to be able to redraw blankets and still get inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6438.806,
    "end": 6451.818,
    "text": " it made me feel that there has to be some kind of a locally distributed, local sense-making process such that potentially a vast range of partitionings can also remain valid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6453.65,
    "end": 6475.758,
    "text": " can think of different metaphors there and uh that potentially the blanket provides exactly that partitioning surprise surprise and then moving towards all these features that had been in the uh spectator seats at the math conference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6477.711,
    "end": 6503.415,
    "text": " dynamical nested multi-perspective systems and the way that some of these formalisms are pointing towards an integration that's quite far out in some ways, yet also may bring an intuitiveness to a lot of the ways of talking about different physical systems, including the physics of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6504.376,
    "end": 6506.836,
    "text": "And as far as nature at the joints,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6508.424,
    "end": 6534.991,
    "text": " perspectives would be one not the only one but one of those joints or sparse connectivities or factorizabilities various ways of thinking about it but multiple entities engaging in a multi-perspectival multi-scale inference question it's like two people looking at the boat they might disagree on how to partition different parts of the boat or the boat from the water",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6536.178,
    "end": 6549.502,
    "text": " but at least their perspectives and their communication interface with each other and their observation inference interfaces with the boat could be specified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6550.282,
    "end": 6559.665,
    "text": "And so then it could be like my map of me, my map of you, my map of the boat, your map of you, your map of me, your map of the boat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6560.185,
    "end": 6563.486,
    "text": "And then there's a conversation with all six of those features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6564.326,
    "end": 6568.708,
    "text": " instead of us only looking at the boat and you did it one way, I did it differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6568.748,
    "end": 6569.888,
    "text": "And that's the end of the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6570.468,
    "end": 6582.012,
    "text": "So I think it's going to open up degrees of freedom in perspective, harmonizing that wouldn't be classically understood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6583.693,
    "end": 6588.835,
    "text": "And that'll be seen as extremely non-linear and unconventional behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6590.325,
    "end": 6591.806,
    "text": " And it just remains to be seen what that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6592.586,
    "end": 6593.027,
    "text": "I agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6594.127,
    "end": 6602.212,
    "text": "I'll take this opportunity to point out there are other people in the Versys lab who are thinking about that kind of question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6603.032,
    "end": 6609.576,
    "text": "How does collaboration and information synthesis and kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6610.376,
    "end": 6612.457,
    "text": " agreement or goal emergence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6612.997,
    "end": 6615.718,
    "text": "How do all these things fit into Bayesian mechanics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6616.899,
    "end": 6622.101,
    "text": "So people like Maxwell and Maholt are thinking about, if I write down",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6623.183,
    "end": 6648.744,
    "text": " know these kinds of problems uh is there a way to talk about agreement as it emerges through um you know collective discussions or collaboration and it is likely something um like this it's agreeing on a reference frame for our collective observations and and agreeing on you know not just sense making but it's agreeing on how to make sense of something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6649.304,
    "end": 6651.026,
    "text": " So there's a kind of two-step process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6651.187,
    "end": 6652.789,
    "text": "I learn something, figure it out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6653.229,
    "end": 6653.79,
    "text": "I tell you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6654.271,
    "end": 6657.495,
    "text": "You have your own picture of what this thing looks like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6657.895,
    "end": 6662.642,
    "text": "We agree on a picture that serves us best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6662.802,
    "end": 6665.025,
    "text": "We agree on a best reference for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6668.396,
    "end": 6668.656,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6669.937,
    "end": 6675.719,
    "text": "Agreeing on the sense made is deciding what to order after the dish has been cooked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6676.279,
    "end": 6676.579,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6676.599,
    "end": 6679.84,
    "text": "We need to have a conversation about the recipe and so many other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6680.741,
    "end": 6680.961,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6684.322,
    "end": 6696.427,
    "text": "Well, I believe this whole argument around Markov blankets and especially the nested Markov blanket or the dynamic nature of them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6698.473,
    "end": 6707.483,
    "text": " can potentially be connected to somehow the opposing stances, one of which is the preformism or preformationism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6708.124,
    "end": 6714.231,
    "text": "The other one is the progressive differentiation mechanism, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6716.863,
    "end": 6728.51,
    "text": " In the preformism, some people believe that the topology of the whole state-space manifold is completely preformed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6729.11,
    "end": 6735.214,
    "text": "We just don't have enough data to model that accurately, model the state-space accurately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6735.674,
    "end": 6740.517,
    "text": "But for the advocates of the progressive differentiation model,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6741.434,
    "end": 6756.766,
    "text": " viewpoint, they, on the other hand, believe that it literally goes, I mean, the state space manifold literally goes, undergoes lots of transformations, according to the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6759.588,
    "end": 6766.872,
    "text": " I mean, some inflection points or some singularities, and it's not preformed at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6767.112,
    "end": 6773.556,
    "text": "And the dynamic nature of the state-space manifold is something inherent to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6773.656,
    "end": 6777.919,
    "text": "It's not because of our lack of enough data to model that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6778.499,
    "end": 6785.384,
    "text": "So I'm not sure how much you agree with that viewpoint, but yeah, the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6786.224,
    "end": 6811.75,
    "text": " something that's... Yeah, I think, sure, I think the kind of drawing and redrawing of Markov blankets is probably a point in support of the idea of progressive differentiation because at one level we think of drawing and redrawing as development or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6813.302,
    "end": 6814.102,
    "text": " Well, yes, development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6814.222,
    "end": 6817.723,
    "text": "And one of the things that drives development is something like fitness pressure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6818.323,
    "end": 6826.925,
    "text": "So fitness changes the constraints on what sort of patterns are available to you, what ought you organize into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6827.825,
    "end": 6832.846,
    "text": "And these are not things that we know a priori at the level of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6833.826,
    "end": 6842.488,
    "text": "It may be possible that if you write down a whole kind of a world model of the entire universe from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6843.462,
    "end": 6846.788,
    "text": " you know, the very first point in time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6848.562,
    "end": 6864.39,
    "text": " after the Big Bang, or maybe even at the instant at which the singularity expanded, and you had enough computational power to trace it all through, that you could get to something like, what is it, Preformationism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6865.651,
    "end": 6873.314,
    "text": "But that strikes me quite a lot as a kind of super determinism or determinism argument.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6873.334,
    "end": 6875.575,
    "text": "It sounds a lot like some kind of...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6876.996,
    "end": 6881.502,
    "text": " argument that, you know, there is no uncertainty in how you will develop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6882.003,
    "end": 6888.21,
    "text": "There is just uncertainty in what you're aware of as to your development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6890.327,
    "end": 6897.553,
    "text": " or some kind of hidden variables theory that says there is something mediating the way your state space looks, you just don't know it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6897.874,
    "end": 6899.535,
    "text": "And so you have the illusion of free will.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6900.476,
    "end": 6902.658,
    "text": "So this becomes a bit of a philosophical question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6903.539,
    "end": 6905.941,
    "text": "I myself don't really buy into determinism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6906.481,
    "end": 6909.183,
    "text": "So I would be tempted to say that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6909.924,
    "end": 6917.469,
    "text": " The Markov blanket story, especially dynamic blankets or however you want to call them, are to do with progressive differentiation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6917.729,
    "end": 6927.496,
    "text": "As we live our lives, we draw and redraw our own blankets as we mesh and individuate ourselves from other systems and the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6928.496,
    "end": 6931.939,
    "text": "And this is something that we are in control of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6932.779,
    "end": 6935.925,
    "text": " Certainly locally in the state space, we're in control of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6936.987,
    "end": 6942.276,
    "text": "Whether there is some hidden variable guiding our own actions is something that is...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6944.056,
    "end": 6945.797,
    "text": " I think, strictly speaking, a different question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6946.718,
    "end": 6952.462,
    "text": "The nice thing about it is, whether it's true or not, it doesn't break the locality of the Markov blanket construction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6952.922,
    "end": 6960.307,
    "text": "So we get this idea of locally progressive differentiation as a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6960.687,
    "end": 6965.89,
    "text": "And then when we zoom way out, it may be kind of a different story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6966.851,
    "end": 6972.615,
    "text": "But certainly, yeah, locally, it works as this kind of dynamic process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6974.787,
    "end": 6976.229,
    "text": " Well, we almost got to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6978.512,
    "end": 6980.114,
    "text": "This was an awesome discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6980.254,
    "end": 6984.539,
    "text": "So, Ali and Jakob, if you would like to have any closing remarks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6988.224,
    "end": 6989.606,
    "text": "Well, I just want to say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6993.403,
    "end": 7008.097,
    "text": " I truly enjoyed our discussion today, and I very much look forward to that too, because I have a bunch of questions that I didn't have a chance to ask about some of the sections of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7008.518,
    "end": 7015.865,
    "text": "So I just wanted to thank Dalton for his time and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7017.975,
    "end": 7028.081,
    "text": " Also for Jakob and Daniel for organizing these extremely fruitful and useful discussion sessions and live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7028.661,
    "end": 7032.103,
    "text": "So yeah, I'm very much looking forward to the next one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7033.424,
    "end": 7034.124,
    "text": "Thank you, Jakob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7036.095,
    "end": 7039.077,
    "text": " Yeah, this was an amazing .1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7039.117,
    "end": 7048.902,
    "text": "Thanks a lot, Dalton, for all the great answers and overviews.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7050.003,
    "end": 7056.647,
    "text": "Of course, Ali and Daniel for doing bulk of the work on the slides.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7057.407,
    "end": 7060.009,
    "text": "And yeah, looking forward to the .2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7060.429,
    "end": 7063.971,
    "text": "Dalton, any last thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 7065.607,
    "end": 7068.068,
    "text": " No, just thank you for having me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7069.229,
    "end": 7070.289,
    "text": "I did really enjoy it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7070.729,
    "end": 7073.851,
    "text": "And thank you, of course, for all of the background work that you put in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7075.391,
    "end": 7085.196,
    "text": "It's, as I said, it's very flattering to see such detailed working through of my work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7085.596,
    "end": 7086.616,
    "text": "So thank you for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7087.597,
    "end": 7090.178,
    "text": "And I am looking forward to the next episode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7091.573,
    "end": 7091.894,
    "text": " Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7091.914,
    "end": 7098.542,
    "text": "Well, next week, us and anyone else who'd like to join, just get in touch or submit any questions or topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7098.622,
    "end": 7100.044,
    "text": "So thank you, fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7100.144,
    "end": 7100.544,
    "text": "See you later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7100.564,
    "end": 7103.228,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7103.708,
    "end": 7103.949,
    "text": "Cheers.",
    "speaker": "SPEAKER_02"
  }
]