[
  {
    "start": 26.783,
    "end": 27.364,
    "text": " Hello everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 27.884,
    "end": 28.225,
    "text": "Welcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 28.665,
    "end": 30.888,
    "text": "It's ACT-INF live stream number 49.2 on October 12th, 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 36.001,
    "end": 60.59,
    "text": " welcome to the active inference institute we're a participatory online institute that is communicating learning and practicing applied active inference you can find us at some of the links on the page this is a recorded and an archived live stream so please provide feedback so we can improve our work all backgrounds and perspectives are welcome and we'll be following video etiquette for live streams",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 62.096,
    "end": 68.958,
    "text": " Head over to ActiveInference.org to learn more about the kinds of projects and learning groups you can get involved in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 70.699,
    "end": 84.064,
    "text": "And we're here in stream number 49.2 in the third video of our explorations of the paper, A Worked Example of the Bayesian Mechanics of Classical Objects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 84.724,
    "end": 90.366,
    "text": "In the dot zero, Jakob and Ali and I provided some background and context, then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 91.326,
    "end": 111.233,
    "text": " last week in 49.1 with dalton we all convened and we had a great discussion and went through a lot of that context again and that set us up very well today for 49.2 to be primarily going through the paper which is very exciting so we'll begin with just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 112.253,
    "end": 133.874,
    "text": " saying hello and anything else we'd like to add on this wednesday and then we will head right in so i'm daniel i'm a researcher in california and i guess i'm excited to get to the paper and understand what points are touched upon and why and i'll pass to jakob",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 136.752,
    "end": 137.732,
    "text": " Hello, I'm Jakob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.932,
    "end": 151.237,
    "text": "I'm a student in the UK and I'm excited to talk about the different faces of Bayesian mechanics, how they are related, how they are different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.897,
    "end": 152.938,
    "text": "I'll pass it to Ali.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 155.779,
    "end": 156.759,
    "text": "Hello, I'm Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.859,
    "end": 158.8,
    "text": "I'm an independent researcher from Iran.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.66,
    "end": 162.301,
    "text": "Again, I'm very excited to be here as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.65,
    "end": 166.951,
    "text": " Last week, we had a truly amazing discussion with Dalton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.991,
    "end": 172.653,
    "text": "I'm very much looking forward to continue our journey through this fascinating paper today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.673,
    "end": 185.398,
    "text": "I also have a bunch of questions I'd like to ask, especially when we come to section four on quantum ontology, and I'll pass it to Dalton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.59,
    "end": 188.231,
    "text": " Okay, well, I'm Dalton.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.051,
    "end": 194.915,
    "text": "I'm a mathematician and a physicist currently based at Stony Brook University.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.435,
    "end": 205.981,
    "text": "I'm also at the Versys Lab where a large part of my research program right now is to do with the maths and physics of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.901,
    "end": 210.063,
    "text": "So I'm pleased to be here and thank you for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.623,
    "end": 213.765,
    "text": "I'm happy to get the conversation underway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.946,
    "end": 227.893,
    "text": " Well, we've looked previously at the roadmap, so let's just take one last glimpse at our map before we go white knuckle on the steering wheel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 229.254,
    "end": 239.421,
    "text": "Maybe just one overview, Dalton, if you could provide what sections are addressed and what is the general anatomy and physiology of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.911,
    "end": 241.391,
    "text": " Yeah, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 242.492,
    "end": 259.443,
    "text": "So as we were talking about last time, the structure of the paper partially reflects the environment that it was written in, in a way that is or has come to characterize the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.924,
    "end": 262.765,
    "text": "So it's kind of funny in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.546,
    "end": 288.416,
    "text": " One of the things that was a kind of unmet need was a nice paper relatively contained that drew together some of the recent ideas that have been written in the past six months or so about what we've called Bayesian mechanics and there are a few key papers that are then kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.511,
    "end": 296.697,
    "text": " summarized and put on stage in the first maybe four sections.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 297.518,
    "end": 309.387,
    "text": "And then sections five through seven are actually taking all of that summary and putting it into a worked example of what Bayesian mechanics looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.728,
    "end": 312.27,
    "text": "So we have a lot of rigorous development",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.21,
    "end": 327.839,
    "text": " To begin with, and then we actually use some of that in the wild and show okay so if you're actually to treat this algorithmically and go and compute something using this framework, what would it look like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 328.759,
    "end": 334.924,
    "text": " So in a way, it's kind of split roughly along mathematical and physical lines, if you'd like to think of it that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.624,
    "end": 346.372,
    "text": "Mathematicians really like foundational, rigorous stuff, and then physicists really like to be able to compute things and say something about models of the physical world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.353,
    "end": 355.078,
    "text": " So in a way, it's trying to meet both of those kind of metological needs, and that's the reason why it's structured this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.019,
    "end": 369.407,
    "text": "So as we go through, you'll see at some point there's a bit of a phase transition where we go from here are all the basic ingredients, here are what they mean, and how they ought to be used, to here is how we actually use them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.549,
    "end": 375.151,
    "text": "We'll keep an eye out for that time post.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 376.5,
    "end": 405.692,
    "text": " and we'll be paying attention to the equations as part of our preparatory work here it just um those on the live stream will see a subset of our coda page where we have all of the equations and some awesome annotations by ali so we'll be able to look at the paper and also bring in some pre-screenshotted formalisms and we'll uh journey forth so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 407.011,
    "end": 419.44,
    "text": " beginning with the introduction what did you aim to set up in the introductions what did you enter what did you want people to have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 421.565,
    "end": 424.666,
    "text": " prepared or their state when they entered the introduction and leave it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.266,
    "end": 428.507,
    "text": "And also I'm a little curious about the acknowledgements at the end of the first section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 429.328,
    "end": 429.648,
    "text": "Of course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 430.308,
    "end": 430.768,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 430.808,
    "end": 437.61,
    "text": "So if you go and it might benefit me to have a copy of this in front of me as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.71,
    "end": 440.151,
    "text": "So give me one moment to bring that up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.411,
    "end": 459.498,
    "text": " But one of the things that I wanted to do with the introduction was really roadmap exactly what I had just described, which is that in the last couple of years, and especially the last six months, there's been a lot written about this thing called Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.978,
    "end": 468.963,
    "text": " And it is a bit of a different take on what has traditionally been written as the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.384,
    "end": 477.208,
    "text": "So if you're in the active inference literature or if you're in the predictive processing literature, this is probably new to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.749,
    "end": 482.452,
    "text": "And likewise, if you are if you're coming from conventional stochastic process theory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.332,
    "end": 489.098,
    "text": " then you're probably not familiar with the specific technique or philosophy underlying Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.359,
    "end": 490.72,
    "text": "So that's probably new to you as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.381,
    "end": 496.426,
    "text": "So the idea of the introduction is just to set out, okay, here is Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.307,
    "end": 503.634,
    "text": "We've talked a lot about it in these previous papers, and it was probably time to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.915,
    "end": 514.724,
    "text": " set out in detail what is it and why are we interested in it and how do we use it which is of course later on in the papers the work example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 515.625,
    "end": 529.879,
    "text": "So in the beginning of the introduction I just lay out okay here is what we have called Bayesian mechanics and here is under what circumstances is it useful which introduces the idea of synchronization in the first and second paragraphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 531.87,
    "end": 545.354,
    "text": " And then in the third paragraph on the third page, well, the third paragraph, the first one on the third page, I describe this idea that there hasn't really been a kind of worked example of this yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.954,
    "end": 554.476,
    "text": "So some of the theory has been worked out in previous papers, some of them mine, some of them...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.517,
    "end": 584.366,
    "text": " are uh co-authored with other people some of them are from uh carl's group at the welcome center at ucl but but in all of those um papers they're primarily theoretical uh except for certain uh kind of algorithmic papers mostly out of the control theory literature so it is worth complementing this unified view that i try and describe uh taking in the introduction with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 585.166,
    "end": 593.429,
    "text": " an application of that unified view, if for no other reason than to give it some concrete particulars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 594.529,
    "end": 605.032,
    "text": "So that's actually a phrase from category theory, which is probably appropriate, given that category theory is very interested in the general and the abstract",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.437,
    "end": 611.638,
    "text": " and not so much in the concrete particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.639,
    "end": 621.462,
    "text": "In fact, I think that was a phrase from Lovaire, who's one of the most famous, well-known category theorists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.022,
    "end": 635.567,
    "text": " So it is kind of appropriate, and that part of the motivation for at least the second half of the paper is to say, okay, we've done all this theory work, and we've laid out, here's precisely what this thing, Bayesian mechanics, is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.727,
    "end": 638.248,
    "text": "And then to give it some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 639.328,
    "end": 657.439,
    "text": " kind of meat to grab onto if you're someone that likes to actually write models or understand how to shuffle symbols around in an equation and really work with things, then here is something for you that will actually kind of make things make sense to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.215,
    "end": 659.555,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 660.076,
    "end": 677.437,
    "text": "And yes, this is quite, not an indictment, but just reflecting the very rapid pace of development that much has been discussed around the role of Bayesian mechanics as a conceptual integrator or unifier, yet",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 679.249,
    "end": 683.11,
    "text": " the concrete particulars remained to be demonstrated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 683.13,
    "end": 684.611,
    "text": "Of course, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 684.671,
    "end": 688.832,
    "text": "And as you say, it's not an indictment because there is a place for both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.713,
    "end": 695.575,
    "text": "And of course, I'm biased coming from a very strong mathematical background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.535,
    "end": 702.057,
    "text": "But I think it is better to go with the more general, more abstract.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 702.957,
    "end": 707.019,
    "text": "And it's better to build theory rather than just deploy it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.659,
    "end": 712.601,
    "text": " But it's I mean, there's room for both and they serve different needs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 713.081,
    "end": 726.246,
    "text": "So doing exclusively one or the other is, in my opinion and in my research, not the best way to approach a problem because you need to be able to build the techniques that solve the problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.626,
    "end": 729.787,
    "text": "Then you also need to use them to solve problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.208,
    "end": 732.688,
    "text": "So, yes, not an indictment, but.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 734.95,
    "end": 745.537,
    "text": " maybe a striking observation that there's been a lot of the abstract stuff and maybe something more concrete has been missing historically in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.058,
    "end": 747.398,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 747.759,
    "end": 756.785,
    "text": "And then any thoughts on the last paragraph or the unusual positioning of the acknowledgements paragraph?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 759.878,
    "end": 760.94,
    "text": " No thoughts on the last one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.96,
    "end": 771.697,
    "text": "I think the last one just draws all of those ideas together and also says one of the reasons why this approach is interesting is it recovers some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.705,
    "end": 779.168,
    "text": " things of independent mathematical interest, which is what I gesture at in the last sentence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.129,
    "end": 785.03,
    "text": "I put all of my acknowledgements at the end of the introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.231,
    "end": 797.036,
    "text": "I think that's just something that I developed, a quirk maybe, although I think it's common, well, it's relatively common in mathematical papers to put the acknowledgements right after the introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.256,
    "end": 808.384,
    "text": " So, well, unusual maybe with respect to other fields that I think put it after the conclusion or after the last section and before the references.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.186,
    "end": 810.886,
    "text": "I like it there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.946,
    "end": 817.131,
    "text": "I like it right after the introduction because I think it gives credit more visibly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.432,
    "end": 826.376,
    "text": " Mathematical writing is kind of unique in that often you are writing alone, but thinking together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.076,
    "end": 837.141,
    "text": "And so the end product, the paper itself is not always reflected and in fact is rarely reflective of the mathematical thinking that went into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.602,
    "end": 840.923,
    "text": "So it's good to front load that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 840.983,
    "end": 846.266,
    "text": "It's good to say straight away, here are the people that I thought about this problem with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.946,
    "end": 857.776,
    "text": " And that's what went into this paper, contributions, intellectual contributions from all of these people that I had conversations with or bounced ideas off of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.557,
    "end": 862.3,
    "text": "And so the acknowledgments is right there in the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.041,
    "end": 864.362,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.682,
    "end": 865.362,
    "text": "Makes a lot of sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.924,
    "end": 867.885,
    "text": "Okay, so...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.269,
    "end": 888.688,
    "text": " into section two on mechanics so for each section i'll just kind of start up a new page and we can bring in equations and quotations as seen fit so let's just begin with section 2a classical physics in one dimensions why start here and what does this section say",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 889.721,
    "end": 899.084,
    "text": " Yeah, so section 2A is just a very brief summarization of what is classical mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 900.204,
    "end": 902.465,
    "text": "So this is important for two reasons, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.825,
    "end": 911.008,
    "text": "One is it allows me to talk a little about the basic building blocks that I'm going to use in the second section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.348,
    "end": 912.712,
    "text": " excuse me, second half of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.674,
    "end": 916.522,
    "text": "So we start off on a point of familiarity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 918.006,
    "end": 920.011,
    "text": "And if not, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.264,
    "end": 930.728,
    "text": " You know, all of that is built up so that later on the rest of the paper is at least referencing something that has already been discussed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.669,
    "end": 936.771,
    "text": "So just in terms of layout, it makes sense to get these preliminaries done first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 937.892,
    "end": 945.615,
    "text": "The other thing is, of course, one of the points of the paper, or at least one of the motivations, is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.316,
    "end": 952.438,
    "text": " Bayesian mechanics is a mechanical theory just like any other mechanical theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.378,
    "end": 962.682,
    "text": "And so to really make that analogy come across, it was good to investigate, OK, well, what are mechanical theories?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.722,
    "end": 963.542,
    "text": "What does that really mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.383,
    "end": 969.785,
    "text": "So in the context of classical mechanics, what do we mean by the interaction of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.285,
    "end": 982.112,
    "text": " stationary action principles and laws of motion and dynamics and all these things that we talked about in the previous episode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.974,
    "end": 986.135,
    "text": "What do all those look like in classical mechanics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.856,
    "end": 993.0,
    "text": "And then the kind of the metallurgical point of the paper in some sense is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.874,
    "end": 994.354,
    "text": " Well, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.374,
    "end": 1009.566,
    "text": "You could argue that this is the point of the paper, is to make the analogy precise, to point out that, OK, all these things that live in Bayesian mechanics are things that live in mechanical theories that map onto something like classical mechanics, and that you can prove this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.666,
    "end": 1019.674,
    "text": "So really, in some sense, the paper is an extended exercise in proving that that map between something that we know very well and something that we maybe don't exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.335,
    "end": 1035.883,
    "text": " But I would argue at least that that's only window dressing, the real point of the paper being proving stuff about Bayesian mechanics and classical mechanics is just a useful analogy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.864,
    "end": 1039.866,
    "text": "But I think the way it's shaped up, it kind of does both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.886,
    "end": 1044.108,
    "text": "And you could argue that, yeah, it does one or the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.758,
    "end": 1048.04,
    "text": " with one in service of the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1048.4,
    "end": 1053.304,
    "text": "But how that relationship goes, I think, is maybe open to interpretation, just the way that the paper evolved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1054.425,
    "end": 1061.711,
    "text": "Regardless, the reason why we start with classical physics is to put all those pieces on the board so that later on we can go and use them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.57,
    "end": 1063.87,
    "text": " Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1064.391,
    "end": 1073.741,
    "text": "So equation 1 and 1.1, just using a decimal point to reflect unnumbered formalisms that follow a numbered formalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1075.002,
    "end": 1079.166,
    "text": "Where do we get on the first page with these equations 1 through 2?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1080.287,
    "end": 1080.508,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.327,
    "end": 1086.851,
    "text": " Equation one is starting really from the very basics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.371,
    "end": 1089.393,
    "text": "So this is the action functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.135,
    "end": 1097.46,
    "text": "And in particular, it's the action functional for classical mechanics in the Lagrangian setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1099.902,
    "end": 1100.422,
    "text": "Equation 1.1",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.652,
    "end": 1110.762,
    "text": " is the result of finding the path of least action or the stationary action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1112.024,
    "end": 1120.655,
    "text": "So mathematically, the way that is done is by finding what's called the Euler-Lagrange equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1122.136,
    "end": 1123.477,
    "text": " And that's what this is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.557,
    "end": 1131.882,
    "text": "So if you apply the Euler-Lagrange equation to the action, then 1.1 is the result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.623,
    "end": 1140.988,
    "text": "And what is interesting about that is that gives you back Newton's second law, F equals MA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.008,
    "end": 1147.012,
    "text": "And the reason why is because the derivative of V with respect to Q",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.692,
    "end": 1152.915,
    "text": " So the gradient of a scalar potential is a force acting on something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.775,
    "end": 1162.619,
    "text": "And the Euler-Lagrange equation tells us that that force is equal to the mass times the time derivative of velocity, which is the acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.26,
    "end": 1183.739,
    "text": " So the chain of reasoning goes that beginning from an optimization principle, you get a law of motion, and that that kind of embodies classical mechanics in the case when you begin from the classical action and you get Newton's second law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.2,
    "end": 1206.769,
    "text": " So the idea is, and the reason why this is mentioned, is it calls back the reasoning in the paper on Bayesian mechanics, Physics of and by Beliefs, I think is the full title, which tells us that in the same way that this exists in classical physics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.605,
    "end": 1212.987,
    "text": " Bayesian mechanics has its own analogy to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.067,
    "end": 1224.072,
    "text": "So if we want to regard this as a kind of informational physics, then we can begin with some kind of action functional, in this case the surprisal, or the free energy functional, depending on the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1224.952,
    "end": 1225.792,
    "text": "And then somehow...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.523,
    "end": 1234.704,
    "text": " the thing that optimizes that is a law of motion that describes some kind of dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.604,
    "end": 1240.845,
    "text": "And in the informational or Bayesian case, that is approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.086,
    "end": 1254.828,
    "text": "And then once you have that law of motion, you can start plugging things in and get dynamical theories based on certain boundary conditions, like the initial conditions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1255.528,
    "end": 1258.791,
    "text": " or data about what these symbols actually mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.811,
    "end": 1264.895,
    "text": "So in the classical case, you're wondering, okay, what is precisely the potential that I'm interested in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.955,
    "end": 1265.875,
    "text": "What is the mass?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.336,
    "end": 1268.537,
    "text": "What is the initial velocity and position?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.498,
    "end": 1274.782,
    "text": "And in Bayesian mechanics, you might be interested in, okay, where is the boundary for the Markov blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1275.842,
    "end": 1277.643,
    "text": " What do my internal states mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1278.523,
    "end": 1281.285,
    "text": "So what kinds of systems am I actually interested in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1282.065,
    "end": 1283.346,
    "text": "What are they doing inference over?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.386,
    "end": 1286.327,
    "text": "So what is the environmental states they're trying to infer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.907,
    "end": 1288.628,
    "text": "Or at least what do they look like to the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.768,
    "end": 1297.312,
    "text": "And so once you do that, you can start getting from this general law of motion, this general approximate Bayesian inference idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1298.412,
    "end": 1303.937,
    "text": " you can get actual dynamical things and models of real situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.777,
    "end": 1318.308,
    "text": "And so the reason why that's kind of nice is because then the whole last half of the paper is exactly, well, what does it mean to produce a dynamical system out of this law of motion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.688,
    "end": 1320.87,
    "text": "I have this very general idea of approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.27,
    "end": 1324.113,
    "text": "What does it mean to actually start writing down models of things?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.394,
    "end": 1327.135,
    "text": "And it is precisely the worked example",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1327.655,
    "end": 1330.138,
    "text": " in the latter half of the paper that gives you that back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.599,
    "end": 1331.9,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1332.24,
    "end": 1333.662,
    "text": "Jakob, Orly, anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.442,
    "end": 1335.343,
    "text": "Or we'll continue 2B?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1338.787,
    "end": 1343.272,
    "text": "Well, not for now, but I'll definitely have some questions later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.313,
    "end": 1344.593,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1345.474,
    "end": 1345.894,
    "text": "Classic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1346.215,
    "end": 1348.457,
    "text": "Section 2B or not 2B question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.018,
    "end": 1349.538,
    "text": "But let's go 2B.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1351.424,
    "end": 1352.845,
    "text": " Yes, that's always good, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.147,
    "end": 1362.333,
    "text": "In this section, it is basically running through the same reasoning at a very high level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.155,
    "end": 1371.081,
    "text": "And so this subsection 2b is all about, okay, what is Bayesian mechanics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.301,
    "end": 1374.564,
    "text": "What do we mean by Bayesian mechanics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.344,
    "end": 1377.706,
    "text": "And in a way, it is kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1379.873,
    "end": 1391.521,
    "text": " it plays on this theme of the paper I just mentioned, this On Bayesian Mechanics paper very nicely, because this gives us, okay, here are the basics of what we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.541,
    "end": 1394.524,
    "text": "Here are all the important ingredients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.424,
    "end": 1403.11,
    "text": "And then the subsections that follow are trying to build out, okay, what do we mean by it's a physics of beliefs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1404.574,
    "end": 1407.176,
    "text": " And then what do we mean by it's a physics by beliefs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.596,
    "end": 1412.499,
    "text": "Because both of these are kind of imprecise terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.799,
    "end": 1423.346,
    "text": "And so defining these phrases in a way that is a little more enlightening is a nice way of fleshing out this section and the contributions of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.906,
    "end": 1427.929,
    "text": "So 2B is about the basics of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.729,
    "end": 1429.57,
    "text": "And it just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1430.43,
    "end": 1432.071,
    "text": " kind of introduces the idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.512,
    "end": 1435.414,
    "text": "What do we want from Bayesian mechanics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1435.514,
    "end": 1438.237,
    "text": "What is it trying to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1438.477,
    "end": 1440.799,
    "text": "How does it fit into the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.579,
    "end": 1443.521,
    "text": "How does it fit into stochastic process theory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.702,
    "end": 1453.109,
    "text": "And so you'll see in this section, a lot of it is just building up the idea that systems that minimize surprisal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.73,
    "end": 1480.288,
    "text": " as the kind of law or the optimization principle that they follow exhibit a kind of law of motion like Newton's law and its approximate Bayesian inference and that that follows from this reasoning about things that synchronize and minimize surprisal do approximate Bayesian inference about the parameters of the probability density of the system to which they're coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.569,
    "end": 1484.833,
    "text": " So a lot of this section is just the very fundamentals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.573,
    "end": 1494.943,
    "text": "And we can go through, I think, equation by equation and maybe clarify what those things mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.704,
    "end": 1498.106,
    "text": "That might be a good way of extracting some insight from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1498.166,
    "end": 1502.33,
    "text": "So this is exactly what I was describing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1502.971,
    "end": 1504.132,
    "text": "What are the kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.996,
    "end": 1509.826,
    "text": " important ingredients, what's the basic setting of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.409,
    "end": 1512.412,
    "text": "And you'll see on...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.154,
    "end": 1524.276,
    "text": " Equation on, what is it, page five in equation three, we begin just from a stochastic differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.796,
    "end": 1539.4,
    "text": "So this is some kind of random variable that evolves through time according to not only a drift, so some kind of average path or vector field on time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.2,
    "end": 1546.924,
    "text": " the value of the random variable at a given time, but also this noise term at the other end of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.226,
    "end": 1554.669,
    "text": "So these are modeled on what we call controlled rough paths in stochastic process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.129,
    "end": 1560.193,
    "text": "And so you can think of this as just an ordinary differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.073,
    "end": 1563.135,
    "text": " with an incoming signal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.016,
    "end": 1565.818,
    "text": "And the signal is the noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.958,
    "end": 1570.842,
    "text": "It's this DW thing is what's called a Wiener process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.942,
    "end": 1571.703,
    "text": "It's just white noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.664,
    "end": 1578.47,
    "text": "So you have your differential equation, and then you have some kind of random signal coming into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.091,
    "end": 1589.497,
    "text": " The idea of stochastic process theory is, okay, how do we make sense of the kind of equation that we're looking at here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.437,
    "end": 1593.319,
    "text": "And in particular, you know, there are a couple of ways of making sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.879,
    "end": 1602.905,
    "text": "One of the interesting ones is looking at as this thing produces trajectories, so random sample paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.152,
    "end": 1613.877,
    "text": " how do we understand the statistics of those sample paths and thereby understand something about what the system is doing at an ensemble level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.598,
    "end": 1626.864,
    "text": "One of the ways of doing that, and this gets into the next page and the following equations, is by understanding, okay, so what is the probability of a path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.263,
    "end": 1635.089,
    "text": " And that's equation five, but that needs some machinery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1635.129,
    "end": 1639.473,
    "text": "We can't just fabricate kind of arbitrary probability over paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1639.913,
    "end": 1640.934,
    "text": "So where do we get that from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.955,
    "end": 1649.082,
    "text": "And that comes from a least action principle, just the same as it did in classical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.794,
    "end": 1665.742,
    "text": " So that's really the, I think, primary point of this section is just to begin with, or at least one of the primary points of this section is just to begin with, already some of the analogies is taking shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.542,
    "end": 1669.425,
    "text": " because we begin from a least action principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.865,
    "end": 1675.77,
    "text": "So S is, again, an action functional, just like it was in the previous subsection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.671,
    "end": 1682.916,
    "text": "And omega is a realization of noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.157,
    "end": 1691.123,
    "text": "You can imagine it as just being one of these incoming signals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.283,
    "end": 1694.486,
    "text": "So what is the noise that I'm putting into the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.467,
    "end": 1698.73,
    "text": " And of course, that's where your randomness is coming from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.591,
    "end": 1711.883,
    "text": "So that's what we're interested in when we're interested in probabilities over paths, is really how does a realization of noise or a configuration of noise affect the underlying sample path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.966,
    "end": 1715.968,
    "text": "And that comes from...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.941,
    "end": 1719.481,
    "text": " this action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.641,
    "end": 1729.983,
    "text": "So the probability is just kind of the exponentiation of this thing, which comes from stochastic process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1731.443,
    "end": 1736.284,
    "text": "The same thing arises in the path integral formulation of quantum physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1736.964,
    "end": 1744.906,
    "text": "So in that context, we're often interested in what is the transition probability of a particle through spacetime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.866,
    "end": 1757.273,
    "text": " So that's nothing but asking, what is the probability that a particle moves from point A to point B, given a particular fixed initial point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.833,
    "end": 1761.915,
    "text": "What is the probability that it takes a particular path from A to B?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1762.555,
    "end": 1767.798,
    "text": "So path integrals are like path probability densities, or at least they produce these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.619,
    "end": 1784.448,
    "text": " So it's interesting and it's not a coincidence that the same thing shows up there, that if you take the action on paths and you just put e to the minus s, then you get a path integral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.329,
    "end": 1796.476,
    "text": "Although I've kind of left some details out because that's a path integral for a statistical field theory in kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.576,
    "end": 1800.838,
    "text": " uh, what we call after wick rotation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.238,
    "end": 1810.642,
    "text": "And so the, in quantum field theory, we add an eye, it's an imaginary variable, but these things are mathematically transferable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1810.662,
    "end": 1815.004,
    "text": "So it doesn't really matter for our purposes, uh, in what context we talk about them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1816.585,
    "end": 1824.969,
    "text": "Uh, so, so that's, that's where equation five comes from is if we have this action and we just do E to the minus S then, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.894,
    "end": 1829.155,
    "text": " what we get is a path probability density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.956,
    "end": 1834.758,
    "text": "And as you've written there, this, again, it doesn't come out of nowhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.838,
    "end": 1839.54,
    "text": "It's consistent with stochastic process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.46,
    "end": 1843.161,
    "text": "So all of the sample paths of a stochastic process",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.177,
    "end": 1849.66,
    "text": " If they're continuous, they live in what's called an abstract Wiener space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.541,
    "end": 1857.987,
    "text": "And the probability density over an abstract Wiener space is exactly this e to the minus s thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.047,
    "end": 1860.789,
    "text": "So that's where that comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.109,
    "end": 1867.433,
    "text": "And it's nice that that kind of falls out of Bayesian mechanics very naturally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.294,
    "end": 1884.26,
    "text": " So if you begin from the reasoning that we want an action, an at least action principle, and that tells us something about the trajectories of the system, then there is a very canonical way to get back the Wiener measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1886.56,
    "end": 1890.382,
    "text": "It's not surprising in some sense, but it's nice that it's consistent with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1892.502,
    "end": 1892.642,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.785,
    "end": 1896.827,
    "text": " I talk a little about, okay, what is this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.228,
    "end": 1897.868,
    "text": "What does this mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.089,
    "end": 1900.591,
    "text": "And how is this equivalent to a surprisal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1901.132,
    "end": 1902.673,
    "text": "Because I think that's important too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1902.693,
    "end": 1912.243,
    "text": "Um, and, uh, so the action that I talked about previously, I guess we'll call it 4.1, um, does come from the, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.604,
    "end": 1921.165,
    "text": " Yes, so 4.1, that S is equivalent to the surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.925,
    "end": 1944.29,
    "text": "And that comes from, if you just put a logarithm on both sides of equation five, you get log P equals minus S. And so if you put a minus on both sides, then you get minus log P equals S. So the surprisal of a trajectory is equivalent to this integral over time of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.31,
    "end": 1948.071,
    "text": " the noise squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.512,
    "end": 1959.196,
    "text": "So by the way, I don't know that I defined those brackets, but the brackets just means you take the two things inside the bracket and you multiply them by each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.796,
    "end": 1964.638,
    "text": "So really, this is just the integral through time of the noise squared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.678,
    "end": 1975.006,
    "text": " And that that is equivalent to the surprisal is more interesting for our purposes because it means the converse also holds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.367,
    "end": 1992.502,
    "text": "If you start from the point of the abstract Venus space and you write down the correct action, then you get Bayesian mechanics back as the idea that something that minimizes its action in the Bayesian mechanical setting minimizes its surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.05,
    "end": 1997.373,
    "text": " So I'll let you write that down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.194,
    "end": 2006.202,
    "text": "And then we can carry on, I think, from page seven, because the rest of page six is just saying all of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.012,
    "end": 2008.232,
    "text": " Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2008.472,
    "end": 2015.217,
    "text": "I think surprisal may be more conventionally understood in a statistics framework, but what is action?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.497,
    "end": 2020.001,
    "text": "And is this related to me moving my arm action, or what do we mean by action here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2020.021,
    "end": 2032.99,
    "text": "Yeah, so in the context of physics and mechanics, an action is a function, so it takes a function and it gives you back a number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.752,
    "end": 2047.158,
    "text": " And as a functional, what it does is it gives you a kind of a weight or a cost associated with a trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.779,
    "end": 2053.322,
    "text": "So if you write down a path through space or through spacetime as a specific function,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.537,
    "end": 2059.501,
    "text": " then the action takes that function and gives you back the cost of taking that path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.322,
    "end": 2075.214,
    "text": "And so the idea in classical mechanics is, okay, the cost associated to a path is based on how much extra energy does it take if you take that path from A to B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2076.275,
    "end": 2087.395,
    "text": " Um, and extra energy is kind of circular in the sense of kind of presupposes the, uh, least action path exists, but then, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2089.255,
    "end": 2104.412,
    "text": " If you'll allow that for a moment, then the idea is, okay, so there should be a path that uses the least extra energy to get from A to B. And in doing so, it produces the least cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.752,
    "end": 2109.077,
    "text": "So finding the least action path, the path of minimum action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2110.238,
    "end": 2121.468,
    "text": " is the optimal way to get from A to D. And in classical physics, paths of least or stationary action, more generally, are the only acceptable paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.688,
    "end": 2126.812,
    "text": "When you start to introduce noise, it becomes a probabilistic judgment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2126.832,
    "end": 2129.854,
    "text": "So paths of least surprise are the most likely paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.175,
    "end": 2136.039,
    "text": "You have other ways to get from A to D as well, if there are very large fluctuations, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.111,
    "end": 2153.683,
    "text": " So in that sense, you can think of action as kind of a loss functional, or something analogous to it in the machine learning world, because it is a judgment about how good a path from A to B is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.306,
    "end": 2160.469,
    "text": "Before we go to the next section, Ali or Jakob, do you want to add anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.481,
    "end": 2168.083,
    "text": " Okay, that was page six.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2168.864,
    "end": 2170.846,
    "text": "Now we're going to page seven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.889,
    "end": 2188.983,
    "text": " Yeah, so then I go on with this story about synchronization, which is introduced here in some greater detail than has previously been done, I think, which is one of the points of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.224,
    "end": 2198.471,
    "text": "So I begin by saying, okay, let's take two random dynamical systems, which I call eta and mu,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.532,
    "end": 2204.594,
    "text": " This is kind of, well, it's not kind of, it is an abuse of types.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.094,
    "end": 2212.056,
    "text": "So just be aware when you're reading this, eta and mu are states of the random dynamical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.896,
    "end": 2217.778,
    "text": "But a random dynamical system is a bit more complicated than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.938,
    "end": 2221.739,
    "text": "There's more machinery going on in the background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.12,
    "end": 2244.742,
    "text": " However, just like we would write a big capital X as a random variable, so we name the SDE after the values of its states, we can do the same with the random dynamical system if we wink and nod and remember that that's not quite correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.804,
    "end": 2257.491,
    "text": " But it's also worth pointing out that a random dynamical system can be identified with an SDE under the right circumstances and that you do so very easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2258.512,
    "end": 2262.835,
    "text": "So this is totally consistent with the previous discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.175,
    "end": 2269.779,
    "text": "And I have a paper forthcoming that does that in a bit more detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.74,
    "end": 2273.962,
    "text": "So it's continuing along these lines and saying, OK,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2276.013,
    "end": 2291.001,
    "text": " If we begin from this Bayesian mechanical story of systems that are coupled to each other do inference, and if they are random dynamical systems, then that inference is meaningful and comes with a path probability density and all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.122,
    "end": 2295.404,
    "text": "That's in greater detail in this forthcoming paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.685,
    "end": 2307.987,
    "text": " So anyway, that's kind of technical remarks, but just keep in mind in that first sentence, there's a bit more going on there, but I'm allowed to do that because it all works out anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.354,
    "end": 2313.935,
    "text": " And then we begin with this thing about synchronization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2314.015,
    "end": 2321.337,
    "text": "So when you consider coupled systems, then those systems synchronize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.437,
    "end": 2325.418,
    "text": "So there's some relationship between the statistics of those two systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.638,
    "end": 2336.221,
    "text": "And that is this sigma function that is given in earlier literature by people like Carl and people in his group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.706,
    "end": 2344.329,
    "text": " So the sigma is relating the average internal state to the average external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2344.609,
    "end": 2348.711,
    "text": "It's even called the synchronization function in that literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.831,
    "end": 2361.797,
    "text": "And in this case, we actually also want to be able to say not only a state at a given time, but also that the paths of the system synchronize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.297,
    "end": 2366.359,
    "text": "So taking it a little bit more generally than has been written before,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.119,
    "end": 2374.081,
    "text": " you know, we now want to be able to say that, okay, so now, uh, the, the trajectories of the random dynamical systems, um, synchronize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.502,
    "end": 2380.744,
    "text": "So how one evolves depends on how the other evolves, which is, um, conceptually is, is fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.504,
    "end": 2395.449,
    "text": "Um, and relates all to things that have already kind of been worked out like active inference, you know, how an active inference agent evolves through time depends on how its environment evolves through time and vice versa, because, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.009,
    "end": 2399.971,
    "text": " Active inference agents can act on their environment and change it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.191,
    "end": 2409.154,
    "text": "So, and, you know, control systems more generally are things that fit into this trajectory based formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.152,
    "end": 2415.835,
    "text": " So then I talk a little about surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.315,
    "end": 2420.758,
    "text": "So what does it mean that systems that synchronize minimize their surprisal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.239,
    "end": 2427.263,
    "text": "And there's a lot to detail in this section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.383,
    "end": 2430.405,
    "text": "There's a lot of stuff that goes along with that statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.745,
    "end": 2434.867,
    "text": "But ultimately, it's just saying that systems that synchronize with each other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.008,
    "end": 2464.198,
    "text": " um almost by definition are minimizing the magnitude of fluctuations away from whatever is being synchronized to so this relationship means that you are minimizing your surprisal if surprise was defined as deviations away from the thing that is being synchronized to so that i think um again that's that's almost um a tautology but uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.287,
    "end": 2473.073,
    "text": " That's, I think, kind of the power of the framework is you begin from the statement that makes almost trivial conceptual sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2473.554,
    "end": 2480.819,
    "text": "And then it gives you some kind of actual useful model of what the internal dynamics of some system are doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2482.121,
    "end": 2485.203,
    "text": "And that's at the end of page seven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2486.944,
    "end": 2487.165,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2488.052,
    "end": 2503.34,
    "text": " i'll ask a specific and a general question from the chat so first the specific question and just let me know which equation to look at martin biel asks what is the relationship between x of t and gamma",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.718,
    "end": 2512.665,
    "text": " Gamma is a path, so it's a realization of xt, the random variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.326,
    "end": 2515.968,
    "text": "X of t is just another way of writing gamma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.789,
    "end": 2523.816,
    "text": "I do it in a couple of different ways, just to drill down the point that lots of different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2524.517,
    "end": 2528.799,
    "text": " literature, lots of different ways of seeing this thing are all the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.16,
    "end": 2535.363,
    "text": "So for instance, gamma is used in the literature around maximum caliber, which is maximum path entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2537.984,
    "end": 2550.571,
    "text": "X of t is kind of consistent with this functional idea, so regarding a path as a function, and then plugging it into the functional and seeing, OK, what is the surprise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.611,
    "end": 2553.373,
    "text": "What's the cost associated with this path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.553,
    "end": 2569.956,
    "text": " And you'll also see, I think, Q of t later in the paper, and that's interesting because Q is the variable and Q of t is conventionally used in classical physics literature, just again as a mathematical convention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.797,
    "end": 2577.438,
    "text": "So anyway, yes, to answer your question, gamma is just this X of t, they're different labels for the same object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.2,
    "end": 2578.34,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2578.741,
    "end": 2579.962,
    "text": "And Martin follows up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2580.943,
    "end": 2586.989,
    "text": "Is this synchronization an additional assumption to Bayesian mechanics, or is it part of the assumptions for it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.93,
    "end": 2590.253,
    "text": "And then is X of T gamma of T?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2592.115,
    "end": 2592.215,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.962,
    "end": 2612.516,
    "text": " Okay, so the idea of synchronization is critical to Bayesian mechanics actually telling you anything useful because the whole story about coupled things do inference on each other is something that follows from this synchronization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.556,
    "end": 2617.46,
    "text": "So the whole story about approximate Bayesian inference follows from the coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.101,
    "end": 2620.622,
    "text": "So synchronization is an important assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.143,
    "end": 2635.19,
    "text": " One thing that you can do, however, is to prove that things that synchronize are coupled and vice versa, things that couple are synchronized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.21,
    "end": 2638.011,
    "text": "And this is at least shown in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.772,
    "end": 2644.377,
    "text": " paper I have from earlier this year called Towards a Geometry and Analysis for Bayesian Mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.197,
    "end": 2650.983,
    "text": "I believe that's in Lemma's 4.2 and 4.3, and maybe theorem 4.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.063,
    "end": 2659.25,
    "text": "So it's shown that if you write down two coupled systems, then you can get the statistics to synchronize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2660.091,
    "end": 2663.795,
    "text": "That's not really, it wasn't difficult to show, and it's not really surprising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.576,
    "end": 2666.219,
    "text": " but that is something that you can show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.361,
    "end": 2674.035,
    "text": "Gamma of t, I don't think I use gamma of t in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.317,
    "end": 2685.741,
    "text": " Maybe I use gamma sub T, so gamma T, like sort of offset from the main line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.722,
    "end": 2694.726,
    "text": "Gamma sub T is, again, the same notation that's used elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.378,
    "end": 2701.221,
    "text": " So it just means a path at a particular time point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.642,
    "end": 2706.466,
    "text": "So it's just a state, a realization of the random variable at that time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.486,
    "end": 2708.768,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2708.988,
    "end": 2716.855,
    "text": "And then the more general question before we head on was from Dave, who wrote, what does using energy mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2717.695,
    "end": 2725.422,
    "text": "For example, is that extracting potential energy and transferring that withdrawal to kinetic energy or the relevant analogs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2726.636,
    "end": 2731.0,
    "text": " Yeah, in the context of an action functional, that's exactly what it means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.6,
    "end": 2739.567,
    "text": "So this transfer of potential energy to energy of motion, which is kinetic energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.169,
    "end": 2752.438,
    "text": "Yeah, I think there is a discussion of this, a kind of conceptual discussion of this in the On Bayesian Mechanics paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.614,
    "end": 2756.354,
    "text": " somewhere in section two, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.415,
    "end": 2771.581,
    "text": "And it's the idea that, okay, when we talk about minimizing action, it's about you have some energy budget, your potential energy, and you want to know, okay, what is the most efficient way of using that budget?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.621,
    "end": 2779.625,
    "text": "What is the most, what is the way that transfers potential energy to kinetic energy with the least accumulated loss over time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.906,
    "end": 2781.006,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.022,
    "end": 2785.123,
    "text": " Physically, that is just following a force gradient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.124,
    "end": 2796.809,
    "text": "So if you try to do extra, if you try to wiggle your way through the force gradient, you now need to invest more potential energy, but you're getting to the same spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2798.169,
    "end": 2799.87,
    "text": "So that's not necessarily what you want to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.59,
    "end": 2810.455,
    "text": "So this is why the Euler-Lagrange equation is kind of interesting because it tells us what we intuitively expect is the most efficient way of transferring energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.635,
    "end": 2814.798,
    "text": " an energy budget to actual motion is just following along a force gradient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.279,
    "end": 2828.328,
    "text": "And that's why we see things like Newton's law that the acceleration of the system is always the force acting on it or is in proportion to it anyway, because you also have this mass constant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.929,
    "end": 2830.19,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2830.81,
    "end": 2834.593,
    "text": "On to page eight, equations six, seven, and eight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2836.494,
    "end": 2836.714,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2837.175,
    "end": 2839.957,
    "text": "So this is setting up the equation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.184,
    "end": 2842.666,
    "text": " the variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.506,
    "end": 2864.066,
    "text": "So we have in six and seven, we have the kind of traditional factorization that we've seen in a lot of this literature, which is here is the free energy functional with the joint density, the kind of generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.247,
    "end": 2885.202,
    "text": " And then if we take out this extra surprisal term, then we get the variation of free energy in a kind of reduced form, which bounds the actual surprisal of the internal states of the system, or the particular states of the system, the blanket and the internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2886.043,
    "end": 2886.403,
    "text": "So then this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2888.271,
    "end": 2910.013,
    "text": " kind of sets us up to say, okay, then if the system is synchronizing well, so if it's minimizing its surprisal and it matches the mode in the first log term, then that bound vanishes and we are putting a bound on the surprisal of internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.018,
    "end": 2919.504,
    "text": " And then equation eight just states it again in the setting of paths and not states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2920.424,
    "end": 2927.069,
    "text": "So you have these functions, eta of t, mu of t, is about the evolution of the system through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.751,
    "end": 2931.973,
    "text": "All right, Jakob, Orly, anything you want to add there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.542,
    "end": 2961.119,
    "text": " okay now we get to the physics of and by beliefs we could have completed the constitutional trifecta with the four beliefs also some very interesting connections that jacob and i and others have explored with grammatical case for example the physics of belief being the genitive",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2961.639,
    "end": 2988.492,
    "text": " case whereas the physics by belief might be like the instrumental case and that might point towards natural and semi-natural languages to describe beliefs but just broadly what is happening in these sections and how do we get towards equation nine yeah so in this uh section it's just two the the you know at the end of the previous section um synchronization gives you surprise minimization",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.393,
    "end": 2997.018,
    "text": " And in section C, I'm using the building blocks to actually make that statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2997.679,
    "end": 3017.175,
    "text": "So approximate Bayesian inference is about how a system's beliefs behave, given that they need to match some kind of density over the environment, and where match means not necessarily equal, but synchronized to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.362,
    "end": 3035.536,
    "text": " So this is what we mean really by physics of beliefs is the context for Bayesian mechanics is certain kinds of systems that are coupled to their environment or that are coupled to another system synchronized to that other system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3036.737,
    "end": 3044.199,
    "text": " And as a result, we can understand the statistics of one system as synchronizing to the statistics of the other system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.68,
    "end": 3059.024,
    "text": "So any kind of belief updating or any kind of large deviations principles or anything that we can use to understand the statistics of one are done implicitly in the context of the statistics of the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3062.185,
    "end": 3077.072,
    "text": " And again, this is what we mean by physics of beliefs, is suddenly we have now formulated a kind of law of motion for the beliefs of the system, which is to do with synchronization and approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3078.232,
    "end": 3081.013,
    "text": "So the idea that we can understand",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.814,
    "end": 3090.982,
    "text": " sometimes literally motion in the sense of motion on a statistical manifold, movement in a space of beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3091.502,
    "end": 3101.432,
    "text": "We can understand it as being a response to the pressure to minimize surprisal given whatever you are or the system is synchronizing to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.072,
    "end": 3104.054,
    "text": "That's really the main thrust of this section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.789,
    "end": 3114.218,
    "text": " and I talk a little about exactly what does that mean and what is the point of synchronization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.939,
    "end": 3119.103,
    "text": "I don't think there are a lot of equations in this section, but it's about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.163,
    "end": 3119.524,
    "text": "It's about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.109,
    "end": 3136.242,
    "text": " Okay, synchronization is a thing that we've talked about a lot, and we've talked about it in the context of minimizing surprisal, but it's important to set up the idea that when we talk about basic mechanics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3137.043,
    "end": 3144.109,
    "text": " It is partially about the system itself, but what makes it kind of special is it's about the beliefs of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.589,
    "end": 3161.163,
    "text": "And it's saying, okay, here is a way of understanding coupled systems by forgetting about the systems themselves and going into synchronized beliefs and understanding how does synchronization affect the probabilities that we assign to system states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.704,
    "end": 3162.804,
    "text": "Hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3164.52,
    "end": 3164.741,
    "text": " Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.142,
    "end": 3166.505,
    "text": "So that's of beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.808,
    "end": 3170.253,
    "text": "And now we go to by beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.313,
    "end": 3171.075,
    "text": "Oh, first, Jakob.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3171.656,
    "end": 3171.877,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3173.143,
    "end": 3183.208,
    "text": " Yeah, I'm just wondering, how would you say that active states are formalized within Bayesian mechanics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3183.248,
    "end": 3198.877,
    "text": "Because I feel like sometimes there's this kind of duality where we can say that systems can be described by Bayesian mechanics, and we say that they act as if they're performing Bayesian inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3199.597,
    "end": 3208.199,
    "text": " Then there are also systems which, in this kind of conventional sense, do perform Bayesian inference through some active states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3208.299,
    "end": 3217.262,
    "text": "So I'm just wondering, how do active or even sensory states fit within Bayesian mechanics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.038,
    "end": 3219.419,
    "text": " Yeah, that's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3220.199,
    "end": 3226.683,
    "text": "Because as you said, sometimes, especially for very simple systems, this is a kind of mathematical technique.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3226.844,
    "end": 3228.485,
    "text": "It's even a trick in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.205,
    "end": 3233.167,
    "text": "That's not to say that it doesn't work, but it doesn't have the kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.228,
    "end": 3241.192,
    "text": " epistemological sense of belief, or if it does, you've got to do a lot of work to make that make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.252,
    "end": 3255.64,
    "text": "And I am kind of... There's a lot of philosophical debate about this in the literature, and I know there's a corner of literature that is specifically about do things actually minimize their free energy, or is it just a useful model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.261,
    "end": 3258.741,
    "text": "I'm kind of agnostic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.841,
    "end": 3260.142,
    "text": "I think the whole question is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.883,
    "end": 3262.904,
    "text": " basically irrelevant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.504,
    "end": 3276.951,
    "text": "Um, because the, the reality is whether or not it is true in a literalist sense, or is just a model or, or whatever at the end of the day, the maths works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3277.752,
    "end": 3288.337,
    "text": "So yes, you have to be careful about acknowledging the limitations of the maths to describe the actual physics and the biology, but you should be being careful about that anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3289.058,
    "end": 3289.118,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.343,
    "end": 3297.548,
    "text": " And I acknowledge that maybe I'm being a bit unfair because I'm saying the question is irrelevant and then going on to say, you do have to be careful about the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.129,
    "end": 3301.431,
    "text": "But at the end of the day, it is just maths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.192,
    "end": 3311.978,
    "text": "And so whether the maths is a true model of a system or is a model of what we think the system is doing,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.904,
    "end": 3317.907,
    "text": " is kind of a silly question being phrased that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3318.808,
    "end": 3321.469,
    "text": "And the reason why is because the maths is always just a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3323.639,
    "end": 3334.482,
    "text": " I think something like that point was advanced in a paper by Mel Andrews, where it's said that the FEP is just a model of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3335.463,
    "end": 3342.485,
    "text": "And whether the model is any good or not is strictly separate from whether the model is true or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.985,
    "end": 3345.866,
    "text": "And in general, models are not true in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.526,
    "end": 3352.988,
    "text": " No system is actually sitting down and calculating, okay, here is the root of my free energy functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.408,
    "end": 3356.509,
    "text": "Here is what nature says I should be doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.609,
    "end": 3357.39,
    "text": "I'm going to go do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3359.29,
    "end": 3361.111,
    "text": "So anyway, that was kind of a digression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3361.151,
    "end": 3362.251,
    "text": "That wasn't directly your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3364.172,
    "end": 3371.194,
    "text": "The reality is, yes, it is a kind of a mathematical trick and the maths works, but it doesn't always tell the satisfying conceptual story that we want to hear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.974,
    "end": 3372.675,
    "text": "So I think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.611,
    "end": 3387.964,
    "text": " You're right, the big difference is to do with how active the system is, because systems that can actually do actions do have a use for storing representations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.197,
    "end": 3413.843,
    "text": " And, you know, we think about things like controlled systems in this sense, which are systems that aren't just minimizing their surprisal as a mathematical truism that unsurprising systems do unsurprising things, but they are systems that exist in an environment that is trying to dissipate them actively because they are very far from an equilibrium point and they need to know that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3414.723,
    "end": 3418.507,
    "text": " know what the environment is doing in order to know how to respond to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.088,
    "end": 3429.558,
    "text": "So active states do draw a pretty clear line between, and I should say as well, sophisticated active states, because you can think of things like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.359,
    "end": 3431.741,
    "text": " the active states of a stone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3432.321,
    "end": 3438.768,
    "text": "They're not very sophisticated, but a stone does kind of, for instance, irradiate heat back into the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3438.788,
    "end": 3440.309,
    "text": "So that is an action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.75,
    "end": 3442.852,
    "text": "It's just not a very interesting one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3443.553,
    "end": 3452.843,
    "text": "But sophisticated active states draw a pretty clear line between genuine Bayesian inference and just kind of like applied statistics, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3455.35,
    "end": 3463.793,
    "text": " And it's something that I haven't really thought deeply about, except to note that this is a place where there is a distinction to be made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.693,
    "end": 3480.959,
    "text": "I talk a little about this in the geometry and analysis paper that I just mentioned, and it shows up quite a lot in the forthcoming paper that I mentioned in the last session, which is by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.399,
    "end": 3488.908,
    "text": " Lance and myself and Carl and a few other people, and it's called Path Integrals and Particular Kinds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.05,
    "end": 3498.942,
    "text": "In that paper, I think I mentioned in the context of an interesting calculation to do with moving frames of reference, but additionally,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3500.933,
    "end": 3503.515,
    "text": " there's quite a lot of work in that paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.615,
    "end": 3514.102,
    "text": "And one of the key deliverables of that paper is here are a number of different kinds of free energy functionals, which are defined by different kinds of partitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.702,
    "end": 3517.904,
    "text": "So a partition that has active states and a partition that doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.985,
    "end": 3523.908,
    "text": "And what are the qualitatively different kinds of behaviors that we're able to describe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.809,
    "end": 3530.373,
    "text": "And one thing, one case that that paper tries to make is that there are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3531.253,
    "end": 3548.856,
    "text": " interesting systems and non-interesting systems and there are lifelike systems and not lifelike systems and that they exhibit very different behaviors when they minimize their free energy including you know lifelike systems are able to minimize their expected free energy so they're not just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3549.597,
    "end": 3551.738,
    "text": " you know, it's not just a case of applied statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3551.778,
    "end": 3562.683,
    "text": "They're actually, one presumes, holding a model of the world and making predictions about the world and taking actions now that minimize free energy in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.163,
    "end": 3571.867,
    "text": "So that's a bit more sophisticated than just a tree branch shaking in the wind, because it would be kind of surprising if it didn't, you know, that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3572.347,
    "end": 3573.467,
    "text": " That's a law of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3573.567,
    "end": 3576.608,
    "text": "It would be surprising if the tree branch didn't shake in the wind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3577.188,
    "end": 3586.13,
    "text": "But to say that the tree branch is doing Bayesian inference over its environment is only true in this, I guess, instrumentalist sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.03,
    "end": 3588.65,
    "text": "I don't know if that's actually the right word for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.75,
    "end": 3592.771,
    "text": "I think that's a word from the philosophy literature that I'm not qualified to use properly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3593.171,
    "end": 3596.912,
    "text": "But it is true in the instrumental sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.392,
    "end": 3600.814,
    "text": " That is an instrument that we can use to describe the dynamics of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.294,
    "end": 3611.039,
    "text": "It's not true in the kind of literal cognitive sense that the tree is now forming a model and making predictions about its current state and state of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.479,
    "end": 3614.741,
    "text": "And there may be panpsychist types that would disagree with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.121,
    "end": 3617.902,
    "text": "But that's the view I take anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.342,
    "end": 3620.864,
    "text": "So this is a very interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.604,
    "end": 3623.025,
    "text": "I hope that answered at least part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.086,
    "end": 3625.366,
    "text": "Jakob?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3627.102,
    "end": 3629.104,
    "text": " Yeah, it definitely did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3629.564,
    "end": 3641.815,
    "text": "I'm just also wondering whether on your point where we have sophisticated actions and not sophisticated actions, whether that could also be a consequence of the complexity of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3641.835,
    "end": 3653.304,
    "text": "Because in the case of just a tree branch being shaken by the wind, we just have one type of mechanical force that the tree branch is synchronizing to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3654.105,
    "end": 3669.293,
    "text": " but in a more complex environment with living systems, there are many more of not explicit forces, but maybe cognitive forces or biological forces that the systems might need to couple to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3669.313,
    "end": 3671.454,
    "text": "So I'm wondering whether the formalism could also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3673.695,
    "end": 3687.415,
    "text": " not be adjusted to the complexity of just the individual entity that we're interested in, but also to the complexity of the influences of the environment that the system couples to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3688.567,
    "end": 3701.871,
    "text": " Yeah, I think there's definitely remit to say that simpler systems can only infer simple things, and so they do best in very simple environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.371,
    "end": 3704.712,
    "text": "More complex things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.752,
    "end": 3711.434,
    "text": " In a way, and there are arguments that this is why structures like the brain evolved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.934,
    "end": 3716.376,
    "text": "Actually, I believe, I suppose he's listening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.936,
    "end": 3719.197,
    "text": "Martin Beale has an interesting paper about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.817,
    "end": 3734.968,
    "text": " And I forget the title, but the point of the paper is there's a very neat hypothesis that the brain evolved because it's very good as a biological structure at handling what's called counterfactual information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3735.408,
    "end": 3739.291,
    "text": "So the brain evolved as a prediction generation mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.612,
    "end": 3765.686,
    "text": " So there's remit to say that complexity of an individual scales with the complexity of the environment because something like a human that wants to self-organize very far from equilibrium, suddenly there's a lot more to keep track of because there's a lot more acting on you to keep you down, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.226,
    "end": 3788.093,
    "text": " And so you not only need complex sensory motor loops to respond to all that complexity, but you need a complex processing hub to actually deal with all of those variables and categorize all that information and decide, OK, what are my sensory motor loops doing in this situation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.074,
    "end": 3792.215,
    "text": "How am I actually responding to the things that I'm observing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.275,
    "end": 3802.959,
    "text": " So yeah, definitely, there is an interesting story to be told with how the complexity of the outside determines the complexity of the inside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.459,
    "end": 3809.061,
    "text": "And it is kind of, again, a very nice meta application of the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.461,
    "end": 3815.404,
    "text": "Because if we think that, you know, if we want to say that things that self-organize are things that mirror their environment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3816.064,
    "end": 3833.137,
    "text": " then it is precisely the claim that if you want to be a complex thing and you are subject to very complex environmental forces, then you need to be a complex thing to self-organize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3836.2,
    "end": 3842.745,
    "text": "And this is the kind of good regulator-type theorem that has come to characterize discussions about the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3844.291,
    "end": 3845.952,
    "text": " So yes, another interesting question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3847.052,
    "end": 3847.292,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3847.772,
    "end": 3864.898,
    "text": "Well, just to carry forth and get a first pass and everything, although of course the door is always open for .3s and beyond, in Section 2D, the Physics of Beliefs, we have Equation 9, 10, 11, and several more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3864.918,
    "end": 3869.359,
    "text": "So where do we get to by the end of Section 2D?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3869.399,
    "end": 3870.54,
    "text": "What's the key piece here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3871.34,
    "end": 3889.606,
    "text": " Yeah, so in the previous subsection, I spent a lot of time building up the idea that Bayesian mechanics is a kind of a special way of thinking about laws of motion in the space of beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3890.006,
    "end": 3894.908,
    "text": "So motion on a statistical manifold, which is one really interesting thing about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.868,
    "end": 3911.993,
    "text": " And that's of mathematical interest, maybe, because it's now saying, okay, here are some kind of new dynamical systems theories on statistical manifolds, which is quite cool, and it does...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3914.939,
    "end": 3917.16,
    "text": " I think that's interesting on its own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.821,
    "end": 3924.302,
    "text": "But if you are into physics or biology, that's not quite enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3925.603,
    "end": 3937.167,
    "text": "The nice thing is that there is this idea that, okay, it's not only about laws of motion in information geometry, but it's about mapping",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3938.346,
    "end": 3949.492,
    "text": " a system which has some kind of physics in the real world into a ideally simpler physics in statistical manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3952.361,
    "end": 3964.148,
    "text": " in virtue of talking about synchronization as a law of motion for beliefs, we are now saying, okay, we don't need to talk about the material physics underlying the synchronization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.868,
    "end": 3976.094,
    "text": "We can go into this space of beliefs and we can say, okay, synchronization tells me that the system's beliefs are changing this way and that reflects a physical change of this nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3976.755,
    "end": 3980.317,
    "text": "So it's an equivalent way of talking about real physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3981.536,
    "end": 3987.529,
    "text": " So we have a physics of beliefs and that this maps back and forth between a real physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.026,
    "end": 3997.369,
    "text": " So we should then be able to make inferences about real systems using Bayesian mechanical laws.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.749,
    "end": 4016.715,
    "text": "And this is what is meant by a physics by beliefs is if we invert the story and say, okay, now I want to know what is this, what is approximate Bayesian inference saying about the mode of the system, about the parameters that are doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4017.895,
    "end": 4018.936,
    "text": " approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.196,
    "end": 4021.397,
    "text": "And you can do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.477,
    "end": 4025.339,
    "text": "You can make inferences about the system itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.879,
    "end": 4031.462,
    "text": "And if your inferences are good, then you learn something about the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4032.402,
    "end": 4034.823,
    "text": "So that's very general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.324,
    "end": 4037.685,
    "text": "And that's also subject to surprise minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4038.085,
    "end": 4041.126,
    "text": "So if you are unsurprised, then you have a good model of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.347,
    "end": 4046.209,
    "text": "So now the whole story applies to itself in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4046.989,
    "end": 4057.713,
    "text": " If you minimize surprisal about your beliefs about a system, minimizing surprisal, then you can get a model of how that system is self-organizing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.594,
    "end": 4061.055,
    "text": "And you hope that the loop kind of closes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.215,
    "end": 4066.057,
    "text": "So this is, I think, quite an important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4067.357,
    "end": 4072.92,
    "text": "It's the subject of a duality relationship that I gesture at and think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.96,
    "end": 4077.642,
    "text": " write a lot about in the Geometry and Analysis paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.762,
    "end": 4081.984,
    "text": "It also shows up in a paper called the Map Territory Fallacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.725,
    "end": 4085.126,
    "text": "It has fallacy twice in the title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4085.966,
    "end": 4090.929,
    "text": "And that's by myself, Maxwell Ramstad, and Carl Friston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.17,
    "end": 4102.255,
    "text": "And it investigates the idea that you can actually turn the story on its head and make a model of a system making a model of its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4103.676,
    "end": 4105.498,
    "text": " and that that's insightful for various reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.899,
    "end": 4119.01,
    "text": "The, the interesting thing about that is, um, it now gives you a physics by beliefs in the sense that now my, um, my description of what the system is doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4119.03,
    "end": 4123.874,
    "text": "Uh, so my description of the material physics is inferential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.914,
    "end": 4127.517,
    "text": "It's based on my beliefs about what the system, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.017,
    "end": 4131.842,
    "text": " is synchronizing to and how well is it minimizing surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4132.242,
    "end": 4134.946,
    "text": "And it's also based on how good my model is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.986,
    "end": 4140.132,
    "text": "So it's based on whether I can minimize my own surprisal and make good inferences about the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.918,
    "end": 4157.561,
    "text": " And this calls back to the principle of constrained maximum entropy, because what that's saying is my model of the system is an inference of the system subject to the constraint that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.493,
    "end": 4163.497,
    "text": " the model of the system reproduces surprisal minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4164.177,
    "end": 4175.186,
    "text": "So any model that I have of the system must say that the model is itself or that the system is itself holding a model of its environment and is minimizing surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.269,
    "end": 4177.87,
    "text": " So that's where the constraint comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4178.21,
    "end": 4187.757,
    "text": "It's that this is something that we know a priori, so it's something that we should incorporate into our model of the system, this surprisal minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4188.738,
    "end": 4193.561,
    "text": "And just working out the maths of that is all of these equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4193.941,
    "end": 4202.167,
    "text": "So it's showing that if you put a constraint that your model of the system includes surprisal minimization,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4202.927,
    "end": 4206.448,
    "text": " then you get back exactly approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4207.088,
    "end": 4220.97,
    "text": "So there is this other route to Bayesian mechanics that just says, OK, if we begin from, and in reality, and the point I try and make is that it's not actually a different route to Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4221.27,
    "end": 4229.232,
    "text": "Because all this is saying is, if my model of the system begins from the point of view that systems that synchronize minimize their surprisal,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4229.952,
    "end": 4236.715,
    "text": " then I get back the minimization of free energy and surprisal in the context of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4237.715,
    "end": 4240.816,
    "text": "So kind of nuanced, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4241.156,
    "end": 4243.017,
    "text": "There's a lot of moving pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.098,
    "end": 4252.341,
    "text": "But ultimately, that's all that means when we say physics by beliefs is it's the application of the constrained maximum entropy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.101,
    "end": 4259.047,
    "text": " to create a model of a system which is minimizing its surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.687,
    "end": 4268.696,
    "text": "And what's interesting is that that model itself is subject to the laws of Bayesian mechanics because it is a probabilistic belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4269.517,
    "end": 4271.979,
    "text": "So it's like saying I'm sitting in the environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4273.564,
    "end": 4276.787,
    "text": " And I'm synchronizing to the system, which is synchronizing to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.728,
    "end": 4284.635,
    "text": "And if I make a good model of that system, I incorporate the knowledge that it is doing approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.215,
    "end": 4288.338,
    "text": "That shapes my own approximate Bayesian inference about the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.179,
    "end": 4295.045,
    "text": "There's this symmetry to the problem that falls out of very first principles considerations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.634,
    "end": 4298.014,
    "text": " Excellent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4298.955,
    "end": 4304.017,
    "text": "On to section three, a general equation for Bayesian classical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.917,
    "end": 4311.74,
    "text": "So it'll be helpful for you to situate where it begins and then how we approach equation 15.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4313.499,
    "end": 4318.163,
    "text": " Yeah, so this section is kind of taking those building blocks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4318.283,
    "end": 4327.932,
    "text": "OK, so we have a way of modeling systems that model their environment, and it's this kind of dual suprisal minimization problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4328.532,
    "end": 4335.078,
    "text": "So how do we actually write that as a problem that we can solve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4335.138,
    "end": 4340.462,
    "text": "How do we do computations with this thing in the context of classical physics, especially?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4342.062,
    "end": 4348.426,
    "text": " And also this analogy that we talked about previously, does that go through to this case?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.311,
    "end": 4353.253,
    "text": " You can build up this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4353.393,
    "end": 4359.817,
    "text": "You can build up the idea of a classical physical system that couples to its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.157,
    "end": 4367.401,
    "text": "And it is, in this case, a force that acts to separate the thing from its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.342,
    "end": 4378.508,
    "text": "So again, there's a bit of an abuse of types in the sense that we would usually consider a sensory state experiencing or measuring that force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.109,
    "end": 4388.511,
    "text": " But instead, I just plug in the force itself under the assumption that it's not a noisy sensor, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.132,
    "end": 4400.035,
    "text": "And that proves to be, again, not a taxing assumption because it tells us the same story at the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.055,
    "end": 4403.196,
    "text": "You can deduce everything that you'd need to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.436,
    "end": 4423.369,
    "text": " So you can set up a synchronization function in that case and it just tells the system what the environment is probably like given the force acting on the system and already you have the ingredients for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.049,
    "end": 4428.012,
    "text": " approximate Bayesian inference, because you have a conditional independence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.652,
    "end": 4434.397,
    "text": "So the system doesn't need to know what the environment is like if it knows the force acting on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4435.178,
    "end": 4438.661,
    "text": "So you can argue that there is a conditional independence there, or at least a sparse coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.63,
    "end": 4448.573,
    "text": " And you have an inference problem because the system does need to know what to do given the force acting on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.633,
    "end": 4452.255,
    "text": "So it does need to know what is the environment like given that force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4452.995,
    "end": 4459.138,
    "text": "And it can only do what it needs to do if it is minimizing surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4459.738,
    "end": 4460.938,
    "text": "So all the ingredients are there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4461.579,
    "end": 4464.28,
    "text": "And you can also talk about the fact that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4465.08,
    "end": 4473.484,
    "text": " The classical action is the Bayesian mechanical action in the limit of no uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4474.045,
    "end": 4481.829,
    "text": "So you do get surprisal minimization as equivalent to classical action minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4482.469,
    "end": 4487.672,
    "text": "And that's ultimately the chain of reasoning that gets us down to equation 15, is that the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4490.287,
    "end": 4501.15,
    "text": " the path that minimizes the classical action is the mode, so it is the most likely path, so the path of least surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.17,
    "end": 4507.111,
    "text": "So you can structure classical mechanics as a least surprisal problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.811,
    "end": 4509.812,
    "text": "And that gets us down to equation 15.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4512.873,
    "end": 4513.233,
    "text": "Excellent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4514.213,
    "end": 4518.494,
    "text": "While I bring 15 in, Ali or Jakob, any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4523.962,
    "end": 4535.331,
    "text": " So maybe could you read equation 15 with the variables and or the natural language semantics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4536.38,
    "end": 4538.601,
    "text": " Yeah, I'm a big fan of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4538.661,
    "end": 4545.023,
    "text": "I think that's a useful way of breaking things down is explaining the objects being involved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4545.664,
    "end": 4560.77,
    "text": "And there are people that really take that philosophy to the extreme, to the extent that I've seen talks where you're not allowed, the chair of the session says, okay, you're not allowed to just tell me the name of the thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4561.15,
    "end": 4563.971,
    "text": "You need to explain to me what the thing is and what it's doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.671,
    "end": 4567.573,
    "text": " I believe, isn't that a case of the chair doing inference on you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4568.434,
    "end": 4569.395,
    "text": "Yeah, well, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.536,
    "end": 4572.818,
    "text": "In fact, probably it is, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4572.898,
    "end": 4574.739,
    "text": "How do I best fit this into my world model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.759,
    "end": 4576.14,
    "text": "Well, tell me in terms that I understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4576.501,
    "end": 4577.401,
    "text": "Yeah, explain it to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4577.622,
    "end": 4578.282,
    "text": "That's really what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4579.183,
    "end": 4583.006,
    "text": "Yeah, so here we have the path probability density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4583.066,
    "end": 4593.795,
    "text": "So it's the probability of a classical position Q at a time T, which is a joint density in this case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.371,
    "end": 4605.753,
    "text": " It equals the exponential of the minus of the action that we saw in the basics of Bayesian mechanics section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4606.573,
    "end": 4609.394,
    "text": "So it is the normal path probability density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.454,
    "end": 4613.135,
    "text": "And the only question is, okay, what is S?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4615.535,
    "end": 4615.935,
    "text": "Excuse me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4616.375,
    "end": 4622.657,
    "text": "So we've plugged in something interesting for S. It's the integral over time of the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.499,
    "end": 4639.823,
    "text": " deviation of the classical path Q from the path of least action, where the path of least action is defined as the double integral of the force divided by the mass.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.283,
    "end": 4644.765,
    "text": "So the double integral of an acceleration, which is just a position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4645.785,
    "end": 4648.806,
    "text": "So given that we know the initial conditions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.033,
    "end": 4666.267,
    "text": " what is in the vertical bars, so what is being squared, is just the deviation of Q, the classical path, from the expected path, or the path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.929,
    "end": 4669.329,
    "text": "Excuse me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.17,
    "end": 4672.672,
    "text": "So this is precisely the classical action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.833,
    "end": 4682.143,
    "text": " in the sense that it gives you back the path of least classical action, gives you back the path that follows Newton's laws.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.949,
    "end": 4686.269,
    "text": "Excellent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4687.99,
    "end": 4695.297,
    "text": " So to bring it closer one level, what variable might we be talking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4695.357,
    "end": 4699.221,
    "text": "Like what kind of data set or variable might Q be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4700.362,
    "end": 4705.146,
    "text": "In classical physics, we're mostly interested in spatial positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4706.405,
    "end": 4710.627,
    "text": " or at least generalized coordinates describing those spatial positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4711.648,
    "end": 4715.51,
    "text": "But more generally, we could talk about a lot of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4715.61,
    "end": 4717.671,
    "text": "Q could be really anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4718.812,
    "end": 4720.432,
    "text": "One of the nice things about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.773,
    "end": 4731.836,
    "text": " random dynamical systems and random variables is there is a great generality in what that state could represent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4732.337,
    "end": 4735.478,
    "text": "So in general, it's just a label for something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4736.338,
    "end": 4742.28,
    "text": "Here in classical physics, yeah, we are interested in positions, spatial positions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.969,
    "end": 4754.652,
    "text": " Okay, so it could be how excited I am about a song or my belief about the temperature or what this person's next sentiment is going to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4755.152,
    "end": 4755.912,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.653,
    "end": 4757.053,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4760.074,
    "end": 4762.714,
    "text": "Anything else on three or it'll be great to move to four?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4764.115,
    "end": 4766.776,
    "text": "No, I think that's really the story about three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4767.636,
    "end": 4767.916,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4768.296,
    "end": 4769.196,
    "text": "Well, four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4769.756,
    "end": 4774.618,
    "text": "Ali, would you like to set up or introduce how you see section four and what you wanted to ask?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4777.703,
    "end": 4784.085,
    "text": " Well, yeah, actually, if you permit, I wanted to make a somewhat lengthy comment here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4784.105,
    "end": 4787.366,
    "text": "If I may, not too long, I promise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4787.386,
    "end": 4790.707,
    "text": "We're going to need 0.3, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4791.528,
    "end": 4793.628,
    "text": "I'm following that with a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.169,
    "end": 4800.931,
    "text": "You see, as we know, there are numerous approaches proposed for driving classical properties from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.132,
    "end": 4804.215,
    "text": " quantum matter, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.916,
    "end": 4815.409,
    "text": "But I wanted to mention two, among which, to my mind, are particularly congruous with Bayesian mechanics view on quantum physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.77,
    "end": 4820.115,
    "text": "I'm not sure if you're familiar with causal fermion systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.935,
    "end": 4828.521,
    "text": " approach developed by Felix Finster and others, because it's not a particularly well-known theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.042,
    "end": 4845.395,
    "text": "But in any case, it's basically another variational approach for explaining the emergence of a structured spacetime with all of its associated phenomenological properties, such as the flow of time, the chain of causal events, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4847.416,
    "end": 4852.479,
    "text": " from an optimal configuration of self-organizing quantum wave functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.379,
    "end": 4871.489,
    "text": "But instead of defining the action functional as the surprisal to be minimized in order to achieve the optimal inference, as we saw in Bayesian mechanics, they define the causal action as the action functional minimizing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4872.23,
    "end": 4881.346,
    "text": " which leads to the optimal configuration of wave functions, which in turn results in the structured spacetime properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.588,
    "end": 4884.852,
    "text": "And the other approach I wanted to mention is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4886.122,
    "end": 4907.057,
    "text": " quantum Darwinism proposed by Wojciech Zurek, inspired by the principle of natural selection, which attempts to explain how the most stable pointer states are favored among the many possible quantum states and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4908.258,
    "end": 4913.181,
    "text": " thereby resulting in the classicality of our everyday observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4914.202,
    "end": 4917.664,
    "text": "Actually, this approach is also alluded to Fields et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.624,
    "end": 4920.105,
    "text": "'s paper Free Energy Principle for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.889,
    "end": 4922.531,
    "text": " generic quantum systems, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4923.351,
    "end": 4934.201,
    "text": "So do you see Bayesian mechanics as ultimately unifying all these different approaches somehow into an M-theory-like integrated theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.241,
    "end": 4942.388,
    "text": "Because in your recent paper on the map territory fallacy-fallacy, which you mentioned, FEP is already shown to be the ideal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.958,
    "end": 4946.761,
    "text": " modeling tool for generic systems in statistical physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.602,
    "end": 4955.668,
    "text": "So can this statement be potentially extended to encompass all the other physical systems as well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.857,
    "end": 4958.638,
    "text": " Yeah, that's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.938,
    "end": 4980.145,
    "text": "I'm not familiar with this causal fermion systems work, although it sounds like it fits into a kind of spirit of question that exists in condensed matter theory, asking about, OK, how do things emerge that have a given structure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4981.246,
    "end": 4983.348,
    "text": " from things that don't have structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.968,
    "end": 4993.858,
    "text": "And especially the word causal seems interesting because a lot of condensed matter people are very interested in information theory very recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4995.95,
    "end": 5012.791,
    "text": " But anyway, yeah, so there is similar work in condensed matter by people like Michael Levin, who's not the Mike Levin that does developmental biology at Tufts, which is kind of interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5013.072,
    "end": 5014.213,
    "text": "It's a different Michael Levin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5016.035,
    "end": 5036.596,
    "text": " And Levin and someone called Wen have developed things like string net condensation, which is all about how do... Well, I guess at a high level, it's about how does structure arise from the application of constraints to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.142,
    "end": 5049.358,
    "text": " I guess you might call them self-organization in... You might call them self-organizing field theories, although that's not the language that Levin and Wen use, and I think that's kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.061,
    "end": 5053.563,
    "text": " Telling the wrong story, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.623,
    "end": 5056.927,
    "text": "But there's something there, definitely something to be generalized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5058.028,
    "end": 5070.861,
    "text": "And likewise for quantum Darwinism, there is this idea that the things that we measure as the most certain or the classical states arise from a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5073.124,
    "end": 5074.745,
    "text": " spatial interaction component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.326,
    "end": 5080.411,
    "text": "So things that couple to other things have well-defined measurements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5080.531,
    "end": 5087.178,
    "text": "So, you know, pointer states because of this localized interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.478,
    "end": 5091.039,
    "text": " I apologize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5091.919,
    "end": 5096.744,
    "text": "So, you know, this is as a resolution of, I think, the decoherence problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5097.965,
    "end": 5103.49,
    "text": "This is one interpretation, and it just remains to kind of make that more mathematically rigorous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.21,
    "end": 5107.874,
    "text": "And, you know, people like Sean Carroll have written about this at length.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.075,
    "end": 5111.977,
    "text": "So in both cases, there is kind of a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5115.373,
    "end": 5116.854,
    "text": " Yeah, an intersection of ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.814,
    "end": 5120.655,
    "text": "And they both seem very Bayesian mechanical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5121.115,
    "end": 5124.536,
    "text": "I think one of the nice things about Bayesian mechanics is it's very general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5124.696,
    "end": 5135.92,
    "text": "It's just a story about how constraints and superficial minimization and statistics interact to get you a model of a physical system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.141,
    "end": 5137.281,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5138.808,
    "end": 5140.23,
    "text": " In principle, that is very general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5140.37,
    "end": 5148.263,
    "text": "And you start to add extra constraints and things like the Markov blanket and whatnot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5148.724,
    "end": 5148.864,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5149.983,
    "end": 5162.949,
    "text": " there is probably remit to generalize this even further to something that is purely about how do paths that synchronize behave probabilistically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5163.369,
    "end": 5165.35,
    "text": "And that is very general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5165.45,
    "end": 5178.296,
    "text": "And that probably applies to more than just conventional classical statistical physics, but maybe other aspects of quantum mechanics and condensed matter theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5179.156,
    "end": 5198.916,
    "text": " and and so forth great thank you well in our last 30 minutes of the dot 2 with of course the dot 3 on demand let's get to those worked examples and we will look forward to a thousand notebooks blooming",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5199.577,
    "end": 5205.723,
    "text": " with people simulating and making interactable visualizations and extending some of these examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5206.284,
    "end": 5215.573,
    "text": "It'll be great though to hear what are the real world situations that you are applying Bayesian mechanics to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5216.454,
    "end": 5223.778,
    "text": " And then what do each of these equations do on the path towards application in each of these settings?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5224.178,
    "end": 5228.761,
    "text": "Previously, we discussed the three faces of Bayesian mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5228.861,
    "end": 5235.504,
    "text": "Could you just review the three faces of Bayesian mechanics in light of where we're going to go in the coming applications?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5236.805,
    "end": 5239.226,
    "text": "Yeah, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5239.286,
    "end": 5243.848,
    "text": "The pyramid that you see here at the bottom layer is all of these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5245.563,
    "end": 5265.113,
    "text": " I guess, boundary conditions specific applications of the FEP where the boundary condition that we're interested in is whether the mode being matched, whether the thing that we're synchronizing to is a state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5266.392,
    "end": 5269.794,
    "text": " Uh, and then you have states and paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5269.954,
    "end": 5270.994,
    "text": "That's the first split.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.735,
    "end": 5278.798,
    "text": "And within states, you're also interested in, okay, is that state in motion or is that state fixed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.019,
    "end": 5294.186,
    "text": "Uh, and this corresponds really nicely to a story in classical mechanics about, um, forces in equilibrium, uh, forces being applied and, kind of continuous forces, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5294.966,
    "end": 5308.589,
    "text": " which the examples I used are an object at rest, an object that is moving to a point at which it would rest, and an object in constant motion, like something in orbit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5310.13,
    "end": 5313.99,
    "text": "And specifically for the middle one, I think I use a ball thrown in the air.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5314.271,
    "end": 5318.111,
    "text": "And so eventually, it comes back down to Earth and rests on the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5320.092,
    "end": 5323.773,
    "text": "And then the celestial body, a planet in orbit, is your path tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5325.99,
    "end": 5326.67,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5327.311,
    "end": 5335.273,
    "text": "Okay, so we have the analogy very clear, and we can say rigorously supported.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5335.914,
    "end": 5347.898,
    "text": "The left side, we're talking about synchronization to states, like parameter values that are instantaneous, whereas the right branch is the density over path, so the synchronization is to a path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5348.638,
    "end": 5351.539,
    "text": "On the left side, we have fixed and dynamic mode,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5353.48,
    "end": 5366.995,
    "text": " the mode mode fallacy fallacy and that is matching to uh a ball at rest and a ball thrown in the air on a parabola that will come to rest and the satellite motion is the infinite chasing now",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5367.972,
    "end": 5369.793,
    "text": " We're talking about cognitive systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5370.673,
    "end": 5384.1,
    "text": "So what are the cognitive analogs or the real world cognitive settings where we're talking about some cognitive entity like a computer or a person or an ant colony rather than perhaps a ball on a hill?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5385.902,
    "end": 5387.403,
    "text": " Yeah, so this is a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5387.983,
    "end": 5396.187,
    "text": "I think in the path tracking case, at least, it's pretty obvious that this is active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.207,
    "end": 5409.433,
    "text": "This is a very general blueprint for what it means to be in a dynamic environment and to constantly be synchronizing to an environment that's changing and that maybe you yourself are changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5411.313,
    "end": 5416.318,
    "text": " And that's maybe something that's worth commenting on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5418.0,
    "end": 5428.071,
    "text": "It's only this last case that is the kind of stuff that we're interested in, in terms of worked examples when it comes to genuinely cognitive systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5428.872,
    "end": 5434.254,
    "text": " And it's this last case that we know the most about in terms of worked examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5435.054,
    "end": 5446.339,
    "text": "So it's the case that hasn't been really worked out in terms of rigorous maths, although that's in the last six months or so, that's what's been being done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5447.419,
    "end": 5455.441,
    "text": " not only with this paper, but also with the path integrals paper that's about to come out and the free energy principle made simpler, but not too simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5456.841,
    "end": 5466.603,
    "text": "And also Lance and Carl and Greg have a paper called geometric sampling methods in optimization and adaptive agents, where this is also talked about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5467.903,
    "end": 5471.964,
    "text": "So in a way, this is the case that we know the most about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5472.744,
    "end": 5473.544,
    "text": "And it's the case that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5474.564,
    "end": 5475.305,
    "text": " works the best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5475.365,
    "end": 5478.788,
    "text": "It's the case that actually explains the kinds of stuff that we want to explain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5480.049,
    "end": 5482.952,
    "text": "But the rigorous maths hasn't been done in that case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5484.413,
    "end": 5491.46,
    "text": "The simpler density dynamics formalism is much less useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5494.366,
    "end": 5502.913,
    "text": " and to some extent suffers from its own problems in terms of edge cases and maybe mathematical confusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5505.521,
    "end": 5511.827,
    "text": " So there is some cleaning still to do with the density over states formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5512.507,
    "end": 5516.05,
    "text": "But again, ironically, that's the formalism that we care the least about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5516.991,
    "end": 5531.424,
    "text": "And what we're most interested in is making the path tracking make more sense and making it more complicated and generalizing even past it to explain things that synchronize two paths in a more complex way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5533.189,
    "end": 5537.051,
    "text": " Um, so, so the path tracking is about, uh, these kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5537.531,
    "end": 5540.693,
    "text": "And one way to think about them is in terms of expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5541.153,
    "end": 5548.157,
    "text": "So, you know, not only, um, minimizing my free energy right now, but minimizing my expected free energy along the path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5549.057,
    "end": 5551.979,
    "text": "Um, that's, that's one way of thinking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5552.139,
    "end": 5555.48,
    "text": "And another way of thinking about it is minimizing the surprise of the path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5556.321,
    "end": 5556.401,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5557.682,
    "end": 5573.371,
    "text": " So mathematically, that works nicely, but it gives you a bit of a different story, and the expected free energy is nicer in the context of cognitive agents because it gives you this idea of prediction and action back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5575.292,
    "end": 5583.697,
    "text": "The density over states formalism is much simpler, and it doesn't apply...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5585.927,
    "end": 5589.949,
    "text": " much, doesn't apply very strongly to very complex agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5590.409,
    "end": 5595.591,
    "text": "You can think of it as an instantaneous approximation to the path tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5595.991,
    "end": 5604.674,
    "text": "And so in that sense, there are things that are cognitive and do fixed mode tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5606.014,
    "end": 5607.475,
    "text": " or what we call mode matching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5608.696,
    "end": 5616.783,
    "text": "But if you think about it, that is, again, an instantaneous approximation to the path tracking setup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5617.344,
    "end": 5628.933,
    "text": "So if you think about something like URI, we're usually not matching a mode because that means we are staying completely still and our environment is staying completely still.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5630.414,
    "end": 5633.096,
    "text": "And that happens mostly at depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5634.088,
    "end": 5637.75,
    "text": " which is, it is something that we can talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5637.83,
    "end": 5651.316,
    "text": "We can talk about a system at total rest, but even then the analogy breaks because the environment still isn't at rest only on very brief timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5651.596,
    "end": 5653.557,
    "text": "Can we approximate it as being at rest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5654.217,
    "end": 5657.699,
    "text": "And it's also not the story that we're looking for about cognitive agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5659.197,
    "end": 5670.961,
    "text": " So the fixed mode and the dynamic mode are mathematically interesting, but I think when it comes to the biology and to some extent even the physics, they're not very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.102,
    "end": 5676.203,
    "text": "Very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5677.173,
    "end": 5685.456,
    "text": " So maybe as we scan through these equations, just what are each equation doing within the example?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5685.896,
    "end": 5692.679,
    "text": "So we're in terminal mode matching section 6A, and we see equation primarily 17.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5692.739,
    "end": 5698.641,
    "text": "Yeah, so equation 17 is just giving you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5701.021,
    "end": 5704.703,
    "text": " I think we skipped section five, which is the mode matching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.643,
    "end": 5716.767,
    "text": "So maybe I do want to just quickly mention that when you have forces at equilibrium and you have an initial condition of zero, this is in equation 16.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5718.863,
    "end": 5722.327,
    "text": " then the path of least action is not a path at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5722.427,
    "end": 5723.528,
    "text": "It's a stationary object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5723.568,
    "end": 5724.409,
    "text": "It's an object at rest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5724.93,
    "end": 5728.354,
    "text": "And so you can do this very easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5728.494,
    "end": 5731.177,
    "text": "You'll see I write Q minus zero squared equals zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5731.618,
    "end": 5734.922,
    "text": "So the surprisal, that is the surprise, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5735.602,
    "end": 5740.124,
    "text": " You're not integrating through time because you're only at one time point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5741.245,
    "end": 5742.265,
    "text": "So the integral goes away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5742.845,
    "end": 5750.789,
    "text": "And the double integral of the force over time is just zero because the forces are at equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5752.409,
    "end": 5758.955,
    "text": " the surprisal is minimized when Q equals zero, when there is no motion and the system is at the mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5759.296,
    "end": 5765.041,
    "text": "In this case, you can imagine Q as a generalized position corresponding to the height above the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.082,
    "end": 5772.488,
    "text": "So when Q is on the ground, not moving at that time point, you are minimizing your surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5773.129,
    "end": 5774.67,
    "text": " And that's what we call mode matching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5775.531,
    "end": 5780.834,
    "text": "And again, you see this is a very simple setting because literally nothing is happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5781.455,
    "end": 5790.481,
    "text": "And that's not really fit for describing cognitive agents, but it is a good simple case just to make sure that all the maths works in the simple case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5791.121,
    "end": 5812.571,
    "text": " yep i'm imagining this to be our belief about the room is that it's 37c and the thermometer is giving us 37 37 37 so the mode instantaneously is not being updated and that's kind of like a balloon is being inflated and it's pressure matching or the ball is on the ground so the forces are canceling out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5813.431,
    "end": 5822.486,
    "text": " on the statistical distributions the bayesian surprise is zero the prior and the posterior are the same we're in the most static possible situation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5823.663,
    "end": 5824.203,
    "text": " Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5824.243,
    "end": 5833.826,
    "text": "There are no, if you want to imagine again, this physics of belief setting, there are no forces acting on me between observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5833.866,
    "end": 5837.647,
    "text": "There are no probabilistic forces changing my beliefs about the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5838.127,
    "end": 5840.148,
    "text": "So the mode is stationary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5840.528,
    "end": 5841.908,
    "text": "I'm always matching the same mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5842.729,
    "end": 5845.629,
    "text": "So nothing's happening, no movement on the statistical manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5847.25,
    "end": 5849.45,
    "text": "And therefore, we get mode matching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5850.051,
    "end": 5850.951,
    "text": "It's a very trivial case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5852.881,
    "end": 5856.783,
    "text": " Now we introduce some forces into the picture with mode tracking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5857.703,
    "end": 5866.827,
    "text": "Yeah, so mode tracking is a little bit more complicated because you have an actual inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5866.887,
    "end": 5870.689,
    "text": "You're interested in where something is and also how to get to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5872.03,
    "end": 5876.252,
    "text": "And there's kind of an open question somewhere in this section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5876.952,
    "end": 5893.377,
    "text": " which is about, or maybe in the following section, which asks, um, is a least surprising path to a, uh, target mode, also a, um, instance of mode tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.877,
    "end": 5894.077,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5894.337,
    "end": 5898.759,
    "text": "Uh, and I actually, I don't know that, um, that's something that is open for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5899.079,
    "end": 5900.96,
    "text": "I think we'll encounter it somewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5902.22,
    "end": 5902.3,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5904.81,
    "end": 5905.25,
    "text": " Yeah, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5905.33,
    "end": 5906.771,
    "text": "Well, we will stumble into it anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.152,
    "end": 5915.978,
    "text": "But anyway, it's the idea of, okay, so we want to do inference about where is a mode that I'm not at and how do I get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5917.239,
    "end": 5921.582,
    "text": "In this case, the example is of a ball being thrown through the air.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.662,
    "end": 5931.049,
    "text": "So again, thinking of Q as a generalized position corresponding to the height above the ground, I start at some initial condition above the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5931.949,
    "end": 5939.354,
    "text": " And gravity is the force acting on me, telling me the mode that you want to be at is at rest on the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5940.014,
    "end": 5950.962,
    "text": "So in some sense, you can read this, you can read a ball being thrown through the air and then falling to the ground as doing inference about what gravity tells it to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5953.303,
    "end": 5960.029,
    "text": " And if you write this out, there is an equation of motion, which is a path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5960.37,
    "end": 5962.391,
    "text": "And it's just this parabolic path to the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5963.893,
    "end": 5973.501,
    "text": "And if you plug that in and you minimize the surprisal, then you get a system kind of goes like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5974.282,
    "end": 5979.127,
    "text": "And what's more, you can write this as a gradient ascent on surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5980.628,
    "end": 5986.657,
    "text": " So it's, well, a gradient ascent on the probability density, a gradient descent on the surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5986.998,
    "end": 5993.948,
    "text": "So it is literally a minimization problem because you can get back the equation of motion from a gradient descent on the surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5994.048,
    "end": 5994.749,
    "text": "And that is interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5995.495,
    "end": 5997.077,
    "text": " I think we will call it 17.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5997.217,
    "end": 6002.502,
    "text": "So it's the third equation in this section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6003.803,
    "end": 6004.484,
    "text": "Yes, that's the one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6006.405,
    "end": 6011.41,
    "text": "Right after the first labeled one, which is 17.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6011.45,
    "end": 6017.836,
    "text": "So this gradient descent, this minimization problem, gets you exactly the equation of motion that you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.557,
    "end": 6019.618,
    "text": "So you can prove that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6020.565,
    "end": 6025.749,
    "text": " surprise minimization tells you something interesting about this case of mode tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6027.09,
    "end": 6027.391,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6027.831,
    "end": 6042.102,
    "text": "I'm imagining a cognitive entity, a physicist, a Bayesian mechanic, modeling in their perception implicitly or in their notebook explicitly the path of a ball.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6042.723,
    "end": 6042.983,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6044.131,
    "end": 6054.774,
    "text": " And the cleanest situation would be if their factorization and understanding of the sparsity of the territory, if their map resembles it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6055.655,
    "end": 6065.878,
    "text": "But no matter, even if it does, it still is a different thing and will be treated under the Bayesian mechanics as being by and about beliefs rather than by and about mass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6067.538,
    "end": 6069.339,
    "text": " Yeah, that's definitely one way of thinking about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6070.359,
    "end": 6078.061,
    "text": "We talked a little last time about what it looks like to collaborate and to converge on a belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6078.741,
    "end": 6080.382,
    "text": "And it's a little bit like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6081.242,
    "end": 6087.344,
    "text": "If we assume there's no uncertainty about where everyone is headed, and you just want to figure out how to get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6088.844,
    "end": 6102.269,
    "text": " So if you're like a bunch of people collaborating on an idea and you know where at A and I know what B is, then this says that the best way to get to B from A is just to minimize your surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6102.69,
    "end": 6116.635,
    "text": "That's the path of least action from A to B. And in this case, that means that it is precisely the most likely path that is the path of the classical object from A to B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6117.585,
    "end": 6134.42,
    "text": " Wow, very interesting since sometimes it seems like we're discussing in a value and preference aligned setting how to do something, policies as inference, whereas there's also a discussion of where to go in all of these other pieces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6135.281,
    "end": 6141.427,
    "text": "We'll just touch on each piece as lightly as possible in a few minutes so we can have a closing round.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6142.368,
    "end": 6142.528,
    "text": "In B,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6144.453,
    "end": 6148.716,
    "text": " 6b, we have tracking of mode, infinite mode tracking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6149.897,
    "end": 6160.744,
    "text": "Yeah, this is the kind of precursor to the idea of path tracking, which is saying, okay, if that mode is constantly in motion, what does that look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6161.805,
    "end": 6163.586,
    "text": "And you can do the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6164.227,
    "end": 6173.513,
    "text": "If you write out the equation of surprisal minimization, you can get the idea of continuous motion as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6174.513,
    "end": 6185.158,
    "text": " Um, but it's slightly more complicated and it is slightly less conceptually satisfying, uh, because it's not surprising minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6185.779,
    "end": 6190.801,
    "text": "It's, um, sort of surfing along level sets of the probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6190.841,
    "end": 6196.944,
    "text": "So it's the probability isn't minimized and, uh, and the, or the, the surprise isn't minimized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6197.344,
    "end": 6198.885,
    "text": "The probability isn't maximized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6199.205,
    "end": 6203.087,
    "text": "So you're not choosing the most likely, um, path, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6203.747,
    "end": 6216.015,
    "text": " Which is one of the reasons why I then go on to talk about path tracking in the next section is to say, you know, okay, so we tried to do this thing with a continuously moving mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6216.916,
    "end": 6219.698,
    "text": "And it kind of worked, but not really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6220.318,
    "end": 6225.101,
    "text": "So what if we said something about minimizing the surprisal of paths?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6226.082,
    "end": 6233.047,
    "text": "You know, so that instead of continuous mode tracking, what if we just talked about continuous motion, tracking a path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6234.448,
    "end": 6235.728,
    "text": " do these things coincide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6235.788,
    "end": 6236.909,
    "text": "Do they tell the same story?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6237.689,
    "end": 6249.996,
    "text": "And this is where the initial stuff in the basics of Bayesian mechanics section comes into play because now we're talking about path probabilities and minimizing action functionals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6251.037,
    "end": 6256.4,
    "text": "And at the end of the story, you say, okay, so the whole thing does go through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6256.86,
    "end": 6260.683,
    "text": "You can talk about selecting the path of minimum surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6261.844,
    "end": 6269.673,
    "text": " And in this case, it is following along in a satellite orbit based on the continuous forces that are being applied to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6270.574,
    "end": 6272.756,
    "text": "So at every turn, you have a kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6274.039,
    "end": 6281.102,
    "text": " circular force, you have not only a tangential force outwards, but also centripetal force inwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6282.063,
    "end": 6287.245,
    "text": "And if you write this down appropriately, you can get the equation for a circular orbit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6288.425,
    "end": 6298.35,
    "text": "And so that's what this is doing is saying, okay, if you have this continuous force acting on you, then can you match a path of least surprisal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6298.95,
    "end": 6299.39,
    "text": "And you can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6302.592,
    "end": 6302.912,
    "text": "Excellent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6303.86,
    "end": 6313.343,
    "text": " And just one last note on the first idea of g-theory before we take a breath in our closing round.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6314.504,
    "end": 6317.625,
    "text": "Yeah, so this is kind of a complicated section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6318.045,
    "end": 6322.407,
    "text": "The point of this section is ultimately to say two things, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6323.467,
    "end": 6331.69,
    "text": "One is that the case for classical physics is a nice playground, but it's kind of a simple one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6332.831,
    "end": 6340.397,
    "text": " And the aspirations of Bayesian mechanics are to talk about non-equilibrium, complex, self-organizing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6341.058,
    "end": 6345.121,
    "text": "So can we pull something more interesting out of the maths?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6346.022,
    "end": 6354.549,
    "text": "And it's also to make the case that the path-based formalism is the right thing to look at when we want to pull something interesting out of the maths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6355.87,
    "end": 6358.332,
    "text": " And so the answer to the first question is yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6358.973,
    "end": 6373.043,
    "text": "And implicitly, that supports the second name, because it says, okay, not only, you know, can we actually get a description of, in this case, chaos versus integrability or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6374.364,
    "end": 6380.371,
    "text": " ergodicity versus non-ergodicity, but also that it comes out of the path-based formalism very naturally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6381.111,
    "end": 6393.244,
    "text": "And in a way, Bayesian mechanics is a little bit special in this sense, because the idea of a path integral approach to classical physics comes out of Bayesian mechanics very naturally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6394.045,
    "end": 6399.069,
    "text": " And the results in this setting come from that path integral approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6399.569,
    "end": 6416.022,
    "text": "So it implicitly has this kind of third aim that because of this path based formalism in Bayesian mechanics is what did the job, that Bayesian mechanics is the thing that we maybe want to look at in more complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6416.943,
    "end": 6419.304,
    "text": " So that's the aim of this section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6420.285,
    "end": 6433.071,
    "text": "What this section does is it just writes down the path integral for a system in classical physics, given that it does Bayesian inference as per Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6433.451,
    "end": 6435.192,
    "text": "So approximate Bayesian inference, if you'd like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6435.852,
    "end": 6445.637,
    "text": "So if you write down a system in classical physics doing some kind of synchronization, you get a path integral with a particular kind of form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6447.26,
    "end": 6451.081,
    "text": " And then you can transform this a couple of different ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6451.101,
    "end": 6456.783,
    "text": "I do detail the derivation there, but they're all very standard transformations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6457.424,
    "end": 6461.505,
    "text": "And you get out of this something called a supersymmetry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6462.985,
    "end": 6467.047,
    "text": "Now, the idea of supersymmetry goes back to, I think, the 70s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6468.537,
    "end": 6478.664,
    "text": " It is an observation that in certain quantum field theories, you get asymmetry that relates different kinds of particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6479.585,
    "end": 6496.236,
    "text": "So what that means is if I write down a quantum field theory with two different kinds of particles, and in general, they are fermions or bosons, but it doesn't actually quite matter what.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6498.879,
    "end": 6504.852,
    "text": " At least you can get specific kinds of fermions and bosons, so the story doesn't have to be totally general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6506.469,
    "end": 6512.434,
    "text": " then sometimes you can exchange the different kinds of particles and you get the same theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6512.854,
    "end": 6516.416,
    "text": "So you can freely swap them and nothing about the physics changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6517.357,
    "end": 6518.998,
    "text": "This is called a supersymmetry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6519.038,
    "end": 6530.447,
    "text": "It's not a usual symmetry in the sense that, you know, when we think about symmetries, we think of geometric things that relate, say, two different sides of a shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6531.287,
    "end": 6544.99,
    "text": " So it is a symmetry in that it relates to different things in such a way that nothing changes, but it's a supersymmetry because it's about particles, not shapes, say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6545.11,
    "end": 6554.611,
    "text": "The interesting thing is supersymmetry breaking always leads to mathematically interesting observations and physically interesting observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6555.912,
    "end": 6558.352,
    "text": "So if we have access to a supersymmetry,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6559.784,
    "end": 6565.23,
    "text": " then the thought is immediately, okay, what can I say with this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6565.33,
    "end": 6569.975,
    "text": "I should keep an eye out for something interesting happening when the supersymmetry breaks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6571.377,
    "end": 6572.898,
    "text": "And in this context,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6573.632,
    "end": 6579.874,
    "text": " the supersymmetry breaking is about having two or more different constants of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6581.015,
    "end": 6585.276,
    "text": "And what that means is the system is non-ergotic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6586.897,
    "end": 6590.498,
    "text": "So ergodic systems have one constant of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6590.678,
    "end": 6596.801,
    "text": "It's just the energy or the Hamiltonian that you'd put into the probability measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6598.902,
    "end": 6604.752,
    "text": " But in non-ergotic systems, in integrable systems, you have multiple constants of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6604.812,
    "end": 6607.637,
    "text": "So it's not just the energy, but it's some other thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6609.159,
    "end": 6612.385,
    "text": "You don't know what necessarily, but you have additional variables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6613.967,
    "end": 6626.493,
    "text": " And what's interesting about that is then we can make the observation that supersymmetry is about or is analogous to chaos because ergodic motion is chaotic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6626.533,
    "end": 6633.477,
    "text": "It's about things that mix and things that fill their state space in sometimes unpredictable ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6634.717,
    "end": 6637.659,
    "text": "Whereas integrability, non-ergodicity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6639.38,
    "end": 6641.821,
    "text": " is about systems that are very predictable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6642.261,
    "end": 6646.644,
    "text": "You just integrate them and you say where it will be in a future time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6647.685,
    "end": 6661.233,
    "text": "So after all this derivation and conceptual work, what we end up with is a way of saying Bayesian mechanics has an accounting mechanism for chaos and not chaos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6663.544,
    "end": 6665.124,
    "text": " And that's where I leave off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6665.204,
    "end": 6669.945,
    "text": "I say, so this is something interesting that we can do with Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6670.365,
    "end": 6672.846,
    "text": "And it comes out of the path integral formulation very naturally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6672.866,
    "end": 6678.327,
    "text": "And this is a very trivial case of just classical physical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6678.767,
    "end": 6690.97,
    "text": "What can we get when we just start to describe the complex cases of more interesting systems like biological physics or self-organizing field theories or things of this nature?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6691.99,
    "end": 6693.591,
    "text": " And that's the end of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6694.832,
    "end": 6699.055,
    "text": "Well, like paper, like stream, as they say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6700.276,
    "end": 6706.04,
    "text": "So let us spend our last several minutes with Ali and Jakob.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6707.021,
    "end": 6715.327,
    "text": "Any just closing thoughts or questions or directions that you want to continue on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6718.309,
    "end": 6720.531,
    "text": "Well, it was an amazingly...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6720.939,
    "end": 6722.779,
    "text": " illuminating learning journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6723.36,
    "end": 6742.304,
    "text": "So I wanted to thank again, Daniel, Jakub and Ender for organizing the discussion sessions leading to these live streams and especially Dalton for his time and for sharing his brilliant insights and expertise with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6743.104,
    "end": 6750.106,
    "text": "And on a more personal note, Dalton, your work has rekindled my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6750.834,
    "end": 6753.697,
    "text": " long forgotten deep passion for theoretical physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6754.718,
    "end": 6760.264,
    "text": "And I know I'll certainly continue to explore this fascinating area of Bayesian mechanics a lot more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6760.844,
    "end": 6764.628,
    "text": "So I'm truly grateful for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6765.669,
    "end": 6766.751,
    "text": "Yes, that's it for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6766.931,
    "end": 6768.813,
    "text": "And I'll pass it to Jakob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6771.388,
    "end": 6781.493,
    "text": " yeah um also thanks to everyone uh daniel ali under uh who participated in the discussions i think uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6783.294,
    "end": 6790.939,
    "text": " your input, Ali, on the different equations was really invaluable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6791.219,
    "end": 6800.626,
    "text": "And of course, thank you, Dalton, for firstly writing the paper and then spending the time with us going through it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6802.787,
    "end": 6806.189,
    "text": "I'm really looking forward to future work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6806.209,
    "end": 6807.61,
    "text": "I would have...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6809.997,
    "end": 6834.242,
    "text": " many other questions about how Bayesian mechanics is related to other areas of physics, such as relativistic mechanics or the non-classical results within quantum mechanics, which we touched on last time, and then the actual applications to computational models as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6836.725,
    "end": 6841.267,
    "text": " I'm looking forward to exploring these more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6841.907,
    "end": 6847.169,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6848.269,
    "end": 6858.633,
    "text": "Dalton, what do you think are some of the best ways for someone to catch up to the frontier of Bayesian mechanics learning and application?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6860.195,
    "end": 6863.318,
    "text": " Yeah, well, first let me say it's been a pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6863.678,
    "end": 6870.164,
    "text": "I've really enjoyed the discussions and you guys came in very well prepared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6870.304,
    "end": 6873.146,
    "text": "So that made it even richer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6874.307,
    "end": 6876.809,
    "text": "So thank you for all your hard work and thank you for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6878.17,
    "end": 6886.797,
    "text": "I think basic mechanics is becoming a very technical side of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6888.099,
    "end": 6909.336,
    "text": " And I think that speaks to how ecumenical the FEP has been and how interdisciplinary it has been, because people come to it from many different backgrounds, including mathematics and physics like me, but also computer science and machine learning and also neurobiology and also philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6910.719,
    "end": 6913.404,
    "text": " So there's something in it for everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6913.925,
    "end": 6918.856,
    "text": "And if you are interested in this kind of more technical side,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6921.175,
    "end": 6926.999,
    "text": " One thing you can do and to some extent just have to do is read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6928.08,
    "end": 6934.344,
    "text": "There is a lot of literature being published at a very fast pace in the last few months.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6935.445,
    "end": 6939.187,
    "text": "So it can seem like a lot to wrap one's head around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6940.248,
    "end": 6950.755,
    "text": "But I think one thing that I have started to be better about, and certainly my co-authors have been good about,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6951.295,
    "end": 6953.017,
    "text": " is road mapping things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6953.577,
    "end": 6962.105,
    "text": "So it's easier and easier, I think, to get a handle on what all is being said and how it relates to other things being said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6963.026,
    "end": 6968.01,
    "text": "Papers like this are a good example of things that draw everything together really nicely, I think anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6968.991,
    "end": 6973.115,
    "text": "I don't know if I can say that, but I will anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6973.455,
    "end": 6976.938,
    "text": "And there are other papers and things that kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6977.699,
    "end": 6987.128,
    "text": " break things down and explain things in a more accessible way than the highly mathematical, highly technical work that's also being published.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6987.148,
    "end": 6992.634,
    "text": "I write blog posts summarizing some of my papers sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6993.795,
    "end": 6998.36,
    "text": "So if you're interested in those, you can find them on my website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7000.774,
    "end": 7011.462,
    "text": " Also on my website, I have a kind of Bayesian mechanical bibliography where I organize all of the recent papers in this area and what their contributions are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7012.443,
    "end": 7014.404,
    "text": "That's not on my blog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7014.444,
    "end": 7016.186,
    "text": "That's under a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7016.866,
    "end": 7039.686,
    "text": " page on my website called research but nonetheless you know that's that's something that you can look at as well and I think everyone involved is also fairly accessible via email I think in my experience that's been the case anyway I'm always available at my email Carl is a very generous person with his time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7041.308,
    "end": 7057.344,
    "text": " And people like Maxwell and Lance and Thomas, Connor, you know, all the people that have been involved are, in my experience, people who are willing to take and answer questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7058.185,
    "end": 7062.149,
    "text": "So that's also something to do, you know, if you're reading something and it just doesn't make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7064.156,
    "end": 7065.757,
    "text": " you know, do get in touch with someone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7065.937,
    "end": 7075.103,
    "text": "And in my experience, people will be very charitable in terms of taking and answering those questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7075.804,
    "end": 7078.886,
    "text": "But yeah, and there's, of course, the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7080.852,
    "end": 7086.057,
    "text": " The one thing that is tough is kind of building up the background for these.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7086.557,
    "end": 7093.523,
    "text": "But I think, like anything, it is something that you can develop on the fly, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7093.743,
    "end": 7107.395,
    "text": "So as long as something makes sense to you at some level, and maybe you're not an expert on the topic, maybe it only makes sense in isolation and you don't have the whole...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7109.196,
    "end": 7110.017,
    "text": " picture in your head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7110.577,
    "end": 7111.918,
    "text": "I think in general, that's all right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7113.639,
    "end": 7117.882,
    "text": "So yeah, maybe it's not a very satisfying answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7117.902,
    "end": 7121.905,
    "text": "But But at least part of the answer to your question is, we'll just start reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7123.066,
    "end": 7129.31,
    "text": "And if you do get stuck, then people in this area are pretty nice people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7129.53,
    "end": 7133.133,
    "text": "So don't hesitate to contact one of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7134.294,
    "end": 7137.616,
    "text": "If you do get stuck, or if you want to bounce ideas around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7140.623,
    "end": 7147.248,
    "text": " Well, as stated, it's been an amazing series, and I know it's not the end of 49.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7147.788,
    "end": 7150.33,
    "text": "There are decimals to come.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7150.89,
    "end": 7152.171,
    "text": "So Dalton, thanks again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7152.451,
    "end": 7155.453,
    "text": "Jakob, Ali, Ander, thanks for all the amazing work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7157.675,
    "end": 7158.536,
    "text": "Till the next gradient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7160.757,
    "end": 7161.378,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7161.398,
    "end": 7164.7,
    "text": "Yeah, I'm looking forward to whatever comes next.",
    "speaker": "SPEAKER_04"
  }
]