[
  {
    "start": 29.582,
    "end": 30.162,
    "text": " Hello everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.483,
    "end": 30.823,
    "text": "Welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.963,
    "end": 33.985,
    "text": "This is ACT-INF live stream number 49.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.086,
    "end": 40.309,
    "text": "We're discussing the paper, A Worked Example of the Bayesian Mechanics of Classical Objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.031,
    "end": 43.952,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.712,
    "end": 50.897,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.042,
    "end": 57.504,
    "text": " This is a recorded and an archived livestream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.705,
    "end": 63.927,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.228,
    "end": 72.331,
    "text": "Head over to ActiveInference.org to learn more about participating in different projects and learning groups at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.215,
    "end": 89.105,
    "text": " Well, we're here today in livestream number 49.0, where we're providing some background and context for the paper, a worked example of the Bayesian mechanics of classical objects,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.216,
    "end": 95.901,
    "text": " This paper was submitted to the archive preprint server in June, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.401,
    "end": 104.207,
    "text": "And we're going to be discussing and looking at a slightly revised version that was uploaded earlier this month on the 6th of September.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.068,
    "end": 107.81,
    "text": "It's a single author paper by Dalton A.R.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.95,
    "end": 108.811,
    "text": "Saktiva-Devel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.772,
    "end": 115.096,
    "text": "And this video, although all .zeros are, this one is too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.877,
    "end": 119.239,
    "text": "It's an introduction and just a preliminary discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.14,
    "end": 144.286,
    "text": " some of the ideas it's not a review or a synthesis or a final word and we'll explain a little bit more about our dot zero approach in a couple of slides but suffice to say that with jacob ali and also andre we had a great time over the last two months really pulling back and trying to think deeply about how to frame this paper and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.126,
    "end": 169.975,
    "text": " and really this whole area of research and development because there's a lot happening there's a lot being tied together and so we hope that some of that sense making translates into the ways that we've laid out 49.0 and we're very much looking forward to having dalton join for the dot one and the dot two so dalton thanks for all the work and for listening to this dot zero",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.135,
    "end": 180.22,
    "text": " Let's head to introductions and warmups so we can just say hello and any other features of what we're excited about in this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.941,
    "end": 181.441,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.881,
    "end": 188.865,
    "text": "I'm a researcher in California, and I think there's a lot that is exciting about this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.885,
    "end": 197.57,
    "text": "I didn't have much of a physics background before heading towards active inference in the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.231,
    "end": 199.932,
    "text": "So taking a first look",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 201.182,
    "end": 213.773,
    "text": " a lot of these physics ideas was interesting, like seeing them as part of something that already could or had been integrated, rather than starting with the puzzle pieces, I think was a little bit interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.653,
    "end": 215.794,
    "text": "And I'll pass to Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.957,
    "end": 221.479,
    "text": "Hi, I'm Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 221.939,
    "end": 224.021,
    "text": "I'm an independent researcher from Iran.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 225.497,
    "end": 253.973,
    "text": " Actually, what gravitated me towards active inference paper, this, I mean, FEP or active inference literature, and particularly this paper was, you see, I was always, I've been fascinated by doing the kind of elegant abstractions on some physical concepts or some doing abstractions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.83,
    "end": 263.857,
    "text": " a kind of bird's-eye view over the methodological way of doing physical modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.517,
    "end": 282.13,
    "text": "And I believe this paper and the other related papers offered by Dalton Sack-DeVadevel and his other colleagues from Versus Lab are the epitome of this kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.051,
    "end": 293.473,
    "text": " FEP abstraction in terms of elegantly formalizing all the rigorous mathematical foundations of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.273,
    "end": 298.894,
    "text": "And yeah, that's why I'm pretty excited to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.434,
    "end": 308.976,
    "text": "Actually, it's been a very fascinating and thrilling journey during the past couple of months since we began discussing this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.376,
    "end": 311.897,
    "text": "And so I'm very much looking forward to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.818,
    "end": 336.378,
    "text": " um hello i'm yakup i'm a student and researcher in the uk um there are also many uh okay lost yakup for a second we'll just wait we'll take a breath",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 346.556,
    "end": 346.816,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.117,
    "end": 348.797,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.017,
    "end": 350.537,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.657,
    "end": 351.598,
    "text": "Just start again, Jakob.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.618,
    "end": 353.998,
    "text": "It's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.018,
    "end": 354.779,
    "text": "Where was I cut off?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.039,
    "end": 355.759,
    "text": "Just start at the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.622,
    "end": 364.442,
    "text": "Maybe turn off your video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.214,
    "end": 388.2,
    "text": " okay c'est la vie okay you're back yakup just start at the beginning it's all good okay uh sorry i got randomly disconnected uh so hello i'm yakup i'm a student uh and researcher in the uk uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 391.091,
    "end": 403.807,
    "text": " I was really excited about this paper, specifically coming from a physics background, which I must say didn't help that much in initially understanding the paper on the first pass.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 405.594,
    "end": 426.035,
    "text": " But I think it's really exciting that this kind of unification of physics and cognitive sciences is formed through works like this paper or prior work that Carl Fristen and colleagues have been working on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 428.388,
    "end": 447.374,
    "text": " I am really excited about how this work might influence the future synergy of physics and cognitive sciences or neurosciences, which I think previously were quite disjoint fields, but now",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 449.181,
    "end": 470.077,
    "text": " with the more focus towards like complexity sciences we're seeing these similar patterns across a wide range of topics which I find really exciting so really looking forward to the discussion and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.553,
    "end": 473.234,
    "text": " the rest of the live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 474.155,
    "end": 474.375,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.175,
    "end": 475.675,
    "text": "Great, thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.936,
    "end": 481.579,
    "text": "So we're going to go to the big question, aims, claims, abstract, and roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.359,
    "end": 490.684,
    "text": "And then before we head off on that road trip and way find together, we're going to pull back to our approach and set a lot of context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.884,
    "end": 492.986,
    "text": "And that'll be most of this dot zero video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.726,
    "end": 518.106,
    "text": " and then we'll briefly touch on some points from the paper but most of this video is going to be actually in that context setting there's a lot of big questions that can be asked and one of them is quite simply what is bayesian mechanics but to make that a little bit more operational we could ask what is the relevance of bayesian mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.028,
    "end": 541.098,
    "text": " what is mechanical about cognitive science are we talking about physical mechanisms underlying cognitive agents or are we talking about something else it's the second what is of epistemic and pragmatic value about bayesian mechanics if we're going to be using active inference and the free energy principle as the gripper and the gripped",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.076,
    "end": 549.838,
    "text": " then how can we understand what is valuable and relevant and salient in terms of active inference ways of thinking about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.158,
    "end": 552.578,
    "text": "What would you fellows add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.658,
    "end": 558.32,
    "text": "What felt like really big questions that would lead somebody to want to be exploring this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.961,
    "end": 562.361,
    "text": "Yeah, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.982,
    "end": 570.943,
    "text": "Well, actually, before talking about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.256,
    "end": 576.36,
    "text": " specific from pragmatic value of doing Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.561,
    "end": 597.359,
    "text": "I think what, at least in my view, what's really interesting about Bayesian mechanical way of doing these kinds of probabilistic formulations and mathematical modeling is just it's pure elegance in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.817,
    "end": 607.097,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.818,
    "end": 611.04,
    "text": "Pick up again from pure... Different elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.34,
    "end": 615.242,
    "text": "I mean... Sorry, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.702,
    "end": 616.883,
    "text": "Pick up from pure elegance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 618.084,
    "end": 618.344,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 619.225,
    "end": 635.835,
    "text": "Yeah, as I was saying, I think one of its main interests is its pure elegance in unifying the different approaches to FVP in a kind of all-encompassing framework called Ambassian Mechanics,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.195,
    "end": 648.76,
    "text": " by which it can possibly, I mean, the other frameworks and other viewpoints and even other kinds of mechanics can be recovered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.24,
    "end": 661.886,
    "text": "So at least for me personally, this is the most interesting part and exciting part of doing Bayesian mechanics, but I'm sure there will be much",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.762,
    "end": 671.109,
    "text": " pragmatic value and much more applications that can potentially derive from this kind of viewpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.95,
    "end": 673.291,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.691,
    "end": 676.994,
    "text": "Where's beauty and elegance in epistem and pragma?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.574,
    "end": 677.914,
    "text": "Jakob?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.657,
    "end": 684.019,
    "text": "I definitely agree with Ali's point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 684.22,
    "end": 686.521,
    "text": "And maybe to add to that, I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 687.817,
    "end": 702.283,
    "text": " it's really elegant that within Bayesian mechanics you have a unifying formalism with which you can recover much of the same loss that we see in classical physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 702.543,
    "end": 709.566,
    "text": "We can also talk about the quantum mechanics as being",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 712.054,
    "end": 715.016,
    "text": " enclosed within the Bayesian mechanic formalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 715.576,
    "end": 735.226,
    "text": "But at the same time, using those same concepts, we can also model systems which are not usually considered by physics like autonomous agents or any biological entity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 735.406,
    "end": 737.667,
    "text": "And that, I think,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 738.45,
    "end": 746.013,
    "text": " will be probably one of the most relevant parts or contributions of Bayesian mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 748.134,
    "end": 748.454,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.954,
    "end": 756.237,
    "text": "Beauty and elegance as indicators of scope and scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.937,
    "end": 762.339,
    "text": "So the paper is a worked example of the Bayesian mechanics of classical objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.399,
    "end": 764.48,
    "text": "We've mentioned some details about it before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.802,
    "end": 773.628,
    "text": " I'll just highlight a few claims, some coming earlier in the middle and later in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.629,
    "end": 783.797,
    "text": "So earlier in the paper, it's written, it's often claimed that the free energy principle is as simple and general as the principle of stationary action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.517,
    "end": 791.162,
    "text": "And that is citation to a paper that we're going to discuss in just a few slides, simpler, but not too simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.535,
    "end": 799.241,
    "text": " And it's claimed about the FEP that it can be sketched out how Bayesian mechanics of internal states of classical objects might look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.901,
    "end": 805.686,
    "text": "And that's a citation to Frist in 2019, free energy principle for a particular physics, which we're also going to look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.707,
    "end": 817.816,
    "text": "Nevertheless, there's yet to be a systematic investigation of even the Bayesian mechanics of classical physics, despite it being readily available due to recent formulations as a least action principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.536,
    "end": 835.991,
    "text": " we've talked a lot about on these streams and elsewhere about the free energy principle as a variational principle of least action for cognitive systems so there was an opportunity that dalton identified which is to make a systematic investigation of classical physics and provide worked examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.622,
    "end": 846.786,
    "text": " Towards the middle of the paper, there are some important aims, such as we began with the aim of showing that classical physics can be derived from Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.446,
    "end": 853.188,
    "text": "So we'll work with different metaphors and ways of exploring it, but this is not like a layer two on physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.688,
    "end": 861.832,
    "text": "This is a generalization that in special cases includes classical statistical thermodynamic and quantum mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.315,
    "end": 876.033,
    "text": " We can derive Bayesian mechanics from the idea that a system is classical on average, just as we can derive classical mechanics from the idea that systems obey Bayesian mechanics for classical averages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.975,
    "end": 878.958,
    "text": "We're going to unpack that later, but it's a key claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.81,
    "end": 890.953,
    "text": " And then later in the paper, there is the aim to eventually formulate chaotic or itinerant systems under Bayesian mechanics, as has been done for earlier forms of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.533,
    "end": 897.855,
    "text": "And that's kind of what the paper is going to be leading towards and suggesting for future work, including that of g-theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.796,
    "end": 900.296,
    "text": "Anything that you fellows would add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.257,
    "end": 904.457,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.738,
    "end": 907.138,
    "text": "Could somebody read the abstract?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.135,
    "end": 933.74,
    "text": " Yeah, but before going into abstract, I wanted to point out one of the main goals of the paper, I think, would be there are a couple of new results in this paper that wasn't introduced, as far as I know, in the previous literature, one of which is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.706,
    "end": 950.693,
    "text": " derivation of classical physics from the principle of constrained maximum entropy and the reintroduction of supersymmetry as an explanation for classical chaos, as indicated on page five of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.834,
    "end": 955.916,
    "text": "So I think this is in some way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 957.016,
    "end": 964.781,
    "text": " This paper is a kind of expanded footnote to the previous papers, but also adding some new results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.681,
    "end": 977.328,
    "text": "I mean, it's a very important appendix to that paper by making some of the theoretical claims of specifically on Bayesian mechanics paper more concrete.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 978.308,
    "end": 1006.105,
    "text": " so yeah i just wanted to point that out as well great point this should be of interest to people who are following the development and applications of active inference and free energy principle but it will become clear that the scope is very broad and people even outside of what might be perceived as just this community will hopefully find interest and apply scrutiny and continue the conversation with us so somebody may read the abstract",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.336,
    "end": 1009.076,
    "text": " Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1009.196,
    "end": 1015.337,
    "text": "So Bayesian mechanics is a new approach to studying the mathematics and physics of interacting stochastic processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1016.057,
    "end": 1023.019,
    "text": "Here, we provide a worked example of a physical mechanics for classical objects, which derives from a simple application thereof.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1023.719,
    "end": 1027.019,
    "text": "We summarize the current state of the art of Bayesian mechanics in doing so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1027.659,
    "end": 1033.341,
    "text": "We also give a sketch of its connections to classical chaos, owing to a particular n equals two supersymmetry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1035.381,
    "end": 1035.921,
    "text": "Short and sweet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1038.186,
    "end": 1048.586,
    "text": " the roadmap all right so the paper begins with uh on putting us our video over the the top fellow on this uh stack",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.018,
    "end": 1073.815,
    "text": " the paper begins with an introduction and then dives into the concept of mechanics which we'll be talking more about the subsections there are covering classical physics in one dimension the basics of bayesian mechanics a physics of beliefs and then a physics by beliefs which is going to be kind of taking us into this cognitive lens",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.287,
    "end": 1086.632,
    "text": " Then a general equation, equation 15, for Bayesian classical mechanics is presented, and that'll be a really exciting equation and formalism to lead up to and unpack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.95,
    "end": 1112.96,
    "text": " following section four is a question of quantum ontology this is going to touch on discussions that we've had including in live stream 40 on the free energy principle for generic quantum systems and about what quantum means and how we can think about things that are often described as being at the atomic scale whether it's the idea of quantum mechanics itself or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1113.9,
    "end": 1123.091,
    "text": " bosons and fermions and all these other kind of like wait but i thought that was at the atom scale and what does it mean to apply it to cognitive systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.585,
    "end": 1131.351,
    "text": " There's then several cases that are addressed, and those are the worked examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.551,
    "end": 1139.018,
    "text": "That's the matching of modes, the tracking of modes with the subdivision into terminal mode matching and infinite mode tracking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.658,
    "end": 1144.443,
    "text": "And then towards the end, there's the adventuring into path tracking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.863,
    "end": 1151.309,
    "text": "These are the three phases of Bayesian mechanics, mode matching, mode tracking, and path tracking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.244,
    "end": 1155.525,
    "text": " We're going to look into it and a simple case of G theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.125,
    "end": 1159.285,
    "text": "And so that is where one gets to by the end of this journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1161.466,
    "end": 1172.628,
    "text": "But before we head off, as promised, we're going to dwell for a second on how we can set context to even head off on this journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.228,
    "end": 1180.79,
    "text": "So would anyone like to just describe like what the sections that we're about to jump into are about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.784,
    "end": 1185.311,
    "text": " and what led us to use this approach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.331,
    "end": 1192.203,
    "text": "Well, yes, actually,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.129,
    "end": 1206.013,
    "text": " As we discussed before, we will begin by looking at some historical perspectives and historical context of all the developments of FAP literature throughout the past two decades.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.593,
    "end": 1214.415,
    "text": "And then we'll look at some of the key literature on which this particular paper relies upon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.135,
    "end": 1220.537,
    "text": "And then we'll look at the three kinds of theories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1223.621,
    "end": 1228.509,
    "text": " that's been introduced in Bayesian mechanics paper as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1230.251,
    "end": 1235.296,
    "text": " the way of anchoring all the theoretical arguments there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1236.277,
    "end": 1253.993,
    "text": "And finally, we'll talk about the three non-Bayesian mechanics before delving into what Bayesian mechanics is and what are the differences and similarities between all the different kinds of doing physics or mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.457,
    "end": 1256.777,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1257.458,
    "end": 1268.129,
    "text": "This, we hope, sets the discussion within a historical and integrationist framing, and it's going to be quite a journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.189,
    "end": 1269.991,
    "text": "So let's head into this section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.652,
    "end": 1276.457,
    "text": "First, let's talk about some historical perspectives and different epochs of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.692,
    "end": 1294.317,
    "text": " Broadly, we can think about what happened before the free energy principles emergence in the pre-2000, the pre-millennial era, without going too specifically into what citation the free energy principle originates in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.417,
    "end": 1301.179,
    "text": "Then we can think about the free energy principle between roughly 2005 all the way up through 2020 around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.68,
    "end": 1321.148,
    "text": " and then lastly some of the changes and developments in free energy principle literature since about 2019 to 20 and some of dalton's contributions so starting with the free energy principle before 2000",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.16,
    "end": 1328.283,
    "text": " There's no definitive history yet for the antecedents of the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.044,
    "end": 1336.528,
    "text": "And surely a presentation or project more focused on that history could and should and will happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.409,
    "end": 1350.077,
    "text": "But a few of the places to search for in terms of the personal history of key contributors and also places where peripheral contributions and important foundational precursors are described",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.757,
    "end": 1370.581,
    "text": " Some places to look include the statistical parametric mapping, textbook and documentation, and the decades of research that went into the neuroimaging work on SPM, as well as a Carl Friston 2012 article, The History of the Future of the Bayesian Brain, and an interview with Carl Friston on Woodlice and Men,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.372,
    "end": 1378.676,
    "text": " as well as the auxiliary supplement to the above interview, Am I Autistic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.776,
    "end": 1380.157,
    "text": "An Intellectual Autobiography.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.818,
    "end": 1392.626,
    "text": "So that'll take somebody from the sort of zero to eight, and then eight to 28, and then 28 and beyond of Carl Friston's work and development with copious references out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.355,
    "end": 1418.8,
    "text": " On the right is a slide from Livestream 14 where we explore just one aspect of tracing the thread, which was from the analytical formalizations of, for example, Markov in terms of statistics and matrices all the way on through Perl and the computational implementation of Bayesian statistics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.813,
    "end": 1446.305,
    "text": " on through to modern developments that integrate those kinds of Bayesian formulations of statistics with action, which encompasses a variety of fields such as cybernetics, complex systems, synergetics, information theory, control theory, ecological psychology, 4E cognition, extended embodied, et cetera, et cetera, autonomous systems, and all other types of frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.286,
    "end": 1459.781,
    "text": " would be a history of the world to talk about everything that happened before 2000 but these are just some threats anything else that people want to add yeah maybe um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.86,
    "end": 1482.7,
    "text": " that as the theory gets more integrated to various different fields, I think it's going to be harder and harder to actually find that one thread that was the development towards the free energy principle, where the reality is probably that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1484.533,
    "end": 1492.563,
    "text": " As with all roads leading to Rome, many trajectories lead to the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1493.824,
    "end": 1494.084,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1495.266,
    "end": 1495.426,
    "text": "Ali?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1497.479,
    "end": 1522.841,
    "text": " And also related to this historical context, I wanted to point out the heated discussions that's going on during the last couple of years about the use of, I mean, some established vocabulary or terminology in active inference or FEP literature",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.522,
    "end": 1527.945,
    "text": " one of which is using the Markov blanket in a kind of different context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.845,
    "end": 1545.175,
    "text": "But as Maxwell Ramstead's Twitter thread from yesterday pointed out to a very interesting example, we can say the same for a lot of mathematical constructs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.635,
    "end": 1550.899,
    "text": "For example, we can look at the concept of zero",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1552.059,
    "end": 1556.263,
    "text": " as a purely mathematical construct, but used in different contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1556.303,
    "end": 1565.23,
    "text": "For example, it can be used as a null container or a null counter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.87,
    "end": 1570.534,
    "text": "But on the other hand, it can be seen as the solution of a polynomial or a function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.314,
    "end": 1579.661,
    "text": "And the same goes here for using the same mathematical construct or theoretical construct, Markov blanket,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.063,
    "end": 1581.404,
    "text": " but in a different context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.644,
    "end": 1602.962,
    "text": "But that doesn't mean markup blankets or any other theoretical concepts used in FEP literature are denying or somehow are contradictory with the previous usage of that terminology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1603.002,
    "end": 1606.665,
    "text": "It's just used in a different context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.806,
    "end": 1608.046,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.611,
    "end": 1623.36,
    "text": " So as a really concise way to summarize, again, something where further presentations and work can do a much more comprehensive job, there's a Maxwell Ramstad tweet thread from 7-11-2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.461,
    "end": 1631.885,
    "text": "And Maxwell breaks down developments in the free energy principle modeling into several waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.586,
    "end": 1635.148,
    "text": "And the tweet thread is readable here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.908,
    "end": 1639.331,
    "text": " The first wave doesn't have policy selection per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.911,
    "end": 1646.116,
    "text": "The dynamics of internal and active states was determined in a stepwise fashion through gradient descent on variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.776,
    "end": 1651.5,
    "text": "And so that was very much like a pure one-step gradient descent framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.38,
    "end": 1660.066,
    "text": "Second wave models started around 2012, equipped agents with beliefs about state transitions and the sensory consequences of movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.987,
    "end": 1665.03,
    "text": "That allows the calculation of expected free energy-like movements",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.206,
    "end": 1674.692,
    "text": " values and third wave models use a recursive expected free energy functional which opens up all of these related avenues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.412,
    "end": 1689.081,
    "text": "So Maxwell's thread here summarizes some of the waves of development and there's so much more to add and unpack because there's been developments on multiple different fronts or I wouldn't even know what word to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.101,
    "end": 1694.525,
    "text": "There has been formal developments and technical elaborations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.606,
    "end": 1712.372,
    "text": " as well as generalizations and also of course a huge area of philosophical discussion around these topics so um there's been a lot happening since 2005 to 2020 in free energy principle and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.563,
    "end": 1743.189,
    "text": " this is going to get us up to where we're ready to explore what's happened in the last few years from this kind of um building momentum and uh progress in the space anything to add yakup um um maybe just a short comment that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.451,
    "end": 1767.281,
    "text": " I think a lot of the first and perhaps even the second wave, we can probably see more influence of Carl Friston's prior work on SPM and all the literature that surrounds it, whereas in the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.029,
    "end": 1779.8,
    "text": " kind of third age or third wave, we are seeing more integrations into other fields like physics and overall complexity science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1781.701,
    "end": 1807.998,
    "text": " great point as the literature builds and as other collaborators began to upskill and contribute then we start seeing some different approaches but there's initially a lot of similarities with spm and it's really still quite a useful framework to use of course but also point back towards all right then on to the third epoch",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.147,
    "end": 1812.088,
    "text": " That's post 2020 and Dalton's contributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1812.708,
    "end": 1824.852,
    "text": "So we laughed and had a great time reviewing many of the fascinating developments over the last few years in a range of topics made by Dalton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.692,
    "end": 1831.494,
    "text": " ranging from fundamental physics to neuroscience, and most recently, Bayesian mechanics and g-theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.514,
    "end": 1834.635,
    "text": "A lot of the work is single author.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.295,
    "end": 1842.577,
    "text": "Other papers and works of note are collaborations, for example, with Ramstad, Friston, and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.597,
    "end": 1848.159,
    "text": "And this is just a few, this is some subset screenshots from our CODA",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.361,
    "end": 1863.443,
    "text": " knowledge integration work where we have a bunch of papers blog posts videos tweets we were just bringing together a lot of different information and we'll look forward to hearing it from the source soon enough",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.707,
    "end": 1876.313,
    "text": " The specific papers that we want to discuss, we're going to in the next session, but this is all to say that it's been a quite productive streak for Dalton and an awesome learning experience for us all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.373,
    "end": 1880.255,
    "text": "So we really appreciate all that work and we're looking forward to the conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.235,
    "end": 1883.877,
    "text": "Anything you want to add on this outside of the literature?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.079,
    "end": 1888.279,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1890.444,
    "end": 1892.306,
    "text": " Next, we will go to the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.026,
    "end": 1902.736,
    "text": "We're going to go through about four or five papers that are important steps on the way to getting to the worked example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.997,
    "end": 1905.318,
    "text": "So let's just go right into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.379,
    "end": 1910.383,
    "text": "This is going to be a paper from outside of the Friston sphere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.601,
    "end": 1914.822,
    "text": " in one sense, but not in another sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.863,
    "end": 1925.047,
    "text": "It's a 2012 paper by Udo Seifert, and the paper is called Stochastic Thermodynamics, Fluctuation Theorems, and Molecular Machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.821,
    "end": 1951.678,
    "text": " surely the paper is worth a deeper take but just to highlight at the very high level stochastic thermodynamics as reviewed here systematically provides a framework for extending the notion of classical thermodynamics such as work heat and entropy production to the level of individual trajectories of well-defined non-equilibrium ensembles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.779,
    "end": 1981.465,
    "text": " That is going to be a key move and theme, which is a move from a kind of undifferentiated mass action or mean field approximation physics and finding compatibility between that kind of an averaging and recovering that averaging outcome via individual trajectories of well-defined non-equilibrium ensembles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.552,
    "end": 2000.881,
    "text": " One can imagine that if they're interested in the consideration of specific counterfactual policies or in the behavior of multi-agent ensembles, simply having a mean field approximation, the kind of which classical thermodynamics has provided for work heat and entropy production,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.781,
    "end": 2011.485,
    "text": " it'll be another step and potentially an unprincipled or intractable one to ever go from that mean field down to the trajectory level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.165,
    "end": 2028.991,
    "text": "And so the kind of synthesis work that has to occur and is pointed towards here is to understand how a special case or a bridging formalism can connect this kind of mean field, population scale, summary statistic, aggregate world to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.635,
    "end": 2034.316,
    "text": " individual trajectories of well-defined non-equilibrium ensembles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.377,
    "end": 2036.617,
    "text": "Anything else to add on this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.099,
    "end": 2051.403,
    "text": "Well, actually, I think one of its, I mean, the central importance of this paper to Sacré-Cœur's current paper is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.261,
    "end": 2070.817,
    "text": " the definition of the probability, the path probability measure in the abstract Wiener space, mainly the equation number five, which I believe is a very significant preliminary stage toward deriving the general equation of Bayesian mechanics or equation 15.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.879,
    "end": 2074.219,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.06,
    "end": 2075.821,
    "text": "On to the next paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.176,
    "end": 2085.761,
    "text": " The next paper is a single author paper by Carl Friston in 2019, a free energy principle for a particular physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.402,
    "end": 2090.964,
    "text": "So it's a little small on the slide, but this is like an 148 page paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.705,
    "end": 2097.328,
    "text": "And you'll note there on the header, this work is under consideration for publication by the MIT Press.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.869,
    "end": 2100.01,
    "text": "So there's an interesting story behind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.45,
    "end": 2116.766,
    "text": " whose middle and end is unknown, about the recent active inference textbook and the way in which that is providing kind of a handbook of active inference, but then there's something more like a theoretical physics book that is going to be presented in some future time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2118.148,
    "end": 2120.13,
    "text": "Particular physics is a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.795,
    "end": 2138.625,
    "text": " multi-entendre or a pun in a few different ways this is a particular physics in the sense that because it's being specified it's like a specified or a specific physics like any dinner that you make is a particular dinner in that sense also really key",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.588,
    "end": 2149.074,
    "text": " to this notion of individual trajectories of well-defined non-equilibrium ensembles is the notion of the particle and the particular states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.674,
    "end": 2160.762,
    "text": "The particular states are referring to when we have a partition that uses the Markov blanket, so blanket states making internal and external states conditionally independent,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2161.522,
    "end": 2170.048,
    "text": " We can then talk about the blanket and the internal states as the particular states because they're like the particle that's floating around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.708,
    "end": 2181.015,
    "text": "So in the Brownian mechanics world, then you have the dust molecule floating around in the water and the particle is the dust molecule and then the external states are the water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.756,
    "end": 2188.36,
    "text": "And along those lines, the cognitive particle is going to be the internal and the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.82,
    "end": 2190.762,
    "text": "That's what's going to have cognitive mass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2191.622,
    "end": 2218.141,
    "text": " and inherit all of these physics terms that might be kind of like billiard balls are to classical mechanics we're going to be looking at what that particulate form is for cognitive systems this was an extremely important work conceptually as well as socially maxwell ramsted facilitated and organized a really amazing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.144,
    "end": 2233.688,
    "text": " discussion group over many months working with a lot of people to go through chapters and surfacing a lot of important dots that could be connected technical contributions raised by many participants in that reading group and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.37,
    "end": 2243.115,
    "text": " The work itself is a theory of everything, but perhaps in a way that people might not expect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.255,
    "end": 2244.556,
    "text": "So I'll just pause there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.696,
    "end": 2253.782,
    "text": "If either of you want to give any overview thoughts on the monograph, what does it mean by a theory of everything, or what else would you add about this precursor paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.388,
    "end": 2272.992,
    "text": " In fact, I wanted to point out an important note stated in the footnote number one of the classical physics paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2277.193,
    "end": 2284.836,
    "text": "In this paper by Carl Friston, the word particle is used, as you mentioned,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.89,
    "end": 2291.366,
    "text": " for the combination or the joint set of internal and blank states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.433,
    "end": 2300.899,
    "text": " But in the current paper, Dalton prefers to use the word system for that concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.779,
    "end": 2311.026,
    "text": "And where Friston's paper refers to system, Dalton's paper uses agent environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.827,
    "end": 2316.431,
    "text": "So that might be helpful for people who want to read that paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.131,
    "end": 2337.502,
    "text": " uh the literature because in the rest of the literature it's basically the same thing the word particle is used as the joint set of the internal and blanket states but not in this one thank you jacob want to add anything on the paper um maybe just do slightly uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.435,
    "end": 2355.801,
    "text": " add on the theory of everything that refers to the notion that anything that exists needs to have some kind of statistical independence from its environment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.044,
    "end": 2362.487,
    "text": " which constitutes a Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2362.547,
    "end": 2384.424,
    "text": "And I think we'll see in the coming slides that some contributions from Dalton have also shown this to be the case in cases where the FEP has previously been criticized for not actually applying generally to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.775,
    "end": 2391.238,
    "text": " to systems which don't reach that threshold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2393.58,
    "end": 2396.602,
    "text": "So yeah, just wanted to add that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2397.802,
    "end": 2398.063,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2398.743,
    "end": 2405.568,
    "text": "When people talk about a theory of everything and they leave out the space, they might mean like a theory of all of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.533,
    "end": 2423.605,
    "text": " But this is actually a theory of all of the, open parentheses, observer-dependent, modeler-dependent, close parentheses, things that can be distinguished, again, that's where the observer is, in the distinguishing, from other things in a statistical sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.506,
    "end": 2429.13,
    "text": "If you can't distinguish it over the timescale of observation, it's just not a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.094,
    "end": 2435.621,
    "text": " It's not to say that it's not part of someone else's theory of all of it, but in this sense, it's not a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.462,
    "end": 2445.793,
    "text": "And that's what is also setting up at a very fundamental level for this notion of systems engaging in the bounding of surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.834,
    "end": 2449.057,
    "text": "Because systems that don't bound surprise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.6,
    "end": 2477.362,
    "text": " will not be observed to be that kind of thing in the way that the surprise was limiting and the work also points importantly towards compatibility among quantum statistical and classical mechanics those are the three non-bayesian mechanics that we're going to be going into bayesian mechanics is going to generalize and encompass and integrate across all of these and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.641,
    "end": 2481.385,
    "text": " it may offer a formal description of lifelike particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.286,
    "end": 2489.937,
    "text": "For example, classical mechanics could tell you what happens when a 200-pound object falls out of a plane.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2490.822,
    "end": 2496.163,
    "text": " But I think as Dean has raised, what happens when that entity has a parachute?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2496.844,
    "end": 2498.124,
    "text": "So there's something different there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.684,
    "end": 2508.567,
    "text": "And what could the reductionist physicist do other than try to make a physics model of the elbow and of the ions coming in and out of the neurons?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.127,
    "end": 2511.928,
    "text": "Reductionism is kind of the way in that situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.717,
    "end": 2521.423,
    "text": " And so we're going to be talking about potentially a way to see that active particle falling out of the plane as something that could engage in agentic decisions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.805,
    "end": 2524.285,
    "text": "Next paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.606,
    "end": 2529.849,
    "text": "This next paper is the free energy principle made simpler, but not too simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.646,
    "end": 2531.046,
    "text": " Be careful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.548,
    "end": 2540.436,
    "text": "It is a paper from Carl Friston, DaCosta, Sajid, Heinz, Oldshofer, Pavliotis, and Parr.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.256,
    "end": 2546.702,
    "text": "We discussed this paper in several discussions earlier this year in livestream number 45.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.123,
    "end": 2561.692,
    "text": " We have 45.0, background and context, and we have the dot one and the dot two with Thomas Parr and Carl Fristen joining for the discussion and saying many interesting and funny things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.932,
    "end": 2587.698,
    "text": " the paper is providing a concise description of the free energy principle which begins from a Langvin equation and ends with a Bayesian mechanics that can be read as a physics of sentience noting here that sentience refers to feeling and acting entities not to qualia phenomenology experiential entities per se although people have provided interpretations that go that way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.662,
    "end": 2593.837,
    "text": " This paper rehearses key steps using standard results from statistical physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.909,
    "end": 2602.976,
    "text": " Those steps are going to be, one, establish a particular partition of states based upon conditional independencies inheriting from sparse coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.396,
    "end": 2607.32,
    "text": "Again, particular is being used in the pun sense as it was before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.84,
    "end": 2614.766,
    "text": "This is like one specific partition that you could choose to implement, and it's the one that results in particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.827,
    "end": 2620.672,
    "text": "Two, unpacking the implications of that particular partition in terms of Bayesian inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.65,
    "end": 2629.918,
    "text": " One of the kinds of inference that's really important is about internal states doing inference on external states mediated through sense states on the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.559,
    "end": 2644.152,
    "text": "And then three, describing the paths of particular states with a variational principle of least action, which is going to tie us towards understanding individual trajectories of well-defined non-equilibrium ensembles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2645.573,
    "end": 2669.573,
    "text": " um this paper was uh discussed elsewhere so here's Brock and I in the dot zero talking about non-equilibrium birds and then here um we have blue and Carl and Thomas and we're just trying to catch up with what they're adding anything that you fellows would add about this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.315,
    "end": 2703.674,
    "text": " all right now we're going to enter into the dalton zone so this is in april 2022 dalton presents a single author paper towards a geometry and analysis for bayesian mechanics the paper presents a simple case of bayesian mechanics under the free energy principle and formulates it axiomatically there's going to be a lot of interesting things to unpack um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.287,
    "end": 2708.81,
    "text": " Does anyone want to just give their read on the importance of this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2714.954,
    "end": 2734.189,
    "text": "I think this is one of the first papers Dalton has attempted to provide the rigorous mathematical foundation for FEP by providing some formal proofs of relevant theorems, but without, I mean,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.7,
    "end": 2740.303,
    "text": " going into a lot of technical jargons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.384,
    "end": 2752.272,
    "text": "I mean, this paper is pretty accessible for people even not specialized in mathematical proofs and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.913,
    "end": 2759.678,
    "text": "But I mean, by skipping those technical mathematical proofs, the whole paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2760.323,
    "end": 2768.606,
    "text": " conceptual framework or the gist of the paper is totally accessible, in my opinion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.586,
    "end": 2785.191,
    "text": "So I think this is one of the very significant and important steps toward developing the more comprehensive theory provided in their next paper on Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.192,
    "end": 2787.372,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.58,
    "end": 2804.03,
    "text": " This is going to be connecting the random dynamical systems formalization and takes a further step towards comprehensive statement of the physics of self-organization in formal mathematical language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.861,
    "end": 2808.923,
    "text": " which is presented using gauge theory and some geometric notions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.744,
    "end": 2826.574,
    "text": "And that's going to create a concordance that can be at least stated qualitatively, but has a lot of technical underpinnings, which is the relationship between the dynamical systems notion of self-organization in terms of bounded surprise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.001,
    "end": 2837.085,
    "text": " connecting that to a gauge-theoretic formalism of self-organization in which gauge forces are acting on the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.926,
    "end": 2846.209,
    "text": "And others can and please should help us unpack this and do math streams with us and do a .345.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.23,
    "end": 2852.112,
    "text": "Here, we're going to point a little bit more briefly to two recent papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.932,
    "end": 2853.772,
    "text": "Well, they're all recent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.353,
    "end": 2855.073,
    "text": "It's only September, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.113,
    "end": 2855.893,
    "text": "This was only five months ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.127,
    "end": 2862.83,
    "text": " Here is a paper from August.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.09,
    "end": 2867.314,
    "text": "Actually, both of them are from August, but the first one was first published in July.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.195,
    "end": 2873.419,
    "text": "The first paper is Weak Markov Blankets in High-Dimensional Sparsely Coupled Random Dynamical Systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.819,
    "end": 2874.84,
    "text": "That's a paper by Dalton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.441,
    "end": 2881.286,
    "text": "And then a paper with Maxwell, Dalton, and Karl, On the Map Territory, Fallacy, Fallacy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.886,
    "end": 2887.311,
    "text": "Would either of you like to just pick one of them and just describe what was cool or important about these papers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.368,
    "end": 2915.451,
    "text": " I would maybe say on the weak mark of blankets in high dimensional as far as the couple of random dynamical systems, I think that paper is really crucial because it does unpack a lot of uncertainty that many people might have had with the FEP before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.342,
    "end": 2925.656,
    "text": " especially the sparse coupling conjecture that finally received a formal proof.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2930.325,
    "end": 2958.779,
    "text": " And I think it's also important in this paper that we are going to discuss, especially when we are talking about systems at the quantum scale or beyond the quantum scale, where sparse coupling is a much more present notion than",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2959.784,
    "end": 2960.725,
    "text": " non sparse coupling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.745,
    "end": 2971.75,
    "text": "Yeah, I think this is a key paper in all of these prerequisite papers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2973.191,
    "end": 2979.634,
    "text": "Thank you, Ali, feel free to say something you'd like about either or both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.834,
    "end": 2986.057,
    "text": "Adding to what Jakob said about weak marker blankets paper, I think one other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2986.94,
    "end": 3010.346,
    "text": " A significant contribution of this paper to the FEP literature is the introduction of the concept of blanket index, which was a very sorely needed concept because by grading the markup blankets by this concept, we can see that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.967,
    "end": 3025.867,
    "text": " When we talk about any markup blanket, it's not a singular or necessarily 100% consistent concept, but it can be graded differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.86,
    "end": 3033.463,
    "text": " according to this blanket index, namely, when the blanket index is zero, we have the strongest Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.044,
    "end": 3040.167,
    "text": "I mean, that also recovers the sparse coupled conjecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.887,
    "end": 3051.032,
    "text": "But when it maximizes, we have this concept of weak Markov blankets, which is basically what most linear systems have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.414,
    "end": 3072.213,
    "text": " But when we discuss the higher dimensional systems or more complex systems, the Markov blanket index somehow minimizes or in fact goes to zero in sparse coupled systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3073.754,
    "end": 3074.095,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.435,
    "end": 3074.655,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.259,
    "end": 3098.662,
    "text": " an important contribution and maybe we can unpack this paper more as there also become more perhaps worked examples of weekly mixing markov blanket zones and anything to add on map territory fallacy fallacy go further",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.215,
    "end": 3108.316,
    "text": " Yeah, this is also a kind of, I believe, a response to some of the criticisms going on about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3109.879,
    "end": 3117.308,
    "text": " what's exactly the map and the territory of the FEP, I mean, the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.209,
    "end": 3125.637,
    "text": "Because most people believe that in FEP, maps and territories are conflated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.838,
    "end": 3129.621,
    "text": "And that's a problematic principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.444,
    "end": 3149.166,
    "text": " view in so many levels as discussed in this paper, because the claim of the FEP researchers are not that we have done some conflation of maps and territories in a kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.629,
    "end": 3157.034,
    "text": " as said on Bayesian Mechanics paper, a productive language abuse or notation abuse way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.594,
    "end": 3170.183,
    "text": "But actually these are exactly maps unto each other and we cannot separate them easily and talk about maps and territories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.263,
    "end": 3173.305,
    "text": "So the concept of map territory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.763,
    "end": 3187.729,
    "text": " fallacy fallacy comes from this viewpoint by which this so-called fallacy is itself another level of... Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.129,
    "end": 3189.41,
    "text": "All right, on to the next paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.43,
    "end": 3194.692,
    "text": "This is going to be a key recent paper from May 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.392,
    "end": 3198.994,
    "text": "It is on Bayesian mechanics of physics of and by beliefs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3200.382,
    "end": 3204.887,
    "text": " Of the Beliefs, By the Beliefs, For the Beliefs with Ramstead et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.708,
    "end": 3208.992,
    "text": "This is Act-Inf guest stream number 23.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.493,
    "end": 3219.505,
    "text": "So on the right, here's Dalton, Maxwell, and Lars and I talking about what looks to be like it's going to be an American baseball field, but actually it's a path of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.786,
    "end": 3240.854,
    "text": " and this paper introduces or reintroduces a field of study that has emerged over the last decade called bayesian mechanics and it's that reintroduction and uh like nice to meet you again for the first time which is why maxwell called the stream that we did rebooting the free energy principle literature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.136,
    "end": 3246.218,
    "text": " The paper is extremely accessible and engagingly written.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3247.178,
    "end": 3251.56,
    "text": "It reviews the state of the art in the literature on the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.32,
    "end": 3259.323,
    "text": "And then in this very nice figure that we're going to return to multiple times, introduces the three faces of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.026,
    "end": 3272.7,
    "text": " We're going to go into them more in the worked example paper, but they are fixed mode on the left, dynamic mode in the middle, and then path tracking on the right side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.869,
    "end": 3298.388,
    "text": " the broader or the higher order like genera or family level distinction is the fixed mode seeking and then the dynamic mode tracking are regarding modes of densities over states whereas path tracking moves us into a path native formalism rather than like a point in state space formalism and they're all faces of the bayesian mechanics under the free energy principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.674,
    "end": 3315.77,
    "text": " And this paper not only discusses those three faces of Bayesian mechanics, but it examines the duality of the free energy principle and the constrained maximum entropy principle developed and derived and explored in other Dalton work, which we're not going to talk about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.572,
    "end": 3317.932,
    "text": "Moving on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.094,
    "end": 3320.215,
    "text": "That was the key literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.553,
    "end": 3327.716,
    "text": " Now we're going to stick on this Bayesian mechanics paper and talk about three kinds of theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.576,
    "end": 3334.119,
    "text": "So the three kinds of theories that we're going to discuss are dynamics, mechanics, and principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.699,
    "end": 3342.423,
    "text": "And because theory can take on many meanings, it's important to quote the authors on how they use and therefore how we'll try to use the term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.104,
    "end": 3346.025,
    "text": "So they wrote, the word theory is polysemous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.305,
    "end": 3347.106,
    "text": "It has many meanings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.186,
    "end": 3353.189,
    "text": " What we have called dynamics, mechanics and principles are ultimately mathematical structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.769,
    "end": 3356.431,
    "text": "In mathematics, these are called mathematical theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.552,
    "end": 3361.094,
    "text": "The content of a mathematical theory or structure is purely formal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.974,
    "end": 3377.584,
    "text": "What are usually called scientific theories or empirical theories comprise a mathematical structure and what might be called an empirical application, interpretation or construal of that system, which relates the constructs of the mathematical structure to things in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.082,
    "end": 3387.347,
    "text": " So that is described and explored more in Guest Stream 23 and in this paper on Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.568,
    "end": 3390.849,
    "text": "Let's go first to dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.711,
    "end": 3396.672,
    "text": "Go for it, whoever would like to walk through these next three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.096,
    "end": 3407.839,
    "text": "Well, yeah, as indicated in Bayesian mechanics paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3408.991,
    "end": 3415.622,
    "text": " we can think about the dynamics of a system as a kind of descriptive or phenomenological",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.944,
    "end": 3428.33,
    "text": " let's say, description of the system, or the kind of description that tries to answer the what questions of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.89,
    "end": 3439.976,
    "text": "So if we look at it by the lens of many different physics or mechanics, in classical physics, we might",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.775,
    "end": 3450.591,
    "text": " characterize it as kind of Galilean or pre-Newtonian dynamics or in statistical physics we can say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3453.174,
    "end": 3458.838,
    "text": " the behavior of particles under diffusion as an example of the dynamics of the system in quantum physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3459.959,
    "end": 3465.183,
    "text": "We can talk about quantum dynamics as this kind of phenomenological description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.384,
    "end": 3474.229,
    "text": "And actually, we were talking the other day about this term Bayesian physics, which I've used in this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.269,
    "end": 3477.772,
    "text": "I'm not sure how Dalton would react to that, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.637,
    "end": 3489.084,
    "text": " in order not to duplicate the other slide, which talks about Bayesian mechanics explicitly, I use that term here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.085,
    "end": 3507.877,
    "text": "So yeah, in Bayesian physics, we're dealing with the system, the systems by which the dynamics of a self-organizing system, or some authors would call auto-organizing systems,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.054,
    "end": 3535.318,
    "text": " awesome so Dynamics are describing the what and we're showing Bayesian physics again with a caveat Ali just mentioned alongside the three other physics that we're going to be discussing integration among so Dynamics are the what that's how the billiards are moving on the table what is happening the next level is mechanics so somebody else may describe mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.174,
    "end": 3555.022,
    "text": " Yes, so the mechanics, so moving from understanding what the systems that we want to describe are, the mechanics can help us answer the how questions or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3556.062,
    "end": 3567.63,
    "text": " actually create the mathematical formalism that will be able to make predictions about what is going to happen and how it happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3567.81,
    "end": 3576.076,
    "text": "So in classical physics, we have classical mechanics, either Newtonian, Lagrangian, or Hamiltonian.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3577.137,
    "end": 3583.901,
    "text": "In statistical physics, we have statistical mechanics, quantum mechanics describing how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3586.212,
    "end": 3602.67,
    "text": " how things behave on a quantum scale, which we're also going to unpack a bit further in the coming slides, and then Bayesian mechanics with the mathematical formalism from the paper Physics of Beliefs, and also the worked example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3602.69,
    "end": 3603.51,
    "text": "So the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3607.034,
    "end": 3629.356,
    "text": " equations that come out of the mechanics are ones that can be used in a predictive sense and also in further trying to understand or in creating new systems that work on similar principles",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3631.297,
    "end": 3657.967,
    "text": " And I think mentioning principles might be a good transition into the third distinction, the why questions, which are kind of these overarching theorems or rather principles that say why things happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3659.116,
    "end": 3664.81,
    "text": " why the what and how questions or topics work the way they do and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3668.683,
    "end": 3685.117,
    "text": " principles usually form this kind of axiomatic or take this kind of axiomatic stance where from the principle everything else can be derived or can be put under the blanket of.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3686.057,
    "end": 3693.523,
    "text": "In classical physics the principle of stationary action is definitely one of the most fundamental that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3694.828,
    "end": 3711.802,
    "text": " When we have two points in space and we want a particle to go from one point to another, it will always follow a path of least action, a path of least energy along that path.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3713.984,
    "end": 3723.152,
    "text": "The same thing is present in statistical physics and quantum physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3724.033,
    "end": 3746.138,
    "text": " with quantum physics having the correspondence principle, which is very relevant in this paper, where in the limit of large numbers, quantum systems approximate to classical systems, which I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3747.651,
    "end": 3770.369,
    "text": " speaks to, is also related to the work here in the work example where quantum systems performing approximate Bayesian inference in a quantum setting follow classical paths on average, which we'll get into later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3770.609,
    "end": 3775.133,
    "text": "And then Bayesian physics, of course, having the free energy principle",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3777.256,
    "end": 3777.556,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.637,
    "end": 3785.883,
    "text": "And just to put up what that table looks like, we also had a ton of other correspondences and rows and columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.943,
    "end": 3802.957,
    "text": "So anyone who's interested in this kind of concordance building work would be encouraged to participate in the Institute because this is a really awesome tool and helps show us potentially areas where statistical mechanics has been applied as a mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.905,
    "end": 3805.727,
    "text": " can we bring Bayesian mechanics to bear?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.447,
    "end": 3817.116,
    "text": "Or areas where stationary action was applied for classical systems, can we talk about how the free energy principle might be able to reformulate that or provide access to new tools or new perspectives?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.597,
    "end": 3820.699,
    "text": "So this was part of our table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.241,
    "end": 3828.266,
    "text": "Let's go a little bit deeper into those three non-Bayesian mechanics or the three non-Bayesian physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3829.813,
    "end": 3844.203,
    "text": " Again, I'm really looking forward to exploring different ways that we can think and talk about these different physics and mechanics, but just one kind of way to think about how the special case of one physics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3845.043,
    "end": 3863.689,
    "text": " could be an entire other physics like jacob just described like in the so-called classical limit quantum systems behave classically but then also it has a space that goes beyond classical but that doesn't negate the relevance or utility or simplicity of classical mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3864.449,
    "end": 3869.81,
    "text": " So how can something be encompassing, but also provide identity for the special case?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3870.67,
    "end": 3878.932,
    "text": "And it reminded me of the anatomy of a mammalian muscle fiber with this kind of hierarchical organization of blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.252,
    "end": 3882.693,
    "text": "It even looks so much like the blanket illustrations that we've seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.673,
    "end": 3886.014,
    "text": "And so we can think about classical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.094,
    "end": 3907.648,
    "text": " as then being a limit case of statistical and statistical being a limit case of quantum and then that is where bayesian mechanics is going to come into play okay first classical mechanics who would like to do their uh short one slider presentation yes jacob um so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.803,
    "end": 3917.49,
    "text": " classical mechanics, as the name implies, describes the behavior of classical objects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3920.132,
    "end": 3934.162,
    "text": "And I think the kind of two main threads to highlight here that are relevant even for understanding the paper on the worked example of Bayesian mechanics is the Newtonian mechanics, which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3937.412,
    "end": 3948.68,
    "text": " is usually the classical mechanics that's the first that people hear about with forces describing how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3952.947,
    "end": 3964.675,
    "text": " with the description of the movements of objects described based on how forces are acting upon them and the three fundamental laws.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3965.316,
    "end": 3979.286,
    "text": "And then the Lagrangian mechanics, which takes this more energy slash principle of least action stance where the main...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3983.32,
    "end": 3999.829,
    "text": " of interest is the lagrangian which is just the kinetic energy minus the potential energy of the system and it takes a kind of higher level view of how uh of given given um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4000.689,
    "end": 4003.17,
    "text": " kind of generalized coordinates of motion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4003.27,
    "end": 4006.251,
    "text": "How do systems evolve through time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4006.271,
    "end": 4013.494,
    "text": "And then, of course, we could talk about Hamiltonian mechanics, which is just a transformation of Lagrangian mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4014.675,
    "end": 4017.556,
    "text": "But those are the two, I think,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4018.636,
    "end": 4021.017,
    "text": " main threats to understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4021.458,
    "end": 4039.468,
    "text": "And we also have the principle of least stationary action that can be visualized with the picture in the top right corner with the brachistochrone where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4040.248,
    "end": 4047.414,
    "text": " you have two points and multiple paths can be connected to that point, but only one path is the one of least action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4047.474,
    "end": 4062.686,
    "text": "And in this case, that would be the red path, where if you dropped a ball on that surface, the ball following the red curve would take the least amount of time to travel between those two points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4064.587,
    "end": 4065.668,
    "text": "Why is everyone in a hurry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.214,
    "end": 4070.736,
    "text": " Okay, onto statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4072.658,
    "end": 4075.099,
    "text": "Well, here, Ali, do you want to go for it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.342,
    "end": 4078.942,
    "text": "Well, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.643,
    "end": 4097.397,
    "text": "Statistical mechanics actually deals with the theories producing the behavior of systems with probabilistic degrees of freedom, especially the ensemble-level behavior of large numbers of functionally identical things, at least according to a Bayesian mechanics paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4098.258,
    "end": 4111.426,
    "text": " But I wanted to point out a comment made in one of Dalton's posts about the status of statistical mechanics in relation to all the other areas of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.586,
    "end": 4115.128,
    "text": "He writes, beginning from Einstein,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.53,
    "end": 4130.237,
    "text": " theoretical physicists were interested in formulating all these physical theories in terms of purely mathematical and rigorous formalisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.357,
    "end": 4143.123,
    "text": "And so we have a rigorous theory of classical mechanics and quantum mechanics and so on, but one conspicuous absence in this list",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.062,
    "end": 4168.279,
    "text": " is the statistical mechanics here because uh or thermodynamics uh because uh although we have some physicists uh in the 20th uh century physicists and mathematicians like james and karl mcgrath and so on uh but uh up to now statistical physics uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.312,
    "end": 4171.112,
    "text": " remains mystery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.393,
    "end": 4185.644,
    "text": "Not that all the related areas of physics, for example, the thermodynamical systems, condensed matter and soft matter or biological systems, they remain complete mysteries.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4186.244,
    "end": 4190.088,
    "text": "So one of Dalton's aims and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.429,
    "end": 4202.663,
    "text": " producing these literature throughout the past several months is, at least to the best of my understanding,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.515,
    "end": 4223.202,
    "text": " is to somehow cover up this yawning gap in the literature and doing that via formulating this Bayesian mechanics, which can encompass purely mathematical formalism of statistical mechanics as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.004,
    "end": 4250.476,
    "text": " And also one of the most fundamental principles of the statistical physics which Dalton has used in these papers in order to formulate Bayesian mechanics is Jaynes's maximum entropy principle, which is a principle by which the mechanics of statistical objects lead to diffusion or the descriptive dynamics of the systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.343,
    "end": 4252.504,
    "text": " Great, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.504,
    "end": 4266.911,
    "text": "And from this paper by Abad in 2012, we can start to bridge quantum and statistical mechanics by looking at how on different criteria, they have some concordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.231,
    "end": 4270.492,
    "text": "So this is like going one layer deeper into those concordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.513,
    "end": 4273.414,
    "text": "Let's go on to quantum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.454,
    "end": 4275.735,
    "text": "Okay, so quantum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.974,
    "end": 4280.537,
    "text": " We've discussed quantum a few times on these live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.517,
    "end": 4294.207,
    "text": "We've discussed some relevant topics in live stream 17 with Chris Fields, and then more recently in live stream number 40 with Fields, Glazebrook, Friston, and Levin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.148,
    "end": 4306.416,
    "text": "And would either of you like to describe quantum in terms of where it originated from and how we might be looking at it a little bit differently here than some have seen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4309.269,
    "end": 4337.128,
    "text": " Yeah, I think as physics developed over time and we were trying to describe smaller and smaller systems at higher precisions, at some point we realized that systems don't obey these classical laws set forth by Newton or Lagrange.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4337.975,
    "end": 4338.476,
    "text": " or others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4339.236,
    "end": 4346.603,
    "text": "And quantum mechanics is the formalism for describing systems on a subatomic scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4348.585,
    "end": 4362.757,
    "text": "I think that one of the two major concepts to mention is the Heisenberg's uncertainty principle, which states that when you have a subatomic particle,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4364.414,
    "end": 4378.535,
    "text": " there's always an uncertainty on its position in physical space and its velocity where there's actually this kind of uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4379.767,
    "end": 4393.296,
    "text": " entanglement of the two in the sense that if you know one with certainty you know the other with uncertainty and vice versa and you have this kind of um and you can move along this line where uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4395.638,
    "end": 4423.819,
    "text": " where you can partially know the position or partially know the velocity but not both at the same time, which I think is really interesting from the point of Bayesian mechanics because quantum mechanics is really one of the first subfields of science where the notion of an observer and the act of observation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4425.086,
    "end": 4436.511,
    "text": " has needed to be ingrained in the actual mathematical theory because you can't just shine a light on an electron because that will ultimately change the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4437.671,
    "end": 4448.136,
    "text": "And so the interaction of the observer and the environment and performing inference over how do individual things in the environment behave",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4454.471,
    "end": 4459.274,
    "text": " I think that's something that Bayesian mechanics is trying to unify.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4459.294,
    "end": 4464.517,
    "text": "And I think the quantum ontology is very relevant in this case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4464.878,
    "end": 4467.639,
    "text": "And of course, we have...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4469.494,
    "end": 4478.505,
    "text": " There are quantum mechanics is obviously a large field that's also connected to various other fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4478.725,
    "end": 4488.557,
    "text": "One other notion to mention would be the double slit experiment that's depicted in the image on the right, which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4490.338,
    "end": 4512.555,
    "text": " which was one of the first, if not the first, I'm actually not sure at the moment, instances showing the wave-particle duality of subatomic particles, in this case electrons, where particles display behaviors of both waves and...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4513.795,
    "end": 4520.358,
    "text": " and particles and the behavior is very dependent on the way that we do our observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4520.858,
    "end": 4536.685,
    "text": "If we want to observe the electrons passing through a slit before they reach the screen, that influences the behavior of the electrons then when we look at the screen after all of the electrons have passed through the slits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4539.705,
    "end": 4549.569,
    "text": " So we have these kind of weak Markov blankets, but before the introduction of weak Markov blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4551.069,
    "end": 4551.37,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.73,
    "end": 4557.132,
    "text": "It's kind of like all the jokes around how people behaving differently when you're observing them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.47,
    "end": 4560.271,
    "text": " Now there's a cognitive analog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4560.371,
    "end": 4563.072,
    "text": "So some of those intuitions weren't so far off after all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.912,
    "end": 4581.179,
    "text": "And we won't talk about the paper too much, but there's a recent paper from September, 2022, connecting the free energy principle with quantum cognition, where they introduced this concept of excess Bayesian inference, which is kind of like Bayesian inference in a quantum lattice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.779,
    "end": 4583.26,
    "text": "It's quite an interesting idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.36,
    "end": 4587.922,
    "text": "And it speaks to this intersection of quantum cognitive theories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.668,
    "end": 4597.775,
    "text": " Not in the sense, per se, that they've been developed in the ORC-OR domain, which is still like a physical material properties topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.793,
    "end": 4623.181,
    "text": " thinking about how atomic scale phenomena have rippling effects at the entity's level, the organism's level, whereas these applications of quantum cognition to larger cognitive systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4624.542,
    "end": 4633.269,
    "text": " may be absolutely compatible with those kind of ORCOR or quantum microtubule theories, but they do not require that to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.17,
    "end": 4641.456,
    "text": "It is more going to be referring to their ability to engage in counterfactual spaces and the relationality that Jakob mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.296,
    "end": 4644.918,
    "text": "All of that brings us to Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4646.38,
    "end": 4649.262,
    "text": "Okay, who wants to go for Bayesian mechanics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4654.445,
    "end": 4666.39,
    "text": " Well, yeah, in Bayesian mechanics, we are dealing with coupled systems that perform inference over the systems to which they coupled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.41,
    "end": 4676.615,
    "text": "In other words, we're dealing with particular partitions in the sense of Prism's 2019 paper or the rest of the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.482,
    "end": 4687.626,
    "text": " Or we're looking at the systems that minimize their own surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.166,
    "end": 4695.771,
    "text": "When the systems minimize their own surprisal, they must somehow know something about their environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.871,
    "end": 4707.318,
    "text": "I mean, inferring something about the external state is the classical view of the FEP, at least as it initially formulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.068,
    "end": 4732.798,
    "text": " But this surprisal minimization follows from a kind of synchronization between the internal and external states by a synchrony map or sigma, which is simply the statement that things which exist reflect the data about their environments, which is the other way of saying the above statement as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.55,
    "end": 4744.573,
    "text": " And also, things that are surprising are things that all not happen as we expect, like breaking the laws of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.713,
    "end": 4756.897,
    "text": "In other words, it might look as a kind of tautology for a system that we will not expect for a system to behave in a way, in a very surprising way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.017,
    "end": 4762.279,
    "text": "In other words, behave in a way that obey the laws of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4763.079,
    "end": 4778.69,
    "text": " But one of the main points of the Bayesian mechanics is to formulate this exact viewpoint by not focusing on a single trajectory of a behavior, but by somehow...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.864,
    "end": 4788.769,
    "text": " generalizing that statement to a whole fiber bundles of behavior as they say in the gauge theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4790.129,
    "end": 4804.036,
    "text": "And systems in this sense can somehow be duly described instead of the traditional view of the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4805.697,
    "end": 4809.319,
    "text": "They can be described from the other way around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4809.839,
    "end": 4813.223,
    "text": " by using the constraint maximum entropy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.664,
    "end": 4826.018,
    "text": "I mean, instead of looking at the system or agent from the inside and trying to somehow formulate its inference of its external state, we can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4829.12,
    "end": 4843.884,
    "text": " put the observer in the external environment, looking at the system and deriving the exact same formulation by just flipping around or inverting the sigma synchrony map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4845.264,
    "end": 4853.826,
    "text": "So that's one of the, I believe, central ideas of, sorry, central ideas of Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4855.627,
    "end": 4855.887,
    "text": "Jakob?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4857.759,
    "end": 4887.121,
    "text": " would uh just kind of summarize that by pointing attention to uh the image in on the slide um i'll read the caption i'll read the caption and you can provide an image meme analysis the left side says when the tree blows and shakes a tree branch it is because the tree branch has inertia but not enough to resist the force of a wind on another dot and then on the right side",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.65,
    "end": 4912.638,
    "text": " says when the wind blows and shakes a tree branch it is because the tree branch reduces its surprisal about the state of the world by modeling it yes so these are essentially equivalent statements one from the classical perspective another from the bayesian mechanical perspective uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4913.877,
    "end": 4933.143,
    "text": " I think this notion might initially sound counterintuitive, which is why I think it's good to start talking about it now so that it has time to settle by the time we reach g-theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4937.264,
    "end": 4941.085,
    "text": "I think that pretty much summarizes it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4942.355,
    "end": 4966.481,
    "text": " yes it's pan inferentialist without being pan psychist per se ali also pointed to that extremely important theoretical duel between the free energy principle and constrained maximum entropy principle which then was mapped onto this view from the inside which is kind of a strategic agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4967.401,
    "end": 4974.027,
    "text": " trying to synchronize with external states or learn or reduce their surprise about external states as mediated by the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4974.367,
    "end": 4975.629,
    "text": "That's the view from the inside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.229,
    "end": 4985.357,
    "text": "And the view from the outside, which brings us to the relationality Jakob raised in the quantum space, the view from the outside is as an experimenter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4986.178,
    "end": 4993.745,
    "text": "And the fact that Dalton has shown that these two frameworks are dual to each other is provided some of the most important theoretical synthesis in the area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.085,
    "end": 5023.891,
    "text": " now the three faces of bayesian mechanics so i'll uh bring larger a slide that was shared at iy recently the 2022 conference and it shows the three faces of bayesian mechanics mode matching mode tracking path tracking those are the three faces that also are reflected in the earlier paper and that was guest stream 23.1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.536,
    "end": 5037.025,
    "text": " In addition here, we see on the right is this chaos, and that is kind of a little bit beyond where we're going to go today, but it's an exciting direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5037.285,
    "end": 5042.43,
    "text": "So does anyone want to describe the three faces, and then we'll head into the topics and paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5050.537,
    "end": 5050.877,
    "text": "Do you think...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5053.379,
    "end": 5063.887,
    "text": " Maybe because we have detailed slides for each of the... Yeah, just to say that these are three different phases of Bayesian mechanics, and we'll talk more about them soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.728,
    "end": 5066.85,
    "text": "Okay, here are some topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.31,
    "end": 5076.898,
    "text": "We're not going to talk about them at all, at all, but we left some open slides and space to add even more because they're topics that we want to talk with Dalton and you all about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5077.678,
    "end": 5080.841,
    "text": "So supersymmetry, this was the citation in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5082.844,
    "end": 5101.828,
    "text": " free energy principle and constrained maximum entropy principle as theoretical duels Bayesian fermions bosons and ghost fields and anything else that people bring up we made it to the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5105.0,
    "end": 5132.072,
    "text": " let's review the roadmap before we really head off on this journey and to make this a reasonable dot zero and not go out too far beyond what we all understand here we're just going to be really looking at a few uh key points and if either of you want to highlight something please just raise your hand and highlight it on that slide otherwise we're just going to take a brief stroll through the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5134.355,
    "end": 5137.537,
    "text": " So again, just raise your hand on the slide if you want to say something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5139.599,
    "end": 5162.234,
    "text": "The paper begins with a formalization or a scoping of the formalizations that will come in terms of Bayesian mechanics and about how it's going to connect to derivations of classical physics, constrained maximum entropy or constrained maximum caliber, as well as supersymmetry theory in classical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.659,
    "end": 5178.604,
    "text": " Section two, classical physics in one dimension, is studying the mechanics of classical objects and the way in which that they embody Newton's law, which is that systems accelerate along force gradients.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5179.584,
    "end": 5193.909,
    "text": "Think back to Jakob's distinction between Newtonian mechanics as forces acting on objects versus the Lagrangian formalization, precisely in the direction and magnitude of the total force applied, no more and no less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5197.924,
    "end": 5213.948,
    "text": " Section 2a continues along on this direction and talks about different ways that mechanics can be specified around motion in gravitational fields like moving objects and also approximations arising from fluid flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5218.25,
    "end": 5220.87,
    "text": "Section 2b is the basics of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5221.71,
    "end": 5226.492,
    "text": "Bayesian mechanics can be seen as an account of the laws of motion deriving from the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5227.54,
    "end": 5240.523,
    "text": " concerning how Bayesian beliefs, that is systems with beliefs, such as coupled random dynamical systems, which prefer inference over the things to which they couple, behave under certain determinants of probabilistic motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5241.644,
    "end": 5243.144,
    "text": "And this is another really interesting note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5243.784,
    "end": 5250.266,
    "text": "Much like classical mechanics serves as an account of systems that obey Newton's second law by minimizing classical action,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.103,
    "end": 5259.709,
    "text": " Bayesian mechanics is an account of systems that engage in approximate Bayesian inference by minimizing surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.69,
    "end": 5264.393,
    "text": "So the ball minimizes energy by falling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.013,
    "end": 5267.936,
    "text": "The candle minimizes Gibbs free energy by burning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.016,
    "end": 5276.463,
    "text": "Cognitive systems are minimizing free energy by way of minimizing surprisal, otherwise they would fail to be that thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5279.265,
    "end": 5281.167,
    "text": "2b continues on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5282.369,
    "end": 5307.478,
    "text": " to to be or not to be the pure physics of the fep arguably dates back to two landmark papers in the literature a free energy principle for particular physics risked in 2019 and markov blankets information geometry and stochastic thermodynamics which we didn't review here the fep has gestured at a new sort of physics and that is what this work is recently bringing a uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5309.704,
    "end": 5319.93,
    "text": " quite exciting crescendo and examples of, and here is a referral to the dual nature of FEP and constrained maximum entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5321.911,
    "end": 5332.777,
    "text": "Continuing on in section 2b, we see a little bit of an unpacking around the idea that the FEP is a least action principle, a prior to surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.933,
    "end": 5341.919,
    "text": " where the application of least-surprisal principle to specific objects determines the mechanical theory about these objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.74,
    "end": 5353.188,
    "text": "And so it would be awesome for those who are familiar with Ito calculus and stochastic differential equations, Lagrangian mechanics, and path probability measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5354.689,
    "end": 5356.29,
    "text": "Here we get to equation 15.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.971,
    "end": 5359.613,
    "text": "Ali, if you want to unpack a little bit what's happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5362.571,
    "end": 5374.635,
    "text": " Yes, actually, equation 15 is a kind of generalization of equation 5 for a modal path given by the equation 12.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5376.896,
    "end": 5389.9,
    "text": "And this equation is described as the general equation for Bayesian classical mechanics, or we can see that as the most central equation by which all the other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5390.447,
    "end": 5396.342,
    "text": " results or their derivations can potentially be derived, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5397.605,
    "end": 5398.848,
    "text": "So here Q,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5400.45,
    "end": 5423.726,
    "text": " represents the position, but as a slight caveat here, because in most other literature, Q is used for designating the recognition density, but in this paper, recognition density is designated with R. So the Q is reserved for position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5424.867,
    "end": 5427.229,
    "text": "And obviously T is also the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5428.525,
    "end": 5432.708,
    "text": " The lambdas here represents the Lagrange multipliers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.689,
    "end": 5451.458,
    "text": "And we have a kind of limiting situation or limiting condition in which the inverse of lambda is much lower than one and the lambda two is equals to one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5451.658,
    "end": 5454.72,
    "text": "Yes, that's exactly the point there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5455.698,
    "end": 5459.809,
    "text": " And in this limiting situation, we can reproduce the classical dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5460.351,
    "end": 5462.376,
    "text": "In particular, in the limit lambda 1,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5464.77,
    "end": 5467.991,
    "text": " it goes to infinity, there is no uncertainty at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5468.371,
    "end": 5479.733,
    "text": "And the most likely path under those constraints, the classical path of least action by construction is the only path we lend any non-zero probability to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5480.233,
    "end": 5490.895,
    "text": "So all the other classical and even quantum derivations can potentially be, again, be derived from this central equation here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5491.926,
    "end": 5492.166,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5492.527,
    "end": 5495.349,
    "text": "We have all the equations prepared to explore further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5496.29,
    "end": 5499.812,
    "text": "Now we're going to go into those three phases of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5500.413,
    "end": 5503.736,
    "text": "So let's just start with mode matching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5504.716,
    "end": 5506.478,
    "text": "Jakob, do you want to describe mode matching?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.524,
    "end": 5517.846,
    "text": " Yeah, so mode matching is the simplest case of Bayesian mechanics for stationary objects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5519.226,
    "end": 5532.729,
    "text": "The interesting thing that Dalton mentioned in the paper is that mode matching is only really valid for brief time scales, implying that nothing ever really stays stationary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5534.841,
    "end": 5555.995,
    "text": " would be interested to uh unpack this further in the dot one and the dot two how brief these time scales can uh can actually be is it just instantaneous is anything ever stationary and how are different reference frames involved but in the simplest case uh we can",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5558.436,
    "end": 5574.846,
    "text": " Mode matching considers objects that at least in the approximate sense are stationary, like a ball resting on the ground, where the ball is essentially doing approximate Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5575.966,
    "end": 5602.165,
    "text": " on the on its gravitational pull and on the normal force that is uh acting to resist that gravitational pull and in the bayesian mechanical sense if it wouldn't do that that would be surprising and therefore it wouldn't be a ball because it would fail to act within the confines of the environment and therefore",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5603.456,
    "end": 5625.774,
    "text": " In mode matching, Bayesian mechanics does reduce to, or rather imply Newton's first law, where for every applied force, there is a force of equal magnitude applied in the opposite direction, or for every action, there's a reaction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5627.015,
    "end": 5627.275,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.756,
    "end": 5629.557,
    "text": "Like, why don't you ever change your mind?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5630.578,
    "end": 5631.459,
    "text": "I'm mode matching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5631.979,
    "end": 5632.92,
    "text": "What are you talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5634.178,
    "end": 5635.819,
    "text": " I'm doing optimal Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5636.399,
    "end": 5637.28,
    "text": "I've been doing it all day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.3,
    "end": 5638.841,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5639.862,
    "end": 5640.502,
    "text": "Mode tracking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5641.263,
    "end": 5651.689,
    "text": "So in mode tracking, we're going to now generalize from that ball resting on the ground to what setting, Ali or Jakob?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5656.512,
    "end": 5662.716,
    "text": "ALI AFSHAR- Well, yeah, in the mode tracking, unlike the case of mode matching, we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5664.707,
    "end": 5672.17,
    "text": " the target mode or the desired mode toward which the systems are tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5672.691,
    "end": 5678.713,
    "text": "So that's, I believe, the main difference between the mode matching and the mode tracking approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5681.535,
    "end": 5684.096,
    "text": "But within the mode tracking,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.996,
    "end": 5694.939,
    "text": " we also have two subtypes of mode tracking, one of which is the terminal mode matching and the other one is the infinite mode tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5696.119,
    "end": 5707.043,
    "text": "So in the case of terminal mode matching, we already have the terminal modes toward which the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.389,
    "end": 5719.705,
    "text": " actually somehow the probabilistic space of the system tracks its trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5720.567,
    "end": 5723.151,
    "text": "But in the case of infinite mode tracking,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5724.066,
    "end": 5738.073,
    "text": " we don't have, I mean, some endpoints because it's a kind of analogous to a circular satellite motion by which we don't have the beginning and the end of the trajectory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5738.233,
    "end": 5747.198,
    "text": "So also this kind of mode tracking has been described as an alternative term, a mode chasing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5748.759,
    "end": 5751.8,
    "text": "So I believe we can...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5754.176,
    "end": 5757.797,
    "text": " elaborate and unpack the details of that with Dalton.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5758.837,
    "end": 5759.077,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5759.657,
    "end": 5759.997,
    "text": "Jakob?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.278,
    "end": 5764.518,
    "text": "I would just add to the infinite modes tracking case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5764.799,
    "end": 5775.221,
    "text": "One very interesting thing that Dalton mentioned in the paper is that when you have a constant path that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5779.707,
    "end": 5790.784,
    "text": " you're performing the infinite mode tracking on, the state of the, the surprisal of your states are always",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5791.989,
    "end": 5813.563,
    "text": " non-zero which i find really interesting because for me it kind of implies that there's always a certain level of uncertainty but at the same time this contrasts with the infinite case where for for the case of planets orbiting orbiting the sun um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5817.106,
    "end": 5827.45,
    "text": " there shouldn't be that much uncertainty about the path because you know you're going to follow that path till the end of time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5829.071,
    "end": 5832.412,
    "text": "Just one thing that I found interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5833.833,
    "end": 5834.153,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5834.633,
    "end": 5842.857,
    "text": "So again, just to recap for those who are looking for those worked examples, in the mode matching case, we have a ball on the ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5844.059,
    "end": 5846.001,
    "text": " the mass is not moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5847.163,
    "end": 5854.811,
    "text": "We then have a situation where the equilibrium steady state, so to say, is not moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5855.962,
    "end": 5883.87,
    "text": " where the mass is now the center of gravity is in motion in the mode matching case the center of gravity is not in motion the two cases of mode tracking where the center of gravity needs to be moving cognitive center of gravity is terminal mode matching which is equivalent to a ball thrown in a parabola where there's some defined end point but it's moving along a path of least action towards that end point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5884.87,
    "end": 5891.795,
    "text": " And infinite mode tracking, where it's in a continuous dynamical or oscillatory acceleration process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5892.435,
    "end": 5897.098,
    "text": "And again, it's super interesting to think about what these actually entail cognitively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5897.118,
    "end": 5898.759,
    "text": "I'm sure we'll get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5900.14,
    "end": 5900.981,
    "text": "On to section seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5901.521,
    "end": 5911.468,
    "text": "So section seven broadens the discussion from the state tracking framework of modes, remembering this phrase,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5912.958,
    "end": 5941.466,
    "text": " image where all of the modes whether fixed mode or dynamic mode are regarding densities over states now we have densities over paths enabled by the gauge theoretic formalisms so here are some equations and quotes related to path tracking anything to add i would just i just wanted to mention yes go ahead go ahead yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5943.001,
    "end": 5956.769,
    "text": " Sorry, I would just explicitly mention one point on the slide, that path tracking is essentially the formulation of mode tracking seen as a gradient ascent on the path of probability density.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5957.429,
    "end": 5970.596,
    "text": "I think that is an important notion in understanding what the difference between path tracking and most tracking is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5972.389,
    "end": 5997.89,
    "text": " And also, maybe as a slight mathematical joke, the usage of the word reduces to when moving in between equations that employ the path tracking formalism can also be a bit uncertain on the first read.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6003.567,
    "end": 6003.767,
    "text": " Ali?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6006.789,
    "end": 6018.114,
    "text": "Yes, I also wanted to mention that active inference is kind of subsumed in this type of path tracking systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6018.374,
    "end": 6020.235,
    "text": "So and also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6021.108,
    "end": 6025.429,
    "text": " the initial formulations of FEP up to 2019.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6026.23,
    "end": 6048.637,
    "text": "I mean, especially the 2019 Carl Friston's monograph implicitly deals with this path tracking approach, as far as I know, but somehow this typology of different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6049.284,
    "end": 6070.431,
    "text": " kind of Bayesian mechanics is pretty new to these recent literature and before that there was a lot of there were a lot of confusions and misunderstanding about what kind of systems are we dealing with in each paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6072.552,
    "end": 6072.872,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6074.292,
    "end": 6075.093,
    "text": "Then at the very end",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6076.212,
    "end": 6078.773,
    "text": " there is a first idea of G theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6079.673,
    "end": 6097.418,
    "text": "So just like variational free energy has F, equation 2.5 in the textbook, and expected free energy is G, equation 2.6 in the textbook, here we move from F, free energy principle, Friston, to G, beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.739,
    "end": 6102.04,
    "text": "And we'll talk more about this with Dalton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6102.82,
    "end": 6105.901,
    "text": "But if anybody wants to add anything, they're welcome to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6110.618,
    "end": 6134.07,
    "text": " I think one thread that was open towards the end of the paper was with the application of g-theory to chaos with the notion that we can use Bayesian mechanics to study systems that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6138.376,
    "end": 6142.898,
    "text": " that are dependent on the initial conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6143.499,
    "end": 6158.346,
    "text": "And even though this was so far purely described in the context of non-biological entities, I think it's really exciting to see the potential applications in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6159.204,
    "end": 6172.094,
    "text": " applied active inference where your initial belief states do influence your trajectory through the high dimensional state space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6172.935,
    "end": 6182.062,
    "text": "And I think it will be very interesting to see how g-theory develops in that way and to see more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6182.99,
    "end": 6194.888,
    "text": " connections between how we can use notions from supersymmetry and chaos to studying cognitive systems or physical systems cognitively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6194.908,
    "end": 6196.25,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6198.695,
    "end": 6199.015,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6199.476,
    "end": 6200.276,
    "text": "Very well said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6200.976,
    "end": 6206.86,
    "text": "Like there are phase transitions or critical moments where when the ball falls on one side of the roof, it goes that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6207.02,
    "end": 6209.482,
    "text": "And when it falls on the other side of the roof, it goes a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.402,
    "end": 6215.325,
    "text": "And there are just noticeable differences in terms of our psychophysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6216.326,
    "end": 6220.808,
    "text": "And this is really bringing the physics to psychophysics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.289,
    "end": 6223.33,
    "text": "And it's been quite a journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.531,
    "end": 6228.293,
    "text": "If either of you have any penultimate thoughts, please provide them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6232.418,
    "end": 6249.861,
    "text": " Well, as I said before, it's been an extremely fascinating learning experience for me personally, and I'm very much looking forward to discuss all of these stunning ideas with Dalton and learn much more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6250.441,
    "end": 6252.461,
    "text": "So thanks to everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6253.822,
    "end": 6254.322,
    "text": "Thank you, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6254.542,
    "end": 6254.862,
    "text": "Jakob?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6256.622,
    "end": 6259.763,
    "text": "Yeah, I think I made my over",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6262.441,
    "end": 6286.749,
    "text": " my kind of ending remark uh with the with the last uh comment but yeah it's been it's been an incredible journey so far and definite and an extremely fun experience to try to unpack this and uh in in our discussions and i look forward to unpacking even more and uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6288.644,
    "end": 6304.874,
    "text": " seeing how how uh this thread develops yes thanks both and andre for all the work leading up to it and until next time thanks bye",
    "speaker": "SPEAKER_00"
  }
]