[
  {
    "start": 8.513,
    "end": 37.142,
    "text": " hello and welcome it's august 16 2023 we're in the collective behavior discussion section of the active inference for the social sciences course in 2023 so perhaps let us all go around and give a opening introduction and or reflection and see who joins and what happens from there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 37.702,
    "end": 48.792,
    "text": " but just so that everybody has said hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.812,
    "end": 52.595,
    "text": "Hi everyone, I'm Bryn.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 52.655,
    "end": 58.119,
    "text": "9pm in South Africa and yeah, just excited to be here and see what happens.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 66.897,
    "end": 67.577,
    "text": " Hi, I'm Andrew.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 67.597,
    "end": 70.759,
    "text": "I'm a graduate student in Indiana.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 71.299,
    "end": 79.162,
    "text": "And I guess my field of interest now is knowledge management.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 79.262,
    "end": 90.166,
    "text": "And I think that figuring out how we collectively learn and can share information is a really interesting topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.246,
    "end": 92.627,
    "text": "And I'd like to see how this would apply.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 98.1,
    "end": 115.228,
    "text": " Hi, I'm Regina and I'm from Guatemala, but I'm living in Spain, studying and doing experiments related to this topic and trying to learn a little bit of the theory that's behind it so we can advance better.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 116.089,
    "end": 116.569,
    "text": "I'm excited.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 120.776,
    "end": 122.177,
    "text": " Hello, my name is Sasha.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 122.357,
    "end": 124.258,
    "text": "I'm calling in from California.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 124.398,
    "end": 125.679,
    "text": "I'm also a graduate student.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 125.699,
    "end": 132.504,
    "text": "Yeah, just really enjoyed the spirited presentation last week.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 132.704,
    "end": 133.945,
    "text": "I'm looking forward to a discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.965,
    "end": 140.309,
    "text": "All right, well, how about anyone can...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.96,
    "end": 146.663,
    "text": " give a first reflection on collective behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.843,
    "end": 156.15,
    "text": "What was their thought or context before and where are they at as we kind of begin?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.41,
    "end": 156.971,
    "text": "Yeah, Regina.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.094,
    "end": 166.677,
    "text": "Okay, so I just want to make sure that I understand because I took like two big steps",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 167.671,
    "end": 195.554,
    "text": " lessons from your lesson right and the first one is that um you know this this famous model of active inference that has the agent and the environment and the mark of blanket in the middle right and just interacts with everything right so i think what i got from what you discuss um maybe i didn't have a good definition of an agent but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 196.061,
    "end": 213.113,
    "text": " first that you can have that agent not be just an individual but also your definition of an individual changes depending on what you want to study in the behavior right so an agent can be an ant",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 213.863,
    "end": 222.15,
    "text": " It can be an ecosystem, it can be an eye looking at something, or it can be a society, for example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 222.391,
    "end": 233.961,
    "text": "And I think that's a big take for me because it changes a lot the concept of how to study things and use active inference just by changing how big the agent can be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 235.002,
    "end": 237.524,
    "text": "So I don't know if I got that right, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 238.044,
    "end": 239.866,
    "text": "So first that clarification.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 243.632,
    "end": 244.736,
    "text": " So what is an agent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.02,
    "end": 255.043,
    "text": " Yeah, so I don't know if there's like a formal definition of an agent in active inference, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 255.223,
    "end": 266.849,
    "text": "But if we want to study whatever we want to study, because I have to do experiments, that's like my goal, whatever I'm doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 267.469,
    "end": 273.953,
    "text": "So I want to study whatever I have to choose what's going to be my agent and the environment it has.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 274.853,
    "end": 281.04,
    "text": " So choosing the agent, you can do it to create a model or to make an experiment, whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 281.941,
    "end": 293.575,
    "text": "But the choice you make, it will depend on what you understand as an individual or as an agent, if I think so, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 305.29,
    "end": 305.57,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.63,
    "end": 306.571,
    "text": "Anyone have a thought on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.651,
    "end": 306.851,
    "text": "No.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 308.972,
    "end": 313.095,
    "text": "If I continue with Spina, just to add something else, and this will be my mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 314.796,
    "end": 334.69,
    "text": "And then I'm thinking is that also a big problem that we have, or I think I have, is that since I am part of the environment, you know, the perspective of whoever is studying, whatever it is, it's also going to be an effect in it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 335.683,
    "end": 347.468,
    "text": " So maybe scientists already decided, but I don't know that we can never have an objective way of studying something if you're part of the environment of the agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 348.402,
    "end": 352.246,
    "text": " So I don't know if we already forgot it or we already decided that's it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 352.766,
    "end": 355.889,
    "text": "We cannot have objective observations of behavior in general.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 356.649,
    "end": 365.618,
    "text": "But, you know, you always think about like the agent environment and you studying it as something else, but there's something else is also affecting it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 365.758,
    "end": 374.806,
    "text": "So I see that as a problem or maybe something that has to be said, like we are not objective because we're part of what it's affecting our agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 375.549,
    "end": 377.73,
    "text": " in the behavior collectively too.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 378.571,
    "end": 381.252,
    "text": "So those are the thoughts I have to share.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 384.434,
    "end": 387.095,
    "text": "Regina, I'm also new to all of this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 387.135,
    "end": 402.104,
    "text": "So my preliminary understanding of orders and agents is anything that has any good reason to self-evidence and to itself or to survive",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 403.104,
    "end": 429.603,
    "text": " um that doesn't want to dissipate that might delineate the boundary of what an agent is that then sets up uh um the boundaries with which it um will as you described start interacting with the world with the environment so if something as i understand it if something has a reason to go on being to survive um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 432.939,
    "end": 461.965,
    "text": " um then it is an agent in the world okay but but that agent could be anything right like is that what you're saying right like if he wants to survive it can be an ant surviving individually or a cell or or a group okay yeah that's a good that's like a good definition okay yeah sasha",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 464.497,
    "end": 465.738,
    "text": " Great points, Regina.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 466.458,
    "end": 467.339,
    "text": "So much to say there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 469.021,
    "end": 483.454,
    "text": "It's something that I have experience with as a researcher in biology is deciding the kind of the statistics or sampling approach to use, whether we're taking, you know, one cell sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 484.275,
    "end": 506.632,
    "text": " from one individual or we're taking many cells from many individuals and how to do the statistics and kind of um sampling approach on that um that is a you know an evergreen question that we're always reevaluating to see um how to think about the independencies within biological systems um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 508.061,
    "end": 515.168,
    "text": " And then another thing that you mentioned was about the individual being part of the ecosystem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 515.628,
    "end": 527.18,
    "text": "And that makes me think a lot about complexity science, and something that is addressed there in thinking about the interplay of the scientist and what they're studying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 527.2,
    "end": 531.384,
    "text": "Yeah, thank you for those points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 539.918,
    "end": 542.84,
    "text": " Sorry, I'm not raising my hand.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 542.86,
    "end": 544.121,
    "text": "I'm just unmuting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 545.382,
    "end": 545.922,
    "text": "That's okay.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 546.142,
    "end": 549.524,
    "text": "Can you say a bit more about what you mean by complexity of science?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 562.572,
    "end": 563.152,
    "text": "Maybe muted?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.172,
    "end": 566.814,
    "text": "Oh, can't speak at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.461,
    "end": 582.801,
    "text": " yeah complexity science has looked at agent agent-based modeling as a fundamental tool John Holland signals and boundaries focusing on what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 583.889,
    "end": 605.857,
    "text": " an active inference side we might say is like message passing or communication for the messages and then boundaries with the whole discussion around the boundaries in the world map territory map territory fallacy map territory fallacy fallacy doing iterative modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.31,
    "end": 631.711,
    "text": " sasha brought up limited experimental resources in the scientific setting and that's kind of analogous to the limited energy budget or attentional budget ultimately or just decision making budget of uh the kinds of active entities that make sense to model the ones that kind of have those uh characteristics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 634.113,
    "end": 639.195,
    "text": " This is really the question of what makes something first principles or what are the first principles?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.816,
    "end": 646.918,
    "text": "One aspect of it as brought up is the censoring of the persistence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.658,
    "end": 651.279,
    "text": "So from the outside, that's kind of like an empiricist's view of persistence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.319,
    "end": 652.18,
    "text": "Like, is it measurable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.2,
    "end": 658.382,
    "text": "But not saying that something is necessarily that, which is the statistical tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 659.082,
    "end": 663.264,
    "text": "And then the sort of like inside out implementation type",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.39,
    "end": 694.04,
    "text": " but there's a lot more to say in that who wants to bring in some new angle or how do they see collective behavior why do we talk about collective behavior why not just behavior recognize that behavior is multi-scale or or is social what's really being communicated with the collective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.008,
    "end": 710.594,
    "text": " I mean, I believe that we chose those levels so we can make it more simple for our brains to understand it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 711.255,
    "end": 720.143,
    "text": "Because if we talk about collective behavior actually is the universe behaving and the particles and everything, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 721.352,
    "end": 730.119,
    "text": " So I don't know if that's a little bit just based on, I don't know what's the word, like just the material world and how it physically moves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 730.74,
    "end": 733.422,
    "text": "And that's like deterministic or whatever, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 734.263,
    "end": 746.393,
    "text": "But I think us, we chose to have those limitations so we could understand the world, but also we should acknowledge that are limited because we're part of this system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 748.993,
    "end": 768.804,
    "text": " I'm having a little trouble on my kind of understanding the, I guess, where the schism lies between kind of the Markov blanket and the umwelt in semiotics of like the animal's sensory experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.012,
    "end": 792.4,
    "text": " anyone have a maybe maybe someone could uh i mean daniel do you know like the difference between that two um can you be a little louder thank you though andrew anyone have a thought on that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.249,
    "end": 797.73,
    "text": " I'll bring in a definition of umwelt and then we can see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.81,
    "end": 799.791,
    "text": "But meanwhile, does anyone have a thought?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.811,
    "end": 802.552,
    "text": "No, we don't know what you're talking about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 802.572,
    "end": 804.612,
    "text": "Sorry, I was just muted on Zoom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.872,
    "end": 810.094,
    "text": "Andrew, you're a little quiet, but I'm going to bring in a definition of umwelt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.914,
    "end": 812.875,
    "text": "And then meanwhile, does anyone have a thought?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 826.052,
    "end": 826.773,
    "text": " I hope I'm not",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 830.068,
    "end": 856.675,
    "text": " diluting Andrew's question but I think of collective behaviour in kind of like a football team or a soccer team and what that provides the group who is shares some common ethos and what that does to the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 857.815,
    "end": 870.839,
    "text": " how that regulates their collective or individual and collective free energies during a match or throughout the season and how that gives some",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 874.966,
    "end": 891.259,
    "text": " yeah some charge to uh some investments because it's my team against yours and we have to um try and win and so you know without it without that collective behavior um",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 894.401,
    "end": 916.806,
    "text": " It might be far harder to achieve a group's goals if they aren't able to collaborate and share implicitly and explicitly certain traits, behaviors, thoughts, feelings, ideals, ideologies, whatever they might be, and how that then allows us to compete in the world.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 922.085,
    "end": 923.406,
    "text": " I see what you're saying.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 923.546,
    "end": 925.108,
    "text": "It's women?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 926.29,
    "end": 926.53,
    "text": "Yes.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 927.351,
    "end": 927.972,
    "text": "Okay, okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 928.032,
    "end": 932.697,
    "text": "I see what you're saying, especially because we're watching the World Cup, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 932.918,
    "end": 933.779,
    "text": "Women's World Cup.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 934.38,
    "end": 935.341,
    "text": "Right, yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 935.401,
    "end": 937.143,
    "text": "Yeah, so it's very relevant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 937.623,
    "end": 940.066,
    "text": "Yeah, but I see that in all the...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 941.75,
    "end": 968.504,
    "text": " these things you've said it seems that for you behavior needs to have like a goal and i don't know if i if i agree with that it's either survival or winning but maybe for me it's just something that happens and maybe the consequence is surviving but it's not the goal to survive or to win the game i mean in the football it is right but in general",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 970.474,
    "end": 973.416,
    "text": " Maybe there's no goal to the behavior collectively.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 976.138,
    "end": 976.819,
    "text": "Just a thought.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 978.4,
    "end": 979.0,
    "text": "It's interesting.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 981.903,
    "end": 982.123,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.719,
    "end": 983.599,
    "text": " A lot of great comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 983.679,
    "end": 1005.329,
    "text": "Well, the paper of Connor Heinz et al on the collective behavior as surprise minimization that points the way towards using the act in fontology, these kinds of modeling approaches for collective behavioral situations, and really just recognizing them as a certain type of behavioral modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.87,
    "end": 1010.932,
    "text": "The simplest case might just be a single closed system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.132,
    "end": 1021.989,
    "text": " all part of the composition that leads to the ability to describe at very least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.935,
    "end": 1044.378,
    "text": " a lot of different kinds of systems just like a linear model can describe a lot of systems so then it's also really interesting a topic that came up in one of the recent textbook groups with what's normative about active inference because the term of uh the process theory even of active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.639,
    "end": 1061.848,
    "text": " being normative is mentioned multiple times and that's definitely a topic that connects to the social sciences one can imagine the kind of niche normativity or niche regularities in a broad sense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.828,
    "end": 1081.057,
    "text": " and then the real minute particulars of how they play out which kind of hints at the kind of descriptive or causal minimum to start making some anything but toy specific generative models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.276,
    "end": 1110.587,
    "text": " so it's been an interesting theme to see even already in avel's and ben's lectures and discussions this question between description process of describing which is what i associated with professor gordon's approach to ant watching",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.874,
    "end": 1139.734,
    "text": " how that descriptive process which is what we can say that we have for active inference just like a linear modeling ecosystem could say about their linear modeling in principle and how to then articulate the normativities of the framework if that concept if that separation can even exist from the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.796,
    "end": 1152.325,
    "text": " behavioral normativities that include the basis of social fabric in all different kinds of communities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.431,
    "end": 1223.96,
    "text": " here's another question so what is the role of any technical detail in in the social sciences whether more on the statistical connecting with data or more category theoretic like just formal what's the role of formal methods in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1226.198,
    "end": 1249.076,
    "text": " different kinds of academic or practical expressions about social systems does it matter at all how we think about a framework at all well for formalizing um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.701,
    "end": 1265.59,
    "text": " aspects of a social system that i would say that the purpose is for communication um between individuals um because just you know we can't verify that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.237,
    "end": 1282.986,
    "text": " Well, formalizing it is just setting a system on top of what you're observing, but there is no explicit guarantee that what you're saying encompasses everything of the phenomena you're observing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1290.919,
    "end": 1309.217,
    "text": " like you know kind of going back to Taoism of like the name that can be named is not the true eternal name and so it's just a way of you know it's a slice of what we can observe and the way to um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.875,
    "end": 1320.002,
    "text": " maybe you can make predictions or maybe you can generate something that acts like the phenomena you're observing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.742,
    "end": 1323.725,
    "text": "But it's a way to kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1328.977,
    "end": 1346.791,
    "text": " It's just a way to kind of approximate our understanding of some phenomena, and you have to slice it in a specific way, but also understanding that it is a slice, or it is a tangent line that you're approximating as opposed to encompassing the whole system from verbalizing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.747,
    "end": 1360.83,
    "text": " I will add, maybe it's not the goal, but something that happens out of describing any system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1360.89,
    "end": 1373.476,
    "text": "Like Andrew said, it's like the goal to modify it or to corrupt it in some way to gain control or whatever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1373.716,
    "end": 1374.497,
    "text": "We know the model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1375.217,
    "end": 1377.378,
    "text": "You know how to play the game, kind of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1378.239,
    "end": 1382.281,
    "text": "So you write instructions and try to see if you can...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1383.618,
    "end": 1384.739,
    "text": " outsmart someone else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1385.56,
    "end": 1387.602,
    "text": "I mean, it sounds kind of dark, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1387.742,
    "end": 1394.108,
    "text": "But maybe it's one of the goals too, or something that just happens out of knowing the rules that nobody else knows.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1398.493,
    "end": 1400.835,
    "text": "I mean, I guess when you talk about control, there is a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.631,
    "end": 1409.015,
    "text": " there is a shade that can be gained from that specific wording.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.796,
    "end": 1415.521,
    "text": "But control in terms of control theory, that comes from electrical engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1415.561,
    "end": 1423.447,
    "text": "And it's really just what shapes the behavior or what are the inputs that drive the behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1424.208,
    "end": 1425.809,
    "text": "And when you're talking about control,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1426.79,
    "end": 1431.774,
    "text": " It's really just about, well, if you change these inputs, how does that change the end behavior?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.054,
    "end": 1445.425,
    "text": "And so you can actually, from electrical engineering of controlling some sort of electromechanical system, but then you can make analogous statements on,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1447.006,
    "end": 1459.375,
    "text": " control into society, which doesn't necessarily mean like the dark negative control, but like, you know, maybe there's some pathological behavior in a society or, you know, even pathological",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.189,
    "end": 1465.931,
    "text": " pathological responses within the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.071,
    "end": 1468.473,
    "text": "And it's like, well, what is what is driving that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.593,
    "end": 1478.961,
    "text": "And is it possible to, to change those those change the drivers of that to have something that is more beneficial to the system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.931,
    "end": 1508.051,
    "text": " yeah just just to add um to what andrew's saying because it matters sometimes how you manipulate um uh you know a a system or it matters how you affect a brain so it cannot be random i mean uh you know we've come a long way",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1508.988,
    "end": 1535.795,
    "text": " example from uh lobotomy uh which had disastrous effects and and you you it matters to a system how you affect it and so to know more formally uh the most effective way to create a desired effect whatever that might be um it's essential that it's not just kind of poking and prodding because like that that is yeah",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1539.474,
    "end": 1548.317,
    "text": " as much as that is part of the scientific method, to update that method in accordance with what you're learning is important.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1554.278,
    "end": 1555.759,
    "text": "No, I think you're both right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1555.819,
    "end": 1556.879,
    "text": "It doesn't have to be dark.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1557.259,
    "end": 1566.162,
    "text": "But also something that Andrew said about predicting, I think that's one of also the big goals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1567.156,
    "end": 1592.784,
    "text": " trying to predict whether to be prepared to or or just to i mean it couldn't be to control right but if you if you can somehow predict how people respond to this or how a system will behave in this other scenario you can you know change what the input is or prepare for whatever comes i guess",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1597.915,
    "end": 1612.744,
    "text": " yeah a lot of great points some of the commonly held not not equally by everyone everyone but some of the tenants of science being to explain predict design and control",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.568,
    "end": 1628.631,
    "text": " where explanation and prediction are on the pathway towards systems designing and maintenance and other words that people can add, but that's the pragmatic utility oriented view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.724,
    "end": 1644.947,
    "text": " which doesn't have to be an absolutist view but certainly there are regimes of attention socially now and seemingly for long long times where people were wanting to retain and to constrain the variance distribution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.113,
    "end": 1653.655,
    "text": " on what we would say is their generative model, some norm, and then other times engaging in these functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.436,
    "end": 1670.761,
    "text": "And that instrumentalist usage of active inference is like, we're going to be able to model it with a pretty minimum framework that's commonly used in statistical systems where some things we observe and some we don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.661,
    "end": 1674.522,
    "text": "And at least we know and how all the pieces are connected",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1675.509,
    "end": 1694.927,
    "text": " And then that is an artifact in model-based design as people develop that line through time socially, just like probably has been always the case for complex projects and scientific collaboration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.87,
    "end": 1700.172,
    "text": "There's a few other interesting pieces, but yeah, please, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1702.236,
    "end": 1708.83,
    "text": " I'm just wondering if, now that I'm thinking out loud, isn't that like a problem",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1710.143,
    "end": 1712.484,
    "text": " or confirmation bias, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1712.864,
    "end": 1721.126,
    "text": "Like there's a paper of in here, here, because we create the knowledge and we tell everyone the knowledge, this is the model, this is how everything behaves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1721.687,
    "end": 1725.308,
    "text": "And then we update our knowledge about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1725.348,
    "end": 1729.689,
    "text": "And then we look for everything to just, you know, confirm it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1730.729,
    "end": 1732.59,
    "text": "And, and yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1734.15,
    "end": 1758.302,
    "text": " maybe there's other system that will not let us be getting knowledge so slowly because if everybody just agrees on something we teach it to everyone and we confirm the model and then we just try to look for evidence for that model then we go slowly if there's any better thing or better model that comes along yeah a lot to say about that like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1759.361,
    "end": 1782.612,
    "text": " if we believe that trees exist or that people exist and then we come to see them so there's kind of this sense where problem confirmation bias which i think is a great term a great topic to bring in with definitely also what's called like the golden nail syndrome or something if all you have is the hammer then everything's a nail and there's definitely attention there because it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1784.161,
    "end": 1786.464,
    "text": " How much of what you can do are you supposed to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.465,
    "end": 1788.607,
    "text": "Something that you can't do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1789.972,
    "end": 1814.644,
    "text": " or but then at least you could do what you needed to do to get there so that's actually within your scope of what you can do so it's not that there are things that you can't do that you can't do if just from a measurement perspective so like how does it look or how do we recognize across systems or how do we have awareness in situations as limited individuals",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.825,
    "end": 1844.763,
    "text": " who do have all of these cognitive phenomena how to make decisions or sense making or infrastructure or whatever it is the social this the the system of interest of the social sciences make that and then dot dot normatively what i think it's there's some protection uh built into into uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.922,
    "end": 1852.33,
    "text": " the problem of confirmation bias because all knowledge generation is happening in an open system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1853.431,
    "end": 1865.306,
    "text": "And so there's always going to be an agent outside of your own mind and what it's perceiving that can then challenge or add to the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1866.738,
    "end": 1885.711,
    "text": " you know, like the LK99 semiconductors that have been all the rage recently and how other scientists have now kind of discredited it quite convincingly.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1885.811,
    "end": 1895.018,
    "text": "And it's because of this open, they might have had degrees of confirmation bias that they were egging each other on, but it's ultimately been refuted, which is...",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1897.15,
    "end": 1904.055,
    "text": " this built-in kind of protection because it's all operating in an open system, fortunately.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1908.456,
    "end": 1929.975,
    "text": " yeah a lot to say there uh monday morning reviewer 2ing how how do we again go from any given description of a communicative event like the kind of specific unfolding of the lk99 narrative as yet uncompleted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.236,
    "end": 1956.383,
    "text": " in in the minds of some which is real enough to be real socially and uh so how do we go from any descriptive anything about that total observation to core screening then how do we come to uh work with that interface with what whatever that is hands that to us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.127,
    "end": 1983.975,
    "text": " what is the social behavior or some some classic or some novel social behaviors maybe ones that seem pretty obvious due to recency bias",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.065,
    "end": 2021.979,
    "text": " i'll just mention one aspect that andrew and i have also talked about is the auto poetic nature of information systems andrew do you have any thought on this or about where auto polices comes into like social sciences or these kinds of models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.392,
    "end": 2051.919,
    "text": " uh daniel andrew just left a note that he's uh okay okay oh so he'll oh totally back he just wasn't looking at the time funny stuff anyone else have a thought on that okay just just to kind of carry forward then basically the the ability of social systems that include written niche modification cumulative culture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.544,
    "end": 2076.296,
    "text": " their increasing extent of control as discussed earlier that that definitely is a bit of a overloaded or at least doubly meant term in different settings because it can just simply mean modeling it with control theory which is pretty limited philosophical statement relative to any statistical method or control like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2077.176,
    "end": 2106.708,
    "text": " the kind that people are unhappy with and the kind that's described in thinking like a state and a lot of other works that i know mao and lorena and avil are going to be definitely going into more detail on so when societies can model and introspect or or self-reflect formally much better",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2112.888,
    "end": 2121.116,
    "text": " And that can happen through anything from free and open source federated protocols",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2122.11,
    "end": 2143.159,
    "text": " there's many limited formats of self-meaning making but cryptography definitely allows those explorations and that doesn't necessarily mean computer cryptography that could also be like linguistic encoding and all these other ways of niche sub-differentiation in multi-scale systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.315,
    "end": 2149.638,
    "text": " You just do not see a system that is cookie cutter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.958,
    "end": 2154.58,
    "text": "It's very rare in ecosystems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.421,
    "end": 2157.462,
    "text": "There's algal blooms and things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.833,
    "end": 2182.388,
    "text": " So when we really think about the developmental and the cognitive and the selective niche, which is a concept that Axel Constant and others have differentiated in some of their ecological active inference work, that niche is very embodied, extended, encultured, et cetera, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.209,
    "end": 2189.133,
    "text": "It's just like a kind of cool, direct way to open up to that challenge of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.527,
    "end": 2209.695,
    "text": " and just bring some closures with different accounts or compatibilities with different accounts so like all just to give one random example but maybe it'd be interesting what what other people think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.721,
    "end": 2238.81,
    "text": " all the expressions that people make in social settings can just simply be their expressions or modeled as such that is in one way implicitly what was always in play but now it's describable and legible and autonomous so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.016,
    "end": 2261.564,
    "text": " do we take this active inference collective behavior crossover and think about what it really means in how we're going to be like thinking differently even just this discussion forward or like more locally our our understandings with collective behavior or with behavior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.315,
    "end": 2297.037,
    "text": " Daniel, can you ask the question again?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2297.057,
    "end": 2302.12,
    "text": "I didn't actually catch the question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2302.3,
    "end": 2315.389,
    "text": "How do we start to adapt some of these general comments or frames that are in some ways disconnected from descriptions of real systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.469,
    "end": 2321.893,
    "text": "How do we think about that and what it means now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.481,
    "end": 2333.765,
    "text": " Do you mean on the document in front of us?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2333.905,
    "end": 2337.947,
    "text": "These disconnected things in front of us that are on the document?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2340.448,
    "end": 2340.949,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.209,
    "end": 2343.09,
    "text": "Whatever you think or whatever you want to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.35,
    "end": 2346.131,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.97,
    "end": 2355.332,
    "text": " Yeah, I think this is a lot.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2355.412,
    "end": 2361.916,
    "text": "And again, I hope I'm not fully understanding the question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2361.956,
    "end": 2365.318,
    "text": "I hope I'm not steering away too much.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2365.378,
    "end": 2368.46,
    "text": "But I had a general sense of what I think you were saying.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2372.102,
    "end": 2378.546,
    "text": " I think it's an enormous problem with the amount of information sharing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2378.566,
    "end": 2398.096,
    "text": "Let's just take the generative models of social media and all of the platforms that are available to us, how much information we are privy to in any given moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2402.205,
    "end": 2424.771,
    "text": " And I'm kind of forgetting the question that you asked, but how do you, it's almost as if there is such a high rate of information and data flow that it's really hard to know what to do with all of it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2424.831,
    "end": 2431.833,
    "text": "At least as a human being, I'm not saying for machines, but as a psychologist, I'm certainly interested in",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2434.079,
    "end": 2448.788,
    "text": " how humans are able to tolerate and respond to the amount and rate of information that's out there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2462.954,
    "end": 2485.876,
    "text": " this is not the first time this happens right like we went from talking to writing information then everyone wrote their information and then we have books and then we have libraries and that's all available and again we have access if you can read right to all the information in the world so we adapted to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2488.061,
    "end": 2495.944,
    "text": " I don't know, to get careers so we could specify which type of information you are going to know more.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2496.384,
    "end": 2503.907,
    "text": "So maybe we need some sort of new career types, I don't know, more specification with more information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2504.841,
    "end": 2505.921,
    "text": " But is it not?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2506.462,
    "end": 2510.783,
    "text": "Is the rate of information flow increases or not?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2510.843,
    "end": 2512.003,
    "text": "Is it not exponential?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2512.163,
    "end": 2514.964,
    "text": "Is it not?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2515.084,
    "end": 2517.845,
    "text": "It's a crazy amount and our brains cannot do anything about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2518.445,
    "end": 2523.767,
    "text": "So we have to do multidisciplinary things and work together with others if we want to make something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2525.267,
    "end": 2530.369,
    "text": "But yeah, I don't know, maybe we will die of excess of information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2564.417,
    "end": 2573.244,
    "text": " How do people feel like active inference brings something to the discussion relative to how they want to work towards?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.43,
    "end": 2589.054,
    "text": " Yeah, well, isn't that the provocative question too?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.895,
    "end": 2592.437,
    "text": "But like any system, that's the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2592.517,
    "end": 2602.328,
    "text": "Everyone is going to have their own memes and themes and systems that they have spent time with and did field work with and all this other particularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.129,
    "end": 2612.415,
    "text": " Because a system that doesn't have particularity is just not going to be hosting a broad enough niche for phenotypic diversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.896,
    "end": 2622.181,
    "text": "It's just riding on the edge of a razor instead of more like a fabric that continues to unfold, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.505,
    "end": 2646.222,
    "text": " there's a lot of work to do with the social sciences and active inference just from what i was like reading trying to find things for this um discussion and just i personally wondered what is is meaningful or interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.972,
    "end": 2648.772,
    "text": " or useful?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.253,
    "end": 2654.155,
    "text": "What's epistemic and pragmatic value for different audiences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.235,
    "end": 2660.639,
    "text": "How does it go from kind of bringing citations that were not linked together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.424,
    "end": 2686.418,
    "text": " in some more theoretical or more generative model oriented work in active inference like epistemic forging or the inference model or any other kind of specific model what are these different kinds of scientific artifacts do for who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.177,
    "end": 2714.499,
    "text": " I guess I'm still learning very crudely, ploddling along.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2715.148,
    "end": 2736.138,
    "text": " Yeah, Daniel, to try and answer that, because it's quickly realized that the field is, it's so multinodal, it has so much, the free energy principle, the Bayesian brain, even just to psychology has so much applicability.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2736.878,
    "end": 2743.001,
    "text": " And everyone I meet at these discussions is coming at it from a different angle.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2743.862,
    "end": 2748.984,
    "text": "And it can be a bit confusing to hear how other people",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2751.169,
    "end": 2777.666,
    "text": " are applying it how other people are um making use of it um in all manner of ways and so i'm still learning how to apply um to kind of ring fence the free energy principle and connect it to psychological processes including collective behavior and because there's a lot of psychopathology in group thinking in collective behavior",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2778.325,
    "end": 2788.632,
    "text": " But I'm also very, very interested in its application at the interface of what happens between a therapist and a patient.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2790.133,
    "end": 2806.384,
    "text": "I'm often unlike other professions who seem, who are just by nature of the scientific method, are able to extract a lot more data to work with, to analyze.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2807.102,
    "end": 2834.816,
    "text": " to um you know um in a that's very hard to do i feel very limited um other than just making kind of theoretical leaps and inferences about how to apply um the free energy principle to psychology um it's i can't have a session with my brain hooked up to an fmri machine to get data and to see",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2835.576,
    "end": 2860.918,
    "text": " uh when a patient says boo or bar that's a spike on the the spike trains which represents um you know surprisal and we can then solve for that in some way i'm i don't have access to that sort of data flow so it feels limited but i'm still learning how to apply it um yeah and trying to collaborate with colleagues on that the influence group",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2875.674,
    "end": 2878.776,
    "text": " What are people wondering about collective behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.937,
    "end": 2895.827,
    "text": "Even if we're totally, of course, not going to address it, but just what are the kinds of things that people... What makes you look up collective behavior instead of just behavior or individual behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2907.333,
    "end": 2929.359,
    "text": " me it's about safety and need to belong for me it's um i think that um it depends for where you come from and on the country you are but there are places that are more collective",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2929.833,
    "end": 2931.776,
    "text": " And there are places that are more individualistic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2931.876,
    "end": 2940.568,
    "text": "And I think mostly non-Western countries have a lot of collective behavior and knowledge and spirits already, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2940.768,
    "end": 2946.196,
    "text": "That they already knew these things that we think are new for us, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2946.376,
    "end": 2946.777,
    "text": "How the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2948.444,
    "end": 2976.619,
    "text": " collective thing works for example i don't know you don't make a decision for yourself you make a decision for the group like marrying you marry because you want an addition you want to interact with someone or other group and that's something that affects the the collective not just you so arranged marriage makes sense something like that right so for me making that distinction about individual collective comes from understanding that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2977.654,
    "end": 2984.74,
    "text": " I don't know, there are other places that are already ahead in what collective means in terms of human beings and how to interact.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2985.921,
    "end": 2995.328,
    "text": "And the Western world, we have all this individualistic thing, which is very interesting because why do we have the same species?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2995.408,
    "end": 3003.014,
    "text": "And then we have very different approaches of how to understand ourselves in terms of what an individual is and why it matters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3014.761,
    "end": 3027.371,
    "text": " yes there's so much loaded on different understandings among people including even the the essence of the social which is who are people and what is the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3029.827,
    "end": 3052.758,
    "text": " obligation and how do we view that that relationship that's a very very deep area and and again the part that just kept returning to me in the lecture and when i was trying to think about how to how to even reflect part of uh this very large area is like what is the adjective doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3054.224,
    "end": 3079.795,
    "text": " and what what is what's the reference point by which this is being said in the speech act like people often will dismiss i don't mean to um you know straw people but dismiss collective behavior by saying well we are explaining individual behavior what are you explaining beyond the nest mates in the colony and then the exterior like that is it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.774,
    "end": 3099.731,
    "text": " and so that can feel like to looking at the same thing from two different sides and there are different methods like some methods blur over individuals a lot more like statistical methods that might correspond to demographics and then on the other hand like more agent-based models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.22,
    "end": 3127.2,
    "text": " but how much variability and what shared variability and white general synchronies amongst different Quantum reference frames all these nested at least possibilities that are are grounded in wanting to explore mathematical and scientific possibilities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.025,
    "end": 3154.359,
    "text": " as as the literature of linear regression is full of so many incredible extensions and and and similar and then that's i i think what the course is even beginning to to try to express and what i understand in the works of the other teachers and like a lot of your backgrounds and everything like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.559,
    "end": 3174.413,
    "text": " is where is that moment where it is not only science because science is not simply the social so science has an activity and then as there's a diffusion away from science",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.887,
    "end": 3203.696,
    "text": " and i think that or at least that relationship between social and science is right there in the title maybe that's kind of like a science major's take but it but it is itself in a way a um presenting a dilemma with what science means there and then that's the frame game who's doing social science who's doing not social science",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.636,
    "end": 3232.181,
    "text": " and that's that's where um in in the culture i'm sitting in slash in the technical side of that it is related to statistics and formality it's the xkcd comic and the way that formalisms and and details are taken as under some regimes of attention basically definitive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3234.17,
    "end": 3263.349,
    "text": " and yet there's like a yearning and a counterbalancing that's expressed also in many ways and so that's and science maybe some people feel like certain social scientific methods that's like not far enough in this dimension and then the others feel like they're too far in this direction but it's like just like any like that academic field let alone any other community of diverse agents like of course there's going to be distributions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3265.299,
    "end": 3269.88,
    "text": " of perspectives at different times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3269.9,
    "end": 3272.441,
    "text": "A rate of uptake by those different perspectives.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3276.182,
    "end": 3280.704,
    "text": "Daniel, do you think these first principles",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3283.126,
    "end": 3288.313,
    "text": " would be able to explain why an ant colony exists.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3289.214,
    "end": 3292.918,
    "text": "I know that was your area of interest of study.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3293.719,
    "end": 3301.749,
    "text": "Why an ant colony exists in the way that it does as a collective, operating as a collective, and why",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3303.311,
    "end": 3325.324,
    "text": " another animal is able to survive and achieve its goals as an individual only relying on the environment and its actions and sensations to get its needs met and to no doubt minimize its free energy but could first principles",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3326.505,
    "end": 3334.897,
    "text": " explain why the one has to survive as a group and the other has to survive or is able to survive under different conditions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3337.574,
    "end": 3355.706,
    "text": " yeah that's a super interesting question it's it's very core to this individual individuation and multi-scale individuation concept like is the nestmate the individual and then the colony is the social because then for sure it's super collaborative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.767,
    "end": 3382.045,
    "text": " or is the colony the organism and nest mates are tissues and then are they social across colony boundaries not where i was in arizona but they're often friendly across different species and they avoided conflict more often than not so it's like what and then go why does it even matter what's happening on this plot of lands in this in this area from like a biomimicry perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.967,
    "end": 3385.129,
    "text": " We might learn new algorithms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3385.209,
    "end": 3390.734,
    "text": "It's a sandbox for learning new techniques and observation, all these other like richnesses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.814,
    "end": 3398.961,
    "text": "So it's to say though, like what comes away from that science that makes it social science?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3400.959,
    "end": 3429.732,
    "text": " and i think there's a lot of disciplinary ways of understanding that which which i'm definitely not expert in in in the um professional fields like like counseling um but probably in in all the different humanities and histories and all these other fields all these different maps the kind of social um the epistemic organizing question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.292,
    "end": 3456.942,
    "text": " and then the social organizing question yeah and and the way like technology is also in that tangle and yeah someone pointed out like this is not a new problem and uh but then it's like well what parts are new and then what's our model by which we're saying that it's like new or too individualist or too collective on what scale what if they're like really collectivist at this scale but not at this scale",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.675,
    "end": 3475.753,
    "text": " or another an example of an ambiguous or at least like polysemous phenotype of colonies is in some colonies there's partial reproductive activation of like non-reproductive nest mates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.894,
    "end": 3500.271,
    "text": " and that has often been modeled from like a position of like zero is the law and how are they cheating above this but it's also been approached from a colony level strategic bed hedging so without super deep knowledge of really some of the specifics of the regularities that that colony algorithm had to persist",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3501.092,
    "end": 3508.457,
    "text": " for so long and to have gotten swept off the table if it was even, it's like, that's a very integrated problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3509.844,
    "end": 3532.414,
    "text": " so it helps you approach collective systems and and learn about them but it's like there's a lot to say about humidity loss in foraging and humidity loss isn't even the whole picture and human foraging is a lot more sophisticated from just like a perception cognition influence perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.429,
    "end": 3563.677,
    "text": " so those are just some ant related thoughts but it just centers a lot of discussions that really matter and i think the really interesting piece is not always in the way that they're thought to by some yeah and it's and it's very hard to get any kind of cross-pollination uh or to see cross-pollination uh studying one agent it's it's quite",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.393,
    "end": 3568.697,
    "text": " or at least in my mind, very difficult to kind of generalize things across different agents.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3569.678,
    "end": 3585.332,
    "text": "It starts getting a bit tricky to infer one collective's why and how they survive and how another agent does.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3585.392,
    "end": 3586.393,
    "text": "It's tricky.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3587.864,
    "end": 3595.647,
    "text": " So I'm almost just going to make an agent human beings, as hard as they are to study, and just try and run with it as far as possible.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3596.848,
    "end": 3602.35,
    "text": "Otherwise it's just information overload.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3612.434,
    "end": 3613.895,
    "text": "Body is a complex place too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.513,
    "end": 3644.652,
    "text": " and digital technology virtuality these are such um richly developed topics in the social sciences i only know the tiniest amount from but i think that through participation and inclusion in collaboration and in conversations and everything there's going to be a lot of interesting connections and paths um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.435,
    "end": 3660.943,
    "text": " and it's being approached seemingly uh multiple layers like within the the two layers that just we can focus most narrowly on is like within the realm of science what is science",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3662.028,
    "end": 3668.654,
    "text": " which is kind of like playing this other role with inertia in some people's minds and in systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.714,
    "end": 3669.314,
    "text": "What is science?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3669.334,
    "end": 3670.815,
    "text": "Who gets to decide what social science is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.936,
    "end": 3671.236,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.416,
    "end": 3677.161,
    "text": "I'm not in social science, but it's system of inertia society and certainly I'm a part of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3678.742,
    "end": 3683.166,
    "text": "So it's like, what is good technically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.926,
    "end": 3685.508,
    "text": "What is social scientific technically?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.136,
    "end": 3716.077,
    "text": " And then what is that social scientific, how does that going to interface into the metaphysical questions and the normative ethical and the decision-making with trade-offs and the real reflexive complex decisions that matter also while recognizing this increasingly nuanced way of thinking about different social intelligences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.073,
    "end": 3734.072,
    "text": " What's any other random thought or curiosity about collective behavior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3745.456,
    "end": 3760.526,
    "text": " One point that I would have added into the lecture was just that in distributed systems, whether as modeled or as such, all behavior is arising from interactions local to individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.007,
    "end": 3765.129,
    "text": "Even if it's sent through some wireless mechanism, it's like all about the local interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.11,
    "end": 3774.716,
    "text": "And so that is an arising type process that gives the modeler like one hands-off layer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.289,
    "end": 3793.179,
    "text": " at least if not much more another nice feature about them um they are in a way waiting to be composed because they intrinsically contain like at least two layers of consideration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.369,
    "end": 3808.48,
    "text": " Now, whether there's kind of like a forcing function of one layer and just sort of dangling a bottom layer, or whether there's a lot of what we would call emergence or discussive in that way, like that more arising function can be modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.04,
    "end": 3815.285,
    "text": "But in either way, then you can kind of wrap that two layer system and then compose them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3816.166,
    "end": 3819.569,
    "text": "So that's like what enables in certain situations like parallelization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.748,
    "end": 3848.236,
    "text": " Or at least, you know, that's obviously a big area, but that's what allows multi-agent simulation frameworks to do well on certain very challenging sense-making and action selection problems, not by guarantee or default, because any given slicing and dicing of any given prompting of information may not help you adapt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.677,
    "end": 3873.107,
    "text": " but there are paths that do and don't help um persist or not and that's this kind of persistence starting place that we began with Sasha um yeah I really resonate with what you mentioned about the local interactions that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.754,
    "end": 3882.148,
    "text": " even if information is transmitted over long distances, then the agents",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3883.98,
    "end": 3888.382,
    "text": " behave in a way that is locally relevant and integrates that information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3889.102,
    "end": 3904.869,
    "text": "And it actually makes me think a lot about the psychology therapy angle that while you try to get information about a person's local environment and behavior,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3906.93,
    "end": 3927.007,
    "text": " or like perhaps you know demographics and age that um their informational environment like a wealth of what kind of um information they consume might also be really telling about their uh psychological and like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3927.967,
    "end": 3930.988,
    "text": " behavior interactions or pathologies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3935.049,
    "end": 3945.593,
    "text": "And then to bring it kind of full circle back to that the researcher is part of the ecosystem that they are studying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3950.12,
    "end": 3966.731,
    "text": " yeah, I think it's just such a difference in perspective to see that as like a positive and a gift that the way that you would design and run an experiment today is not the way that you would do it two years from now with more experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3967.311,
    "end": 3969.613,
    "text": "And so that is a,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3971.127,
    "end": 3984.933,
    "text": " a benefit and like a bonus in the system and not like a negative perspective of bias that it's detracting from some underlying truth or reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3984.953,
    "end": 3988.434,
    "text": "So just a few thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3993.816,
    "end": 3994.517,
    "text": "Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.777,
    "end": 3997.978,
    "text": "Anyone want to add something?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4005.12,
    "end": 4019.551,
    "text": " I think we didn't fully resolve this early question about the umfeldt term from ethology behavioral research observation science using the term to describe the world as it's experienced by a particular organism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.922,
    "end": 4049.433,
    "text": " i think a few different pieces and there's a lot of discussion in discourse or just just to give it like a super short overview the world we might connect to world modeling and there's a lot of interesting work in all kinds of different like pros focus on qualitative systems as well as some artificial or synthetic intelligence world modeling as it experienced as it is experienced is one of the sticky and deep ones",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4050.293,
    "end": 4052.574,
    "text": " because this is the area of phenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.594,
    "end": 4057.837,
    "text": "And so this is like a kind of semi-eternal discussion point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.497,
    "end": 4064.62,
    "text": "So whether active inference delivers on world modeling is kind of empirical and just plain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4065.581,
    "end": 4069.663,
    "text": "Whereas as it is experienced is going to be a philosophical question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.703,
    "end": 4076.847,
    "text": "And then by particular organism, that specificity we get by actually making the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.907,
    "end": 4079.368,
    "text": "Even if we're just speculating about it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.967,
    "end": 4083.609,
    "text": " It's like talking about experience without an experiencer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.629,
    "end": 4092.256,
    "text": "It would be like talking about some agent's behavior without reference to its niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.578,
    "end": 4110.571,
    "text": "And then where there is that complex negotiation, I think the humanities and a lot of the social sciences have identified a lot of the structural top-down and also the personal bottom-up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.35,
    "end": 4137.201,
    "text": " motifs of of things being blurred and made complex and so i think part of the social and the scientific as coming only from scientific side um is like to to meet in the third space and or at least make it work to have a mutual compromise where it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4139.56,
    "end": 4164.049,
    "text": " certain social science social oriented claims based upon this scientific measure that is going to be a judgment call but understanding that conversation where is it a mutual compromise in like what dimensions not simply along the kind of like rigor accessibility or implications access there's just very many things in play in these iterated relationships in ecosystems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.223,
    "end": 4189.011,
    "text": " like having a researcher as part of the ecosystem well what is it here's here's the forager question you see the nest made on the ground it's a forager but then we step back it's like okay well it's foraging",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4190.347,
    "end": 4218.393,
    "text": " then that's the allocation of the forager then its foraging is still part of this sense making this generative sense making with like process understanding even of a trace which is something that bruno latour and others have have explored with like following a trace in a social setting and using that to to trace networks so in our digital ecosystems though our information ecosystems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4219.873,
    "end": 4243.087,
    "text": " is not research happening and so what what does that really mean and then what are those social normativities there's going to be like a meeting or a handoff with with where that really is happening or maybe it's a knocking on the door that's ignored or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.773,
    "end": 4262.77,
    "text": " it could be whatever metaphor in that setting it actually is there's no general metaphor because that'd be like what's the general metaphor on this experiment which experiment just the general action that we plan to take oh hard to say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.861,
    "end": 4316.569,
    "text": " okay well in our last like sections i guess if anybody types a question live chat we'll look at it otherwise what are any other thoughts or like what what can we learn more about about collective behavior or what will it mean for our sense making decision making if we understand collective behavior better",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.066,
    "end": 4382.968,
    "text": " What else are people excited about for the rest of the course?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.775,
    "end": 4406.188,
    "text": "Like based upon the sections that we've done so far and how we can even start to approach this in an acknowledged, limited, finite way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.476,
    "end": 4410.126,
    "text": " Yeah, Sasha than anyone else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.996,
    "end": 4438.261,
    "text": " I just added a question to the very bottom of the notes, and it makes me think about how working on this document collaboratively throughout the last hour, we're able to kind of leave a stigmatic trace of things we've discussed and what sort of traits or practices should individual humans",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4439.062,
    "end": 4446.43,
    "text": " I guess I should specify humans, should be embodied in order to improve cohesion in collective behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4446.45,
    "end": 4450.795,
    "text": "It makes me think of certain psychology books",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4452.458,
    "end": 4469.894,
    "text": " traits or, uh, descriptions of like openness, um, or, uh, conscientiousness, um, what will make individual humans, um, better participants in collective behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4476.727,
    "end": 4503.845,
    "text": " Yeah, I think to add to that, to just emphasize the importance, again, only with human agents, specifically, who have the capacity to think and reflect and the only ones that have those really advanced capabilities that we know of as yet, but to really leverage",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4506.491,
    "end": 4535.994,
    "text": " In order to make the collective better, there's a responsibility of the individual, despite being part of a collective on many different fronts, to be able to leverage and utilize their own internal states and what they have learned and to be able to think, to retain the individual's mind and think about the collective.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4537.151,
    "end": 4557.602,
    "text": " I think is so important if the collective is to become healthier, Sasha, to your point, and to improve its... Yeah, to become more conscientious, to become more responsible, or whatever that might be.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4564.046,
    "end": 4566.347,
    "text": "So to always try and maintain a thinking",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4571.099,
    "end": 4574.561,
    "text": " self is crucial.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4574.741,
    "end": 4578.563,
    "text": "You can very easily be usurped into the collective as is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4580.464,
    "end": 4596.613,
    "text": "If you just go on any social media platform, you will see individuals rarely thinking for themselves and seemingly kind of just fueling each other and that causes massive problems.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4597.788,
    "end": 4624.082,
    "text": " so an individual mind is strikes me as being just the most important thing in the future going forward yeah this dialectic with individuation and collectivization as these like ongoing negotiated compromises that can be also viewed many ways however they are um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4632.355,
    "end": 4654.367,
    "text": " cognitive science coming into play maybe historical processes or philosophies were used in many settings for even approaching these kinds of social questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.979,
    "end": 4683.136,
    "text": " and now with computer science and technology it even like is a discussion more about the capacities of measurement and action not that those are new in and of themselves like but thinking like a state like the development of the apparatus the development of the social social systems that can be run on on open source hardware open source software things like that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.856,
    "end": 4707.226,
    "text": " so I I don't know if something's generalized across all such groups but understanding what environments at least initially things are beginning at is just a realist starting point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.312,
    "end": 4732.359,
    "text": " probably no guarantee since most things slash all things are swept off the table in their specifics anyway so and how to deal with that kind of like skin on the line type of decision making is very interesting how it's pursued in the in the sciences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.332,
    "end": 4743.376,
    "text": " because often like many runs are presented or that kind of like catastrophic failure mode of models is not considered, it's just like part of the training starting naive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.297,
    "end": 4760.883,
    "text": "So just the way that different social considerations are converged upon, it's not like reduced to one feature of the social because the social is such an open space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.128,
    "end": 4781.245,
    "text": " as a scientist always impressed by how that writing could kind of open up the um situations which are like mundane but also of course very deep and meaningful also though mundane",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.558,
    "end": 4845.447,
    "text": " any other thoughts or otherwise uh on on collective behavior or on the social sciences course or anything otherwise people can have any last words if they want yeah awesome thank you all for participating david want to add anything",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4855.868,
    "end": 4866.034,
    "text": " Yeah, well, I look forward to more questions being asked on the course website, and everybody's engagement with the course is very much appreciated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.414,
    "end": 4872.017,
    "text": "So keep up the collective slash multi-scale learning, and it's a fun course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.097,
    "end": 4876.62,
    "text": "Really happy that we could have done this session and very happy to have concluded the session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4880.322,
    "end": 4880.762,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.243,
    "end": 4881.603,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.823,
    "end": 4882.003,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.283,
    "end": 4882.624,
    "text": "Bye, Vern.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 4883.184,
    "end": 4883.304,
    "text": "Ciao.",
    "speaker": "SPEAKER_08"
  }
]