[
  {
    "start": 32.756,
    "end": 33.896,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.617,
    "end": 46.702,
    "text": "It's May 18th, 2022, and we are in Act-Inf Lab live stream number 44.1 on the Therapeutic Alliance as Active Inference, the role of therapeutic touch and synchrony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.998,
    "end": 49.199,
    "text": " Welcome to the ACT-INF lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.78,
    "end": 55.246,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.927,
    "end": 57.468,
    "text": "You can find us at the links on the slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.309,
    "end": 63.315,
    "text": "This is a recorded and an archived live stream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.235,
    "end": 69.501,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.572,
    "end": 78.38,
    "text": " If you want to learn more about live streams or any of the other projects that are happening in the Active Lab, head over to activeinference.org.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.14,
    "end": 94.97,
    "text": " Okay, today we're in live stream number 44.1, and we are learning and discussing around this paper, Therapeutic Alliance as Active Inference by McParlin, Saratelli, Friston, and Estves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.57,
    "end": 100.413,
    "text": "And we're really honored and appreciative to have a bunch of authors joining us today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.914,
    "end": 105.637,
    "text": "And also Ian, and Ian and I did a .0 last week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.817,
    "end": 107.218,
    "text": "So for any context,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.058,
    "end": 136.778,
    "text": " one might want to check out the dot zero otherwise in the dot one today and in the dot two next week we're going to open up and develop threads have the opportunity to address any questions that people are having in the live chat or submitted to us otherwise and just take notes and have spontaneity and see where this goes because it's a really exciting area of research so we're just going to start with that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 137.618,
    "end": 143.943,
    "text": " I'll say hello and then pass to Ian and then we'll hear from the authors with any context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.323,
    "end": 164.557,
    "text": "So I'm a researcher in California and was very interested in this integration of a lot of perspectives from like the ecological and the developmental and kind of bringing it towards practice, which I hope we can continue discussion around and I'll pass it to Ian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.909,
    "end": 170.71,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.63,
    "end": 173.111,
    "text": "So my name's Ian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.131,
    "end": 175.193,
    "text": "I am based in England.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.693,
    "end": 178.295,
    "text": "I work as a hands-on manual therapist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.575,
    "end": 179.876,
    "text": "I have a background in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.185,
    "end": 188.966,
    "text": " clinical and surgical sciences, but also do a little bit of research now around the topic of interception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.407,
    "end": 193.988,
    "text": "And this is where the work of these authors caught my attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.708,
    "end": 197.888,
    "text": "The whole series actually on inactivism and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.008,
    "end": 200.929,
    "text": "It's kind of where I've arrived at in the last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.829,
    "end": 203.91,
    "text": "And I'm interested in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.805,
    "end": 232.342,
    "text": " both how we talk about these ideas to patients, sort of in service of helping them, update the meaning they sort of give to the situation they're in, and also from a research point of view, you know, how we might be able to drive forward some new questions in research around health.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.312,
    "end": 234.653,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.933,
    "end": 236.055,
    "text": "Over to whoever's next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.959,
    "end": 239.279,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.221,
    "end": 242.043,
    "text": "So I'm George Estevez.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 242.984,
    "end": 245.688,
    "text": "I'm based between Malta and Italy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 245.949,
    "end": 247.952,
    "text": "I'm an osteopath researcher.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.625,
    "end": 255.77,
    "text": " So my main interests are on, you know, the things we're talking about here today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.85,
    "end": 264.616,
    "text": "So inactivism, active inference, the sort of management of chronic pain and complexity in clinical practice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 265.337,
    "end": 268.76,
    "text": "A bit of background apart from, you know, osteopathy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 269.74,
    "end": 275.705,
    "text": "My PhD was exploring the role of multisensory integration during palpation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.458,
    "end": 279.68,
    "text": " in osteopathy, you know, several moons ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.8,
    "end": 285.604,
    "text": "So that was my sort of early dive into, you know, this kind of world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 286.925,
    "end": 295.49,
    "text": "Back in the sort of late 2000s, when people start talking about Bayesian models to explain multisensory integration and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 295.51,
    "end": 299.072,
    "text": "So that's where kind of things started from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 303.584,
    "end": 315.587,
    "text": " Hi, I'm Francesco Cerritelli, I'm based in Italy, and thanks Daniel and Ian for leading this interesting, hopefully interesting, live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 316.207,
    "end": 324.089,
    "text": "I'm a clinician of osteopaths, so hands-on treatment, and also a neuroscientist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 325.889,
    "end": 340.673,
    "text": " So my main interest is in exploring effects of manual therapies within the concept of interoception and the autonomic nervous system effects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 341.653,
    "end": 348.995,
    "text": "That was basically my main streamline during my PhD.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 351.676,
    "end": 368.353,
    "text": " And then with George, we explored the active inference and activism in the last couple of years, and we're trying to also apply in the context of therapeutic alliance in different",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.854,
    "end": 387.226,
    "text": " age groups, so starting from the neonates, preterms, where actually we had also a big, quite a strong background, and then into all the persistent physical symptoms and also in the other age groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.467,
    "end": 396.253,
    "text": "So that is the, so I'm just divided into the clinical part and the research activities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.264,
    "end": 399.606,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.39,
    "end": 400.611,
    "text": "Zoe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.197,
    "end": 431.494,
    "text": " hi i'm zoe i'm the primary author on this paper again i am a osteopath and this is my first paper that i've published i originally started doing a little bit of research on chronic pain and how it affects autonomics a long time ago and then about two years ago i reconnected with george on his",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 432.775,
    "end": 436.276,
    "text": " active inference and interceptive ideas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 437.217,
    "end": 439.917,
    "text": "And since then, we've kind of gone from there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 440.398,
    "end": 443.939,
    "text": "And this paper was published.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 444.259,
    "end": 446.8,
    "text": "I focus as an osteopath on mainly touch-based.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 447.98,
    "end": 456.583,
    "text": "And so I wanted to do a paper based on how touch affects things and kind of have a little bit more of the neuroscience behind what we do.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 458.284,
    "end": 473.242,
    "text": " So that's, and active inference seemed the perfect way to try and justify things that maybe we as osteopaths or manual therapists maybe feel, but haven't been able to put down empirically on paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 473.722,
    "end": 476.706,
    "text": "So that's how the paper kind of started about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 478.72,
    "end": 479.04,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.681,
    "end": 488.07,
    "text": "So again, anyone in the live chat or anyone here can just raise their hand or ask a question, but let's just jump in right there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.23,
    "end": 498.641,
    "text": "Like that's really interesting about using active inference for formalizing some of the intuitions and experiences that might be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 499.662,
    "end": 502.404,
    "text": " felt during the clinical setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.785,
    "end": 509.13,
    "text": "So what is the clinical setting that you are engaged in or focusing on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.73,
    "end": 514.234,
    "text": "And then what was that process of recognizing some experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 514.294,
    "end": 517.777,
    "text": "And then how does active inference fit in with formalizing that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 526.584,
    "end": 528.386,
    "text": "So, actually,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 529.525,
    "end": 555.281,
    "text": " know a little bit of what i mentioned before the sort of early journey started with uh try to explore actually what we what we do as osteopaths you know one of the things or what we do as manual therapists one of the things we do is we first uh there's a kind of the big claims about what what we can do and what we can feel and almost like having this sort of magical sort of ability to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 556.038,
    "end": 557.839,
    "text": " to recognize what's wrong with the patient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 557.899,
    "end": 568.447,
    "text": "And that was always based around this idea that, you know, manual therapists or osteopaths have superior abilities to feel for things, you know, palpation is really the big thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 569.528,
    "end": 583.818,
    "text": "And based on a kind of a paradigm that's, you know, a little bit of old school, biomechanically based that, you know, dysfunction, altered mobility, for example, equals pain, equals problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.919,
    "end": 584.479,
    "text": "And of course,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 585.347,
    "end": 598.314,
    "text": " you know, as the knowledge in the field of pain science evolved, we started realizing that's not the case, you know, because, you know, what happens with chronic pain is there is no longer a tissue dysfunction in lots of cases, but there is pain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 598.334,
    "end": 604.697,
    "text": "So clearly, it becomes extremely difficult to find things, find things that actually are reliable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.697,
    "end": 612.681,
    "text": "And that sort of reliability is an observation and has been one of the big debates in the manual therapy world, which is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.24,
    "end": 616.984,
    "text": " we cannot reliably find what we claim we can find.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 617.424,
    "end": 627.615,
    "text": "So poor, typically poor inter-operator reliability, two people cannot agree on things, and including also very poor intra-operator reliability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 627.635,
    "end": 631.88,
    "text": "You know, if I test one thing and I retest that, I will not find the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 632.48,
    "end": 635.083,
    "text": "And of course, you know, this is a kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 636.132,
    "end": 663.446,
    "text": " know some some important things to take into account if the patient has a real pathology for example a real joint restrict restriction of movement for example associated with severe arthritis then you know one should find something you know it's clearly there is is objective but what happens in most of the patients is what we claim to find are things that are very qualitative in nature very subjective so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 663.939,
    "end": 674.381,
    "text": " So the initial kind of journey was really to try to understand really what's going on and hence the idea of exploring things from a kind of multisensory perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 675.141,
    "end": 685.344,
    "text": "Clearly what we find or what we rely on in the hands, it's not simply the haptic system or the smart sensory system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 686.044,
    "end": 688.444,
    "text": "It's a multisensory experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 688.564,
    "end": 691.545,
    "text": "We see, we observe, we touch, we change.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 692.406,
    "end": 705.697,
    "text": " We listen and that creates straight away an environment where there's so many variables that becomes extremely hard to say, yeah, for sure, this is what I find.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 706.077,
    "end": 717.806,
    "text": "So, you know, you can have people criticizing for the sake of criticizing or saying everything is a kind of a, it's an illusion to other people claiming, no, it's for sure, it's true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 717.826,
    "end": 722.07,
    "text": "And I think, you know, we need to understand that actually probably we sit in between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 722.617,
    "end": 736.641,
    "text": " And more than 10 years ago now, I remember when I kind of started presenting some of the, you know, some of the research findings to my profession and implied the idea that actually palpation is a construct of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 736.701,
    "end": 741.443,
    "text": "People got a little bit of, yeah, no, now can't be really, because, you know, how can you say that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 741.503,
    "end": 743.103,
    "text": "The hand is such a powerful thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 743.123,
    "end": 744.644,
    "text": "You know, we feel things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 745.504,
    "end": 748.785,
    "text": "From a philosophical perspective, people were talking about, you know, the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 749.161,
    "end": 750.704,
    "text": " hand is an extension of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 750.864,
    "end": 760.441,
    "text": "So clinical reasoning, it kind of continues through, we gather sensory evidence by listening, by observing the patient, by",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 761.483,
    "end": 772.825,
    "text": " arguably using most of the senses, including smell, because I don't think we taste our patients, but smell for sure, you know, there are cases where a strong smell equals pathology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 772.885,
    "end": 779.006,
    "text": "So we get that information, we've been bombarded with that information, and we try to make some sense of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 779.706,
    "end": 782.167,
    "text": "And, you know, it's down to the clinical reasoning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 782.867,
    "end": 788.788,
    "text": "So I think that fits nicely now with new ideas of, you know, along the lines of active inference, because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 789.494,
    "end": 801.178,
    "text": " It's about active inference claims about how we construct our own sensorium, how we sort of integrate information, change things, proactively interact and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 801.339,
    "end": 804.46,
    "text": "Exactly what we do when we assess a patient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 804.5,
    "end": 807.841,
    "text": "We touch, we feel, we get a reaction from the patient either",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 808.718,
    "end": 837.61,
    "text": " know that hurts or i don't like you being touched or actually feels very nice so there's a number of things that straight away are going to happen that immediately one can argue changes the outcome so it's no longer you know what i felt now the second guy is going to feel exactly the same thing i don't think that is possible unless of course if you've got uh there's a there's a fused vertebrae between let's say c3 and c4 you know yes we should feel the same thing because objectively there is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 838.41,
    "end": 839.932,
    "text": " there is a problem there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.373,
    "end": 845.802,
    "text": "But otherwise, where we tend to find how we interact changes the whole kind of environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.862,
    "end": 847.965,
    "text": "And that's, I think, active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 849.865,
    "end": 876.592,
    "text": " It's kind of a nice framework to start, you know, exploring things and rather than just being on the negative side is actually to try and go a step further and try to understand, you know, some of the dilemmas from a different perspective, from a different angle without saying, you know, this justifies now everything we do, far from that, but actually trying to understand some of the difficulties, some of the tensions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 878.945,
    "end": 880.387,
    "text": " Yeah, may I?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 885.031,
    "end": 887.874,
    "text": "Definitely agree with what George just said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 888.214,
    "end": 897.464,
    "text": "And what I would like to add to the discussion table is that actually we started also from an additional point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 897.524,
    "end": 898.505,
    "text": "There was the fact that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 899.844,
    "end": 900.805,
    "text": " two additional points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 900.845,
    "end": 906.63,
    "text": "So the first one is that apparently all manual therapies has got an outcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.21,
    "end": 910.493,
    "text": "So it's got positive outcomes for the patients.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.054,
    "end": 918.14,
    "text": "So there can be an osteopath, there could be a physiotherapist, there could be a chiropractor, there could be any massage therapist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.28,
    "end": 924.965,
    "text": "So apparently the uniqueness of each kind of manual therapist",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 925.986,
    "end": 934.09,
    "text": " is kind of flattened by the relationship that that manual therapist can establish with the patient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.79,
    "end": 947.516,
    "text": "So, given, therefore, the importance of the type of relationship with the patient, it might also play a big role in the positive clinical outcome effects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 948.676,
    "end": 952.238,
    "text": "And the second is also related to the fact that the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.415,
    "end": 973.943,
    "text": " based on quantitative research, the elements that actually pop up is that in some cases, and more than some cases, the specific application of osteopathic treatment might also be effective and with the clinical effectiveness across different age groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.063,
    "end": 977.244,
    "text": "So from preterm to the elderly to the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 978.344,
    "end": 979.645,
    "text": " to adults and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 979.805,
    "end": 984.968,
    "text": "That actually opens a very good question in regards to the real effectiveness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 985.048,
    "end": 993.172,
    "text": "Because actually, we know that from science that it is not possible that we are going to have always positive effects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.332,
    "end": 995.773,
    "text": "Otherwise, we are going into a publication bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.893,
    "end": 1004.898,
    "text": "So we are going to publish only the papers that actually are positive towards that kind of treatment so far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1006.599,
    "end": 1028.839,
    "text": " So, in this way, there might be, therefore, the need for a paradigm shift towards the, as George said and mentioned, from the biomechanical way, and then modified by the BPS, so the biopsychological",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.002,
    "end": 1037.772,
    "text": " the biopsychological model into something that actually might really take into account the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1038.393,
    "end": 1039.054,
    "text": "Because in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1040.768,
    "end": 1061.301,
    "text": " And this is also important because the evolution of the free energy principle and all the elements within this context actually take into account also elements that might, from a computational point of view, might take into account the relationship between people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1061.741,
    "end": 1073.547,
    "text": " for example the mark of blankets and all the elements that actually are in contact between the practitioner and any manual practitioner in this case and the patient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.787,
    "end": 1090.536,
    "text": "For the sake of the fact that actually we are touching patients and therefore it's a super powerful channels that also with or without words might also vehiculate and drive information towards a specific end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1091.383,
    "end": 1105.606,
    "text": " Now, the other elements I would like to introduce is the fact that sometimes happens that we consider the reliability and inter-reliability within the manual therapist perspective a big problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1106.087,
    "end": 1110.888,
    "text": "But this problem is actually exactly the same for radiologists, for people in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.528,
    "end": 1113.949,
    "text": " doing ultrasound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1115.249,
    "end": 1115.87,
    "text": "Why is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1116.05,
    "end": 1130.176,
    "text": "Because actually, it was a beautiful paper published on BMJ probably 10 years ago, talking about the kind of statistical measure that actually has been used for reliability studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.256,
    "end": 1133.137,
    "text": "And it mainly is the Cohen scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.737,
    "end": 1151.087,
    "text": " that is one intrinsic problem with Cohen's cave, because actually it doesn't take into account what is the reality of the measurement of the radiologists, or the radiologists are measuring the ultrasound specialists, manual therapists, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1151.627,
    "end": 1169.038,
    "text": " So it's been implied, therefore, that that kind of the reliability, it's one of the most important measurement for reproducing and for generalizing what actually the treatment is doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1169.298,
    "end": 1180.045,
    "text": "And with this framework, actually, we are trying to get out from this perspective because within the context of a therapeutic alliance and when actually we take into account",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1180.525,
    "end": 1205.26,
    "text": " where we look after patients, it's not just the fact that actually we can reproduce the treatment, because the treatment is just one element of the plethora of the broad elements of the instruments and tools that within the session we are applying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1205.76,
    "end": 1217.487,
    "text": " So it's just reducing like a funnel the fact that actually we need to reproduce exactly that kind of dysfunction or problems in the column.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1218.027,
    "end": 1223.611,
    "text": "But the problem in the column might be also affected the way in which we establish a relationship with the patient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.351,
    "end": 1238.657,
    "text": " And back in the days, the BMJ paper was just a brilliant way of looking at one of these main effects from a different perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.658,
    "end": 1241.039,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.239,
    "end": 1241.579,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1241.799,
    "end": 1242.019,
    "text": "Zoe?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.457,
    "end": 1254.366,
    "text": " Yeah, so to add on to what George and Francesco said, this paper mainly focuses on more private practice than sort of a hospital setting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1254.867,
    "end": 1258.23,
    "text": "Obviously, it's a framework, so it can be applied.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1258.43,
    "end": 1265.977,
    "text": "But generally, we're talking about more dyadic or triadic relationships within clinic as the setting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1267.675,
    "end": 1293.955,
    "text": " and we've primarily focused on manual therapy but the theories of active influence and everything can be applied to others like psychotherapy and things like that as well just to point that out but yes like Francesco and George said we're mainly using touch as sort of the vehicle but there's a lot more that's going on sort of with the way that we communicate and the different aspects of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1295.888,
    "end": 1305.53,
    "text": " like the biopsychosocial model, which now I'm sort of expanding upon, but there's a lot more to it than just the vehicle of touch to make therapeutic alliance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1306.37,
    "end": 1308.31,
    "text": "I think the therapeutic alliance is interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1308.33,
    "end": 1325.173,
    "text": "There's a lot of research that's been done for a very long time on the therapeutic alliance itself, what it is and why it's important, but there's not actually that many theories to the sort of the neuroscience or things like active inference behind therapeutic",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1325.467,
    "end": 1326.388,
    "text": " why it's important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1326.648,
    "end": 1346.281,
    "text": "All the research will tell you that you can get better clinical results, and better relationships, better trust with the patients, more adherence, lots of different positive effects of the therapeutic alliance, but not always sort of explaining how the therapeutic alliance works, or how to best achieve it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1346.722,
    "end": 1348.403,
    "text": "That's kind of not always",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1349.483,
    "end": 1350.303,
    "text": " um, express.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1350.323,
    "end": 1362.97,
    "text": "So this is kind of a way that we've tried to quantify how to affect, um, to gather all the different, um, parts of the, that go on to create the therapeutic alliance instead of one framework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1366.812,
    "end": 1367.172,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.532,
    "end": 1368.112,
    "text": "A lot there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.132,
    "end": 1371.734,
    "text": "Ian, do you have any thing to add or I'll ask you a question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1374.434,
    "end": 1375.334,
    "text": " Yes, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.615,
    "end": 1378.517,
    "text": "Well, lots of tantalizing stuff there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.597,
    "end": 1384.121,
    "text": "And what I really love is the openness of all of this question asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.883,
    "end": 1406.468,
    "text": " several sort of things from the paper that or topics from the paper i'd like to explore but one thing that's coming out to me now um is this role of the expert and the model of the expert that might be leading where things are synchronizing towards between the therapeutic alliance and um so what i'm sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.662,
    "end": 1420.861,
    "text": " into mind as I was hearing that is sometimes is it the patient that's the expert or allowing the patient to be the expert or taking turns in being the expert so you know it might be the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.281,
    "end": 1435.295,
    "text": " therapist says, oh, you know, based on my model, my past experience, my priors, the palpation that we're doing now makes me think maybe it's the tightness in your traps that's causing this pain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.735,
    "end": 1438.158,
    "text": "But then actually, you know, the patient says,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.687,
    "end": 1446.652,
    "text": " you know, takes on the role of the expert and says, based on my prize, actually, you know, I've often had tight traps and it's never been a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1446.752,
    "end": 1454.418,
    "text": "And I'm actually, what I'm feeling is maybe nausea in my stomach because of all this exam pressure I've got, or,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.359,
    "end": 1471.342,
    "text": " stress with my family members and then you know then it's another cycle of experts swapping over and exploration so it's more of a exploration the touch is um helping with exploration of the models between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.623,
    "end": 1478.51,
    "text": " the co-embodiment between the patient and the practitioner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.53,
    "end": 1488.984,
    "text": "The other thing, when you were talking about the machines in the hospital, the radiologist or the MRI scanner, I was thinking also about the hand as a machine and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.874,
    "end": 1495.197,
    "text": " a blind person builds up this sensitivity to be able to read braille.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.558,
    "end": 1503.482,
    "text": "So they're palpating a piece of paper with braille on it, and maybe it says, John went to the shops and bought an apple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.942,
    "end": 1508.105,
    "text": "But the blind person would never look at that pattern and think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.282,
    "end": 1513.603,
    "text": " that there's a person called John eating an apple inside the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.903,
    "end": 1524.284,
    "text": "But the symbols that are being created as they feel that, they'll see an image of an apple and John, and maybe it'll bring up feelings and emotions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.304,
    "end": 1538.847,
    "text": "And I just wonder if sometimes it's confusing the sensory input with the feelings and the images, and how do we overcome that and not confuse the moon with the finger pointing at it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.908,
    "end": 1566.233,
    "text": " so yeah lots lots of lots of questions please okay um it's they're very good questions by the way um i think that the whole issue about taking turns i think it's it should be the essence of it uh one cannot argue that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1567.509,
    "end": 1569.69,
    "text": " It's always the expert as a practitioner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1570.29,
    "end": 1579.013,
    "text": "If we do that, I think we end up in a situation where clinical practice relies on that expert, the top-down kind of approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1579.213,
    "end": 1587.256,
    "text": "I know best because I'm the healthcare professional, healthcare provider, and therefore, I know what's wrong with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1587.336,
    "end": 1589.057,
    "text": "That's kind of the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1590.575,
    "end": 1593.657,
    "text": " that's away from the model of person-centered care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1593.778,
    "end": 1614.814,
    "text": "One expects really that practitioner and patient, or Zoe alluded to the concept of a triadic relationship, where, for example, in pediatric care, there's a baby there, and it's a conversation with the mother or the father, or sometimes in geriatric care, there's a conversation with, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1615.984,
    "end": 1619.286,
    "text": " for example, the daughter or the son of the older person and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1619.306,
    "end": 1625.371,
    "text": "So that taking in turns, I think there are clearly we need to think about the person is expert in their own body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1625.411,
    "end": 1630.935,
    "text": "And I personally tend to ask my patients, you know, what, in your opinion, what do you think is wrong with you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.675,
    "end": 1634.497,
    "text": "You know, ultimately, you are the expert in your own body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1635.318,
    "end": 1640.161,
    "text": "And clearly, if it's something kind of new, you know, the system becomes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1641.796,
    "end": 1662.076,
    "text": " better detecting something that you know what's going on here uh kind of you know something that requires some attention but clearly when when in in cases for example of chronic pain the system becomes extremely good relying on the priors on the on a very strong generative model too so yeah this is pretty much what always happens when i get stressed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1662.757,
    "end": 1668.304,
    "text": " you know, I typically get, you know, start worrying about, I start getting some butterflies in my tummy and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1668.384,
    "end": 1675.013,
    "text": "And then, you know, from that is just a cascade of events that ultimately leads to my headaches or my neck pain and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1675.434,
    "end": 1681.061,
    "text": "So I think, you know, clearly one cannot talk about, you know, the person, the practitioner being the expert",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1681.84,
    "end": 1686.581,
    "text": " Having said that, there are times where clearly you need to play the role of the expert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1687.301,
    "end": 1694.863,
    "text": "I don't think we need to simply just rely on the person, on the patient, because also that's why they're consulting us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1695.383,
    "end": 1703.525,
    "text": "If they also notice there is sometimes a little bit of uncertainty about what you think is going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1703.545,
    "end": 1709.087,
    "text": "This thing about, it's a beautiful thing about clinical practice, about clinical uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1709.847,
    "end": 1725.422,
    "text": " but humans hate uncertainty anyway our brains don't like uncertainty anyway so we you want to know come on stop stop talking about could be x y and z and just tell me what's going on because in the cases of complexity that's what tends to generate that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1726.122,
    "end": 1735.448,
    "text": " that sort of vicious circle where the guy goes to Dr. Google, then goes to the next practitioner, and you end up with a fascinating situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1735.488,
    "end": 1743.592,
    "text": "Sometimes a person becomes cognitively immune to any new explanations because, hey, guess what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1743.713,
    "end": 1746.554,
    "text": "I've been talking to a lot of practitioners.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1746.754,
    "end": 1748.155,
    "text": "Nobody knows what's wrong with me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1748.996,
    "end": 1750.917,
    "text": "And yes, but you're the expert.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1750.937,
    "end": 1752.858,
    "text": "So it is a kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1753.402,
    "end": 1777.138,
    "text": " something we need to manage very uh you know very well and and in a clever way and i think that comes from creating the the environment where listening uh observing a lot of what's not said but actually is observed in terms of the body language is critical uh also to know when to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1778.021,
    "end": 1790.968,
    "text": " when to chip in and say something, when to sometimes just shut down and let the whole thing, let them talk or let them not say anything and, you know, and treat, for example, say that's part of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1792.889,
    "end": 1799.172,
    "text": "Regarding the other stuff, and we can carry on with this pretty sure the other guys will have fascinating ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1800.432,
    "end": 1805.335,
    "text": "I think that the mental images are part of everything, you know, you're talking about, you know, the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1805.768,
    "end": 1807.829,
    "text": " the blind person reading braille and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1808.709,
    "end": 1822.833,
    "text": "The early studies looking for some form of plasticity in V1 and so on, even with congenitally blind people, they found that there was an element of kind of possibly imagery.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1822.873,
    "end": 1823.793,
    "text": "There's a roadmap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1823.833,
    "end": 1828.195,
    "text": "So I don't think you can dissociate yourself from the images you create when you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1829.878,
    "end": 1845.811,
    "text": " When you're navigating the world, when you're interacting with the world, and a very strong kind of prior to what we're going to, you know, I put my hand, but then, of course, that prior is going to bias the incoming signal and it's going to match somehow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1845.851,
    "end": 1848.073,
    "text": "Yes, yes, of course, this is what it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1848.093,
    "end": 1848.974,
    "text": "So images are there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1848.994,
    "end": 1850.295,
    "text": "I think we just need to cope with that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1852.381,
    "end": 1867.602,
    "text": " What I can add to what just George said is that when observing someone in the clinical practice, actually, the one element might be to start understanding the generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1868.383,
    "end": 1882.275,
    "text": " So understanding the generative model means that, in addition to what George said, also how, for example, the body reacts to specific stimuli.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1882.836,
    "end": 1890.843,
    "text": "So also testing in the clinical practice the generative model might also give us the idea on how the body might react",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.383,
    "end": 1898.145,
    "text": " from different stimuli to, for example, combining different senses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1898.565,
    "end": 1910.209,
    "text": "So talking about, for example, the pain might change the generative models in the body, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.309,
    "end": 1917.111,
    "text": "So are some parts getting tighter or more relaxed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1917.991,
    "end": 1930.598,
    "text": " what happened or, for example, touching in specific areas or moving the body in a specific way, how those generative models might change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1931.638,
    "end": 1938.962,
    "text": "And I think it's important in the role play that the patient and the practitioner are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.042,
    "end": 1942.684,
    "text": " are establishing during the therapeutic alliance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.844,
    "end": 1961.438,
    "text": "And I think, and we discussed that also with George, then the right balance between giving this role to the patient and to the practitioners, also it's important for establishing a good therapeutic alliance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1961.598,
    "end": 1962.179,
    "text": "Why is that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.799,
    "end": 1968.904,
    "text": " Because actually the patient, as mentioned by Zoe, in a way needs trust.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1969.485,
    "end": 1973.829,
    "text": "And trust might be also applied bidirectionally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1974.269,
    "end": 1980.554,
    "text": "So in the way that actually the patient coming into our clinical practice, actually they are just giving us trust.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1981.015,
    "end": 1989.222,
    "text": "So they, by default, saying, okay, I'm coming to you because I trust you and because I think you can help me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1989.562,
    "end": 1992.805,
    "text": " So that is a way of sharing trust.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.865,
    "end": 2001.813,
    "text": "But on the other side, the clinician needs also to trust the patient about what he or she said or what he or she shared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2002.374,
    "end": 2013.925,
    "text": "And in this kind of dichotomous role play, I think it's important the fact that we need to understand and improve our ability of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2014.806,
    "end": 2020.215,
    "text": " taking turns, and from that, obviously creating the right environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2022.136,
    "end": 2045.639,
    "text": " On the other question, so the Braille, yes, mental images are always there, but also mental images are not just visual, because actually they can, during the secondary and third, I mean, in the evolution of the sensations and the feelings,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2046.66,
    "end": 2052.162,
    "text": " actually are not just compartmentalized into one image.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2052.522,
    "end": 2065.085,
    "text": "So the visual part, because actually then are also characterized by other elements that actually comes from experience, but also comes from our expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2065.105,
    "end": 2068.146,
    "text": "So what we expect about those mental images.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.714,
    "end": 2088.088,
    "text": " In addition to that, there is a difference between, just to pick up a very interesting point raised by Ian, that one of the last papers from Carvalho and Damasio published at the end of 2021",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2091.571,
    "end": 2105.518,
    "text": " actually where they proposed the interoceptive nervous system and not just the interoception as part of the different aspects of the perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2106.298,
    "end": 2115.783,
    "text": "When actually they proposed that, they also said that when actually we are gonna have the exteroceptive map and interoceptive map within the brain, it actually comes from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.383,
    "end": 2121.448,
    "text": " from the senses, from external senses, but also from internal senses, the interoception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2122.189,
    "end": 2127.835,
    "text": "After the process of integrating them into the brain, actually then I'm driving two things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2127.955,
    "end": 2131.999,
    "text": "The first one is feelings, and the other one is drives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2132.6,
    "end": 2138.965,
    "text": " So the drives are the elements that actually are creating the substances for creating the four feelings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2139.465,
    "end": 2147.771,
    "text": "So are the main elements that create, therefore, the consciousness of what we are feeling so far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2148.331,
    "end": 2162.81,
    "text": " And then, in addition to that, when actually they are creating those elements that actually go back into the very nice special issue on interoception published on neuroscience,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.033,
    "end": 2181.39,
    "text": " as always last year, where actually this concept, this model of intercepting model was then modified into the homeostatic model, where we get into account the fact that actually we have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.81,
    "end": 2186.695,
    "text": " The interoception is creating, therefore, the object of what we are feeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2187.135,
    "end": 2194.362,
    "text": "And then there is the subject that is the brain that actually are creating a perspective of what is the interoception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2194.763,
    "end": 2197.485,
    "text": "And then there is the final part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2197.526,
    "end": 2203.451,
    "text": "There is the mental imaging of our interocepting condition and, therefore, everything.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2204.792,
    "end": 2211.955,
    "text": " or, therefore, everything, so the mental images, might be also checked with the real, what actually is coming from the tissue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2212.475,
    "end": 2230.143,
    "text": "And this model is called model of forecasting, so creating, therefore, the elements between these two ideals, so the prior and the likelihood, just to talk about something from an FEP perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2230.663,
    "end": 2235.525,
    "text": " So in creating what is usually called the posterior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2235.585,
    "end": 2249.631,
    "text": "So I think that the mental images from one side, from the brain side, and the braille side, are then checked with something that is the perception of the blind man that actually is touching",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2251.872,
    "end": 2274.209,
    "text": " the bar with the different spots, and then they are forecasting the two elements in order to create a mental image that is a kind of a rainbow, so with different colors, with different elements inside, in order to understand what is behind the story that he or she is reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2277.341,
    "end": 2301.578,
    "text": " awesome again a lot to kind of pick up on but just the way that the expectations play into what is palpated even just at a primary sensory level like anyone might be able to run their finger and detect a bump but then one level of expertise is that integration of well where should the bumps be or what does this mean in this person's clinical trajectory and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.778,
    "end": 2307.542,
    "text": " It isn't just the information flowing into the person doing the perceiving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.582,
    "end": 2315.629,
    "text": "It's this active palpation and the integration of decades of the person's experience in the clinical setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2316.55,
    "end": 2320.313,
    "text": "And then the person's experience within that body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.853,
    "end": 2323.596,
    "text": "And then this externalized knowledge resource that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2324.076,
    "end": 2328.419,
    "text": " call empirical grounding of science and evidence-based medicine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.039,
    "end": 2336.464,
    "text": "And then all of that comes together in the focus of the therapeutic alliance and in the clinical setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.484,
    "end": 2341.248,
    "text": "That's like the runtime where all these features intersect and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2342.128,
    "end": 2370.53,
    "text": " it's just very interesting how we're seeing a lot of these threads like you you use the the bayesian terminology like the prior it's the expectations and then there's like the observations and then those are updated to form a posterior connecting that kind of quantitative approach to thinking about perception cognition and then even action selection with the intermodal it's like well even if only that to combine the past present and future with multiple",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2371.451,
    "end": 2392.052,
    "text": " sensations and types of sensations and cognitive features like memory and preference that would be excellent for actin to do and so that um is really clear how it's presented in the paper in here like what active inference is doing in in this um focused setting of that dyadic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.058,
    "end": 2417.192,
    "text": " initially touch grounded um relationship but then yeah maybe there's another machine involved maybe somebody is using an x-ray scanner or they're using a temperature like a thermometer that just becomes another observation another mirror active inference or adaptive active inference entity in this multi-adic relationship so really interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.072,
    "end": 2445.458,
    "text": " i think if i can just add one one interesting thing to to the debate is in recent times we've been been observing quite a lot of debate around you know what's what's the value of palpation you know why why bother uh because you know our patient is typically does have that connotation of biomedical kind of approach you know looking for something that is dysfunctional some pathology and so on i think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2446.278,
    "end": 2462.652,
    "text": " One important thing is, from this perspective, I think would be important to take into account is palpation still matters, even if it's just as a way of communicating, as a way of reassuring, as a way of actually contributing to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.536,
    "end": 2465.898,
    "text": " to the development of that therapeutic niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.438,
    "end": 2477.547,
    "text": "So it's not just, it is the sort of palpation not being a one way stream where I kind of look for what's wrong, and I know what's wrong, but actually is a dialogue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2478.048,
    "end": 2489.937,
    "text": "And that dialogue can involve, of course, finding, you know, something that is, you know, not, not good, you know, potentially even pathological to something that actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.748,
    "end": 2495.53,
    "text": " You know, that exploration actually feels nice and comforts the patient and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2495.55,
    "end": 2519.078,
    "text": "So it is important not just sort of be on a kind of very fundamentalist approach is either one thing or another, but actually try to kind of, you know, sit in the middle and try to observe the two sides and even the tensions between the two sides, you know, biomedically based or more sort of exploratory, more sort of niche construction, more sort of active inference in nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2520.939,
    "end": 2521.299,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.28,
    "end": 2523.521,
    "text": "Sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2527.404,
    "end": 2534.77,
    "text": "Yeah, so I think back to the expertise, I just wanted to add in about, we brought up the concept of a bird song.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2534.91,
    "end": 2540.555,
    "text": "And I think that's kind of how I see it as expertise, I would never tell a patient",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2541.749,
    "end": 2544.791,
    "text": " personally, that they are not the expertise in their pain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2545.672,
    "end": 2551.536,
    "text": "I don't know what they're feeling in and their priors and different things that are going on to make them their pain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2551.596,
    "end": 2557.98,
    "text": "I would always say that my patient is an expert in what they're feeling in their pain, whatever that may mean to them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2558.0,
    "end": 2561.283,
    "text": "I would say that they are the expert in that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2561.843,
    "end": 2563.604,
    "text": " But I think it's a birdsong.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2563.624,
    "end": 2564.665,
    "text": "It's a taking here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2565.406,
    "end": 2569.409,
    "text": "It's your sort of adapting what you think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2569.529,
    "end": 2579.657,
    "text": "Yes, often as a practitioner, you're seen as more of the expert or your precision of maybe the physiological side of the condition is...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2580.698,
    "end": 2588.263,
    "text": " more precise than what your patient is, they've obviously not 100% certain what's going on, otherwise, maybe they wouldn't be coming.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2588.863,
    "end": 2602.892,
    "text": "But I think it's definitely you adapt what you think based on what your patient is feeling and what they say, if you may think one certain thing, and then they might tell you that actually, you know, they did this at the weekend, or",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2603.772,
    "end": 2606.275,
    "text": " They felt this or this happened before.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2606.295,
    "end": 2609.859,
    "text": "And you kind of constantly change and take it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2609.919,
    "end": 2611.461,
    "text": "You adapt your idea a little bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2611.481,
    "end": 2613.123,
    "text": "You adapt their idea a little bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2613.343,
    "end": 2617.848,
    "text": "The whole diagnostic process is generally not cut and dry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2617.888,
    "end": 2621.672,
    "text": "I mean, some situations are, but generally speaking, we do not know 100% what is going on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2623.474,
    "end": 2648.217,
    "text": " um in in a clinical space without machines or without sort of more in-depth knowledge we're going based on what we think um in our opinion so i think it is definitely there's no strict hierarchy in terms of you are just the practitioner is just the expert yeah we may be the expert on one aspect of the condition but not necessarily the aspect on",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2648.857,
    "end": 2654.66,
    "text": " the whole big picture once you take into account all the other things that contribute to their pain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2655.401,
    "end": 2662.044,
    "text": "It's not just a physiological response often.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2662.064,
    "end": 2668.768,
    "text": "To be in sort of an overload of aliostasis, you've got to have a lot more than just pain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2669.821,
    "end": 2679.814,
    "text": " pain there's a reason why behind it there's a certain few things that probably have gone on for them to be in that situation so I think it's it's too simple to say that that you're just the expert because",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2680.839,
    "end": 2687.021,
    "text": " you've done a degree and you're meant to know sort of the biomechanics or the physiology behind a certain condition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2688.181,
    "end": 2698.345,
    "text": "As for what everyone was saying after towards the Braille and feeling, touch is, there's a lot of research to show that touch is interceptive.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2698.545,
    "end": 2701.506,
    "text": "It affects the, and activates the insular system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2702.086,
    "end": 2713.238,
    "text": " which gives you sort of that connection between what you're feeling, what sensory stimulus you're detecting and the feeling that you contribute to that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2713.378,
    "end": 2718.002,
    "text": "So that's why sometimes we have a touch and we feel it's pleasant.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2719.084,
    "end": 2723.99,
    "text": " It's that effect of the insula and how it is processed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2724.431,
    "end": 2727.816,
    "text": "And I think that's obviously dependent on the individual.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2728.156,
    "end": 2735.366,
    "text": "Different people will have different things that will make certain things feel more pleasant or more painful, depending on...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2736.227,
    "end": 2754.814,
    "text": " lots of different aspects and so I think we touched upon sort of touch as a way of a good way of non-verbal communication of expressing not just examining the condition but also showing that you understand through sort of empathy and things like that so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2755.994,
    "end": 2760.496,
    "text": " You can use touch to show what you're feeling without saying it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2760.536,
    "end": 2764.897,
    "text": "I think this is something that is very evident with the pandemic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2765.097,
    "end": 2771.7,
    "text": "I mean, there's a lot of people that went through a lot of hard times and the one thing they wanted to do out of everything was just give back.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2771.88,
    "end": 2782.823,
    "text": " the person they loved a hug or, you know, they, people missed funerals and weddings and lots of different sort of events, significant events in other people's lives.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2782.843,
    "end": 2789.546,
    "text": "And all people wanted to do was just, you know, hug the person if they just lost someone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2789.606,
    "end": 2800.409,
    "text": "So I think touch has a way of communicating with people on a different level than not just sort of the purely clinical level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2802.099,
    "end": 2804.661,
    "text": " of them, Ian, and then I'll add something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.883,
    "end": 2807.344,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2807.364,
    "end": 2825.62,
    "text": "And yeah, just following on from what Zoe said, it reminded me, Daniel, of the example you took from the very beginning of the new active inference manual of, you know, putting your finger on your thigh and saying, is this rough or smooth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.7,
    "end": 2826.64,
    "text": "And you have to kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.22,
    "end": 2830.962,
    "text": " you have to move your hand to tell if it's rough or smooth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.322,
    "end": 2850.535,
    "text": "And then I'm thinking about animals preening themselves, sorry, preening each other or grooming each other and proposing here from an evolutionary point of view, we've been able, we've found this way of distinguishing between a nice smooth, something smooth and soft,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.564,
    "end": 2861.927,
    "text": " that's supportive and bonding and pack, like animals building a pack together versus something that's more like a fight or a clash or conflict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.128,
    "end": 2873.791,
    "text": "And in the paper you talked about, we're arriving at this sort of insight that we're all identical, I think it was, or very similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.451,
    "end": 2876.132,
    "text": "So that brings me back to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.884,
    "end": 2895.216,
    "text": " something like safety and alikeness and not reject the role of touch in feeling part of a pack or a tribe versus being rejected or outcast or fought away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.236,
    "end": 2900.659,
    "text": "So yeah, that role of touch in reassuring that everything's okay, we are similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.848,
    "end": 2925.777,
    "text": " the other thing what uh um francesco's left but he talked about the understanding the generative model and as he was talking about that i was thinking about i don't know if anyone's um come across something called hakomi it's a form of group but can be done group or individual work where a bit like somatic experiencing where the participants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.734,
    "end": 2933.836,
    "text": " try and understand in a sort of reflective listening what's going on inside each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.176,
    "end": 2940.619,
    "text": "So try and explore each other's interceptive world, plus also what might be going on in their outside life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.499,
    "end": 2944.7,
    "text": "And I remember hearing about performing little experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.74,
    "end": 2950.302,
    "text": "So the person who takes on the role of the expert kind of says, okay, let's do a little experiment here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.362,
    "end": 2953.304,
    "text": "What happens if, you know, what happens if you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.58,
    "end": 2976.278,
    "text": " say this or do this or take this action what does that do to your your experience and you know i think that's kind of what happens anyway in therapy you know physiotherapists will give people a list of exercises and say you know do this experiment and hope i i hope that you'll get better um but i'm just wondering with this sort of paradigm shift of uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.678,
    "end": 2994.9,
    "text": " physiotherapist just being the expert and prescribing something that's definitely going to work it's more framed as okay you know i'd like to encourage the patient to be more experimental um rather than just be prescribed something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.038,
    "end": 3005.085,
    "text": " whilst appreciating what you said, George, about, you know, they actually come wanting their hope to be guided in a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.165,
    "end": 3011.85,
    "text": "So, you know, we need to have a certain level of confidence and guiding, but not necessarily being too prescriptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.031,
    "end": 3020.316,
    "text": "Now, the thing about, you know, the generative model and how we can change things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3022.578,
    "end": 3023.979,
    "text": "So, for example, you know, there's two...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3026.209,
    "end": 3054.369,
    "text": " two sides of the same equation i would say uh one is when you for example in patients with um kinesiophobia fear of movements when you ask them you know for example you know can you perform this kind of action typically for low back pain most people are scared of bending forward going to flexion because it's typically associated that's how my disc is going to pop and that's how you know i ended up in this situation and so on so uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3055.171,
    "end": 3066.856,
    "text": " you know, putting in, you know, perceiving a little bit of that, of that generative model, which could be one of, you know, moving forward, going into flexion equals pain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.296,
    "end": 3071.597,
    "text": "You sometimes just by telling, okay, let's try to do this movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.657,
    "end": 3080.841,
    "text": "And before the patient actually starts doing the movement, you find straight away an immediate muscle guarding, you know, is a sort of, oh yeah, you know, I'll come to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.861,
    "end": 3082.962,
    "text": "That's, that's hurting straight away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3083.082,
    "end": 3083.162,
    "text": "And,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3083.875,
    "end": 3110.427,
    "text": " in fact you find sometimes that muscle guarding so you know where does palpation actually come into the equation you know rather than being diagnostic you can actually also look at you know what's going on you know so to try to align our mental states with them and predict what's probably going on going on now from an active inference perspective you could argue that if they believe the morph data the priors is very strong that flexion equals spine it's likely that kind of a minimal",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3111.602,
    "end": 3126.43,
    "text": " minimal sensory input is likely to create that muscle spasm and therefore yes i knew i would do this and it would be in pain okay so that's what sometimes we we observe and actually if you start thinking about some of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.626,
    "end": 3146.971,
    "text": " some of the clinical signs and symptoms you find with patients with persistent pain for example and people you know either catastrophization or you know the phobia and actually putting through this perspective you can argue that you know what's probably likely to be very strong is a generative model sometimes of movement or this type of action equals damage therefore",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3147.691,
    "end": 3160.065,
    "text": " i have more pain how can we short circuit the whole thing how can we start changing a little bit of that generative model so in a sense creating a prediction error that is so great it actually surprises that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3160.745,
    "end": 3162.126,
    "text": " the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3162.947,
    "end": 3169.372,
    "text": "So, for example, one could use, for example, breathing or focusing on some interoceptive sensations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3169.553,
    "end": 3171.714,
    "text": "That's been used by other practitioners.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3171.754,
    "end": 3177.539,
    "text": "For example, in musculoskeletal care, the concept of cognitive functional",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3178.786,
    "end": 3182.008,
    "text": " you know, therapy is based a little bit on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3182.128,
    "end": 3189.211,
    "text": "For example, using breathing, asking the patient to sort of focus a little bit on your breathing, take a deep breath in, relax, and now try to move the movement again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.691,
    "end": 3195.134,
    "text": "And you find that sometimes, you know, there is an improvement on a few ranges, you know, degrees of range of motion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3196.014,
    "end": 3213.076,
    "text": " but arguably if you think from this perspective actually you started changing the model say oh patient sometimes looks at you so oh that actually feels a little bit easier how come what have you done you didn't do anything you started sort of uh you created this you know surprise the system okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3213.897,
    "end": 3218.979,
    "text": " And you surprise the system in a very positive way, which is, yeah, you know, that's great, you know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.799,
    "end": 3231.763,
    "text": "We explore this on the paper that should be out very, very soon, which is try to understand actually how can we generate in a change generative model with guided touch, for example, creating conditions where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3232.617,
    "end": 3237.701,
    "text": " One could say, okay, let's focus on, you know, let's focus on the sensations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.741,
    "end": 3242.464,
    "text": "Let's focus, okay, you know, this feels quite tight and actually what I'm doing here, I'm releasing the fascia and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3242.484,
    "end": 3247.787,
    "text": "Okay, so you can use that if you think the patient is actually, is a suitable candidate for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3247.807,
    "end": 3250.649,
    "text": "You know, you're not actually implanting another generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3250.689,
    "end": 3252.07,
    "text": "There's something wrong with the structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3252.491,
    "end": 3253.371,
    "text": "Okay, that could help.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3254.032,
    "end": 3261.377,
    "text": "But for example, if the patient gives too much attention to that, to those sort of sensations,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3262.58,
    "end": 3266.383,
    "text": " then, you know, it's probably wrong to get them to focus on those sensations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3267.143,
    "end": 3273.628,
    "text": "So, because actually you're just perpetuating a little bit of that, you know, belief that prior that actually, okay, it's tight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3274.088,
    "end": 3275.63,
    "text": "Yeah, I'm worried about this and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3275.99,
    "end": 3288.339,
    "text": "So, for example, we propose these things coming from kind of a traditional sort of meditation, Buddhist practices in, you know, that's,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3289.008,
    "end": 3318.21,
    "text": " example you can short circuit the whole thing by for example start talking about something else which we talked about flattening the sensory states okay so imagine that you know you're palpating you're doing your technique and so on and suddenly you feel like the patient is giving too much attention to that actually there's a sort of failure of sensory attenuation if you want to use in all the jargon here but if you if you then suddenly talk about oh yeah you know what i've got a new dog i was like where does the new dog come from okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3319.096,
    "end": 3327.804,
    "text": " Or if you think that they love football, for example, and their team won last night, they say, oh, I watched the match last night.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3328.085,
    "end": 3328.945,
    "text": "It was great, wasn't it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3329.666,
    "end": 3336.913,
    "text": "So that takes the attention away from that and actually kind of maybe enables you to start changing something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3336.953,
    "end": 3343.099,
    "text": "So it's a combination of clearly hands-on stuff where you cleverly can introduce the language",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3344.468,
    "end": 3350.417,
    "text": " to start surprising the system, start changing a little bit of that generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.517,
    "end": 3352.76,
    "text": "So I think that's okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3353.02,
    "end": 3355.424,
    "text": "It's, you know, colleagues in the UK,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3357.287,
    "end": 3381.36,
    "text": " have developed this osteo map approach, osteopathy mindfulness and based approach also based on third wave cognitive behavioral therapy and actually uses the similar thing which is you know you're treating but you're sort of talking you try to guide sometimes guide the patient say how does this feel what's what's going on here you know why are you protecting and so on so you start exploring this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3381.9,
    "end": 3392.547,
    "text": " So that could work really well, arguably, in a person that is interceptively able to explore that if they're not interceptively prepared.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3392.627,
    "end": 3399.912,
    "text": "So, for example, switching, you know, giving too much attention to what's going on inside for some people makes them even more anxious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3400.672,
    "end": 3405.054,
    "text": " So there's no point in saying, yeah, let's mentalize interception because, you know, that's going to be great for everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3405.114,
    "end": 3405.675,
    "text": "No, it's not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3406.195,
    "end": 3408.636,
    "text": "Actually, you know, I feel like a rumble in my tummy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3408.656,
    "end": 3410.477,
    "text": "It could be something going on, really, isn't it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3410.998,
    "end": 3412.799,
    "text": "Oh, you know, what about if there's a pathology?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3412.839,
    "end": 3414.84,
    "text": "I just consulted with Dr. Google.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3414.88,
    "end": 3416.08,
    "text": "He told me about this stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3416.521,
    "end": 3418.802,
    "text": "So for some people, that's clearly a no-go zone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3419.142,
    "end": 3421.163,
    "text": "For other people, yes, you know, we can explore that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3421.183,
    "end": 3425.686,
    "text": "So, again, if you think through this lens, I think that there's a lot of –",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3426.994,
    "end": 3438.817,
    "text": " You know, I think one can argue you can have a lot of fun in clinical practice by exploring things rather than limiting yourself to a very rigid sort of boxed approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3439.498,
    "end": 3447.82,
    "text": "And sometimes you get a patient to, you know, they get up from bed, from the, you know, from the plant and say, oh, actually feels a little bit better, you know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.8,
    "end": 3451.401,
    "text": "Actually, it's painful, but it's not as painful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3451.481,
    "end": 3454.522,
    "text": "So arguably you started changing something already.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3455.106,
    "end": 3460.329,
    "text": " And that's where sometimes, okay, is it the sort of expectations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3460.429,
    "end": 3463.111,
    "text": "Is it a placebo phenomena?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3463.671,
    "end": 3464.411,
    "text": "It is what it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.431,
    "end": 3471.495,
    "text": "You know, you created all the conditions, you put everything together, and actually you created a package of care that arguably can start changing things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3471.555,
    "end": 3477.499,
    "text": "And for me, when a patient says it actually feels a bit easier, it's kind of, okay, that's good stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3477.519,
    "end": 3482.902,
    "text": "You know, it's not the result of my technique, it's sort of whatever happened in this setting here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3483.938,
    "end": 3501.654,
    "text": " there is you know they started the road you know their journey in the road to to recovery and that's pretty good and then you you've got you know if you ask the patient sometimes after a few sessions how do you feel today and i feel better i feel much better how's your pain now on the visual analog scale the pen could be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3502.845,
    "end": 3531.256,
    "text": " not different from last time or even this is the first session they may have started with a you know six or seven or eight or eight out of ten and at this stage are on a six out of ten for example so clinically there's not a meaningful change anyway but they may actually say i feel much better what does that mean you know feeling much better is yes you know it's the the interceptive stuff it's about you know i i started kind of taking you know i started changing something so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3532.552,
    "end": 3557.534,
    "text": " there is i think stuff to play with that combined clearly not just hands-on but the whole kind of you know creating a package a multi-sensory um let's say experience as well awesome i i'd like to yeah sorry please um just to follow up on what uh george said um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3558.843,
    "end": 3563.345,
    "text": " Just from the last bit, and then I'll track back to another point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3563.845,
    "end": 3576.891,
    "text": "But I think it doesn't really matter sort of how you do it, whether you try and shift their attention away from it by talking about something else, whether you shift it away from...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3577.871,
    "end": 3592.323,
    "text": " using breathing or trying to approach the way in a different way, you're basically trying to shift the attention away from what if they, especially if they have chronic pain is an overly sort of precise maladaptive belief.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3592.563,
    "end": 3592.804,
    "text": "I mean,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3593.564,
    "end": 3603.375,
    "text": " It's just trying to get them to kind of step back a little bit from the prior that maybe or the feeling that they have predicted that they're going to feel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3603.816,
    "end": 3607.2,
    "text": "So if they, like George said, bend forwards is painful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3607.64,
    "end": 3613.707,
    "text": "If you get them to step back a little bit from that, whether you do that through...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3615.222,
    "end": 3629.375,
    "text": " talking or sort of focusing on your breath through mindfulness you want to shift it back to the the current what they're feeling rather than what they think that they're about to feel um so you can",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3630.817,
    "end": 3634.7,
    "text": " do that in many different ways, but yeah, just definitely to try and focus away from it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3635.561,
    "end": 3658.237,
    "text": "I think it's, you either kind of go down that path and shift the attention away to kind of then try to refocus, or you kind of use touch as what we've done in the paper to try and develop new associations or to reframe or to overwrite the prior beliefs that maybe aren't quite working for that situation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3658.257,
    "end": 3658.778,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3659.673,
    "end": 3670.578,
    "text": " to try and hope that by reducing and rewriting it, by doing those exercises, maybe to try and get them to do something that they fear.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3670.598,
    "end": 3678.422,
    "text": "They think if they bend forwards, because when they hurt their back, they were bending forwards to pick something up from the floor, and that was painful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3678.502,
    "end": 3684.745,
    "text": "So now they're absolutely terrified that if they bend forwards, that's going to happen, or their dad...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3686.286,
    "end": 3693.868,
    "text": " sort of blew their disc when they were bending forwards to lift something, that sort of prior belief.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3694.946,
    "end": 3707.371,
    "text": " We just want to try to make the opportunity often through touch or by doing an exercise and giving that sort of feedback that actually, yeah, you're bending forwards, but actually it's not that tight.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3707.751,
    "end": 3717.434,
    "text": "And to try to inhibit that prior belief that they've got about expecting the pain and try to reduce the weighting that they've put on it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3717.695,
    "end": 3720.756,
    "text": "So maybe think, oh, well, and even if you can't,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3721.696,
    "end": 3731.338,
    "text": " change it so that they stop believing that every time they bend forwards, it's going to be painful, even if you can try and reframe it to context specific priors.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3731.698,
    "end": 3736.4,
    "text": "So say like, well, if you bend forwards in this way, then it's okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3736.86,
    "end": 3741.281,
    "text": "You might not change the fact that they still think that bending forwards is risky.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3741.701,
    "end": 3741.941,
    "text": "That's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3743.324,
    "end": 3748.028,
    "text": " they might be cognitively immune to changing that completely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3748.329,
    "end": 3756.295,
    "text": "But you might be able to, through touch and through sort of encouraging them, to develop the prior for that context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3756.496,
    "end": 3757.617,
    "text": "So if you...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3759.923,
    "end": 3767.266,
    "text": " you know, bend forwards with this posture or this way, or that, that you can, you can update it and change it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3767.286,
    "end": 3770.267,
    "text": "So they think, okay, well maybe actually in that situation, it's okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3771.888,
    "end": 3778.191,
    "text": "This brings us back to, they did a study with little kids about with,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3779.251,
    "end": 3804.267,
    "text": " one that was slightly younger one that was a bunch that was slightly older on balance and they gave the younger kids thought that balance was just sort of gravity so things balanced because they had gravity working upon it whereas the older kids thought that it wasn't that simple and that if the object was weighted more on one side then obviously even if it was gravity pulling it down they'd tilt",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3805.222,
    "end": 3808.103,
    "text": " And so there was two different theories of how balance works.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3808.823,
    "end": 3816.166,
    "text": "And they kind of, the investigators gave the kids the other one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3816.206,
    "end": 3822.828,
    "text": "So all the ones that thought it was just plain gravity were introduced to the concept from the other ones and vice versa.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3823.428,
    "end": 3831.411,
    "text": "And they explained these concepts and then they showed them the block, which they'd kind of used to say like, look, this is the block, this is how it balances, this is your theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3832.131,
    "end": 3835.294,
    "text": " And then they said, well, do you want to play?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3835.474,
    "end": 3842.499,
    "text": "And almost every single one took the block, tried out the other theory of how it balanced.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3842.9,
    "end": 3846.883,
    "text": "And then after sort of 10 minutes of play, they asked them what they thought again.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3847.423,
    "end": 3858.692,
    "text": "And some of them changed their minds and they used that sort of tactile sort of learning and touch to update what they thought about their theory of balance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3859.312,
    "end": 3859.793,
    "text": "And then to...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3861.658,
    "end": 3885.624,
    "text": " change and adapt slightly of what they thought some didn't change it completely some did but they all wanted to touch and explore to give them the opportunity to sort of understand that prior and to build up um a new belief of what maybe they thought was going on so i think we do that a lot in clinics um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3892.921,
    "end": 3901.487,
    "text": " Look, you can move further now, or it doesn't feel so tight, or that knot that you said you had doesn't feel as hard, things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3902.548,
    "end": 3909.073,
    "text": "And back to the comment about how we relied on others, I think it was.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3910.114,
    "end": 3914.817,
    "text": "Yes, and working together, the hunter-gatherer thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3914.937,
    "end": 3917.119,
    "text": "I think it's important to note that we're...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3918.059,
    "end": 3919.64,
    "text": " We're built to work together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3919.821,
    "end": 3920.981,
    "text": "I mean, we haven't got a choice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3922.523,
    "end": 3928.387,
    "text": "We might when we're sort of old enough to go hunt for deer and boar and things like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3928.487,
    "end": 3937.173,
    "text": "But when we're first born, we need the touch of our mother or a caregiver of some sort to get to get our allostatic needs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3937.254,
    "end": 3939.455,
    "text": "We cannot survive without them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3939.615,
    "end": 3941.216,
    "text": "If you leave a baby on its own.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3942.117,
    "end": 3965.297,
    "text": " that they probably won't survive on their own they need the mom or the the person to to pick them up to feed them to regulate their body temperature to to do everything they they don't have a choice and even before that um neonatally you're constantly as a fetus being bombarded with different information from your your mom and we touched upon this in the um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3966.889,
    "end": 3967.349,
    "text": " The paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3967.73,
    "end": 3971.913,
    "text": "You need... They constantly know what their mom is feeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3971.933,
    "end": 3983.841,
    "text": "And so, of course, once they're born, they still want to coordinate with their mom because that's what they've been used to for nine months as they start to develop and start to feel touch in different areas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3983.901,
    "end": 3985.622,
    "text": "And, you know, they start to get nerves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3985.662,
    "end": 3987.463,
    "text": "They want to explore and see what happens.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3987.523,
    "end": 3987.663,
    "text": "So...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3988.564,
    "end": 4015.132,
    "text": " yeah we inherently need to rely on others at some point and while we get older it's not as continuous and we only rely on others maybe when we don't know what to do um then then we will it's not so like i'm not gonna relate to my caregiver now i know what my heart rate should be i know what's normal for me and that's different but when you're younger you don't have a choice and so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4015.852,
    "end": 4026.199,
    "text": " and as you can't speak touch is is the first point of communication so yeah i think i touched on most of the points that were mentioned earlier awesome",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4027.662,
    "end": 4034.89,
    "text": " I wanted to bring a few active inference points in and loop it in and then ask a great question in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.33,
    "end": 4037.713,
    "text": "So we've been talking a lot about the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4038.373,
    "end": 4049.905,
    "text": "And so the generative model is a statistical model that includes all these features we've been describing like perception, cognitive variables and action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4050.826,
    "end": 4056.154,
    "text": " And also it integrates this Bayesian idea of the prior and the updates and the posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4056.815,
    "end": 4066.128,
    "text": "So we talked earlier about how the practitioner is engaging in these informative perturbations and experiments of the patient's generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.849,
    "end": 4075.215,
    "text": " And those perturbations can be seen as action selection that are informative by the generative model of the practitioner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4075.776,
    "end": 4083.562,
    "text": "So in the therapeutic alliance, in the niche of that clinic, there's like multiple generative models that are engaging with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.582,
    "end": 4091.608,
    "text": "And so that's a setting that active inference has been used to study and to connect that back to the bird song.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.108,
    "end": 4096.292,
    "text": "This is just, it's such a fascinating avenue of research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.373,
    "end": 4101.496,
    "text": " that I think it's worth going one level into how the birdsong plays out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4101.916,
    "end": 4110.243,
    "text": "So we talked about the conversation and about how the patient has one type of experience and expertise in their own embodiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.743,
    "end": 4118.549,
    "text": "And then the clinician has another type of expertise in their education and also in their embodiment and where that comes together is through touch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4119.05,
    "end": 4123.954,
    "text": "So in the birdsong example, there's this expected birdsong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4124.554,
    "end": 4129.977,
    "text": " We can think of it as like the stereotypical or the archetypal bird song that the birds are expecting to hear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.317,
    "end": 4135.5,
    "text": "Like if you're listening to a song that you know, you're expecting it to be playing out a certain way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4136.32,
    "end": 4143.164,
    "text": "Now, why doesn't one bird just sing and then the other one is hearing what it expects to hear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.306,
    "end": 4145.928,
    "text": " So it never takes a turn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.448,
    "end": 4159.219,
    "text": "And so in other words, like why the equivalent in the clinical setting would be like the expert clinician could just be speaking from their expertise and just giving a one hour lecture on a condition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.98,
    "end": 4165.685,
    "text": "Or you could have a situation with a one hour lecture the other direction with just the person sharing for one hour.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.065,
    "end": 4168.968,
    "text": "So how do we move from that like one directional perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4169.128,
    "end": 4184.339,
    "text": " um non-turn taking which still could be absolutely expertise on either side but there's this like emergent joint expertise when there's a conversation so how does active inference model that turn taking and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.356,
    "end": 4199.043,
    "text": " perhaps not the only way that this could be modeled, but how it is modeled in the birdsong papers of Friston and Frith, is that action selection requires a transient suppression of precision on action selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4199.903,
    "end": 4205.006,
    "text": "So in other words, if I'm seated right now and I want to engage in standing up,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4205.566,
    "end": 4211.727,
    "text": " There has to be a transient suppression of precision, like an openness around what am I doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4212.208,
    "end": 4223.83,
    "text": "Because if my confident belief is I am sitting down, then engaging the counterfactual, I could stand up, will never be enacted because I have a high precision belief that it's simply not the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4224.27,
    "end": 4231.852,
    "text": "And in fact, they've connected that to various movement disorders where there's challenges in initiating or challenges in terminating movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.952,
    "end": 4258.327,
    "text": " behavior and so what's happening with the turn-taking birds is that one bird is singing and so it's singing from the song book so to speak the expected song but its continued engagement in singing is accompanied by this increasing reduction in precision around what it is doing it's kind of like someone going on a rant and there's like they're actually losing precision they're losing the thread as the rant continues",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.381,
    "end": 4288.604,
    "text": " as a function of them suppressing accuracy because they have to engage in action and then at some point that elicits that acting entity to seize action and to increase its its precision through listening through active listening and so that is how the birds take turns in this bird song even though they're singing from the same sheet they do take turns because they're engaged in like a transient suppression of precision on action that allows them to act then that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.204,
    "end": 4307.736,
    "text": " imprecision around action becomes too much and then they need to recover that precision through listening again so it's quite an interesting thing and it just reminded me of like well there's a dialogue it doesn't have to be equal time it doesn't even have to be speaking all the time but there has to be this emergent dialogue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4308.636,
    "end": 4325.858,
    "text": " otherwise it would just be a one-way phone call with the download on the clinical side or the download on the person's experience so i hope that that these kinds of formal models like the bird songs the toy model but seeing that kind of a generative model play out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4326.784,
    "end": 4355.383,
    "text": " in the context of the skilled uh performance and experimentation this might sound weird but you know why don't you try doing this and then the patient brings up something unconventional or they discover something new about their body and that is where like healing and and openness can occur so that was like awesome threads and then i want to ask the question in the chat for for everybody it would be great to hear their responses so glia maximalist in the chat has asked",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4356.479,
    "end": 4361.863,
    "text": " How can patients learn to think about pain in order to update their generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4362.704,
    "end": 4367.968,
    "text": "Or is this something that is possible to do subconsciously with the assistance of the treatment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.849,
    "end": 4378.737,
    "text": "So what are the explicit cognitive and implicit cognitive aspects of updating generative models around pain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4381.599,
    "end": 4384.762,
    "text": "Yeah, George, then Ian, then Zoe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.159,
    "end": 4413.103,
    "text": " I think it starts with education about pain, you know, what is pain and why people have that experience and clearly having, you know, two sort of situations where in acute pain, pain being kind of regarded typically as a useful protective mechanism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4413.203,
    "end": 4414.363,
    "text": "If you just hurt yourself,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4415.293,
    "end": 4424.375,
    "text": " you know, if you twist your ankle and you're in pain and there's a minor tissue problem and that needs time to heal and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4424.415,
    "end": 4431.557,
    "text": "So clearly there is pain and people need to understand that, you know, you're in pain because this happened and it's protection and should go away and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4432.278,
    "end": 4440.4,
    "text": "The challenge is much more complex when we face chronic pain because, you know, in those cases and a lot of times the protection",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4441.4,
    "end": 4465.11,
    "text": " and no longer needs to be there why is is protecting from from what you know there's not necessarily a need to to protect but the system becomes pretty good that's you know it's almost like generating that stuff and people continue having sometimes a presentation that is you know limping or or a particular muscle spasm in movement and so on i think it's about sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4466.391,
    "end": 4495.588,
    "text": " starting with with understand you know getting the person to understand the nature of what's what pain is about without giving them a lecture on the neuroscience of pain because you know that that's clearly does not work as well so it needs to be something that is simple straightforward so it starts with that it needs to be um you know a reasonably well explained um kind of framework um you uh i think you know what are you talking about the bird song and so on it's kind of you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4497.085,
    "end": 4514.77,
    "text": " interesting thing about, you know, sensory attenuation, which in the context of chronic pain, and we argue that on the other paper on active osteopathic care is inactive inference, that probably in some cases of chronic pain is actually a failure of this attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4514.79,
    "end": 4521.832,
    "text": "So disengaging from that constant attention to the problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4521.912,
    "end": 4523.132,
    "text": "How do you achieve that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4523.813,
    "end": 4525.053,
    "text": "Yeah, again,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4526.124,
    "end": 4529.885,
    "text": " communication, touching, talking or not talking and taking turns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4529.945,
    "end": 4535.527,
    "text": "And the analogy to the bird song is clearly, you know, it's a fascinating thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4535.587,
    "end": 4548.932,
    "text": "It's clearly what we try to reach, you know, that synchrony between two or more individuals in that clinical setting when things start kind of working well and, you know, it's leading to somewhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4549.112,
    "end": 4550.533,
    "text": "So just some thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4550.573,
    "end": 4551.433,
    "text": "So Ian.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4558.476,
    "end": 4558.896,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.537,
    "end": 4563.522,
    "text": "Yes, I agree with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.323,
    "end": 4572.892,
    "text": "That needs to be kind of simple and understandable explanation, but challenging the perhaps previous views.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.393,
    "end": 4574.794,
    "text": "I'm just sort of reminded of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4577.702,
    "end": 4591.75,
    "text": " specifically for the person who asked this question, the work of Yoni Ashar and Tor Wagner's pain reprocessing therapy study is a bolder study, but it's been,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4593.251,
    "end": 4600.879,
    "text": " converted into a book called The Way Out on chronic pain and an app called Curable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.019,
    "end": 4605.664,
    "text": "So for people who are watching this live stream, there are some simple things to check out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4605.724,
    "end": 4608.087,
    "text": "And The Way Out is published by Penguin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.147,
    "end": 4612.852,
    "text": "And the elements of how they suggest to people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.208,
    "end": 4642.4,
    "text": " self you know self care for chronic pain are two things so one is they call it somatic tracking which is basically an interoceptive exercise where you with curiosity and lightness and openness sort of um explore the pain and um secondly is to build evidence of safety so to actually literally write lists of you know right now i'm experiencing um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.14,
    "end": 4653.604,
    "text": " evidence that my body, I'm safe in my body, for whatever reason it might be, because, you know, just I'm here sitting and breathing, that means I'm relatively safe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4655.004,
    "end": 4661.807,
    "text": "So those two things, exploring the pain in a different way, and building evidence of safety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4662.668,
    "end": 4665.909,
    "text": "So that's, you know, I think that's a quite nice starting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.27,
    "end": 4668.63,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.89,
    "end": 4670.551,
    "text": "Zoe, anything you would add there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.041,
    "end": 4678.022,
    "text": " Yeah, sorry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4679.662,
    "end": 4684.584,
    "text": "Yeah, I think definitely, as George said, trying to keep it simple is essential.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4684.604,
    "end": 4693.207,
    "text": "If I start talking to my patient about the ACC and how it changes this part of the brain and it works on this bit, I think I'd lose them within five seconds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4695.748,
    "end": 4703.831,
    "text": "Most patients, while they're not so interested in all the neuroscience behind it, if you try to speak to them, I think it depends on the patient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4704.731,
    "end": 4712.333,
    "text": " how best to sort of make their pain kind of realized.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4712.373,
    "end": 4715.774,
    "text": "I think most patients find it difficult to say what their pain is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4715.874,
    "end": 4719.555,
    "text": "Sometimes they can't describe what they're feeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4720.175,
    "end": 4733.579,
    "text": "They don't know the words to kind of say, which is why sort of I think touch is also useful in this aspect because you might be able to try and show someone something without actually having to say it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4735.481,
    "end": 4764.347,
    "text": " and definitely as George said in chronic pain it's again not so simple people can be cognitively immune no matter how much you try to explain it they might just not want to sort of update or to to hear it so yeah I think it depends on their priors their situation and how best you think that you can kind of get that across whatever way you think might be more amenable to them",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4765.93,
    "end": 4766.956,
    "text": " I'll pass it back to Ian.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4767.439,
    "end": 4767.821,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.841,
    "end": 4768.264,
    "text": "Yeah, Ian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.475,
    "end": 4771.195,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4771.796,
    "end": 4785.084,
    "text": "Just picking up on what George and Zoe have said about, you know, different sub subcategories of patients who might be more or less open to different tools that can be offered to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.204,
    "end": 4797.232,
    "text": "So, as you said, you know, someone who's suffering from a certain type of anxiety might be immune to bringing more attention to their interoceptive sensorium, whereas patients",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4798.092,
    "end": 4804.874,
    "text": " you know, that might be accessible to someone who's cognitively immune to the conceptual idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.894,
    "end": 4806.734,
    "text": "They might actually enjoy that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.435,
    "end": 4816.397,
    "text": "So I'm thinking for future research, how can we find markers or indicators for these different subcategories of people that can be picked up really early?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.497,
    "end": 4819.658,
    "text": "So, you know, a therapist can say, work their way through a flow diagram.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4819.998,
    "end": 4826.14,
    "text": "When I'm doing my, taking my history, case history for this patient, they, you know, as I'm talking to them,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4827.02,
    "end": 4832.763,
    "text": " they seem you know, they they're, they're showing signs of being open to this thing, but not that thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.803,
    "end": 4839.006,
    "text": "And then you can work your way through and end up with, okay, I'm going to use this, I'm going to try this tool first as the first test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.046,
    "end": 4841.327,
    "text": "And then if that doesn't work, then I try, try that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4841.828,
    "end": 4853.334,
    "text": "So you know, getting some big studies with big N numbers that that try to identify these dips, different subcategories of clinical indicators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.734,
    "end": 4855.255,
    "text": "That's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.275,
    "end": 4855.955,
    "text": "Thanks, Zoe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4857.886,
    "end": 4869.034,
    "text": " Yeah, so I haven't read massively big studies, but one thing to consider that you can get from the case history is the family, especially if you're treating kids.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4869.134,
    "end": 4880.061,
    "text": "The research that's come out more recently on the parents' priors, they took a study looking at kids in a rheumatological clinic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4880.081,
    "end": 4883.463,
    "text": "93% of their parents had pain",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4886.325,
    "end": 4887.846,
    "text": " had some sort of pain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4889.047,
    "end": 4897.653,
    "text": "They showed that if the parents reported pain when they were doing exercise, the kids were more likely to have higher pain levels.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4898.106,
    "end": 4908.612,
    "text": " to report more problems, not just in general health issues, not just with that, but also things like they didn't want to do the homework.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4909.492,
    "end": 4915.596,
    "text": "So even more general things were affected by sort of the way that their parents thought they were more likely to catastrophize.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4916.056,
    "end": 4929.796,
    "text": " That was one massive thing that if their parents had experienced more pain, then the kids' risk of catastrophization was significantly more and almost that you could predict the amount that they would from that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4930.016,
    "end": 4931.638,
    "text": "Same with studies...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4932.259,
    "end": 4933.66,
    "text": " with oxytocin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4933.86,
    "end": 4942.566,
    "text": "The parents oxytocin from 10 minutes play with their kid then meant that you could empirically predict how much oxytocin the kid would increase.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4943.567,
    "end": 4957.296,
    "text": "So I think some things like that you can pick up from the case history if you know people or they're willing to let you know about what might be going on previously.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4958.156,
    "end": 4966.979,
    "text": " Some patients won't want to talk about it, but some you might be able to get from if there's more than one of them in it or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4967.099,
    "end": 4981.604,
    "text": "That's one indicator now of what, you know, if they come in and someone else or they've said something about a belief that someone else has had, it might be harder to kind of change that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4982.097,
    "end": 5006.111,
    "text": " like why are you more of an expert than their parent or whoever had said it so I think that's there's one way that they're starting to kind of pick up that you could easily implement into your case history or you might already be asking about that you just didn't realize the significance of it you knew it was significant but not the extent that we're now sort of starting to realize.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5007.642,
    "end": 5007.822,
    "text": " Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5008.382,
    "end": 5008.663,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5009.503,
    "end": 5010.444,
    "text": "Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5010.504,
    "end": 5036.358,
    "text": "Of course, we're just exploring like different avenues, but in, and it's not my area as only an ant doctor, but whether somebody uses thinking or feeling type words or refers to their own direct experience versus the experience of somebody who they trust versus information they received from a search engine, those are all cues that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5036.778,
    "end": 5049.967,
    "text": " maybe that is what then the clinical decision-making pivots towards, or maybe it's a cue that other areas in that cognitive space would be informative to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5050.027,
    "end": 5054.369,
    "text": "Like if somebody spends 10 sentences talking about what they received from their body,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5055.33,
    "end": 5059.133,
    "text": " you could ask if you've asked anyone else or what did you look at when you researched it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.413,
    "end": 5065.878,
    "text": "If somebody says 10 things about just what they researched, maybe how does that reflect with your own experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.899,
    "end": 5083.292,
    "text": "Like just to kind of even the score and sample across different regions of this space, then that could potentially help give a coherent and holistic perspective, which is kind of implicit in a lot of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5084.264,
    "end": 5086.749,
    "text": " the discussions that all of you are bringing here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5087.05,
    "end": 5087.471,
    "text": "So Ian,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.592,
    "end": 5094.513,
    "text": " Yeah, all really good suggestions there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5094.933,
    "end": 5106.277,
    "text": "And Zoe, as you were talking, I was thinking about, I've heard sort of similar studies with parents with digestive problems and children with digestive problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.657,
    "end": 5113.76,
    "text": "But then it got me thinking about intergenerational trauma and DNA methylation and epigenetics and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.987,
    "end": 5134.811,
    "text": " And whether there, you know, this is not necessarily within our scope immediately, but longer term, are there any DNA screen, methylation screen patterns that can be used to see if someone might be more or less open to different interventions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.714,
    "end": 5139.336,
    "text": " Interesting note there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5139.997,
    "end": 5148.889,
    "text": "And these cognitive approaches, it's a compliment to understanding the correlation between the rheumatological outcomes of the parents and the children.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5149.19,
    "end": 5153.696,
    "text": "Like one possible aspect is there's a predisposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.741,
    "end": 5170.775,
    "text": " carried through the DNA sequence, carried through an epigenomic modification, carried through a shared and cultured niche, a shared way of expecting things like those may come differently into play in the N equals one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5171.556,
    "end": 5177.7,
    "text": " that is the therapeutic alliance that's assembling around this person who is having this experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5177.78,
    "end": 5188.228,
    "text": "And so that is kind of like what breaks through the large N and just presents us very plainly and starkly with this one person's experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5188.688,
    "end": 5196.914,
    "text": "And there isn't going to be a large study with that person because nobody will ever replicate one or two or five of those aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.454,
    "end": 5198.715,
    "text": "So that's like where the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5200.632,
    "end": 5230.238,
    "text": " large and the small n and sort of a top-down and a bottom-up approach to these topics hits hits the the compromise um george um yeah that would be fascinating to try to see if people are more predisposed to respond to some forms of of therapy and or not now interesting thing you know we we've done uh several studies in you know in uh in neonatology uh with preterm babies and we found that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5231.187,
    "end": 5236.249,
    "text": " osteopathic care seemed to reduce, well, was effective in reducing the length of stay in hospital.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5236.289,
    "end": 5243.072,
    "text": "We tested also the hypothesis comparing, you know, static touch with a form of dynamic affective touch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5243.632,
    "end": 5254.056,
    "text": "We saw that, you know, there is a role in modulating the, you know, reducing arousal from an autonomic perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5254.116,
    "end": 5257.397,
    "text": "It seems to, you know, babies respond to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5258.037,
    "end": 5259.558,
    "text": "And one could argue that actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5260.308,
    "end": 5268.59,
    "text": " The priors there aren't great yet because they're responding to that contact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5269.11,
    "end": 5278.273,
    "text": "We also know that kangaroo care is an effective evidence-based approach for preterm, so skin-to-skin contact with parents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5278.888,
    "end": 5285.169,
    "text": " This stuff seems, you know, again, plays, you know, suggests that touch seems to play an important role.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5285.689,
    "end": 5305.594,
    "text": "It would be good, and we try to do that, to look at, for example, the babies that received that hands-on intervention, to follow them for a number of years into perspective study and actually see what happened, you know, in terms of cognitive events, you know, and general sort of development.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5306.914,
    "end": 5307.034,
    "text": "This...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5307.941,
    "end": 5316.988,
    "text": " But then, you know, if we start thinking about, okay, yeah, it's okay, the babies are sort of not, don't know really how to respond.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5317.521,
    "end": 5329.167,
    "text": " Then there are some interesting ideas being developed, in particular with people like Anna Cianucca, looking at in utero being the first prior, in fact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5330.827,
    "end": 5339.392,
    "text": "And if you look at in some cultures, mothers touch their belly and sort of interact, start interacting with the baby very early on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5340.492,
    "end": 5346.255,
    "text": "So actually, arguably, those babies already starting being touched and they're sort of primed to,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5347.122,
    "end": 5352.607,
    "text": " probably respond in a better, in a more positive way to tactile kind of stimulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5352.627,
    "end": 5365.519,
    "text": "There's also research started talking about, for example, in the case of twins, they start touching each other around sort of week 12, week 20 or so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5365.599,
    "end": 5370.864,
    "text": "So again, there's a form of, you know, tactile contact stimulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5371.731,
    "end": 5392.197,
    "text": " uh other you know other authors for example katarina fotopolo talks about and actually the first prior is actually the mother for example so again goes to the idea that actually either through um you know prior to one being born the sort of that interaction with the mother creates that prior so likely",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5392.987,
    "end": 5402.23,
    "text": " you know, creates a predisposition perhaps to the sort of good response to a more manual type of intervention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5402.27,
    "end": 5405.931,
    "text": "So, you know, the fascinating things can be explored.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5405.951,
    "end": 5416.054,
    "text": "Of course, you know, always have, you know, from a negative perspective, sometimes in randomized controlled trials, people say, yeah, but, you know, those guys kind of, you know, it was good outcome because those were good responders to treatment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5416.454,
    "end": 5443.503,
    "text": " anyway but again what does being a good responder to a manual type of intervention actually means you know the variables are such you know so many that it actually um you know kind of the scope is huge so one one could explore but actually there are some serious questions in in in the whole thing for sure thank you zoe and then we'll have kind of a closing thoughts as we finish the dot one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5445.276,
    "end": 5465.451,
    "text": " Yeah, I think just to go off what George said, they've shown in neonates as well that basically as soon as an area of the body starts to get any sort of nerve innervation at all, the fetus will start to touch that area.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5465.891,
    "end": 5472.056,
    "text": "So when they start to get the face, which is often one of the first, that's why you see a lot on ultrasounds, baby touching areas.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5472.456,
    "end": 5475.178,
    "text": " their faces or their hands or things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5475.279,
    "end": 5482.685,
    "text": "As soon as they get innovation to their area, they're touching it to explore, to see what is this that they can now feel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5483.105,
    "end": 5486.528,
    "text": "So I think definitely touch is one of the first things that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5487.657,
    "end": 5509.051,
    "text": " people will use to develop a prior or to just understand what is going on in sort of the world that is is around them um to expand upon what george said the long term they did do one study about the long-term effects of uh kangaroo care incubator and full-term",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5510.473,
    "end": 5529.931,
    "text": " babies and they found that while this was more towards the the synchrony with the the parent but when they were initially it was the the full-time ones that didn't need any help had the sort of strongest synchrony the strongest sort of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5531.493,
    "end": 5536.056,
    "text": " Sorry, it's almost midnight here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5536.536,
    "end": 5544.521,
    "text": "And then the skin-to-skin contact was sort of next, and then the incubator was after.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5545.122,
    "end": 5548.384,
    "text": "This was initially when they were doing it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5548.764,
    "end": 5560.452,
    "text": "But when they followed up on these same kids when they were adults, they found that actually the synchrony between them when they were adults to their parents was the same.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5560.952,
    "end": 5565.074,
    "text": " So the ones that got the skin-to-skin contact had the same as the full-tone ones.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5565.994,
    "end": 5568.775,
    "text": "So it had developed over their whole life.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5568.835,
    "end": 5576.819,
    "text": "That continuous effect of touch built up so that they were on par, whereas before they were lower down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5576.899,
    "end": 5579.46,
    "text": "So it's not something that's just developed naturally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5579.74,
    "end": 5601.068,
    "text": " Um, in those sort of critical period where things are developing more, it is something that, you know, the effects that had happened when you were one, two, three, um, to building up when you were 12 to 18 still have an effect when you're not, I mean, there's areas of the brain that don't stop developing fully until you're 26.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5602.248,
    "end": 5607.389,
    "text": " So, you know, that's a lot of experiences that you're going to have from different parts until that age.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5607.429,
    "end": 5609.19,
    "text": "They're all going to contribute to it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5609.25,
    "end": 5612.09,
    "text": "So it's not sort of just the first prize.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5612.13,
    "end": 5619.212,
    "text": "Then they've shown that those prizes, especially with touch, are still evident in adults.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5620.893,
    "end": 5621.973,
    "text": "Just because they had it as a baby.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5623.804,
    "end": 5627.165,
    "text": " It's another value for integrative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.565,
    "end": 5645.351,
    "text": "We can have continuity between the nutrients delivery in utero, and then the neonate with the spoon coming in, airplane making the landing, and then adults who have a little bit more agency maybe in their peripersonal space with the spoon and landing the airplane, but there's the supply chain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5645.911,
    "end": 5650.713,
    "text": "So it's just another part of an extended nutrient cycling system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.453,
    "end": 5677.669,
    "text": " are we going to have custom narrow theories for each one of these settings and or will we have some layers and interoperability between these different settings that help us like transpose useful models and find areas of contact those are all really important um areas for lifelong learning like you brought up and there's areas of the brain that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5678.59,
    "end": 5699.684,
    "text": " continue after you're 26 people still learn things and so that's brain development too um i just wanted to look at figure one and or figure two and just in kind of our closing thoughts what is uh one of figure one and figure two both have like a really creative and um delightful style",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5700.484,
    "end": 5710.033,
    "text": " So figure one is focusing on different functions that are discussed in the paper and in relationship to empirical evidence around different brain regions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5710.914,
    "end": 5713.917,
    "text": "And figure two is kind of pulling out one level",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.091,
    "end": 5740.255,
    "text": " looking at different functions that are arising in here the dyad so maybe if each person whether figure one or figure two what's like one area that you're excited to talk about in dot two or one thing that you think um like really stood out to you as something that was a contribution that you weren't seeing in other work or in other ways of representing these topics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5741.82,
    "end": 5745.763,
    "text": " So maybe Ian first, and then we'll hear from the authors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5745.804,
    "end": 5749.787,
    "text": "But anything from figure one or figure two that would be exciting to explore more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5751.669,
    "end": 5752.189,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5752.209,
    "end": 5755.032,
    "text": "What stands out for me today is the two monkeys doing a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5755.914,
    "end": 5759.256,
    "text": " one-handed handstand with a joyful look on their face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5759.316,
    "end": 5769.142,
    "text": "So this idea of cooperative communication and that, to me today, that speaks to this idea of, you know, neither of them look like they're an expert.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.182,
    "end": 5777.447,
    "text": "They look like they're playing together, which is a nice approach to think of in the therapeutic alliance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5777.667,
    "end": 5781.81,
    "text": "Not always possible to be playful, but, you know, when possible,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5783.015,
    "end": 5784.135,
    "text": " Can we be like the monkeys?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5784.996,
    "end": 5792.459,
    "text": "But then moving on, I'd like to explore maybe this idea of arriving at the realization that we're similar or identical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5792.519,
    "end": 5797.641,
    "text": "So again, those monkeys look pretty identical, but what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5797.681,
    "end": 5799.702,
    "text": "I'd like to hear from the authors about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5800.362,
    "end": 5804.264,
    "text": "And then maybe next time we're exploring this idea of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5805.779,
    "end": 5810.962,
    "text": " when the generative models or the allostatic regulation, the set points start to drift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5811.562,
    "end": 5830.232,
    "text": "And that, you know, I'm thinking more broadly in our society, our health, global health problems are, are they a drifting of our allostatic set points around food production and what healthy food actually means and how it's, how that's aeroplane coming into the mouth, you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5831.873,
    "end": 5845.478,
    "text": " So some expert model has told us that certain foods should be what we eat, but the health indicators suggest that that model may not be the best model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5845.998,
    "end": 5857.482,
    "text": "And how do we, as therapists who are open to this active inference model, kind of keep that possibility of drifting, this model drifting, and how do we decide what the set point should be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5859.811,
    "end": 5880.03,
    "text": " yeah from the from the airplane landing the spoon to literally the airplane landing with the food we never grow up okay figure one or figure two george um i have no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5883.23,
    "end": 5886.272,
    "text": " I don't think I have much more to add.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5886.933,
    "end": 5901.162,
    "text": "You know, the figure one, of course, you know, it's a sort of an overview really where potentially, so this is sort of putative effects of touch at all different levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5904.383,
    "end": 5932.209,
    "text": " Yeah, you know, one thing I'm quite keen, actually, that thing about the two monkeys playing and kind of communicating and so on, is that although we, you know, we have a strong bias in the paper towards a sort of more neuroscience kind of biased model, that it is critical that we don't turn the whole thing into a neurocentric model, because ultimately, if you complain too much about biomedical model, and then kind of pain management became",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5933.337,
    "end": 5938.421,
    "text": " brain centric, neuro centric model kind of, you know, nothing really changes, does it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5938.441,
    "end": 5944.825,
    "text": "You know, it's a sort of still, you know, depending on an expert that tells tells you exactly what to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5944.925,
    "end": 5959.656,
    "text": "So, yeah, that's I like, you know, the figure two kind of gives us more a little bit of an ability to look at the whole kind of process where we did that process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5959.716,
    "end": 5960.056,
    "text": "And again,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5961.095,
    "end": 5973.366,
    "text": " I'm quite aware of, you know, criticisms that, you know, this paper may also attract from, yeah, you know, these guys just basically pontificating around touch is the most important thing and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5973.386,
    "end": 5975.928,
    "text": "And I clearly I'm not on that level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5976.536,
    "end": 5977.917,
    "text": " I'm clearly arguing for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5977.977,
    "end": 5979.038,
    "text": "No, no, it's not that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5979.338,
    "end": 5980.919,
    "text": "It's an important tool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5981.479,
    "end": 5982.86,
    "text": "It's an important vehicle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5982.9,
    "end": 5985.781,
    "text": "But ultimately, it's about communication, in my opinion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5985.822,
    "end": 5994.226,
    "text": "It's about, for me, you know, what I'm trying to kind of get into that niche, that bird song, yeah?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5994.307,
    "end": 5996.628,
    "text": "Getting that biobehavioral synchrony going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5996.748,
    "end": 6002.551,
    "text": "And I think, you know, when you're getting there, then things, you know, can, you know, some very interesting things can happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6003.432,
    "end": 6004.873,
    "text": "And, you know, I...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6005.854,
    "end": 6024.693,
    "text": " know we can explore this that's uh 2.0 next time and even uh some ideas about some of the techniques that potentially people kind of make big arguments and people are super critical about you know for example more cranial sacral or cranial based type of stuff that it doesn't work that way but you know one could argue that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6025.171,
    "end": 6036.154,
    "text": " maybe the phenomena that we observe is actually a phenomenon of synchronies, is the birdsong, and that enables us to get some very interesting things going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6036.194,
    "end": 6048.678,
    "text": "So I'm thinking a lot, I'm kind of exploring through, but I think for me that's, so figure two, clearly the other one is sort of, you know, we don't treat the brain, we treat the person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6049.018,
    "end": 6050.839,
    "text": "There's a person lives in that body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6052.806,
    "end": 6080.293,
    "text": " rather than treating bodies you know we're not you know don't think we should sort of be at that level you know it's body work you know it's not body work is you know it's it's a different story you know it's really it's about the person more than the body the body tells us a story body can be a mark of a blanket body can be many things but body it provides a landscape sensory landscape an opportunity to get into kind of influence and so on but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6081.021,
    "end": 6082.022,
    "text": " Hey, that's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6082.042,
    "end": 6084.063,
    "text": "What about the person lives there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6084.843,
    "end": 6087.145,
    "text": "That's for me the fascinating bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6087.665,
    "end": 6093.689,
    "text": "And sometimes the thing you change minor things in their generative model and the whole thing starts getting better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6094.489,
    "end": 6095.41,
    "text": "You surprise yourself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6095.85,
    "end": 6097.371,
    "text": "So that's placebo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6097.391,
    "end": 6098.191,
    "text": "Yeah, whatever it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6098.251,
    "end": 6102.034,
    "text": "But I think that can potentially be the beauty of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6104.975,
    "end": 6105.196,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6105.236,
    "end": 6106.997,
    "text": "From kind of a body work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6108.411,
    "end": 6123.423,
    "text": " cadaver materialism physicalism to embodied work with the richness of the situation that that's the map and the territory and very interesting and the uh last word for the first author",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6128.16,
    "end": 6151.691,
    "text": " Yeah, so I think both the figures... I think figure one, when I was sort of sketching out what I sort of wanted to do for it, I did, again, sort of go with... From what George said, it's not... Yes, it's neurocentric in terms of it's labelled based on the areas of the brain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6152.072,
    "end": 6155.974,
    "text": "But if you think more sort of broadly about it, the...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6157.054,
    "end": 6159.296,
    "text": " I mean, it covers a wide range of things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6159.356,
    "end": 6174.427,
    "text": "You have the two monkeys having fun, to the mom holding her baby, to sort of then people being really happy that they won something, to then the heart.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6174.547,
    "end": 6182.753,
    "text": "I mean, I think what I like about it is while it shows that touch, yeah, it's a vehicle for change, but it affects a lot of different things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6183.513,
    "end": 6207.045,
    "text": " and it's things that we might not yeah when we're examining someone in clinic we're not thinking like is this you know rewarding or are we making the bird song with the two birds kind of um doing it it's something that we we innately do i don't think we specifically always focus on that all the different effects and i think it's nice to see an overview of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6208.723,
    "end": 6209.704,
    "text": " Touch is not so simple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6210.304,
    "end": 6214.907,
    "text": "I think it shows very clearly that touch is not just touch.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6215.487,
    "end": 6223.012,
    "text": "It's not just you touch someone, you are affecting lots of different things or can affect lots of different things depending on how you use it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6224.273,
    "end": 6230.477,
    "text": "So it's just one vehicle for change, but it can affect a lot of different things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6231.257,
    "end": 6231.638,
    "text": "I liked...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6233.015,
    "end": 6239.519,
    "text": " doing it to show all just how varied it can be and how it can be manipulated for lots of different things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6240.539,
    "end": 6245.702,
    "text": "The second one, again, like George said, it's not so sort of scientific.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6245.802,
    "end": 6247.083,
    "text": "It does, I think it,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6248.766,
    "end": 6257.451,
    "text": " It shows very well that touch is used through the sort of holding of hands in the middle, but that's not the main thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6258.831,
    "end": 6265.675,
    "text": "I like how we tried to show the different sort of aspects of each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6265.855,
    "end": 6273.079,
    "text": "So what the sort of practitioner might be thinking towards what the patient could interpret the same thing as very different.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6273.559,
    "end": 6280.147,
    "text": " So you see with like B, they're trying to help and console and C, they're trying to move around.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6280.508,
    "end": 6282.61,
    "text": "But then on the other side, you've got like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6283.467,
    "end": 6295.217,
    "text": " gee, where, you know, maybe they think that the practitioner might be like, yeah, thinking, oh, okay, this injury, you know, in a few weeks time, they'll be getting back on their feet, they're getting strengthening, we can start doing rehab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6295.718,
    "end": 6300.162,
    "text": "But really, actually, the other one could be thinking, gee, like, oh, no, I'm going to be stuck in a wheelchair forever.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6303.004,
    "end": 6309.87,
    "text": "The same thing, I like how it shows the same thing can be interpreted in many different ways, depending on the priors and everything that we've been talking about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6309.95,
    "end": 6310.351,
    "text": "It's not...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6311.365,
    "end": 6317.434,
    "text": " the communication, the way things are interpreted can be interpreted things very differently with the same stimulus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6318.678,
    "end": 6335.555,
    "text": " And I think that's what we try to show, or hopefully we try to show that active inference is a lot more inclusive of lots of different things that might be going on in treatment rather than just one thing that, you know, just get them better.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6335.595,
    "end": 6337.517,
    "text": "It's not so simple.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6337.537,
    "end": 6340.941,
    "text": "There's a lot of things going on that we've tried to include.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6343.22,
    "end": 6361.143,
    "text": " Well, on the theme of the same stimuli or observation resulting in different implications for different individuals, when I saw the handshake and the symbol in the middle, I thought of the DNA double helix and of like a sort of feeling touched because it's more like a brainwave synchrony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6362.608,
    "end": 6364.369,
    "text": " telepathy situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6364.83,
    "end": 6366.831,
    "text": "Otherwise, their bodies would have been touching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6366.951,
    "end": 6369.593,
    "text": "So I think that's an awesome conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6369.633,
    "end": 6374.677,
    "text": "This was a great addition to the work itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6375.498,
    "end": 6381.282,
    "text": "And we're really looking forward to 44.2 next week at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6381.462,
    "end": 6383.264,
    "text": "So we'll look forward to seeing everybody then again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6383.284,
    "end": 6386.346,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6386.927,
    "end": 6387.207,
    "text": "See ya.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6387.687,
    "end": 6388.067,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  }
]