[
  {
    "start": 2.611,
    "end": 3.012,
    "text": " Hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3.853,
    "end": 4.854,
    "text": "Let me just wait once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4.995,
    "end": 5.956,
    "text": "Sorry, just one second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.703,
    "end": 12.146,
    "text": "So you introduced me first, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.93,
    "end": 16.711,
    "text": " Yep, just wanted to make sure that it started and it looks like we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.911,
    "end": 21.272,
    "text": "So hello and welcome everyone to Act-Inf Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.812,
    "end": 25.172,
    "text": "This is Act-Inf Lab guest stream number 6.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.833,
    "end": 29.593,
    "text": "And we're really happy to be here with Dr. Ana Ciajunica.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.033,
    "end": 32.014,
    "text": "So Ana, thanks so much for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.034,
    "end": 33.014,
    "text": "We really appreciate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.414,
    "end": 34.754,
    "text": "And we're looking forward to this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.174,
    "end": 36.175,
    "text": "Please just take it away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.315,
    "end": 42.556,
    "text": "And if anyone in the live chat wants to ask a question, I will relay those questions to you at the end of this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.796,
    "end": 44.878,
    "text": " So thanks again for coming on the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.358,
    "end": 47.039,
    "text": "And we're looking forward to what you have to share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.441,
    "end": 50.642,
    "text": "Thank you so much, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.682,
    "end": 52.163,
    "text": "And thank you so much for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.544,
    "end": 59.348,
    "text": "Today, I'm going to present a paper that we worked on the past year and just came out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.789,
    "end": 65.672,
    "text": "But I'm going to start very briefly with some of my background as a researcher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 67.213,
    "end": 69.075,
    "text": "So I'm trained as an armchair philosopher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.235,
    "end": 70.736,
    "text": "So I did in analytics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.083,
    "end": 90.105,
    "text": " philosophy so i did my thesis on physicalism and qualia you know the famous mind body problem so how exactly so some physical stuff connects with you know mental stuff and gets you know the uh gives rise to the subjective experience our conscious experiences like the heart problem of consciousness um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.034,
    "end": 104.422,
    "text": " And I was obsessed, as any respectable IIT philosopher, with the whole problem of consciousness and whether there is something special about the subjectivity of our conscious experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.062,
    "end": 117.77,
    "text": "And because I'm coming from Burgundy, I spent a lot of time trying to say that there is something special about our subjective conscious experience because there is something what it is like, for instance, to taste a particular wine,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.19,
    "end": 122.093,
    "text": " And coming from Burgundy, I had a lot of experience and a lot of example with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.593,
    "end": 126.976,
    "text": "But more recently, I decided to get off the armchair of philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 127.296,
    "end": 132.599,
    "text": "And I recently started to collaborate with people from cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.619,
    "end": 135.12,
    "text": "I actually also have a master in cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.141,
    "end": 137.403,
    "text": " and Developmental Psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.203,
    "end": 144.43,
    "text": "And I recently collaborated with the Institute of Cognitive Neuroscience at UCL in London.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.45,
    "end": 151.318,
    "text": "And my job there is to ask a main question to scientists, like, what do you mean by perception?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.338,
    "end": 152.76,
    "text": "What do you mean by social right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.281,
    "end": 155.302,
    "text": " Just to give you some examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 155.382,
    "end": 171.435,
    "text": "So one of the annoying questions I really like to ask is, you know, whenever I go to a conference is I ask people to look around them in the audience and realize that actually there are no infants in the audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 173.127,
    "end": 173.788,
    "text": " just adults.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.248,
    "end": 180.97,
    "text": "And I interpolate them on that and they look at me and say, you know, I don't see the point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.03,
    "end": 181.95,
    "text": "Why is this important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.571,
    "end": 189.573,
    "text": "Well, it is important because, I mean, when we start investigating mind and bodies, we already have an adult-centric",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.393,
    "end": 191.254,
    "text": " theoretical lens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.334,
    "end": 195.416,
    "text": "So this means that the way we look at the phenomena is from a certain standpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.016,
    "end": 204.461,
    "text": "And the standpoint that you're using inescapably is an adult one, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.921,
    "end": 212.945,
    "text": "So this means that we might have a sort of like implicit bias towards certain phenomena, a certain way of understanding phenomena that is somehow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.971,
    "end": 215.833,
    "text": " you know, adult-centric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 216.574,
    "end": 224.144,
    "text": "And we need to be careful if we want to understand how mind and brain work in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 224.905,
    "end": 227.929,
    "text": "So given that my initial",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.17,
    "end": 239.82,
    "text": " You know, entrance point into the science and philosophy was like perceptual awareness, like the fundamental point of contact of a subject with the reality of the objects out there in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 240.32,
    "end": 244.764,
    "text": "So this is like the fundamental way of actually structuring an experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.285,
    "end": 249.409,
    "text": "So you have this axis, you have an experience of subject which relates with an object over there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.029,
    "end": 264.954,
    "text": " And typically, for instance, this is how self-consciousness is understood, like perceptual awareness, when one perceives oneself as self-distinct from the world and others, and how is that linked to self-recognition in the mirror, for instance, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 265.355,
    "end": 274.038,
    "text": "So, for instance, like is the famous Rouge test, if you recognize yourself in the mirrors as a toddler, and you see that the person in the mirrors is you, then you, you know, take your...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 274.96,
    "end": 277.341,
    "text": " posted or used from your forehead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.721,
    "end": 284.144,
    "text": "And that's supposed to give you a sign that you are basically self-conscious and self-aware.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.544,
    "end": 299.15,
    "text": "But what I want to say is that maybe by endorsing that adult-centric perspective, we tacitly also endorse a sort of visual, spatial perspective on what perceptual awareness is from the very beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.15,
    "end": 316.874,
    "text": " So while I was doing my first postdoc in philosophy on the sensory motor basis of the self, I also started to do a master in cognitive science and developmental psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.274,
    "end": 321.815,
    "text": "And I started to actually address the question of perceptive awareness in a slightly different angle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.795,
    "end": 325.176,
    "text": "And instead of asking myself what, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 326.016,
    "end": 340.179,
    "text": " what does perceptual awareness is or what self-consciousness is or what self-awareness is, I decided to ask the question, how do we really get in contact with the world at the most primitive level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 340.279,
    "end": 349.501,
    "text": "How do our self-awareness experience or perceptual awareness or experiences more general emerge in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.561,
    "end": 351.902,
    "text": "So how do they unfold through the lifespan?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 354.025,
    "end": 369.319,
    "text": " And if you take that perspective, right, then you realise that actually, from the very beginning, we have that traditional axis, a subject here relates with an object there, is somehow incorrect, because in real life,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.919,
    "end": 377.205,
    "text": " the way we start actually perceiving the world is with the subject here that relates with another subject here in a very proximal way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 378.186,
    "end": 391.976,
    "text": "So this means that we'll probably need to shift the perspective and instead of taking a tacit visual-spatial understanding of what the perceptual awareness is, we need to actually expand it and be more exclusive and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.377,
    "end": 404.33,
    "text": " you know, pay attention to the fact that our first experiences are basically multi-sensory in nature and they're also proximal in the sense like we basically before",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.322,
    "end": 408.263,
    "text": " we meet other people's minds, we meet other people's body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 408.683,
    "end": 409.723,
    "text": "And why is this important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.743,
    "end": 416.964,
    "text": "It's because there is a huge literature on what does it mean for what is a minimal self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 417.604,
    "end": 432.807,
    "text": "And actually, this is important for not only for philosophy, but also for science and robotics and many, many other fields, because it is important to correctly define what we really mean by a self and by a minimal self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 435.007,
    "end": 448.452,
    "text": " And there's a huge literature from various traditions that talk about minimal self-consciousness, minimal self, core self, pre-reflective sense of self, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.972,
    "end": 464.377,
    "text": "And I think if we switch the perspective and take a more inclusive, ecological, and bottom-up approach on what the minimal self is, we avoid a fallacy, a conceptual fallacy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.017,
    "end": 467.899,
    "text": " So for instance, I'm trying to depict this fallacy with this picture here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.42,
    "end": 476.626,
    "text": "So suppose you want to find out what is a minimal model of a self-organizing system, such as a plant or a human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.446,
    "end": 488.114,
    "text": "And then if you endorse an adult-centric perspective, then you might attempt to basically take whatever structure we have as an adult plant or an adult human and squeeze those property",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.275,
    "end": 494.899,
    "text": " or try to extract the elixir, the basic structure of those properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.34,
    "end": 501.144,
    "text": "And then you say, OK, so this is how the minimal self-model of that self-organizing system is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 501.164,
    "end": 506.128,
    "text": "You squeeze the plant, make it smaller, and say, this is what the minimal model is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.588,
    "end": 510.392,
    "text": " But in reality, we know very well that actually this is not how it looks, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 510.812,
    "end": 520.761,
    "text": "So for instance, if you can see here that a plant at the minimal level, the form, the structure here is very different than the ones that you have later on in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.682,
    "end": 546.559,
    "text": " let's say the adult life so this means that we need to if we want to extract you know the basic the skeleton of a certain you know um system then we need to a from an ecological and dynamic perspective we need to take into account all this intermediary forms in order to make sure that actually understand what the plant is and what a human is right um so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.294,
    "end": 552.458,
    "text": " This is a paper that we, as I said, we recently published this year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.478,
    "end": 563.449,
    "text": "So we decided to really, really go back to the beginning and to question more carefully this idea of co-embodiment and co-homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.46,
    "end": 574.547,
    "text": " And I want to start with a disclaimer, because this is very much work in progress, and there is a lot of work to do, because, as I said, it's a shift in perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.188,
    "end": 577.93,
    "text": "So there is a lot of work to do, actually, to shake a bit, you know, the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.531,
    "end": 581.212,
    "text": " you know, the entrance point to the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.973,
    "end": 588.058,
    "text": "And this is not an active inference account of co-embodiment and co-homeostasis yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.338,
    "end": 589.359,
    "text": "This is work in progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.379,
    "end": 595.163,
    "text": "I'm doing this on different levels from, you know, metabolism to, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.327,
    "end": 601.369,
    "text": " more high-level level like self-awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 602.99,
    "end": 609.913,
    "text": "But because I need to start somewhere, we decided with my collaborators basically to use the active inference approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.734,
    "end": 620.119,
    "text": "Some of the insights of the active inference approach to bring the fundamental state of co-embodiment and co-homeostasis under the spotlight because this is something that we need to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 621.539,
    "end": 623.7,
    "text": " Because it's like, it's not mainstream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.14,
    "end": 643.625,
    "text": "So we decided to, okay, so let's take a sort of like meta level approach, use the active inference lens and show that if you like the active inference approach, if you endorse it, then you need to take carefully into consideration this kind of like very low level co-embodiment approach from the very beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.125,
    "end": 646.026,
    "text": "So this is what we're going to do in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.208,
    "end": 652.73,
    "text": " So I'm going to start very briefly with the background and predictive processing framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.071,
    "end": 656.052,
    "text": "I'm sure that you are all familiar with this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.812,
    "end": 671.46,
    "text": "So I'm not going to spend a lot of time explaining it, but I just have two slides on it just because I need to make sure that if someone is watching this and doesn't know what active inference or predictive processing is, we are on the same page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.32,
    "end": 675.062,
    "text": "And then I'm going to spend actually more time in trying to develop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.063,
    "end": 691.727,
    "text": " and motivate this need to actually take a bottom-up developmental take on what perceptual awareness and experience is in the first place, and define the notion of embodiment, homeostasis, solvastasis, and co-homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.107,
    "end": 695.628,
    "text": "But again, I'm going to define them through this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 698.188,
    "end": 699.469,
    "text": " bottom-up developmental lens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.169,
    "end": 704.35,
    "text": "And I'm going to end with some hand-waving work in progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.571,
    "end": 714.634,
    "text": "And I'm very open to suggestions because, as I said, this is very much an open question and there is a lot more work to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.061,
    "end": 722.764,
    "text": " Okay, so I believe you are all familiar with the predictive processing framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.784,
    "end": 732.228,
    "text": "So the basic idea is that our brain is not a passive sponge that automatically, somehow, passively receives information and somehow...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.948,
    "end": 748.373,
    "text": " you know, gives the motor output, but rather we should conceive the brain as a sort of like active system that anticipates the next sensory input on the basis of prior inputs, such as that actually can map the world in a more accurate way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 750.919,
    "end": 769.942,
    "text": " This idea very nicely fits with some previous ideas that have been developed in parallel by the embodied cognition paradigm approach in cognitive science, where they basically, this author like Varela and colleagues, basically outline this idea that cognition should be understood",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.106,
    "end": 788.719,
    "text": " as the enactment of the world and the mind on the basis of history of variety of action that the being in the world performs in the sense like we cannot really understand cognition in isolation from the body and we cannot understand the body in isolation from the environment and we cannot understand either the body or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 789.72,
    "end": 797.306,
    "text": " the relation between the mind, body, and the environment without taking into account the history of those connections in the first place, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 797.346,
    "end": 803.51,
    "text": "Because this is not a static phenomenon, but it's more like dynamic and follow through with time because this is what life is, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.071,
    "end": 811.016,
    "text": "So this means that our ongoing perception and cognitive processes and action are influenced by prior events and prior experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.076,
    "end": 817.861,
    "text": "So this is something that embodied cognition approaches and predictive processing approaches somehow agree on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.091,
    "end": 829.879,
    "text": " a different level of explanation, but the basic idea is that you cannot consider this phenomenon in isolation from past events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.819,
    "end": 847.371,
    "text": "Another common ground is this idea that humans are biological agents that emerge as proactive survival-enabled prediction machines which strive to reduce uncertainty within a highly volatile environment, so we basically try to make sense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.831,
    "end": 858.14,
    "text": " of the environment out there because, you know, the world is bigger than our heads and we try to find a way to actually navigate this bigger world, which is highly unpredictable and potentially threatening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 859.001,
    "end": 872.953,
    "text": "So one idea is that in order to keep track of the survival and reproduction relevant bodily and worldly information, our brain solves that problem of uncertainty by generating self and world models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.912,
    "end": 879.715,
    "text": " And it does so by extracting statistical patterns of information from its embodied and worldly interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.216,
    "end": 883.458,
    "text": "And there is a mathematical story behind this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 883.698,
    "end": 889.061,
    "text": "I'm not a mathematician, I'm a philosopher, so I'll leave that to the mathematician.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.081,
    "end": 894.644,
    "text": "But I think what I need as a philosopher, I need just this idea that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.186,
    "end": 902.694,
    "text": " our ongoing perception, cognition, and action are processed through the lens of prior self and world-related information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.455,
    "end": 907.08,
    "text": "So this is what I need, the only information I need, the only thesis I need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.641,
    "end": 912.187,
    "text": "Now, if this is true, then this means that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.173,
    "end": 919.777,
    "text": " it becomes crucial to look at how this experience as an action perception gets off the ground from the outset, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 919.877,
    "end": 922.158,
    "text": "Because we need that lens to be accurate, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.718,
    "end": 924.459,
    "text": "In a dynamic and ecological way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.54,
    "end": 940.708,
    "text": "One basic and overlooked aspect of our embodied and predictive processing approaches in both philosophy and cognitive neuroscience is that brains and mind and human bodies first develop within another human body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 942.547,
    "end": 952.93,
    "text": " And this is an important point because, crucially, while not all humans will have the experience of being pregnant or carrying a baby, the experience of being caring and growing with another person is universal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.07,
    "end": 958.211,
    "text": "So this is something that all humans are concerned with, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.771,
    "end": 966.693,
    "text": "And this is something important as well because way before we meet other people's minds, we literally meet on...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 968.106,
    "end": 969.967,
    "text": " to logically meet other people's bodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.767,
    "end": 978.911,
    "text": "And it's something I developed already in 2017, where I looked at empathy in basic form of shared experience, but the idea is the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.291,
    "end": 993.618,
    "text": "It's like, okay, so if we really want to understand the relation between mind-body and how embodied creatures relate with others and the world, we really need to go back to this basic idea that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.673,
    "end": 996.476,
    "text": " yeah, before we meet other people's minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 996.996,
    "end": 998.558,
    "text": "We literally meet other people's body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1000.12,
    "end": 1011.015,
    "text": "So there is a lot of work, previous work, that looked at the homeostatic and bodily mechanism operating at early stage of developing infancy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.906,
    "end": 1015.068,
    "text": " So post-birth, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.189,
    "end": 1025.196,
    "text": "We decided to take a step further and to focus on pregnancy because this is a universal case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1025.276,
    "end": 1034.063,
    "text": "Remember, I'd like to emphasize this because typically, you know, when people hear the word pregnancy, they say, okay, this is a woman's stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.55,
    "end": 1040.694,
    "text": " Because, I mean, certain people, certain person can get pregnant, certain other don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.954,
    "end": 1050.981,
    "text": "But if you take the perspective, the other perspective, then you realize that actually all humans are concerned with this experience, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.161,
    "end": 1055.604,
    "text": "Where two individual organists literally grasp and grip into each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1059.042,
    "end": 1079.221,
    "text": " Contrary to the common view that the fetus is passively contained and sometimes is put as like solipsistically trapped within the solitude and the silence of the womb, we will present evidence showing that actually there is a lot of going on there already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.561,
    "end": 1084.186,
    "text": "There is an active and bidirectional co-regulation between the two living bodies and two living organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1087.435,
    "end": 1089.916,
    "text": " And we need to start with some basic definitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.096,
    "end": 1097.039,
    "text": "So first of all, I'm going to talk a lot about co-embodiment, but we need to make clear what exactly we mean by embodiment in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.14,
    "end": 1102.622,
    "text": "There is a lot of work already in the literature on the relation between the body and self.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1103.323,
    "end": 1110.406,
    "text": "I highly recommend this very recent review by Keenan colleagues coming from York Note of Love.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.826,
    "end": 1113.248,
    "text": "They have a very rich overview of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.212,
    "end": 1117.693,
    "text": " you know, the relation between the bodily self and self-awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.593,
    "end": 1133.836,
    "text": "But here I'm going to use my analytical philosophy card and I'm going to define embodiment in its minimal form to refer to the instantiation of bodily properties by a given individual, in our case, a human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.516,
    "end": 1143.918,
    "text": "In other words, all talk about embodiment can be conceptually and ontologically linked to talk about embodied beings and their bodily properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1145.751,
    "end": 1168.137,
    "text": " Now, the key starting idea here is that brain and minds, as I said, if you take the embodied cognition approach and also, more recently, the predictive processing and active inferences approach, they all seem to agree that the brain and minds don't emerge in a vacuum but develop and evolve as a system dedicated to controlling and observing the organism's survival and reproduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.457,
    "end": 1169.017,
    "text": "So basically,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.517,
    "end": 1186.933,
    "text": " If you take the classical mind-body problem, instead of conceiving the body as a sort of vehicle or car that's there to support and fuel the mind, actually you should consider it the other way around, namely that the mind has evolved to actually subserve the needs of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.674,
    "end": 1194.28,
    "text": " of an organism, of a body, of your human body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.54,
    "end": 1199.966,
    "text": "So you basically shift the perspective, which comes first, which one is actually more important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.042,
    "end": 1211.509,
    "text": " Crucially, however, so if we endorse this perspective and we agree with this shift, then we need to consider the fact that human bodies do not emerge in a vacuum either, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1211.589,
    "end": 1216.912,
    "text": "So human bodies basically emerge and develop within another human body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.773,
    "end": 1229.101,
    "text": "So this means that we need to adapt and extend the notion of embodiment to reflect this fundamental body within a body case, which, again, I'm going to stress again and again, this is universal, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.161,
    "end": 1230.282,
    "text": "It's not just like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.102,
    "end": 1234.605,
    "text": " a part of the population.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1234.845,
    "end": 1238.487,
    "text": "But what does it mean to say that the two agents are co-embodied?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.828,
    "end": 1246.293,
    "text": "Well, in biological terms, this means that, as we'll see very shortly, is that the regular...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.239,
    "end": 1267.946,
    "text": " of the two agent states and particularly the need to maintain that physiological stability despite the fluctuating and unpredictable environment is actively negotiated between the two organelles that share for a given amount of time, typically nine months, but could be shorter or a bit longer, common and bodily and environmental resources.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.566,
    "end": 1275.973,
    "text": " And I need to give you an example of what exactly I mean by coin embodiment, because I think this is a key point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.094,
    "end": 1283.222,
    "text": "So I'm going to ask you to walk with me into a thought experiment, because I'm a philosopher, so I'm going to present you with a thought experiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.842,
    "end": 1284.843,
    "text": "So imagine you...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1286.485,
    "end": 1315.544,
    "text": " you have a friend and you uh you know you you you have to perform a circus show right and with your friend and you have to share this pair of trousers here so your friend puts his his left leg in the left part of the shirt of the trousers and you put the right leg on the right part of the trousers and you need to coordinate your walking such as actually you can walk as fast as you can to actually reach a target right on apples",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.346,
    "end": 1328.972,
    "text": " Now, suppose that your friend is hitting his toe against a rock, stumbles and falls and experiences thereby fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1329.092,
    "end": 1332.855,
    "text": "So what is happening in his body, in his organism, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1333.595,
    "end": 1338.518,
    "text": "So this means that maybe your friend is going to entrain you in fall",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1340.419,
    "end": 1348.123,
    "text": " In which case, you can say that the two bodies, I mean, you, the friends, are co-falling, or you share the state of, like, falling together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.863,
    "end": 1358.448,
    "text": "And you can also say that, well, because it's kind of, like, negative event, your friend is kind of, like, experiencing fear, and you also...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.787,
    "end": 1362.751,
    "text": " experiencing fear as well while falling, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1363.332,
    "end": 1367.318,
    "text": "So you share that state of fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.659,
    "end": 1372.565,
    "text": "Not crucially, however, that this is not necessarily so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1373.416,
    "end": 1380.302,
    "text": " So suppose, for instance, that your friend is a master yoga teacher, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.483,
    "end": 1389.37,
    "text": "And while you are falling, your friend has somehow managed to keep the balance and the tissue of the trousers kind of like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1391.952,
    "end": 1413.979,
    "text": " and all destroyed and you know one is standing and other one is falling right it's not necessarily so you can imagine in case that actually this is happening and also imagine a case in which let's say well why your friend is falling and experiencing fear you find the entire situation actually pretty funny and instead of experiencing fear you experience amusement right so the two emotional states are not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.996,
    "end": 1417.517,
    "text": " shared, necessarily shared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.617,
    "end": 1422.738,
    "text": "So your friend experiencing fear, or your experience, like, say, amusement, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.018,
    "end": 1427.24,
    "text": "So that's one example of, like, what we can understand by sharing a state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.7,
    "end": 1431.281,
    "text": "Now, let us go back to the case of pregnancy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.641,
    "end": 1433.582,
    "text": "Note that the case of pregnancy is very different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.702,
    "end": 1443.085,
    "text": "Because if you take exactly the same example, and say that the mother is, like, stumps on a pin or something, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.985,
    "end": 1459.41,
    "text": " you know, falls, then there is no way in which the foetus can say, wait a minute, actually, I'm not, I don't like the situation, I don't want to fall, I don't want to experience fear, and I don't want to experience negative, you know, emotion, I'm going to sit, you know, stay put here, you go ahead, fall, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.83,
    "end": 1471.234,
    "text": "So this means that actually there is a way in which the two states are, the two organisms are necessarily linked, such as the bodily self regulatory processes of one organism necessarily",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.174,
    "end": 1474.536,
    "text": " is linked to the other one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1475.937,
    "end": 1483.542,
    "text": "So it is important to distinguish the case of pregnancy from the case of two bodies like contingently happen to share a state, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.282,
    "end": 1491.227,
    "text": "And we can thus define the notion of like co-embodiment and saying that two or more, if you have twins or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1493.268,
    "end": 1504.656,
    "text": " are co-embodied in this strange case if they are bound to share bodily and environmental resources for a set time period, typically 9 months, for survival purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.031,
    "end": 1516.116,
    "text": " Not that pregnancy is not the only case where we can find instances of this type of strong co-embodiment, like, for instance, male siblings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1516.656,
    "end": 1520.939,
    "text": "But we decided to focus on the case of pregnancy because, as I said, this is a universal case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.079,
    "end": 1523.781,
    "text": "All humans have experienced this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1524.681,
    "end": 1524.821,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.862,
    "end": 1532.571,
    "text": " There is already work on the fascinating phenomenology of shared embodiment, and I highly recommend to read it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.753,
    "end": 1540.783,
    "text": "In what follows, basically, I'm going to very quickly go to start with the very basic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.004,
    "end": 1551.652,
    "text": " level of actually what is happening at the, you know, from single cell going up to the organism and that kind of like shared embodiment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1552.292,
    "end": 1554.915,
    "text": "Again, this is fascinating, a huge literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.935,
    "end": 1561.48,
    "text": "When you think about it, we start with like this tiny little round thing with another person body and then we, you know, become ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.982,
    "end": 1572.175,
    "text": " So again, I'm going to be very quick and very sketchy on this fascinating process, but I'll try to flag the crucial points",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.534,
    "end": 1576.436,
    "text": " steps and the crucial stages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.937,
    "end": 1581.301,
    "text": "So the first stage is the process of implantation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1581.341,
    "end": 1587.807,
    "text": "So basically, when there is a dialogue between the fertilized egg and the mother body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1588.388,
    "end": 1598.557,
    "text": "And actually, this is the crucial step of a pregnancy, a successful pregnancy, because for instance, most of the miscarriages happen during this step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.999,
    "end": 1604.582,
    "text": " This is a sort of negotiation process going on between the two organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1604.702,
    "end": 1608.365,
    "text": "And like any negotiation, things can go",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1609.289,
    "end": 1634.324,
    "text": " okay or can go wrong right so this means that both the blastocyte the baby and the endometrial tissues they need to actively regulate gene expression transcription factors signal pathways inhibiting factors and growth factors during that implantation process this is highly complex process and very fragile and very delicate if something goes wrong can go to miscarriage or um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.004,
    "end": 1651.052,
    "text": " At this stage, the maternal body literally self-modifies through differentiation into specific types that support implantation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.612,
    "end": 1658.997,
    "text": "So the key idea here is that embryo and the mother's body need to coordinate with these cells within that very tiny implantation window.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.444,
    "end": 1667.288,
    "text": " Now, if this process, let's suppose, is successful, then the coordination goes to the next step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.749,
    "end": 1675.774,
    "text": "Between week 7 and 13 of movements, it involves self-organization, can start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1676.494,
    "end": 1681.938,
    "text": "And the self-organization, interestingly, involves movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.877,
    "end": 1697.441,
    "text": " which is actually very important, especially for the active inference community, because as you say, as you can see, actually movement is present very early on in our lives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.161,
    "end": 1701.662,
    "text": "So these movements are initiated from the so-called...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.878,
    "end": 1713.043,
    "text": " central pattern generator in the early spinal cord, which produces around week eight very abrupt startles of the entire fetal body, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.544,
    "end": 1728.533,
    "text": "Importantly, note that the startles, which is somehow automatic, right, we think of like a sort of like heartbeat, right, it's going, you know, automatically, provide the minimal basis for the most basic occasion of sensory feedback, because in doing so, for instance, at half",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.634,
    "end": 1732.057,
    "text": " and might start to touch the face.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1732.637,
    "end": 1733.378,
    "text": "And that's softly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1733.478,
    "end": 1738.223,
    "text": "I have my hand automatically or unwillingly touching my face.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.263,
    "end": 1746.451,
    "text": "And then I received a slight sensory feedback on my face from my right hand, or my leg might change its position, be flexed or extended, or both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.911,
    "end": 1753.698,
    "text": "So this means that I might have some minimal sensory feedback at this stage that affords the possibility to respond and adapt to these movements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1754.198,
    "end": 1762.439,
    "text": " This means that self-organization and fetal movement initiate as a biomechanical process that progressively builds sensory and regulatory capacities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.755,
    "end": 1781.248,
    "text": " So for instance, as I said, by being stimulated by a startle, the fetus perceives that the hand is movable and that touching the face rather than the uterine wall with the hand might feel different because I'm more sensitive here on the face that actually I can feel my fingertips if I touch the uterine wall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.628,
    "end": 1786.332,
    "text": "But if I touch my own face, I have a double touch, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1787.731,
    "end": 1793.42,
    "text": " Okay, so with this in hand, we can go further to this notion of homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.581,
    "end": 1798.008,
    "text": "And bear in mind that this is all happening so we have a developing body within another body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.437,
    "end": 1808.288,
    "text": " Now, homeostasis typically refers to the organism's need to maintain a stable internal environment despite fluctuating external environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1809.048,
    "end": 1819.621,
    "text": "And homeostatic regulation typically entails using feedback control mechanisms to keep the senses viable of that internal environment within the radius compatible for the survival, in this case, form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1820.405,
    "end": 1821.506,
    "text": " compatible human survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.226,
    "end": 1848.164,
    "text": "Now, it is well established that this control involves automatic actions like motor reflexes, endocrine, immunological and autonomic processes that are driven by the feedback inputs and the resulting prediction error, which is the discrepancy between the expected bodily states at a homeostatic set point and its actual level as signalled by the sensory inputs from the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.95,
    "end": 1860.872,
    "text": " And as early as 1929, it has been proposed that maybe the control of body homostasis is considered a primary aim of a brain function, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1862.202,
    "end": 1875.213,
    "text": " And again, this underlying assumption is that the fundamental drive towards self-preservation, to take care of this body, this self, is essentially linked to constraints of acting within the body's visceral states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.873,
    "end": 1890.245,
    "text": "So it has been classically proposed to define the homeostatic set points as the expectation, the means of prior belief about the states the body should inhabit, and homeostatic range as the variance of these prior beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1893.766,
    "end": 1898.41,
    "text": " Going back to our case, so let's go back to square one, the primitive level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.931,
    "end": 1903.034,
    "text": "So many years, it has been assumed that the fetus has no metabolism of its own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1904.576,
    "end": 1909.04,
    "text": "Nowadays, it's well established that actually the placenta and the fetal liver work in tandem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.57,
    "end": 1916.334,
    "text": " as a sort of coordinated multi-organ system to provide the necessary nutrients, subserving the fetal metabolism in growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1916.715,
    "end": 1922.839,
    "text": "And this is important because if you talk about homeostasis, we need to talk about metabolism, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1923.2,
    "end": 1929.064,
    "text": "Because glucose is the most important fuel for fetal metabolism and ultimately for homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.564,
    "end": 1936.63,
    "text": "So this means that maintaining an optimal balance as a continuous supply of nutrients from the mother to the fetus is critical from the development",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1937.25,
    "end": 1945.355,
    "text": " and from the fetus standpoint, is basically critical for maintaining his own homeostatic balance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.738,
    "end": 1970.256,
    "text": " Now, note that the fetus may be able to control and save some energy to some extent through many complex and dynamic processes, but importantly, however, it is oversupply and undersupply of nutrients by the mother, right, which are process controlled by the pregnant person that can permanently program the fetal metabolism adversely, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.856,
    "end": 1971.597,
    "text": "So this means that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.516,
    "end": 1990.528,
    "text": " The way the mother handles her own metabolic processes significantly impacts the way the baby has his self-regulatory process maintained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.708,
    "end": 1999.394,
    "text": "And there is accumulating evidence that there is a direct link between mothers' adverse bodily and mental health states, like depression and anxiety during pregnancy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.083,
    "end": 2002.644,
    "text": " and child mental and physical development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2002.985,
    "end": 2014.79,
    "text": "But this is valid not only for the negative states, but also more like neutral states, such as food preferences and flavors that are passed on from the mother to the infant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.87,
    "end": 2017.392,
    "text": "So there is a strong, strong codependence there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.412,
    "end": 2028.117,
    "text": "Now, the key intermediary conclusion at this stage is that emerging self-organizing organisms",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2029.47,
    "end": 2037.636,
    "text": " human organism is not only self-centred but also crucially co-embodied and co-independent upon homeostatic processes within the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2038.677,
    "end": 2041.679,
    "text": "So that's the basic thesis up to now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.72,
    "end": 2052.687,
    "text": "Now, we need to take this a step further because we need to talk about also action anticipation and not just prediction or perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.477,
    "end": 2064.64,
    "text": " So we saw up to now that homeostatic regulation requires a model that enables inference, perception, and prediction action and selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.06,
    "end": 2072.242,
    "text": "Importantly, however, the brain initiates regulatory responses prior to the homeostatic alteration, provided it can be anticipated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.322,
    "end": 2080.484,
    "text": "So this means that you basically have to go to the fridge to seek food because you are hungry, but actually you are not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.393,
    "end": 2089.259,
    "text": " You're not waiting for the starvation to happen, to actually go to the fridge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2089.299,
    "end": 2092.183,
    "text": "You do it a while before that actually is going to happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2092.243,
    "end": 2093.685,
    "text": "So you anticipate that state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.847,
    "end": 2102.91,
    "text": " So this means that higher levels that enable prospective control are leveraged with two essential components, like inference and prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2103.69,
    "end": 2109.632,
    "text": "Which brings us to allostasis, which is defined as anticipatory homeostatic control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2109.712,
    "end": 2116.014,
    "text": "Basically, you take action into the world because you need to regulate your inner homeostatic balance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.334,
    "end": 2119.015,
    "text": "But you're doing this by taking action into the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.415,
    "end": 2120.896,
    "text": "And importantly, you're doing this by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.997,
    "end": 2124.142,
    "text": " anticipating, you know, that state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2124.522,
    "end": 2130.054,
    "text": "You don't really expect to be on the age of like, you know, dying from starvation to actually take that action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.945,
    "end": 2135.827,
    "text": " if you are an optimal surviving organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.247,
    "end": 2153.293,
    "text": "So this means that the process whereby the agent selects action that will most probably bring about the desired sensory entries while explicitly or implicitly modifying the true causal structure of the environment so as to guarantee the recurrence of those inputs over multiple time steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.353,
    "end": 2157.254,
    "text": "So this means that I can act differently in different environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2158.174,
    "end": 2173.728,
    "text": " I can go to a fridge if I'm hungry, but if I'm in the desert, I could, you know, if I expect to see a fridge and, you know, I don't see it, then I'm going to probably die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.128,
    "end": 2178.332,
    "text": "Instead of looking for a fridge, I should probably look for, I don't know, a banana tree or a coconut tree, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.873,
    "end": 2183.637,
    "text": "So the environment defines what type of expectations you should have in a particular case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2185.242,
    "end": 2187.765,
    "text": " Now, there are two points that are important here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.706,
    "end": 2200.778,
    "text": "Note that for the individual living organism, we can conceptually distinguish homeostatic processes from allostatic processes, but in real life, those go hand in hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2202.863,
    "end": 2222.096,
    "text": " hand in hand right there are two faces of the same coin this is because we humans we are not static isolated creatures we are dynamic beings depending on the rich environmental resources and we depend upon social interaction to achieve survival and reproduction and to give you like the basic example that i really like is the like the breathing like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2223.598,
    "end": 2226.582,
    "text": " It's a perception, so it's an open-ended process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.962,
    "end": 2233.03,
    "text": "We are constantly exchanging information with the environment via breathing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.091,
    "end": 2236.995,
    "text": "And this is a dynamic process because my body moves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2237.296,
    "end": 2240.5,
    "text": "My thoracic cage is moving all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.007,
    "end": 2252.38,
    "text": " And this means that those type of processes, like allostatic processes and homeostatic processes, even though we can conceptually distinguish it, in reality, they are actually co-occurs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.584,
    "end": 2267.492,
    "text": " This means that perception and action, homeostatic and allostatic self-regulation are coupled, strongly coupled, in a dynamic loop that keeps the organism permeable to and connected with the surroundings, for better and for worse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.892,
    "end": 2279.239,
    "text": "Because when I breathe in, I can take in the air, right, that is necessary oxygen for my survivor, but I can also take in the coronavirus, you know, and, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.421,
    "end": 2282.586,
    "text": " eventually potentially die, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2282.987,
    "end": 2286.356,
    "text": "So we are open system for the better and for worse in that sense, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.407,
    "end": 2296.191,
    "text": " The second point is that, going back to our case here in pregnancy, is that self-regulatory architecture is multilayered.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2296.851,
    "end": 2299.472,
    "text": "This is an interesting point here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.373,
    "end": 2305.735,
    "text": "It's already complicated for an individual, but imagine for actually two individuals that are literally gripped into each other, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2306.235,
    "end": 2312.378,
    "text": "Because the baby's regulatory processes are coupled with the mother's homeostatic and allostatic processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.898,
    "end": 2314.999,
    "text": "And this is achieved mainly through the placenta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2315.959,
    "end": 2322.88,
    "text": " which is an ephemeral and intermediary organ that enables vital and biological exchanges between the two bodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.861,
    "end": 2332.882,
    "text": "For example, it allows the infant to breathe despite the lack of proper lung regulation and ensure that the infant is fed despite lacking proper eating factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.783,
    "end": 2344.385,
    "text": "Note again that placenta is a relational organ par excellence, but is also a universal organ, whereas typically people associate placenta with the female body,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.425,
    "end": 2363.379,
    "text": " and a certain type of population to a certain type of persons, but we all have used, all humans have used successfully this organ in order to survive and, you know, I don't know, do philosophy, cognitive science and active inference later on in their lives, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.86,
    "end": 2366.242,
    "text": "And this is important to keep in mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.922,
    "end": 2367.082,
    "text": "Now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.858,
    "end": 2379.345,
    "text": " If I'm right, this means that a dynamic and complex system such as the human body needs to be able to play a double game in order to survive and potentially reproduce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.045,
    "end": 2390.693,
    "text": "It has to successfully maintain sensory states within a certain physiological bounds, but it also has to flexibly change the states in order to adapt to a constantly changing environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.102,
    "end": 2408.659,
    "text": " So if we look at the human body through this dynamic lens, it becomes obvious that what happens in between the organism and its environment, I mean, the boundaries between the two play a key role in making sure this game is correctly played and flexible enough to actually maintain the organism alive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.04,
    "end": 2414.824,
    "text": " So this means that we need to define the critical notion of boundary or in between.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.844,
    "end": 2420.087,
    "text": "We need a new conceptual toolbox in order to make sure that we get that process correctly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.168,
    "end": 2423.81,
    "text": "And this is something I'm currently working on with some collaborators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.518,
    "end": 2441.07,
    "text": " And some of you probably know that the notion of Markov-Blank had been advocated as a potential candidate to a promising way of conceptualizing this key notion of the boundary, the medium between the two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.251,
    "end": 2442.211,
    "text": "And again, this is like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.887,
    "end": 2448.289,
    "text": " work in progress, and there is a lot of work to be done on that side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.789,
    "end": 2467.496,
    "text": "But for this talk, I really need to retain this very simple idea that homeostatic and anticipatory self-regulation depends not only on the body states, but also on the external environment, and more crucially, on the relation between the two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.036,
    "end": 2476.882,
    "text": " So we can just define co-homeostasis as the bidirectional process of co-regulation that happens in between two co-embodied organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.883,
    "end": 2485.208,
    "text": "And co-homeostasis involves self-regulation through others-coupled and homeostatic and allostatic looping states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2488.728,
    "end": 2504.176,
    "text": " And this is something that we have to, you know, work a bit with the reviewers on our paper, and they were kind of like right-pressing clarification on this point, because it's important to bear in mind that if we talk about bidirectional process, it doesn't mean there is asymmetry there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2505.437,
    "end": 2506.699,
    "text": " or absence of conflict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.34,
    "end": 2510.665,
    "text": "On the contrary, actually, things can go wrong, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.685,
    "end": 2519.077,
    "text": "In the sense, like, it can be that, you know, one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.559,
    "end": 2544.38,
    "text": " one agent actually takes the balance too much in one sense than the other and to give you an example like what exactly what i mean by that so think of a uh highway right uh so uh you can have that's that's a bi-directional highway traveling from north to south let's say that you have typically more cars coming from north to the south i mean from the mother",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.04,
    "end": 2545.7,
    "text": " to the infant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2546.16,
    "end": 2556.983,
    "text": "But if you can have one single car traveling from south to north, and that car is like, I don't know, carrying a bomb, then actually that's irrelevant, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2557.103,
    "end": 2558.284,
    "text": "It's not the quantity that matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.304,
    "end": 2562.025,
    "text": "It's actually the quality of the information that is carried between the two organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.085,
    "end": 2563.585,
    "text": "And actually, you have many, many cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.665,
    "end": 2573.448,
    "text": "And basically, during the pregnancy, I know a mother's pregnant person develop diabetes or other immuno",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.288,
    "end": 2577.849,
    "text": " immunological disorders, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.689,
    "end": 2586.972,
    "text": "So it's not necessarily a straightforward process, as I said, and I'm emphasizing this, this is a constant negotiation between the two organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.272,
    "end": 2593.114,
    "text": "It's a dynamic open-ended process that can go okay, but can also go very wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.134,
    "end": 2594.254,
    "text": "Now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.458,
    "end": 2613.105,
    "text": " The big claim, the radical claim we want to make is that given the necessary universal co-involvement sustaining the human body's self-regulation and self-organizatory processes from the outset, the early homeostatic regulation should be fundamentally conceived as co-regulation and homeostasis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.775,
    "end": 2628.558,
    "text": " Now, in a further work, we want to develop this idea of when exactly and how the brain starts to be a self and world model in the womb, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.278,
    "end": 2638.339,
    "text": "Because it's a key question for the predictive processing framework and the active inference community.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.419,
    "end": 2640.4,
    "text": "So how exactly is this happening?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.44,
    "end": 2641.64,
    "text": "When exactly this is happening?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2642.4,
    "end": 2647.282,
    "text": " This is highly speculative and very much work in progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2648.502,
    "end": 2653.263,
    "text": "So it's an open question whether the fetus is able to generate the cell-front wall models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.703,
    "end": 2655.964,
    "text": "And if yes, at what stage of development?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.424,
    "end": 2666.307,
    "text": "Some people argue that this might be possible only after the basic thalamocortical connection are established in the fetal brain around 20 weeks of gestation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.507,
    "end": 2668.287,
    "text": "This is because...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2670.608,
    "end": 2679.373,
    "text": " The main reason is because after this time point, sensory information can be transferred to the fetal brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2680.674,
    "end": 2686.637,
    "text": "Before the establishment of this thalamocortical connection, the fetus just acts on reflex automatic mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.497,
    "end": 2692.5,
    "text": "However, other people argue that through the central part of the brain,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.362,
    "end": 2707.033,
    "text": " generate seemingly chaotic exploratory movements, they also can generate a sort of like sensory motor coupling and or some very basic primitive sensory experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2707.773,
    "end": 2711.016,
    "text": "Again, this is like an open question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2711.776,
    "end": 2722.525,
    "text": "And this is something that I address in a preprint currently under review with two of my collaborators, Adam Saffron and Jonathan Delafield-Bart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.926,
    "end": 2740.524,
    "text": " We look at how exactly the fact that our first experiences are co-embodied may impact the way we understand current theories of conscious experiences in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.662,
    "end": 2763.727,
    "text": " uh and what we or provocative take is that you know our consciousness study focused too much on visual experiences uh and a visual spatial way uh perspective endorsing a tacit adult-centric and visual spatial perspective and we want to say that perhaps conscious experiences are not all about seeing red apples to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2764.307,
    "end": 2766.188,
    "text": " You know, famous example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.988,
    "end": 2780.895,
    "text": "So what are the implications of switching the perspective, you know, from this, like, what we understand by minimal self and minimal self models, you know, from endorsing more ecological bottom-up perspective rather than adult-centric and...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.396,
    "end": 2784.437,
    "text": " vision-based perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2784.877,
    "end": 2789.439,
    "text": "Again, this is very much work in progress, something that we are working on right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.859,
    "end": 2802.525,
    "text": "But, you know, just like bullet points, if we switch the perspective, then we need to question the individually static and solipsistic approach of understanding of the perceptual link between the ancient environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.145,
    "end": 2811.409,
    "text": "We also need to question the adult-centric thesis of sort of like fully-fledged emerging individuals like, you know, Athena, a Greek goddess,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2812.392,
    "end": 2814.314,
    "text": " or this Athena coming out from Zeus' head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.094,
    "end": 2820.84,
    "text": "So rather than humans emerge within other humans and develop through close interaction with other humans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2822.181,
    "end": 2827.225,
    "text": "We also need to question the idea of a self-awareness of a minimal self developing independently of other selves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.305,
    "end": 2835.373,
    "text": "This is because, as I hopefully convinced you, that we basically are ontologically depending from the others from the very beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2836.297,
    "end": 2838.319,
    "text": " at a very basic biological level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.919,
    "end": 2844.884,
    "text": "And then the question, we need to also question the idea of a perception being a solitary and distant endeavor, like seeing a red apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.705,
    "end": 2852.49,
    "text": "But rather, we need to see a perception as an active interaction, an active engagement with environment-like points",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2853.351,
    "end": 2863.554,
    "text": " touching a human being, or coupling the interoceptive signaling, like the breathing, so the way I feel the air inside my body, the way I take the air from outside.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.614,
    "end": 2867.435,
    "text": "And also important, the perception of that perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.055,
    "end": 2871.296,
    "text": "That perception comes before seeing the red apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.696,
    "end": 2881.819,
    "text": "And if this approach is right, this means that that early primitive perception influences the way we perceive and see the red apple later on in life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.822,
    "end": 2899.558,
    "text": " And the take-home message is that when it comes to understanding the nature of our perceptual experience in general, I also haven't argued for this in this paper, but we are trying to build a case for this idea as well, and conscious experience as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2900.779,
    "end": 2903.943,
    "text": "The infant is father to the man, to the human, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2904.864,
    "end": 2905.905,
    "text": "To paraphrase this...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.121,
    "end": 2911.102,
    "text": " metaphor by the English poet Whitworth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.743,
    "end": 2913.663,
    "text": "And this is it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2913.683,
    "end": 2918.685,
    "text": "I would like to thank my collaborators for working with me on this radical project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2919.505,
    "end": 2924.747,
    "text": "I would like to thank the organizing of the Arctic Inference Lab for inviting me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.867,
    "end": 2940.034,
    "text": " I also would like to ask you that if you are interested to collaborate with me along those lines of paradigm shift, please drop me an email because I'm very open to these ideas and to develop further.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2942.075,
    "end": 2944.356,
    "text": "This is it and thank you for your attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.997,
    "end": 2947.497,
    "text": "Thanks, Ana.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.537,
    "end": 2948.998,
    "text": "That was really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2949.498,
    "end": 2952.82,
    "text": "Maybe you can unshare and we'll have a little bit of time to discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.489,
    "end": 2955.749,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.809,
    "end": 2959.39,
    "text": "So if anybody wants to post a question, they're free to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.41,
    "end": 2975.516,
    "text": "I have a bunch of thoughts in question, but one piece that right at the beginning, you mentioned the historical nature of inaction, and it just shows that sometimes when people are talking about inactive approaches, they're, oh, you know, picking up this pen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.896,
    "end": 2977.717,
    "text": "It's the snapshot inactivist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.277,
    "end": 2983.422,
    "text": " but actually the implications of action are that we have to think about history and development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.783,
    "end": 2987.426,
    "text": "So I really appreciate the way that you framed it in these terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2988.788,
    "end": 2993.873,
    "text": "So maybe just to get things started, where does active inference come into play here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.293,
    "end": 2996.956,
    "text": "That's a pretty big question, but where does active inference come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.569,
    "end": 3009.916,
    "text": " Yeah, so I think active influence comes into play in the way we actually understand how the minimal self is construed, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.976,
    "end": 3019.063,
    "text": "So how the minimal self-organizing system is somehow negotiate that exchange of information between, you know, his own self model and the environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.623,
    "end": 3028.27,
    "text": "So the radical idea we want to put forward there is that the closest environment and the most primitive environment that we have in the first place is another human body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.57,
    "end": 3034.909,
    "text": " There's not some sort of like objective environment, but another subjective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.689,
    "end": 3039.59,
    "text": " I mean, lived, you know, body, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.43,
    "end": 3043.571,
    "text": "So I think that's kind of like radical idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3044.111,
    "end": 3060.474,
    "text": "And this means that we basically, we need to not add an extra level, even more dynamic to the active inference to say, it's just not enough to basically just act and to make sense of that action in the world and the movement, but actually we need to take it as a sort of like double way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.794,
    "end": 3064.755,
    "text": "It's a core coordination between the two organisms, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.276,
    "end": 3072.723,
    "text": " So it's not just like action, it's just like co-action and co-movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3074.466,
    "end": 3078.17,
    "text": "So this means that it's even more messier than we thought at the very beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.032,
    "end": 3083.077,
    "text": "It's like if you take the standard approach, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3083.157,
    "end": 3085.18,
    "text": "So you have the environment, the agent, and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3085.782,
    "end": 3095.045,
    "text": " the agent needs to build a model of that environment based by contrasting, you know, whatever the self, internal self model says and whatever it, extracting the mapping of the environment has, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.565,
    "end": 3103.207,
    "text": "Now you need to take into account that that kind of like environment is not only just like another agent out there that you need to interact with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3104.067,
    "end": 3107.888,
    "text": "And that agent can be, I don't know, another human being or a robot, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.388,
    "end": 3111.009,
    "text": "But actually you share common,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.73,
    "end": 3115.874,
    "text": " computational resources where that another agent, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3116.915,
    "end": 3122.042,
    "text": "And you need to actively negotiate those resources on the fly, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.542,
    "end": 3128.99,
    "text": "Even though there is kind of like asymmetry because obviously the pregnant person has way more power.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3131.97,
    "end": 3136.011,
    "text": " he can move around and act in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.691,
    "end": 3141.833,
    "text": "But that co-coordination happens from the very beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.113,
    "end": 3147.214,
    "text": "That makes me wonder, how is it related to niche construction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.394,
    "end": 3152.035,
    "text": "That's something that Axel Constant has, of course, worked a lot on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.295,
    "end": 3154.795,
    "text": "So how do we think about niche construction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.815,
    "end": 3156.736,
    "text": "Is there a niche, a shared niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.796,
    "end": 3157.976,
    "text": "Is one the niche of the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.325,
    "end": 3169.019,
    "text": " Yeah, so that's, I mean, this is like, as I said, this is an emerging field and I have something like a zillion questions, interesting questions to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.519,
    "end": 3171.703,
    "text": "And one of those is like related to the niche,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.373,
    "end": 3178.277,
    "text": " constructions, for instance, of this, like, homebody states of the pregnant person, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.817,
    "end": 3191.647,
    "text": "So there is, like, very nice work showing that, because also the mother is embedded in a wider, you know, social and physical environment, so we have cultural, right, constraints on that pregnant person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.328,
    "end": 3195.771,
    "text": "And there is work showing that, you know, for instance, like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.511,
    "end": 3204.778,
    "text": " you know, the maternal language, for instance, influences the way the infant will later on cry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.538,
    "end": 3217.988,
    "text": "And also if the niche, so to speak, for instance, is bilingual because, I don't know, the father speaks one language and the mother speaks another language and also impacts the way, for instance, the infant later on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3219.134,
    "end": 3239.66,
    "text": " eyes or you know coordinates right so it is but again this is emerging evidence we need way more work to actually carefully look at that exchanges between you know uh the embodied subject the comb body subject the pregnant subject and it's like close environment but what we know for sure is that clearly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.629,
    "end": 3249.031,
    "text": " I mean, the social background, the cultural background, and the physical background is really, really important, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3249.151,
    "end": 3250.911,
    "text": "It has a direct impact, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3251.371,
    "end": 3261.434,
    "text": "And actually, there are studies that show, I can't remember on the top of my head the name of the authors, but they show quite nicely that actually, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.434,
    "end": 3273.156,
    "text": " I don't know, French babies or German babies, they don't cry the same way because the language spoken by the mothers has different intonation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.457,
    "end": 3278.958,
    "text": "So the auditory input that you can have in the womb actually significantly impacts, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3279.398,
    "end": 3291.621,
    "text": "So this means that if you change the niche, the cultural niche, change the environment, you're also going to change the way the baby later on will somehow express, you know, this regulatory process like crying, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.681,
    "end": 3292.281,
    "text": "I'm not happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.407,
    "end": 3302.289,
    "text": " That makes me think about how even as adults, we're still bounded by externally constructed membranes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.409,
    "end": 3307.591,
    "text": "We rely on a broader society to bring us glucose and to take our waste.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.131,
    "end": 3321.176,
    "text": "And so there's a critical period, just like you had with the seed, absolutely a critical period where just like for any other complex system, it's gonna have bifurcations and a lot of leverage points early in its development when it's literally more fluid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.656,
    "end": 3324.057,
    "text": "But later on, these things are different in kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.037,
    "end": 3350.327,
    "text": " detail but not in type so extremely yeah and i think it's it's really important because we we we tend to we need to i mean i forgot to put that slide but i think it's important to bear in mind what we call the invisible basis of the ace iceberg right so certain things we really take for granted so if you go go again to the the plant metaphor right so um or the tree metaphor",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.38,
    "end": 3352.502,
    "text": " So think of a tree, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3352.843,
    "end": 3353.985,
    "text": "So you walk on a street.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3354.005,
    "end": 3355.468,
    "text": "So let's suppose you are a Martian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3356.881,
    "end": 3362.163,
    "text": " and you land on the earth and you see a tree and you don't understand how the tree works, what is a tree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3363.123,
    "end": 3382.65,
    "text": "So if you limit yourself only to what you see above the surface of the earth, like the trunk, the leaves, then you might miss some important bits of information of how exactly a tree works because the tree also has roots and basically the way it negotiates the nutrients through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3384.361,
    "end": 3400.264,
    "text": " that basic roots invisible ones actually you know significantly impacts how later on i don't know the trunk or leaves are constructed right so we really need to this is our motivation to take to endorse this like bottom-up developmental and ecological dynamical perspective because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3400.945,
    "end": 3405.126,
    "text": " we really need to go back to the roots, invisible one that we take for granted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.426,
    "end": 3417.97,
    "text": "Because as you said, rightly point out, maybe there is something going on at that critical stage that if you act upon that critical stage, then you avoid later on bigger problems that you can't modify.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.29,
    "end": 3424.733,
    "text": " So you need to, you know, act exactly at the time T for a very specific reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3425.193,
    "end": 3436.859,
    "text": "But also those roots are highly connected with, I don't know, the nutrients in the earth, in this case, like, I don't know, mother's body, which the mother body is kind of like connected again with the closest environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3436.979,
    "end": 3446.244,
    "text": "I mean, the way she is like supported or the cultural background, the type of support she gets from her close environment and later on, and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.742,
    "end": 3455.864,
    "text": " you know, I don't know, going higher up in this like policies that, you know, governments can have and, you know, climate change and other things, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.384,
    "end": 3462.326,
    "text": "So it's everything is somehow a very open and precarious system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.686,
    "end": 3467.927,
    "text": "And I think this is, I mean, the way I understand, and this is why I'm interested in this like entire,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.087,
    "end": 3474.99,
    "text": " you know, new active inference approaches, because, well, as the name shows, it's like, it's an active thing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.511,
    "end": 3478.792,
    "text": "It's like, it's constantly dynamically moving, then we need to make sense of it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.873,
    "end": 3486.697,
    "text": "In a very, you know, rigorous way, but still, you know, it's an open-ended process, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.54,
    "end": 3487.68,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.201,
    "end": 3490.824,
    "text": "And for the tree, visually, the roots are there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.344,
    "end": 3495.088,
    "text": "But with humans, our roots are often transient or they're cultural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.128,
    "end": 3506.981,
    "text": "So it also asks us to move beyond a visual representation of being tangled in a web and you can't move, but rather to see these dynamical processes that go through the developing embryo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.562,
    "end": 3509.143,
    "text": "So here's a question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.325,
    "end": 3517.592,
    "text": " Ana asks, saying that they just came to see your talk after hearing about it just a few minutes before it began.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.692,
    "end": 3522.598,
    "text": "So that's so fun that we can connect with people who are just hearing about these ideas maybe for the first time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.399,
    "end": 3528.904,
    "text": "And the question is, I would like to ask for background references to start studying this theme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.565,
    "end": 3540.442,
    "text": " so what would be some key references or some key questions or topics to look up for somebody who's kind of wanting to follow you on that freeway on that research trajectory that you're on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.555,
    "end": 3564.132,
    "text": " so um so there are several so it depends on the background right so uh uh there is there is very nice work on the phenomenology side so in philosophy right uh so uh there is a nice work by um alaimas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.279,
    "end": 3567.822,
    "text": " and also by Hanna De Jager.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.403,
    "end": 3573.569,
    "text": "And I think, I hope I'm not misspelling her name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.21,
    "end": 3577.474,
    "text": "But if you Google Hanna De Jager, she has a recently last year paper with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.198,
    "end": 3580.718,
    "text": " I'm sorry, I'm really bad with names.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3582.119,
    "end": 3584.64,
    "text": "So that's a very good reference, starting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.16,
    "end": 3586.78,
    "text": "I also wrote on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.62,
    "end": 3592.122,
    "text": "So if you Google my name, I started to work on this already in 2017.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.162,
    "end": 3598.083,
    "text": "I worked on basic form of self-awareness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.384,
    "end": 3602.425,
    "text": "And also there is nice work on...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3605.565,
    "end": 3621.984,
    "text": " um uh the the the touch and effective touch component right uh by uh maria laura filipetti and laura cucinelli they have a very nice review paper and especially issue that i edited it is called so the special issue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.422,
    "end": 3649.432,
    "text": " called the relational self basic forms of self-awareness and they have a paper there and actually there are quite nice papers there as well on this topic uh but more overall i wanted to say that you know i have um the the twitter handle public and there is um i also have my website and uh the email address so i'm very happy to take uh emails and you can basically forward",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3651.053,
    "end": 3659.636,
    "text": " a normal, you know, complete reference, because on the top of my head, I'm pretty sure I left aside important references.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.317,
    "end": 3666.359,
    "text": "And I don't want to, you know, say I, you know, I said this reference, I forgot those references, I want to, you know, keep diplomatically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3667.64,
    "end": 3670.621,
    "text": "So email me and I'm going to send you references.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.755,
    "end": 3682.363,
    "text": " What's interesting and it reminds me of the way that now the internet is allowing us to be in very tight feedback loops, more like a co-embodiment of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.003,
    "end": 3687.626,
    "text": "You're able to share your knowledge and your perspective on things and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.507,
    "end": 3701.258,
    "text": " somebody can ask a question and now we're in a very tight proximal communications-wise cycle where we can actually update each other on, oh, it was actually this 2017 citation she was talking about, not the other one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.698,
    "end": 3706.863,
    "text": "But if that was only a once in a while conversation, we couldn't actually develop at this rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.203,
    "end": 3712.628,
    "text": "So that's quite interesting, again, as adults who are co-constructing each other's ecological niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.211,
    "end": 3725.574,
    "text": " Okay, one thought I had, and if anyone can write more questions, is in most insects, so as an entomologist, I was thinking of insects, most insects lay eggs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3726.414,
    "end": 3732.736,
    "text": "And you had said that the placenta and the co-embodiment of pregnancy is universal, and maybe it's mammalian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.216,
    "end": 3734.117,
    "text": "In fact, it's defined as...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.954,
    "end": 3751.413,
    "text": " yes yeah universal to humans so the egg for the insect contains everything it needs to get to the relevant life stage like to hatch from the egg and then be whatever stage development it's in um except for the ants",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.054,
    "end": 3777.52,
    "text": " there's other um exceptions here but in the ants the larva is um after the egg it hatches into a larva very quickly and then the larva is actually in a two-directional relationship and the larva are called the social gut and they have a one-ended gut and so they're being fed food and actually digesting it and in a two-directional hormonal relationship and so it was so interesting that it's almost like the length of the dialogue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.28,
    "end": 3781.782,
    "text": " the length of the intergenerational transfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.282,
    "end": 3783.262,
    "text": "Is it one day?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.302,
    "end": 3784.003,
    "text": "Is it one year?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.083,
    "end": 3785.063,
    "text": "Is it 18 years?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.583,
    "end": 3786.344,
    "text": "Is it permanent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.624,
    "end": 3788.405,
    "text": "Are we always co-creating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.945,
    "end": 3794.628,
    "text": "The length of that handoff and the richness of the handoff seems to have something to do with the evolution of complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.728,
    "end": 3795.968,
    "text": "So I was wondering what you thought about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.129,
    "end": 3798.389,
    "text": "Yeah, so this is amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.429,
    "end": 3801.511,
    "text": "I mean, when you look at nature, it's like mind blowing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.639,
    "end": 3808.461,
    "text": " I mean, I was about to say it's like we, I mean, I'm talking from a philosophy perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3808.581,
    "end": 3818.985,
    "text": "I can safely say that, you know, philosophy has been kind of like adult-centric and, you know, human-centric, anthropocentric, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3819.885,
    "end": 3829.149,
    "text": "But if you want to really understand this, like how, you know, mind and body works and you look at the nature more general, then you realize, wow, this is really fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3829.269,
    "end": 3829.609,
    "text": "And so,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3830.576,
    "end": 3848.368,
    "text": " um you know we can learn so much so you you you are telling me about the ants but i i recently read something because i started to be fascinated by this idea of like placenta right and i've read that for instance some lizards right so you have exactly the same special of lizard right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.764,
    "end": 3854.286,
    "text": " And some of them lay eggs, and some of them actually have babies, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3854.646,
    "end": 3855.607,
    "text": "Exactly the same lizard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3855.947,
    "end": 3868.172,
    "text": "And you ask yourself why, and then you realize that actually it depends on the climate where they are, if they are a warm climate or a cold climate, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3868.793,
    "end": 3873.415,
    "text": "So if they are in a warm climate, they lay eggs because the sun is kind of like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3874.431,
    "end": 3879.373,
    "text": " But if you are in a cold climate, then you're going to keep the egg inside, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3880.313,
    "end": 3883.414,
    "text": "And make the baby, protect the baby inside, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3883.494,
    "end": 3887.495,
    "text": "And then only after that baby, kind of, they safely put it into the world, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3887.976,
    "end": 3898.639,
    "text": "So that's a very nice example of, as you said, it's like the flexibility and adaptability that we can have to actually know the make-life happens and carry on, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.66,
    "end": 3902.501,
    "text": "Because in this case, you basically have exactly the same body,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3905.161,
    "end": 3913.143,
    "text": " But the way you carry on life is depending on exactly that in-between interaction that you have with the environment, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3913.463,
    "end": 3917.344,
    "text": "In a cold environment, in one case, in a warm environment, in another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.684,
    "end": 3925.845,
    "text": "And that impacts the way you basically call, the way you self-organize and reproduce.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3927.205,
    "end": 3928.286,
    "text": "It is really fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3928.366,
    "end": 3930.126,
    "text": "I really hope that basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3931.172,
    "end": 3951.193,
    "text": " You know, animal scientists and human brain scientists would work hand in hand because I'm pretty sure we'll somehow unlock many of the so-called mystery of the human mind and human body just by looking carefully what is going on to our friends and neighbors, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3951.934,
    "end": 3952.595,
    "text": "Animals, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3953.809,
    "end": 3954.89,
    "text": " It's an excellent point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.99,
    "end": 3961.894,
    "text": "And in animal cognition, especially, it's phrased as like the development of the cognitive capacity as if that was the end point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.934,
    "end": 3967.377,
    "text": "You go from zero to 60 and then you're at 60 and then you cognitive decline, tap on the brakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.677,
    "end": 3982.526,
    "text": "But there's a richness and it's different cognitive agents, which actually brought me to this question, which was, I was definitely with you that the adult centric perspective that you raised in your first anecdote at the conference and it's, oh, it's all adults in the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.166,
    "end": 3988.812,
    "text": " So let's go with this, that it would be fallacious to have a adults only perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.352,
    "end": 3996.779,
    "text": "And maybe it might be also somewhat of an error to have like a child only philosophy, just whatever the children appeals to them, let's just go with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.46,
    "end": 4002.525,
    "text": "So how do we structure in the intergenerational conversation and learn from each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4005.424,
    "end": 4008.249,
    "text": " Yeah, so that's a big question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.491,
    "end": 4017.223,
    "text": "So I think what we really wanted to do with this paper was something very, very modest, namely to draw attention on the fact",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.124,
    "end": 4020.385,
    "text": " hey guys, pay attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.545,
    "end": 4023.166,
    "text": "We have this lens, yeah?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4023.786,
    "end": 4025.047,
    "text": "It's kind of like tacit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.127,
    "end": 4026.928,
    "text": "Let's clean it a bit and expand it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4027.468,
    "end": 4036.053,
    "text": "So I'm happy to basically expand it and take that kind of like bottom-up perspective, but obviously I don't want to bring everything to the root, so to speak, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.073,
    "end": 4045.437,
    "text": "It would be like exactly the same fallacy to like focus just like on the fruits, like the apple in the tree, and to focus just on the roots, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4046.298,
    "end": 4047.999,
    "text": "I think what we really need is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.38,
    "end": 4053.002,
    "text": " an explanation of that dynamic process, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.202,
    "end": 4064.529,
    "text": "How that unfolds, how that emerge, how it's connected with the wider environment and with other minds, other bodies, other animals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4064.869,
    "end": 4072.094,
    "text": "I don't know if it's true, I need to check, but at a certain point, somebody told me, I think I saw it on Twitter, that actually, if you take a human body,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4072.774,
    "end": 4084.138,
    "text": " And you take the cells in the human body numerically, actually have more foreign cells than actually human cells in your body, numerically, because all you have those my microbiota and you think, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4084.618,
    "end": 4094.801,
    "text": "So if you take just like the quantitatively, then we basically are more in another than actually in the self, which is like, I need to check that information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.841,
    "end": 4095.281,
    "text": "That's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.301,
    "end": 4096.602,
    "text": "That's actually quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.622,
    "end": 4097.082,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.89,
    "end": 4104.975,
    "text": " One thought on that number of cells is actually the co-embodiment framework moves us beyond a numbers game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.615,
    "end": 4113.4,
    "text": "For example, there could be a very big system and a small system like the earth and the moon, and yet the moon is relevant for this or that process on earth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4113.961,
    "end": 4116.422,
    "text": "And that's because they don't have to be symmetrical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.782,
    "end": 4118.103,
    "text": "If it was a tug of war, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4119.404,
    "end": 4144.133,
    "text": " it enforces a symmetry, which enforces a narrowness, but actually it doesn't really, what if it was really influential cells or less influential cells that can be accommodated in an active inference or in a dialogue based framework, but less so in a sort of, there's only one way to collaborate like tit for tat or game theory, which is where a lot of the models of pregnancy just are still scratching their head, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.774,
    "end": 4148.897,
    "text": " Here's a little of a meta-science question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.257,
    "end": 4150.918,
    "text": "If anyone else has any, they can post too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.379,
    "end": 4160.387,
    "text": "It was really cool how you demarcated your thoughts on being a philosopher and working with a formal theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.967,
    "end": 4161.387,
    "text": "So what...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.56,
    "end": 4174.847,
    "text": " are your thoughts on working with formalisms as a philosopher or working on these transdisciplinary teams where there might be colleagues with clinical, psychological, math, and a philosophy background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.247,
    "end": 4178.729,
    "text": "So how do we work together on these teams and address these topics that are really big?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.39,
    "end": 4183.012,
    "text": " Yeah, that's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.412,
    "end": 4191.078,
    "text": "And sometimes it's like Twitter is quite good for that because it's like in just one tweet you get this conflict in a nutshell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4191.698,
    "end": 4201.665,
    "text": "So I remember somebody tweeted at some point, you know, when there's all this computational approach is kind of like emerging and regarding like the clinical population, they were saying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4203.007,
    "end": 4213.139,
    "text": " bad news for clinicians, they will have to learn mathematics and statistics to build computational models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.159,
    "end": 4222.109,
    "text": "To which somebody replied, he said, bad news for mathematicians and statisticians, they will have to go to hospitals and talk to the patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4224.211,
    "end": 4232.34,
    "text": " I like that kind of exchange because this is the problem that we have in the sense that we really need a dialogue between the world out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4232.36,
    "end": 4239.327,
    "text": "We need to go there, talk to the patient, gather the data, observe the insects, observe the human, spend countless",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4243.29,
    "end": 4247.592,
    "text": " hours is like measuring how many eggs, you know, are they laying and everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.393,
    "end": 4256.137,
    "text": "And in the same time, you also need something more rigorous that will allow you to basically, you know, build models that, you know, instead of like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.132,
    "end": 4269.458,
    "text": " as if you test hypotheses instead of testing them in real life, you let mathematics to actually take the risk of that hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4269.918,
    "end": 4271.86,
    "text": "And if it's wrong, that's fine because it's not going to die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4272.26,
    "end": 4273.961,
    "text": "It's just a wrong hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.401,
    "end": 4281.506,
    "text": " But in real life, if you test hypothesis and you're wrong, then actually you may die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.267,
    "end": 4287.831,
    "text": "So I think that should be a very nice dialogue between the two approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4287.851,
    "end": 4292.234,
    "text": "It should be seen like digging the same tunnel, but from the two opposites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.935,
    "end": 4308.665,
    "text": " Sites and hopefully meeting in in the middle Personally, I like so I'm I like to even though I have a philosophy background I like to consider myself as an interdisciplinary researchers so I have collaborators from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.725,
    "end": 4310.445,
    "text": " all fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4311.386,
    "end": 4318.128,
    "text": "I collaborate with clinicians, I'm doing experimental science, so I'm running studies, I'm collecting data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4318.588,
    "end": 4327.891,
    "text": "I also collaborate with people on the more formal side, so we're building kind of like, you know, simulation and formal approaches to certain phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4329.131,
    "end": 4344.078,
    "text": " especially connected with my main interest, which is self-awareness, a minimal self-worth, alteration of minimal self-worth, the relation between the self and the body and co-embodiment and so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4344.538,
    "end": 4346.178,
    "text": "But yeah, I do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4346.699,
    "end": 4348.039,
    "text": "And this is why I said to the last...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.02,
    "end": 4374.421,
    "text": " in the last part of my talk, in the last slide, that I'm very open to collaboration, especially on that side, because I really think we've reached the point where we basically need to have a dialogue, because it's like we have so much information and we realise that the life out there, the mind and the body and everything is so rich that we cannot...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.362,
    "end": 4379.368,
    "text": " We cannot solve it with just one single discipline or one single tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.388,
    "end": 4383.074,
    "text": "We really need to join forces and dialogue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.594,
    "end": 4389.002,
    "text": "It's going to be a bit more messier, a bit more trickier, because we don't have the same conceptual toolbox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.042,
    "end": 4390.665,
    "text": "So we have to do a lot of work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4392.182,
    "end": 4398.149,
    "text": " before we clarify what exactly we mean by that, right, in different fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.529,
    "end": 4408.86,
    "text": "And I think this is where philosophy can be useful because we're kind of like obsessed with this idea, what do you mean by, you know, give me a definition to make sure that actually we're not all over the map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4410.402,
    "end": 4413.083,
    "text": " talking about the same phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.163,
    "end": 4428.266,
    "text": "But also I think it would be dangerous for philosophy to somehow develop this conceptual toolbox completely cut off from whatever the things out there, the empirical world or the mathematical models actually showed us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.306,
    "end": 4434.148,
    "text": "So we need to keep those gates open and exchange and dialogue and collaborate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4436.613,
    "end": 4438.954,
    "text": " Wow, thanks for that awesome response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.394,
    "end": 4444.835,
    "text": "To call back to your beginning slides, you had the armchair philosopher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.395,
    "end": 4451.517,
    "text": "And that's a term that people know, just like in America, we say Monday morning quarterback, just like looking back at the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4452.037,
    "end": 4454.678,
    "text": "And the armchair philosopher is not so different, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.298,
    "end": 4457.819,
    "text": "And that made me think of, I think therefore I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.419,
    "end": 4469.827,
    "text": " and the idea that by actually getting into some sort of altered state of inference, by meditating or by doing some other thought ritual, it would be possible to reach insight through thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4470.668,
    "end": 4477.352,
    "text": "And the way that you just framed the answer was like hypothesis testing is an action that we take in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.833,
    "end": 4479.014,
    "text": "It's not just a thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.614,
    "end": 4499.145,
    "text": " And when we frame hypothesis testing as action about the systems that we care about, like the next generations, then it makes us think about working on teams and on accountability and on reproducible science, all these things that are sort of like on the side of the armchair philosopher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4499.285,
    "end": 4504.888,
    "text": "And the armchair philosopher might also care about participation in science, but that would be a secondary conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4505.348,
    "end": 4507.59,
    "text": "Whereas if hypothesis testing involves stakeholders,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.678,
    "end": 4513.423,
    "text": " and it's also something that's happening in the loop, it's a different situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.523,
    "end": 4518.929,
    "text": "So it's just really interesting, I hope, for those who are listening to hear what you're saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.07,
    "end": 4529.12,
    "text": "Actually, I like to keep reminding my students that, you know, I put a picture of Descartes because I'm French and his French is like Descartes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4529.58,
    "end": 4532.142,
    "text": " Anyway, but it could have been Aristotle, but I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.463,
    "end": 4539.629,
    "text": "It's like those kind of like classic philosophers need to keep in mind that these people are, I mean, Aristotle was like a biologist, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4539.669,
    "end": 4542.911,
    "text": "He was like constantly dissecting things and, you know, testing things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4542.991,
    "end": 4546.134,
    "text": "It's like looking at what was going on with the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.154,
    "end": 4548.216,
    "text": "So Aristotle, and he's considered to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.255,
    "end": 4550.275,
    "text": " a great philosopher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4550.675,
    "end": 4556.036,
    "text": "And similarly with Descartes, I mean, he was like a mathematician, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.977,
    "end": 4559.357,
    "text": "And he wrote a treaty on optics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.417,
    "end": 4561.698,
    "text": "So it's like vision and everything else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4562.458,
    "end": 4566.959,
    "text": "So science and philosophy are kind of like working hand in hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4567.019,
    "end": 4571.74,
    "text": "And I still think they're actually working de facto.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.76,
    "end": 4576.981,
    "text": "I really think that actually scientists are doing without realizing, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4577.885,
    "end": 4601.281,
    "text": " uh philosophy and uh some wood philosophers actually they keep in an eye or whatever it's like scientists are discovering whatever nature is telling us right um because it's like this is a constant information processing right we will never get to the bottom rock of the reality right things are changing right uh it's like and i think what is really fascinating with this um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4602.122,
    "end": 4604.464,
    "text": " Here's an example of the virus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4604.764,
    "end": 4609.788,
    "text": "Let's take the virus, because this is very recent and very relevant and very timely right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4610.369,
    "end": 4615.873,
    "text": "So if you are a classical chair philosopher, then you have a huge ontological puzzle with this virus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4616.233,
    "end": 4625.201,
    "text": "Because this virus keeps constantly mutating in function of whoever is hosting him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.222,
    "end": 4631.246,
    "text": "Or whoever the host of that virus is creates a different type of mutation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4633.09,
    "end": 4641.755,
    "text": " And this is like, it's an ontological puzzle for philosophy is like, what is the virus, which is like coronavirus?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.875,
    "end": 4642.435,
    "text": "Which one is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.456,
    "end": 4647.518,
    "text": "It's like, and you feel like saying was actually none of them and all of them, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4647.578,
    "end": 4654.342,
    "text": "Because it's somehow all that kind of like shared a type of information that is changing in function of whichever body",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.157,
    "end": 4665.167,
    "text": " of number of bodies, and that depends on, I don't know, the culture and the food they're ingesting or, I don't know, different genetical components and so many other factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4665.647,
    "end": 4676.258,
    "text": "And I can literally say that, we can literally see that actually this is like, we literally have new beings coming, you know, new, new,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4677.313,
    "end": 4692.399,
    "text": " entities arising, like mutant forms of life, constantly arising so quickly that we can't even, you know, wait a minute, let me figure out what is going on, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4693.46,
    "end": 4697.401,
    "text": "So I think we have a very nice and humble example of how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.753,
    "end": 4710.678,
    "text": " reality out there constantly is coming to us with constant flow of emerging information, emerging creatures, living beings, self-organizing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4710.758,
    "end": 4715.62,
    "text": "And sometimes it's like, well, we can't see them, but actually they're kind of dangerous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.22,
    "end": 4721.062,
    "text": "They can kill us with all our science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.482,
    "end": 4726.204,
    "text": "And I think that's a very important point we need to bear in mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.455,
    "end": 4728.296,
    "text": " Yeah, thanks for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4728.736,
    "end": 4733.861,
    "text": "It made me think that it's not just emerging entities, it's actually emerging interfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.581,
    "end": 4740.207,
    "text": "And even if the number of entities were set, the interfaces would still be combinatorial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.387,
    "end": 4742.629,
    "text": "It would be explosions, just like words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.049,
    "end": 4746.312,
    "text": "Even if the word vocabulary is set, you still have interfaces that can emerge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4746.832,
    "end": 4752.217,
    "text": "And then, as we say also here in the States, putting Descartes before the horse",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4753.158,
    "end": 4767.314,
    "text": " absolutely an error but then it's actually kind of something that tells two layers of truth because it's philosophy and science that are working together and how we think about things and how we operate things and what do we hear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4768.035,
    "end": 4781.587,
    "text": " right now, other than that there's a disconnection between technology and society, information flow, governance, decision making, all these things, you just, you know, spin around and pick a number, and it will be related to something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4782.107,
    "end": 4787.212,
    "text": "And so that suggests that there is a requirement for a new kind of a conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.854,
    "end": 4790.875,
    "text": "Yes, I fully agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4792.861,
    "end": 4794.062,
    "text": " Do you have any other thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.162,
    "end": 4799.565,
    "text": "Otherwise, this was really an awesome guest stream and we'll look forward to hearing from you in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.745,
    "end": 4801.046,
    "text": "But you're always welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4801.907,
    "end": 4804.128,
    "text": "You can come on, whether you're the author or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.029,
    "end": 4815.716,
    "text": "Yeah, let's hope that, you know, this will kind of, like, develop more systematically and when the situation allows to basically, you know...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.553,
    "end": 4845.942,
    "text": " organize a platform or perhaps a workshop in person meeting such as we can actually you know put this idea to work because I think that this kind of like proximal face-to-face interactions have a different can have a different type of outcome that you know the ones we can have right now so we can basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.073,
    "end": 4856.557,
    "text": " you know, consolidate the collaboration and dialogue on a more, you know, concrete and pragmatic basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4857.357,
    "end": 4871.323,
    "text": "What I really, I realized that during the pandemic, which was really, really fabulous is that, well, as what's happening right now, it never occurred to me that basically, well, wait a minute, we can have like a Zoom conversation with somebody from California talking about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4871.683,
    "end": 4875.265,
    "text": "So it was kind of like, you know, crisis,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4877.06,
    "end": 4884.087,
    "text": " you know, brought up the surface new way of connecting and make us reach up in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.148,
    "end": 4891.593,
    "text": "But I also think it's important to have that, you know, range of effectiveness in place in the first place to keep the balance right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4893.735,
    "end": 4899.541,
    "text": "Because we have evolved going back to the human nature and human organism, we have evolved to basically move and interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4900.325,
    "end": 4902.727,
    "text": " If we don't move, we don't interact, we simply die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4903.807,
    "end": 4907.069,
    "text": "And we need to keep moving and interacting with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4907.31,
    "end": 4912.473,
    "text": "And I think that's also valid for different disciplines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4912.833,
    "end": 4918.557,
    "text": "That's what we basically need to adapt and interact with each other as disciplines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4921.042,
    "end": 4937.089,
    "text": " As Act-Inf Lab, an online participatory lab, we will co-embody that event in person when your region is available and when the personnel are there, then we'll scaffold it in a new way because previously it was all in person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4937.129,
    "end": 4943.552,
    "text": "There was never seen a need to live stream or never seen a need to document, to translate, to make it accessible, to make it available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.092,
    "end": 4946.413,
    "text": "And we'll be able to organize in a new way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.233,
    "end": 4965.594,
    "text": " and be able to help each other in ways that we wouldn't have expected before so i look forward to it yeah me too great times see you again bye bye nice awesome stream thanks anna",
    "speaker": "SPEAKER_00"
  }
]