[
  {
    "start": 8.452,
    "end": 9.533,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.494,
    "end": 12.637,
    "text": "It is July 17th, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.697,
    "end": 17.983,
    "text": "We're in Active Inference Guest Stream 83.1 with Josh Bongard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 18.644,
    "end": 19.745,
    "text": "Thank you for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.965,
    "end": 21.467,
    "text": "This should be very exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.627,
    "end": 24.831,
    "text": "We'll have a presentation and then some discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.971,
    "end": 28.695,
    "text": "So if you're in the live chat, please feel free to write any questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 29.155,
    "end": 30.337,
    "text": "And thank you again, Josh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.417,
    "end": 31.438,
    "text": "Looking forward to this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.87,
    "end": 33.671,
    "text": " Yeah, thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.731,
    "end": 35.894,
    "text": "And thanks to those of you that are attending online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.976,
    "end": 38.158,
    "text": "So my name is Josh Bongard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.198,
    "end": 42.023,
    "text": "I'm a professor of computer science here at the University of Vermont.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.644,
    "end": 47.191,
    "text": "And my bread and butter in my lab is the study of robotics and AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.491,
    "end": 51.938,
    "text": "And obviously, we're in the middle of the current AI summer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.36,
    "end": 60.21,
    "text": "So what I wanted to do today is show a couple of highlights from my group, things that I've worked on in the past and that we're working on at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.663,
    "end": 72.201,
    "text": " that I hope in the long term will help us realize sort of the long-term vision for a lot of those trying to create intelligent machines, which is to create machines that are helpful but also safe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.463,
    "end": 84.821,
    "text": "We're part of the way there, but as anyone who's worked with chat GPT or stable diffusion knows or even has a robot vacuum cleaner at home, there are some limitations to our current technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.841,
    "end": 88.206,
    "text": "It's hard to create machines that are autonomous,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.743,
    "end": 91.769,
    "text": " and useful and safe all simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.87,
    "end": 94.034,
    "text": "So what are the things that we're missing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.776,
    "end": 101.991,
    "text": "That's what I wanted to sort of seed the pool with today and hopefully we can move on to an interactive discussion about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.492,
    "end": 109.907,
    "text": "So I'm gonna leave this slide up and just sort of talk over the slide for a few minutes that'll hopefully generate some food for thought and then questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.765,
    "end": 115.718,
    "text": " This is a snapshot from some of the projects I've worked on over the years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.66,
    "end": 122.496,
    "text": "First thing you'll probably notice is there's a lot of different robots that have very different structural properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.576,
    "end": 126.546,
    "text": "They not only act differently, but look very different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.526,
    "end": 137.062,
    "text": " And that is a fundamental foundation in everything we do in my research group, which is to try and understand how the body facilitates cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.903,
    "end": 144.433,
    "text": "Years ago with my PhD advisor, we wrote a popular science book called How the Body Shapes the Way We Think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.413,
    "end": 147.379,
    "text": " And we can mean that literally or figuratively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.399,
    "end": 149.583,
    "text": "We wrote that book a while ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.623,
    "end": 152.91,
    "text": "We made some arguments about how the body shapes the way we think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.97,
    "end": 160.986,
    "text": "And since that time, my group and others have formulated other arguments for why or how the body shapes the way we think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.046,
    "end": 165.375,
    "text": "And I'm hoping to survey some of those today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.946,
    "end": 169.63,
    "text": " As I mentioned, you can see a lot of different robots here, very different structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.651,
    "end": 187.913,
    "text": "They've got very different form and function, but across each of the pair of videos that you see here, you'll notice that there's also a common pattern, which is on the left side, you tend to see something that's virtual, and on the right side of the video pair, you tend to see something that's physical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.453,
    "end": 195.582,
    "text": "And this illustrates the basic approach that my group takes to understanding how the body shapes the way we think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.085,
    "end": 203.0,
    "text": " which is to create AI that creates robots, creates embodied AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.24,
    "end": 204.342,
    "text": "So what do I mean by that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.164,
    "end": 214.043,
    "text": "What I mean is that in all of the projects that you see here, we create an AI that searches the space of all possible robots,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.613,
    "end": 217.957,
    "text": " that could solve the tasks that we want the robots to solve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.778,
    "end": 233.976,
    "text": "Most people that are familiar with AI and robotics and autonomous cars and drones have a rough understanding that AI is somehow optimizing or tuning the brain of the autonomous car or the drone or the robot, what have you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.897,
    "end": 243.827,
    "text": "There's an underlying assumption in all of that current, in most current robotics, which is that the AI tunes the brain, but does not tune the body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.685,
    "end": 251.273,
    "text": " Tesla cars are dreamed up mostly by humans and an AI tunes their brain or their control policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.894,
    "end": 253.736,
    "text": "But of course nature doesn't work that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.797,
    "end": 262.207,
    "text": "Nature produced us and all the other intelligent organisms on this planet by carefully tuning body and brain simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.848,
    "end": 269.957,
    "text": "Certain bodies facilitate certain kinds of behaviors and certain kinds of intelligent behavior and other bodies don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.037,
    "end": 273.882,
    "text": "They obstruct that particular behavior or that intelligent behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.655,
    "end": 282.644,
    "text": " So in all of our work, we ask the AI not just to tune the brain of a robot, but its body simultaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.684,
    "end": 291.214,
    "text": "And as you can see visually here, the AI often comes up with bodies that are well suited to whatever we want them to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.955,
    "end": 303.008,
    "text": "So if you direct your attention to the very top left of the screen for a moment, this is now a 22 year old experiment, but I think it still visualizes the potential of this approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.983,
    "end": 315.018,
    "text": " In this case, we were interested in creating a robot that can brachiate, that can swing across beams or tree branches or electrical wires for various inspection tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.738,
    "end": 321.726,
    "text": "And you'll notice that in this case, the AI came up with a solution that in retrospect seems intuitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.788,
    "end": 332.1,
    "text": "The robot has to carry a very heavy battery, which you can see in the physical robot in the top left there, the black box that's at the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.08,
    "end": 348.439,
    "text": " And the AI has figured out how to design the body of this robot so that it's actually able to exploit the forward momentum of this heavy object, this battery, to facilitate its movement or brachiation across this physical beam.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.939,
    "end": 359.792,
    "text": "So it's a simple example, a simple robot, a simple task, but it demonstrates this interplay between AI, robotics, body, and brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.852,
    "end": 379.511,
    "text": " If the AI was not free to place the battery at a particular place on the robot's body, it would be much harder, it would require more energy, it would require a more complex brain for the robot to figure out how to move its heavy weight across this beam.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.191,
    "end": 385.797,
    "text": "So that idea of tuning body and brain has suffused everything that we work on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.777,
    "end": 390.428,
    "text": " Some other examples you can see in the top center and the top right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.13,
    "end": 394.538,
    "text": "Here we have a robot that suffers damage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.618,
    "end": 396.503,
    "text": "Its body changes over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.643,
    "end": 400.292,
    "text": "So now the AI has to grapple with not just designing a body,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.441,
    "end": 402.404,
    "text": " but grappling with a body that changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.225,
    "end": 413.642,
    "text": "One of the things that we as intelligent organisms here in the world and all embodied AI, all autonomous cars, all drones, all robots have to deal with is entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.682,
    "end": 416.166,
    "text": "The world throws a lot of stuff at us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.186,
    "end": 418.99,
    "text": "We have to deal with wear and tear, injury,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.223,
    "end": 423.91,
    "text": " In our case, we grow from a single cell into about 10 to the 12 cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.41,
    "end": 427.615,
    "text": "We change massively in terms of our physical magnitude.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.675,
    "end": 437.509,
    "text": "How do you continue to operate, keep yourself alive and do whatever it is you need to do across massive morphological change?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.95,
    "end": 439.712,
    "text": "That is not an easy thing to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.772,
    "end": 442.496,
    "text": "And again, it requires an AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.516,
    "end": 447.964,
    "text": "If it's going to do this with robots, it's got to figure out how to carefully tune body and brain to deal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.805,
    "end": 459.077,
    "text": " with the generation of behavior inside a body that is changing either unexpectedly due to injury and wear and tear or intentionally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.659,
    "end": 471.212,
    "text": "You can see in the very center panel, this is again a pretty good visualization of where designing body along with brain comes in handy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.053,
    "end": 475.217,
    "text": "If we want to make flying machines or swimming machines,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.315,
    "end": 483.109,
    "text": " We have to very, very carefully tune the geometry and material properties of the body itself to realize flight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.131,
    "end": 496.935,
    "text": "So what you're seeing in this middle panel here, this is partway through the AI experimenting with the design of different kinds of wings for an ornithopter, a drone that flies by flapping its wings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.08,
    "end": 509.878,
    "text": " This flexible wing that you see here in the center of the screen, this is a bit of a transition from traditional robots that are made of rigid structures, like you can see in the top row,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.533,
    "end": 516.125,
    "text": " into a more modern era in robotics, which is sometimes referred to as soft robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.747,
    "end": 520.074,
    "text": "Material science has come a long way in the last 20 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.515,
    "end": 524.404,
    "text": "So we can now start to build robots, embodied AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.444,
    "end": 530.517,
    "text": "We can start to build robots out of materials other than rigid plastic and metals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.767,
    "end": 547.577,
    "text": " And we can, again, we can start to move into an era in which robots, like organisms, can exploit the material properties of their bodies to facilitate whatever behaviors they need to do to survive or be useful to humans and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.452,
    "end": 557.623,
    "text": " So in the middle right panel, this is a highlight of some work that my group has done in collaboration with Rebecca Kramer Bottiglio's lab at Yale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.083,
    "end": 564.211,
    "text": "Rebecca's lab is famously advancing the state of the art in soft robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.271,
    "end": 568.376,
    "text": "What can you get robots to do when they're made out of soft materials?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.396,
    "end": 575.404,
    "text": "You can see an example of some of those soft robots, middle right, and a very different soft robot lower left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.384,
    "end": 590.845,
    "text": " which is exploiting its body properties in order to move in interesting ways one of the interesting things about soft robotics in my perspective is that it starts to usher in an era in which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.027,
    "end": 594.973,
    "text": " robots can actually grow and complexify their bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.073,
    "end": 611.599,
    "text": "You can see these hollow cubes in the middle right and these hollow sort of chambers in the bottom left expanding and contracting as we push and pull air into and then out of the body of the robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.741,
    "end": 617.608,
    "text": "Suddenly, now you have robots that can change their geometry, they can change their volume,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.55,
    "end": 621.636,
    "text": " they become what's known as thermodynamically open.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.896,
    "end": 628.769,
    "text": "It's a fancy term for meaning that they can draw new material and new energy into themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.252,
    "end": 635.682,
    "text": "The thermodynamically open machines that you see middle right and lower left, the only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.1,
    "end": 665.398,
    "text": " thing they're drawing into their body is more air but it's a start i mentioned already that humans grow from a single cell into 10 to the 12 cells every organism on this planet with a few exceptions starts small and gets bigger over its lifetime that fundamental morphological change start small start simple and gradually grow in size and complexity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.391,
    "end": 668.434,
    "text": " that provides scaffolding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.674,
    "end": 676.005,
    "text": "It provides a gradient on which to learn how to gradually grapple with the world around you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.807,
    "end": 685.4,
    "text": "Most organisms, again, there are exceptions, are not thrust into this world with all of their machinery online from the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.481,
    "end": 695.655,
    "text": "Just the way I'm phrasing this is obviously intentional to sort of dichotomize growing organisms and robots with fixed bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 696.935,
    "end": 699.308,
    "text": " autonomous cars are still very dangerous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.589,
    "end": 703.57,
    "text": "Autonomous drones are still very dangerous to be around because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.837,
    "end": 717.977,
    "text": " 99.99% of the time they do the right thing, but every once in a while they don't know what to do and no one knows what they're going to do in those uncertain circumstances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.778,
    "end": 731.295,
    "text": "That is a very concerning situation as we start to now deploy robots and autonomous vehicles into everyday environments where they are in close proximity to humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.22,
    "end": 746.538,
    "text": " Why is it that even with state of the art AI and with all of Google's data centers and AI training algorithms, we still can't rub out that 0.001% where no one knows what's going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.779,
    "end": 752.225,
    "text": "Part of the reason, again, is these machines are born with complex bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.525,
    "end": 754.988,
    "text": "We drop a controller into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.356,
    "end": 760.282,
    "text": " a one-ton autonomous car made of metal and plastics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.302,
    "end": 761.343,
    "text": "It's very dangerous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.864,
    "end": 771.335,
    "text": "We don't grow autonomous cars from a very small, simple, lightweight machine that can't cause anyone any harm whatsoever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.395,
    "end": 781.768,
    "text": "And then when that simple, small machine demonstrates and verifies to us that it's safe, then we allow it to become larger and more complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.748,
    "end": 783.471,
    "text": " It sounds like silly sci-fi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.511,
    "end": 785.134,
    "text": "Why would we build a machine like that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.554,
    "end": 790.743,
    "text": "But again, every organism starts simple and grows in complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.084,
    "end": 800.179,
    "text": "And if it doesn't do the right thing, if it performs dangerous actions that are harmful to itself or fatal to itself, by definition, it doesn't get any further.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 801.593,
    "end": 806.22,
    "text": " That's again, one of the ways of thinking about how the body shapes the way we think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.541,
    "end": 818.159,
    "text": "In my personal and professional opinion, any physical machines that we deploy into the real world, they should start as very small, lightweight machines that can't harm anyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.179,
    "end": 826.211,
    "text": "They have a very limited number of actions that they can perform and they sort of cycle through all those actions and verify everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.592,
    "end": 828.715,
    "text": "And only then can they take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 828.965,
    "end": 832.009,
    "text": " more mass, more energy into themselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.109,
    "end": 833.991,
    "text": "Can they recruit more material?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.612,
    "end": 840.66,
    "text": "They can sort of be allowed to be thermodynamically open and grow and complexify themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.581,
    "end": 846.828,
    "text": "There's lots of ways in which we're starting to create machines that grow and complexify themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.888,
    "end": 853.096,
    "text": "I just talked about these soft robots that can pull in air or possibly fluids.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.196,
    "end": 856.12,
    "text": "They could be hydrodynamic machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.1,
    "end": 862.57,
    "text": " They could mechanically or magnetically connect to other robots that sort of swarm robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.61,
    "end": 865.654,
    "text": "That's another path to growing machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.056,
    "end": 871.243,
    "text": "At the moment, most of these machines are still restricted to academic labs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.303,
    "end": 884.723,
    "text": "They also are not safe yet, but I think in the long run, they're going to be a safer alternative to dropping AI into very large, complex, heavy, dangerous machines and crossing our fingers and hoping for the best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.53,
    "end": 890.036,
    "text": " Okay, so I've talked a little bit about rigid robots and soft robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.877,
    "end": 908.378,
    "text": "I wanna try and talk as little as possible, so there's some time for a good discussion, but I wanna talk about what I see as sort of a third era of robotics and embodied AI, which is just starting to open up in the last few years, which is biobotics or creating biobots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.398,
    "end": 914.085,
    "text": "And you can see two biobots on display at the bottom center of my slide here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.065,
    "end": 923.514,
    "text": " A biobot is a robot that's made up of only biological components, no technological components whatsoever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.255,
    "end": 933.083,
    "text": "So in the bottom left here, Kriegman, Blackist and Levin and myself in 2020 published a paper demonstrating the first biobot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.904,
    "end": 942.992,
    "text": "This became known after publication in the popular media as xenobots, X-E-N-O, xeno, xenobots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.972,
    "end": 953.804,
    "text": " because these xenobots are built from about 2,000 frog cells, and the cells were taken from a particular species of frog, which is Xenopus laevis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.105,
    "end": 968.98,
    "text": "Michael Levin, our biology colleague at Tufts University, is world renowned for demonstrating that you can reconfigure genetically unmodified materials, like, for example, frog cells,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.175,
    "end": 987.576,
    "text": " And that rearrangement of living tissues not only does not kill the organism, the organism is able to, in some cases, continue on doing what it does, what it needs to do, ingest materials, survive, reproduce in this reconfigured state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.497,
    "end": 991.12,
    "text": "There's a lot of biological implications for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.601,
    "end": 996.587,
    "text": "One of the biological implications is that frog DNA does not code for frog.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.208,
    "end": 1010.627,
    "text": " What you're looking at in the bottom left, the xenobot, is about a millimeter in diameter, so it looks like a speck of pepper to the unmagnified eye, and yet it's able to walk around the bottom of a petri dish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.268,
    "end": 1016.676,
    "text": "It doesn't have all the features of a living organism, but it's got enough of them that it's motile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.736,
    "end": 1019.52,
    "text": "It's able to get itself from point A to point B.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.222,
    "end": 1031.4,
    "text": " So one of the other implications for AI of this biological discovery that you could rearrange genetically unmodified living tissues is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.65,
    "end": 1045.936,
    "text": " maybe we can task an AI with discovering novel rearrangements of living tissue to produce robots, to produce something that moves around and does something useful on a human's behalf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.417,
    "end": 1054.772,
    "text": "So that's what I mean by a biobot, a biobot that's made from, in this case, genetically unmodified cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.752,
    "end": 1076.541,
    "text": " um the the swarm of xenobots that you see in the bottom uh right uh as you can see they're sort of pushing around some material in their their dish this um sort of visually hints at applications for this this type of robotic technology which is they might be able to act like very very small roomba",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1076.521,
    "end": 1078.945,
    "text": " robot vacuum cleaners in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.005,
    "end": 1085.676,
    "text": "They might be able to collect microplastics out of waterways or cancer cells out of bloodstreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.559,
    "end": 1097.736,
    "text": "The swarm that you see that's cleaning up in this slide at the bottom right, the material that they're cleaning up is actually other frog cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1098.796,
    "end": 1106.427,
    "text": " It turns out that if the AI designs this swarm just right, and the swarm that you're looking at, this is an AI-designed swarm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.487,
    "end": 1111.154,
    "text": "The AI came up with the shape for each member of the swarm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.895,
    "end": 1119.026,
    "text": "The swarm is pushing these little white circles, which are individual frog cells, pushing them into piles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.646,
    "end": 1125.495,
    "text": "Turns out these individual frog skin cells at a certain stage of development are sticky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.543,
    "end": 1127.586,
    "text": " and they clump together into a pile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.588,
    "end": 1138.924,
    "text": "And some of these piles, if they're big enough, if they contain enough frog cells, they will grow very small hairs on the surface cells, the cells that are on the surface of the pile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.726,
    "end": 1142.79,
    "text": "And those little small hairs are called cilia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.971,
    "end": 1150.082,
    "text": "They're usually used to pull dirt and pathogens off the body of frogs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1150.282,
    "end": 1164.797,
    "text": " Here, when those cilia grow on small piles of frog cells, they're able to exert enough force against the surrounding water that these piles start to move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.997,
    "end": 1168.266,
    "text": " And so what you have in essence is a child xenobot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.286,
    "end": 1173.901,
    "text": "This swarm pushes cells together and in essence makes copies of themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.924,
    "end": 1181.301,
    "text": "This is another implication of this work is that in this case, the AI has figured out how to design robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.226,
    "end": 1191.075,
    "text": " that replicate, they make copies of themselves by finding raw material in their environment and constructing copies of themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.095,
    "end": 1201.225,
    "text": "This has been a longstanding dream in robotics, dating back a very long time to John von Neumann in the 1950s, who had a thought experiment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.345,
    "end": 1208.892,
    "text": "It would be great if we could create robots that would create copies of themselves, which would create copies of themselves,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.872,
    "end": 1220.67,
    "text": " And if those robots do useful work for humans as a side effect, for von Neumann that was creating moon bases and then Mars bases and then colonizing the galaxy, which sounds great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1221.792,
    "end": 1228.382,
    "text": "But the seed of this idea is if we want robots to really be useful at scale,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.683,
    "end": 1240.379,
    "text": " Instead of manually constructing billions of robots and then deploying them to do something useful, which is expensive, it would be much cheaper to make one robot that does something useful for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.22,
    "end": 1248.97,
    "text": "And by the way, it also makes two copies of itself, which does more useful work for us and four and eight and 16 and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.743,
    "end": 1254.369,
    "text": " We're not there yet with the xenobots, but it's a demonstration that that is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.51,
    "end": 1262.0,
    "text": "And again, all of that becomes possible because the AI is designing both the bodies and the brains of these robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.02,
    "end": 1277.421,
    "text": "This is very far now from the traditional view of AI and robotics, where we build a robot body, we humans build a robot body, and then the AI tinkers with the brain of that fixed machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.401,
    "end": 1288.436,
    "text": " Part of the reason why I'm here today and part of the message of my group is we need to think more broadly about how to combine AI and robotics and possibly synthetic biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.476,
    "end": 1304.016,
    "text": "And when we do, when we think more broadly, there are whole new paths that open up to ways in which we might create in the future, not yet, but in the future, create intelligent, useful and safe machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.211,
    "end": 1316.684,
    "text": " In the current era in AI, there is one particular approach, which is auto completion of tokens, which has come to dominate the field and come to dominate the popular imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.744,
    "end": 1321.569,
    "text": "We all kind of have an understanding more or less of what ChatGPT is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.15,
    "end": 1331.64,
    "text": "And there are some very strong lobbying organizations out there that are bent on convincing us that if we just do this with more compute, more data,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1331.62,
    "end": 1334.545,
    "text": " We will eventually get to safe machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.026,
    "end": 1346.244,
    "text": "My contention is there just isn't enough data out there to make non embodied AI like chat GPT and stable diffusion and all the rest to make them safe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.725,
    "end": 1355.379,
    "text": "We have to think differently about designing bodies and brains of machines simultaneously to realize this long term goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.862,
    "end": 1357.122,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.439,
    "end": 1359.201,
    "text": " I've been talking for a while.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.221,
    "end": 1364.148,
    "text": "I'm going to stop and I'm happy to take questions or engage in some discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.208,
    "end": 1368.874,
    "text": "And I'm happy to come back to any of these experiments and provide more detail if that's helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.256,
    "end": 1371.177,
    "text": "Over to you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.401,
    "end": 1374.842,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1375.523,
    "end": 1375.783,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.464,
    "end": 1376.824,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1377.125,
    "end": 1380.409,
    "text": "What a cornucopia of bodies and minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.19,
    "end": 1384.532,
    "text": " It was a great overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1384.552,
    "end": 1398.618,
    "text": "I was really struck by some of the similarities and the convergence on whole of lifecycle design and kind of holistic design coming from, on one hand, a systems engineering and a materials perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.698,
    "end": 1406.312,
    "text": "And on the other hand, from the biology perspective, with like eco evo devo and this convergence upon",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.782,
    "end": 1431.253,
    "text": " needing to think about how the end-to-end function maybe even past the point of functionality like into the planned graceful decay of a robot as well so it brings in a lot of topics that even from an outsider's perspective seem to be put as kind of secondary so that's very cool okay great i'm looking forward to what people in the live chat write",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1432.364,
    "end": 1453.562,
    "text": " My first question is, how over these 22 years, how have the materials, the theories, like the contexts, advances in Turing computation, all these kinds of things, how have they intersected and just what has the ride been like as you pursued these questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.588,
    "end": 1462.336,
    "text": " Yeah, I think it's, um, the short answer again is, is, is focusing on the physical aspect of AI and robotics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.356,
    "end": 1468.161,
    "text": "So the materials from which we can build machines has changed over 20 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.762,
    "end": 1478.932,
    "text": "And from my perspective, the experiment, the top left there, that was something I did as part of my PhD, you know, the materials at the time, it was, it was very hard to build a robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.952,
    "end": 1483.296,
    "text": "You got, you bought some motors, you bought a battery, you bought some metal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.276,
    "end": 1485.741,
    "text": " you bought some wires and you wired everything up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.821,
    "end": 1488.847,
    "text": "There was the assumption that bodies were fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.348,
    "end": 1491.412,
    "text": "And not only that, but they were difficult to make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.472,
    "end": 1497.303,
    "text": "So once you made one, you were very careful with it to make sure it didn't change, that it didn't become damaged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.065,
    "end": 1501.251,
    "text": "And that seemed to comport with a lot of the theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1501.737,
    "end": 1512.674,
    "text": " in AI and neuroscience, which had the same sort of idea that the brain or in the case of robotics, the control policy is the puppeteer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.794,
    "end": 1520.927,
    "text": "It's something that's pulling the strings of a fixed thing, either the body of an organism or a robot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.346,
    "end": 1540.013,
    "text": " and if you look at a lot of a lot of theory in both fields ai and neuroscience that that assumption runs so deep so for example an active inter inference or you know the free energy principle we want to reduce surprisal that there's a fixed set of actions that we perform",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.993,
    "end": 1566.49,
    "text": " to try and reduce the surprise between what we're sensing and what we predicted we would sense given the past action where do those actions come from why are they fixed does the set of actions grow over time maybe the the sensory data that's coming is coming from a new sensor that's just coming online or a sensor that's recently duplicated now there's two of them but they're not quite reporting exactly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.47,
    "end": 1567.592,
    "text": " the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.612,
    "end": 1578.233,
    "text": "There's a whole bunch of assumptions underlying a lot of the theory about active inference, predictive coding, you name it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.253,
    "end": 1583.263,
    "text": "You pick your concept from neuroscience or cognitive science or AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.003,
    "end": 1590.092,
    "text": " Once you peel back those assumptions, imagine the robot's body changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.593,
    "end": 1594.839,
    "text": "Imagine the robot splits in two and becomes two copies of itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.84,
    "end": 1602.49,
    "text": "A lot of the theory and the formal underpinnings of that theory break down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.63,
    "end": 1610.061,
    "text": "You start to get into ill-posed questions, which force you to now think about how do you fundamentally change the theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.952,
    "end": 1621.006,
    "text": " If you have a hierarchy of actions, like in predictive coding or active inference, what if that hierarchy itself is growing and changing over time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.087,
    "end": 1623.55,
    "text": "How do we address that in a formal manner?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.091,
    "end": 1631.762,
    "text": "So to get back to your question, I think these advances in what we can do physically, we can build robots now out of soft materials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1631.822,
    "end": 1636.048,
    "text": "We can build robots out of living materials, which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.366,
    "end": 1647.339,
    "text": " on their own will grow and divide and seek out energy and material on their own, that those physical machines, these odd new kinds of creatures are militating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.379,
    "end": 1662.036,
    "text": "They're pushing against the theory and specifically they're pushing against these unspoken assumptions that lie underneath a lot of this theory about what's required to act intelligently in a complex world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.214,
    "end": 1664.597,
    "text": " That's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.617,
    "end": 1670.169,
    "text": "Like the real world and the territory expanding into our unknown unknown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.55,
    "end": 1670.831,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1670.891,
    "end": 1674.619,
    "text": "There's a bunch of questions in the live chat, so I'm just going to go for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.799,
    "end": 1677.225,
    "text": "Give any answer that you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.245,
    "end": 1677.505,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.187,
    "end": 1678.287,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.967,
    "end": 1686.133,
    "text": " David Williams wrote, how do you think about the controllers in your robotics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.873,
    "end": 1689.777,
    "text": "Embedded AI, at least today, is rather hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.477,
    "end": 1695.022,
    "text": "Batteries and chips, PCBs, not soft and not easily synthesized locally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.403,
    "end": 1697.725,
    "text": "So how do you think about the controllers in your robotics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.646,
    "end": 1699.707,
    "text": "Yeah, great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.767,
    "end": 1701.129,
    "text": "So right, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.149,
    "end": 1705.033,
    "text": "The controllers are dealing with hard, rigid, fixed components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.688,
    "end": 1715.222,
    "text": " We need to start thinking about controllers that can, in which, for example, the input layer and the output layer can grow and shrink over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.763,
    "end": 1730.886,
    "text": "There may be new sensors or new input coordinates that are growing or being attached to a machine, and the controller needs to be able to carefully deal with those new input channels while the machine is operating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.322,
    "end": 1743.103,
    "text": " same thing goes for the output channel there may be new actions or new dimensions of action along which the machine can act and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.438,
    "end": 1763.252,
    "text": " control policies, reinforcement learning, all the rest of it, all those assumptions that make reinforcement learning work, which is what drives most autonomous vehicles at the moment, assumes that the dimensionality of input and the dimensionality of output, the things that the machine can do and sense,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.772,
    "end": 1768.98,
    "text": " are fixed during training or during behavior generation, during execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.26,
    "end": 1778.654,
    "text": "That is absolutely not true in any organism on the planet, and that's becoming increasingly untrue for our coming machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.975,
    "end": 1783.542,
    "text": "Now, how to do it well, I don't have any answers, but we have to figure it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.423,
    "end": 1787.027,
    "text": "You were asking a question about thinking about controllers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.087,
    "end": 1791.113,
    "text": "That's a concrete example about how we have to rethink",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.093,
    "end": 1807.6,
    "text": " control policy optimization even if we're not thinking directly about the body even if we just focus on the control policy and ask what happens as the input and output channel the dimensionality of the input and output channels change during behavior execution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.103,
    "end": 1809.945,
    "text": " Yeah, just one short point on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1810.045,
    "end": 1816.911,
    "text": "It's like training with a fixed set of perceptual elements or of affordances or of actuators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.291,
    "end": 1823.697,
    "text": "It's like training on one point in a larger space of the adjacent possible of like bodies or of architectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.018,
    "end": 1830.544,
    "text": "So then, okay, we're bringing all this compute to train a special case in the fixed setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1831.044,
    "end": 1834.507,
    "text": "And that's not even how the smallest organism works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.948,
    "end": 1837.35,
    "text": "So that just, again, like kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.33,
    "end": 1838.011,
    "text": " shows that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.171,
    "end": 1838.432,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.313,
    "end": 1854.915,
    "text": "Sorry, before we move on from that point, just to again illustrate how the body shapes the way we think, in the case of a growing biological body, there are new input channels that come online throughout our lifetime, but they don't appear de novo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.336,
    "end": 1864.249,
    "text": "Whatever it is, whatever that new input channel is, as we're growing, we just have more sense cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.229,
    "end": 1886.383,
    "text": " the signals that they're sending into the peripheral and central nervous system are not orthogonal to whatever else is already coming in as input because new input channels or new cells are slowly dividing and at the moment of division they're providing exactly the same signal as some other sensory channel that already exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.403,
    "end": 1893.173,
    "text": "So the body, or in this case biological growth, provides an immediate scaffold, a gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.473,
    "end": 1899.368,
    "text": " In robotics, it can be very scary to think about attaching a sensor to an autonomous vehicle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.408,
    "end": 1903.298,
    "text": "What the hell does it do with this new information that's coming in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.43,
    "end": 1909.756,
    "text": " Because we haven't thought carefully about how to add that new sense modality to the machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1910.176,
    "end": 1925.53,
    "text": "Again, we have to look to nature that every new sense sense modality is gradually coming online and gradually drifts away or becomes increasingly orthogonal to the starting input modality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.79,
    "end": 1932.576,
    "text": "So that's how we should, if we did that physically with machines, it would simplify",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.231,
    "end": 1937.057,
    "text": " reinforcement learning or make it easier for reinforcement learning or what have you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.097,
    "end": 1940.122,
    "text": "Sorry, let me reshare my screen here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.183,
    "end": 1947.635,
    "text": "It would simply make it easier for the... Sorry, something seems to have gone wrong here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.675,
    "end": 1948.557,
    "text": "Give me a moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.47,
    "end": 1956.69,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.396,
    "end": 1957.817,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.837,
    "end": 1958.038,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.639,
    "end": 1963.19,
    "text": "Uh, yeah, it would makes things easier on the control policy optimization process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.972,
    "end": 1970.308,
    "text": "If new sense organs and new motor outputs are coming online, but they resemble things that already exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.275,
    "end": 1974.577,
    "text": " That's super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.559,
    "end": 1983.314,
    "text": "Brings up a lot of questions about like self and non self recognition and what is a self as new and different senses and actions come online.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.356,
    "end": 1984.797,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.177,
    "end": 1985.438,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.079,
    "end": 1987.622,
    "text": "Prakash Kavi asks,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.003,
    "end": 1992.268,
    "text": " Do these biobots have any sense of agency?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.489,
    "end": 1993.771,
    "text": "What is your sense?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1993.791,
    "end": 1998.719,
    "text": "I am quite intrigued by the idea that beyond a critical point, they start growing hair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1999.219,
    "end": 2004.207,
    "text": "And do these biobots act independently of each other and also what happens at a group level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.528,
    "end": 2011.399,
    "text": "So what's your sense of agency in biobots and I guess the biobot and the group level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.51,
    "end": 2013.772,
    "text": " Yeah, it's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.912,
    "end": 2015.355,
    "text": "So I'll start with a disclaimer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.435,
    "end": 2016.657,
    "text": "I'm not a biologist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.777,
    "end": 2020.083,
    "text": "I'm a computer scientist by formal training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.163,
    "end": 2027.515,
    "text": "So I can only say so much about what the cells are doing and what they want to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.085,
    "end": 2042.102,
    "text": " I definitely follow in the footsteps of the late Daniel Dennett in that when we talk about agency, each of us individually has to decide whether or not we take the intentional stance or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.362,
    "end": 2045.366,
    "text": "In my opinion, it's a point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.406,
    "end": 2050.212,
    "text": "If it's easier to explain what the xenobots are doing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.187,
    "end": 2057.991,
    "text": " by talking about what the cells want to do, like grow cilia and coordinate their actions, fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.352,
    "end": 2063.931,
    "text": "If it's easier to explain what the xenobots are doing by not taking the intentional stance,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.316,
    "end": 2072.147,
    "text": " and describing cells as mechanical components that are transforming input into actions, that's fine too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.069,
    "end": 2076.694,
    "text": "This is something also that comes from my colleague, Mike Levin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.854,
    "end": 2077.555,
    "text": "It depends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.516,
    "end": 2086.648,
    "text": "As scientists, if we want to try and explain and understand what these machines are doing, if taking the intentional stance makes explanation easier, fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.888,
    "end": 2088.771,
    "text": "If not, then not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.751,
    "end": 2103.589,
    "text": " But attributing agency as sort of an objective property of the bots or the cells themselves, independent of us as observers, to me that's philosophically and practically problematic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.79,
    "end": 2112.7,
    "text": "As far as I know, there is no objective measure of agency in cells, let alone in organic robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.38,
    "end": 2133.085,
    "text": " super interesting that's like the second order cybernetics or the observer theory or the polycomputing question which is to say just looking at something and then treating one's perspective as um objectively the case it is objectively the subjective experience",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.638,
    "end": 2162.768,
    "text": " absolutely now that being said again there is there is an empirical side to this we can make some progress in understanding the xenobots uh by comparing them against a control so instead of cells if these were you know magnets or some complex mechanical system in which more of us are comfortable in saying there is no agency it's just a you know it's a bucket of cogs doing something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.608,
    "end": 2177.989,
    "text": " and that control does not exhibit kinematic self-replication, for example, or it's much harder for the AI to figure out how to put together non-agential components to do what it is, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2178.847,
    "end": 2182.852,
    "text": " then I feel a little bit more comfortable by saying the cells are doing something more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.072,
    "end": 2189.681,
    "text": "Now, I don't know whether it's a gentile or they want to do something or if it's free will or consciousness, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.721,
    "end": 2204.82,
    "text": "But if we can point at biobots or machines that are built from biological components and say it's easier to get them to do things because they start to, they become complicit in the overall goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.138,
    "end": 2208.142,
    "text": " compared to mechanical parts which don't, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.722,
    "end": 2222.099,
    "text": "And again, as a roboticist in the top and the middle rows that you see on my slide here, when we do build things out of metal and rubber and plastics and ceramics, it's usually super hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.259,
    "end": 2225.543,
    "text": "It's really hard to get them to do whatever we want them to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.67,
    "end": 2229.913,
    "text": " We've been working on robotics since the end of the Second World War.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.074,
    "end": 2231.755,
    "text": "And we've got the Roomba.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2231.775,
    "end": 2234.298,
    "text": "And maybe we've got autonomous cars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.318,
    "end": 2234.939,
    "text": "We're getting there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.179,
    "end": 2238.663,
    "text": "It's taken a really long time because robotics is really hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.723,
    "end": 2245.47,
    "text": "It's really hard to convince physical materials to adapt and do something useful and safe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.49,
    "end": 2248.633,
    "text": "On the flip side, we've been working on xenobots at the bottom here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.653,
    "end": 2251.316,
    "text": "We've been working on them for about five or six years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.416,
    "end": 2252.577,
    "text": "And we've got Roombas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.618,
    "end": 2255.901,
    "text": "We're making faster progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.982,
    "end": 2263.65,
    "text": " in robotics, when we build from cells than when we build from metal suggests, you know, the cells are somehow helping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.79,
    "end": 2265.872,
    "text": "I don't know that they want to help.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.892,
    "end": 2266.933,
    "text": "We've got to be careful there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.973,
    "end": 2268.155,
    "text": "That's the intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.215,
    "end": 2278.005,
    "text": "But when you deal with smart, when you, when you try and compose machines from smart machines and cells are smart machines, we're making fat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.025,
    "end": 2285.112,
    "text": "I know I'm biased, but I think we're making faster progress than when we build machines out of inert materials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.307,
    "end": 2287.873,
    "text": " Yeah, super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2288.114,
    "end": 2291.928,
    "text": "Okay, I'll read some comments from David Clement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.256,
    "end": 2294.798,
    "text": "David wrote,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2296.094,
    "end": 2299.157,
    "text": " Does your work incorporate agential hierarchies?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.677,
    "end": 2304.702,
    "text": "For example, do xenobots grow by replicating the initial seed cell into a higher order system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.222,
    "end": 2316.753,
    "text": "And is it critical for lower order systems to act as a component of a virtual machine, meaning that they have a target behavior that is less than the higher order system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.053,
    "end": 2319.875,
    "text": "And that's kind of related to Prakash's question as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.935,
    "end": 2326.101,
    "text": "How do you bridge that from the individual component into the swarm or the aggregate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.081,
    "end": 2351.38,
    "text": " yeah it's a really it's a really good question so absolutely i think the that when we started working on the xenobots and mike's mike levin started to talk about machines made of machines made of machines that definitely has influenced the work in my group to focus on this issue of hierarchy i don't know about a gentile hierarchy again we just talked about a gentile agency that's maybe a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.36,
    "end": 2352.723,
    "text": " a subjective stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.444,
    "end": 2359.135,
    "text": "But definitely, why would you want to build machines out of machines out of machines?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.716,
    "end": 2365.167,
    "text": "At the moment, our state-of-the-art robots, like autonomous vehicles, are not hierarchical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.159,
    "end": 2372.207,
    "text": " The control policy operates at the level of the machine as a whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.109,
    "end": 2385.746,
    "text": "For example, if there is an emergency blowout of the tire in an autonomous vehicle, the tire itself, the rubber that makes up the tire, doesn't deform and try and fix or reduce surprisal locally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.007,
    "end": 2386.568,
    "text": "It can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.828,
    "end": 2387.409,
    "text": "It's rubber.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.649,
    "end": 2388.771,
    "text": "It's inert material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.051,
    "end": 2394.799,
    "text": "We don't have machines built of machines built of machines yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.015,
    "end": 2404.722,
    "text": " But as biology in general and the xenobots in particular demonstrate, there's an adaptive advantage to being a hierarchy of physical things, of physical machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.946,
    "end": 2410.358,
    "text": "If there is a surprising event at the level of the machine as a whole,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2410.895,
    "end": 2421.071,
    "text": " but that surprise trickles down through the hierarchy, it's unlikely that everyone at every level of the hierarchy is going to be surprised.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2421.091,
    "end": 2427.942,
    "text": "Someone somewhere in the hierarchy is gonna say, from my local view at least, on this bigger surprising issue,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.922,
    "end": 2429.124,
    "text": " I know what to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.444,
    "end": 2435.814,
    "text": "So let me start to communicate to my peers and up the hierarchy to deal with surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2436.255,
    "end": 2447.432,
    "text": "That would be from a engineering point of view, that would be a good thing to have in big, heavy, fast moving robots that are near humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.188,
    "end": 2453.176,
    "text": " There's always going to be some surprising event that the vehicle as a whole has never seen before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.216,
    "end": 2461.148,
    "text": "There's great YouTube videos of, you know, horrifyingly, you know, scary, surprising edge cases for autonomous vehicles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.528,
    "end": 2461.889,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.229,
    "end": 2464.312,
    "text": "We're never going to fix every edge case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.773,
    "end": 2465.995,
    "text": "Well, we can fix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.975,
    "end": 2480.727,
    "text": " is to make hierarchies and maybe agential hierarchies where local surprise can be handled or global surprise can be broken down into local surprising events which can be handled locally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.128,
    "end": 2486.454,
    "text": " If I understood the second part of your question is, how do we design that hierarchy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.514,
    "end": 2494.462,
    "text": "Should the smaller parts be trying to pull in the same direction or be trying to solve some part of the goal of the higher level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.943,
    "end": 2499.808,
    "text": "I think that's a super interesting question and I don't think that the answer is obvious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.369,
    "end": 2506.796,
    "text": "It may be that smaller parts pursuing orthogonal goals ends up actually being useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.816,
    "end": 2509.819,
    "text": "It may end up being useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.082,
    "end": 2528.003,
    "text": " Just to give you a quick example, if you want, if there's a surprising event and you've got a whole bunch of semi-independent machines organized in a hierarchy, I would argue that every single one of those members of the hierarchy should have a slightly different body and brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.223,
    "end": 2530.306,
    "text": "It should have a slightly different form and function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.706,
    "end": 2532.248,
    "text": "You don't want a monoculture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.328,
    "end": 2540.498,
    "text": "You don't want all the parts being smaller versions of the bigger parts and trying to achieve smaller versions of the same goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.052,
    "end": 2546.946,
    "text": " Because then you've basically got a committee in which everybody thinks and feels the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2546.966,
    "end": 2550.334,
    "text": "And as we know from humans, that's a dangerous thing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.354,
    "end": 2552.119,
    "text": "You get group think or group act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.68,
    "end": 2554.665,
    "text": "You actually want a hetero culture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.126,
    "end": 2558.875,
    "text": "You want a whole bunch of things that are unique in terms of form and function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.142,
    "end": 2572.141,
    "text": " And that maximizes your chances that someone somewhere in the hierarchy says, just because of the way I'm built and the way I think with my local control policy, I know what's going on and I have the seed of a solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.482,
    "end": 2577.189,
    "text": "Here's the seed, you all figure out what you need to do to make it a reality at the larger level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.27,
    "end": 2581.715,
    "text": "That's another aspect of where the body comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.638,
    "end": 2586.162,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.665,
    "end": 2612.537,
    "text": " everywhere is the last mile from somewhere things have to be addressed locally no matter how you think about a communications architecture distally everything and embodiment calls our attention back to that like it has to be somewhere locally so then why not take that as the starting point instead of like this kind of resource challenge and then about like the multiple subunits",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.517,
    "end": 2625.47,
    "text": " When there's a damage to the nest of an ant colony or there's some things spilled on the surface, it's like not that every single nest makes a perfect pebble move.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.71,
    "end": 2637.462,
    "text": "It's that 51% accuracy with a bunch of non-specific flurrying of activity, just like kind of stress or these more generic higher order signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2637.442,
    "end": 2663.112,
    "text": " that is what allows nest mates with different brains and bodies to fulfill their own paths of least action and then colonies for which that doesn't clean up the mess or it cleans up too well and there's externalities those colonies are swept off the table and then we see the persistence of collective systems that could figure that out in their growth from a little colony to a big colony",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.783,
    "end": 2689.875,
    "text": " absolutely great great example um i had a question you you mentioned uh both safety as well as like reliability and how do you think about capacities and evaluations on diverse intelligences we're all familiar with ram cpu hard drive storage some of the von neumann type architectural descriptors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.024,
    "end": 2704.641,
    "text": " However, how do we even think about what does that rubric or report card even start to look like when we know that there's complex interactions with the niche and when the kinds of capacities that we're talking about may have even open-endedness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2705.549,
    "end": 2732.687,
    "text": " yeah great great point great point right so you know we are the beneficiaries of you know two big revolutions one of them is the ai revolution but then the older one is the digital electronics revolution right so digital electronics works we all have you know a super computer in our pocket like there's no arguing with it it's an incredibly powerful way to make machines that internally communicate quickly and richly and then can communicate with other machines",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.667,
    "end": 2733.931,
    "text": " I mean that's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.971,
    "end": 2737.22,
    "text": "That's the information age that we're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.641,
    "end": 2746.626,
    "text": "It's been so successful that it's hard to think about alternatives or why we would even bother thinking about alternatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.483,
    "end": 2760.982,
    "text": " But again, living systems, a lot of what cells do, they rely on electrical communication, but they also rely on mechanical communication, chemical communication, thermal communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.763,
    "end": 2770.656,
    "text": "Cells are using all physical modalities, not all physical modalities, but as many as they can get their hands on simultaneously all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.636,
    "end": 2771.117,
    "text": " Why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.157,
    "end": 2777.908,
    "text": "Why don't they just abandon everything and do everything purely electrically like our modern civilization has done?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.968,
    "end": 2779.35,
    "text": "Because it's dangerous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.39,
    "end": 2781.433,
    "text": "You don't have a diversified portfolio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.275,
    "end": 2792.391,
    "text": "So one panel here that I haven't talked about is the one in the bottom right, which is basically just what you're looking at is what's called a granular",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.776,
    "end": 2795.8,
    "text": " It's a material that's made up of a bunch of grains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.421,
    "end": 2801.628,
    "text": "In this case, the blue circles that you see, these are little just rubber pucks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.648,
    "end": 2805.253,
    "text": "And there is an oscillation being supplied at the left-hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.313,
    "end": 2814.085,
    "text": "And you can see that this leads to interesting non-linear vibrational behavior within this material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2814.746,
    "end": 2817.45,
    "text": "What does that have to do with robotics or AI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.43,
    "end": 2844.822,
    "text": " if you view the vibrations as the carrier of information so if if a puck is vibrating that's a one if the puck is not vibrating that's a zero now you can start to imagine creating materials that communicate shannon information throughout the physical structure not with electricity but with a different a different modality dynamics or vibration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.033,
    "end": 2851.503,
    "text": " And it turns out that you can actually compose these metamaterials to embody logic gates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.244,
    "end": 2862.102,
    "text": "If you vibrate one particle or another particle, but not both and not neither, you can watch a third particle and it will either vibrate or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.402,
    "end": 2867.469,
    "text": " in accordance with an exclusive or gate and you can build this up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.809,
    "end": 2869.772,
    "text": "Now again, why would you do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.992,
    "end": 2875.86,
    "text": "We can make an XOR gate that's vanishingly small and vanishingly fast in digital electronics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.92,
    "end": 2878.103,
    "text": "Why would you ever want to do something different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.925,
    "end": 2886.655,
    "text": "Because it turns out there are advantages of communicating with vibration rather than electricity under certain conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.85,
    "end": 2901.53,
    "text": " Having a machine that can communicate between distant parts of its body through mechanical vibration, as well as electricity has an advantage over a machine that can only communicate long distances within its body electrically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.55,
    "end": 2908.66,
    "text": "I won't go into the reasons, but you can intuitively start to understand that so again, I think we need to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.977,
    "end": 2919.129,
    "text": " If we're serious about creating safe and useful autonomous machines, we have to break out of the digital electronics assumption that that's the only way to do things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.55,
    "end": 2927.88,
    "text": "We have to break out of the assumption that non-embodied cognition is the way to go and it's easy to just drop it into a physical body and we're good to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.9,
    "end": 2933.567,
    "text": "We have to peel back some of these very deep assumptions about the right way to do things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.155,
    "end": 2940.182,
    "text": " that have built up in our society since the Second World War because a lot of those technologies have been very successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.522,
    "end": 2950.333,
    "text": "Nothing wrong with them, but when we come to apply them to creating safe and useful machines, not always the right thing or the only way to approach things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.475,
    "end": 2953.516,
    "text": "That's really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.616,
    "end": 2959.943,
    "text": "It's like a sort of generalized compute concept where we could talk about, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.21,
    "end": 2965.995,
    "text": " These are the chemicals that it can detect with this fidelity and here's its tactile interface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.015,
    "end": 2968.988,
    "text": "Here's its electromagnetic capacity for sending and receiving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.238,
    "end": 2985.884,
    "text": " That's what kind of motivates or complements the generic theory like free energy principle, which doesn't tell us about how anything is in particular, but then sets us up with kind of the framework to plug in these different modules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2986.064,
    "end": 2989.049,
    "text": "And then it's an empirical question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2989.189,
    "end": 2991.853,
    "text": "And then right here is sort of the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.099,
    "end": 3018.06,
    "text": " virtual body and a real body and so that's also very interesting how how does that work like in a collaboration or with a graduate student like how do you balance this digital adjacent possible off of the material and the more costly um implementation with embodiment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3019.019,
    "end": 3047.119,
    "text": " yeah well with so with grad students and postdocs or whoever you know i'm collaborating with that's kind of starting out you know this can be a very frightening prospect for someone who's trying to get into ai and robotics because it looks like everything's been done it's solved like we all we got you know we just have to wait for google and microsoft to buy more compute and data and they'll they're going to finish off the last one percent of the dangerous behavior so if you're trying to contribute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.268,
    "end": 3054.215,
    "text": " to society's goal of making useful, autonomous, safe machines as starting out, what do you do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.395,
    "end": 3056.537,
    "text": "It looks like this massive brick wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.557,
    "end": 3057.718,
    "text": "There's no entry point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.399,
    "end": 3063.484,
    "text": "So my take on this is, again, is that we may be going about this all wrong, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.544,
    "end": 3071.792,
    "text": "The assumption that electricity should be the carrier of information inside an autonomous machine, that's an assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.992,
    "end": 3073.073,
    "text": "Why electricity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.594,
    "end": 3074.715,
    "text": "Why not vibration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.815,
    "end": 3077.157,
    "text": "Why not something else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.491,
    "end": 3082.178,
    "text": " Even if you start to think about the alternatives, the immediate reaction is, well, it's not gonna be as good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3082.618,
    "end": 3083.6,
    "text": "Maybe, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.64,
    "end": 3092.012,
    "text": "But if you think about vibration, you were just mentioning like compute, we can use vibration for compute, but vibration is movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.853,
    "end": 3101.966,
    "text": "So the minute you start to think about vibration as the carrier of Shannon information, you are now conflating action with computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.006,
    "end": 3104.089,
    "text": "They cannot be separated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.453,
    "end": 3109.682,
    "text": " Descartes convinced the West 400 years ago that they're separate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.083,
    "end": 3110.984,
    "text": "They just are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3111.005,
    "end": 3115.814,
    "text": "And you look at AI and robotics, what a surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3116.295,
    "end": 3119.462,
    "text": "These two are attempts to create",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.746,
    "end": 3121.888,
    "text": " you know, AGI is bicameral.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.028,
    "end": 3128.775,
    "text": "There's one team that says it's gonna happen in computers and the other side that says it's gonna happen in physical machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3129.335,
    "end": 3132.218,
    "text": "That's the Cartesian legacy that they're separate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.879,
    "end": 3139.665,
    "text": "But the minute you look at some very humble material like the one in the bottom right, it's a bunch, it's 12 hockey pucks next to one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.706,
    "end": 3144.31,
    "text": "There's no Cartesian division anymore between body and brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.53,
    "end": 3147.373,
    "text": "There is a body and there is a brain there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.893,
    "end": 3152.346,
    "text": " but it looks very different from anything we would usually consider.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.406,
    "end": 3156.418,
    "text": "And there's no value judgment here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.498,
    "end": 3157.942,
    "text": "It's not better or worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.323,
    "end": 3160.149,
    "text": "Maybe it is, depending on what your metric is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.269,
    "end": 3163.017,
    "text": "It's just very different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.418,
    "end": 3167.904,
    "text": " And so with grad students and postdocs, I encourage them to pursue that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.066,
    "end": 3171.048,
    "text": "Could we do things completely differently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.068,
    "end": 3175.254,
    "text": "And in the long run, might that be a better way to do things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.575,
    "end": 3176.616,
    "text": "Who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.796,
    "end": 3177.297,
    "text": "We'll see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.119,
    "end": 3179.62,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.7,
    "end": 3182.143,
    "text": "I'll make one comment and then ask a last question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3182.824,
    "end": 3189.173,
    "text": "You brought up Descartes, and that's the res extensa, res cognitum question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.878,
    "end": 3214.958,
    "text": " dualism between the thinking and the non-thinking substance, and embodied cognition, embodied intelligence provides both an operational, instrumental, and an ontological counter-argument or complementary perspective, which is just, well, in practice and in actuality, take it or leave it, they are inseparable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.938,
    "end": 3222.732,
    "text": " And so, at the very least, that starts to ratchet and leapfrog the discussion about what is mind and body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.772,
    "end": 3230.005,
    "text": "And, you know, you started with pointing out how important it was to co-evolve in the complementarity of mind and body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.526,
    "end": 3236.777,
    "text": "And it's like, they're two separate things that need to be complementary and tangoing, and also maybe they're...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.757,
    "end": 3261.786,
    "text": " integrated and blurred in even deeper ways than the dance so that's like it's it's an empirical entry point into what otherwise is a thought experiment which can have utility but also can be just arbitrarily misleading absolutely one of my one of my former mentors inman Harvey at the University of Sussex used to talk about robotics as philosophy with a screwdriver",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.66,
    "end": 3264.828,
    "text": " You know, it's not just armchair philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.849,
    "end": 3272.94,
    "text": "It's when you start to build some of these machines, maybe in retrospect, you, you, in the case of the metamaterials project for me in retrospect,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.427,
    "end": 3279.394,
    "text": " I said, oh my God, you know, most action and cognition are not complementary, separate things that are complementary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.654,
    "end": 3281.076,
    "text": "They're one in the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.316,
    "end": 3283.218,
    "text": "It's not embodied cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.278,
    "end": 3285.08,
    "text": "It's not an adjective of a noun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.42,
    "end": 3288.063,
    "text": "It's embodiment is cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.163,
    "end": 3291.547,
    "text": "There are not two things here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3291.727,
    "end": 3292.929,
    "text": "There's just one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3293.57,
    "end": 3294.691,
    "text": "Very hard to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3294.731,
    "end": 3298.455,
    "text": "It's so alien to a Western mind, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.435,
    "end": 3320.477,
    "text": " you know it just is sometimes i think about that in terms of like adjectives getting added in front of a word and then the term expanding and then it just encompassing oh of course cognition is ecological embodied enacted etc etc etc etc and then so it kind of like it needs to be distinguished and then it subsumes again and that's part of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.778,
    "end": 3325.63,
    "text": " In closing, what are you excited about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.67,
    "end": 3328.317,
    "text": "Where can people continue to learn more?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.377,
    "end": 3333.75,
    "text": "What would you say to a person who's wanting to go in this area?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.873,
    "end": 3337.74,
    "text": "Yeah, okay, great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.003,
    "end": 3361.534,
    "text": " Google my name and it'll take you into lectures and papers and tutorials and and people want folks want to email me that's perfectly fine again Google my name you can find my email happy to put you in touch with the right people I think it's you know it's easier than ever to get started you can go to chat GPT and say you know create some tutorials for me to start",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.514,
    "end": 3362.816,
    "text": " coding up robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.397,
    "end": 3372.051,
    "text": "Ironically, non-embodied AI provides a good on-ramp now, not just for reading about these ideas or listening to people talk about these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3372.451,
    "end": 3376.117,
    "text": "You can start coding them up in a way that's easier than ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3376.478,
    "end": 3382.307,
    "text": "In the old days, you had to learn C and then go on from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.097,
    "end": 3384.96,
    "text": " Very easy to get your hands dirty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.341,
    "end": 3393.235,
    "text": "Maybe not with physical materials, but you can create, like you see in the left of each of these panels, you can create machines that are virtual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.675,
    "end": 3395.919,
    "text": "They're not physical, but they're embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.08,
    "end": 3397.702,
    "text": "It's another point that's important to make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.023,
    "end": 3400.347,
    "text": "Embodiment does not imply physicality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.525,
    "end": 3405.87,
    "text": " You need to be able to push against the world and observe how the world pushes back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.331,
    "end": 3411.597,
    "text": "But the world and you may be virtual like you see on the left or physical like you see on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3412.037,
    "end": 3418.866,
    "text": "So you can actually relatively quickly get your hands dirty with playing around with embodied AI these days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.326,
    "end": 3422.99,
    "text": "And I encourage everyone to do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.01,
    "end": 3423.551,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3423.571,
    "end": 3425.153,
    "text": "Any last comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.449,
    "end": 3433.448,
    "text": " I would just say I was at the Computer Vision and Pattern Recognition Conference, CVPR, a few weeks back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.468,
    "end": 3437.539,
    "text": "This is one of the flagship AI conferences, 15,000 attendees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.177,
    "end": 3453.564,
    "text": " And after my talk, a lot of grad students came up and they said, listen, you sort of demonstrated there's another path here, that I was feeling depressed or anxious about how to make progress in AI when these Goliaths have these data centers at their beck and call.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.345,
    "end": 3460.776,
    "text": "I would just encourage everyone that when you think differently about all this stuff,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.756,
    "end": 3462.658,
    "text": " There are new paths that open up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3462.678,
    "end": 3472.912,
    "text": "They may not in the long run be the right path, but there are alternatives to this monolithic predict the next token idea, which is currently in vogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.033,
    "end": 3479.54,
    "text": "It may be the beginning of the end, but I think this is just the end of the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.6,
    "end": 3481.403,
    "text": "We've figured a few things out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.523,
    "end": 3488.512,
    "text": "There are some things that work, but they're still producing not quite useful and definitely dangerous machines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.592,
    "end": 3490.054,
    "text": "There is room for improvement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.27,
    "end": 3496.977,
    "text": " And there's nothing that says that only Google with all its resources is going to be the one that can figure out these improvements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.357,
    "end": 3498.158,
    "text": "Think differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.178,
    "end": 3501.361,
    "text": "Try some of these alternative approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.421,
    "end": 3508.889,
    "text": "And maybe you will be the one that comes up with the answer, whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.05,
    "end": 3510.271,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.311,
    "end": 3510.671,
    "text": "Good luck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3511.952,
    "end": 3512.313,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.793,
    "end": 3513.554,
    "text": "Thank you, Josh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.455,
    "end": 3515.216,
    "text": "Really appreciate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.236,
    "end": 3516.117,
    "text": "Thanks for having me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.437,
    "end": 3516.997,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3517.017,
    "end": 3518.539,
    "text": "And until next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.004,
    "end": 3520.838,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.859,
    "end": 3521.088,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]