[
  {
    "start": 5.745,
    "end": 6.846,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6.906,
    "end": 11.71,
    "text": "Welcome to Team Calm, ACT-INF stream number 3.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.19,
    "end": 18.235,
    "text": "This is a follow-up discussion from number three, A World Unto Itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.055,
    "end": 19.976,
    "text": "And welcome, everybody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.156,
    "end": 24.5,
    "text": "So thanks again to Yvonne and Alex for coming to this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.54,
    "end": 26.941,
    "text": "And thanks to Shannon for coming again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.961,
    "end": 27.602,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.162,
    "end": 34.043,
    "text": " Cool, I'm gonna share our slides and we'll get right into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.563,
    "end": 36.644,
    "text": "This is TeamComm 3.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.084,
    "end": 42.606,
    "text": "Welcome to TeamComm for our first time or not first time listeners.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.406,
    "end": 46.407,
    "text": "This is a recorded and archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.287,
    "end": 52.469,
    "text": "We as TeamComm are an experiment in online team communication and learning related to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.369,
    "end": 59.091,
    "text": "You can reach us through Twitter, email, our public Keybase team or our YouTube channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.319,
    "end": 63.322,
    "text": " We welcome all skills, backgrounds, and perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.203,
    "end": 71.63,
    "text": "And we ask for our conversions to use good online video chat etiquette, to be respectful, muting and raising your hands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.05,
    "end": 75.934,
    "text": "And also everyone, please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.369,
    "end": 86.802,
    "text": " Today in Active Inference stream number 3.5, which is a follow-up to number 3 discussing the same paper, we're going to have a quick check-in and warm-up as usual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.463,
    "end": 90.246,
    "text": "And then we'll return to our discussion of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.947,
    "end": 91.448,
    "text": "And we've...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.369,
    "end": 99.072,
    "text": " a bunch of follow-up questions from ourselves and some colleagues, and we've sorted them loosely into a couple of categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.812,
    "end": 112.357,
    "text": "And we'll be able to take questions about any topic, but the slides are somewhat organizing the questions into topics of communication, development, attunement, attention, and free energy itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.942,
    "end": 123.493,
    "text": " So as far as the check-in and warm-up, the first question is, what is an interesting type of communication you've experienced or maybe even thought about in the previous week?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.918,
    "end": 144.943,
    "text": " For me, it was a meeting with my relatives that I didn't have a chance to see about for half a year before because of COVID and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 145.003,
    "end": 160.729,
    "text": "So this last weekend was quite a happy meeting with relatives and some kind of discussion and so attunement between us after a long time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 163.427,
    "end": 163.727,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.488,
    "end": 175.335,
    "text": "And maybe either Yvonne or Shannon in related to that answer, how has going remote or just this situation of the past year influenced your style of communication or relating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.697,
    "end": 178.037,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 178.197,
    "end": 186.082,
    "text": "So yesterday we had our first meeting of our graduate student group and we had about 40 people in one zoom room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 187.163,
    "end": 190.045,
    "text": "And after a whole summer of seeing maybe four or five different faces,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.948,
    "end": 195.81,
    "text": " on a screen and being able to make pseudo eye contact with whoever you're talking to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 197.11,
    "end": 219.157,
    "text": "Yesterday was a bit of a bombardment of like visual sensory information, like searching for the person who was speaking and trying to tune out like the extra movements or drinks of a water bottle or like someone's pet on screen while also trying to pay attention to if someone had like a nod or raise their actual physical hand in a video.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 220.1,
    "end": 221.641,
    "text": " It was definitely an adjustment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.801,
    "end": 230.306,
    "text": "I was a lot more conscious of all of the interactions of everyone on the screen than I would have been had we been in a room in person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 233.413,
    "end": 239.296,
    "text": " Yeah, there's big differences between being with three people in a room and and 40 people in a room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.436,
    "end": 246.259,
    "text": "And so it shouldn't be surprising that there's differences between the kind of smaller video chat that we're having here and then the larger scale rooms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.44,
    "end": 251.222,
    "text": "But it's really hard to stay on top of everything when we don't get the full information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 252.242,
    "end": 254.584,
    "text": "And then I guess a last general question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.904,
    "end": 258.986,
    "text": "What is something that is new that you've experienced or learned about this week?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.007,
    "end": 263.748,
    "text": " If anyone has thoughts, or we can just continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 264.789,
    "end": 265.049,
    "text": "Ivan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.849,
    "end": 272.432,
    "text": "I can tell that in our company we have frequent meetings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.712,
    "end": 278.094,
    "text": "Each Monday morning we discuss about work issues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.556,
    "end": 302.289,
    "text": " This week I saw that the meeting goes different when different number of people involved in this meeting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.89,
    "end": 307.552,
    "text": "And it's very interesting why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 309.654,
    "end": 318.338,
    "text": " People who are absent now, how do they influence the meeting?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.718,
    "end": 329.803,
    "text": "And maybe they don't know about the influence while they are absent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.068,
    "end": 338.171,
    "text": " Interesting, yeah, with organizations, people can have influence whether they're in the room or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.431,
    "end": 346.636,
    "text": "So sometimes the communication ecology of the meeting room includes like people who are in a different room fundamentally,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.236,
    "end": 361.442,
    "text": " And then also because communication is so non-additive, it's non-linear, if you have a certain outcome with person A, B, C, and they have a dance party, and then you take away person C and there's no dance party, that doesn't mean that person C is the dance party.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.522,
    "end": 368.325,
    "text": "It just means there's some sort of emergent outcome with the three people who were there, and there's a different emergent outcome when somebody isn't there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.645,
    "end": 372.226,
    "text": "So how do we deal with that, this non-linearity of communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.866,
    "end": 376.588,
    "text": "And maybe even this paper might have some ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.987,
    "end": 382.089,
    "text": " So we are continuing our discussion of Vaisal et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.109,
    "end": 386.15,
    "text": "2020, A World Unto Itself, Human Communication as Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.851,
    "end": 396.495,
    "text": "And last time in our stream number three, we went over the goals, the abstract, the figures, and a few of the big ideas of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.155,
    "end": 397.815,
    "text": "Welcome, Sasha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.836,
    "end": 405.779,
    "text": "This time, we're going to be asking some follow-up questions and having continued discussion about the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.639,
    "end": 410.182,
    "text": " And so our first topic will be communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.222,
    "end": 419.108,
    "text": "And these were compiled questions from a bunch of people who submitted them to us or some things that we wanted to address in the first stream but didn't get a chance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.408,
    "end": 428.715,
    "text": "So anyone is welcome to pop in with whatever they want to say about one of the questions or follow up with an additional question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.235,
    "end": 434.72,
    "text": " But we'll just release them one by one so we can stay at least on topic with what we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.22,
    "end": 436.141,
    "text": "Oh, maybe not here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 436.682,
    "end": 437.803,
    "text": "Let's go to the first one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.483,
    "end": 440.405,
    "text": "So I think this was, Alex, your question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.845,
    "end": 448.572,
    "text": "There's cooperative, competitive or adversarial communication, and there's other kinds of communication, too, possibly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.853,
    "end": 452.496,
    "text": "So what are the kinds of communication that can be identified and how?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.983,
    "end": 460.406,
    "text": " What made you ask this question or what would be interesting to know about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.027,
    "end": 472.115,
    "text": "Yeah, because the paper that we are reading is about cooperative communication and everything is about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 472.835,
    "end": 485.445,
    "text": "But also it mentioned that it's possible and it's really true that it's possible that communication could be competitive in some situation between two people, between teams.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 486.886,
    "end": 496.171,
    "text": " And the question is what other types could be to be identified, maybe some kind of mix of these two types.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 497.132,
    "end": 510.58,
    "text": "And in case when communication is happening, how it is possible maybe to understand if it's really cooperative or it's changed in competitive in some moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 512.952,
    "end": 513.733,
    "text": " Great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.953,
    "end": 517.836,
    "text": "And is cooperative communication about the ends?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.276,
    "end": 527.322,
    "text": "If it results in cooperative behavior, is that cooperative communication or does cooperative communication entail turn-taking and feeling of cooperation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.583,
    "end": 534.427,
    "text": "Because the feeling of cooperation and turn-taking can be hijacked or used non-cooperatively, let's just say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.668,
    "end": 546.094,
    "text": " And then the sort of all's well that ends well approach might excuse some extremely inappropriate communication mechanics in service of a cooperative end goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.174,
    "end": 548.676,
    "text": "But who's cooperative end goal and how are they defining that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.116,
    "end": 550.377,
    "text": "So it's a big question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.397,
    "end": 556.08,
    "text": "Like, do we define communication by the mechanism and the details of the conversation itself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.22,
    "end": 558.021,
    "text": "Or do we define it by the context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.964,
    "end": 562.324,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 563.556,
    "end": 587.65,
    "text": " So if you consider it from some, again, from an engineering point, we need to have some kind of approaches to manage communication and to control it during its way to have predicted or expected results from it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 590.532,
    "end": 590.772,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.413,
    "end": 599.881,
    "text": "And I think that the general message passing or information sharing frameworks are almost broader than cooperation itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.522,
    "end": 607.829,
    "text": "The communication outline that's in active inference could be between a person and a tiger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.37,
    "end": 612.534,
    "text": "And that whether it's cooperative or not, could be kind of a lens that you apply to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.854,
    "end": 619.318,
    "text": " But the signals are certainly moving between the communicating agents, whether they think they're cooperating or they actually are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.759,
    "end": 623.181,
    "text": "So communication is sort of the fundamental.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.661,
    "end": 629.585,
    "text": "And then all these other adjectives get layered on top, depending on how we think about that kind of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.326,
    "end": 632.747,
    "text": "Any other thoughts on that first part?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.451,
    "end": 641.695,
    "text": " So if somebody wants to, they can always jump back or add non sequiturs, but we'll continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.735,
    "end": 661.431,
    "text": "Yeah, I want to add briefly and then thinking in the context of long term collaboration, it seems that communication would have to have signs of cooperativity at every stage along the way because there is no end that is obvious or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 663.308,
    "end": 667.892,
    "text": " you know, if you want a long term collaboration, you don't want it to end because of a miscommunication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.912,
    "end": 685.425,
    "text": "And how to focus on that kind of positive feedback without sinking into kind of the superficial signs of cooperation of where people simply feel that it is cooperative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 687.822,
    "end": 688.062,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.963,
    "end": 689.384,
    "text": "Good point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.184,
    "end": 692.887,
    "text": "This second quote speaks to that a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.047,
    "end": 698.753,
    "text": "It says, a single individual is necessary to obtain a low risk and low reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.454,
    "end": 703.938,
    "text": "And then collaboration appears as a riskier but more rewarding option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.659,
    "end": 730.776,
    "text": " So this is kind of within that prisoner's dilemma type game theory where individuals are, whether it's individual cells or eagles or birds or some other thing, it's being phrased as a question of action for the individual, whether they want to go their own way, whether that's considered defecting or it's just the baseline state to be individuated and obtain with a higher probability, a smaller reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 731.177,
    "end": 733.198,
    "text": "Like I could work for $10 an hour by myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.64,
    "end": 750.191,
    "text": " Or collaboration opens the door to potentially win-win collaborations where you make on average more than $10 an hour because you worked with multiple people and you allowed your specialization and your perspectives to contribute to a shared value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.591,
    "end": 753.073,
    "text": "However, it may be the case that this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.874,
    "end": 755.795,
    "text": " collaboration is also riskier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.216,
    "end": 761.739,
    "text": "And so I think, Alex, again, you asked, what types of risk can be identified in a communicative setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.339,
    "end": 769.384,
    "text": "And how could we quantify such risks, especially if we were going to quantify them using the way of thinking of active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.667,
    "end": 773.947,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 774.687,
    "end": 776.188,
    "text": "Again, it's about, for me,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 778.308,
    "end": 799.75,
    "text": " if we speak about collaboration and collaboration is based on communication and first risk is not to have alignment at the end of communication but what possible kind of risks could be arised additionally for example to take",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 801.546,
    "end": 829.029,
    "text": " wrong direction for communication and maybe if such kind of list could be prepared if there are any possible way to quantify it in terms of active inference framework and in terms I don't know maybe some kind of epistemic values or something like this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 831.876,
    "end": 851.197,
    "text": " To have a bit of an addition to that, to bring it back to FEP and minimization of uncertainty, how do we determine kind of a good enough alignment, like something that is appropriate for the goal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 852.679,
    "end": 860.705,
    "text": " Because you could imagine that there's collaborations where you don't feel very aligned, but it's a low stakes situation at the start.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 861.125,
    "end": 870.753,
    "text": "And at the end, you feel that your values or goals weren't really aligned, but you still did the task that you were trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 872.594,
    "end": 876.918,
    "text": "And perhaps that's not the best case scenario, but it's a realistic one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 878.479,
    "end": 878.639,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.14,
    "end": 880.721,
    "text": "And de-risking communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.921,
    "end": 885.725,
    "text": "So for example, and there's many kinds of risks that can be identified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.765,
    "end": 887.247,
    "text": "So maybe I'll start with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.307,
    "end": 897.695,
    "text": "Like there's the risk that you end up trusting somebody who ends up leaking your information or directly causing an action to you or to a project that is deleterious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.916,
    "end": 902.059,
    "text": "Somebody who causes your time to be spent inefficiently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.08,
    "end": 905.282,
    "text": "There's all these kinds of risks of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.322,
    "end": 913.149,
    "text": " of biting off a bigger chunk with the help of the team, but then the chunk that you bite off is the wrong one, or you fail to bite off the chunk if it is the right one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.729,
    "end": 916.412,
    "text": "And then how do we quantify such roots?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 916.472,
    "end": 926.821,
    "text": "I like that idea, Alex, of sort of like a checklist manifesto, but from the active inference potential applications and asking,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.992,
    "end": 935.536,
    "text": " More specifically, what kinds of things can we discuss as a team that reduce our uncertainty about this and this and this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.997,
    "end": 939.098,
    "text": "And I think that's definitely one of the directions we're moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.158,
    "end": 950.345,
    "text": "So maybe we can keep that kind of question in mind and think about what are these best practices for teams at the onset or in the middle or in the closing of even a little phase of their collaboration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.945,
    "end": 962.971,
    "text": " What are these questions or provocations that teams could take on that would de-risk their communication and improve the throughput potentially in a way that could be lending itself towards being formalized?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.111,
    "end": 965.352,
    "text": "Yeah, I have a thought on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 966.533,
    "end": 975.817,
    "text": "This kind of sounds like the Grice's maxims where what you say like in communication, one maxim is like relevance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 975.837,
    "end": 977.118,
    "text": "It needs to be relevant to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 978.437,
    "end": 980.778,
    "text": " the conversation or to whatever you're referring to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 982.319,
    "end": 989.741,
    "text": "And I think it's either quantity or quality where you need to say just enough that your message gets across, but not too much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 990.882,
    "end": 994.763,
    "text": "And this is like also something that you're inferring on your communicative partner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 997.972,
    "end": 1006.519,
    "text": " Very cool, I looked up these Grice's maxims, G-R-I-C-E is the last name, and the four of them, just to clarify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1006.859,
    "end": 1012.743,
    "text": "The maxim of quantity, which is be as informative as you possibly can without any more information than needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.064,
    "end": 1018.548,
    "text": "The maxim of quality, which is being truthful and not giving information that's false or not supported by evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.028,
    "end": 1024.21,
    "text": " The maxim of relation, where one tries to be relevant and say things that are pertinent to discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.61,
    "end": 1032.353,
    "text": "And then the maxim of manner is the fourth and last one, where one tries to be clear, brief, and orderly without obscurity or ambiguity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.793,
    "end": 1034.534,
    "text": "So these are really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.594,
    "end": 1039.736,
    "text": "It reminds me of the truth, the whole truth, nothing but the truth from the justice system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.116,
    "end": 1044.638,
    "text": "And also these are great reminders in all sorts of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.518,
    "end": 1058.102,
    "text": " especially ones that are potentially recorded or for consumption, where the kinds of vocal pauses that are played off as irrelevancies in conversation become magnified a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.482,
    "end": 1064.804,
    "text": "And good public speaking is a challenge because having these cognitive maxims at the top of our mind prevents us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.424,
    "end": 1070.512,
    "text": " from thinking the topic itself, unless it's a situation, thankfully, where you're talking about the maxims themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.053,
    "end": 1078.745,
    "text": "So it's hard to speak directly and with high relevantness and quality and quantity when all these other things are happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.642,
    "end": 1081.983,
    "text": " So very interesting connection there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.903,
    "end": 1086.684,
    "text": "And it would be a way to de-risk communication by using these maxims.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.465,
    "end": 1088.465,
    "text": "So third point here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.285,
    "end": 1094.467,
    "text": "Communicative constructions, we'll just use CC, are patterned pairings of form and meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.147,
    "end": 1099.509,
    "text": "Could we formally join communicative constructions with narrative and ontologies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.269,
    "end": 1102.57,
    "text": "Or what other kinds of CC could we use?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.673,
    "end": 1131.498,
    "text": " yeah as for this question is communicative construction looks like a well-developed area and it's defines pairing of forms and meaning so it could be different forms and it's always i think connect to some meaning and as we develop in our our",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1132.998,
    "end": 1160.436,
    "text": " directions and discusses narratives and ontologies if we'll find a way to join it with communicative construction and define it this way it could be more useful to discuss with other parties so and the next step is what other types of construction could we see or define or find else to be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1161.893,
    "end": 1167.215,
    "text": " formal so we could use it in a more efficient way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1169.396,
    "end": 1169.656,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.056,
    "end": 1174.037,
    "text": "It reminds me of just regular constructions and there are specific kinds of constructions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.057,
    "end": 1184.541,
    "text": "There's bridges and doorways and all these things and sometimes there's overlap or there's an object that's a chair and a bridge because you can sit on it but the point is they're still constructed and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.481,
    "end": 1192.749,
    "text": " when we're talking about communicative constructs like turn-taking or these other, like what is a bridge for communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.069,
    "end": 1205.863,
    "text": "What are these constructs that are not just there in nature waiting to be discovered, but what are these constructs that we're going to implement in the world, ideally to get from here to there, to get from not knowing to knowing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.423,
    "end": 1207.544,
    "text": " And what are these constructs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.644,
    "end": 1213.408,
    "text": "And what would be an ontology or a framework for the knowledge to discuss these kinds of constructs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.849,
    "end": 1215.49,
    "text": "Instead of just saying, well, it's a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.89,
    "end": 1218.532,
    "text": "There's no more detail I can provide than it's a discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.892,
    "end": 1220.073,
    "text": "Are there types of discussion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.413,
    "end": 1224.536,
    "text": "Are there types of dialogue that might be able to be more useful in one place or another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.797,
    "end": 1227.138,
    "text": "Just like a bridge would make sense here, but not here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.179,
    "end": 1229.12,
    "text": "So cool question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.4,
    "end": 1231.662,
    "text": "And then last question on the communication slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.93,
    "end": 1242.419,
    "text": " There was a note about diversification of communicative systems across time, space, and speaker communities, as well as species, we could add.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.04,
    "end": 1248.625,
    "text": "Which communication systems can be identified in relationship to teams and organizations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.994,
    "end": 1274.104,
    "text": " Yes, and again for me it's open question and trying to see perspective to have this approach to describe possible way and possible communication systems what could be useful for teams and organization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1275.184,
    "end": 1278.946,
    "text": "And here as we see is related to time and space.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1279.972,
    "end": 1293.219,
    "text": " And so it could be about time scales and organization also could be possible like space and could be present in different countries.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1293.619,
    "end": 1301.584,
    "text": "So we still need to have options to communicate and so define system in use for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1303.525,
    "end": 1309.268,
    "text": "So it's directions for future development of our work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1310.862,
    "end": 1311.122,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.322,
    "end": 1312.503,
    "text": "Any other notes on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.945,
    "end": 1323.309,
    "text": "Just from the chat, and this was in response, I believe, to something that Sasha mentioned about how good is good enough for the team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.93,
    "end": 1335.657,
    "text": "RJ wrote, because there are opportunities for signal error, can the longevity of cooperation be assessed by goodness of fit between self-reporting of participants' concerns about risk of miscommunication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.457,
    "end": 1338.438,
    "text": " And so this is a pretty meta comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.798,
    "end": 1344.34,
    "text": "It's asking instead of a let's say an annual progress checkup on how happy or how satisfied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.38,
    "end": 1347.121,
    "text": "And if the satisfaction is going up, then it's getting better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.161,
    "end": 1349.062,
    "text": "If the satisfaction is going down, it's getting worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.582,
    "end": 1355.384,
    "text": "This is like asking the participants to self-report on their perception of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.044,
    "end": 1357.585,
    "text": " risk of miscommunication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.065,
    "end": 1365.571,
    "text": "And so you could ask the employee, how well do you think the communication channel is between you and your supervisor or vice versa?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.211,
    "end": 1375.097,
    "text": "And then by potentially maintaining the longevity of the group, which is a success in and of itself because of the many opportunities for failure of groups,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.238,
    "end": 1389.282,
    "text": " Beyond longevity, we could actually improve the self-report of the precision of the communication rather than trying to do this ultimately futile optimization on satisfaction because that's a moving target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.662,
    "end": 1392.462,
    "text": "But something that we can latch onto is precise communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1393.083,
    "end": 1402.565,
    "text": "And precise communication within the context of an aligned narrative for the team or the organization would ultimately potentially lead to satisfaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.925,
    "end": 1404.406,
    "text": "So interesting point by RJ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.626,
    "end": 1407.427,
    "text": " Any thoughts before we move forward?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.028,
    "end": 1410.228,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.288,
    "end": 1413.589,
    "text": "So this is what you all came here for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.37,
    "end": 1416.711,
    "text": "Someone was told there would be baby pictures on the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.511,
    "end": 1421.813,
    "text": "Here's a quote from the paper to get us thinking about development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.257,
    "end": 1436.882,
    "text": " They wrote, human infants only appear satisfied following a communicative bid when their own communicative partner has aligned their mental states with their own with respect to the infant's intended reference and some citations there to follow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.502,
    "end": 1441.183,
    "text": "So what does that quotation mean or what does anyone think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.608,
    "end": 1451.289,
    "text": " Here's the questions that we can ask about development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.209,
    "end": 1458.13,
    "text": "The first question is, how or when does a child learn to align mental states to satisfy communicative bids?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.85,
    "end": 1467.291,
    "text": "The second question, what we can, you wanna, does anyone have thoughts on the first question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.312,
    "end": 1471.532,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.612,
    "end": 1474.913,
    "text": "Go ahead.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1475.013,
    "end": 1476.413,
    "text": "Kind of as a corollary to,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1479.827,
    "end": 1488.571,
    "text": " Yeah, as I was reading it, I was really trying to parse through the development of this process, like the ontogeny of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1489.131,
    "end": 1498.396,
    "text": "And because there is a maturation of how cooperative communication happens that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1501.793,
    "end": 1506.439,
    "text": " There should also be a start when you learn to align your mental states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1506.899,
    "end": 1513.287,
    "text": "But of course, upon reading the paper again and, you know, working through all the baby references.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1516.731,
    "end": 1517.692,
    "text": "The author states that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1521.32,
    "end": 1523.281,
    "text": " You never actually learn to do this process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.802,
    "end": 1529.645,
    "text": "It's part of the adaptive priors for alignment that humans are endowed with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1530.305,
    "end": 1534.028,
    "text": "So perhaps I can already answer that first question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.498,
    "end": 1537.478,
    "text": " So the answer is how or when.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.059,
    "end": 1539.979,
    "text": "The when, it sounds like it's continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.319,
    "end": 1542.46,
    "text": "It's always a continuous process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.14,
    "end": 1547.361,
    "text": "And then how is kind of the broad topic of development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.621,
    "end": 1549.181,
    "text": "How does language develop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.221,
    "end": 1550.201,
    "text": "How does culture develop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.721,
    "end": 1556.223,
    "text": "And then I thought the point that you made about an evolutionary prior is very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.363,
    "end": 1557.923,
    "text": "And it's also a challenging question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.243,
    "end": 1574.844,
    "text": " question to ask what exactly this prior is and that's why so much of the paper is about it because it's pretty clear that we don't have a prior for any specific language in the sense that a baby who is growing up around no language will fail to develop linguistic capabilities in this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.025,
    "end": 1580.626,
    "text": " Whereas any child raised in a different linguistic setting will take on that language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.886,
    "end": 1588.228,
    "text": "So there's a prior that language will be communicated, but it's almost a prior that's above the level of the specific language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.808,
    "end": 1599.19,
    "text": "Yet there seem to be things about our evolutionary prior, like grammar or structure or certain types of logical relationships that are harder to change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1599.37,
    "end": 1599.61,
    "text": "Shannon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.386,
    "end": 1612.693,
    "text": " not to be contrarian, but I'm going to be a little contrarian, is we talk a lot about language or maybe there's some innate prior that will develop language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1613.254,
    "end": 1619.278,
    "text": "But there's something that happens even before language, and that's the rhythm of development in the womb.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1619.878,
    "end": 1623.661,
    "text": "So you have these bipedal rhythms of the mothers walking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1623.841,
    "end": 1626.743,
    "text": "You have rhythms of the heartbeat, breathing rhythms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1627.383,
    "end": 1645.066,
    "text": " And these are these like very embodied forms of not necessarily communication at that stage, but it is signaling to the infant in the womb, like whether the situation is stressful or not for the mother and thus for the new, not yet born infant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1645.086,
    "end": 1648.367,
    "text": "And then once you're born, you're holding the infant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1648.407,
    "end": 1650.267,
    "text": "There's a lot of skin to skin contact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1650.307,
    "end": 1654.268,
    "text": "So you're still maintaining this, not quite communication, but this,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1655.27,
    "end": 1678.676,
    "text": " balance of the mother's heart rhythms or breathing rhythms to the infants and then slowly externalizing that to gaze relationships or to like when you're playing with the baby's hands, you know, you're holding their hands, maybe moving them and then slowly just externalizing these rhythms into more and more communicative acts and less sort of direct embodied relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1680.617,
    "end": 1680.897,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1681.037,
    "end": 1681.297,
    "text": "Yvonne?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.427,
    "end": 1699.352,
    "text": " I want to say that toddlers have very limited set of mental states and to align with its state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.101,
    "end": 1740.938,
    "text": " their vis-a-vis can do this alignment more simple rather than we talk about all the people who has more broad mental states more broad set of their internal states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.662,
    "end": 1746.904,
    "text": " Yep, and we can come back to that when we get to the attunement question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.544,
    "end": 1759.03,
    "text": "Shannon, I really liked how you described the continuum from really the communication that is related to rhythm of the heart and the maybe circadian rhythms in the blood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.39,
    "end": 1769.015,
    "text": "So very slow rhythms and rhythms that are transmitted through tactile stimulus through the womb, as well as chemical or neural type relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.475,
    "end": 1772.237,
    "text": "And then it's like this gradual disconnection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.577,
    "end": 1782.362,
    "text": " where as the physical touch is replaced by the gaze, and then adults tend to have more of a barrier physically between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.983,
    "end": 1787.665,
    "text": "At least that's coming from a culturally specific place, but maybe it still does hold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.765,
    "end": 1793.048,
    "text": "It's rare to see adults touching each other as much as, for example, a mother and an infant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.528,
    "end": 1804.156,
    "text": " And so the second question, how does it relate this development of communication through these different modalities and from things that barely seem communicative, things that almost seem physiological?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.557,
    "end": 1814.424,
    "text": "But then in the end, if we're communicating about what's for dinner, isn't that also a physiological communication that reduces our uncertainty about where nutrition is coming from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.945,
    "end": 1819.849,
    "text": "So is it that different than a pre-linguistic cry for milk?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.589,
    "end": 1824.671,
    "text": " And then how does it relate to this way in which adults understand each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.811,
    "end": 1832.854,
    "text": "And then it reminds me also of these different modalities of therapy and even thinking about like Maslow's hierarchy of needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1833.374,
    "end": 1838.876,
    "text": "The idea that the end all be all is the linguistic expression, I'm sorry or I'm happy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.396,
    "end": 1843.678,
    "text": "That's kind of the tip of the iceberg for linguistically capable adults.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1844.178,
    "end": 1846.379,
    "text": "But what is that embodied iceberg?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.559,
    "end": 1847.94,
    "text": "What is the actual thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.92,
    "end": 1869.893,
    "text": " that we're trying to communicate what's the territory not just the linguistic map and then how does this relate to the communication or other issues that adults have and we want to work it out and then are we going to use our words are we going to use our uh lower goals of the maslow's hierarchy lower chakras we get physical for better or for worse",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.798,
    "end": 1883.472,
    "text": " And just to get to the last question on this development slide, what are some linguistic characteristics of cooperative communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.943,
    "end": 1903.571,
    "text": " This relates a bit to earlier our discussion about is cooperative communication characterized by the mechanics like polite turn-taking or relevant sharing of information?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.272,
    "end": 1906.693,
    "text": "Are they defined by the end goal?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.993,
    "end": 1914.959,
    "text": "So cooperative communication is all's well that ends well, or is it something else like something ethical or something normative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.379,
    "end": 1923.821,
    "text": " Like, cooperative communication is when you follow those four maxims of good communication, even if you're impolite about it or it leads to a non-cooperative end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.301,
    "end": 1924.661,
    "text": "For who?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.222,
    "end": 1929.823,
    "text": "As long as you abide by these conversational rules, then it's going to be a cooperative communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.583,
    "end": 1934.224,
    "text": "What are some of these linguistic characteristics, if any?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.364,
    "end": 1938.625,
    "text": "Or what are the characteristics of cooperative communication that go beyond linguistics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.926,
    "end": 1947.166,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.986,
    "end": 1949.407,
    "text": "Go ahead, Sasha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.047,
    "end": 1951.487,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1953.068,
    "end": 1972.094,
    "text": "Kind of, well, yeah, sort of relevant to this question, but the first question on the slide made me think about other alternative states or abilities of communication so that children who",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1973.29,
    "end": 1994.048,
    "text": " uh grow up not being able to hear or speak or see for any number of all right looks like we had a brief little disrupt and so i'm just going to send a link to get the rest of our colleagues back into here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.319,
    "end": 2001.512,
    "text": " While they are getting back in, I'm going to go back to sharing our screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2001.993,
    "end": 2006.162,
    "text": "So we were just having Sasha talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.355,
    "end": 2012.4,
    "text": " the developmental characteristics of cooperative communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.661,
    "end": 2020.608,
    "text": "And yes, yep, sorry, something definitely did go wrong there, but we're on part two of 3.5, 3.5.2, c'est la vie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2020.628,
    "end": 2022.09,
    "text": "And we are continuing on the development slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.934,
    "end": 2036.176,
    "text": " And as people join in, we'll be ready to move on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.897,
    "end": 2040.258,
    "text": "Yep, Sasha, something definitely blipped a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.899,
    "end": 2046.641,
    "text": "Alex, if you could message Shannon just to make sure that she knows that we'll use this link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.001,
    "end": 2048.382,
    "text": "We are back live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.942,
    "end": 2054.364,
    "text": "So continuing with what you were saying, Sasha, about the linguistics and cooperation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.505,
    "end": 2059.066,
    "text": "It's like it knew I was going to say something wrong, so it cut me off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.572,
    "end": 2083.705,
    "text": " um yeah so to that point i i think the linguistic characteristics um at the very least would look like a back and forth um such that the communication would be happening um on multiple scales that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.485,
    "end": 2090.29,
    "text": " people are communicating, but also getting feedback within their short blips of communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.75,
    "end": 2104.822,
    "text": "And that kind of reminds me of the checklist or the multiple scales of communication for teams that we brought up earlier, but maybe that's kind of like the baby steps of developing communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2106.443,
    "end": 2107.424,
    "text": "Yep, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2108.371,
    "end": 2111.492,
    "text": " And Alex, you've sent the message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.473,
    "end": 2112.773,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.573,
    "end": 2119.235,
    "text": "So let's get to the question of attunement and whenever she rejoins, we'll just hop in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.475,
    "end": 2121.776,
    "text": "So here's a quotation from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.032,
    "end": 2139.7,
    "text": " The hypothesis here is then that repeated couplings between infants and children with adults and more experienced peers may cause the prior beliefs of inexperienced individuals to converge more towards the hidden causes generating sensory consequences, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.72,
    "end": 2143.482,
    "text": "the mental states of more experienced others, rather than the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.383,
    "end": 2152.347,
    "text": "That is, coupled action perception cycles in such dyads tend to be characterized by an asymmetric entrainment of prior beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.308,
    "end": 2154.77,
    "text": " What does this mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.031,
    "end": 2158.857,
    "text": "What is the most just foundational interpretation of this question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.977,
    "end": 2163.464,
    "text": "And then how does this relate maybe to the infant adult dyad communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.041,
    "end": 2171.961,
    "text": " I'll just start with the base interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.322,
    "end": 2175.062,
    "text": "So we're talking about... Hey Shannon, welcome back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.082,
    "end": 2175.682,
    "text": "Sorry about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.062,
    "end": 2183.544,
    "text": "We're talking about these communicative dyadic situations between two or multiple agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.244,
    "end": 2192.866,
    "text": "And we're referring to one of the individuals as more experienced and one of them as relatively inexperienced in the context of some niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.266,
    "end": 2195.988,
    "text": " So it isn't that one is closer to absolute truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.008,
    "end": 2197.81,
    "text": "That's not that babies are closer to absolute truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.87,
    "end": 2199.791,
    "text": "It's not that the adult is closer to absolute truth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.191,
    "end": 2209.378,
    "text": "It's that one of these individuals has had more experience in a certain informational niche and also might have a higher degree of precision on their beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2209.779,
    "end": 2217.945,
    "text": "And that could be an example of this evolutionary hyper prior, which is like the temperature on decision making of a young person starts high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.405,
    "end": 2219.106,
    "text": "So you could tell them,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2219.386,
    "end": 2224.212,
    "text": " Yep, the sky is like a fabric and the sun is carried by a chariot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.933,
    "end": 2229.319,
    "text": "And that explains, it reduces their uncertainty about the path of the sun in the sky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.339,
    "end": 2235.546,
    "text": "And so potentially that is taken up by the younger or the more inexperienced individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.167,
    "end": 2248.27,
    "text": " Whereas somebody who had very high precision on what the sun was, whether they thought it was a car or a nuclear reactor or something, that person is going to be harder to move into a new narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.79,
    "end": 2255.332,
    "text": "And so when you have an experienced and an inexperienced individual, or for that matter, a stubborn and an open minded individual,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.152,
    "end": 2263.195,
    "text": " because of the asymmetries, you're going to get this type of asymmetric, this differential outcome through the communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.715,
    "end": 2270.337,
    "text": "And here it's being described as the inexperienced individual converging to the priors of the experienced one and not vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.997,
    "end": 2272.678,
    "text": "So any thoughts on that one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.553,
    "end": 2281.398,
    "text": " And this relates to figure 5a, which we discussed in our last discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.139,
    "end": 2287.465,
    "text": "But here we have the two birds, the relatively experienced one and the inexperienced one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.045,
    "end": 2297.796,
    "text": "And here, experience is represented by higher value of this order parameter on the y-axis, such that a high level of experience in singing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.857,
    "end": 2305.022,
    "text": " is correlated with a high order parameter reflecting a very accurate ability to perform turn taking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.482,
    "end": 2310.286,
    "text": "And that would relate to optimal flow of information if the turn taking were optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.547,
    "end": 2314.149,
    "text": "Like if one person started talking right when the other person stopped talking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.83,
    "end": 2328.473,
    "text": " And then when we're in this learning alone paradigm with the shaded confidence intervals of the two birds, we see that the order paradigm, how ordered the two birds are relative to each other just drops off as a function of bouts of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.913,
    "end": 2336.175,
    "text": "And we were thinking about this, like the two recording studios, the two individuals are singing a call and response song, but they're not synchronized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.182,
    "end": 2340.963,
    "text": " And so through their singing, they end up desynchronizing through no fault of their own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.723,
    "end": 2353.205,
    "text": "However, when you're having a sensory coupling and a deep prior that you want to be aligned with your conversant or with your communicative partner, that's learning together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.385,
    "end": 2358.646,
    "text": "You need the sensory coupling and you also need this prior that you want to be aligned on your mindset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.147,
    "end": 2365.228,
    "text": "And then we see that the blue line becomes asymmetrically entrained more to the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.888,
    "end": 2367.729,
    "text": " green line than the other way around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.869,
    "end": 2376.754,
    "text": "And we talked about that, how the green line looks a little bit like it's going down, almost like the blue line induces somewhat of a disordering of the green line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.294,
    "end": 2382.457,
    "text": "And we asked whether that was reflected or not by the kinds of communications that we see with adults and with humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.421,
    "end": 2389.862,
    "text": "Any thoughts on this attunement slide?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.902,
    "end": 2391.222,
    "text": "We have one more attunement slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.923,
    "end": 2392.143,
    "text": "Sash?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.315,
    "end": 2395.196,
    "text": " Yeah, thank you for explaining that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.296,
    "end": 2417.143,
    "text": "That was my question in understanding this rather long sentence and just getting to why it is building towards the state of the more experienced partner rather than the other way around because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2420.339,
    "end": 2437.144,
    "text": " Yeah, and adding in the precision of an open-mindedness versus stubbornness, that really helps to kind of help better understand why it's moving in one direction versus the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2437.464,
    "end": 2449.727,
    "text": "Because the parameter in this graph is not just an arbitrary value of how much you're like one thing or another, but it's about your precision on what you're doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2452.455,
    "end": 2452.735,
    "text": " Shannon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.476,
    "end": 2472.465,
    "text": "Yeah, to follow up on that, there's also, like if this was a graph that was showing oscillations around the steady state instead of the graph that it is, like you might actually see smaller oscillations in this top partner because they're sort of converging on a steady state already.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2472.485,
    "end": 2479.448,
    "text": "And this blue partner might have like very wide oscillations until they start to find the similar steady state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2481.604,
    "end": 2507.483,
    "text": " yes definitely true this is averaged out and has the confidence interval but then in the context of real learning or potentially niche entrainment it's not just this step by step there's periods of stasis and oh i get it and then you jump up it's a quantum change in comprehension or there's an overshoot somebody oh they were too eager on this one and then they go too far to the other side but then we're able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.243,
    "end": 2514.335,
    "text": " look at the error residual, and then hopefully reducing the error is what gets us to precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2514.796,
    "end": 2517.321,
    "text": "So a cool way to see it here visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.41,
    "end": 2523.632,
    "text": " Let's think a little bit more about attunement with this other quote from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.252,
    "end": 2528.573,
    "text": "They wrote, human individuals appear characteristically, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2528.653,
    "end": 2536.836,
    "text": "species typically, we can discuss that, to be endowed with an adaptive prior that one's mental states are aligned with those of conspecifics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2537.396,
    "end": 2538.236,
    "text": "What does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.496,
    "end": 2541.237,
    "text": "Just what is the first level interpretation of that sentence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.377,
    "end": 2544.238,
    "text": "And then what about our priors are adaptive and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.578,
    "end": 2545.659,
    "text": " Can they go wrong?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.78,
    "end": 2549.804,
    "text": "And then what about that is species typical with respect to humans?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.268,
    "end": 2554.869,
    "text": "Any thoughts there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2556.926,
    "end": 2564.328,
    "text": " And I also added in a replicate of the Kapheim figure about Tinbergen's four questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.788,
    "end": 2571.07,
    "text": "Just a reminder that we're always thinking about these multiple versions of Y at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.13,
    "end": 2573.111,
    "text": "So why do humans do X?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.491,
    "end": 2575.612,
    "text": "Or why does X appear in life?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.212,
    "end": 2579.673,
    "text": " These are questions that are going to have multiple kinds of answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.093,
    "end": 2582.494,
    "text": "So we're not looking for an exclusionary answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.874,
    "end": 2593.558,
    "text": "We want to understand whether our answer is actually striking at the level of causation of utility of ontogeny development or at the level of evolution itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.539,
    "end": 2600.741,
    "text": "So any thoughts on either responding within the context of one of these four squares or just what the sentence means?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.383,
    "end": 2619.327,
    "text": " So in differentiating human communication from non-human primate and other species in the paper, what happened a lot was this discussion about the humans wanting to have their mental states aligned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.607,
    "end": 2625.049,
    "text": "And we saw that in the previous quote, like the baby isn't satisfied until the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.189,
    "end": 2629.251,
    "text": " mental state is aligned until it believes that the mental state is aligned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.331,
    "end": 2641.86,
    "text": "And I think it was Shannon who brought up this something where if somebody gets the right food for you from the grocery store, but you think that they were misinformed about something else, it's almost like it's not good enough for us to get what we asked for at the grocery store.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.221,
    "end": 2648.025,
    "text": "We really want to make sure that they also knew exactly at a deeper level why we were wanting that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.605,
    "end": 2651.687,
    "text": "And so this question about the humans being",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.347,
    "end": 2657.069,
    "text": " endowed with a prior that we want to be aligned at a mental state level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.549,
    "end": 2660.631,
    "text": "I'll just first start with the species specific question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.171,
    "end": 2675.458,
    "text": "I wonder if in a wolf pack or in an ant colony, although one could debate to what extent these mental states are aware or something like that, that's a little bit on the qualia end of the spectrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.958,
    "end": 2680.381,
    "text": "I would still say that in these groups, be it insect or other mammals,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.361,
    "end": 2685.883,
    "text": " these individuals do benefit from having the mental state of the pack aligned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.383,
    "end": 2693.165,
    "text": "And so in that respect, I wonder if they also have an adaptive prior that their mental states would be aligned with conspecifics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.347,
    "end": 2710.132,
    "text": "That's actually interesting bringing up, like animals is intuitive or wolf packs, because we have dogs and we can see they try to align maybe something about their emotional state with their human owners or with other dogs you have in your house.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2710.212,
    "end": 2710.932,
    "text": "And you can see that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2711.687,
    "end": 2719.292,
    "text": " maybe with wolves, but when you bring up ants, that's interesting because outside of like the movie Ant-Man, you don't really prescribe emotions to them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2720.852,
    "end": 2729.798,
    "text": "But there's definitely an alignment of their action states, like in terms of which chemical pathways they're going to follow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2729.818,
    "end": 2738.463,
    "text": "And when they leave these chemical traces that say, there's definitely food here, more and more ants travel, there's more and more chemical traces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2738.523,
    "end": 2740.144,
    "text": "And as the food's depleted, the trace",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2740.916,
    "end": 2741.416,
    "text": " goes away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2741.557,
    "end": 2752.706,
    "text": "So even though there's that really close physical proximity, there's still some knowledge of the other ant's mental states in their coordinated behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.887,
    "end": 2763.415,
    "text": "And so it's interesting to kind of make that jump from behavior to actually ascribing, I want my mental state to match yours in some way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2764.747,
    "end": 2774.975,
    "text": " And the way that that gets manifested through feedback with the environment or stigmurgy in the social insects, the way that somebody might decorate a tea room and it's very serene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2775.175,
    "end": 2780.799,
    "text": "It's like, when you're in this space, I want you to be synchronized on this mental alignment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.839,
    "end": 2783.181,
    "text": "This is a sacred space, or this is a messy spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.682,
    "end": 2793.949,
    "text": "And then similarly, when we're just talking about the traces in the ant colony, which fundamentally are serving to reduce the uncertainty of the colony about where to get food in that case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.79,
    "end": 2808.915,
    "text": " And the way that the ants can communicate with each other is through a direct touch, tactile touch and olfaction, as well as these long-term traces, which can potentially generate something like collective mental state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.335,
    "end": 2811.635,
    "text": "And so these are really interesting questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.675,
    "end": 2813.756,
    "text": "Like, does the worker ant have a prior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.836,
    "end": 2818.498,
    "text": "Is that the mental state that's being shared or does it want it to be shared?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.958,
    "end": 2819.558,
    "text": "Or is it that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.078,
    "end": 2827.004,
    "text": " individuals who act in a way that lead to coherent colonies, we end up seeing them over evolutionary time more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.445,
    "end": 2832.589,
    "text": "So it's almost independent of whether there's this experiential component to the adaptive prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2833.13,
    "end": 2838.875,
    "text": "It's almost whether it is adaptive is this sort of circular question, kind of like survival of the fittest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.175,
    "end": 2842.758,
    "text": "We're going to see packs of animals or packs of single cell bacteria or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.579,
    "end": 2848.944,
    "text": " insects that end up having aligned and adaptive and effective communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.665,
    "end": 2851.046,
    "text": "And then what does that actually tell us?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.066,
    "end": 2853.128,
    "text": "Because we're only going to see those systems persist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2853.568,
    "end": 2863.036,
    "text": "We're only going to see communication as a dysfunction in mostly functional systems because things just didn't randomly show up here one way or the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.299,
    "end": 2871.283,
    "text": " I think you nailed it with that statement, that it's a circular argument in a way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2871.523,
    "end": 2873.825,
    "text": "I was thinking about that rereading the paper as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.245,
    "end": 2877.347,
    "text": "It's like, wow, this sounds just too clean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2878.328,
    "end": 2882.831,
    "text": "It all kind of makes sense in the direction that this argument's going.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2885.733,
    "end": 2888.055,
    "text": "And back to the point about...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2891.348,
    "end": 2910.561,
    "text": " how we as humans interpret what other species are doing to be communicative cooperation or not is you know a whole other question because if it's furthering their means as a species then they're cooperating the right amount.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.042,
    "end": 2915.924,
    "text": "There's a line about how even great apes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.771,
    "end": 2924.078,
    "text": " they do pointing, but in a way that's not communicative cooperation, but more selfish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2925.019,
    "end": 2935.591,
    "text": "And I wonder if that's just kind of a human, our human species bias on how other species communicate, but not as good as we do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2937.179,
    "end": 2937.359,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.84,
    "end": 2952.572,
    "text": "And to bring this actually to narratives and narrative attunement, the action patterns from a mechanical standpoint that humans are being asked to do by each other are too complicated to just be hard coded or directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.772,
    "end": 2954.894,
    "text": "You can't say, hey, move your left hand a little bit up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.235,
    "end": 2956.376,
    "text": "OK, now go a little bit down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.816,
    "end": 2957.837,
    "text": "Now go back to where you were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2957.877,
    "end": 2962.541,
    "text": "OK, so you can't tell someone, here's how you draw the letter A. OK, now here's how you draw the next letter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.941,
    "end": 2963.402,
    "text": "You tell them,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.962,
    "end": 2971.368,
    "text": " The next level of would be write the word Alexandra, and then they're going to interpret that, unpack that in their own way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.788,
    "end": 2979.254,
    "text": "And then an even higher level of narrative attunement would be like, I want you to do this, or here's why it's important that you should do this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.695,
    "end": 2986.881,
    "text": "And so if you can get people to be aligned at the, here's why it's important to go out and do community service towards this end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.321,
    "end": 2999.146,
    "text": " then they're going to figure out all the details with getting in and out of the car and turning left at the stoplight and coming to all these details that you would spend your whole life trying to micromanage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.566,
    "end": 3007.35,
    "text": "If you can provide narrative attunements, then each individual agent is going to unpack that in their own niche in a way that makes sense to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.85,
    "end": 3009.491,
    "text": "And so it's a very high leverage point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.191,
    "end": 3017.354,
    "text": " to be able to specify and attune narratives because people who are narratively aligned with you will act in a similar way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.454,
    "end": 3023.197,
    "text": "They'll respond to stimuli in a way that's similar to yourself or at least beneficial in a broad coalition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.637,
    "end": 3032.701,
    "text": "And that's a avenue or a vector for attunement of action in humans that is not as developed potentially in other species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.221,
    "end": 3036.042,
    "text": " which comes back to this question about human-specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.422,
    "end": 3040.923,
    "text": "Is it really human-specific to be having an adaptive prior that communication is useful?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3041.483,
    "end": 3044.564,
    "text": "Well, it's different in degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.104,
    "end": 3057.348,
    "text": "There's no other species with such an extent of digital or written communication, but is it really different in type when we have turn-taking, rhythmic coordination across the animal and even non-animal kingdom?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.55,
    "end": 3060.232,
    "text": " So cool stuff there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.892,
    "end": 3065.197,
    "text": "Any thoughts on attention or on attunement before we get to attention?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.659,
    "end": 3079.33,
    "text": "I just want to say maybe should we or is it possible to separate maybe for like a signal level?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3080.316,
    "end": 3083.178,
    "text": " and for, I don't know, content level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3083.998,
    "end": 3096.967,
    "text": "So to have a good attunement you first, for example, need to exchange some kind of special signals to start the main part of this attunement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3098.24,
    "end": 3100.922,
    "text": " Yep, and that relates to these ostentative cues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.423,
    "end": 3106.868,
    "text": "So if in a email, the first line is, to whom it may concern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.168,
    "end": 3108.85,
    "text": "It's a relatively formal way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.99,
    "end": 3110.651,
    "text": "It's saying, this is a cue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.711,
    "end": 3112.773,
    "text": "I'm showing you my hand right at the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.893,
    "end": 3119.239,
    "text": "I speak English, I speak formally, et cetera, versus there's other ostentative cues that could attune somebody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.56,
    "end": 3120.5,
    "text": "Hey, just a quick message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.581,
    "end": 3122.442,
    "text": " These are different cues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.522,
    "end": 3125.344,
    "text": "And then there's the level of syntactic attunement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.565,
    "end": 3129.688,
    "text": "That's making sure that the message comes across just from a bitwise perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.529,
    "end": 3135.773,
    "text": "And then there's the semantic attunement, the meaning of the message, but of course the media is the message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.993,
    "end": 3141.257,
    "text": "So there's like somewhat of a blurring between the content and the delivery mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.677,
    "end": 3149.384,
    "text": "And then there's the narrative attunement, which is at the highest level that goes beyond any single meme, the JPEG or the words in it or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.904,
    "end": 3153.427,
    "text": " It's that higher level attunement that actually dictates how humans respond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.647,
    "end": 3153.967,
    "text": "Sasha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.189,
    "end": 3161.172,
    "text": "I just wanted to comment a bit on the.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3162.693,
    "end": 3162.813,
    "text": "What.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3164.274,
    "end": 3179.065,
    "text": "Where do our priors go wrong, and if this is a bit of a meta comment, maybe you'll see in the recording, but as we're working towards alignment of mental states, your video and audio are not aligned and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3182.665,
    "end": 3189.77,
    "text": " in the adaptive sense, or in the evolutionary sense, like... Oh.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3189.81,
    "end": 3190.091,
    "text": "Go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3191.011,
    "end": 3191.272,
    "text": "Go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.76,
    "end": 3199.883,
    "text": " In the evolutionary sense, I want to make sure that your voice and video are aligned because that would never happen outside of a video chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3200.323,
    "end": 3207.725,
    "text": "But in a video chat, I don't need to worry that they're offset because I'm listening to your voice for the content of what you're saying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3208.966,
    "end": 3218.209,
    "text": "So that those two things are not aligned is actually okay in this scenario, but it's still concerning and draws my attention to that mismatch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.871,
    "end": 3224.995,
    "text": " Yep, that's a deep prior that we've learned by communicating in person that definitely gets violated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.335,
    "end": 3227.156,
    "text": "Also, people being pixelated in person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.236,
    "end": 3230.117,
    "text": "I don't remember that happening, but it did happen from time to time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.198,
    "end": 3234.04,
    "text": "So here on the attention question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.6,
    "end": 3252.271,
    "text": " So here's another quote from the paper, and I really like this because it brought a connection from so-called folk psychology or just everyday discussions of topics that are neurophysiological into what is going to be bringing us towards a more formal phrasing of the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.751,
    "end": 3260.276,
    "text": "They wrote, in active inference, the folk psychological term attention refers to two distinct but closely related phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3260.956,
    "end": 3265.157,
    "text": " The first one is epistemic value, and the second one is precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.357,
    "end": 3266.118,
    "text": "There's a citation there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3266.878,
    "end": 3272.4,
    "text": "Epistemic value, salience, or affordance is the component of policy selection just discussed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.94,
    "end": 3279.542,
    "text": "It is the component of the value of policies that tracks how much a policy reduces uncertainty about the state of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.632,
    "end": 3290.003,
    "text": " It provides a description of the folk psychological phenomena of actively orienting towards or turning one's attention to a certain modality or part of the sensory field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.283,
    "end": 3294.948,
    "text": "For example, there's visual saccades that sample particular locations in visual space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.709,
    "end": 3306.358,
    "text": " In short, salience or epistemic affordance is an attribute of how we sample the world in the sense that actively sampling sensory information will reduce uncertainty in relation to our current beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.938,
    "end": 3309.1,
    "text": "In contrast, this is the second type of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.68,
    "end": 3313.383,
    "text": "Precision is an attribute of sensory data per se of itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.264,
    "end": 3320.091,
    "text": " Imprecise sensory data should have less effect on Bayesian belief updating relative to precise information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.531,
    "end": 3326.117,
    "text": "It is therefore important to afford the right precision to each sensory sample via precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.171,
    "end": 3330.592,
    "text": " Here's the two questions I asked about this quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.812,
    "end": 3336.915,
    "text": "People can answer one of the questions or ask a further question about this paragraph or bring up their own interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.495,
    "end": 3340.616,
    "text": "How is this idea of attention related to ostentative cues?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.496,
    "end": 3345.358,
    "text": "And how is this idea of attention related to culture as an informational niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.489,
    "end": 3360.072,
    "text": " So first we can think about what are these two different kinds of attention, because they talk about how there's two distinct but closely related phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.593,
    "end": 3363.594,
    "text": "So we're going to reduce our uncertainty about this term attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.354,
    "end": 3375.479,
    "text": "And it's broken down into two categories, the epistemic value, which relates to the value of knowledge, and then precision weighting, which is like the value of the sensory data itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.185,
    "end": 3380.527,
    "text": " We can go to this last sentence to look at how they differ pretty specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.068,
    "end": 3386.351,
    "text": "Imprecise sensory data should have less effect on Bayesian belief updating relative to precise information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.792,
    "end": 3393.877,
    "text": "So let's imagine if someone says, OK, I'm going to turn on this TV and it's going to have the results of the election and you turn on the TV and it's just static.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.577,
    "end": 3395.858,
    "text": "Now, there's many kinds of static.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.158,
    "end": 3400.541,
    "text": "But the point is, with respect to the question that you want to reduce your uncertainty about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.622,
    "end": 3414.673,
    "text": " imprecise sensory data or if your eyes are very blurry or if you can't hear what the speaker is saying, this kind of sensory data that's garbled shouldn't be used to update your beliefs about the world at a deep level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.093,
    "end": 3423.5,
    "text": "So this is kind of getting to this question of the syntactic versus the semantic attunement, because in the sense of precision waiting,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3424.241,
    "end": 3434.99,
    "text": " If you're paying attention to a stimulus in free energy, that means that that stimulus is rising all the way up to the top of the attentional salience hierarchy, in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.05,
    "end": 3439.034,
    "text": "It's touching your deep priors in a way that's influencing them meaningfully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3439.514,
    "end": 3447.476,
    "text": " Whereas things that aren't being paid attention to in the sense of precision weighting are the sensory inputs that don't make a difference for your deep priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.916,
    "end": 3458.558,
    "text": "So I'm not paying attention to how my sock feels in my shoe until I am, but I'm not paying attention to it in the sense that the precision weighting is very low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.978,
    "end": 3464.78,
    "text": "Even though it's a valid sensory input, it's just the attention being paid to that stimuli is low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3465.62,
    "end": 3475.082,
    "text": " But the value of that information about the foot can also be thought of as relatively low within this epistemic value sense of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.542,
    "end": 3479.183,
    "text": "So if someone says, pay attention, 50 percent of this is like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.783,
    "end": 3483.044,
    "text": "It's like saying this is an important piece of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.404,
    "end": 3486.845,
    "text": "So, yes, you also need to have the epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.205,
    "end": 3503.885,
    "text": " content it's not just enough to get the jpeg across completely or to have somebody hear your words there's this epistemic value to certain things that are said and a way that this is related to ostentative cues is just with the simple phrase hey pay attention or listen up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.366,
    "end": 3505.747,
    "text": " The next thing I'm gonna say is important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.167,
    "end": 3516.415,
    "text": "These are broad ways that are, they're ostentative cues, they're demonstrated cues that people can use linguistically or non-linguistically like waving or things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.935,
    "end": 3532.707,
    "text": "These are cues that say, hey, if you can make out this signal, if you can hear my SOS, if you can see me waving, then please pay attention because this next thing I'm about to convey is not just syntactically important, but it's actually epistemically important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.929,
    "end": 3535.61,
    "text": " Thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.534,
    "end": 3554.77,
    "text": "Yeah, it's interesting because when I read this paper, I also use red highlight to this part about differences between folk psychology term.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3555.604,
    "end": 3574.945,
    "text": " and because usually i use yellow and for this part i decided to use red one because it's really it looks like very important for communication and understanding it and as we know from uh figures and from this paper about uh regimes of attention",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3576.679,
    "end": 3585.623,
    "text": " which are very important to really have attenuation and synchronization of mental states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3586.503,
    "end": 3602.229,
    "text": "So, and if you want to speak about how to set up this regime of attention and maybe as it's usually discussed in psychology, like how to train attention and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3602.874,
    "end": 3614.199,
    "text": " to manage attention, we should see this difference between epistemic part and this precision weighting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3615.24,
    "end": 3615.82,
    "text": "Very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.021,
    "end": 3622.183,
    "text": "And so if we, how it could relate to ostensive cues,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3624.854,
    "end": 3631.921,
    "text": " I think about, I don't know how, is a concept about attention governance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3632.721,
    "end": 3647.795,
    "text": "So some kind of rules to manage attention and some kind of proofs which ostensive cues is really important and which ones is not important or maybe wrong, for example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3649.52,
    "end": 3649.7,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3650.281,
    "end": 3654.727,
    "text": "And special signs that say, hey, I didn't hear what you said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.787,
    "end": 3655.448,
    "text": "You lagged out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.488,
    "end": 3656.329,
    "text": "Could you repeat that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.449,
    "end": 3662.336,
    "text": "I needed I needed more precision waiting on what you said because I couldn't even get to your epistemic content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3662.457,
    "end": 3665.3,
    "text": "And then, oh, wait, I heard you on what the name was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3665.5,
    "end": 3667.002,
    "text": "I just I don't know who that author is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.503,
    "end": 3674.93,
    "text": " So that's the epistemic level or, OK, I know that author, but I still don't understand how this is fitting into the narrative of why we're in this conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.311,
    "end": 3679.555,
    "text": "It's another level saying, I got you epistemically, but now narratively, I'm a bit lost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.156,
    "end": 3685.781,
    "text": "And so these are different levels that could be quantified and could be formalized and de-risked as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.539,
    "end": 3714.567,
    "text": " anything else go ahead sasha yeah another thing to add about um ostensive cues i think this answers the one of the questions posed in the paper which is how might an individual recognize another's intention to generate an active communication intended for oneself in the first place and um that was another question that i've written out as as interesting and it seems like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3715.618,
    "end": 3730.829,
    "text": " of comes back full circle to answer it that um ostensive cues are a way to let our to let other people know that we're intending to communicate with them in a more um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3731.894,
    "end": 3738.943,
    "text": " multi-level way to focus their attention first before we communicate the important information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3739.404,
    "end": 3749.396,
    "text": "And then to the point about rules of attention, at least from a neuroscience background, which I think shies away a bit from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3750.747,
    "end": 3759.11,
    "text": " understanding the psychology of the human experience and tries to have a more deflationary account of what's happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3760.07,
    "end": 3771.494,
    "text": "The rules, as I've heard them at least, of attention is to try to unpack and understand why a human is attending to a certain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3772.791,
    "end": 3783.516,
    "text": " stimulus or not versus how a human can modulate their attention so that they can better attend or pay attention based on what they want to accomplish.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3783.856,
    "end": 3790.239,
    "text": "So it's a bit of internal versus external perception of what human attention is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3790.699,
    "end": 3795.081,
    "text": "So I like that point about the psychology perspective on this because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3797.529,
    "end": 3804.473,
    "text": " Ultimately, that's a bit more useful for individuals making choices than to understand what's happening from the outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3805.633,
    "end": 3805.773,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.174,
    "end": 3819.421,
    "text": "And the precision psychiatry work of Fristin and Badcock and others talks a lot about these aberrant precision errors and about how they result in decision-making or experienced pathologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.101,
    "end": 3824.024,
    "text": "So in this last section, I think we could actually even go one more level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.824,
    "end": 3842.759,
    "text": " into this epistemic value topic and bring it to free energy so this is again about active inference as a process theory and we can see the minimal active inference loop here but i think this is going to be an opportunity for us to kind of go up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.419,
    "end": 3852.03,
    "text": " the chain another dimension, which is to go from this active inference loop, which is very qualitative and like the skeleton of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3852.471,
    "end": 3856.656,
    "text": "And let's look at a quote from the authors about where does free energy play into this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.377,
    "end": 3858.278,
    "text": "So the authors write,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.315,
    "end": 3866.285,
    "text": " The free energy expected under a policy tracks the probability of that particular policy being pursued, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.345,
    "end": 3869.53,
    "text": "of that specific policy being selected to guide action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.931,
    "end": 3873.836,
    "text": "So it's kind of weird when people think, well, wait, what is my brain doing inference on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.437,
    "end": 3877.158,
    "text": " Doing inference on the probability that right now I'm in a chair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.218,
    "end": 3883.68,
    "text": "I mean, don't I just know I'm in a chair or don't I just know that it's likely to be me in a chair in 20 minutes if that's where I want to be or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.1,
    "end": 3889.642,
    "text": "But no, actually what's happening is the brain is doing inference on the probability of a policy being pursued.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.822,
    "end": 3896.284,
    "text": " Relatively less expected free energy indicates a relatively more probable policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.764,
    "end": 3905.986,
    "text": "And this is seen sometimes not to go into too many details, but when people take the log or the negative log of a probability, it's just so that you can minimize a number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.366,
    "end": 3911.848,
    "text": "And by getting closer to zero, which is like a fixed number, we can know that we're maximizing the probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3912.188,
    "end": 3929.634,
    "text": " So if we make it so that smaller numbers are more likely, like one over the likelihood type thing, then we can actually do a minimization problem going towards zero as a lower bound because some of these things being bounded by zero and then know that we're making more probable or better policy decisions by minimizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.194,
    "end": 3938.989,
    "text": " Whereas if we were to do a maximization problem and just say, well, let's just maximize the overall likelihood, there's no known upper bound for how optimal it could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3939.23,
    "end": 3943.897,
    "text": "So you might not know when to stop, but minimization helps you because it kind of puts a hard stop on zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3945.089,
    "end": 3948.312,
    "text": " Expected free energy can be decomposed into two terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.593,
    "end": 3949.213,
    "text": "So here we come back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.413,
    "end": 3951.055,
    "text": "There's epistemic, and there's going to be another one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3951.596,
    "end": 3964.248,
    "text": "The two terms are epistemic value, which is the information gain of an observation, and pragmatic value, which is the expected log evidence of an outcome given a generative model of how outcomes depend on action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.989,
    "end": 3973.174,
    "text": " The relative influence of each term quantifies the degree to which a particular policy generates actions that explore the niche, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.274,
    "end": 3980.379,
    "text": "exploration, or actions that leverage reliable expectations about the niche to secure preferred outcomes, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3980.459,
    "end": 3981.139,
    "text": "exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.439,
    "end": 3982.94,
    "text": "This is depicted in figure one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3983.581,
    "end": 3985.082,
    "text": "So any thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.282,
    "end": 3987.043,
    "text": "Or there's a lot more to say here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3990.965,
    "end": 3993.367,
    "text": "One, I'm trying to listen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3993.835,
    "end": 4005.717,
    "text": " I was just going to say that explanation you gave for why it's a minimization problem was really helpful, like in a really lay sense of just that minimization is an easier computation that has a lower bound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4005.757,
    "end": 4007.377,
    "text": "That was a really helpful explanation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4009.218,
    "end": 4009.458,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4009.638,
    "end": 4009.858,
    "text": "Alex?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4010.938,
    "end": 4022.82,
    "text": "I just want to point one thing about what these terms of exploration and exploitation also could be met in some literature about business strategies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4023.815,
    "end": 4033.522,
    "text": " So it's possible ways to company to choose direction to act on different stages and different states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4034.122,
    "end": 4050.013,
    "text": "And as it wrote it in this literature, the company should first to exploit some new area and the next step is exploitation if there is some value for the company.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4051.221,
    "end": 4054.365,
    "text": " Great, and we'll come back to that in just a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.445,
    "end": 4055.527,
    "text": "It's so true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.647,
    "end": 4058.431,
    "text": "It's a lot like explore, exploit in other domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.012,
    "end": 4063.538,
    "text": "And if you go too far onto one end, it ends up being less than useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.858,
    "end": 4065.52,
    "text": "If it's purely exploratory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4066.101,
    "end": 4069.283,
    "text": " but never exploiting anything, then you never extract the value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.363,
    "end": 4072.545,
    "text": "That would be like searching for where the oil is, but never drilling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.005,
    "end": 4083.571,
    "text": "And then on the other hand, if you're just like, wait, there's oil right here I'm going to exploit, you're going to find out that that well is going to run dry, and you won't have put in enough research and development into exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.111,
    "end": 4090.534,
    "text": "And so there's no simple answer as to whether it's better to be exploratory or exploitative, at what level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.515,
    "end": 4093.016,
    "text": "That's what free energy is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.576,
    "end": 4099.063,
    "text": " And I thought this could be a good opportunity to actually connect what is free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.103,
    "end": 4100.545,
    "text": "Why is it called free energy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.805,
    "end": 4107.754,
    "text": "If it's just the probability of a particular policy being pursued, why don't we just call it the probability of a policy being pursued?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.843,
    "end": 4115.869,
    "text": " And to answer this, I'm going to draw on a little bit of chemistry, a little bit of statistical mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.369,
    "end": 4130.661,
    "text": "So the term free energy in the usage of Friston has less to do with the Tesla sense of free energy, like electricity for everybody, and has more to do with this sense of Gibbs free energy, which is a thermodynamic characteristic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.162,
    "end": 4133.643,
    "text": " We can look at this equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.823,
    "end": 4137.805,
    "text": "The total Gibbs free energy equals U minus TS plus PV.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.225,
    "end": 4146.57,
    "text": "And in chemical terms, these do have physical interpretations, like the absolute temperature in Kelvin or the entropy measured in some other unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.23,
    "end": 4152.592,
    "text": " The idea that I want to get across with this equation is just that you can partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4152.852,
    "end": 4168.256,
    "text": "You can have an expected free energy of some chemical reaction, and that even though it's a total singular number, it can be partitioned into, for example, the internal energy of the system chemically, the temperature weighted final entropy of the system, and the pressure weighted final volume.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.816,
    "end": 4171.057,
    "text": "Let's look at how this plays out in chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4171.977,
    "end": 4180.327,
    "text": " So on the left, on the top, we have an exergonic reaction or a reaction where the delta G is below zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.588,
    "end": 4190.14,
    "text": "So there's some big differences between Gibbs free energy and Friston's conception, not the least of which that free energy, as it's being discussed previously, it's bounded at zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4190.54,
    "end": 4192.422,
    "text": " but Delta G gives free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4192.722,
    "end": 4199.549,
    "text": "It actually works in a little bit different way where values that are below zero means that the reactants have more energy than the products.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.77,
    "end": 4202.612,
    "text": "So these are exothermic or heat releasing reactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4203.133,
    "end": 4209.379,
    "text": "And then conversely, if the Delta G is greater than zero, that means that the reactants have to basically go uphill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.0,
    "end": 4212.724,
    "text": " And so we can look at this reaction coordinate graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.224,
    "end": 4223.979,
    "text": "And whether you're going downhill overall on the left side or uphill overall, like a non-spontaneous or endergonic reaction, in both cases, you need to come over this hump.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.48,
    "end": 4226.463,
    "text": "That's the activation energy barrier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.863,
    "end": 4231.988,
    "text": " And that's why certain reactions happen at high temperature, but they don't happen at low temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.308,
    "end": 4236.572,
    "text": "It's like a ball that's right here, but it doesn't have enough energy to get over the hill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.852,
    "end": 4246.622,
    "text": "So it's like, even though the candle is thermodynamically favored to burn, otherwise it wouldn't burn, it's not going to spontaneously combust because it doesn't have the activation energy to burn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4247.202,
    "end": 4258.925,
    "text": " And then if you're going uphill anyway, then it's an even higher hill to climb because really you have to climb up over your final endpoint and then drop back down in a way that's thermodynamically favored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.526,
    "end": 4265.347,
    "text": "And so again, it's kind of a metaphor at this point, but there is math that we're just not going into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.847,
    "end": 4267.108,
    "text": "We can look at this delta G,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.788,
    "end": 4269.209,
    "text": " partitioning of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.41,
    "end": 4272.613,
    "text": "And again, delta G doesn't capture everything about the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.673,
    "end": 4274.955,
    "text": "It doesn't mention the activation energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.995,
    "end": 4278.338,
    "text": "It doesn't mention other things about the stoichiometry of the reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.759,
    "end": 4280.44,
    "text": "But it is something that can be partitioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4280.981,
    "end": 4285.665,
    "text": "And then similarly, we can think about this expected free energy in the Friston sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.346,
    "end": 4292.651,
    "text": " And we just heard it discussed as being partitioned into two things, the epistemic and the pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.051,
    "end": 4302.438,
    "text": "So the knowledge or exploratory value of a policy and then the pragmatic or the exploitative value of a policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4303.138,
    "end": 4313.751,
    "text": " And then we can just directly link it to that language around explore and exploit, as well as around divergent and convergent thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.351,
    "end": 4317.915,
    "text": "So these are still a little bit metaphorical, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.576,
    "end": 4336.44,
    "text": " I thought it would be interesting just to directly contrast the free energy from thermophysics, basically, and from chemistry, and then note how this partitioning of expected free energy into multiple terms has a lot of carryover from chemistry and from physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.56,
    "end": 4341.301,
    "text": "Any thoughts on this, or we have more math that we can survey too?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4345.407,
    "end": 4360.754,
    "text": " Cool, let's just go back to this figure with the outline that we've looked at a lot and let's actually look at these equations and not to derive them or to implement them, but let's just look at what are these equations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4360.854,
    "end": 4364.456,
    "text": "Because we've talked a lot about how there's internal states and there's external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4364.816,
    "end": 4372.24,
    "text": "We've talked about how sensations are what enter the Markov blanket and how actions guided by policy are what exit the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.68,
    "end": 4376.962,
    "text": " And so this is the minimal loop of embodied inactive cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.583,
    "end": 4386.868,
    "text": "OK, so where do we go from the qualitative theory of just saying, hey, ecological cognition means it's always this action embodied feedback loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.228,
    "end": 4391.23,
    "text": "How are we going to add a layer of math and move towards formalization of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.791,
    "end": 4396.814,
    "text": "So we can just look at the equations that are in each of these four categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.894,
    "end": 4404.018,
    "text": " And what we can see here is what action is doing is minimizing the agents bound on surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.299,
    "end": 4418.326,
    "text": "And this equation, again, even though it could be expanded into larger formats later, the two pieces are basically the complexity of the action and the expected accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.707,
    "end": 4425.571,
    "text": "You'll also note that there's a ton of things where it's like, wait, you're calculating the expected free energy, not just the free energy itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.568,
    "end": 4432.855,
    "text": " And the reason for that is the actual values are inaccessible to the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4433.255,
    "end": 4439.622,
    "text": "And so the computation or the inference that the organism is actually doing is like, not where is my leg?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4440.283,
    "end": 4442.465,
    "text": "It's where do I expect my leg to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.326,
    "end": 4450.868,
    "text": " And that's the genesis of things like the ghost limb syndrome, all these phenomena that don't quite make sense in a sensory relay paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.309,
    "end": 4456.89,
    "text": "If you make it about a second order expectation, where do I expect to be now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.43,
    "end": 4458.311,
    "text": "It's now casting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.871,
    "end": 4460.451,
    "text": "And it turns out that where am I now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.832,
    "end": 4462.932,
    "text": "How would you even know where you were?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.332,
    "end": 4468.334,
    "text": "But if you ask, where do I expect to be and how confident am I about that expectation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.934,
    "end": 4473.458,
    "text": " It turns out that is what gets good enough and does it in a really computationally tractable way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.998,
    "end": 4485.928,
    "text": "So action is minimizing the agents bound on surprise by balancing or combining, we won't go too much into detail there, the expected complexity of the action versus the accuracy of the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4486.288,
    "end": 4495.376,
    "text": "And so one way to think about that is complex actions like playing the piano are difficult to perform unless there's a feeling that there's also going to be accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.856,
    "end": 4504.279,
    "text": " Whereas very low complexity movements like flailing one's arms maybe are done without worrying too much about the accuracy of the motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.999,
    "end": 4510.66,
    "text": "And then on the perception in the internal state, the yellow box, we have the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.481,
    "end": 4519.667,
    "text": " Internal states are reflected by the KL divergence, which is the informational divergence between the priors and the posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.048,
    "end": 4522.85,
    "text": "So that reflects how the worldview is being updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.41,
    "end": 4525.793,
    "text": "And then it's penalized by the surprisal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4526.413,
    "end": 4527.194,
    "text": "And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4529.218,
    "end": 4530.659,
    "text": " I just want to put it out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.879,
    "end": 4535.862,
    "text": "There is a layer of mathematics and equations that go beyond the structure of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.663,
    "end": 4549.45,
    "text": "And then just these last two boxes, before we kind of summarize and close out, it frames external states, the niche construction of the external states, as bounding the surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.93,
    "end": 4555.034,
    "text": "And so again, it looks at this green box, the equation with KL divergence minus the surprise,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.954,
    "end": 4560.639,
    "text": " it should remind you a lot of this yellow box, which is also the KL divergence minus the surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.14,
    "end": 4570.05,
    "text": "And that's because this system is actually symmetric with respect to whether the external states are the human or whether the external states are the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.49,
    "end": 4575.756,
    "text": "Because in the end, it's a bidirectional Markov blanket with sense and action moving both directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.437,
    "end": 4583.641,
    "text": " And so it would be a little bit weird if, depending on which system we decided was internal to the Markov blanket, it went one way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4583.661,
    "end": 4585.942,
    "text": "And if we put the system on the other side, it'd be the other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.622,
    "end": 4593.886,
    "text": "So this is the work that's been built out in the variational ecology work of Axel Constant and others,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.406,
    "end": 4602.192,
    "text": " where it's realizing that, hey, the niche, especially when it's just other agents, it's actually like the Markov blanket gives us this symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.452,
    "end": 4605.854,
    "text": "And so the internal state equations look a lot like the external state equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.375,
    "end": 4609.757,
    "text": "And then sensations minimize the agents bound on surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.218,
    "end": 4621.466,
    "text": "And again, this is complexity minus accuracy, which looks a lot like the complexity minus accuracy in red of action, because the senses coming in are the active states of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4622.006,
    "end": 4627.53,
    "text": " And so similarly, we have this penalization of the complexity versus the accuracy of sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.111,
    "end": 4633.015,
    "text": "And that should remind you of earlier when we were talking about the value of communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.675,
    "end": 4639.059,
    "text": "If the input is garbled, then the sensations, it's not even that they're surprising or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.08,
    "end": 4640.501,
    "text": "They're just not that useful for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4641.041,
    "end": 4650.966,
    "text": " And so there's a lot of parallels between the different states in this model across the divide of the Markov blanket, as well as the two types of things that pierce through the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.346,
    "end": 4660.01,
    "text": "And so just first coat of paint to close out this discussion with a little bit of the math underlying the formalisms of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.813,
    "end": 4665.093,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4665.753,
    "end": 4669.475,
    "text": "So any overall thoughts or questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.281,
    "end": 4675.102,
    "text": " Just a comment on that last slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4675.883,
    "end": 4681.467,
    "text": "I kind of braced myself for the equations, but I think it's actually very useful to talk through them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4682.127,
    "end": 4687.03,
    "text": "And you did a great job really drawing those parallels out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4687.19,
    "end": 4697.457,
    "text": "And I would actually love to see more of that in future discussions about linking the papers back to the equations in sort of these layman's terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4700.816,
    "end": 4701.096,
    "text": " cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4701.196,
    "end": 4705.76,
    "text": "Well, we'll definitely need assistance, but it's good to try.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.02,
    "end": 4706.72,
    "text": "It's good to try.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.74,
    "end": 4716.607,
    "text": "It was also really nice that reflittle marriage of your action states are the world or the other agents sensory states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4717.268,
    "end": 4729.837,
    "text": "And then their action states are your sensory states, which I mean, it's shown in the pictures, but sort of, it's not always internalized that this is like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4730.911,
    "end": 4732.273,
    "text": " super perspectival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4732.393,
    "end": 4736.82,
    "text": "So it depends on from which agent you're looking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4736.9,
    "end": 4745.733,
    "text": "And it's also putting some agentive sort of characteristics on the world or the eco niche that you're interacting inside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4747.358,
    "end": 4748.419,
    "text": " Yep, very nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.579,
    "end": 4754.002,
    "text": "It's really a fully relational theory because there's no objective internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.823,
    "end": 4757.785,
    "text": "You can say, well, the internal states are internal to my epithelium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4758.205,
    "end": 4763.469,
    "text": "It's like, okay, you can choose that as your system of interest from an engineering perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4763.769,
    "end": 4774.356,
    "text": "You can choose that to be the bounds of your Markov blanket if you define it appropriately, but there's no way that you're going to be able to say that that's unambiguously the singular system of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.916,
    "end": 4776.938,
    "text": "It's just Markov blankets all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.518,
    "end": 4785.505,
    "text": " And then when you think about, let's say, contact improv or turn taking conversation in both of these cases, there's the whole world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4785.545,
    "end": 4788.127,
    "text": "But we can kind of zoom in on the dyad that's interacting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.728,
    "end": 4790.049,
    "text": "And then you're right for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4790.509,
    "end": 4795.674,
    "text": "The external state is being the generative part of the external state is like the other person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4795.794,
    "end": 4801.438,
    "text": "And that's what's generating the coordination between the two arms from which you're receiving sensory input from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.099,
    "end": 4806.622,
    "text": " And so one person is doing inference on the sensory state of another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.022,
    "end": 4810.185,
    "text": "And this kind of ties us back to this idea of alignment of mental states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4810.585,
    "end": 4814.808,
    "text": "So maybe let's look at one of the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.588,
    "end": 4817.049,
    "text": "Here we are in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.93,
    "end": 4842.667,
    "text": " and so yes it could be that two people are paying attention to the same world so here's like one person writes on the whiteboard and that contributes to changing the informational niche this person sees what's on the whiteboard they think ah what did they mean by this they add something new to the whiteboard or they say something that contributes to the niche and you get this infinity loop um or you can actually almost cut out the middleman here and just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.632,
    "end": 4850.675,
    "text": " fuse those two parts, you have two individuals and one person's action states are received as sensory information by the other person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.235,
    "end": 4858.458,
    "text": "And that's why the alignment of mental state is so important because we can't just align people on each syllable by syllable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4858.958,
    "end": 4862.639,
    "text": "We have to align people on semantic content of what is being conveyed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.019,
    "end": 4872.623,
    "text": "And then even higher, we have to align people to really a narrative understanding of what's happening because there's never gonna be enough time to convey all those microstate details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.323,
    "end": 4878.606,
    "text": " And that's why this is so cool to see that the mathematics reflects that symmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.007,
    "end": 4887.472,
    "text": "And the symmetry is what allows us to be fully relational without taking an absolutist perspective on what the correct system of analysis is for communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.573,
    "end": 4891.394,
    "text": "So communication is fully relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4891.454,
    "end": 4893.275,
    "text": "It's all about those edges between nodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.656,
    "end": 4900.52,
    "text": "And then now we have this mathematical framework where we can talk about the nodes and edges in a way that gives them their due.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.195,
    "end": 4904.495,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.915,
    "end": 4907.396,
    "text": "Any closing thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4908.036,
    "end": 4910.937,
    "text": "Otherwise, this was a super interesting conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.937,
    "end": 4923.54,
    "text": "I just wanted to highlight again the importance of this description of attention in a more formal way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4924.241,
    "end": 4927.063,
    "text": " and from perspective of active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4927.643,
    "end": 4950.158,
    "text": "So, as we see, if this part of attention is important to communication, and communication is important to alignment, and it's basement alignment of mental states, so maybe for future discussion we need to unpack this part more deeply about attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4951.167,
    "end": 4951.407,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.547,
    "end": 4960.334,
    "text": "I think it would be cool to look at perhaps a mathematical treatment of attention in a multi-level scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4960.834,
    "end": 4964.417,
    "text": "And I think I know a good paper for that because I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4964.837,
    "end": 4970.481,
    "text": "If the person isn't paying attention to the syntax, if they can't hear the story, they're not going to get it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4970.922,
    "end": 4972.523,
    "text": "If they can't get the words, they're not going to get it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.823,
    "end": 4975.185,
    "text": "If they can't get the narrative, they're not going to get it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.705,
    "end": 4976.786,
    "text": "Or they're going to get something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.926,
    "end": 4979.869,
    "text": " but what it is that they get may not be what the speaker intends.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4980.25,
    "end": 4999.61,
    "text": "And so how do we formal model this and how can active inference help us cut through some of these complexities and simplify the whole system in a way that we could actually impact the systems that we want to impact by designing attention regimes and culture in the way that we want to make it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.616,
    "end": 5001.916,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.897,
    "end": 5004.339,
    "text": "Very great stuff, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5004.479,
    "end": 5009.644,
    "text": "Thanks so much for this follow-up, ACT-IMP Stream 3.5 Part 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5010.425,
    "end": 5013.768,
    "text": "I think I'll try to find a way to fuse these two streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.91,
    "end": 5021.016,
    "text": "And we really appreciate everybody who's listening and providing us feedback and coming out to discuss with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.677,
    "end": 5022.658,
    "text": "So thank you, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.858,
    "end": 5024.259,
    "text": "And I'm going to terminate the live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5024.86,
    "end": 5025.06,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  }
]