[
  {
    "start": 4.047,
    "end": 7.673,
    "text": " Hello, everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.474,
    "end": 11.479,
    "text": "As always, I'm your host, Darius Parvizi-Wayne.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.9,
    "end": 13.863,
    "text": "Can't even say my name anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 13.883,
    "end": 17.008,
    "text": "And today I'm joined by Dr. Sanjeev Namjoshi.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 17.809,
    "end": 27.405,
    "text": "Sanjeev is an expert in data science, computer vision, machine learning, and bioinformatics with strong teaching experience in bioinformatics, biochemistry, and computational neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.858,
    "end": 31.523,
    "text": " He is also what I would say is a world expert in active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.224,
    "end": 42.197,
    "text": "In fact, he's currently putting together a textbook which explains the fundamentals of the theory, which will act as a wonderful addition to the education resources we as a community already have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 42.658,
    "end": 45.261,
    "text": "Sorry for butchering that intro, but Sanjeev, welcome to the show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.322,
    "end": 51.049,
    "text": "We've got past my least favorite part of the show, which is the introduction, so we're here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.069,
    "end": 52.451,
    "text": "Thank you again for joining me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.091,
    "end": 54.373,
    "text": "Yeah, thank you so much for inviting me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.393,
    "end": 55.114,
    "text": "I really appreciate it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.988,
    "end": 60.595,
    "text": " No, it really is a pleasure because I have been, you know, it's the least I could do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.635,
    "end": 65.422,
    "text": "I've been benefiting a lot from your textbook, which is not out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.462,
    "end": 72.913,
    "text": "So people, if they're sort of scrambling on the internet to try and find your textbook, they may only find the Pa Pizzolo and Friston one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.355,
    "end": 78.962,
    "text": "So you may want to start just by saying sort of, well, I think today's episode is going to be slightly different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.944,
    "end": 84.19,
    "text": "Normally we sort of do some deep dives into people's papers, but I think today we're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.811,
    "end": 89.038,
    "text": " We're going to start at least by talking about the kind of education side of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 90.661,
    "end": 100.298,
    "text": "So nothing too technical necessarily, but just sort of thinking about how these ideas are permeating academic culture, intellectual culture, and then sort of broader culture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.418,
    "end": 109.013,
    "text": "But maybe where we could start, I sort of gave a very brief introduction there, is with you just kind of outlining how you found active inference, because people might not be aware of your work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.427,
    "end": 110.747,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.807,
    "end": 111.568,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 111.588,
    "end": 115.713,
    "text": "So my path to Active Inference was really unusual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.733,
    "end": 125.725,
    "text": "I think what was really unique about it was I had been at a point in my career where I was starting to figure out where all my interests were, but I didn't know that Active Inference actually existed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.145,
    "end": 133.414,
    "text": "So that was the journey toward that was that moment of finding out that all of my research interests were colliding in one place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.394,
    "end": 140.943,
    "text": " And if we go back really far to just the beginning, when I was doing my undergraduate research, I was working in neurobiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.003,
    "end": 142.204,
    "text": "I also worked in genetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 143.005,
    "end": 144.427,
    "text": "I did a lot of work in biochemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.467,
    "end": 150.294,
    "text": "And a lot of my PhD work was actually molecular neuroscience, but I had wanted to move in a more technical direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.955,
    "end": 163.249,
    "text": "So I did do bioinformatics work in my PhD, which introduced me more to some of the techniques and skills that I would need in computational neuroscience, which is when my first postdoc was in that area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.275,
    "end": 172.809,
    "text": " And it was at the end of my postdoc when I was getting close to leaving academia that I discovered active inference while just browsing papers, writing a grant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.849,
    "end": 177.336,
    "text": "The work I was doing was modeling human behavior with reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.356,
    "end": 181.322,
    "text": "So there was definitely an overlap in relationship to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.302,
    "end": 205.96,
    "text": " but um my advisor has said yeah yeah we know about active inference we don't really use it in the lab but it's something we're interested in and so that kind of just led me in that direction and reading some of carl's original papers uh that just got me off on that path and i became really excited about learning more about it and that's kind of where i stumbled into the original problems of there's just no resources out there this was around 2018.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.733,
    "end": 209.4,
    "text": " Yeah, 2018, there were definitely no resources out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.182,
    "end": 211.145,
    "text": "We're doing a bit better now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.506,
    "end": 219.848,
    "text": "We have the Institute, we have the textbook by Pa Petsula and Friston, which people can buy, and then hopefully your one, which is coming out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.891,
    "end": 232.129,
    "text": " I sort of want to go back, it's interesting, you said sort of the skills that you learned in doing bioinformatics were, you know, really contributed to your capacity to sort of pick up active inference quite intuitively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 232.89,
    "end": 235.274,
    "text": "What skills are they?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.694,
    "end": 237.938,
    "text": "And what sort of do you feel has benefited you most?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.386,
    "end": 243.794,
    "text": " Yeah, so the skills that I'm kind of talking about here are very broad in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.034,
    "end": 258.439,
    "text": "So the strategy that I've taken with the textbook is really to break it down into the language that everyone would understand if they're in any technical field like engineering or computer science or statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.96,
    "end": 260.803,
    "text": "And that language is probability theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.969,
    "end": 268.099,
    "text": " If you strip away the neuroscience and a lot of the other themes and ideas in there, you're left with just a mechanism of Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.88,
    "end": 279.855,
    "text": "And a lot of the bioinformatics methodology that I was using in my PhD, when you look at it, they boil down to some probabilistic formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.835,
    "end": 307.885,
    "text": " so i had some of that background i had enough of the background in the neurosciences and enough in the probabilistic reasoning side to be able to translate that into the active inference domain there's all these other layers on top of it of course but at the core that's kind of what i see is the baseline and that's common to all types of statistical modeling methods you can motivate it in a probabilistic formulation sure and when people hear the word probabilistic maybe they their mind does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 308.135,
    "end": 309.858,
    "text": " jump to base, but maybe it doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.581,
    "end": 316.148,
    "text": "So active inference obviously leans very heavily on Bayesian inference, variational Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.951,
    "end": 321.337,
    "text": "You know, to your eyes, would that be the only path that needed to pursue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.397,
    "end": 329.35,
    "text": "Could there be any other mathematical formulations that might flesh out the claims of active inference and self organization that isn't necessarily Bayesian?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 331.135,
    "end": 340.289,
    "text": " I definitely think there could be multiple ways we can frame the active inference problem because we're ultimately computational neuroscientists or modelers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.71,
    "end": 358.898,
    "text": "They're trying to find the most convenient way to model a system, not just for the purpose of making predictions, but also something that's intuitive and easy to communicate and that makes sense to people when we try to formulate these more broader claims and bigger hypotheses about the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.878,
    "end": 378.945,
    "text": " i think it's just the convenience of the bayesian formulation that things neatly fit into this picture um but there are of course instances where sometimes you have to kind of force it into the picture sometimes that's you know if we try to modeling something um there may be other ways to do it and um the you know their probabilistic reasoning i think is just really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.925,
    "end": 382.149,
    "text": " convenient way to being able to model dependencies among variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 382.229,
    "end": 396.388,
    "text": "And when you pair that with this dynamic formulation, you talk about dynamical systems in a probabilistic setting, all the tools that you get out of it, I think are really important for being able to model the brain, but it's probably not the only way we could, we could conceive of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.57,
    "end": 397.79,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 397.87,
    "end": 406.522,
    "text": "I feel like, I mean, again, I'm coming into this very new because, you know, I discovered this during my master's, which was, you know, a year ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.822,
    "end": 407.363,
    "text": "So I'm,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.663,
    "end": 410.526,
    "text": " pre-doc, I'm very sort of babyish into this field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.566,
    "end": 420.878,
    "text": "But when you read the kind of history of, I guess, computational neuroscience or computational psychology, it feels like there was this transition between dynamical systems into active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.859,
    "end": 433.772,
    "text": "So we haven't really touched actually on dynamical systems theory on this podcast, in part because it's an active inference podcast, but in part because it's technical and I don't really have the sort of chops to get into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.073,
    "end": 437.939,
    "text": " but I've been reading a little bit of Scott Kelso's work and getting into sort of meta stability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 438.399,
    "end": 446.692,
    "text": "Maybe you could very briefly, it doesn't need to be super deep, but talk about how we get, you know, what does that transition path look like from dynamical systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 446.712,
    "end": 448.955,
    "text": "What are the, what are the key insights from dynamical systems?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 449.756,
    "end": 453.842,
    "text": "Because Carl was working in, you know, in dynamical systems in the late nineties and the early two thousands.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 454.383,
    "end": 455.244,
    "text": "And what does that add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 455.364,
    "end": 459.27,
    "text": "Or what does that, what are the convergence points between that and an active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.82,
    "end": 476.964,
    "text": " The biggest thing about it is that when you look at the history of Active Inference and you go back to the 90s, a lot of the work that was intersecting with Carl's work was the work that was going on at the Gatsby Computation Unit at UCL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.705,
    "end": 482.592,
    "text": "A lot of what you would call the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.466,
    "end": 488.584,
    "text": " figures, the grand figures in unsupervised learning techniques and Bayesian networks were being developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.086,
    "end": 491.856,
    "text": "Uh, people like Hinton, Harmony and, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.258,
    "end": 496.823,
    "text": " David McKay, and there are many others as well, were developing those techniques in the 1990s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 497.583,
    "end": 504.19,
    "text": "And because of Friston working at UCL as well, there was a lot of overlap in knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.25,
    "end": 509.315,
    "text": "Of course, he was attending a lot of the same meetings and conferences and things like that, and adapted that into SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.916,
    "end": 520.847,
    "text": "If I'm not mistaken, I think SPM2, which was the 2002 version, I believe, switched into the Bayesian world from the more frequentist version of SPM in earlier editions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.827,
    "end": 531.298,
    "text": " And so you have this unsupervised learning idea, which I think is really deeply powerful because a classic problem in dynamic systems is the idea of filtering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.839,
    "end": 544.472,
    "text": "You have some observed data that links to some unobserved process and you have to figure out what can we learn about this process that generated that data from just these noisy samples alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.722,
    "end": 553.514,
    "text": " And there is a really great paper, Gaharmani, and I think I may be pronouncing this wrong, but Rowis, it's R-O-W-E-I-S, I believe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.295,
    "end": 555.978,
    "text": "I think it's 1999 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.498,
    "end": 564.389,
    "text": "They reformulate all the unsupervised learning problems and these ideas of the expectation maximization algorithm, variational Bayes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.73,
    "end": 570.578,
    "text": "They kind of put it all together and show you how you can model state space equations in a Bayesian setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 570.963,
    "end": 574.429,
    "text": " And I think that's kind of the start of this move in that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.231,
    "end": 583.045,
    "text": "And there's a great thesis, Beale, 2003 PhD thesis, which then kind of puts all those ideas together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.165,
    "end": 590.338,
    "text": "And I think the basic way of looking at it is that you're doing Bayesian inference, but you can look at it as Bayesian inference over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.318,
    "end": 604.868,
    "text": " And with all of the work in the 90s with dynamic models of the brain, like you mentioned, Kelso, and there are others as well, looking at the brain as a dynamic system, which changes in a way that settles towards some kind of equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.152,
    "end": 626.041,
    "text": " Those ideas, I think when you combine with the Bayesian inference and all of these unsupervised learning ideas coming together under dynamic systems umbrella, it's a natural fit to then say, okay, how can we model the brain with certain equations where there are these unknown states trying to be estimated and the equilibrium solution is the most likely estimate of those states given the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.443,
    "end": 627.704,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.904,
    "end": 628.044,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.064,
    "end": 632.29,
    "text": "I want to get into expectation maximization because I was just very excited when I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.692,
    "end": 636.838,
    "text": " feel like I learned what it was, although I'm probably missing something, but I thought it was incredible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 638.301,
    "end": 643.569,
    "text": "But just to sort of finish up on the dynamical systems theory and the sort of chronology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.609,
    "end": 646.574,
    "text": "I guess there's two questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 646.734,
    "end": 656.069,
    "text": "One is a very broad question, which is in some ways is active inference, a kind of apotheosis or the endpoint of dynamical systems very can it be couched within that overarching frame?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.549,
    "end": 660.876,
    "text": "And then second point, which is a little bit more specific is, in terms of meta stability,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 661.261,
    "end": 670.877,
    "text": " So this idea that the, let's say the neuronal dynamics are jumping from, as you say, like an attracting set or what people talk about wells, but it never really settles in one place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.698,
    "end": 675.865,
    "text": "That will sound very similar, you know, very familiar to people who are familiar with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.947,
    "end": 685.902,
    "text": "Uh, so I guess is my question is what's interesting though, I guess, is the kind of, as you say, over timeness, the diachronicity of meta stability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 686.303,
    "end": 688.146,
    "text": " Where does it diverge from active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.186,
    "end": 689.388,
    "text": "What is its kind of convergence points?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.408,
    "end": 694.976,
    "text": "And then again, how does that contribute to the difference between dynamical systems theory and active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.879,
    "end": 697.119,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.159,
    "end": 700.724,
    "text": "So that's, of course, is a huge, I think so much could be written and talked about on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.764,
    "end": 706.573,
    "text": "So I'll kind of give the high level answer, my interpretation of that, which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.87,
    "end": 711.076,
    "text": " Active inference, I think, is what's really interesting about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.957,
    "end": 722.056,
    "text": "If you look at the equations of active inference, this paper is Hierarchical Models in the Brain, Carl's 2008, I want to say, paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.076,
    "end": 729.81,
    "text": "It's a great paper because he spends a lot of time digging back through that old literature from the 1990s and then saying,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.79,
    "end": 739.827,
    "text": " look, if we add all these other extra elements onto it, which is what some of those papers were doing for in your imaging setting, we get all of these different techniques that fall out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.348,
    "end": 754.212,
    "text": "So it's kind of like active, even if you just take out the active part, just the perception alone, perception of both hidden states, learning model parameters, and also learning the precision of sensory data or your priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.192,
    "end": 757.118,
    "text": " all of that information in one algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.519,
    "end": 762.189,
    "text": "If you start taking all these special cases, you can get all the neural network and supervised learning literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.249,
    "end": 769.585,
    "text": "You can get all these unsupervised learning problems, filtering problems, whether it's dynamic or static.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.565,
    "end": 781.604,
    "text": " So I see that as kind of like active inference is sort of a global overarching method that you could apply to any kind of stochastic time series type of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.565,
    "end": 787.593,
    "text": "If you take out the action part, then you just have purely a perception part looking for patterns in data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.954,
    "end": 797.749,
    "text": "But if you add action in there, then you kind of recover this idea of control systems and the ability to control stochastic dynamical systems in a particular setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.729,
    "end": 801.956,
    "text": " So that's the way I view it is kind of like you, you get all these other things that kind of fall out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.677,
    "end": 810.45,
    "text": "Um, so as far as I, I can see it as it's kind of the broadest generalization one could imagine of these kinds of Bayesian motivated statistical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.331,
    "end": 811.572,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.273,
    "end": 824.192,
    "text": "I'm curious again, before we get into the sort of nitty gritty, I mean, I'm, I'm not, I'm not here to sell active inference, but I'm always curious, you know, about scope about what the next 10 years is going to the next 20 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.117,
    "end": 854.972,
    "text": " you say in the 90s i i had chris friff on and he was sort of telling me just how exciting it was in the 90s uh because you had the gatsby you had all the psychological work the kind of pure psychological work that he was doing and then the kind of middle ground the car was occupying which was a sort of foot in both uh you know lands and as you say they kind of coalesced in the late 2000s and that in the 2010s i'm wondering whether you can see any other sort of not a rival theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 855.172,
    "end": 866.146,
    "text": " But something that could, if we're talking about dialectics and we end up with some synthesis, what are the kind of dialectical counterparts to active inference in the 2020s and the 2030s?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 866.586,
    "end": 872.374,
    "text": "Is there anything that it's going to synthesize with to give us something even bigger and broader and more overarching?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.434,
    "end": 879.863,
    "text": "Or is this, I don't know why I've gone very Hegelian, but is this the kind of end of history in some ways?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.075,
    "end": 883.534,
    "text": " Yeah, that's a really good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.574,
    "end": 885.347,
    "text": "And I think it's, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.732,
    "end": 888.435,
    "text": " It's really hard to know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.455,
    "end": 897.143,
    "text": "I think at the moment right now, if you think about just if you're talking in purely computational terms, everyone is talking about deep learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.764,
    "end": 899.065,
    "text": "And that's what, of course, is an industry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.085,
    "end": 903.77,
    "text": "It's all over what research programs are focusing so much on deep learning systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.91,
    "end": 909.015,
    "text": "And that's kind of the same thing is claims have been made about that as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.055,
    "end": 910.376,
    "text": "The deep learning is the end game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.876,
    "end": 912.078,
    "text": "And so everything will fall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.138,
    "end": 915.621,
    "text": "It'll kind of become the main methodology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.601,
    "end": 916.331,
    "text": " Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.069,
    "end": 924.576,
    "text": " I mean, there are not like a lot of other things that I think have the same broad scope trying to encompass so many different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.636,
    "end": 927.819,
    "text": "I think that's kind of the biggest advantage of Active Inference is the unification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.94,
    "end": 934.184,
    "text": "But there's something to be said about the fact that Active Inference uses one objective function to do everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.586,
    "end": 937.447,
    "text": "How far can we get with that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.467,
    "end": 947.076,
    "text": "Is it better to have tailor-made systems where for different problems you have really specific types of objective functions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.056,
    "end": 960.087,
    "text": " To me, I would say the biggest contender or biggest rival to Active Inference isn't one specific field, but more an approach of just saying, how can we engineer problems in a really specific way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.826,
    "end": 966.453,
    "text": " with very heavily tailored objective functions that satisfy a particular problem domain or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.573,
    "end": 979.129,
    "text": "Because I'm wondering if you'd run into a problem with this sort of generalist specialist issue where active inference is kind of great at everything, but maybe can be outperformed by a specialist system that's really tailored designed for that kind of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.13,
    "end": 980.27,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.29,
    "end": 981.171,
    "text": "I think that's exactly right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.211,
    "end": 986.939,
    "text": "I mean, the university that I work at for my day job, which is not super active inference, it's a little active inference here, Royal Holloway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 987.459,
    "end": 989.702,
    "text": "There's a lot of RL modelers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.188,
    "end": 997.397,
    "text": " And when I speak to them, that is the kind of, I mean, they're very, obviously very respectful and very interested in active inference modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.957,
    "end": 1007.389,
    "text": "But I think that is in many ways, the critique, which is that sure, the free energy principle might be applicable to everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.99,
    "end": 1011.994,
    "text": "But as you say, in the very sort of particular domain, you've got to do the model comparison.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.435,
    "end": 1014.998,
    "text": "And if your RL, like if, if your RL",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.349,
    "end": 1017.692,
    "text": " model works better than so be it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.832,
    "end": 1024.1,
    "text": "I think the active inference response to that would always be, well, you can just encompass RL with active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.501,
    "end": 1032.151,
    "text": "So whatever claims you're making about RL will ultimately be taken up by active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.571,
    "end": 1044.867,
    "text": "I guess the one difference, and you'll have to tell me about this because you're saying you're starting in RL and then found active inference, is that active inference is very strong on the as-if teleology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.015,
    "end": 1047.697,
    "text": " as if it's doing variational Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.479,
    "end": 1050.76,
    "text": "Does RL have an equivalent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.1,
    "end": 1057.146,
    "text": "So does RL say that individuals look as if they're maximizing a reward function?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.766,
    "end": 1063.392,
    "text": "Or is there a kind of more ontological claim that no, they actually are doing that and you can see that in neurons?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.152,
    "end": 1075.022,
    "text": "And then maybe in that case, just in terms of the philosophical strength of these positions, if RL was making more solid ontological claims, then maybe your RL researchers are going to get excited over that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.314,
    "end": 1080.017,
    "text": " So there's two different angles that I would kind of take this question from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.177,
    "end": 1088.908,
    "text": "And it's, you know, when we talk about active inference or reinforcement learning, are we talking about it from the perspective of what can we do and build with these systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.548,
    "end": 1106.528,
    "text": "Or are we talking about, you know, the as if nature as in like, we're trying to model specifically the brain and we want to go for biological plausibility because, you know, ultimately if we're just trying to build, you know, an AI, like, you know, when I say AI, I mean an intelligence that mimics animal and human behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.828,
    "end": 1108.892,
    "text": " Maybe we don't need to model it perfectly after the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.932,
    "end": 1115.764,
    "text": "We can get as if the as if part can get us, you know, it may not be exactly the same as biological intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.844,
    "end": 1116.065,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.205,
    "end": 1119.691,
    "text": "But it's it's a version of intelligence that does the same things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.092,
    "end": 1125.462,
    "text": "And as far as anyone looking from the outside, it effectively functions in the same way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.762,
    "end": 1131.953,
    "text": " So that's sort of like, I think, with both reinforcement learning and active inference, you kind of see the split.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.973,
    "end": 1149.323,
    "text": "Reinforcement learning started as looking at models of human behavior and human and animal behavior, and then got taken off into the computer science realm, where then all these new techniques that have been developed after it may not necessarily resemble the brain anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.303,
    "end": 1152.79,
    "text": " So when we talk about RL, it's hard to, you know, what does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.81,
    "end": 1154.093,
    "text": "Because it's so many different things now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.674,
    "end": 1156.759,
    "text": "And the same thing is kind of happening with active inference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.779,
    "end": 1165.256,
    "text": "Where we started in that realm and now we're in a place where we're applying it to robots and other things in ways that may not be necessarily biologically plausible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.621,
    "end": 1170.467,
    "text": "So I guess the direct answer to your question is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.113,
    "end": 1179.941,
    "text": " I think we need to define what RL and active inference mean specifically to be able to kind of characterize the as if-ness of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.782,
    "end": 1184.687,
    "text": "And I think the other issue is that it's really hard to test these kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.707,
    "end": 1187.931,
    "text": "Like how do you test that neurons are representing things in a certain way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.971,
    "end": 1195.039,
    "text": "You're always kind of locked into some kind of philosophical backbone whenever you do these experiments too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.341,
    "end": 1199.745,
    "text": "And so to some degree, I feel like as if is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.215,
    "end": 1201.457,
    "text": " maybe the best you can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.477,
    "end": 1203.46,
    "text": "And it's all about predictability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.48,
    "end": 1206.043,
    "text": "Like, are we predicting the activity of neurons and what they're doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.384,
    "end": 1208.687,
    "text": "And that's kind of the best thing you can get to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.707,
    "end": 1211.752,
    "text": "I think that the ontological part of it, that's hard to close that gap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1211.772,
    "end": 1219.263,
    "text": "And I don't know if we'll get there at least in the next decade or so, maybe a lot longer to get to that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.264,
    "end": 1220.364,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1220.384,
    "end": 1229.057,
    "text": "I think as a naive psychology slash philosophy student, I sort of came in and thought, well, we'll just get to the construct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1229.662,
    "end": 1238.692,
    "text": " But you realize that in, well, in psychology, especially, you know, if I'm studying, if I've got an attention paradigm, I just take for granted that I know what attention is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1239.673,
    "end": 1242.896,
    "text": "But like, frankly, there's, well, there's this good paper, actually, I think it was Hommel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.057,
    "end": 1246.159,
    "text": "The title of it was no one knows what attention is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1246.48,
    "end": 1248.742,
    "text": "And I kind of think you could have that for every construct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.802,
    "end": 1253.687,
    "text": "I mean, is anyone really, and in some ways that's a shame, but as you say, it's predictability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.727,
    "end": 1258.032,
    "text": "I think the difference where, well, my stance is that I'm not an out and out modeler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.72,
    "end": 1263.264,
    "text": " So my interest is in saying, okay, well, let's take a cognitive function like attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.565,
    "end": 1270.912,
    "text": "How close can we get to, well, let's just say there's a general agreement we have over what attention is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1271.332,
    "end": 1278.62,
    "text": "And fundamentally that's a phenomenological thing because we only really know what attention is by paying attention to our own attention in some strange way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1279.44,
    "end": 1288.069,
    "text": "And I guess this brings me to ask, do you think in some ways, like, you know, you saying we've got active inference in robotics and you've got someone like me who's trying to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1288.319,
    "end": 1298.451,
    "text": " phenomenology and active inference, and you've got people applying it to atoms, and, you know, the very fundamental physics, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.412,
    "end": 1312.528,
    "text": "Do you think active inference is risking becoming too diffuse, that it's just this kind of one size fits all and let's just take any phenomena phenomenon and see what we can say about it in terms of variational Bayesian inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.929,
    "end": 1314.09,
    "text": "And if so,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.796,
    "end": 1316.278,
    "text": " Is that a kind of big problem?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1316.579,
    "end": 1323.008,
    "text": "What's the kind of narrowing down or the refinement of the theory and the community that might need to happen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.071,
    "end": 1333.223,
    "text": "So this speaks to a problem that I've already run into when people are reading drafts of my chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.824,
    "end": 1339.252,
    "text": "I'm already seeing that everyone kind of has their own vision and understanding of what active inference is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.312,
    "end": 1341.535,
    "text": "And there's sort of this local knowledge problem, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.595,
    "end": 1343.638,
    "text": "Everyone comes in it from a different angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.618,
    "end": 1350.409,
    "text": " And the way that they've interacted with it means that they see active inference in one light or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.449,
    "end": 1355.718,
    "text": "And that is a big challenge because there is this prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.738,
    "end": 1358.483,
    "text": "People read the book, they're like, well, I never thought of active inference that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.523,
    "end": 1359.404,
    "text": "Here's what it means to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.444,
    "end": 1361.327,
    "text": "They're expecting it to be a certain way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.948,
    "end": 1368.9,
    "text": "And I think this becomes especially true the further out you go from the actual mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.948,
    "end": 1377.298,
    "text": " Because the actual mathematical models, of course, there's always interpretation of what the math means, but they're a lot easier to say like, hey, I made this simulation, here's what it's doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.099,
    "end": 1379.922,
    "text": "Okay, it converged, it didn't converge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1380.022,
    "end": 1384.988,
    "text": "We have these tools and metrics and things that we can say what's happening when we run a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.589,
    "end": 1398.465,
    "text": "But when you start getting to the outer edges of that, where there's a lot of the philosophy, there's active inference and ecosystems and weather and active inference, talking about plants and how plants...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.715,
    "end": 1399.616,
    "text": " can be predicting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.277,
    "end": 1415.132,
    "text": "I mean, that's kind of the draw for Bayesian mechanics is that it's, well, it should apply to any dynamical systems that are trying to predict one another within certain set of constraints, which should cover a very broad spectrum of types of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.735,
    "end": 1421.018,
    "text": "I definitely think that's both hurt and helped active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.999,
    "end": 1423.761,
    "text": "I think there's a tendency",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.078,
    "end": 1429.804,
    "text": " In any field, when the classic, when all you have is a hammer, everything looks like a nail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.026,
    "end": 1436.011,
    "text": "If your proposal is vague enough, you can probably massage it into the active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.692,
    "end": 1439.555,
    "text": "But then when you start going down further and further, the actual math of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.036,
    "end": 1444.741,
    "text": "Okay, so what is the math of ecosystems and communities and economics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.821,
    "end": 1449.546,
    "text": "Like huge, all these agents that are all their own generative models, all interacting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.526,
    "end": 1452.751,
    "text": " in a big group, what does that look like mathematically?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.771,
    "end": 1454.855,
    "text": "Does it really scale to that level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.796,
    "end": 1457.84,
    "text": "Or is there some other generalization we're missing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.643,
    "end": 1460.765,
    "text": "I think it's great to speculate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.805,
    "end": 1464.21,
    "text": "Personally, as someone, I just love the idea of taking into these new areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.25,
    "end": 1470.1,
    "text": "I think that's what spurs creativity and allows people to then explore new ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.637,
    "end": 1480.798,
    "text": " I think we should distinguish carefully between active inference itself and applications of active inference in a theoretical sense, philosophical applications of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.909,
    "end": 1482.75,
    "text": " Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.11,
    "end": 1494.342,
    "text": "I mean, this has been my personal experience, which actually is that my life becomes a lot easier when I'm writing papers to stick to the maths, as in not that I'm writing mathematical papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.042,
    "end": 1505.092,
    "text": "But that when I have the very, just very simply, if I have the variational free energy formula, the expected free energy formula in front of me, I actually can't go too wrong, in some ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.993,
    "end": 1507.295,
    "text": "Not that I run the derivations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1507.355,
    "end": 1510.718,
    "text": "And obviously, there is an appeal to authority that those derivations hold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.137,
    "end": 1521.189,
    "text": " But you know, I remember my introduction, you know, when I started thinking about active inference and reading the kind of seminal philosophy, philosophical pieces by Andy Clark and Jacob hobby, and these are, you know, classics and very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1522.37,
    "end": 1525.814,
    "text": "But you then go, Well, am I learning about predictive coding?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.854,
    "end": 1528.297,
    "text": "Okay, what the hell are all of these equations doing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1528.317,
    "end": 1529.578,
    "text": "What's the variational mess?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.618,
    "end": 1531.841,
    "text": "And then that's really a mess for a lot of people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1532.562,
    "end": 1539.81,
    "text": "And so I think for a lot, I don't know, my experience has been, when people ask me, Okay, what, what is active inference, I literally just go, Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.347,
    "end": 1544.853,
    "text": " if you have just the variational free energy formula, like, let's just start there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1546.055,
    "end": 1555.867,
    "text": "Um, a question that comes to mind, actually, when it comes to sort of talking to people about active inference is that people will say, Okay, well, what every theories guys, miracles, every theories guys, axioms, what are the axioms of active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.887,
    "end": 1556.989,
    "text": "What is it presuppositions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.029,
    "end": 1560.874,
    "text": "And I say, Well, I kind of think there are two, but I think you'll be able to tell me there are more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.535,
    "end": 1567.483,
    "text": "One, I say you have to kind of accept that there's thingness, that there are individuated things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.923,
    "end": 1569.966,
    "text": "And I think that's an actually really interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.672,
    "end": 1573.655,
    "text": " development that could go which is like, what is an individuated thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1573.896,
    "end": 1574.937,
    "text": "Like, how do we even get there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.977,
    "end": 1575.958,
    "text": "How do we start there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.978,
    "end": 1584.027,
    "text": "But that's the kind of axiom and then the other one I think is time that you have that you have this kind of movement back to the attracting set over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.749,
    "end": 1592.016,
    "text": "Is there anything more that we should add to that kind of set of presuppositions active inference rest on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.476,
    "end": 1597.422,
    "text": "I know there's gonna be stuff like ergodicity, which is a little bit more technical, but is there anything more that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.347,
    "end": 1622.616,
    "text": " i should be telling people about when they ask me a question like that so i think the the biggest motivating motivating factors here uh what you said i think is those are definitely um really important assumptions and i think there are others that can be paired with it or um maybe are broader categories and one is that when you talk about thingness and existence right like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.596,
    "end": 1643.355,
    "text": " we're defining what existence means like existence is a philosophical concept that has been explored for you know thousands of years so there's many different ways of looking at existence i think this is more of a pragmatically motivated way of saying that you know when we when something exists it exists meaning that we can measure its properties over an appreciable amount of time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1643.437,
    "end": 1646.721,
    "text": " So thingness, of course, there is that problem, like how do you define thingness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.282,
    "end": 1650.166,
    "text": "How do you define what is how one or two things are identical to one another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.206,
    "end": 1657.115,
    "text": "There are all these kind of philosophical questions and you get into like muriology about how parts and wholes come together and what is a part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.216,
    "end": 1663.504,
    "text": "And there's all kinds of topics one can go into here that have rich literature, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1664.21,
    "end": 1667.935,
    "text": " That's one part of it is that we have to talk about what is it we're actually talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1667.955,
    "end": 1671.119,
    "text": "I think that's one assumption that you mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.68,
    "end": 1679.51,
    "text": "And along with the time assumption, it's the idea that we're taking a physics perspective, which physics has a particular reductionist way of looking at the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1679.81,
    "end": 1685.998,
    "text": "And here we're saying that everything we're modeling can come down to stochastic differential equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.978,
    "end": 1698.267,
    "text": " um because everything in active inference ultimately is a form formulation of a stochastic differential equation or you have two different systems that are themselves modeled that way and you look at their interaction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.09,
    "end": 1703.961,
    "text": " So, I mean, there are some other things too, like, you know, you talk about like sparse coupling and Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1704.362,
    "end": 1710.015,
    "text": "There's other like little bits and pieces that are in here that are more the philosophical foundations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.797,
    "end": 1717.572,
    "text": "But then when you go into the mathematics, there are a lot of little simplifying assumptions here and there that you could toss in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.552,
    "end": 1721.498,
    "text": " One example is like the Laplace approximation, which is used in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.538,
    "end": 1722.359,
    "text": "It makes it simpler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.399,
    "end": 1726.225,
    "text": "There is some biological reasons to believe that that assumption is true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.626,
    "end": 1728.008,
    "text": "Same with the mean field approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.108,
    "end": 1736.962,
    "text": "There are reasons to believe that the brain has these sort of independent separations, but it becomes especially true when you're getting to the actual mathematics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.982,
    "end": 1741.93,
    "text": "There are all these little pieces, Gaussian assumptions, for example, that you start to add on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.011,
    "end": 1743.512,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.532,
    "end": 1744.013,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.033,
    "end": 1744.133,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.771,
    "end": 1752.058,
    "text": " So yeah, let's Okay, so yeah, so the one thing that I've been thinking about is what actions I tell people, then the other thing that people ask me is, well, what is it in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.698,
    "end": 1773.577,
    "text": "And your explanation, at least in the first chapter, I think of the textbook, which is the kind of this notion that the brain is sort of trapped in this cranium and has no access to the world and receives it through this, you know, the sensory data channels was incredibly, I mean, one hears about these in, you know, these examples in philosophy, but I think that was really on the money.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.058,
    "end": 1774.558,
    "text": "So maybe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.825,
    "end": 1777.549,
    "text": " you could do a better job than me at just saying, well, what is the fun?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.609,
    "end": 1796.293,
    "text": "Like, if we're just talking about human, well, cognitive creatures, creatures that are trying to exert some control, some active sensing movement, or even perception, you know, within its environment and trying to survive, let's say without invoking any strong teleology, what is the problem that they face?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.961,
    "end": 1805.778,
    "text": " Yeah, the biggest problem is absolutely that the physical systems that make up the world are hugely complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.58,
    "end": 1810.709,
    "text": "So by complex, I mean there are many, many variables that change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.811,
    "end": 1816.02,
    "text": "Obviously, there's a lot of structure in the world that we can leverage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.0,
    "end": 1836.793,
    "text": " moment to moment um things can move and be very volatile um and so that's i think this is getting a bit into other topics but that's the reason why we formulate you know things like culture and society and structure into our world we make the world more predictable by by having these elements in there that just make there's less overhead computational overhead and i think that's why",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.162,
    "end": 1853.369,
    "text": " We look at the evolutionary history of humans, social groups, smaller social groups, and the ability to see others as part of your whole, like you're part of a community of people where you all collectively care about each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.63,
    "end": 1856.655,
    "text": "I think these are all survival techniques that come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.787,
    "end": 1862.735,
    "text": " Um, and they're a necessity for making the world more certain because things can change at any moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.795,
    "end": 1868.542,
    "text": "You know, even just, you know, you drive to work one day, um, and the roads closed, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.562,
    "end": 1873.93,
    "text": "Like their decisions, even in an irregular world, there are always things that come up all the time in your personal lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.95,
    "end": 1880.258,
    "text": "You get sick, um, you know, things come up, meetings get canceled and you're, you have to go, you know, change your schedules, things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.578,
    "end": 1882.12,
    "text": "Those are all part of our everyday lives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.841,
    "end": 1883.402,
    "text": "And.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.091,
    "end": 1899.619,
    "text": " Ultimately, I think the idea is that when we think about active inference, it's the idea of if we're trying to deal as these biologically, from the biological perspective, we're looking at humans trying to make sense of their world and quickly identify what's going on and quickly make a decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.409,
    "end": 1924.51,
    "text": " the purpose of survival which is the whole point it's not to represent the world perfectly and all these other things we might want to do it's literally to be able to survive and pass on our genes to the next generation then what are the minimum requirements to be efficient to do that and also make those decisions in a really quick time knowing that the computational complexity of the world is enormous and we're dealing with like you know fractal levels of systems of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.49,
    "end": 1932.082,
    "text": " nested hierarchies of things that are changing dynamically, how can we leverage the data that we have to quickly make decisions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.903,
    "end": 1948.607,
    "text": "And I think if we're talking in the most broad spectrum of thinking about active inference, it's looking at how the brain has solved this problem and attempting to write that down mathematically, or at least something that behaves like how we perceive the brain to be behaving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1949.296,
    "end": 1950.117,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.137,
    "end": 1950.458,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.478,
    "end": 1959.75,
    "text": "So the way that I kind of see it at its very core is that you have, as you say, a coupled system, the environment, the agent in the arena, the environment and the organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.852,
    "end": 1968.061,
    "text": "And the organism hasn't got direct access to the environment, but it has direct access to sensory observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.083,
    "end": 1970.865,
    "text": "And so it develops",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.082,
    "end": 1979.151,
    "text": " a so called generative model, which is trying to, in some ways mimic or replicate the so called generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.651,
    "end": 1986.819,
    "text": "generative process is the fact that there are so called hidden causes or latent causes out there in the world, which actually generate those sensory data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.839,
    "end": 1996.169,
    "text": "And we're trying to have a model of the model of the world or be a model of the world, whatever you want, which maps onto that, albeit not perfectly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1996.189,
    "end": 1998.051,
    "text": "And I think this is a really important point, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.419,
    "end": 2001.222,
    "text": " Well, then we would just be the world and we don't want to be the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.242,
    "end": 2001.823,
    "text": "We want to be us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.883,
    "end": 2004.025,
    "text": "And so we have our preferences and whatnot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.045,
    "end": 2011.954,
    "text": "Now let's, I want to go to sort of expectation maximization, because I think it's a really interesting way into this problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.174,
    "end": 2022.165,
    "text": "So if we were, let's, let's not even think about genetic priors or phenotypic priors, because in some ways that hacks its way to an answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.449,
    "end": 2029.599,
    "text": " If I was John Locke and I thought the brain was really a tabula rasa, like I literally give it nothing but the capacity to take in sensory observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.241,
    "end": 2034.626,
    "text": "What's my way of building a generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.987,
    "end": 2039.213,
    "text": "I have my sensory observations and that's about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.553,
    "end": 2047.304,
    "text": "And I want to build a model with hidden causes and parameters that relate the hidden causes to those sensory observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.765,
    "end": 2050.228,
    "text": "What is the kind of technical way of doing that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.183,
    "end": 2057.772,
    "text": " So if we're talking in kind of like you said, like a tabula rasa kind of thing where it's just- Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.792,
    "end": 2058.533,
    "text": "I saw that with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.553,
    "end": 2062.76,
    "text": "You can think of maybe like a uniform prior was the way that invasion inference you would think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.94,
    "end": 2072.475,
    "text": "You don't necessarily have any particular belief about what the state of the world is like de novo, and you would accumulate over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.637,
    "end": 2078.224,
    "text": "So I think that this is, when we do active inference simulations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.204,
    "end": 2083.911,
    "text": " We're essentially mimicking that because you might have some very basic simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.951,
    "end": 2090.42,
    "text": "You can put a uniform distribution over your model, and you're kind of just saying all states are kind of flat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.6,
    "end": 2098.71,
    "text": "I don't have any one belief that one state is more likely than any other in my environment, and I have to just learn what is out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.825,
    "end": 2100.869,
    "text": " with just this really simple model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.91,
    "end": 2109.443,
    "text": "I think it's really hard to not have some assumptions because even in a model like that, you still have a Gaussian assumption about likelihood and prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.463,
    "end": 2124.529,
    "text": "And you also have some kind of generating equation where you have some mapping that's there about, okay, what is the relationship between environment states and the sensations that I as this agent experience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.509,
    "end": 2125.851,
    "text": " Those are kind of built into the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.911,
    "end": 2138.91,
    "text": "So I think there's always I think it'd be very hard to start from nothing other than doing kind of like a sort of like an evolutionary kind of algorithm where you just have random connections forming over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.331,
    "end": 2142.636,
    "text": "And the ones that survive are the ones that make good connections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.616,
    "end": 2146.102,
    "text": " And that's probably how you get off the ground in the first place is like in a limited environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.502,
    "end": 2162.228,
    "text": "There's just random selection going on and you just have you could have just a big set of random connections in a likelihood and even maybe just choose from a random set of family distributions from the exponential family and then just kind of see run it and see what you get out of that, which ones survive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.208,
    "end": 2169.934,
    "text": " And the one that survives, you propagate it to the next generation and you continue to run more experiments in a dynamic environment and see which one comes out of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.115,
    "end": 2179.462,
    "text": "And what you'll probably be left with at a certain point is something like those kind of priors that we talked about, like where you were saying not to get too much into like the genetic priors and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.783,
    "end": 2183.746,
    "text": "They probably come from that kind of a process is that you have supervised learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.066,
    "end": 2185.067,
    "text": "That's kind of what evolution is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.107,
    "end": 2192.113,
    "text": "It's like many, many years of this sort of training with the environment and the ones that succeed are the ones that pass to the next generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.106,
    "end": 2197.752,
    "text": " Yeah, so I think this is a really interesting question, actually, because I've never really thought about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.872,
    "end": 2203.981,
    "text": "But I don't want to get too philosophical, because it's it's an unanswerable question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.822,
    "end": 2210.73,
    "text": "But as you say, if there was no, so we might have some prior, we can have like a Gaussian assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.77,
    "end": 2215.376,
    "text": "But let's say we just actually had no prior expectations over latent causes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2216.918,
    "end": 2220.463,
    "text": "It seems to me that the, this, the space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.882,
    "end": 2226.01,
    "text": " of potential latent causes is near infinite, at least in its gradations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.23,
    "end": 2244.679,
    "text": "I could go from every single decimal point all the way down, which makes me think that at the very inception of life, let's say, how do we even get off the ground at all, given that every single potential hidden cause is as likely as another?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.148,
    "end": 2252.88,
    "text": " And once I have one or two, then sure, I can bootstrap off those and get to some descriptive viability in terms of my model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.521,
    "end": 2261.714,
    "text": "But if you literally had something that had none, maybe some assumptions like a Gaussian assumption, but in terms of actually expected states, none.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2263.216,
    "end": 2265.62,
    "text": "How do you even get off the ground on randomness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.7,
    "end": 2268.945,
    "text": "Because can't you just go in infinite directions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.242,
    "end": 2273.749,
    "text": " So are you familiar with Terence Deakins?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.789,
    "end": 2275.132,
    "text": "Terence Deakins is a philosopher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.172,
    "end": 2278.218,
    "text": "He has something called the Autogen in his 2011 book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.459,
    "end": 2282.547,
    "text": "I'm faintly familiar with him, but not enough to really say much about him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.337,
    "end": 2287.864,
    "text": " Okay, so I'm going to appeal to this because I think it's a really interesting way of kind of motivating this question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.884,
    "end": 2294.495,
    "text": "And this is getting to more in the broader topics about like Autopoies' self-organizing and self-maintaining systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.138,
    "end": 2308.838,
    "text": "I would say that his example of the Autogen is an example of, and I'll explain this in a second, of how could something get off the ground from basically nothing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.818,
    "end": 2322.739,
    "text": " And so when he proposes the autogen, the very brief idea is that he says, suppose you just have some molecules that are just in a liquid, some kind of solvent, and they're just these molecules floating around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.779,
    "end": 2325.763,
    "text": "And when they're in close enough proximity to each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.743,
    "end": 2328.587,
    "text": " they're able to form a little catalytic reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.988,
    "end": 2344.292,
    "text": "So imagine four molecules, one makes the other in a chain such that A makes B, B makes C, C makes D, but D makes A. So now you have this little self-sustaining propagating chain just because of pure chemical dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.458,
    "end": 2349.346,
    "text": " But if there's not enough raw materials to make those proteins, it'll eventually fall apart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.248,
    "end": 2354.595,
    "text": "But suppose that an enclosed membrane depends on some of those proteins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2355.396,
    "end": 2362.668,
    "text": "So then you get this positive feedback loop where the existence of those proteins encloses it in a small space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.289,
    "end": 2365.673,
    "text": "And so it perpetuates that reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.653,
    "end": 2378.335,
    "text": " And also the raw materials are outside of that membrane so that whenever the membrane deteriorates, because there's lack of components, the raw materials just float back in and they resustain the system again, which then rebuilds that cell wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.555,
    "end": 2384.185,
    "text": "Or you can think of it as just, it could be just molecular components that are just housing that reaction in a small space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.165,
    "end": 2388.534,
    "text": " So in that small space, you effectively limited the state space based a very small number of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.456,
    "end": 2396.952,
    "text": "And the breakdown of that system is a negative, that negative feedback cycle ends up causing the system to then regrow again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.513,
    "end": 2397.713,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2397.833,
    "end": 2399.637,
    "text": "So you can motivate that probabilistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.838,
    "end": 2405.329,
    "text": "Like I'm, you can make a simulation where that, you know, those are all in probability distributions and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2405.309,
    "end": 2428.903,
    "text": " we're not assigning agency to that it's not like it knows what it's doing but one can see how you could scale that up into more and more complex systems and arguably that's exactly what's happening in the brain if you think about it in terms of self-organization you're just looking at another set of positive and negative feedback loops in a huge scale that we describe in the language of probability theory um so that's another way yeah i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.17,
    "end": 2440.0,
    "text": " Well, it's very, obviously, it's very reminiscent of autopoiesis as first introduced by Varela and Maturana, and then sort of taken up in the 90s by people like Evan Thompson.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.541,
    "end": 2445.606,
    "text": "But I don't, I'm sort of stretching into my past reading here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.626,
    "end": 2455.515,
    "text": "And I'm not 100% sure that something like a classic autopoetic system needs to break down its, you know, needs a breakdown of its membrane in order to build up its membrane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.883,
    "end": 2469.001,
    "text": " I think you can invoke something like a partially permeable membrane where you just have the constant flooding of raw materials, which allow the metabolism to happen that still recreates that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.041,
    "end": 2476.592,
    "text": "Because obviously, the partially permeable membrane itself is going to dissolve or break down because of entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.365,
    "end": 2479.269,
    "text": " And so you allow it to build back up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2479.289,
    "end": 2491.375,
    "text": "It's more or less the same, I guess, to be a philosopher, an annoying philosopher, you continue to ask, well, how do we get the kind of what would be operational organisational closure, whereby you have a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.608,
    "end": 2499.615,
    "text": " A instigating B, which instigates C, which instigates D, but then that also instigates A. How does that loop get off the ground in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2499.715,
    "end": 2502.918,
    "text": "Because I feel like autopoiesis is a very good description of things as they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2503.738,
    "end": 2509.463,
    "text": "And the classic example is the cell, the cell which creates itself from within.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.564,
    "end": 2516.329,
    "text": "But I guess the question is, how does that circularity, how does that circular causality, as they say, get going in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.349,
    "end": 2520.973,
    "text": "And I think that's probably, at this moment in time, an unanswerable question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.814,
    "end": 2522.675,
    "text": " I definitely agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.755,
    "end": 2527.502,
    "text": "So first of all, just to say that, yeah, this is not the only kind of system we could imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.522,
    "end": 2530.807,
    "text": "This is just one example that I think just captures the basic ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.867,
    "end": 2532.75,
    "text": "And there may be many other ways of doing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.791,
    "end": 2544.767,
    "text": "This is getting a little bit out of my, this is definitely out of my field of expertise, but just from when I was in graduate school, there were labs, friends of mine that worked in labs in synthetic biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.747,
    "end": 2549.992,
    "text": " Um, and they were building that you were using DNA and other types of other molecules like proteins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.393,
    "end": 2557.2,
    "text": "And they were doing experiments exactly like these where, um, autocatalytic reactions would just form, uh, given certain set of conditions being met.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.901,
    "end": 2571.615,
    "text": "Um, and so they would just, you know, put particular compounds in, cause you don't always know which ones will work, but you can toss them in and under specific conditions of heat and pressure and whatever, uh, salts and whatever compounds are needed, um, metals you end up getting, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.595,
    "end": 2575.741,
    "text": " autocatalytic loops forming, very simple ones that of course break down over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.702,
    "end": 2580.427,
    "text": "I don't think anything like the autogen as far as I know has been replicated in a lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.029,
    "end": 2590.06,
    "text": "But at least like the getting off the ground part, I think just from, you're probably familiar with Stuart Kaufman's term like order for free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.04,
    "end": 2615.44,
    "text": " um you you do have uh like especially when your state space is constrained when there's only a certain set of possibilities you have less possibilities and then you kind of get this idea where one system starts forming you constrain the state space further and you get this kind of building domino reaction where eventually you end up getting something that seems convergent because of small little chains of random decisions that were kind of made along the way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.47,
    "end": 2617.674,
    "text": " So that's kind of one way I look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.694,
    "end": 2621.441,
    "text": "I don't know too much about synthetic biology, so that's not my area, but yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.103,
    "end": 2624.768,
    "text": "Well, I had Mike Levin on and I should have asked him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.108,
    "end": 2626.03,
    "text": "My fault.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.112,
    "end": 2635.588,
    "text": "So let's then build in something... So evolution has bestowed on us these genetic priors, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.058,
    "end": 2639.162,
    "text": " I don't think we need to necessarily get into what is the essence of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.443,
    "end": 2648.233,
    "text": "Because the nativist position or really is a kind of prior or prior knowledge is still quite fuzzy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2648.273,
    "end": 2653.059,
    "text": "I feel like whether it's a mechanism or an actual piece of knowledge, and this goes all the way back to Chomsky.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.74,
    "end": 2659.166,
    "text": "But what's the kind of so I want to I want to get to expect expectation maximization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2660.708,
    "end": 2664.613,
    "text": "Whether that's deriving a prior from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2664.998,
    "end": 2672.57,
    "text": " parameters and an observation, or whether that's deriving parameters from a prior and not an observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.371,
    "end": 2686.551,
    "text": "What's this kind of, it's just very, there's a very beautiful, again, it's kind of like a circular causality whereby you can derive one from, and it's a kind of work in progress, trial and error process, but you'll be far better explaining it to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.012,
    "end": 2690.517,
    "text": "So for the audience who don't know what expectation maximization is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.003,
    "end": 2693.342,
    "text": " What is it and what does it give us?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.362,
    "end": 2695.782,
    "text": "How can we bootstrap our way to intelligence with it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.297,
    "end": 2703.664,
    "text": " So expectation maximization is algorithm that was developed in a 1978 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.684,
    "end": 2706.747,
    "text": "I think it's Dempster is the first author on that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.787,
    "end": 2720.281,
    "text": "And what was essentially happened in the 90s was that algorithm was kind of put into the unsupervised learning foundations that were going on in that time, specifically what's called linear Gaussian systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.722,
    "end": 2725.667,
    "text": "That's where it was being understood in that particular context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.647,
    "end": 2731.738,
    "text": " And you can see that variational inference is kind of like a more broader perspective on expectation maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.419,
    "end": 2741.715,
    "text": "So from the perspective you're asking about, the EM, expectation maximization algorithm, is a way of essentially, there's kind of a bootstrap going on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.657,
    "end": 2749.208,
    "text": "So on the one hand, you have some kind of a model, and I'm speaking more from the perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.188,
    "end": 2754.297,
    "text": " predictive coding type of perspective on or unsupervised learning perspective, I should say, is a bit more accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.258,
    "end": 2757.001,
    "text": "Yeah, there's many different ways you can interpret it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2757.021,
    "end": 2762.39,
    "text": "So this is a particular way of looking at it in the systems where you have latent variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2762.55,
    "end": 2767.118,
    "text": "So you have something unknown and all you have is sensory data of some kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.499,
    "end": 2769.542,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.522,
    "end": 2798.668,
    "text": " the idea is well the problem is that you're trying to figure this out what you're trying to do is you're saying okay we know that there are some states out there in the world and they're generating data and there's some function that relates that has parameters that relates to that relationship so for example in a linear setting um the relationship between hidden states and sensory data will just form a line just a linear relationship maybe it's just uh you know just as an example it could just be 3x plus one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.648,
    "end": 2803.705,
    "text": " So you take any hidden state value, multiply by three, you add one, and that's what your data is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.668,
    "end": 2807.779,
    "text": "Well, there are, there could be parameters that we might add in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.04,
    "end": 2811.612,
    "text": "So other little, other things that could change the nature of that relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.638,
    "end": 2813.78,
    "text": " The problem is you don't know that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.9,
    "end": 2817.645,
    "text": "So you don't know what those parameters actually are, but you also don't know the hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.286,
    "end": 2820.429,
    "text": "So you basically have two things that you're missing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2821.331,
    "end": 2823.173,
    "text": "Parameters in this sense are not random variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.193,
    "end": 2824.856,
    "text": "They're treated in the EM algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2824.896,
    "end": 2826.778,
    "text": "They're just point estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.859,
    "end": 2827.76,
    "text": "They're single values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.962,
    "end": 2832.286,
    "text": "But then you have this probabilistic system on the other side here generating that information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.306,
    "end": 2834.089,
    "text": "Your hidden states have noise on them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.132,
    "end": 2838.415,
    "text": " So now you have the situation, all you have here is just some data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.976,
    "end": 2844.942,
    "text": "So can you take that data and from that data, learn about the other parts of the system that you don't know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2845.783,
    "end": 2849.147,
    "text": "And the reason this works is because the data is conditioned on those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.767,
    "end": 2850.548,
    "text": "It's affected by it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.588,
    "end": 2851.85,
    "text": "It's not like in isolation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.43,
    "end": 2858.557,
    "text": "In some sense, you can think of it like they lie behind the data itself and they're part of that process in some way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.597,
    "end": 2860.379,
    "text": "The problem is it's all mixed together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.039,
    "end": 2864.683,
    "text": "So this is sometimes motivated in like a signal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.663,
    "end": 2869.408,
    "text": " a blind source separation problem or signal unmixing in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.84,
    "end": 2872.322,
    "text": " in signal processing literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.362,
    "end": 2880.031,
    "text": "And so the EM algorithm is a very clever way of getting off the ground, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.052,
    "end": 2884.336,
    "text": "You described it kind of like the circular causality or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.356,
    "end": 2894.607,
    "text": "It's kind of a bootstrapping perspective where you say, well, I don't know what that hidden state is out there, but I can start from a random guess and get my expectation of what I think it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2894.728,
    "end": 2895.809,
    "text": "What's the most likely value?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.829,
    "end": 2897.691,
    "text": "It probably is given what I currently believe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.038,
    "end": 2927.374,
    "text": " then from that hidden state you do maximum likelihood estimation to say well here's what from if this state is this way here's what i think the parameter is most likely to be um given that i've just estimated what the state is and then you you go back to the next round you say okay usually you can motivate this in terms of a like a gradient descent or there's many ways to look at this problem but basically uh usually use the log likelihood as your as your objective function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.759,
    "end": 2937.871,
    "text": " or negative log likelihood, and you say, okay, well, I'm gonna make another adjustment down the log likelihood for a new guess at what the hidden states are, what my expectation is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.313,
    "end": 2941.262,
    "text": "Now that I have those new parameters I just estimated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.867,
    "end": 2951.536,
    "text": " And then you go back another round again and you keep going in this circle until you hit convergence, which I will say that EM natively often has trouble converging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.737,
    "end": 2955.5,
    "text": "So you may have to add other constraints to make that system work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2956.121,
    "end": 2958.964,
    "text": "But ultimately you get off the ground with just sensory data alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.304,
    "end": 2961.907,
    "text": "You are able to estimate other things that you don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.927,
    "end": 2967.452,
    "text": "And that's the essence of also variational Bayes is very similar to that as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.09,
    "end": 2973.317,
    "text": " That was what I thought the answer to my tabular as a question was, but we got to auto gens, which was, which was cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.757,
    "end": 2981.226,
    "text": "Um, yeah, there's, I guess, yeah, I guess, uh, you mentioned, I was going to ask, um, you mentioned maximum likelihood estimation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2981.747,
    "end": 2984.471,
    "text": "So I think it's what people might not know what that means.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.891,
    "end": 2989.677,
    "text": "Um, what, what is Mac maximum likelihood estimation and how does it feed into this picture?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.361,
    "end": 3000.996,
    "text": " So maximum likelihood estimation is a really well-known statistical technique that has its origin in many different... It's used in a lot of frequentist statistics as well as Bayesian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.597,
    "end": 3015.259,
    "text": "There are many ways to kind of formulate it, but the basic idea that the way that I like to think about it in terms of this sort of predictive coding or active inference based perspective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.475,
    "end": 3024.591,
    "text": " just because that's kind of the common language we're using right now, is to say we have some unknown variable of some kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.132,
    "end": 3027.978,
    "text": "So you have something that's latent in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.16,
    "end": 3037.635,
    "text": "Can we estimate the most likely value of that particular unknown variable instead of the whole distribution?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.683,
    "end": 3049.317,
    "text": " So you could get back the whole distribution and do Bayesian inference, or you could turn it more into this restricted problem where you get an estimator, which tells you the mode or mean of that distribution instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.578,
    "end": 3053.602,
    "text": "And you need some kind of a likelihood model to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.622,
    "end": 3058.448,
    "text": "And you make some assumption about, okay, I have P of Y given X, that's your likelihood model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.928,
    "end": 3062.172,
    "text": "You have some guess about how,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3062.152,
    "end": 3068.801,
    "text": " observations and states are related, and you invert that relationship by just finding the mode only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.102,
    "end": 3071.906,
    "text": "So the most likely value instead of the whole distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3072.246,
    "end": 3079.096,
    "text": "And it can be an easier, less computationally expensive problem that you can get a simple update equation for given what distribution you're using.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3080.378,
    "end": 3083.382,
    "text": "But the problem is that it may be a biased estimator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.402,
    "end": 3085.645,
    "text": "It may not be exactly right given",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.625,
    "end": 3110.518,
    "text": " the other assumptions that are in your model um so it's just a convenient way to estimate what parameters are that's kind of the most common way of using it is to say i have some you can use it in linear regression for example what are the most likely parameters that are give rise to this particular model that i have interesting you know it's funny there's a couple of things that come to mind one is that people will be you know people who did",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.92,
    "end": 3117.367,
    "text": " what you would call high school maths, what I would call senior school maths, will be very familiar with these terms, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3117.467,
    "end": 3119.309,
    "text": "Mean, mode, whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.349,
    "end": 3122.433,
    "text": "And yet, it sounds really complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.453,
    "end": 3124.755,
    "text": "So I'm kind of bringing it back to this education point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3126.337,
    "end": 3127.638,
    "text": "Is it really complicated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.838,
    "end": 3132.504,
    "text": "I had a question ran down, which I haven't asked, but you know, people think that the maths is really complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.544,
    "end": 3135.106,
    "text": "Is it really complicated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.126,
    "end": 3138.43,
    "text": "Or does it seem or does it just seem really complicated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3140.755,
    "end": 3147.37,
    "text": " I have to admit that the perspective that I'm going to give you now might have been different than my perspective five years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.112,
    "end": 3151.038,
    "text": "So it's hard to tell sometimes because you're so deep in something, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.158,
    "end": 3154.847,
    "text": "Is it now appearing easy because you've learned all the material?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.867,
    "end": 3157.633,
    "text": "Because I remember how I felt when I first encountered all this stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.613,
    "end": 3164.465,
    "text": " So I'll say that Bayesian mechanics, I think that side of things is a lot harder to explain and a lot more technical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.487,
    "end": 3169.193,
    "text": "You can motivate everything in there as well, probably within probability theory, I would say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.213,
    "end": 3173.901,
    "text": "And that's kind of the approach I'm going to take in the second book is going to be in that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3173.881,
    "end": 3180.489,
    "text": " But if we're just restricting to active inference, I would personally say that it's not as complicated as it looks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.711,
    "end": 3185.896,
    "text": "It all can be motivated in terms of simple distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.037,
    "end": 3189.06,
    "text": "Gaussian's are easy to deal with, means and modes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.541,
    "end": 3198.792,
    "text": "I think what gets complicated is when people start dealing with linear algebra where you just have multiple dimensions in your system, then the notation gets kind of very abstract and compact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.772,
    "end": 3223.108,
    "text": " in the univariate case um everything has a really strict and very simple interpretation that you can you can think about in terms of like equations how you're deriving things um personally i think it's almost there are times when i'm writing and i look back at the equations and i'm like wow there's so few things in here really um when you think about what things you need to tune um and obviously when you're building like huge you know like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.168,
    "end": 3228.695,
    "text": " If you're looking for replicating all aspects of human and animal behavior, yes, it's going to get complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.236,
    "end": 3236.007,
    "text": "But the core actual methodology I would argue is something you could teach to high schoolers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.488,
    "end": 3242.678,
    "text": "You may not use all the technical terms, but you could get them to run a simulation and see what's going on and play around with variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.239,
    "end": 3246.584,
    "text": "And they'll have a pretty intuitive understanding of what's happening, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.985,
    "end": 3247.105,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.76,
    "end": 3255.192,
    "text": " And so how would you recommend, so people, you know, people might not have access to your textbook or they won't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.332,
    "end": 3270.257,
    "text": "And you know, if I'm in the public and the pulpits and Friston textbook, although it's very good, does, I think for a lot of people feel like they've been thrown in the deep end at certain, you know, certain chapters I think are relatively taxing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.469,
    "end": 3272.77,
    "text": " what do you recommend?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.83,
    "end": 3273.251,
    "text": "How do you know?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3273.291,
    "end": 3274.833,
    "text": "How do you recommend people go about this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3274.953,
    "end": 3282.06,
    "text": "If they're not, you know, if they're like me, for example, I'm trying to pick it up and think I'm doing okay, and learning step by step?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3283.201,
    "end": 3284.823,
    "text": "What would you recommend people do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.863,
    "end": 3286.485,
    "text": "Is that are there certain prerequisites?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.505,
    "end": 3288.908,
    "text": "You know, did you do a statistics course?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.928,
    "end": 3290.349,
    "text": "Should you do a linear algebra course?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.369,
    "end": 3291.27,
    "text": "You do a calculus course?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3291.29,
    "end": 3294.874,
    "text": "What are the key fundamentals that people need to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.934,
    "end": 3297.076,
    "text": "And do you have any recommendations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3297.236,
    "end": 3300.7,
    "text": "I mean, this is also asking for myself about how to really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3300.95,
    "end": 3302.894,
    "text": " bootstrap your own learning experience?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.038,
    "end": 3310.008,
    "text": "Well, of course, that's my aim for the book is to provide this perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3310.73,
    "end": 3320.931,
    "text": "But in terms of prerequisites, when I think about what active inference at its real core, having a solid understanding of introductory probability theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.171,
    "end": 3322.654,
    "text": "So we're talking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.634,
    "end": 3331.33,
    "text": " Something you could learn, some people learn it in high school, this kind of introductory probability, just conditionals, joint distributions, and having a good intuitive sense of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.43,
    "end": 3334.275,
    "text": "But it would probably be, for most people, it'd be some undergraduate course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.477,
    "end": 3338.162,
    "text": "The second would be calculus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.172,
    "end": 3344.758,
    "text": " If you want to just learn the concepts, single variable calculus would be enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.878,
    "end": 3350.023,
    "text": "So if you know how to take a derivative and you know what an integral is, that's sufficient for most things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.924,
    "end": 3358.571,
    "text": "And then the third, when you start getting into linear algebra, that's useful when you start talking about more useful systems that are multidimensional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.372,
    "end": 3367.12,
    "text": "But if you're just staying in univariate, everything you can graph, you can visualize, all the equations are just numbers, there's no matrices or vectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3367.758,
    "end": 3377.867,
    "text": " That core idea, which you can get, you know, the scaling of the percentages of active inference from zero to 100% understanding is definitely not linear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.907,
    "end": 3384.914,
    "text": "I think it gets, you know, the distance between 95 and 96 is so much bigger than like zero to 50, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.254,
    "end": 3393.802,
    "text": "So there's levels of understanding, but I think you could get with that alone, you could get 75% of the way there of understanding what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.062,
    "end": 3395.784,
    "text": "Now there isn't a lot of resources on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.884,
    "end": 3397.225,
    "text": "I think ultimately,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.829,
    "end": 3409.825,
    "text": " What you need to do is have some very basic Python programming background and being able to make a very, very simple simulation with the most minimum materials.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.845,
    "end": 3411.428,
    "text": "This is what I was going to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.349,
    "end": 3417.296,
    "text": "A lot of the advice that I've got is, well, I'm going to be doing a PhD.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.516,
    "end": 3419.519,
    "text": "They just say, well, you'll do it during your PhD.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.759,
    "end": 3420.58,
    "text": "The more you do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.914,
    "end": 3422.28,
    "text": " the more the easier it gets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.621,
    "end": 3425.092,
    "text": "And I get I actually think that's the case of a lot of things not own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3425.213,
    "end": 3429.069,
    "text": "I mean, there are certain things where it's not the case, actually, which I think is quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.089,
    "end": 3430.435,
    "text": "So for example, philosophy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.208,
    "end": 3447.648,
    "text": " I would argue that in certain things, actually, sometimes your earlier intuitions are a little bit better because sometimes you end up down such a rabbit hole that you are a bit blinkered and you know, I'm writing stuff on like self models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.768,
    "end": 3452.053,
    "text": "Well, there's just so many recursive elements to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3452.073,
    "end": 3456.819,
    "text": "And so you get a little bit stuck, but I found that for example, uh, coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3456.999,
    "end": 3460.303,
    "text": "So like, oh, I use art because in my day job, I do statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3460.807,
    "end": 3462.27,
    "text": " you really just learn by doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.791,
    "end": 3465.536,
    "text": "And then it becomes like a language in many ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3465.617,
    "end": 3470.406,
    "text": "So would that be, yeah, I want to hear your thoughts on that learning by doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.627,
    "end": 3478.883,
    "text": "It's not necessarily what people have been trained to do because we're used to going to school and reading textbooks, but it sounds like that's a really strong recommendation on your part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3480.213,
    "end": 3480.453,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.493,
    "end": 3482.637,
    "text": "And actually for me, I love reading textbooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.657,
    "end": 3483.898,
    "text": "That for me is how I've always learned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.918,
    "end": 3487.884,
    "text": "I've always been in situations where I didn't have a teacher and that's same with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.964,
    "end": 3489.226,
    "text": "I didn't do research in it first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.867,
    "end": 3492.811,
    "text": "I taught myself active inference and also I taught it while I was writing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.871,
    "end": 3494.994,
    "text": "I mean, there, there isn't any resource out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.014,
    "end": 3497.278,
    "text": "There are a lot of little tricks that are in people's heads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.779,
    "end": 3502.946,
    "text": "So even when I have all the model in front of me, just tuning it with like learning rates and stuff, there's all kinds of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.966,
    "end": 3504.068,
    "text": "I have no idea what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.348,
    "end": 3505.39,
    "text": "It just comes from trial and error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3506.491,
    "end": 3507.773,
    "text": "So I think,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.753,
    "end": 3534.435,
    "text": " yeah i have the perspective of yes i love learning from textbooks but i learned the most teaching was one way teaching it to people but also through just messing around with the models and the crazy thing about the active inference models that's really really nice about them the simple ones is that um if you're just trying to just do a very basic simulation everything is analytic update rules so if you can just take a derivative and you can do a bit of addition and subtraction um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.989,
    "end": 3551.833,
    "text": " Knowing how all the pieces fit together is a challenge, but the actual code for a really simple active inference model is just a bit of for loops, addition and subtraction, and some like updating of some data structures, just so you can keep track of the history of how the system evolves over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.875,
    "end": 3555.659,
    "text": "The actual core of it is really simple to implement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.679,
    "end": 3564.692,
    "text": "And that's my experience is the, what I try to do in the book, especially in the revisions I'm doing right now, I went through doing revisions at the moment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.672,
    "end": 3577.112,
    "text": " having pseudo code that is nearly exact to what you would put into Python or R. So you start out, you initialize these things, then you make a loop and then you update these things in a loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.598,
    "end": 3584.607,
    "text": " And then you interact with the environment, get a new data point, or you act on it, depending on what your first perception or action, and you just continue that loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.627,
    "end": 3585.949,
    "text": "And all of the equations are right there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.49,
    "end": 3591.917,
    "text": "So there may be a couple of different ways you could put it into code, but ultimately the sequence is really clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.457,
    "end": 3604.433,
    "text": "And I think that part of it, with a bit of guidance, someone who doesn't have a lot of experience in probability could get a feel for what's going on without even knowing all of the requisite background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3604.683,
    "end": 3606.305,
    "text": " and all the details that go into there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.325,
    "end": 3607.066,
    "text": "And that's the fun part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3607.126,
    "end": 3616.356,
    "text": "I really want to, that's kind of something for the future is to have like sliders and stuff like on a website where you can just play around with sliders and learn by just interacting with a graph that has a pre-made model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.157,
    "end": 3619.339,
    "text": "You can get so much intuition from just doing that alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.26,
    "end": 3622.022,
    "text": "Yeah, I think that would be great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3622.042,
    "end": 3629.07,
    "text": "I also wonder whether a thing that's been really useful for me, and really this is just because of the generosity of people who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3629.287,
    "end": 3630.889,
    "text": " you know, are being far too kind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3631.029,
    "end": 3634.853,
    "text": "Someone like Carl walking me through a soft max function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.234,
    "end": 3637.737,
    "text": "Um, just cause he's nice and generous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.277,
    "end": 3639.719,
    "text": "I wonder how, how much did you use?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3640.079,
    "end": 3642.382,
    "text": "No, you're saying you're teaching yourself active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.422,
    "end": 3644.805,
    "text": "How much did you get out of corresponding with other people?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3645.085,
    "end": 3653.775,
    "text": "And is there anyone that sort of comes to mind that the sort of has, you know, formalized intuitions or has been a good sort of a discussion partner?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3655.257,
    "end": 3668.855,
    "text": " So possibly to my own detriment, I seem to have a habit of having to do everything myself, which on the one hand is really good because I get to learn things really deeply and I have to go into it and really understand it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.155,
    "end": 3671.038,
    "text": "But on the other, it's been a big challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.058,
    "end": 3677.947,
    "text": "And the honest answer to that question is there are very few people that I've actually interacted with personally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3678.227,
    "end": 3682.733,
    "text": "Now that I've been working at Diversys now since December and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.713,
    "end": 3686.557,
    "text": " There, I definitely have now started to for a lot of the technical questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.219,
    "end": 3693.124,
    "text": "Magnus Quedal is one person who's been very, very helpful on the factor graph side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.665,
    "end": 3694.726,
    "text": "Lance DaCosta as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.066,
    "end": 3701.934,
    "text": "Recently, we spoke and he was very helpful helping me out with generalized coordinates of motion, which are still very, very tricky for me to understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.974,
    "end": 3706.999,
    "text": "They're a pretty big challenge in active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.979,
    "end": 3733.51,
    "text": " um and i would say that for me it's been more brute force so there are two or three really good reviews um luckily at all 2017 it's very dense um also rafael um bocax i hope i'm not pronouncing that yeah correctly that's another uh review and there are a couple others too like the uh ryan smith's paper with with carl um and christopher white um that has the uh discrete time tutorial",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3733.49,
    "end": 3741.262,
    "text": " Essentially, it's what I did was I took those papers, and then I scoured the internet for code examples and little snippets, and put all that together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.103,
    "end": 3744.266,
    "text": "And that took me five years to get to that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.528,
    "end": 3749.294,
    "text": "But that's what I did is just that and then constantly reading papers and being confused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.414,
    "end": 3754.001,
    "text": "And so maybe it could have been easier, but there was no Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.061,
    "end": 3754.902,
    "text": "I didn't know people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.944,
    "end": 3756.605,
    "text": "That was the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3756.645,
    "end": 3758.147,
    "text": "I was working in isolation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.633,
    "end": 3759.274,
    "text": " Which is a challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.294,
    "end": 3760.256,
    "text": "It always is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3760.556,
    "end": 3761.057,
    "text": "Well, good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3761.218,
    "end": 3762.159,
    "text": "I mean, it's amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.44,
    "end": 3764.564,
    "text": "I mean, it's super cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.006,
    "end": 3774.381,
    "text": "Yeah, I point people in the direction of Smith and colleagues, but there are other tutorials because I've spoken to Ryan as well, and he's great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3774.783,
    "end": 3801.887,
    "text": " think that's the easiest one although to be honest i always i always go into it and then like get halfway through and i'm like ah i've got some philosophy to do and then i said yes really long and i think um yeah i think you're right you need to have the coding up with you while you're doing it and and you're sort of figuring things out on the go and that's for my phd so i'm not going to do that yet it's an interesting point about coding because i feel like um my",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.373,
    "end": 3805.376,
    "text": " intuition here is that it's all been happening on MATLAB.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3805.696,
    "end": 3814.764,
    "text": "This is a very nerdy technical point, but people might find it interesting because they might, as you say, go now inspired by this and try and build their own active inference simulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.245,
    "end": 3827.656,
    "text": "So, you know, Carl's famous MATLAB that you can download where, you know, you said that I think there is a Python, there is a Python, you know, whatever you would call it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3828.897,
    "end": 3831.339,
    "text": "Packaging that you can package that you can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.72,
    "end": 3832.06,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.411,
    "end": 3837.503,
    "text": " Would you say one is superior than the other?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.523,
    "end": 3843.898,
    "text": "I mean, most psychologists are used to R. What's the kind of good starting point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.918,
    "end": 3844.74,
    "text": "You mentioned Python.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.482,
    "end": 3848.108,
    "text": "Would you recommend Python for a starting point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3849.893,
    "end": 3870.568,
    "text": " so i i so the book is i'm using python as the main language in the book um and uh i so i i've used r for many as the first real language i used in grad school was r for most of my phd work so i'm familiar with r as well matlab i only have a passing familiarity with i used a little bit in my one of my postdocs but um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.612,
    "end": 3874.837,
    "text": " Like anything, like any tool, it depends what you're trying to do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.558,
    "end": 3883.89,
    "text": "Personally, I think that you can make some really quick data processing in R, especially with how it becomes tidyverse and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.051,
    "end": 3886.835,
    "text": "You can do some quick processing and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.855,
    "end": 3889.579,
    "text": "You can do a lot of quick stuff in R. That's my life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.26,
    "end": 3895.628,
    "text": "I love tidyverse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.793,
    "end": 3896.474,
    "text": " It's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.534,
    "end": 3898.216,
    "text": "And it made a little language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.556,
    "end": 3901.058,
    "text": "Some people might even argue it's not even R anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.079,
    "end": 3903.381,
    "text": "It's a new thing on top of it or a framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.441,
    "end": 3911.049,
    "text": "But there are ways that you can make a quick and dirty script in R that does active inference super easily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.369,
    "end": 3912.55,
    "text": "You can do the same in MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.692,
    "end": 3916.074,
    "text": "I find MATLAB to be really confusing, personally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.475,
    "end": 3925.564,
    "text": "And Python, I'm only picking because it's kind of the de facto language for machine learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.865,
    "end": 3931.892,
    "text": " If you're trying to build big systems with it, you might get into trouble if you don't know what you're doing because things get very complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3931.933,
    "end": 3938.08,
    "text": "But if you're just doing simple scripts, there isn't a lot of stuff that stands in the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3938.561,
    "end": 3940.123,
    "text": "So I like Python because it's kind of clean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.143,
    "end": 3942.045,
    "text": "R is fairly clean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3942.105,
    "end": 3948.413,
    "text": "I think people are unfair to R. I think it actually is a great language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.646,
    "end": 3952.39,
    "text": " I would say that there's nothing wrong with using any of the three languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.551,
    "end": 3953.952,
    "text": "It's just whatever you're comfortable with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.273,
    "end": 3961.541,
    "text": "And I would say that the minimum hello world of active inference would probably look pretty similar in all three languages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.923,
    "end": 3967.768,
    "text": "It really just comes down to something like slicing notation and really basic things might differ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.868,
    "end": 3976.038,
    "text": "But the actual code, there isn't anything super specialized if you're just doing a really simple discrete or continuous time active inference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.498,
    "end": 3977.86,
    "text": "I'm not sure that answered your question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.127,
    "end": 3992.237,
    "text": " no no that answers my question that's my question and yeah i think people as you say hopefully over time we'll find more and more resources that kind of guide them through the process we'll get there um i want to get to verses at some point next point but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3992.977,
    "end": 4012.69,
    "text": " we had a good back and forth about priors and i i feel like it would be remiss of me not to mention priors um i also had this chat uh with ronnie sladky who had written this paper the amygdala complex um from an active inference perspective which i think i mean i read a lot of active inference papers as you can imagine not only for this but for my own work and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4013.041,
    "end": 4023.412,
    "text": " That was really, I think the first place where I really felt that the notion of priors had been nicely disambiguated because they are so, it's so loosely used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.013,
    "end": 4024.213,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.494,
    "end": 4041.192,
    "text": "So people will talk about, and I think, I think until you're familiar with something like the POMDP scheme, it's, it's very confusing because at least in the POMDP schemes, for example, you have D matrix, you know, your initial state prior, you have your C matrix, the preference prize, and that begins to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4041.661,
    "end": 4044.29,
    "text": " separate things in a way that's possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4047.341,
    "end": 4051.857,
    "text": "You have a really nice diagram, which I wish I could show, but I'm not going to share my screen so it won't work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.191,
    "end": 4057.799,
    "text": " But, you know, we have different priors in active inference, although we lump them under this kind of general term prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.14,
    "end": 4059.822,
    "text": "So we talk about preference priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.082,
    "end": 4064.609,
    "text": "We talk about, and that kind of builds in stuff like phenotypic priors or genetic priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4065.23,
    "end": 4066.712,
    "text": "And then we also have state priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4067.173,
    "end": 4081.033,
    "text": "And I think the main difference that is, you know, intuitive to me and hopefully intuitive to other people is, you know, in all aspects of life, both are going to be at play because you need to work out where you are more or less or what's going on and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.334,
    "end": 4082.876,
    "text": " So basically what the state you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.477,
    "end": 4087.542,
    "text": "But then you're also always going to have a preferred version of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.562,
    "end": 4091.087,
    "text": "I mean, it's a terrible way to put it, but you're going to have a preferred outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.107,
    "end": 4092.829,
    "text": "You're going to have a preferred state that you want to be in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.849,
    "end": 4094.371,
    "text": "And there might be a divergence there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.212,
    "end": 4099.979,
    "text": "Is there any other kind of type of prior that you might want to build into that picture?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.099,
    "end": 4106.347,
    "text": "And how problematic just more generally is this idea that we just have priors, posterior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4107.108,
    "end": 4108.991,
    "text": "People don't even talk about likelihood distributions, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.011,
    "end": 4110.733,
    "text": "They just talk about prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.22,
    "end": 4116.672,
    "text": " or sensory data, which is confusing once you start looking at like an A matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.313,
    "end": 4121.141,
    "text": "So yeah, let's just kind of get into the nitty gritty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.863,
    "end": 4123.627,
    "text": "How many different types of priors are there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.927,
    "end": 4125.21,
    "text": "Will they end up all being the same?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.27,
    "end": 4126.613,
    "text": "What's the kind of situation there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.567,
    "end": 4158.203,
    "text": " i think the distinction comes down to how we're talking about priors um like you said right they're used in so many different ways so i would say like in the most general non-technical sense when people use the word prior they typically mean assumptions that are held by the agent in some way some kind of assumption and assumption can even just mean like um you know my actions have consequences you know i take an action i get a sensory out you know it could even be something like um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.786,
    "end": 4164.01,
    "text": " just built-in assumptions about the structure of the world itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.13,
    "end": 4166.632,
    "text": "So if you're talking- Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4166.712,
    "end": 4180.184,
    "text": "So if you're talking very broadly, yeah, a likelihood you can call it a prior if you're saying this really, really vague sense of just anything that's your assumption about whatever's going on, about how you think the world operates or how your own actions operate, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.865,
    "end": 4189.793,
    "text": "Now that's, of course, I think where the confusion comes from is that prior just kind of means like presuppositions or assumptions that are sort of just there in the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.773,
    "end": 4195.778,
    "text": " When we think about prior in the Bayesian sense, then it has to take on a really specific meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.679,
    "end": 4211.653,
    "text": "So I think that's where the modeling, when you talk about an actual POMDP or you're looking at a Bayesian network, that to me is where you can be a lot more particular about what kind of prior you're dealing with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.753,
    "end": 4219.56,
    "text": "So just to be clear here, a prior in that sense means you have a variable whose value is uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.317,
    "end": 4226.202,
    "text": " So you can have a distribution over the values that that variable is most likely to take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.023,
    "end": 4237.331,
    "text": "You don't know which one is the one that's gonna actually take, but you have learned from some interaction through data or possibly through evolution or through teaching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.972,
    "end": 4249.902,
    "text": "People learn about how the world works by parents teach us certain priors about how using prior in a bit of kind of both senses of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4249.882,
    "end": 4273.493,
    "text": " you could motivate it in an evasion way but it'd be like prior is about here is how the world works and those could be part of your values right you can you can think of it in such so many broad ways so this thing is the problem is that we take these models that are really simple and we're trying to describe them attribute them to really hugely complicated things like culture and things like that and it's a lot harder than what does a prior innovation network look like when you're talking about culture",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.114,
    "end": 4275.916,
    "text": " I mean, you could think of it in 10 different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.936,
    "end": 4283.025,
    "text": "I mean, I'm sure you could make a model for what those priors are like and how they work into a model of human behavior, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.506,
    "end": 4285.508,
    "text": "But there is no right way to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.628,
    "end": 4289.653,
    "text": "I think it depends how you're kind of structuring the research problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.654,
    "end": 4294.479,
    "text": "So getting more to your question, you're asking like, what other kind of priors are there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.579,
    "end": 4296.882,
    "text": "I mean, I think there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4297.503,
    "end": 4325.772,
    "text": " Like you said, there are priors about the agent's expectations about how the environment behaves, its preferred states about what states it would like to be in the environment, but also all the sort of priors that come down for how its body works, how movement works, the assumptions that you just have about the nature of the world and the body, the nature of your own model that come down to personality, preferences about how you view the world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.752,
    "end": 4327.093,
    "text": " There's so many ways to look at it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4327.354,
    "end": 4333.741,
    "text": "So maybe a better answer would, if we narrow the scope, unless that answered your question, I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.282,
    "end": 4336.444,
    "text": "No, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.584,
    "end": 4337.144,
    "text": "That's useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.184,
    "end": 4349.818,
    "text": "I mean, I think something you said that was really interesting there is that the prior is kind of the variable encoded in the prior is a random variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.659,
    "end": 4356.985,
    "text": " such that it's the kind of the function of other possible outcomes as a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.605,
    "end": 4359.847,
    "text": "But I guess people don't think about them like that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4359.867,
    "end": 4361.388,
    "text": "Like intuitively, you don't think about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.408,
    "end": 4364.952,
    "text": "You go, well, I want to be, well, let's say like a body prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4364.972,
    "end": 4367.194,
    "text": "I want to be 37.8 degrees Celsius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4367.214,
    "end": 4368.014,
    "text": "That's always a useful one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.655,
    "end": 4371.417,
    "text": "But it's not like that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.577,
    "end": 4374.8,
    "text": "It's over a probability distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4375.741,
    "end": 4379.164,
    "text": "And maybe that's worth unpicking",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4379.279,
    "end": 4380.14,
    "text": " Maybe not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.32,
    "end": 4383.064,
    "text": "Maybe it actually just confounds or muddies the water somewhat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.605,
    "end": 4387.05,
    "text": "But how should people sort of tackle that intuition?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4387.09,
    "end": 4392.917,
    "text": "No, I just have like so-called preferred states and they're one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4393.719,
    "end": 4396.262,
    "text": "They don't have, there's no scope for them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.462,
    "end": 4398.044,
    "text": "There's no distribution of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.104,
    "end": 4398.946,
    "text": "I just want to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4400.368,
    "end": 4408.138,
    "text": "How do you get around that problem building in this notion of like a probability distribution or tending towards a probability distribution?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4409.013,
    "end": 4411.739,
    "text": " Yeah, so the answer to that question I think comes down to precision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.4,
    "end": 4420.778,
    "text": "So each of the probability distributions that we can, you know, we talk about a prior over a variable, we're saying that that variable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.787,
    "end": 4426.876,
    "text": " I think because the non-intuitive part is that everything is couched in probabilistic language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.697,
    "end": 4431.504,
    "text": "So one thing that I like to kind of say is like desire is expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.544,
    "end": 4435.972,
    "text": "So metaphorically, when we think about desire, it's not what we want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.192,
    "end": 4439.037,
    "text": "It's what you re-encode that is what do you expect?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.624,
    "end": 4442.908,
    "text": " And that's a really hard thing to do because that's not how we think about things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.989,
    "end": 4447.134,
    "text": "We don't think about like, I want to eat means I expect to have food in my body.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.575,
    "end": 4448.877,
    "text": "That sounds weird, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4448.937,
    "end": 4454.785,
    "text": "Like it's just, no, it's naturally, I want to eat is just a feeling that I have that I know that if I have food, it'll be satisfied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4454.805,
    "end": 4455.846,
    "text": "And that's kind of how we think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4456.507,
    "end": 4460.873,
    "text": "So when I mean precision, I mean that when you, for example, you talked about body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.241,
    "end": 4469.491,
    "text": " So yes, I prefer my body temperature to be at this particular 98 degrees, let's say Fahrenheit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4470.733,
    "end": 4476.761,
    "text": "But actually the way to say it is I expect it to be that way because that's what your brain is predicting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.321,
    "end": 4481.046,
    "text": "And with a prior, really the truth is that there's actually a range, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.166,
    "end": 4487.334,
    "text": "Because more than likely you can push that to about 104 degrees with a fever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.394,
    "end": 4489.797,
    "text": "You don't wanna do that very often, but you could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.777,
    "end": 4490.919,
    "text": " And you could push it the other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.259,
    "end": 4494.324,
    "text": "So now you have a distribution that's centered on 98 degrees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.065,
    "end": 4496.567,
    "text": "Now, it could be very precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.707,
    "end": 4499.591,
    "text": "When I said precision, it means how precise are we talking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4500.092,
    "end": 4503.317,
    "text": "Is it just a really tall point right around 98 degrees?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.559,
    "end": 4508.224,
    "text": "And for other priors, it may be more spread out, like you can tolerate a range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.204,
    "end": 4514.713,
    "text": " So the priors are really useful because then you can encode this notion of ranges of acceptable values with a preferred value in the middle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4515.274,
    "end": 4524.006,
    "text": "And if it's something where you're so certain about it, like you have this preference, this is the exact state I want to be in, nothing else, then the probabilistic notion still works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.447,
    "end": 4527.951,
    "text": "You have a random variable, you increase the precision till it hits a point mass.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4528.893,
    "end": 4532.978,
    "text": "And then it becomes a single value and you only entertain that value for that prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.12,
    "end": 4537.705,
    "text": "So I presume that mathematically that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4538.512,
    "end": 4567.607,
    "text": " that that sort of uh that limit is basically infinite right in in the in the actual maths and you never actually reach it in terms of biotic limited creatures but that aside it's kind of that's kind of yeah i mean in mathematically like if you look at like factor graphs and stuff we use delta functions all the time in there and um but they're kind of yeah like from the mathematical perspective i think mathematicians would probably get upset with the way they're used it's more of a practical way of just saying like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.587,
    "end": 4570.29,
    "text": " Hey, we're turning a probability distribution into a single value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.831,
    "end": 4574.995,
    "text": "So it just becomes a number, not a scalar rather than yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.015,
    "end": 4578.419,
    "text": "This is the so-called Dirac delta function that again, I got very excited over.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4578.459,
    "end": 4584.846,
    "text": "I get very excited over very odd things, but I guess the philosophers would also get annoyed about the infinity thing as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4584.886,
    "end": 4586.227,
    "text": "So it wouldn't just be the mathematicians.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.069,
    "end": 4588.31,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.37,
    "end": 4591.653,
    "text": "This is all really useful for me and really fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.094,
    "end": 4594.236,
    "text": "So I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4594.739,
    "end": 4601.13,
    "text": " Well, I guess people might think, okay, so I have these probability distributions that kind of makes sense for me in terms of like my C matrix, my preference priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4601.531,
    "end": 4606.019,
    "text": "But then how am I going to have probability distributions over something like a state prior?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.003,
    "end": 4611.83,
    "text": "What I guess the question here is what triggers that probability distribution?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4612.27,
    "end": 4613.693,
    "text": "Because it sounds like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4614.955,
    "end": 4619.36,
    "text": " sure, we have observations, and we have a likelihood distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4619.38,
    "end": 4624.966,
    "text": "And that allows us to say, Okay, I can do state transitions, because I have this constant interaction of observations and states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.128,
    "end": 4633.296,
    "text": "But just for my initial state, what's the kind is, I mean, I guess the question here is, is there such a thing as an initial state?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4634.957,
    "end": 4642.446,
    "text": "Because I think it's always a mistake to take the generative model and slice it up in terms of really, you know, discrete time, obviously, you have to for modeling purposes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.227,
    "end": 4643.427,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4643.677,
    "end": 4654.249,
    "text": " Yeah, I mean, I'm going to go around in circles here, but my question is, yeah, does it make sense to really think of a completely isolated initial state, a D matrix, really?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.29,
    "end": 4661.196,
    "text": "And if so, how do you get, what's the context that drives that initial probability?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4661.216,
    "end": 4666.562,
    "text": "Because it sounds like without any context, every state is equally as likely as each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.567,
    "end": 4677.799,
    "text": " So if I understand your question correctly, like, you know, you take the D matrix at the beginning of the discrete time POMDP active inference problem, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.38,
    "end": 4683.346,
    "text": "You're saying that, say that there's only four possible states in the environment that it could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.047,
    "end": 4690.015,
    "text": "And here is my belief about the probability or expectation about which one is most likely, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4690.035,
    "end": 4696.043,
    "text": "So you're asking like, but, you know, any agent that exists, I mean, you know, you can say like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4697.255,
    "end": 4702.122,
    "text": " I don't know if it's birth or when you're a clump of cells at a certain point, whatever, you know, what is the starting point?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.162,
    "end": 4706.468,
    "text": "Like, is that, was that agent really starting with just like, okay, here's my initial state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.508,
    "end": 4708.091,
    "text": "Now I'm in my simulation begins.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4708.171,
    "end": 4708.371,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4708.571,
    "end": 4709.172,
    "text": "That's how we do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.192,
    "end": 4709.693,
    "text": "We model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.733,
    "end": 4709.933,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4709.994,
    "end": 4711.376,
    "text": "But is that what you're kind of asking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4711.416,
    "end": 4713.459,
    "text": "Like, what about there it's unbounded, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.499,
    "end": 4714.901,
    "text": "Cause there's infinite number of states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.321,
    "end": 4715.642,
    "text": "Effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.662,
    "end": 4715.902,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.082,
    "end": 4726.097,
    "text": "I guess the issue that I think people have, and maybe I had until I sort of saw this written out is that when you have like a tensor or a matrix, there's not one thing in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4726.077,
    "end": 4745.841,
    "text": " right and i think that's so you have the big letter this is something actually recently i've sort of properly got my head around you have the big letter which is the tensor yeah and then you have the small letter um which is the is that the beliefs encoded in the tensor am i getting this right or is it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.395,
    "end": 4749.42,
    "text": " Those are the parameters of the tensor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4749.44,
    "end": 4753.246,
    "text": "In this case, it's the same thing because the tensors themselves are the parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4753.306,
    "end": 4753.987,
    "text": "That's how we do them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4754.027,
    "end": 4756.17,
    "text": "But the question is, where do those values come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4757.252,
    "end": 4761.078,
    "text": "So lowercase d would be, you have these states with those probabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4761.438,
    "end": 4764.403,
    "text": "How do you learn what those probabilities are in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4764.62,
    "end": 4766.522,
    "text": " Assuming there's only four, for example, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.542,
    "end": 4767.342,
    "text": "We're already restricting it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4767.422,
    "end": 4769.104,
    "text": "Maybe you can call that a prior, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4769.364,
    "end": 4771.626,
    "text": "The agent believes there's only four states in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.667,
    "end": 4776.63,
    "text": "But then the question is, how do we learn what those particular probabilities are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.231,
    "end": 4778.932,
    "text": "That's what the lowercase d comes from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.952,
    "end": 4779.773,
    "text": "I'm just sort of curious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.953,
    "end": 4784.937,
    "text": "I guess I'm just curious about what does that even look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.438,
    "end": 4793.985,
    "text": "When I say I have four potential states that might be encoded in my d tensor, I feel like when a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4794.387,
    "end": 4805.325,
    "text": " when someone like me who's interested in computational phenomenology, but learning it and it's coming from the philosophy and the phenomenology, one understands what a D tensor is and the B tensor and an A tensor, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4805.609,
    "end": 4806.75,
    "text": " It's like, oh, it's that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4807.111,
    "end": 4818.343,
    "text": "But then the fact, what does it mean for something to be built into that tensor such that let's say you have multiple states in a D tensor with multiple different distributions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4818.963,
    "end": 4821.326,
    "text": "What does that actually look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.406,
    "end": 4826.972,
    "text": "Is that purely a mathematical modeling thing, or is there a way that we can intuitively think about that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4828.694,
    "end": 4832.798,
    "text": "So if I think I'm understanding your question correctly, I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4834.448,
    "end": 4841.437,
    "text": " the issue you're describing here is something that I think is what I've wondered, like, this is a model ultimately, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4841.517,
    "end": 4843.84,
    "text": "Like it's a model of a very simple scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.86,
    "end": 4850.489,
    "text": "Cause that's originally where Active Inference was, it came from was, can we model simple human and animal behaviors in a very restricted environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.27,
    "end": 4860.102,
    "text": "So if you restrict your environment to a T maze where, you know, a mouse is at one end of a T maze and it can only move in four places, it can only exist in those states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4860.892,
    "end": 4867.204,
    "text": " Okay, then you can, you know, in that it's an abstraction of a real physical, real world scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.787,
    "end": 4873.075,
    "text": "In reality, you know, these are, it's actually all continuous when you get down to it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4873.116,
    "end": 4882.714,
    "text": "Like, I think the discrete state space formulation is kind of an abstraction to think about high level categories, which themselves are encoded in neural dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4883.2,
    "end": 4893.366,
    "text": " The question is like, let's say you really made a real agent that you were gonna put into the world, say it's a robot and it's gonna interact with anything, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.947,
    "end": 4895.652,
    "text": "Well, what does its D matrix look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.772,
    "end": 4898.138,
    "text": "Is it an infinite vector, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.675,
    "end": 4904.06,
    "text": " I think that's kind of the open problem is like, how do you actually do that for a real agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.5,
    "end": 4907.983,
    "text": "I mean, there are states of the world that I don't even know exist, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4908.043,
    "end": 4910.686,
    "text": "So if I have a D vector, right, like it's not there yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.706,
    "end": 4917.292,
    "text": "And so what I think would probably need to happen is you have a D vector that has the ability to grow as one way you could treat the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.372,
    "end": 4928.682,
    "text": "So if it encounters a new kind of state, that's just something it has never explored before, you add in a new slot to the D vector and have to recalculate, recalibrate all your probabilities relative to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4928.662,
    "end": 4932.547,
    "text": " Something like that, I think that's getting to what you're asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.008,
    "end": 4933.328,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4934.029,
    "end": 4943.161,
    "text": "I mean, my intuition here is that it's really important to always also curtail the state space or the belief space in these tenses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4943.582,
    "end": 4944.463,
    "text": "So I've just written this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4944.483,
    "end": 4945.464,
    "text": "I've just written the preprint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4945.504,
    "end": 4955.057,
    "text": "It's a more sort of cognitive science philosophy paper, but it's basically about how underactive inference for my eyes, something like attention is always constrained by preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4955.493,
    "end": 4967.688,
    "text": " So it doesn't really make sense to talk about like, I'm trying to collapse this classic endogenous exogenous distinction that exists in the intentional literature, because under active inference, I'm saying, well, think about what you're paying attention to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.329,
    "end": 4972.194,
    "text": "It's always that which is most salient to you, and that's always governed by your prior preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4972.834,
    "end": 4975.678,
    "text": "But then what kind of came to mind as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4976.283,
    "end": 4981.868,
    "text": " It's not every single prior preference is exerting pressure on your attentional schema at any given time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.629,
    "end": 4986.273,
    "text": "I am not simultaneously paying attention to how hungry I am, how tired I am, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4986.833,
    "end": 4996.002,
    "text": "There's got to be some context driving mechanism that means that when I get hungry, I start paying attention to food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.402,
    "end": 5004.67,
    "text": "When I recognize my child is in the middle of the road, I start paying more attention to the cars and the prospect of them getting hit and so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5005.24,
    "end": 5018.334,
    "text": " which again implies some kind of paradoxical circular causality, because I need to be paying attention to that in the first place to drive my constraints, constraints, state space, such that those preferences continue to drive the attentional specification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5018.755,
    "end": 5021.278,
    "text": "And that's kind of similar to what I'm talking about with this D matrix, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5022.299,
    "end": 5034.252,
    "text": "I can't entertain every single possible probable state computationally intractable, but I also, but for me to know which states are going to at least be feasible,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5034.923,
    "end": 5038.168,
    "text": " I need to pay, I need to be observing the world, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5038.188,
    "end": 5042.154,
    "text": "Like, I don't know if I'm in Iceland or if I'm in the Sahara and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5043.036,
    "end": 5060.323,
    "text": "So this is kind of what I meant by, is there such a thing as the detensor because an unbounded detensor so-called prior to observation to my more philosophically leaning mind sounds like it just could consider absolutely everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.708,
    "end": 5061.769,
    "text": " which it clearly doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5062.05,
    "end": 5067.558,
    "text": "So it makes me think, oh, is the detensor just the kind of B tensor in disguise?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5069.08,
    "end": 5069.801,
    "text": "Sorry, I rambled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5069.921,
    "end": 5070.382,
    "text": "I rambled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5070.402,
    "end": 5074.527,
    "text": "No, but I mean, to answer your question, that is exactly what the detensor is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.688,
    "end": 5079.915,
    "text": "Because if you slice a B tensor with an action, you get a vector out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.064,
    "end": 5085.856,
    "text": " because that's the whole idea is that it's like assuming whatever ended up happening, this is now the state that you're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5085.916,
    "end": 5096.217,
    "text": "You can kind of think of it that way because whenever you slice the B matrix, you get back that slice only and whatever slice happened to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5096.197,
    "end": 5101.367,
    "text": " your starting slice, there's no action that preceded it because you're starting at the beginning of the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5101.788,
    "end": 5109.724,
    "text": "But that's why it's a vector is because it's actually what ends up happening when you take an action is you do slice the B tensor into a vector and say, OK, I'm transitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5109.784,
    "end": 5115.555,
    "text": "And now that becomes my prior that we use for the next round of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5115.535,
    "end": 5145.002,
    "text": " um so uh that's that's just just wanted to comment on that uh your question that you're asking is a really deep question that i don't i don't know if there's a good answer to that yet like what does it look like when you you know is there are detensors floating around and being computed in the brain somewhere like what do they look like is that what you're kind of asking like they're just this unbounded entities like what i'm thinking is that there's got to be some top-down constraints which is context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5145.893,
    "end": 5146.554,
    "text": " related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.294,
    "end": 5161.068,
    "text": "Because, you know, we can't just a very basic level, we can't consider, let's say, in terms of action, we can't consider every possible action, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5161.088,
    "end": 5167.155,
    "text": "Because there's infinite things in principle, every infinite gradations of things, at least that I can do in any given context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5167.175,
    "end": 5169.517,
    "text": "And so this is, I'm not the first to think this, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5169.537,
    "end": 5174.382,
    "text": "There's Carl's sophisticated active inference paper with Lance and others where they talk about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5175.205,
    "end": 5185.217,
    "text": " probably do need a higher, higher order action policy, which constrains the possible actions that you might take in a given context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5185.557,
    "end": 5193.907,
    "text": "And when I was thinking about this attention paper, I was thinking, well, so people talk about, for example, hunger has really high precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.269,
    "end": 5195.97,
    "text": "I'm like, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5196.751,
    "end": 5198.633,
    "text": "And then people say, well, precision is attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5198.653,
    "end": 5204.74,
    "text": "And I'm like, well, no, because I'm not always thinking about how hungry I am.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5204.99,
    "end": 5210.578,
    "text": " And so what I do is I try to disambiguate precision and precision waiting and attention and all of these different categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5210.598,
    "end": 5220.632,
    "text": "But what I'm saying here is there has to be a, there has to be a thing that says, well, when I'm hungry, because I need, I need to eat when I'm starving over everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5220.692,
    "end": 5220.872,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5220.912,
    "end": 5222.094,
    "text": "I need to stop by my essay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5222.134,
    "end": 5223.156,
    "text": "I need to stop speaking to people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5223.176,
    "end": 5223.596,
    "text": "I need to eat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5224.217,
    "end": 5231.908,
    "text": "It needs to be some prioritization mechanism that says when your glucose drops below this point, everything gets focused on food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5233.171,
    "end": 5240.559,
    "text": " Now on one hand, yeah, that makes sense because presumably my set point, my homeostatic set point is very deep in my generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5240.599,
    "end": 5243.463,
    "text": "So it trickles down all of the predictions at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5243.503,
    "end": 5251.091,
    "text": "It's still not clear unless you have that higher order action policy, why you would even prioritize hunger over playing a video game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.252,
    "end": 5257.238,
    "text": "So I think I wonder where the acts of inference needs to go in this direction and say, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5258.838,
    "end": 5261.884,
    "text": " what is constraining these spaces in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5261.904,
    "end": 5272.947,
    "text": "It's all well and good having them, but that's really my fundamental question here is, do we need to invoke something like high order action policy just to constrain the possible beliefs that we can have in a generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5275.091,
    "end": 5276.374,
    "text": "I guess the answer is yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.046,
    "end": 5278.047,
    "text": " Yes, yeah, definitely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5278.088,
    "end": 5285.899,
    "text": "And I think this area is something that I've actually been reading just the last couple of days for one of the chapters I'm writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5286.6,
    "end": 5295.814,
    "text": "And I still don't have a great grasp of the literature, but here's just kind of a sketch of my understanding to answer or just at least address my speculation on what you're asking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5297.236,
    "end": 5305.568,
    "text": "So there is the idea of attention in the active inference formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5305.902,
    "end": 5329.935,
    "text": " attention is also active right like you you can choose what you're attending to at one time so attention is usually considered like the newsworthiness of something so how salient or how interesting or informative is something at one point in time or another uh which in the active inference model like you say there's a precision waiting on the signals the prediction error signals um for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.915,
    "end": 5354.691,
    "text": " either sensations or state transitions and things like that um so but it's context dependent there's a paper recently about social cues in context so just as an example of a word i'll say that paper later i think you might find it interesting but it's like even the example of a word right a word in isolation has no particular it may have many many different meanings so now there's uncertainty you have a signal someone says a word right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5354.671,
    "end": 5358.557,
    "text": " That's not enough because there's uncertainty in the actual content of that signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.938,
    "end": 5370.816,
    "text": "It could mean so many different things, but the context might narrow that scope and tell you what it actually has, what the actual meaning of that word is in the sentence that you're using it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.296,
    "end": 5371.577,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.597,
    "end": 5373.34,
    "text": "So the context would be the sentence in this case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.521,
    "end": 5381.312,
    "text": "Um, yeah, I was very inspired by that, that Mitz's work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.412,
    "end": 5381.472,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.738,
    "end": 5389.392,
    "text": " he's got all of 2016, 2017, especially 2019 paper with Carl on selective attention, which I think if you haven't read it, you would really, really like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5390.114,
    "end": 5392.518,
    "text": "It shows that like context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5392.639,
    "end": 5402.678,
    "text": "So for example, if I'm doing a Yarbus task, which is a classic attentional paradigm where someone says, you know, show a picture of a family, let's say, and they say, well, how much do you think this family is worth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5402.758,
    "end": 5404.0,
    "text": "And then all they do is look at",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5404.267,
    "end": 5405.829,
    "text": " the furniture and their clothes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5405.909,
    "end": 5408.874,
    "text": "And then they say, I don't know, do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.894,
    "end": 5410.456,
    "text": "I don't know actually what the second condition is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5410.496,
    "end": 5415.704,
    "text": "This might be something like, well, do you think this family get along and all they look at the eyes and they look at how they're looking at one another.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5415.984,
    "end": 5419.309,
    "text": "And what that shows is like what's salient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5419.329,
    "end": 5424.497,
    "text": "I actually prefer the term relevant, but that's for technical attentional reasons, but it doesn't really matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5426.219,
    "end": 5429.464,
    "text": "What's relevant is always relative to context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5430.153,
    "end": 5431.915,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5432.016,
    "end": 5435.22,
    "text": "It's always contingent on the goals of the agent at the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5436.662,
    "end": 5458.433,
    "text": "But then you get I think the issue that I kind of skirted and may need to think about is you potentially end up in an infinite regress because you say, okay, I have a higher order context or a higher order action policy that is saying, for example, when I'm hungry, prioritize hunger over the fact that I want to finish this video game level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5459.334,
    "end": 5459.434,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5460.123,
    "end": 5489.742,
    "text": " then what then you but then someone might come along and say well why is that higher order action policy relevant right maybe that's just a hidden state for another higher order action policy and so you may end up with this infinite regress of saying well where does the relevance kind of stop and maybe you just get something like embedded priors genetically embedded priors that get you out of that hole um because i can't really see any other way out of it but all of that to say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5490.548,
    "end": 5497.821,
    "text": " I think, I think context is really important in terms of guiding the precision waiting of beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5498.943,
    "end": 5499.784,
    "text": "I don't like the term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5500.005,
    "end": 5509.862,
    "text": "I don't like the, although I don't like the illusion of precision and precision waiting because precision for me is very mathematical term and precision waiting is a much richer term, but you're absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5510.263,
    "end": 5511.645,
    "text": "Attention is not only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5512.84,
    "end": 5536.519,
    "text": " pulled towards something it's also you know oftentimes seemingly purposefully directed the point i was trying to make in this paper is that it's fundamentally goal directed even at the very lowest level right like even in terms of like color discrimination you could you know you can describe it as if your visual neurons have these prior preferences and so on anyway",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5536.617,
    "end": 5551.193,
    "text": " So actually, it'd be worth saying about this, like, you know, I'm trying to I'm trying to work through your question, like probabilistically, so we don't get into the like, you know, philosophically, it's very hard to talk about these things, because like, but I'm trying to look at like actual model, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5552.755,
    "end": 5563.367,
    "text": "So let's just say that, you know, hunger is a random variable, right, like your state of being hungry, which is dependent on blood glucose levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5564.14,
    "end": 5564.801,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.021,
    "end": 5570.99,
    "text": "So your body is actively sensing your bloodstream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5571.25,
    "end": 5572.432,
    "text": "Hormones are sent out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5572.732,
    "end": 5575.376,
    "text": "Those levels come back as sensory information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5576.297,
    "end": 5582.526,
    "text": "And that's a sensory signal you get from your body that your brain will then say, okay, blood glucose is a thing I'm measuring here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5582.887,
    "end": 5585.17,
    "text": "It's gone down to a certain range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.453,
    "end": 5593.645,
    "text": " And that there's a prior, literally in the Bayesian sense, there's a prior on blood glucose that has distribution of its acceptable range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5594.306,
    "end": 5603.619,
    "text": "And so now that the state has changed, conditioning on that distribution makes hunger now more likely or more expected in the model because blood glucose has now fallen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5604.8,
    "end": 5606.503,
    "text": "So I'm thinking of it through conditioning, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5606.523,
    "end": 5613.673,
    "text": "These effects are all conditioned variables where the state of hunger becomes more likely because it's conditioned on some other thing that's being measured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.753,
    "end": 5614.414,
    "text": "So it's kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5615.761,
    "end": 5617.322,
    "text": " I don't know if it's like an operating system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5617.342,
    "end": 5626.351,
    "text": "Where there's like tasks and you're sending something up to the top is like process this first, but it feels like this queuing kind of happens through distributions is kind of what I'm saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5627.232,
    "end": 5628.513,
    "text": "But that's the question, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5628.893,
    "end": 5640.284,
    "text": "Is now that the body recognizes it's hungry, why does it say, okay, I'm going to stop petting my dog or playing on my phone and I'm going to go get food unless it's starving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5641.265,
    "end": 5642.907,
    "text": "And that's all it can think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5643.027,
    "end": 5644.468,
    "text": "It's all it's paying attention to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5645.275,
    "end": 5646.557,
    "text": " what is governing that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5646.597,
    "end": 5646.778,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5646.798,
    "end": 5665.873,
    "text": "Well, you go, there's a higher order policy because it has to be, which says, okay, given this hidden state now, so the hidden state of hunger has become an observation for a higher order action policy, which says, given this observation, go find food.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5666.595,
    "end": 5668.498,
    "text": "My point with the infinite regresses",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5669.761,
    "end": 5673.325,
    "text": " is there an action policy, I've got to try and make sure I guess, right, I didn't write this in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.585,
    "end": 5677.77,
    "text": "So this is actually very influenced by john Verveke, his work on relevance realisation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5678.29,
    "end": 5683.055,
    "text": "If anyone's curious about this argument, he puts it in his relevance realisation paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5683.376,
    "end": 5684.037,
    "text": "So I'm butchering it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.077,
    "end": 5685.598,
    "text": "Sorry, john, john might be watching.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5685.818,
    "end": 5686.179,
    "text": "Sorry, john.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5687.36,
    "end": 5689.763,
    "text": "But the idea would be, why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5689.823,
    "end": 5695.549,
    "text": "What, you know, is there an action policy guiding that action policy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5696.862,
    "end": 5698.905,
    "text": " Like, where does the limit, where does it stop?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5699.486,
    "end": 5705.435,
    "text": "Because you might say, well, why would I, when I'm hungry, go and find food?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.695,
    "end": 5715.349,
    "text": "And that's because you have a higher order action policy, which says that given your observation that there is this action policy and so on and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5716.391,
    "end": 5722.58,
    "text": "So I think there's an important question here, which might be remaining in the activist literature, which is where does the cap of context stop?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5723.081,
    "end": 5725.384,
    "text": "Like, is there a point at which it just stops?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.225,
    "end": 5728.469,
    "text": " And where does that come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5728.569,
    "end": 5734.92,
    "text": "And again, I think the answer probably has to be this evolutionary, but that's boring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5735.842,
    "end": 5742.233,
    "text": "I don't know if you would call it a cop out, but that's kind of what you end up having to do at some point, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5742.253,
    "end": 5747.743,
    "text": "Like when you have this regress, if you were saying like the boring answer is, well, we have these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5748.078,
    "end": 5754.006,
    "text": " DNA is compressed source code of all these other things that we've experienced and it overrides other things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5754.066,
    "end": 5767.183,
    "text": "I guess, yeah, I don't know if I have a good answer to your question other than just saying like, if you're talking in a purely Bayesian sense, like if you just had Bayes' theorem and you increase the, because the precision, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.263,
    "end": 5768.966,
    "text": "The precision is also learned from the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.406,
    "end": 5770.868,
    "text": "That's also part of, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5770.888,
    "end": 5773.832,
    "text": "Like you learn how much to modulate that precision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5773.812,
    "end": 5787.226,
    "text": " If you have even a three-way network where you have your data, you have hunger, and you have play games, and those two things are being integrated together to have this distribution over like, what do I do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5787.246,
    "end": 5789.968,
    "text": "Do I eat or do I play games?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5790.329,
    "end": 5792.09,
    "text": "What you're inferring from the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5792.731,
    "end": 5798.537,
    "text": "Well, if you're learning from the data, the precision is much higher on the distribution for hunger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5798.517,
    "end": 5802.743,
    "text": " then it's waiting as much more higher invasion inference than the gaming playing games.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5803.203,
    "end": 5809.091,
    "text": "And so your posterior will be weighted much more highly toward the state will be more likely is getting food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5810.213,
    "end": 5817.102,
    "text": "So I don't know if you even need to evoke that infinite regress other than I'm not sure I'm thinking about this through this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5817.563,
    "end": 5818.364,
    "text": "Maybe we're not understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5818.404,
    "end": 5821.027,
    "text": "I'm not understanding your question, but no, I think you are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5821.408,
    "end": 5826.735,
    "text": "When I spoke to John about it, I have said, I think you get out of the infinite regress through evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5826.833,
    "end": 5832.204,
    "text": " or you get out of it through, well, yeah, you could say learning, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5832.244,
    "end": 5837.835,
    "text": "Whether it's kind of this supervised learning over epochs or whether it's in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5838.176,
    "end": 5840.32,
    "text": "I think the problem with in real time learning is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5842.105,
    "end": 5851.556,
    "text": " why if it's not evolutionary and it is in real time, why would the system prioritize the precision weighting of those signals over others?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.616,
    "end": 5854.319,
    "text": "And then maybe you end up in the infinite regress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5854.76,
    "end": 5856.702,
    "text": "I do think at a certain point you have to bottom out somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5856.722,
    "end": 5857.062,
    "text": "You're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.142,
    "end": 5860.026,
    "text": "Because I mean, why is it in the first place that food is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5861.167,
    "end": 5864.31,
    "text": "Where did that distribution come from in the first place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5864.391,
    "end": 5865.772,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.574,
    "end": 5869.176,
    "text": "That's the point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5870.0,
    "end": 5875.046,
    "text": " Yeah, and I'm just really curious about what these... What's the drive?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.286,
    "end": 5893.106,
    "text": "Because I invoke this kind of notion, again, of a circular causality between attention and preferences, whereby for me to prioritize a preference in my precision weighting, for me to go, okay, the prior for hunger is now more heavy in precision weighting than the prior to play video games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.867,
    "end": 5894.868,
    "text": "Well, I need to pay attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5894.928,
    "end": 5898.792,
    "text": "As I said before, I need to pay attention to the observations that I'm making so as to drive that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5898.974,
    "end": 5901.537,
    "text": " which in turn drives my attention towards that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5901.557,
    "end": 5908.765,
    "text": "And you get these kinds of positive feedback loops, which I think actually also end up explaining something like addiction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.285,
    "end": 5917.494,
    "text": "And maybe I know John would argue that the opposite of that would be something like agapic love where you're one with the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5917.514,
    "end": 5919.516,
    "text": "But anyway, we don't have to go there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5920.537,
    "end": 5927.445,
    "text": "If I can, I will find what John says about relevance realization, because I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5927.881,
    "end": 5934.301,
    "text": " It's his response in some ways to the frame problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5935.404,
    "end": 5941.924,
    "text": "So the frame problem being, well, how do you know, like if you're an artificial intelligent being, how do you know which information to zero in on?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5942.663,
    "end": 5948.533,
    "text": " Okay, because you have a, well, how do you end up with a policy to zero in on that information where you have a higher order policy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5949.074,
    "end": 5949.715,
    "text": "How do you have that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5949.775,
    "end": 5953.401,
    "text": "And so that's the infinite regress is the infinite regress of the frame problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5953.681,
    "end": 5960.132,
    "text": "But I guess when you bottom up, we're just going around, but when you bottom out with evolution, you seemingly resolve that problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5960.821,
    "end": 5961.402,
    "text": " I think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5961.463,
    "end": 5962.806,
    "text": "And that's just as an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5962.846,
    "end": 5972.811,
    "text": "And I think I'm not sure this is true, but I believe it's true that I read somewhere that like infants will, you know, talking like very small infants, few months old, they will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5975.116,
    "end": 5977.783,
    "text": "I don't know what the exact age is, so I can't give a great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5977.763,
    "end": 5983.672,
    "text": " answer on this, but they will prefer, they will be selective about the kind of liquids they will ingest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5984.092,
    "end": 5990.382,
    "text": "So like sweet things is one example, but like bitter or salty, those could be poisons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5990.983,
    "end": 6001.078,
    "text": "And there are many other things too, like suckling behavior, other instinctual things that infants within the first few weeks have the awareness of or ability to do these sorts of very, very basic behaviors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6001.559,
    "end": 6002.34,
    "text": "Where does that come from?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6002.881,
    "end": 6004.463,
    "text": "Because if you're...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6004.443,
    "end": 6019.954,
    "text": " there aren't any where are those priors coming from i think you have to bottom out on some level of evolution in some way eventually um but along that way in the development right i think there's so many other things that happen in there and a lot of it is also cultural things you know you were taught",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.457,
    "end": 6034.441,
    "text": " Even in the early reinforcement learning or active inference paper, 2009 with Carl's paper with a few other authors on there, they actually use supervised learning to teach the model it's like priors first to solve the mountain car problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6034.681,
    "end": 6042.735,
    "text": "And they argue like, well, you learn from other people like your caregivers, people around you teach you some things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.715,
    "end": 6044.117,
    "text": " So I think that's the other option.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6044.137,
    "end": 6052.569,
    "text": "It's either evolutionary or it's learned very, very early on as something that you learn during development that becomes encoded as this highly precise thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6052.609,
    "end": 6055.052,
    "text": "But that's just speculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6055.072,
    "end": 6055.693,
    "text": "I'm not quite sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6055.713,
    "end": 6057.516,
    "text": "No, it's fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6057.556,
    "end": 6058.778,
    "text": "I mean, it goes back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6058.898,
    "end": 6059.499,
    "text": "It's really amazing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6059.519,
    "end": 6062.563,
    "text": "I mean, I think active inference in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6062.813,
    "end": 6068.343,
    "text": " giving us these kinds of phenotypic priors answers so many questions that were longstanding in cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6068.403,
    "end": 6082.729,
    "text": "I mean, like this argument of kind of foundational concepts goes back to someone like Jerry Fodor and Fodor saying, well, we kind of need these innate concepts, you know, because how would I ever be able, you know, it's almost platonic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6083.03,
    "end": 6084.513,
    "text": " It's actually, it is a Plato argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6084.533,
    "end": 6092.79,
    "text": "You know, how could I ever bracket something into the concept of red rather than blue without already having the concept of red?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6093.211,
    "end": 6095.596,
    "text": "And Plato argues that you have the form of red.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6096.258,
    "end": 6104.194,
    "text": "And Karl will say, well, no, you have a sort of proto-foundational prior that allows you to do this assortment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6104.377,
    "end": 6106.46,
    "text": " So thank God for Mr. Friston.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6106.96,
    "end": 6111.986,
    "text": "Um, let's, um, let's finish up just by talking about the versus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6112.086,
    "end": 6121.918,
    "text": "So people are probably aware of what versus is, but if they're not, um, maybe you can give just like sort of a brief overview of what versus is, what the ambition is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6122.9,
    "end": 6125.803,
    "text": "Um, and also what you do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6126.024,
    "end": 6127.245,
    "text": "Cause I'm sure people are very curious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6128.947,
    "end": 6129.187,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6129.988,
    "end": 6133.351,
    "text": "So I've only started at Versus in December.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6133.592,
    "end": 6136.374,
    "text": "So Versus in any ways is still very new to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6136.454,
    "end": 6141.8,
    "text": "So this is just to give an overview for Versus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6143.521,
    "end": 6157.435,
    "text": "Versus in, I think it's almost two years now, Carl and many of the researchers that were working with him joined the Versus R&D group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6157.415,
    "end": 6174.85,
    "text": " So versus AI company, they're working on active inference models and applying them and scaling them and learning how to use active inference models in more realistic settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6174.83,
    "end": 6182.484,
    "text": " So kind of the scope of when we talk about versus we look at how we have natural intelligence on one hand and artificial intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6182.505,
    "end": 6184.468,
    "text": "So that's kind of the way we're reframing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6184.488,
    "end": 6193.345,
    "text": "We're thinking about how do biological systems intelligently do things, biologically inspired intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6193.325,
    "end": 6196.048,
    "text": " And how can we engineer those things using active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6196.789,
    "end": 6202.955,
    "text": "So in one sense, like the R&D group is continuing the work that Carl was doing with many of his colleagues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6203.275,
    "end": 6207.179,
    "text": "But now we're trying to apply them in specific settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6207.519,
    "end": 6209.682,
    "text": "So I can't talk a lot about the actual research itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.702,
    "end": 6210.042,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.222,
    "end": 6210.502,
    "text": "Of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6210.603,
    "end": 6213.546,
    "text": "I'm not, you know, but so I'm giving more of a very, very high level explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6214.687,
    "end": 6221.914,
    "text": "But the major contribution is, you know, we have definitely open source papers that have been published.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6221.894,
    "end": 6224.419,
    "text": " A couple like on federated active inference is one example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6224.98,
    "end": 6226.142,
    "text": "The inductive inference paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6226.904,
    "end": 6229.108,
    "text": "There's a couple others on structure learning that came out recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6230.19,
    "end": 6235.681,
    "text": "So there is some insight into some of the work that's being done at Versys there through those papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6237.184,
    "end": 6242.535,
    "text": "But more generally, Versys is focused on the vision of the spatial web.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6242.515,
    "end": 6271.881,
    "text": " um which uh there's a book uh the ceo of of versus uh gabriel ney as well as uh dan mapes they wrote co-wrote a book together the spatial web which is uh looking at the future of what the internet could be so looking at the isolated technologies that are that make up web 3 when you look at things like blockchain and ar vr technologies internet of things and smart cities and things like that digital twins",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6272.131,
    "end": 6274.856,
    "text": " they all have their own little research area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6274.876,
    "end": 6278.462,
    "text": "They're all kind of being different companies in isolation are studying these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6279.063,
    "end": 6288.199,
    "text": "So the idea is to put them together into one umbrella where we have the new version of the internet where you don't really have web pages anymore, but you have people, places, and things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6288.5,
    "end": 6293.647,
    "text": " So there's so much to unpack in that umbrella that we can talk about that the book goes into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6294.067,
    "end": 6297.992,
    "text": "And I'm still myself learning and getting my hands on all of the details of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6298.092,
    "end": 6300.936,
    "text": "But it is the new web standards that would come out of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6301.557,
    "end": 6308.445,
    "text": "We registered with IEEE, so you can attend, look at the documents and things like that that are part of the development of the spatial web.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6308.966,
    "end": 6314.253,
    "text": "And Active Inference is playing the core AI component of what the spatial web will entail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6314.794,
    "end": 6317.477,
    "text": "So it's kind of functioning as the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.457,
    "end": 6342.553,
    "text": " broader scale of it how can we take it out of the neurosciences and scale it up into something that can be used in these kinds of technologies really cool really really cool and a lovely explanation um i was curious just when i heard you you know you one does hear the versus people talk about mimicking or replicating biotic intelligence in artificial uh entities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.018,
    "end": 6372.304,
    "text": " how much do you guys again this is a very high level question because i don't want maxwell to shout at me but how much do you guys run into like the as if problem that we've already discussed namely maybe in terms of like the ground truth of active inference is that things look as if they are conducting variational bayesian inference over their external states but how they're doing that whether they're actually doing that right these are still kind of live debates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6372.689,
    "end": 6399.203,
    "text": " wondering whether when you translate that over to an artificial intelligence agent it leaves you a little bit well up in the air about okay exactly we we can say okay they have to be abiding by the free energy principle they have to look as if they're minimizing variational free energy but is there a problem where you go well how on earth are we how on what's the process theory how are they actually going to be looking as if they're doing that so what's the kind of yeah i'm curious about how you how you skirt that problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6400.55,
    "end": 6404.034,
    "text": " So I think these are the kinds of things that will probably look different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6405.356,
    "end": 6410.002,
    "text": "These discussions look different to different people, depending on your philosophical presuppositions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6410.502,
    "end": 6415.568,
    "text": "So different researchers at Versus and outside of Versus all have different takes on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6416.75,
    "end": 6424.88,
    "text": "So my personal take is that the as if problem is not as important, I don't think, in an engineering setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6425.36,
    "end": 6429.105,
    "text": "Because ultimately, it's sort of the scientific process about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6429.085,
    "end": 6434.851,
    "text": " okay, I'm making this model that I want to do something in this world and it needs to predict in a certain way, it needs to do these certain things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6435.171,
    "end": 6435.812,
    "text": "Is it doing that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6436.793,
    "end": 6442.318,
    "text": "If it's not, then what is it missing that we need to add to make it make it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6442.579,
    "end": 6459.075,
    "text": "And at the end of the day, I mean, I don't think it really matters if something is totally mimicking human-like intelligence in a way that for all intents and purposes, maybe like kind of the grand Turing test of, you know, in general of any kind of skill or a thing it can reason about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6459.376,
    "end": 6465.543,
    "text": " If it's doing that effectively, then I feel like the as if question doesn't really matter for this kind of a circumstance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6465.583,
    "end": 6467.144,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6467.184,
    "end": 6474.853,
    "text": "Until you start thinking about consciousness and the ethics of conscious AI and whether something like embodied cognition and active inference yields consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6474.953,
    "end": 6478.376,
    "text": "Again, these are deep philosophical questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6478.396,
    "end": 6478.617,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6478.637,
    "end": 6479.377,
    "text": "I definitely agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6479.397,
    "end": 6489.248,
    "text": "I just wonder whether when I think about active inference and the more time I spend with it, the less...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6489.565,
    "end": 6495.162,
    "text": " concrete, in a Socratic way, about what I can say exactly it's claiming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6496.927,
    "end": 6501.381,
    "text": "Because sure, you have the mathematical derivations, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6501.597,
    "end": 6527.352,
    "text": " know going all the way back to just basic analytical philosophy all the maths just turns in on itself right it's an analytic it's an analytic truth it's kind of tautological it doesn't necessarily tell you anything about the world apart from the fact that things have to look as if they're abiding by this principle like things look like they're abiding by hamiltonian's law at least the principle of least action so i'm just wondering whether in an engineering sense right so in a very pragmatic sense what and again",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6527.669,
    "end": 6530.952,
    "text": " Not revealing any secrets because NDAs, Maxwell, scary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6532.493,
    "end": 6532.773,
    "text": "Joking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6534.835,
    "end": 6549.368,
    "text": "How do you get from, okay, you have the VFE equation or the EFE equation, and then you have these kinds of offshoots like predictive coding or PonDP schema, variational message passing and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6550.749,
    "end": 6556.714,
    "text": "How do you kind of choose, in a way, which one's the best option?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6557.335,
    "end": 6563.745,
    "text": " And also, then we have to build in this issue of okay, we've got discrete state space, we've got continuous state space, in reality, everything's hybrid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6564.606,
    "end": 6575.903,
    "text": "So I'm just wondering whether how you can get from like a super fundamental mathematical axiom, like the variational free energy formula to something that can actually be programmed and is applicable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6575.943,
    "end": 6582.313,
    "text": "And I guess this comes to a question of how does someone decide what kind of simulation to run in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6583.964,
    "end": 6589.075,
    "text": " Yeah, I mean, this is a big problem that will come from scaling any technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6589.095,
    "end": 6597.072,
    "text": "But Active Inference, if you even just look at the robotics papers that have come out the last five years or so, there's been a lot more exploration in that area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6598.155,
    "end": 6604.268,
    "text": "A lot of them have to make practical considerations and tricks to make it work in the robotics setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6604.248,
    "end": 6611.563,
    "text": " So whether that's, you know, further approximations of certain signals that are just taken for granted and the equations, you know, it's like, well, there's latency issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6611.583,
    "end": 6613.888,
    "text": "There's all these other things that, you know, you have to deal with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6614.008,
    "end": 6620.18,
    "text": "And these robotics papers often start with the core of active inference and then throw a bunch of other things on top of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6620.701,
    "end": 6625.952,
    "text": "So the most common trick is the like amortized inference, which would be like, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6627.012,
    "end": 6635.064,
    "text": " You, you know, it's taken for granted if you have a small, tiny little, you know, toy simulation, my generative model is this linear equation or this quadratic or whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6635.865,
    "end": 6638.409,
    "text": "How do you actually, you know, you already have learned those variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6638.949,
    "end": 6642.815,
    "text": "Okay, well, how do you do that in a setting where it's this huge multidimensional thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6643.696,
    "end": 6649.645,
    "text": "Well, you can use deep learning, use some universal function approximator that learns the parameters of all these distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6650.266,
    "end": 6665.259,
    "text": " So the broad answer to your question is like, you come up, you hit a wall with a lot of these sorts of things when you look at like the robotics literature and you're trying to engineer these sorts of systems where you have to start including tricks that were not necessarily in the original formulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6665.719,
    "end": 6669.042,
    "text": "And you think, okay, well, I have to prune my policy tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6669.062,
    "end": 6670.483,
    "text": "There's so many different options here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6670.943,
    "end": 6673.606,
    "text": "How do I figure out what's the best action to take?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6673.806,
    "end": 6675.387,
    "text": "Because I have to do it engineering setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6676.128,
    "end": 6679.851,
    "text": "And so there's a paper recently on Reactive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6679.831,
    "end": 6704.185,
    "text": " uh decision trees uh reactive uh behavioral trees in uh in robotics that came out a couple years ago another perspective looking at branching time active inference for example so these are all like little modifications on the original methodology the core is still the same but you can add these extra layers on there so you make better predictions and you can actually function and build systems in the real world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6704.165,
    "end": 6710.915,
    "text": " And I think it's sort of like a guess and check, like you build a simulation or you build a robot and you realize, okay, there's a major limitation here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6711.595,
    "end": 6715.621,
    "text": "What do we need to add onto the system mathematically for it to actually deal with that problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6716.462,
    "end": 6718.886,
    "text": "And I see this as an iterative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6718.946,
    "end": 6724.694,
    "text": "Like you don't know starting out, like you start out with just the basic model and then you realize, wait, that doesn't work very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6725.455,
    "end": 6730.182,
    "text": "And then you keep adding components on there until you get a more holistic model that can make better predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6731.303,
    "end": 6732.585,
    "text": "You guys are very pragmatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6732.886,
    "end": 6762.859,
    "text": " very good it's very good it's very yeah i like all engineering is right yeah yeah yeah yeah no it's um yes uh yeah yeah well let me know let me know how you guys get about with this pruning via context problem because i think that's a problem and i'm curious about how that's getting done probably again with these uh phenotypic priors um i did actually get up this viveki thing so i'll mention it because you might be interested because it actually comes from artificial intelligence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6763.177,
    "end": 6775.86,
    "text": " So this is actually from a really nice paper, which was in Phenomenology in the Cognitive Sciences by Brett Anderson, Mark Miller, and John Vervaeke called Predictive Processing and Relevance Realization, Exploring Convergent Solutions to the Frame Problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6776.861,
    "end": 6779.987,
    "text": "And therein they say, and I will get it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6781.064,
    "end": 6789.758,
    "text": " In the middle of the 20th century, artificial intelligence researchers discovered what Dennett, 1987, called a new deep epistemological problem that came to be known as the frame problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6790.139,
    "end": 6797.411,
    "text": "In its original form, the problem consisted of how to program an artificially intelligent agent to intelligently take into account the side effects of its actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6797.832,
    "end": 6802.92,
    "text": "For example, if a robot needs to retrieve a battery, but the battery is on a wagon that also has a bomb on it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6803.153,
    "end": 6808.72,
    "text": " The robot must be able to realize that retrieving the battery will bring the bomb along with it, thus resulting in its own destruction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6809.121,
    "end": 6812.946,
    "text": "This may seem like a relatively simple issue, but it turned out to be incredibly complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6813.286,
    "end": 6818.353,
    "text": "The problem is that there are a near infinite number of potential side effects to any particular action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6818.694,
    "end": 6825.303,
    "text": "How can we program the robot to take into account the relevant side effects while intelligently ignoring the irrelevant one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6825.623,
    "end": 6832.452,
    "text": "We cannot program the robot to systematically assess all of the possibilities because there are far too many.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6833.073,
    "end": 6841.369,
    "text": " And so I guess that idea is, okay, you give it a prior which says, you know, don't pick up wagons with bombs on them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6842.051,
    "end": 6850.026,
    "text": "But then there's a potential side effect that whams if there's a child underneath it and you want to pick up the wagon with the bomb on it and you want to resolve the child.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6850.327,
    "end": 6852.01,
    "text": "And what you end up with, I think-",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6852.597,
    "end": 6854.54,
    "text": " what you're getting on that scenario, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6855.14,
    "end": 6856.482,
    "text": "Yeah, you get massive overfitting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6857.203,
    "end": 6857.303,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6857.323,
    "end": 6865.254,
    "text": "And so what I think active inference brings in really nicely to this, again, and this comes out in my paper, I guess, is the notion of a hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6866.135,
    "end": 6867.477,
    "text": "And I guess that feeds in, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6867.517,
    "end": 6872.043,
    "text": "Like, if there's a child on, you know, if there's a child at risk, you do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6872.544,
    "end": 6876.87,
    "text": "And I guess the question of the frame problem is, well, what's at the very top of your hierarchy of values?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6877.651,
    "end": 6880.174,
    "text": "And maybe those are evolutionary priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6880.576,
    "end": 6881.599,
    "text": " That's a really good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6881.619,
    "end": 6892.206,
    "text": "I don't, you know, of course I don't think anyone knows the answer to that question, but I will point out when I'm thinking about this, what you, you know, you brought up that up that, you know you know, children,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6894.245,
    "end": 6921.872,
    "text": " me children are like that robot like really like you know toddlers they don't know the context differences between things right like but you're taught it over time if you put them in the world yeah they're probably going to take that bomb and they won't know the difference but we tell them by saying no don't do that don't do that they learn over time uh to make those those contexts and i don't know exactly like maybe some of it eventually bottoms out at evolution but i think that's what the learning stage is for you know young children they have to go through this sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6922.088,
    "end": 6924.533,
    "text": " you know, trial and error where they're doing all kinds of things that could kill them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6924.793,
    "end": 6929.563,
    "text": "And they don't know until a parent tells them and explains, you know, like, this is dangerous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6929.603,
    "end": 6936.196,
    "text": "This is why, you know, and there's still in that, in that question is like, how do you then, you know, how are all those things ranked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6936.236,
    "end": 6940.485,
    "text": "Where, like you said, like, what if there's a child, like it doesn't completely solve the problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6940.465,
    "end": 6950.977,
    "text": " But I'm just pointing out that like perhaps a robot needs to go through like extensive training where, you know, like if there was a way to encode those priors, maybe we could build them in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6951.277,
    "end": 6964.532,
    "text": "But it's probably so complex that the only way is to make like an infant robot and have it go up through stages of development where we start teaching it things and we, you know, instruct it and it starts to build in those those pieces in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6964.512,
    "end": 6965.656,
    "text": " That's just speculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6966.138,
    "end": 6968.647,
    "text": "No, I think that's absolutely right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6969.35,
    "end": 6973.003,
    "text": "Again, the philosopher in me is saying, well, why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6973.743,
    "end": 6975.827,
    "text": " And this is the infinite frame problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6975.847,
    "end": 6978.813,
    "text": "Why would the child listen to the parent and try and survive in the first place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6978.853,
    "end": 6980.917,
    "text": "And then maybe you do get grounded out in evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6981.779,
    "end": 6987.47,
    "text": "I mean, there's definitely the instinct to, you know, your caregivers are the, you know, why is there an instinct to cry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6987.61,
    "end": 6989.293,
    "text": "And why, you know, there are all those sorts of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6989.353,
    "end": 6994.022,
    "text": "Like there are animals that don't cry out in pain are often ones that are not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6994.162,
    "end": 6995.245,
    "text": "They're ones that don't have a mother.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6995.345,
    "end": 6996.527,
    "text": "Like there's no...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6996.98,
    "end": 6998.002,
    "text": " There's no one going to help you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6999.345,
    "end": 7004.054,
    "text": "Crying out in pain is a social reaction because you know that others will take care of you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7004.375,
    "end": 7011.069,
    "text": "Eventually, it's going to be built into social customs, which again, then bottom out into evolution, is my guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7011.81,
    "end": 7012.271,
    "text": "Eventually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7012.612,
    "end": 7015.157,
    "text": "All of this is some kind of foundationalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7015.137,
    "end": 7017.019,
    "text": " And I have been friends give us that foundation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7017.34,
    "end": 7019.502,
    "text": "So we took it took me it took me an hour to get there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7019.523,
    "end": 7020.263,
    "text": "But we got there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7020.283,
    "end": 7023.768,
    "text": "So I'm very sorry for everyone who had to end use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7023.788,
    "end": 7025.81,
    "text": "I mean, these problems are like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7025.83,
    "end": 7029.655,
    "text": "An hour is like, yeah, I knew the fucking answer already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7029.675,
    "end": 7031.538,
    "text": "I already spoke to john about him for some reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7031.578,
    "end": 7035.563,
    "text": "Anyway, we got that it's all evolution was not all evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7035.583,
    "end": 7036.744,
    "text": "It's a hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7038.226,
    "end": 7038.787,
    "text": "Final question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7040.589,
    "end": 7043.052,
    "text": "There's a lot of hype about deep learning and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7043.268,
    "end": 7045.39,
    "text": " large language models and neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7046.091,
    "end": 7051.696,
    "text": "And we haven't even touched upon this podcasts most frequently touched upon topic, which is consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7052.257,
    "end": 7054.659,
    "text": "And this is gonna be a very flippant, facetious question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7054.779,
    "end": 7058.002,
    "text": "And I want it to be answered in a flippant, facetious, facetious manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7058.943,
    "end": 7063.508,
    "text": "Are any large language models that exist right now conscious?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7066.591,
    "end": 7067.772,
    "text": "My instinct tells me no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7071.055,
    "end": 7071.756,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7072.445,
    "end": 7078.275,
    "text": " I will say that large language models continuously surprise me with the kinds of things they can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7079.637,
    "end": 7087.37,
    "text": "There's all this research coming out right now about like, well, what appears to be immersion is really not, now that we kind of look at it a bit more closely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7087.39,
    "end": 7098.148,
    "text": "I think that it's worth considering, not that they're conscious, but there may be some level of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7099.799,
    "end": 7104.211,
    "text": " I'm trying to think of the right word here, because self-awareness, all those things are not quite there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7104.773,
    "end": 7107.701,
    "text": "But there's always this argument like, oh, well, something is mimicking it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7108.403,
    "end": 7110.95,
    "text": "It's not actually the same thing as that, like a parrot kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7111.11,
    "end": 7112.333,
    "text": "He doesn't understand the meaning of the words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7112.714,
    "end": 7114.399,
    "text": "Where does that boundary get crossed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7114.801,
    "end": 7132.708,
    "text": " there's eventually a point right where the mimicry is the same as the actual thing right and i don't know it's a very deep philosophical question yeah um which should only be answered in facetious ways because it's it's hundreds of years of thinking oh yeah well seoul's chinese rumors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7132.992,
    "end": 7134.655,
    "text": " Well, you just classic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7134.675,
    "end": 7134.996,
    "text": "You don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7135.577,
    "end": 7136.439,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7136.819,
    "end": 7137.501,
    "text": "You just don't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7137.881,
    "end": 7138.002,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7138.022,
    "end": 7139.324,
    "text": "Like, you do the mimicry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7139.625,
    "end": 7142.751,
    "text": "And actually, well, there might be some people who say that Chinese room is conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7144.234,
    "end": 7145.115,
    "text": "That's kind of in some ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7147.279,
    "end": 7148.622,
    "text": "You're guided by intuition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7149.108,
    "end": 7174.575,
    "text": " you don't have a definition of what conscious is which we don't it's really hard i think we have you only can do is you can kind of poke holes in things and be like well we know we're conscious at least we think we are and here's what we do and this thing is not doing that thing like you know yeah the whole whole the chinese room thing is a whole lookup table right like well yeah yeah yeah we're not doing a lookup table but there's some compression going on like we have a compressed representation of something is that so is compression sufficient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7174.842,
    "end": 7179.187,
    "text": " And maybe, you know, or relevance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7179.487,
    "end": 7179.708,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7179.788,
    "end": 7180.028,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7180.208,
    "end": 7181.85,
    "text": "I'm thinking about these ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7182.15,
    "end": 7185.514,
    "text": "I'm not going to, I'm not going to give any teasers, but I'm thinking about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7186.235,
    "end": 7186.695,
    "text": "Um, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7186.715,
    "end": 7192.582,
    "text": "And final question is will large language models get us there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7192.842,
    "end": 7203.955,
    "text": "And by get us there, I mean, um, well, actually you can pick, you can either have consciousness or you can have what people throw around as you know, with the term general artificial intelligence or sorry, artificial general intelligence, AGI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7204.542,
    "end": 7207.547,
    "text": " God knows what that means, but you may have your own definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7207.587,
    "end": 7210.472,
    "text": "So will it get us either to Consciousness or AGI?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7210.492,
    "end": 7211.553,
    "text": "Take your pick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7212.375,
    "end": 7214.358,
    "text": "Please be facetious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7214.378,
    "end": 7216.261,
    "text": "Personally, I find LLMs really boring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7216.542,
    "end": 7222.872,
    "text": "I just don't find them very interesting, and there's been a lot of hype around them and what they can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7223.83,
    "end": 7232.264,
    "text": " You know, I'm the kind of person, I don't have a lot of very strong opinions about these kinds of things because I feel like we just don't know enough, but I can have, I have hunches, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7232.524,
    "end": 7234.487,
    "text": "I have a hunch that it's not gonna get us far enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7235.168,
    "end": 7241.839,
    "text": "And I don't think if you throw enough compute power at an LLM, eventually you'll have something out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7241.859,
    "end": 7250.293,
    "text": "And I think the big reason is because there's so much, when you look at like active inference models, they're not nearly on the scale of, you know, they're not LLMs, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7250.273,
    "end": 7274.762,
    "text": " there's causality there's a sense of causality and structure in the data generation process that i think you're not completely recapitulating with an llm this is more of an intuitive feeling i don't have data to back that up but when i look at an llm i don't see it as i see it as clever memorization with some level of compression um in there and you if if it's possible to do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7274.742,
    "end": 7279.87,
    "text": " you know, you take maybe LLMs is too much to look at, but like a simpler deep learning model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7280.471,
    "end": 7287.343,
    "text": "Can you take that deep learning model and do it better with active inference with less parameters, less training time, less data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7287.663,
    "end": 7290.608,
    "text": "Can you do a lot more with a lot less better generalization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7291.195,
    "end": 7304.172,
    "text": " If you can, then my hunch would be that the active inference model, which is obviously where my position tends toward, is compressing or capturing something in the data much better than a deep learning system is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7305.053,
    "end": 7317.068,
    "text": "Now, I don't know what that difference is and what it's doing, but if I had to make a bet, I would make it on that active inference is doing it better and more compressed in a way that's probably more scalable and more likely to bring about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7317.183,
    "end": 7333.625,
    "text": " so-called AGI, which for me means mimicking human and animal behavior on reasoning tasks is a very vague, like what we see in each other as being intelligent behavior, we recognize it in the systems that we build and doing it as well as human performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7334.426,
    "end": 7338.351,
    "text": "That's kind of what I would consider as a vague definition of what AGI might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7339.733,
    "end": 7340.374,
    "text": "That's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7340.394,
    "end": 7343.739,
    "text": "That's a nice, it's a weak version of AGI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7343.839,
    "end": 7344.119,
    "text": "It's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7344.139,
    "end": 7344.38,
    "text": "It's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7344.4,
    "end": 7344.6,
    "text": "It's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7344.62,
    "end": 7346.262,
    "text": "We're not going to get anyone too angry with that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7346.393,
    "end": 7372.688,
    "text": " don't want to commit too hard to it so no no no well you never know who listens you never know who listens i might get you know an email from jeffrey hinton or someone you never know i'm not i i'm just going to watch um but if versus new philosophers then well actually i know there are philosophers and it sounds like maxwell for example but yeah there's others too yeah and so on well sanji i think all of that means that you're absolutely on the cutting edge of well of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7373.022,
    "end": 7374.143,
    "text": " the future of intelligence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7374.183,
    "end": 7374.944,
    "text": "And that's exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7376.205,
    "end": 7380.089,
    "text": "I think, for my side, you're, you're a real inspiration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7380.189,
    "end": 7381.59,
    "text": "And I say that a lot to people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7381.71,
    "end": 7387.075,
    "text": "And that's because I mean, because I'm really, really very inspired and touched by all the people who have helped me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7387.516,
    "end": 7395.644,
    "text": "But you have helped me not only with this textbook, but also, you know, privately in messages, and you've put up with some terrible questions, probably, but they're all questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7398.206,
    "end": 7398.727,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7398.747,
    "end": 7400.128,
    "text": "I was waiting for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7401.97,
    "end": 7402.27,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7402.958,
    "end": 7413.755,
    "text": " Yeah, I think I this, hopefully, I mean, this podcast, I've really, really loved because I think it shows people that something that can seem incredibly complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7413.815,
    "end": 7424.172,
    "text": "Well, in some sense is but can be, you know, it's tractable to use a sort of Bayesian term, just given a lot of hard work, determination and kind of motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7424.432,
    "end": 7424.933,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7425.47,
    "end": 7434.818,
    "text": " you're definitely a kind of shining light, although people may have not, you know, people may not know you because you're not sort of one of these kind of, you know, you haven't got millions of papers out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7434.878,
    "end": 7439.142,
    "text": "But nonetheless, it's, it's a great pleasure to speak to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7439.403,
    "end": 7441.244,
    "text": "And thank you for the work you do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7442.065,
    "end": 7449.291,
    "text": "I always ask people before they finish just to let people let the public and the listening public know where they can be found.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7450.052,
    "end": 7455.477,
    "text": "So, you know, if anyone does have any curious questions about the textbook,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7456.182,
    "end": 7457.749,
    "text": " And maybe you want to speak about the textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7457.99,
    "end": 7463.998,
    "text": "You can give yourself just the kind of 30 second plug, but yeah, you know, email, Twitter, whatever, whatever's best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7464.552,
    "end": 7466.454,
    "text": " Yeah, email is the best way to reach me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7466.474,
    "end": 7475.202,
    "text": "It's Sanjeev, S-A-N-J-E-E-V.namjoshi, N-A-M-J-O-S-H-I at gmail.com.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7476.223,
    "end": 7481.968,
    "text": "You can also find me on the Active Inference Institute Discord channel if you want to DM me over there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7482.008,
    "end": 7486.432,
    "text": "My website is snamjoshi.github.io.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7487.152,
    "end": 7491.396,
    "text": "I know this hasn't been picked up by search engines yet, so try to work on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7491.416,
    "end": 7492.197,
    "text": "I will put it in the video description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7492.7,
    "end": 7496.814,
    "text": " Yeah, it's hard to find, but I just have a little bit more about my papers and research and things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7497.657,
    "end": 7500.387,
    "text": "Yeah, I'm open for people taking a look at the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7500.487,
    "end": 7505.224,
    "text": "Basically, if you send me an email just saying you want to look at it, I can give you a link to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7505.575,
    "end": 7512.484,
    "text": " the CODA page that's hosted by the Active Inference Institute, or their chapter drafts and just video lectures that I've given.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7512.924,
    "end": 7513.886,
    "text": "Still a work in progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7514.006,
    "end": 7516.409,
    "text": "I'm in second revision right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7516.889,
    "end": 7517.871,
    "text": "There's two books.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7517.911,
    "end": 7520.033,
    "text": "The first volume is due on June 1st.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7521.515,
    "end": 7521.896,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7522.417,
    "end": 7522.937,
    "text": "It's coming up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7522.957,
    "end": 7523.177,
    "text": "Amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7523.198,
    "end": 7524.479,
    "text": "I've been pretty slammed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7524.499,
    "end": 7526.702,
    "text": "And then the next one is Bayesian Mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7526.722,
    "end": 7529.085,
    "text": "It'll be much later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7529.065,
    "end": 7548.93,
    "text": " if you're willing to look through any drafts and you're very curious about anything else um you're welcome to send me an email and i can give you access and also that's just yeah feel free to send me an email and i'm happy to talk awesome sanjeev this was awesome really really fun really informative um thank you so much great thank you very much i really appreciate it",
    "speaker": "SPEAKER_00"
  }
]