[
  {
    "start": 2.512,
    "end": 30.207,
    "text": " all right hello cohort seven thank you everyone for all the introductions and and saying hello this is our first meeting so we've just all introduced ourselves and now we'll talk a little bit about chapter one slash anything active inference related kind of funneling into the textbook anything about the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 30.406,
    "end": 56.683,
    "text": " positioning of the textbook overall the two years since the publication and any topics that people are like excited about to explore in that third week which will give us like a little rest from the rhythm otherwise um but let's go to chapter one and just like where does anyone want to begin or like what's a",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 57.44,
    "end": 75.297,
    "text": " any whether it's a quote or section from chapter one or it's just something about their approach to active inference or it's a it's a general question uh that they have where where would anyone like to begin",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 84.98,
    "end": 85.861,
    "text": " I'd like to ask.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.881,
    "end": 86.923,
    "text": "Oh, yes, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.083,
    "end": 87.324,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 87.965,
    "end": 88.506,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.526,
    "end": 101.788,
    "text": "So there's a statement on page five, saying that active inference as a normative approach to understand brain and mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.228,
    "end": 105.013,
    "text": "Can you explain to me what normative approach means?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.335,
    "end": 137.532,
    "text": " great great question I was wondering the same thing yeah yeah this is one of this is this it this is a very important question I I'm just going to where I I knew that the question had been asked but um Ali or anyone does anyone want to give a thought what what does normative mean when we're talking about active inference and a normative theoretical perspective yes Ali",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 139.553,
    "end": 150.275,
    "text": " Well, yeah, there's an explanation for the use of this term normative in the notes, and specifically on page 267, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.157,
    "end": 161.157,
    "text": "So the use of this term differs a little bit from its normal usage, for example, in philosophy literature or in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.137,
    "end": 162.719,
    "text": " some other discourse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.621,
    "end": 181.848,
    "text": "So here the term normative basically refers to the way active inference modeling somehow works according to some evaluative standards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.209,
    "end": 185.153,
    "text": "So more precisely,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.133,
    "end": 200.51,
    "text": " In active inference, we have a specific parameter, say, surprisal or free energy, which will get familiar more extensively in the coming chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.951,
    "end": 211.022,
    "text": "But there's this parameter around which all the other elements are evaluated and manipulated and modeled and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.002,
    "end": 231.053,
    "text": " So the word normative here actually refers to the framework of this theory, and it's not exactly used in the same meaning as used in, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.033,
    "end": 237.493,
    "text": " in ethics or in some, I don't know, in other usage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.513,
    "end": 244.013,
    "text": "It's used in a rather technical way here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.465,
    "end": 272.464,
    "text": " thank you Ali yeah I added a link here to the social sciences course from last year and Avell and Mao's work and Benz and friends too is discussing the social normativity social constraints and so that kind of like ought versus is and like what one ought or normed to do as Ali mentioned um but but it but it's",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 273.743,
    "end": 295.178,
    "text": " we've explored that from some other directions too like to what extent does this outline how one ought to model Michael sure um yeah it is moving on to a different subject um uh I was kind of wondering uh so",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 296.592,
    "end": 324.827,
    "text": " the agents or entities uh often have like a sort of highest preference the prior um i'm wondering if theoretically and or practically i suppose these policies are always kind of externally artificially injected as like sort of axioms or something like uh fine food say",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 325.347,
    "end": 350.275,
    "text": " Or if active inference is, I guess, I don't know if the word self-consistent, but if these priors manifest automatically by the, I suppose, perhaps, notion of minimizing surprise, or if the biased priors are artificially injected every time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 355.165,
    "end": 358.709,
    "text": " This is a great question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 358.869,
    "end": 359.851,
    "text": "Anyone have a thought on it?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 362.253,
    "end": 367.74,
    "text": "Well, normative, even in this discussion, is sometimes used in a very strong sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 368.541,
    "end": 378.673,
    "text": "The core body temperature of a mammal has to be between a certain minimum and a certain maximum, or that animal will stop moving.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 378.713,
    "end": 380.775,
    "text": "That animal will die.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 381.897,
    "end": 384.7,
    "text": "You have to have a certain amount of oxygen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 385.557,
    "end": 409.202,
    "text": " or you will stop moving and die uh there are some less violent impositions for instance anyone walking in public in a u.s city has to wear clothes and if you don't you will be taken away and therefore you will not be walking in a city anymore",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 410.397,
    "end": 418.465,
    "text": " So then you can get into much more optional things like people have to be minimally nice to one another or people stay away from you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 419.066,
    "end": 432.24,
    "text": "But there's a great range of uses, all of which have the sort of ordinary language sense of ought to or have to, must, must not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 432.84,
    "end": 439.527,
    "text": "I think any of those things are norms of one kind or another and can be thought of normatively.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 440.789,
    "end": 456.52,
    "text": " cool yeah I guess um you know they kind of help kickstart and bootstrap the framing of a problem of interest anyways otherwise how do you you have to define boundaries at some point I suppose yeah",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 458.356,
    "end": 471.403,
    "text": " yes the system of interest choice and the boundary identification question in theory and practice this will come up a lot um Ali and then anyone else who raised their hand",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 472.953,
    "end": 484.125,
    "text": " Well, yeah, regarding Michael's question about how exactly prior slash preferences are implemented in the agent, well, I believe it's both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.225,
    "end": 498.64,
    "text": "I mean, it can be implemented purely artificially, in an artificial way, or it can arise from, as an activist would call, through sense-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.62,
    "end": 513.642,
    "text": " So it can be pretty autonomous and it's not required to somehow implement those priors and preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.622,
    "end": 542.768,
    "text": " through some external implementation uh in self-organized in self-organized agents and specifically in the organisms that participate in the sense making i i use this term in the inactive inactivist sense those priors and preferences can arise from the very active sense making",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.748,
    "end": 549.517,
    "text": " So yeah, it can be, I mean, purely internal and autonomous as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.281,
    "end": 552.561,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.625,
    "end": 555.845,
    "text": "Cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 556.046,
    "end": 557.447,
    "text": "Yeah, there's so much to say on this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 557.548,
    "end": 571.506,
    "text": "Like in the textbook, we're learning about some of the Lego pieces and the building blocks and some of the names of the colors and like that level of fundamental.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 571.486,
    "end": 589.782,
    "text": " And then we work in the second half of the textbook on some simple examples, like listening to music in anticipation, a rat in a tea maze, and some other kinds of simple mapped cases, like a pendulum swinging in physics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 589.762,
    "end": 607.23,
    "text": " and then the sophistication and the the complexity hierarchy is essentially open-ended because this is a cognitive modeling approach or systems modeling approach so when we're talking about complex territories then it's like a complex map so a lot of times there's this",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 608.408,
    "end": 637.47,
    "text": " movements or tendency to and and an effective one at that to kind of like ground in a more basic example or motif like something that we'll see in the textbook but then when we look at like a complex system like an organism or social setting then that's that's stretching the limits of our like mapping and modeling capacities and then we can kind of supplement that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 638.345,
    "end": 664.588,
    "text": " movement from the simpler motif to the more complex system of interest supplement that but okay well what what what is this new recent Ryan Smith paper on interoception like how are they modeling it here and so that helps enter in like more modern and empirical work otherwise we can go very simple look at the sort of essentials",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 665.53,
    "end": 683.826,
    "text": " that's uh and then we can also take it to um strive to model more complex systems any question or thought we can just or we can also look at some of the top prior questions",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 696.935,
    "end": 704.827,
    "text": " So one feature that comes up in chapter one, well, there's two figures in chapter one.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 706.85,
    "end": 711.497,
    "text": "This is the dyadic phrasing of agent and niche.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 712.559,
    "end": 713.841,
    "text": "There's a deeper symmetry.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 714.402,
    "end": 716.826,
    "text": "So it could be like agent, agent, niche, niche.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 717.126,
    "end": 721.693,
    "text": "It's just often represented as like a mobile agent in a world.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 722.18,
    "end": 726.824,
    "text": " However, the framework for interfaces, boundaries, blankets is more generic than that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 727.265,
    "end": 733.13,
    "text": "But this is kind of the two-part model with observation coming in, action going out.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 733.751,
    "end": 744.081,
    "text": "And then that is going to get nuanced into more of a four-part model where there's two things coming in and then there's two things coming out.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 744.561,
    "end": 745.462,
    "text": "But we'll get there.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 746.082,
    "end": 748.845,
    "text": "So this is sort of just situating",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 749.062,
    "end": 770.665,
    "text": " active inference within the psychological psychological tradition the cybernetic of agent and niche and then we have the famous figure 1.2 which introduces and summarizes the low road and the high road this is a really important",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 771.708,
    "end": 776.059,
    "text": " distinction that was introduced lightly in some earlier work.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 776.079,
    "end": 780.972,
    "text": "It's referenced in a few of the questions about the desert landscape.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 781.894,
    "end": 786.426,
    "text": "And here we have active inference as it's kind of like a metro map.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 787.435,
    "end": 789.998,
    "text": " It's a schematic Metro map.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 790.018,
    "end": 796.024,
    "text": "So it's not like these are the only and the only ordering of terms along the way.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 796.524,
    "end": 803.972,
    "text": "So don't commute with this map per se, but it does describe the low road and the high road so-called.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 804.092,
    "end": 807.315,
    "text": "So does anyone just like wanna give any thought or overview?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 808.296,
    "end": 810.558,
    "text": "How do they see the low road and the high road?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 811.719,
    "end": 812.961,
    "text": "What distinguishes them?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 814.342,
    "end": 817.425,
    "text": "How does this concept like come into play in the textbook?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 828.678,
    "end": 841.072,
    "text": " I don't know if this is a dumb point, but I guess what interests me as somebody who doesn't know very much about Bayesianism at all but would like to, is that it's interesting that they are two separate directions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 842.053,
    "end": 849.362,
    "text": "I guess naively I would have thought that the free energy principle was quite reliant on Bayes' theorem because of the definition of surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 851.704,
    "end": 854.027,
    "text": "So I guess it's interesting to me the idea that there are two",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 855.661,
    "end": 859.024,
    "text": " roads and one doesn't kind of depend on the other but they meet at one place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 862.367,
    "end": 863.768,
    "text": "Interesting, thank you.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 864.489,
    "end": 866.01,
    "text": "Leanne and then Frasier.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 869.053,
    "end": 876.0,
    "text": "As I've looked into this I'll make a comment but it might be a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.02,
    "end": 883.086,
    "text": "So my sort of take on things is that the low road is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.888,
    "end": 908.449,
    "text": " perceptually based and that's distinctly different from the free energy principle side through predictive processing into active inference that is about um survival and resisting entropy and and that line of things so is that correct",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.72,
    "end": 913.262,
    "text": " Yeah, that's great.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 913.302,
    "end": 914.103,
    "text": "Let's revisit this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 914.664,
    "end": 915.044,
    "text": "Frasier?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 916.806,
    "end": 918.569,
    "text": "Yeah, just a thought on the low road and the high road.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 918.649,
    "end": 924.516,
    "text": "To my mind, I mean, there is that great 15-minute video of Carl Friston talking about the low road and the high road.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 925.417,
    "end": 936.09,
    "text": "As far as I can recall, the low road is perhaps, you know, we're starting with an idea about very, very small microstates of some system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.791,
    "end": 941.457,
    "text": "And we're going to perhaps, maybe this is a gas or something, and we want to have a look at how those microstates are interacting",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 941.993,
    "end": 950.984,
    "text": " And then through a kind of amalgamation of this, you know, the behavior of these microstates, we can maybe get out of that an abstraction, something like adaptive behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 951.544,
    "end": 962.217,
    "text": "Whereas the high road is a bit more like, okay, let's just take a bit more of a sort of an armchair approach and kind of, you know, conceptualize from a top down idea about what it would mean to be adaptive at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 964.44,
    "end": 969.646,
    "text": "Kind of starting from an aggregate idea and then kind of going down and saying, okay, well, we have this aggregate idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 969.686,
    "end": 971.528,
    "text": "How are the microstates then going to have to behave?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 972.183,
    "end": 975.353,
    "text": " So that's kind of my thoughts on the low road and high road distinction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 976.035,
    "end": 982.294,
    "text": "The only other thing I would like to mention is on that initial figure you showed, the agent observation loop,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 983.084,
    "end": 992.256,
    "text": " I have in various other parts of the literature, cybernetics, cognitive science, and so on, heard this referred to as the sensor motor loop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 992.457,
    "end": 994.479,
    "text": "I don't know if they actually use that terminology in the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 994.519,
    "end": 994.96,
    "text": "I could be wrong.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 994.98,
    "end": 996.762,
    "text": "It has been a little bit since I've actually read the book.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 997.383,
    "end": 1004.773,
    "text": "But that seems to be a relatively universal way to talk about this process of cyclical interaction between a system and its environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1004.793,
    "end": 1007.096,
    "text": "So I hope that's somewhat interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1009.059,
    "end": 1009.539,
    "text": "Thank you.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1011.121,
    "end": 1011.522,
    "text": "Yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1014.843,
    "end": 1019.73,
    "text": " So there's a lot of ways to talk about the low and the high road.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1020.632,
    "end": 1025.038,
    "text": "Does anyone else want to just give any other thought on low or high?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1028.163,
    "end": 1033.23,
    "text": "A textbook scale point to make is this sets up chapters two and three.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1033.971,
    "end": 1040.04,
    "text": "Chapter two is going to take us from the low road to active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1040.493,
    "end": 1043.916,
    "text": " Chapter three is gonna take us from the high road to active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1044.376,
    "end": 1050.322,
    "text": "And then chapter four is like the big, like here you are, here's the active inference generative model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1050.822,
    "end": 1052.804,
    "text": "This is what you write in RX infer.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1053.144,
    "end": 1054.685,
    "text": "This is what you write on the napkin.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1055.246,
    "end": 1057.548,
    "text": "This is what you're sketching in the diagram.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1057.568,
    "end": 1070.179,
    "text": "Like that's the active inference generative model, which is both constructed along the low road path and compliant under the free energy principle umbrella.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1070.294,
    "end": 1086.6,
    "text": " So that's why the active inference generative model is sort of like the meeting point or the overlap, because it's both a manifest artifact, which is what allies it with these kinds of model architectures found all along the low road.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1087.902,
    "end": 1096.015,
    "text": "And it's a modeling output artifact, which is compliant with this free energy principle and the Bayesian mechanics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1096.231,
    "end": 1100.336,
    "text": " So that's why sometimes people will talk about active inference as well.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1100.456,
    "end": 1101.338,
    "text": "It's a corollary.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1101.478,
    "end": 1104.662,
    "text": "It's like a downstream or it's a derivative of the free energy principle.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1105.263,
    "end": 1121.243,
    "text": "So it's like, this is how you take free energy principle, which we'll go into and apply that to persistent systems or adaptive or dynamic systems or taking the low road, like cobbling and tinkering together.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1121.965,
    "end": 1127.713,
    "text": " Like if you start with Bayes' theorem, now the last name does basically no work here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1128.333,
    "end": 1138.407,
    "text": "Bayes' theorem is just about conditional probabilities, for example, between observations of data and abductive inferences to latent states.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1138.968,
    "end": 1149.762,
    "text": "But we have here, like if you wanted to build an architecture for perception and action, even the special case, like just a perceiver or just an actor,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1150.67,
    "end": 1177.082,
    "text": " If you wanted to do that in a fully synthetic setting, like in Silico, like building agentic AI or building an API call or something like that, or if you wanted to use this more of like an empirical cartography sense, like making a model of a sensory motor system, you're gonna start implementing these different kinds of modeling choices.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1177.18,
    "end": 1196.893,
    "text": " And so built things are all along the low road, which looks a lot in many cases like machine learning, artificial intelligence, these neural networks, linear algebra, stochastic dynamical processes, and building up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1197.127,
    "end": 1210.495,
    "text": " towards artifacts that contain this unified approach to perception action and one note on that coming only from the low road here not bringing in FEP per se is",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1211.521,
    "end": 1219.095,
    "text": " In signal processing, which is dealing with that inbound perception question, action is often neglected.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1219.736,
    "end": 1231.437,
    "text": "And then on the contrary, in control theory, like balancing the plate on the stick and mountain car, all that in control theory, the perceptual question is often neglected.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1231.602,
    "end": 1249.037,
    "text": " And so one piece of the low road approach here is taking a unifying approach to perception action, not erasing their differences, but having them as part of a unified imperative, evidence maximization, surprise minimization.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1250.435,
    "end": 1276.746,
    "text": " bounded by the variational free energy so that's kind of one element is having perception action in a unified model and then kind of a broader commitment to the unifying of all these diverse cognitive phenomena like attention memory learning anticipation all these different kinds of phenomena which otherwise it would be totally grab bag how would these be linked",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1276.726,
    "end": 1283.097,
    "text": " And there can be like infinite pairwise combinations and models that might not survive having a third piece of the puzzle added.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1283.638,
    "end": 1294.397,
    "text": "But by taking this kind of broader unificationist perspective, the whole iguana perspective, like we're going to use an integrated toolkit to model the whole thing.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1294.546,
    "end": 1319.642,
    "text": " in its phenomena as it appears to the modeler that's what gives unity on the low road and then that's without getting into the free energy principle and and what it brings from that first principles perspective the end oh sorry or anyone else who wants to raise their hand or or give a thought",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1322.592,
    "end": 1329.382,
    "text": " Um, yeah, I just add one thing to your, your comment on the grab bag of like attention and memory and everything like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.402,
    "end": 1333.007,
    "text": "Cause it's actually something we're working on within the marketing field right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1333.427,
    "end": 1341.699,
    "text": "Um, could you speak more to like how this, uh, this approach would help keep that from being that grab bag?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1341.739,
    "end": 1345.444,
    "text": "Cause that is basically the way it works in a practical sense, at least in my industry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.681,
    "end": 1349.982,
    "text": " Yeah, great question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1350.142,
    "end": 1358.39,
    "text": "What does it really look like or mean for active inference to be a unifying approach to modeling different cognitive phenomena?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1359.351,
    "end": 1360.372,
    "text": "What would anyone say?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1366.818,
    "end": 1367.298,
    "text": "Yeah, Frazier.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1368.139,
    "end": 1369.801,
    "text": "Hi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1369.821,
    "end": 1371.542,
    "text": "Oh, I'll let someone else go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1371.562,
    "end": 1372.283,
    "text": "I've talked already.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1373.624,
    "end": 1375.987,
    "text": "I heard someone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1376.007,
    "end": 1377.608,
    "text": "Sorry, that was me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1381.537,
    "end": 1382.919,
    "text": " Did you want to go, Tom?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1384.682,
    "end": 1399.663,
    "text": "Well, I guess I'm sure you'll have a smarter thing to say, but I guess my understanding of a lot of these sort of predictive processing models was that there's no difference really between a sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1400.588,
    "end": 1423.103,
    "text": " desire and a prediction and so the sort of this sort of classical psychology state where you have a want and you act on the world and you know what your desire is like and you know when you've kind of reached that goal because you're like what you observe the reality matches what your prediction was is sort of collapsed so that free energy sort of replaces",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1423.927,
    "end": 1431.875,
    "text": " like through surprisal replaces this old distinction between like what a desire is and what a prediction about the world is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1433.256,
    "end": 1447.19,
    "text": "So my understanding is that those are united there and the attention is seen more as a sort of, I guess, a process by which that's achieved as in when you attend to something, you're reweighting your priors about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1447.931,
    "end": 1448.752,
    "text": "But I could be wrong there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1449.433,
    "end": 1451.875,
    "text": "That could all be nonsense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1454.2,
    "end": 1455.222,
    "text": " Yeah, very sure.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1455.462,
    "end": 1455.963,
    "text": "Thank you, Tom.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1457.245,
    "end": 1461.111,
    "text": "I mean, yeah, that is, in essence, what I was going to recapitulate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1461.151,
    "end": 1468.182,
    "text": "I mean, so the initial question was, how might activists bring a sort of unifying approach to cognitive phenomena in general?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1468.863,
    "end": 1469.725,
    "text": "I think that was the question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1470.987,
    "end": 1475.995,
    "text": "I'm a very, very big fan of the work of Dr. John DeVakey at the University of Toronto.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1476.015,
    "end": 1477.076,
    "text": "He's a cognitive scientist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1477.798,
    "end": 1480.562,
    "text": "So his kind of whole obsession in life is this idea of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1480.897,
    "end": 1485.344,
    "text": " how it is that we maintain adaptivity per se as an agent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1486.205,
    "end": 1487.247,
    "text": "What makes us intelligent?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1487.287,
    "end": 1490.552,
    "text": "And he thinks it's this process called relevance realization.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1490.572,
    "end": 1493.656,
    "text": "We're able to zero in on the relevant information, essentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1495.259,
    "end": 1500.246,
    "text": "So all cognitive processes under this idea would have to do with our ability to zero in on the relevant information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1500.927,
    "end": 1501.869,
    "text": "And what might that be?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1501.909,
    "end": 1509.3,
    "text": "Well, in this case, we have this framing of a sensor motor loop, this eco niche that we're constructing for ourselves to maintain",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1509.938,
    "end": 1511.079,
    "text": " integrity across time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1511.099,
    "end": 1529.439,
    "text": "So I guess in the, in the, in the broadest possible conceptualization, you know, active inference is a way of talking about how the adaptivity of that sensor motor loop is, is tuned, uh, in order to result in the perpetuation of the sensor motor loop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1529.459,
    "end": 1537.228,
    "text": "So, and what you have to do, what that boils down to is what Tom said, basically is you have to have a, you have to embody a model of what your world is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1537.394,
    "end": 1565.173,
    "text": " order to be able to uh match and be in sync with it so that you can you can avoid things that are deleterious to your your boundaries and you can you can take in things that are good for you and so on so i'll stop talking okay yeah there's a lot to say and i and i think we'll also be able to pick out some uh things that the that the authors the textbooks say i'll give kind of a a just a",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1565.542,
    "end": 1585.137,
    "text": " uh a primer response on this which is to go to figure 4.3 so we're looking ahead to what an active inference generative model can look like in this model whether looking at it in the discrete time or in the continuous time setting",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1585.91,
    "end": 1591.722,
    "text": " There aren't like advanced cognitive, there isn't self reflexivity.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1592.062,
    "end": 1594.828,
    "text": "There's not like material reconstruction.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1595.409,
    "end": 1603.986,
    "text": "So there are phenomena in the real world, in the real territory that are not in every single active inference map.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1604.152,
    "end": 1608.5,
    "text": " Part of the cool thing about active inference is you can apply it to a rock.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1609.161,
    "end": 1611.445,
    "text": "Not that it's the best tool, but you could.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1611.465,
    "end": 1617.996,
    "text": "You could apply it to a cloud as it kind of coalesces over a mountain or something like with a rain shadow.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1618.256,
    "end": 1624.928,
    "text": "So it doesn't need to apply to any given system or cognitive system.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1624.908,
    "end": 1645.077,
    "text": " and so because of that generality one way to think of it is active inference says less as a technique which enables people to say more and different about systems of interest so how does this relate to how different psychological phenomena cognitive phenomena get unified in practice",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1645.411,
    "end": 1655.987,
    "text": " So let's just say that somebody says, well, I'm interested in the relationship between sensory precision, prior beliefs and agency and estimates of efficacy in the world.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1656.769,
    "end": 1662.758,
    "text": "Well, without a first principles approach, that could be just a mega open-ended literature search.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1662.778,
    "end": 1665.983,
    "text": "You're going to hit on every single paper and journal on all those.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1666.163,
    "end": 1668.567,
    "text": "And then, you know, what?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1669.981,
    "end": 1675.207,
    "text": " Another way would be to say, okay, well, I'm gonna associate sensory precision with the A matrix here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1676.008,
    "end": 1685.338,
    "text": "I'm gonna associate prior beliefs and their possible differences with D. And with efficacy, I'll associate with B, and I'll do this and this and that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1685.759,
    "end": 1698.553,
    "text": "And so I'll kind of compose my Legos together, and then I'll do model sweeps to explore the accuracy minus complexity of model fit, like model preference and efficacy,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1699.647,
    "end": 1706.001,
    "text": " for this empirical data set, which one of these synthetic models fits the data best?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1706.321,
    "end": 1711.412,
    "text": "Or maybe we just wanna do the big one and test something specific about",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1712.067,
    "end": 1714.092,
    "text": " the biggest possible combinatoric model.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1714.893,
    "end": 1731.831,
    "text": "So even though this can initially feel like less of an answer, what enables it to actually be more of an answer through time is that active inference isn't opinionated on what it would even mean for attention to connect to agency.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1731.912,
    "end": 1740.287,
    "text": " But then in practice, when you see a paper that says by agency, we mean this, by attention, we mean this, and here's how we modeled their interactions.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1741.289,
    "end": 1754.713,
    "text": "So that's the unified compliant playground that allows modelers to actually specify and then have interoperability under the unified imperative.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1755.284,
    "end": 1759.673,
    "text": " So then models can be tested like with factor one, factor two, factor one and two.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1760.395,
    "end": 1775.908,
    "text": "And then there's actually a coherent way to say where one is more preferable and what data set they have what kind of performance on instead of getting into these like more ontological debates about, you know, well, how does it happen in the brain?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1777.88,
    "end": 1787.435,
    "text": " Well, then that's great to zoom in and study how it really might be happening in the brain, but that will never give a generic answer because now we're looking at a system of interest.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1788.136,
    "end": 1788.377,
    "text": "Tom?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1790.46,
    "end": 1790.801,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1790.861,
    "end": 1792.143,
    "text": "This is a very basic question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1794.226,
    "end": 1801.858,
    "text": "So this idea is like, you know, you might have like one matrix that means attention or mathematically instantiates this idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1802.359,
    "end": 1804.242,
    "text": "Does that mean you could create an organism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1805.065,
    "end": 1812.695,
    "text": " with some capabilities, like some kind of cognitive capabilities in the model that don't exist in the real world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1813.196,
    "end": 1829.959,
    "text": "You know, so you're not, you don't say as a framework, you need to have some mathematical bit that does attention, some mathematical bit that does prediction, but that it's generic enough that you could instantiate really any kind of thing that you could conceive as a cognitive capacity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1831.053,
    "end": 1832.657,
    "text": " Yeah, that's a great way to put it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1832.878,
    "end": 1846.412,
    "text": "One thing that Maxwell Ramstad said in the Discord that I remembered a few weeks ago was the focus on agents has led people to underestimate the scope of free energy principle, Bayesian mechanics.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1846.949,
    "end": 1859.644,
    "text": " So not just is active inference unopinionated on cognitive architectures of any given agent, it's unopinionated on how one might distinguish or model or even need there to be agents.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1859.664,
    "end": 1873.8,
    "text": "You could just make a fabric of API calls, or you could make a fantasy subway map that doesn't need to have any resemblance to any known cognitive system or any extant system at all.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1874.438,
    "end": 1877.403,
    "text": " Again, will that be useful for this or that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1877.463,
    "end": 1878.925,
    "text": "Will somebody pay you for this or that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1879.005,
    "end": 1879.927,
    "text": "Will that startup work?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1880.007,
    "end": 1899.197,
    "text": "I mean, those are secondary questions, but when we see that, well, we're talking about like base graphs and then we're gonna associate incoming directionality with perception and outgoing with action, but that doesn't need to have any kind of",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1900.173,
    "end": 1905.749,
    "text": " I'm not gonna say it's the limits of what can be said there, but that is the toolkit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1907.494,
    "end": 1912.849,
    "text": "And then someone can make an architecture that has any kind of existence within an arbitrary niche.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1912.913,
    "end": 1939.917,
    "text": " especially if it's in an immortal setting like the mortal computing that's where it gets into the the strange Loop and the embodied and the survival and and that's a very interesting direction but especially in silico where the survival imperative is just the modelers whimsy you can make arbitrary things and making simple pedagogical things is often a totally critical step",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1939.981,
    "end": 1966.393,
    "text": " like when we look at the the music modeling case in chapter seven this this isn't claiming to be a total model of aesthetics or of culture someone says yeah but also they they might have to breathe where's the oxygen in this model it's like it's it's just one facet or motif that makes sense thank you",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1967.808,
    "end": 1995.688,
    "text": " yeah it's really fun to to explore like what are the limits and the constraints of modeling of formalization of experimentation and then within that how does active inference differ from near relative approaches so there's like kind of like a continent scale and then a more fine scale differentiation sometimes like are we comparing active inference",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1996.85,
    "end": 2010.267,
    "text": " with some unnamed or named qualitative approach, which is a little bit like an apple and an orange comparison, which isn't necessarily a bad thing, just they're two different kinds of stances?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2010.908,
    "end": 2019.659,
    "text": "Or are we comparing active inference to a model where perception and action are not considered with a unified imperative?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2020.62,
    "end": 2022.162,
    "text": "But then let's see what that model is.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2022.943,
    "end": 2026.047,
    "text": "And then that's more of a model to model discussion.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2027.815,
    "end": 2057.518,
    "text": " be the difference between two competing hypotheses or two alternative models on a data set versus the question that's broader which is like should we model this data set at all cool well i hope this is a little flavor of chapter one and and some fun people who will be spending the coming months with",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2058.005,
    "end": 2067.814,
    "text": " Again, if you want to join the 13 UTC, we'll be in chapter six, which is super fun and a great starting point as well, which is the recipe.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2068.115,
    "end": 2075.161,
    "text": "And that's the steps that we'll really go through to make active inference models in cohort six.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2075.882,
    "end": 2084.13,
    "text": "Or otherwise, we'll catch up and Andrew and or",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2085.005,
    "end": 2113.155,
    "text": " Ali or maybe others will be facilitating but um in the time between people can add questions add and augment just if you want to do something and contribute to it and you don't know what again just let blanket know okay cool thank you till next time everyone bye thank you everyone thanks everyone",
    "speaker": "SPEAKER_07"
  }
]