[
  {
    "start": 4.688,
    "end": 8.252,
    "text": " Hello everyone and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.612,
    "end": 11.495,
    "text": "Today I have the real pleasure of speaking to Ryan Smith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.136,
    "end": 21.205,
    "text": "Ryan is a principal investigator at the Laurier Institute for Brain Research and he's the research associate professor at Oxley College of Health Sciences at the University of Tulsa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 21.886,
    "end": 34.138,
    "text": "His work focuses on the neurocomputational mechanisms underlying emotion-cognition interactions and how they relate to brain-body interactions with special focus on planning, information gain and interoceptive inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.557,
    "end": 42.366,
    "text": " is also the primary author of probably the best known and most highly rated tutorial on active inference writing it alongside Carl Friston and Christopher White.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.106,
    "end": 44.828,
    "text": "Ryan, thank you for giving me your time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 45.809,
    "end": 46.43,
    "text": "Welcome to the show.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.311,
    "end": 50.114,
    "text": "Thanks for thanks for having me excited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.314,
    "end": 51.396,
    "text": "It's an absolute pleasure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.516,
    "end": 53.638,
    "text": "It's really very exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.718,
    "end": 61.847,
    "text": "As I said, I mean, obviously, I'd come across your work kind of inevitably for me to have invited you but it was actually a real treat to sort of go back and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.401,
    "end": 67.587,
    "text": " go through what feels like you've done loads and work at this incredible velocity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.749,
    "end": 77.88,
    "text": "So it's been really fun to dive in and explore this, I guess what felt like a more empirical side, because I'm spending most of my time reading philosophy papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.421,
    "end": 82.907,
    "text": "So it's great to see some traditional statistics and some proper empirical work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.007,
    "end": 85.59,
    "text": "So it's been great fun on my part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 86.33,
    "end": 92.777,
    "text": " I wanted to start at kind of a pretty broad level and speak about subjective wellbeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.557,
    "end": 100.144,
    "text": "So you wrote this paper in 2022, sort of grounding subjective wellbeing in the parameters and mechanisms of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.347,
    "end": 111.776,
    "text": "You alongside Kasper Hesp have come up with this really nice way of grounding wellbeing in expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.677,
    "end": 115.56,
    "text": "But as you write in that paper, you say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.861,
    "end": 124.816,
    "text": " While variational free energy can be understood to track basic biological fitness, this is neither necessary nor sufficient for an individual to report high subjective wellbeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.457,
    "end": 138.139,
    "text": "So maybe where we could start for the audience is just explaining why the minimization of variational free energy is not sort of the simple solution to obtaining high subjective wellbeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 138.423,
    "end": 138.844,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.904,
    "end": 139.084,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.104,
    "end": 144.473,
    "text": "And I mean, it's definitely a very kind of complicated and complex topic to jump into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.513,
    "end": 149.422,
    "text": "And it honestly depends a little bit about the exact kind of formalism that you're kind of working in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.442,
    "end": 157.596,
    "text": "I mean, me, I almost exclusively work within the sort of like POMDP formalism associated with decision making and planning processes that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.576,
    "end": 159.721,
    "text": " that is the focus of our tutorial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.821,
    "end": 166.876,
    "text": "And the focus of the tutorial was very much like trying to get people to a point of being able to do true kind of experimental empirical applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.976,
    "end": 172.247,
    "text": "I mean, that's the final section is all kind of meant to transition into that just because that's primarily what I do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.269,
    "end": 177.458,
    "text": "So I mean, with respect to the kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 177.674,
    "end": 188.71,
    "text": " Yeah, your question here is that within the POMDP scheme, you know, variational free energy is primarily used as a means of optimizing posterior beliefs about states, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.77,
    "end": 202.99,
    "text": "It's a state inference sort of process, whereas expected free energy is the thing where you're trying to say, okay, what do I expect the kind of rewardingness of the outcomes to be and how much information do I expect to gain, you know, conditional on choosing X versus Y?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.527,
    "end": 215.322,
    "text": " So there is a true kind of valency thing in the expected free energy because you have this expected divergence or lack thereof between the things you want and the things you expect under a policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.883,
    "end": 229.72,
    "text": "Whereas the variational free energy is just a function of the observations you're getting and how you update beliefs about the most appropriate approximate posterior over those states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.7,
    "end": 230.04,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.481,
    "end": 238.873,
    "text": "So in other words, you know, if I perceive that, you know, the observation I'm getting is that, you know, someone's like stabbing me or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.574,
    "end": 239.774,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.235,
    "end": 250.75,
    "text": "Then the process I go through to minimize variation for energy, that that is what I use to infer that the best interpretation of what's happening to me is that I'm currently being stabbed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.77,
    "end": 251.05,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.35,
    "end": 268.056,
    "text": " So if the idea with variational free energy, as it is, at least in the kind of standard POMDP formalism, is a way of just getting at the best posterior belief about the state you're in, then that state could be something you really like or something you really don't like, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.178,
    "end": 269.798,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.119,
    "end": 276.649,
    "text": "So just when you see it that way, then there is this kind of big distinction between trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 276.967,
    "end": 292.424,
    "text": " trying to maximize the consistency between your preferred observations and the observations you think you're going to get, that's just, that's valency and could relate to well-being in a much more direct way than just trying to optimize your beliefs about the current states you're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.965,
    "end": 293.605,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.625,
    "end": 306.94,
    "text": "It's interesting that, yeah, you focus more on the sort of perceptual side of variational free energy, because at least the way that I've spoken about it and I've seen written and I've written is that it's kind of dual-wieldy in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.375,
    "end": 314.724,
    "text": " variational free energy being this kind of upper bound on self informational surprise, or you can also minimize it by taking action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.445,
    "end": 319.711,
    "text": "But then that said, when we talk about action, we always frame it within expected free energy terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.392,
    "end": 335.391,
    "text": "So I've been kind of thinking just, again, this is just a completely sort of nascent, not really fleshed out for is that action seems to do can do variational for energy and expected free energy minimization at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.877,
    "end": 352.376,
    "text": " in the sense that if your sort of maximization of model evidence term, the minus log of the probability of Y, if you're doing that and also you're maximizing pragmatic value, it seems like you're doing both at the same time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 352.956,
    "end": 359.944,
    "text": "Is it kind of an erroneous way of thinking to align or combine expected free energy and variational free energy in this way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.818,
    "end": 370.317,
    "text": " Um, yeah, I mean, like I said, it's a little bit complex because I mean, um, so, so, okay, let's start with this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.337,
    "end": 380.818,
    "text": "Um, certainly, um, in the, uh, you know, what the, the accuracy of the expected free energy calculation that you do, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.102,
    "end": 384.908,
    "text": " depends on whether you have good posterior beliefs over states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 385.71,
    "end": 397.61,
    "text": "And it depends on whether you're updating your actual generative model appropriately based on the patterns of observations you're getting over time, which would correspond to what we typically call learning as opposed to perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.65,
    "end": 400.835,
    "text": "So obviously, you're expected for energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 400.855,
    "end": 403.92,
    "text": "Estimates will not be good if your model is really bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 404.39,
    "end": 411.52,
    "text": " And so there's an indirect dependence on our ability to maximize being in the states that we want to be in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.722,
    "end": 426.041,
    "text": "There's a dependence between that and minimizing variational free energy, at least in a way that, of course, that depends on whether you're minimizing variational free energy with respect to a model that's in fact accurate, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.141,
    "end": 431.629,
    "text": "I mean, you can get an approximate posterior belief that minimizes variational free energy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.896,
    "end": 439.688,
    "text": " with respect to a model, but if your model is very mismatched with the world, then that approximate posterior is still not going to be a good description of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.768,
    "end": 445.737,
    "text": "And therefore you might still end up getting observations you really don't want when you choose policies based on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.098,
    "end": 446.438,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 446.458,
    "end": 456.874,
    "text": "So, um, you know, that being said, I mean, you know, it's a little bit the way you formalize it because, um, the, you know, often when it's kind of talked about more generically, especially in the philosophy literature,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 457.293,
    "end": 480.642,
    "text": " Um, yeah, definitely variational for energy has the kind of dual right perception action aspect, but, um, but there, there isn't really like a, I mean, the, the tricky thing is, is that action, at least when action is formed in the kind of explicit planning decision-making sense, you still do require, um, some kind of cost function, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 480.702,
    "end": 486.089,
    "text": "You still have to have some mechanism that says I expect action a to be better than action B. Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.109,
    "end": 486.169,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.689,
    "end": 490.593,
    "text": " And free energy is a function of current observations, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.653,
    "end": 495.758,
    "text": "Whereas the planning and decision making kind of has to be with respect to future observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.779,
    "end": 500.403,
    "text": "And that's kind of the distinction between variational and expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.463,
    "end": 509.312,
    "text": "Now, I say that in addition, however, I mean, so you mentioned the thing that me and Casper had done with, you know, deeply felt affect paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.993,
    "end": 513.777,
    "text": "And in there, there is this kind of further term that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.757,
    "end": 517.544,
    "text": " can be added into the active inference formalism if you want to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 517.584,
    "end": 519.547,
    "text": "It doesn't always kind of have to be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.587,
    "end": 525.979,
    "text": "It depends on the context of the sort of task or cognitive process you care about or that you're trying to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.079,
    "end": 536.237,
    "text": "But you are effectively comparing the expected free energy to the variational free energy with the new observation that you get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.774,
    "end": 537.094,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 537.134,
    "end": 539.317,
    "text": "And so there either will be a match or a mismatch there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.959,
    "end": 566.612,
    "text": "So if it's the case, for example, and under with that example, if it's the case that the, um, the expected fringes gets a little mathy, but, but the expected for energy vector over, over policies, if that kind of geometrically, if, if that vector points in a direction that is consistent with, um, the variational for energy of the observation that you get, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.896,
    "end": 571.584,
    "text": " then you can kind of think of that as being a little bit kind of like a positive reward prediction error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.604,
    "end": 585.529,
    "text": "It's basically saying that what you got was consistent with and even sort of better than expected compared to G. So it's kind of like F matches with G or is consistent with G or maybe even a little better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.509,
    "end": 615.516,
    "text": " um nice and and that in the in the deeply felt affect formalism the idea was that that that uh sort of positive prediction that positive reward prediction error effectively can itself be treated as an observation that can kind of feed into a higher level model where it's kind of like evidence for a positive affective state and then that can kind of put a prior back down on what that what the kind of expected value is for um the parameter associated with that which is just this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.665,
    "end": 616.909,
    "text": " beta hyper prior thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.314,
    "end": 621.344,
    "text": "And the function of that though is interesting, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.365,
    "end": 626.542,
    "text": "Because in the reverse direction, you can also have F disagree with G, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.562,
    "end": 627.666,
    "text": "Which would just mean that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.051,
    "end": 628.271,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 628.312,
    "end": 630.937,
    "text": "You're expected free energy was based on a bad model, essentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.977,
    "end": 639.453,
    "text": "And so and so, you know, in that case, you would expect that there'd be a negative affective response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.675,
    "end": 645.705,
    "text": "And so that would act for act as evidence for this higher level model that would say, OK, I'm in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.685,
    "end": 647.728,
    "text": " That's evidence for a negative affective state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.288,
    "end": 651.673,
    "text": "But what that what that beta term ends up doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 651.933,
    "end": 652.174,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.194,
    "end": 673.802,
    "text": "So when you negative affective state corresponds to that beta value getting bigger, which ends up being what it what it does is a little bit is a little bit nuanced as well, though, because if you don't assume that there's any kind of initial habit like prior beliefs over policies, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.782,
    "end": 677.312,
    "text": " Effectively, all that beta does is just add noise to choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.748,
    "end": 693.851,
    "text": " Um, you could think about it kind of like a random exploration term in, um, like in, like in reinforcement learning, but it's just kind of saying like, trust you're expected for energy less, therefore, therefore select actions a little bit more randomly from your posterior distribution over policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.333,
    "end": 701.923,
    "text": "Um, but if you instead happen to have precise, uh, habits, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.943,
    "end": 706.81,
    "text": "So you've just the last 50 times, you know, you were in this situation, you chose option two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.245,
    "end": 736.797,
    "text": " and um and it's kind of assumed implicitly that that must have worked out well right if you kept doing it over and over again then then if beta gets big that it ends up essentially favoring the influence of habits over um what the expected free energy would say um so in that case it kind of implies that uh when you're in a negative affective state you'll become more kind of habit driven um and so that's that's a little bit the way that that um the dynamics end up working okay excellent yeah yeah so maybe just myself and the audience i'm going to try and do a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.553,
    "end": 743.808,
    "text": " sort of paraphrasing slash just trying to align what's going up and what's going up and what's going down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 744.389,
    "end": 744.991,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.011,
    "end": 748.98,
    "text": "So I'm familiar with the gamma parameter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 749.23,
    "end": 749.771,
    "text": " Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 749.791,
    "end": 754.116,
    "text": "The gamma parameter being sort of a scale of expected free energy estimates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 754.136,
    "end": 758.641,
    "text": "So it kind of tracks in a way how confident the system is in its action model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.801,
    "end": 760.724,
    "text": "That's the way that I think about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.924,
    "end": 762.586,
    "text": "Beta is just the hyper parameter on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 762.606,
    "end": 763.647,
    "text": "It's just the inverse of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.787,
    "end": 765.149,
    "text": "One over beta is gamma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.169,
    "end": 765.449,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 765.87,
    "end": 766.11,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.19,
    "end": 767.512,
    "text": "So that's really useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.912,
    "end": 771.036,
    "text": "So the way that I thought about it is that if you've got lower values of gamma,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 771.792,
    "end": 776.618,
    "text": " That means the system has lower confidence in sort of its capacity to do expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.678,
    "end": 778.26,
    "text": "And so it's going to lean towards habits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.241,
    "end": 779.662,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.982,
    "end": 783.807,
    "text": "That means that it's high beta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 783.827,
    "end": 784.048,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.35,
    "end": 786.491,
    "text": "Got it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.511,
    "end": 786.671,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 786.711,
    "end": 791.317,
    "text": "So have you seen this new George Dean paper that came out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.557,
    "end": 793.159,
    "text": "The preprint came out, what, last week?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.527,
    "end": 809.41,
    "text": " something like this wonderful paper it's about sort of canalized psychopathological behavior so very much in line with what you're writing about okay and exactly what they say you so you can sort of treat gamma itself as a hidden state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 809.525,
    "end": 815.393,
    "text": " And you can maximize your mental act, you can optimize your mental actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.634,
    "end": 820.341,
    "text": "So as to kind of optimize gamma in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.942,
    "end": 825.528,
    "text": "So it kind of looks like, okay, I'm going to avoid thinking about certain memories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.568,
    "end": 831.677,
    "text": "Or I'm going to avoid thinking about expected, you know, a potential future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.839,
    "end": 833.76,
    "text": "Because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.993,
    "end": 841.808,
    "text": " I know that will lead to reduced gamma, a lower estimate of my capacity to do expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.108,
    "end": 843.05,
    "text": "I may be butchering this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.474,
    "end": 848.801,
    "text": "Yeah, I feel a little limited just because I haven't read the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.201,
    "end": 851.606,
    "text": "So yeah, I might not be able to comment confidently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.626,
    "end": 852.007,
    "text": "Sure, sure, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 852.087,
    "end": 855.934,
    "text": "Well, I just wanted to mention it in any case because it's a nice addition to this picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.285,
    "end": 856.685,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.866,
    "end": 857.046,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.066,
    "end": 878.791,
    "text": "And I mean, for, on our end, yeah, I can, all I can really kind of say is, is that, yeah, for, for us, or at least the way that we've been, we thought about it previously is, is, is that gamma, gamma itself is, is, is not like sort of directly hidden state itself, but it is like an observation that can act as, um, it's a, it's a thing that can be treated as an observation to inform inference over hidden states at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 879.932,
    "end": 880.032,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.248,
    "end": 886.635,
    "text": " So you have this kind of higher level that has a posterior of, okay, I'm in a positive affective state or I'm in a negative affective state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.056,
    "end": 897.587,
    "text": "And the current and the change in gamma after a new observation is one piece of evidence for changing the positive or negative affective state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.388,
    "end": 903.654,
    "text": "Two things that I think are kind of important there, if we're talking about it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.674,
    "end": 904.735,
    "text": "Again, that's just my idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.795,
    "end": 907.318,
    "text": "But if we're talking about it that way, one is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.298,
    "end": 931.855,
    "text": " crucially that kind of implies that it's not the only thing that can act as evidence for for the emotional state here yeah right so you could have lots of other things besides just this kind of positive or negative prediction error thing that influences right like i mean i would think that things about your interoceptive state right like are probably important for that um among among other things right so so i just i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.835,
    "end": 938.227,
    "text": " I wouldn't I just personally wouldn't want to commit myself to saying that like it's gamma and only gamma is directly right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.247,
    "end": 938.989,
    "text": "That's this thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.75,
    "end": 953.136,
    "text": "Because the because in that formalism, what ends up happening is just whatever your current belief is at the higher level about your affective state ends up putting a prior back on what gamma is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.797,
    "end": 954.619,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.852,
    "end": 963.402,
    "text": " So when I'm in a negative affective state going forward on the next trial or the next time I have to make a choice, that thing is pushing gamma down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.103,
    "end": 965.084,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.645,
    "end": 976.578,
    "text": "Now, something that I do probably want to highlight, though, is that I doubt that that's the complete story for at least a couple of reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.738,
    "end": 979.982,
    "text": "One big one is that empirically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.131,
    "end": 992.52,
    "text": " Negative affective states, while they are consistent with what would be kind of suggested here, negative affective states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.821,
    "end": 996.368,
    "text": " track something like lack of confidence in a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.931,
    "end": 1011.015,
    "text": "That being said, typically what that tends to look like in a lot of other sorts of modeling frameworks and some empirical results is that the main effect that that has isn't really to make decision making noisier, but actually to like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.569,
    "end": 1013.952,
    "text": " turn up information seeking and to turn up learning rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.553,
    "end": 1019.701,
    "text": "It makes sense that if I don't think my model is very good, then I have to kind of turn up my learning rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.741,
    "end": 1026.631,
    "text": "So I update my beliefs faster from the next sequence of events that I experience because I shouldn't be trusting my model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.751,
    "end": 1029.776,
    "text": "So it's kind of like, okay, I got to hurry up and change my model to make it accurate again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.816,
    "end": 1034.843,
    "text": "And kind of influence of learning rate doesn't directly fall from anything about Gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.177,
    "end": 1036.619,
    "text": " Yeah, yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.639,
    "end": 1040.903,
    "text": "So that's more, I've been thinking about it a little bit as well in terms of canalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1041.244,
    "end": 1044.648,
    "text": "That's more kind of this negotiation between the B matrix and the A matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.93,
    "end": 1047.711,
    "text": "Potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1048.392,
    "end": 1049.633,
    "text": "That might be one part of it, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.653,
    "end": 1060.105,
    "text": "If I've got particularly imprecise B matrices, let's say, because I have some dopaminergic synaptic misfiring, and so I have hyper precision over A,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1061.165,
    "end": 1065.292,
    "text": " then I'm gonna mistrust these state transitions more than the norm, let's say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.332,
    "end": 1082.802,
    "text": "Yeah, I guess the thing that probably matters here is that depending on the context that you're trying to model, there's very different things that you might need to be, there's very different parts of your model that you might either want to be or not wanting to be updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.782,
    "end": 1108.823,
    "text": " right so so so if so maybe right what i'm not confident in is something about my beliefs about state transitions in that case i want to be effectively or directly updating my learning rate about the transition probability right i should really pay attention to the coincidences between state and next state over and over again to kind of like re-optimize that whereas if if the thing that i'm um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.292,
    "end": 1122.415,
    "text": " not confident about is something more about my likelihood function, right, more about the mapping between states observations, then I ought to be changing the kind of rate at which I change my beliefs about that likelihood function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.337,
    "end": 1126.904,
    "text": "Now, you know, how you do that itself is tricky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.964,
    "end": 1131.672,
    "text": "Like I said, I think I think more kind of extended formalism would need to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.09,
    "end": 1136.428,
    "text": " put together if we were going to try to turn gamma into something that also affected that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.814,
    "end": 1142.674,
    "text": "But it also, I don't know, one kind of tricky thing, I guess, is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.076,
    "end": 1166.08,
    "text": " In a lot of the kind of practical modeling applications right now, the way that learning rate is adjusted is just via a kind of fixed parameter that's essentially just a scaler on the updates to the counts and the counts that are added to the Dirichlet distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.06,
    "end": 1172.772,
    "text": " for A or B or whatever one you happen to be modeling learning at a given time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.234,
    "end": 1189.401,
    "text": "But it's similar to including these sorts of constants the way you do in a standard kind of reinforcement learning model, but it's not quite the same as the way you might",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.381,
    "end": 1214.19,
    "text": " do it if you were being kind of like trying to be fully true to Bayesian learning, because because in if you were kind of going through Bayesian learning completely and you didn't want to have a kind of like ad hoc constant, you know, that just kind of scales the updates, then it ought to be something that follows from the relative precisions of the your prior and your and the signal coming from the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.471,
    "end": 1215.652,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.053,
    "end": 1217.194,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.579,
    "end": 1236.955,
    "text": " You can do that, and if you assume a kind of constant sensory input and a constant likelihood, then you would learn more from that signal, given that you had flatter versus sharper priors over states, which would follow from your transition beliefs and therefore your B matrix, quote unquote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.935,
    "end": 1248.069,
    "text": " And that actually kind of when we've tried to do that in the past, it works, but it's hard to make it work without making a model hierarchical or at least kind of making it kind of implicitly hierarchical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.83,
    "end": 1249.131,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.351,
    "end": 1261.947,
    "text": "It's a little tricky, but it formally the reason for that is, is that you in the current schemes, observations are kind of treated as things that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.872,
    "end": 1268.439,
    "text": " kind of fully like one hot vector, like it's a, you know, a one and a bunch of zeros, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.459,
    "end": 1271.342,
    "text": "There's no uncertainty about the observation where the uncertainty comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1271.402,
    "end": 1283.837,
    "text": "It's just what state you should believe you're in given that observation, but to, to get the kind of learning that I'm talking about, you need to actually have the, the, the observer to do it right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.877,
    "end": 1288.322,
    "text": "In some ways you have to actually have the observation vector itself, have some noise in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.792,
    "end": 1290.594,
    "text": " Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1290.614,
    "end": 1292.437,
    "text": "Because it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.737,
    "end": 1293.058,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.158,
    "end": 1301.909,
    "text": "And so that happens naturally in a hierarchical model because the first level states do have noise in them and they act as observations for the second level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.929,
    "end": 1302.61,
    "text": "Oh, I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1303.631,
    "end": 1315.707,
    "text": "But also for practical applications, you can just kind of pretend your model is effectively hierarchical by just having it be single level, but make the observations noisy as opposed to being one-hot vectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.767,
    "end": 1317.229,
    "text": "And it does the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.99,
    "end": 1318.09,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.475,
    "end": 1324.965,
    "text": " Well, I was thinking of the other way that to control these learning rates, you would need something like a metacognitive aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1326.066,
    "end": 1328.95,
    "text": "Yeah, you could do something like that, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.131,
    "end": 1337.243,
    "text": "You could have like a higher level, like a second level state that sort of conditional on that, whatever that is, it modulates the learning rate at the level below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.824,
    "end": 1346.717,
    "text": "Let me go back to this, this George Dean paper, just because again, I'm, I'm quite concerned for some reason on well, not for some reason, it's for good intellectual honesty that I don't misspeak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1346.757,
    "end": 1348.279,
    "text": "And I don't, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.765,
    "end": 1352.669,
    "text": " So I'm sort of curious again about what you think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1352.729,
    "end": 1354.351,
    "text": "So I've just got it up here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.411,
    "end": 1357.294,
    "text": "They say, um, duh, duh, duh, duh, duh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.015,
    "end": 1358.215,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1358.275,
    "end": 1375.633,
    "text": "So ineffective inference, the system not only possesses an estimate of action model confidence described as implicitly metacognitive, but another layer of the generative model can be added so that the confidence estimate itself becomes a hidden state that the system infers using the same mechanics of perceptual inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.592,
    "end": 1378.879,
    "text": " So that's kind of similar to, in a sense, what I was saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.939,
    "end": 1382.79,
    "text": "The Gamma itself is becoming the hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1382.81,
    "end": 1390.652,
    "text": "But I think the point that they're making there is that you're not just doing perceptual updating, you're also doing planning as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.7,
    "end": 1405.346,
    "text": " So you can do in terms of mental action, attentional schemes, you can deploy certain mental actions, such that the observations you make are going to be either, you know, increasing the likelihood of being in that hidden state or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.108,
    "end": 1414.783,
    "text": "And that's what you know, that's where whether that's thinking about something that's bad, that's gonna happen in the future, or something bad that happened in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.219,
    "end": 1420.797,
    "text": " you're more likely to avoid thinking those things because you're aware that probabilistically you might end up in low gamma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.639,
    "end": 1423.124,
    "text": "Yeah, that's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.445,
    "end": 1425.612,
    "text": "I guess there's a few different things here where I'm just, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.632,
    "end": 1428.942,
    "text": "I mean, my initial go-to when we start talking about all of this is kind of like how I would like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.141,
    "end": 1458.439,
    "text": " know write it down you know yeah yeah yeah it kind of you know work formally and so there's kind of like a few different things that kind of mix together in there um so i mean like one one thing i could totally see which i thought was what you were talking about a second ago was was like um instead of the gamma based kind of hierarchical updating thing that we were talking about before like that kind of second level state part of its likelihood back down to the first level could also be something about like the the learning rate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.419,
    "end": 1486.435,
    "text": " hmm right so it could directly through this kind of additional connection in the second level likelihood you know when i'm in a negative affective state turn up the turn off the learning rate at the lower level um which isn't so like so much intentional or kind of like controlled right it's just something that kind of like happens automatically as a function of whatever you infer your affective state is um that's just a little different i suppose from a few built-in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.685,
    "end": 1514.481,
    "text": " a policy itself that controlled something like the like transitions to like attentional states yes so we've done that in some more like emotion inference models right where you can kind of you could kind of selectively choose okay now i'm going to pay attention to my current valence all right now i'm going to pay attention to my arousal level um where you can kind of use a second hidden state factor to kind of like pull out slices of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1514.461,
    "end": 1521.916,
    "text": " likelihood tensor that encode the precision of the observations with respect to the mapping to a different hidden state factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.139,
    "end": 1525.604,
    "text": "But but so there's there's that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.684,
    "end": 1527.507,
    "text": "You don't actually need explicit hierarchy for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.547,
    "end": 1530.293,
    "text": "You just kind of need separate orthogonal state factors like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.863,
    "end": 1535.53,
    "text": " in practice, but yeah, so you could do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.67,
    "end": 1556.061,
    "text": "And then the third thing I guess it makes me think of is something that I played around with a little bit that I think is actually a really cool idea but haven't done anything really with is that you can try to account for what can still be a kind of Bayesian form of motivated cognition that would look kind of biased on the outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.648,
    "end": 1568.063,
    "text": " you know, because if in a second level model, you're, you're treating the first level states as observations for the second level, then that means like, you can have a prior preference distribution over Yes, first level states, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.483,
    "end": 1575.332,
    "text": "So then effectively, like, you actually just like want to believe some things and not others, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.393,
    "end": 1585.486,
    "text": "You want to believe some things and not others, then like the optimal policy will could be something that looks super anti Bayesian from a fully like epistemic perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.387,
    "end": 1586.487,
    "text": "Sure."
  },
  {
    "start": 1586.973,
    "end": 1589.963,
    "text": " but probably Bayes optimal under the actual scheme that you've got in place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.364,
    "end": 1591.287,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.327,
    "end": 1592.05,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.07,
    "end": 1593.434,
    "text": "But externally, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.455,
    "end": 1593.635,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.655,
    "end": 1595.26,
    "text": "I mean, this is exactly the point they're coming to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1595.341,
    "end": 1600.257,
    "text": "They speak of sort of avoidant mental action or motivated inattention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.557,
    "end": 1601.318,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1601.599,
    "end": 1605.965,
    "text": "And this idea is that you're kind of performing the second order inference over the model precision, as I said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1606.005,
    "end": 1616.28,
    "text": "But you have this kind of predictive model with model precision as the hidden state such that, I mean, the way they talk about it, how will I feel if I do that, but with respect to mental action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1616.841,
    "end": 1617.061,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.422,
    "end": 1621.688,
    "text": "Which I think is very, I don't know, I just thought it was very cool and very much up your...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.988,
    "end": 1639.879,
    "text": " yeah absolutely i mean yeah when it comes to the affective stuff i totally agree like i said i'm super interested in this i mean it uh i mean in part it makes me like like i both think it's really cool and it also makes me slightly like empirically uncomfortable and the reason for that is like i'm pretty sure it makes like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.534,
    "end": 1646.042,
    "text": " like actually testing, like whether a model like this is kind of like the the best model of human behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.242,
    "end": 1648.185,
    "text": "Basically, I think it makes it kind of unfalsifiable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.786,
    "end": 1650.268,
    "text": "Right, right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.288,
    "end": 1653.093,
    "text": "Well, account for basically anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1653.854,
    "end": 1654.855,
    "text": "But let's jump into that, then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.935,
    "end": 1661.565,
    "text": "I mean, you when we actually spoke on email, you were keen to sort of mention that you're not just doing pure simulation work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.807,
    "end": 1665.851,
    "text": "And you're doing imperial what you call him?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.871,
    "end": 1669.056,
    "text": "Well, I think what is called empirical computational psychiatry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1669.272,
    "end": 1677.783,
    "text": " whereby you fit models to behavioral data in clinical populations, which is super cool, but I'm not a mathematician.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.464,
    "end": 1681.869,
    "text": "So and I assume a lot of the audience aren't mathematicians either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.249,
    "end": 1692.343,
    "text": "So perhaps you could just in sort of a broad brush approach, describe the distinction between pure simulation work and empirical computational psychiatry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.285,
    "end": 1712.492,
    "text": " yeah i mean i guess i think the the cool part about doing simulation stuff is is that you're like pretty under constrained right like there's a there's a kind of like creativity about it and you can kind of get really complicated and you know it allows you to kind of simulate some cool mechanisms um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.472,
    "end": 1719.102,
    "text": " But a lot of times, like the concern, I suppose, is that they become a lot of like just so stories in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1719.182,
    "end": 1719.463,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1719.904,
    "end": 1733.144,
    "text": "Because, you know, I could come up with probably like ten different generative models that would, you know, that would hypothesize somewhat different mechanisms, but they would produce all the kind of like behavioral signatures of the sort of thing we're trying to explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.424,
    "end": 1733.805,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.785,
    "end": 1755.962,
    "text": " right so so i think it's important to be able to find ways to actually you know test you know which of these models are actually good you know like accurate descriptions of what's actually going on in the brain um and um and so you know for that right you need to get these models to have direct contact with data somehow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1755.942,
    "end": 1772.432,
    "text": " Um, and, um, and so usually, you know, so the sort of thing that, you know, we will do and why should say, and another thing is, is that, um, you know, like how good a model fits data, um, is always a relative comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.003,
    "end": 1773.323,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.403,
    "end": 1780.472,
    "text": "I mean, you can't, there are absolute metrics of model fit, but usually you want to kind of say, okay, here's a space of possible generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.273,
    "end": 1790.985,
    "text": "Um, you know, that, that hypothesize different sorts of algorithms that are being used or, or, or different just model structures, but that assume, you know, underlying the same underlying algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.606,
    "end": 1795.31,
    "text": "Um, and then you kind of want to, and you want to do like Bayesian model comparison, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.33,
    "end": 1800.657,
    "text": "You just want to say out of all these models, which model does the data provide the most evidence for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.598,
    "end": 1801.778,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.213,
    "end": 1820.503,
    "text": " And, you know, like that actually allows you to be able to test whether or not like an active inference model or what an active inference model would, a given active inference model would predict, you know, actually reproduces the behavior that people actually do, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1821.083,
    "end": 1828.255,
    "text": "And so I just don't, yeah, I mean, to be scientific about it, I just wouldn't want, or I think it's important that for people to take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.538,
    "end": 1832.423,
    "text": " for people outside of just the kind of like active inference community proper, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.443,
    "end": 1846.259,
    "text": "To actually kind of take these things seriously and think that they're moving science forward that, you know, we need to be able to actually show that these things are improving, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.299,
    "end": 1856.892,
    "text": "How well we can predict what brain and behavior actually look like compared to lots of other simpler models that have been around for, you know, much longer than active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.872,
    "end": 1857.253,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.273,
    "end": 1870.391,
    "text": "So so I mean, you know, computational psychiatry is a fairly it's fairly new field, but you know, there's a lot of there's more and more people working in it, but most of them are not coming from like an active inference background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.632,
    "end": 1876.5,
    "text": "You know, they more tend to focus on simpler reinforcement learning models that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.48,
    "end": 1882.931,
    "text": " you know, at the end of the day, don't tend to be really too different in what they predict from from active inference in a lot of cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.933,
    "end": 1899.079,
    "text": "So, you know, the trick is kind of, you know, finding the right kinds of decision making or behavioral or perceptual tasks to have people to have, you know, participants come in and do whether they be healthy or whether they be patient groups to try to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.059,
    "end": 1923.413,
    "text": " know to see in other words you have to find tasks where it's clear that a particular active inference model would actually make different predictions than a simpler um reinforcement learning model and um you know we've started to do quite a bit more of that i am you know there's a you know for anyone for anyone who wants to come little plug uh the um one of my uh current grad students um is uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.393,
    "end": 1933.328,
    "text": " presenting, well, she's just about to submit for a talk or a poster for the Computational Psychiatry Conference this summer in Minneapolis in July.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.09,
    "end": 1946.589,
    "text": "And it's, and this has been kind of our most thorough attempt at this lately is we just have a fairly simple like explore exploit, sort of like three armed bandit task that involves trade offs between information seeking and reward seeking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.609,
    "end": 1947.19,
    "text": "And so it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.17,
    "end": 1972.401,
    "text": " does kind of match right where where active inference is supposed to kind of show show its strengths with the directed exploration um in this case primarily with respect to the uh novelty term right so this would be like parameter exploration not state exploration um but um but so more or less we identified i think like this is like table essentially of um something like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.668,
    "end": 1979.425,
    "text": " 30 different possible RL models and 30 different equivalent complexity active inference models, something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1979.445,
    "end": 1980.568,
    "text": "It's a really massive model space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.51,
    "end": 1988.888,
    "text": "And fit all these models to behavioral data and a couple hundred people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.868,
    "end": 2008.007,
    "text": " and both a both a taiwanese sample actually and an american sample um and um and just done model comparison across these um and um and the the models that tend to win are more complicated models um there's a the the two the two kind of best models in what we found so far one is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.987,
    "end": 2019.384,
    "text": " One is an active inference model that assumes that people have one forgetting rate and two separate learning rates for wins and losses separately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.404,
    "end": 2023.51,
    "text": "So basically update your beliefs more or less when you get a win versus when you get a loss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.011,
    "end": 2036.61,
    "text": "And then a kind of like dynamic decision noise sort of term that is based on the beta thing, actually based on the updates of the beta gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.793,
    "end": 2047.686,
    "text": " term that we were talking about, where effectively what that ends up meaning is that when people get an outcome that's unexpected, right, then gamma goes down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.746,
    "end": 2050.65,
    "text": "And so the posterior verpolysis flattens out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.73,
    "end": 2058.96,
    "text": "And so essentially their choices become more exploratory in the randomness sense when they get outcomes that they weren't expecting if they were negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.44,
    "end": 2066.749,
    "text": "If they get outcomes that are better than expected and it's positive, then they become sort of more deterministic and going with what the model would say is the best choice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.168,
    "end": 2069.811,
    "text": " And so that's the best active inference model that tends to fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.831,
    "end": 2070.712,
    "text": "So it's very complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.732,
    "end": 2072.634,
    "text": "It has like five or six parameters, something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.655,
    "end": 2076.098,
    "text": "And the winning RL model is slightly different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.278,
    "end": 2081.184,
    "text": "It assumes dynamic learning as opposed to dynamic forgetting, or I mean, as opposed to dynamic decision noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.785,
    "end": 2095.96,
    "text": "But the point is that the main difference between these models ends up not really so much being differences in exploratory behavior so much as whether or not they include Bayesian forms of learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.176,
    "end": 2125.002,
    "text": " the main thing that the main thing that active inference does that's really different when you match it to kind of an equivalent complexity rl model is um is that active inference models are kind of with the with the dirichlet distributions again the details of that don't matter for non-mathematical people it just basically means that in an rl model you're just kind of updating your beliefs about the expected reward probabilities whereas an active inference you're keeping track of those reward probabilities but also you're keeping track of your confidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.982,
    "end": 2149.909,
    "text": " in the beliefs about the reward probabilities um and um and so that's what and the the kind of take home with it for for what for what she's done is um mainly that the um the ability for the two models to um predict behavior is actually at the best two models um it's actually fairly similar but Bayesian model comparison does um select the active inference model over the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.142,
    "end": 2151.705,
    "text": " over the RL model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.027,
    "end": 2168.893,
    "text": "And because the differences in accuracy between the models aren't amazingly different, ends up relating probably a little bit more to like complexity cost differences and kind of evaluation of the independent, like how independent each parameter is in explaining the behavior, things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.278,
    "end": 2177.381,
    "text": " So anyway, I mean, so a lot of what we've been doing is kind of attempting to say, okay, well, you know, how much better, you know, does active inference actually do, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.461,
    "end": 2179.567,
    "text": "And explaining behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.587,
    "end": 2184.3,
    "text": "Is it the kind of most parsimonious, accurate explanation for behavior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.28,
    "end": 2203.673,
    "text": " um how people actually do make decisions in information seeking contexts um so that's a little bit you know where you know kind of the approach that we take so that and then using those things um by also having people in patient groups with like depression or anxiety or substance use disorders um do these same sorts of tasks and then see whether um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.906,
    "end": 2213.877,
    "text": " you know, we can explain clinically relevant differences in these, you know, between patients and healthy comparisons through differences in the actual parameter estimates, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.917,
    "end": 2227.753,
    "text": "So maybe it's the case that, so one thing that we have found, right, is that pretty consistently substance users in active inference models tends to show much slower learning rates from negative outcomes than positive outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.733,
    "end": 2252.627,
    "text": " they kind of it takes a lot more times of them choosing a supplemental thing before they kind of change what they do um i found that i found that an interesting result uh your 2023 paper elevated decision uncertainty and reduced avoidance drives in depression anxiety and substance use disorders i may be that's a different one but yeah this might be slightly different but i found maybe maybe i misinterpreted what you said there but this idea that um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2253.147,
    "end": 2258.01,
    "text": " individuals at least with substance use disorders show a reduced sensitivity to unpleasant stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2258.767,
    "end": 2259.188,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.208,
    "end": 2259.448,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.508,
    "end": 2263.974,
    "text": "So, so it's, yeah, so there's a, yeah, so that's a, that's a, with a different task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.134,
    "end": 2266.758,
    "text": "Um, it's actually the same, the same sample, but it's a different task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.038,
    "end": 2268.901,
    "text": "I guess the prior one is learning rates, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.921,
    "end": 2270.043,
    "text": "The first one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.063,
    "end": 2270.483,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.643,
    "end": 2272.045,
    "text": "So it's kind of depends, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.085,
    "end": 2274.689,
    "text": "The learning rate one, again, that's with like a bandit task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.789,
    "end": 2283.301,
    "text": "And so it's, it is about kind of explore, exploit, updating beliefs about reward probabilities, et cetera, where it's the approach avoidance conflict task is a little different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.361,
    "end": 2284.342,
    "text": "It's not a learning task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.442,
    "end": 2287.086,
    "text": "It's purely just kind of a planning forward looking task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.066,
    "end": 2303.758,
    "text": " And in that one, it's more or less, there's a different kind of number of, you know, points that, you know, people can win, but they have to also choose to go through some pretty unpleasant affect of seeing some pretty, seeing and hearing some pretty unpleasant affect of stimuli at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2304.093,
    "end": 2331.147,
    "text": " gonna have to plan whether okay do i prefer to kind of move toward the side of this runway that means the probability is higher i'll kind of get this safe neutral outcome but no points or whether i'll whether i expect it to be kind of worth it to me right to like under a certain point value try to act in a way that will increase the probability that i'll get the points but also see the super unpleasant stuff right and and in that case there's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.127,
    "end": 2336.753,
    "text": " I mean, this is sort of task that's been used in non-computational modeling ways several times in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.853,
    "end": 2345.582,
    "text": "But the main kind of metric, if you don't do it the computational way, is more or less just this general kind of unidimensional approach avoidance thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.082,
    "end": 2353.83,
    "text": "Whereas the modeling version is a little bit more helpful because we can estimate the beta parameter for these people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.95,
    "end": 2360.357,
    "text": "And then we can also estimate certain things about the shape of their preference distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.725,
    "end": 2363.33,
    "text": " and what that shows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.35,
    "end": 2367.998,
    "text": "So we can kind of use that to dissociate two different aspects of approach avoidance conflict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.599,
    "end": 2375.671,
    "text": "One is this kind of like uncertainty about decisions and the other is this actual kind of approach avoidance drive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.054,
    "end": 2385.889,
    "text": "And yeah, the results for that are actually kind of surprising, because like in the depression and anxiety and in the substance users, they tend to show",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.869,
    "end": 2406.544,
    "text": " um greater just the patients tend to show greater decision uncertainty so they have higher beta values but they um they actually show um more precise preferences for the for the points which basically means that they're means that they're kind of more willing to go through the negative affect stuff i was very surprised by that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.524,
    "end": 2435.383,
    "text": " yeah so they're actually less avoidant right so they're more uncertain but they're less avoidant and that's we've now shown that in four studies you know so it's a very consistent result across multiple samples i read that and i had to read it twice uh because i was really like i really expected the other way around because we're used to hearing that avoidance is the kind of number one driver of a psychological disorder like generalized anxiety disorder so what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.494,
    "end": 2437.836,
    "text": " What do you imagine is going on here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.016,
    "end": 2443.644,
    "text": "I mean, I think one, just talking in terms of very layman non computational terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2444.285,
    "end": 2445.907,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2445.927,
    "end": 2452.656,
    "text": "There's, there's the overexposure of people with psychological disorders to negative stimuli in the first place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.698,
    "end": 2459.706,
    "text": "So what's negative for a healthy control is what's all relative, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.726,
    "end": 2464.172,
    "text": "And if you've been exposed to overtly negative things, like your own emotions over and over again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2464.878,
    "end": 2466.92,
    "text": " maybe you have a reduced sensitivity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.962,
    "end": 2468.402,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.422,
    "end": 2475.831,
    "text": "I mean, there's, you know, I mean, we don't, we don't really have like, unfortunately, I mean, our, our hypothesis going in was absolutely what you said originally, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.871,
    "end": 2477.953,
    "text": "That we would get more avoidance than the patient groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.574,
    "end": 2485.322,
    "text": "Um, but, uh, you know, we were just hoping that the, the modeling would help us kind of distinguish these couple different kind of dimensions, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.362,
    "end": 2487.204,
    "text": "Of, of, of approach avoidance conflict.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.805,
    "end": 2493.612,
    "text": "Um, but, uh, but definitely we didn't expect the, the more approachy stuff in, uh, in the, in the patient groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.273,
    "end": 2494.513,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.831,
    "end": 2510.106,
    "text": " That being said, yeah, so because of that, we don't have kind of a bunch of other, we don't have all the measures that we probably would have gotten to try to dissociate different possible explanations for that kind of unexpected avoidance or unexpected lack of avoidance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.086,
    "end": 2540.093,
    "text": " um so it becomes a little speculative but um one thing is absolutely i mean that's one thing you might you might suspect is what you said that um you know if if people uh if people just in general are in this kind of heightened negative affective state then you know you might expect that makes them more sensitive to other negative affective things but you also might make that also might think they're a little bit habituated to it yes exactly what would that look like in terms of a kind of palm dp scheme because i guess we associate habits",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.073,
    "end": 2555.449,
    "text": " with action with the prior value or prior beliefs over action when we're talking about habituated uh responses to stimuli I mean I guess it is it's in the sense action but what what shape does that take",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.408,
    "end": 2564.516,
    "text": " Um, yeah, I mean, so, so like I said, in, in the official model that we were fitting, it doesn't really occlude any include, uh, the dynamics of habituation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.576,
    "end": 2570.102,
    "text": "We're just kind of estimating the, what the shape of their preference distribution is right there to explain their behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.803,
    "end": 2582.955,
    "text": "Um, and so it, so then the explanation just ends up being that they have a more precise preference for, for winning the points or, or, uh, or, uh, less the, the, the magnitude of the.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.188,
    "end": 2592.962,
    "text": " the probability of the negative outcomes in the preference distribution, which, again, doesn't really mean probability, it just means they, they disprefer the negative stuff less, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.364,
    "end": 2597.369,
    "text": "Is, is, you know, that ends up explaining it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.769,
    "end": 2604.96,
    "text": "But, but, but what would it look like if you included some sort of actual",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.177,
    "end": 2608.982,
    "text": " learning dynamics for, um, for habituation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.002,
    "end": 2618.034,
    "text": "Um, I mean, so this kind of habituation is, is really not so much more about habitual action as it is just the level of sensitivity you have to stimulate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.054,
    "end": 2618.415,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.655,
    "end": 2625.424,
    "text": "So, so it's a little more as this flavor of, okay, if I see something over and over again, then my response to it each time is less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2625.885,
    "end": 2626.185,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.286,
    "end": 2630.631,
    "text": "So, so, um, I think you could cost that in terms of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.793,
    "end": 2634.036,
    "text": "Um, it, it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2635.298,
    "end": 2636.26,
    "text": " Well, I mean, it's okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.42,
    "end": 2639.445,
    "text": "So I'm thinking in terms of traditional therapeutic responses, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.465,
    "end": 2649.741,
    "text": "Like in terms of exposure and response prevention therapy, for example, you at least have an element of it, which said that a dysfunctional avoidance response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.703,
    "end": 2660.378,
    "text": "Again, this is a non active inference way of framing it, but just in a layman sense, it entrenches the severity or the perception of the severity of the stimulus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.083,
    "end": 2661.644,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2661.664,
    "end": 2676.257,
    "text": "So, I mean, we have, you know, and I, I mean, I wouldn't necessarily have expected you to seen it, but if you happen to, I mean, we do have this paper we published a couple of years ago as a simulation paper specifically on mechanisms of, uh, possible mechanisms of CBT in a POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.277,
    "end": 2676.578,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.811,
    "end": 2679.115,
    "text": " We actually did simulate exposure therapy in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.66,
    "end": 2695.427,
    "text": "But it was the crucial kind of thing we were looking for there was whether or not we could kind of capture, make predictions about the ways that cognitive interventions like reappraisal would interact with behavioral interventions like exposure therapy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.407,
    "end": 2719.575,
    "text": " Um, and, um, and I mean, some of, some of, some of that, we ended up being kind of, kind of excited about it seemed consistent with results or with, you know, when I talk to clinicians, cause I work with a lot of clinicians, um, you know what they say, but where, where with that, I mean, the, the kind of, you know, habituation was much more about like, so if a person has a strong",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.876,
    "end": 2728.112,
    "text": " If a person has a strong expectation that like if they choose a certain action, then the things they are going to observe are things that they really don't like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.753,
    "end": 2729.014,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.194,
    "end": 2735.767,
    "text": "So things that have a very low preference level, then, you know, it follows all being equal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.787,
    "end": 2738.172,
    "text": "They're not going to they're going to take actions that don't lead them to those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.455,
    "end": 2765.762,
    "text": " make those observations right but the problem is is that when those when those um when those uh uh beliefs about the expected outcomes of actions are are wrong right then if they just avoid it every time right then they can never update their beliefs right so i mean exposure is essentially kind of this kind of like uh clinician facilitated directed exploration right right you know they kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.181,
    "end": 2773.051,
    "text": " push you to go take this action that's going to make you see, okay, what actually happens when I'm in this state that I've been avoiding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.091,
    "end": 2783.447,
    "text": "And so the kind of habituation in that just ends up being once they start actually seeing what observations they really get when they're avoiding, then they just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.714,
    "end": 2785.576,
    "text": " You know, it just updates their likelihood function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.837,
    "end": 2785.997,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.117,
    "end": 2786.357,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.377,
    "end": 2786.558,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.578,
    "end": 2786.898,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.918,
    "end": 2787.158,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.278,
    "end": 2788.16,
    "text": "Back under that state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.321,
    "end": 2798.533,
    "text": "But but the interesting thing, at least in that paper, was a lot more of how that interacts with your cognitive beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2799.314,
    "end": 2806.903,
    "text": "So because because you can also and this is often what happens, right, is this is that when when people go through exposure therapy,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.883,
    "end": 2824.757,
    "text": " um they will they can um even after those response the negative responses kind of go away and they start to say okay now now i believe like in the context of spider phobia for example like no okay actually you know i believe the spider is safe now right and so their responses their affective responses like died down but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.176,
    "end": 2846.391,
    "text": " know you bring them back in a couple days later they see the spider and they have the negative responses again sure right so it doesn't kind of like stick around it doesn't generalize um you know so why is that right because under a simple under a simple kind of like unlearning story um they would have just overwritten their old likelihood function right so they shouldn't right their generative models just be different they shouldn't have those responses again",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.371,
    "end": 2848.233,
    "text": " Um, you know, so what explains that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.534,
    "end": 2855.522,
    "text": "Well, what explains that has to be that they, um, that they don't take evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.303,
    "end": 2863.292,
    "text": "They don't take the evidence from the unexpected outcomes when they see a spider, um, as evidence that their likelihood function was wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.753,
    "end": 2870.04,
    "text": "They take it instead as evidence that they've actually transitioned into a new hidden, hidden state context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.562,
    "end": 2875.467,
    "text": "So that now, so now they believe, okay, I am in the safe context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.733,
    "end": 2878.838,
    "text": " and then they just update their likelihood under the safe context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.858,
    "end": 2879.78,
    "text": "Ah, that's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2879.98,
    "end": 2880.1,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.34,
    "end": 2891.859,
    "text": "So then all you have to do is say, okay, well, if there's any uncertainty in the transition function, then even though they believe they're in the safe context now, come back in a couple of days later, there's more uncertainty over what context they're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.36,
    "end": 2900.353,
    "text": "So their responses come back because the likelihood function under the danger context still says, right, bad things will happen if spider.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.274,
    "end": 2902.416,
    "text": "So how would you resolve that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.97,
    "end": 2923.66,
    "text": " Yeah, so one thing you want to do then is you want to try your best as a therapist in some way to not use cognitive approaches to try to make people believe, oh, actually, this is really safe, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.68,
    "end": 2924.02,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.301,
    "end": 2928.507,
    "text": "You're going to go in this room, you're going to see this spider, but it is safe, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.587,
    "end": 2928.707,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.687,
    "end": 2950.881,
    "text": " like you have to have them actually maintain some kind of uncertainty about what context they're in right because only in that case if there's like like in the simulations more or less like we showed is like if you keep the posterior distribution that they have about the context there and if you kind of keep that imprecise right if you maintain the kind of cognitive uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.384,
    "end": 2972.042,
    "text": " and when they get the unexpected observations that bad things don't happen then it does overwrite the likelihood under both states right um under both of both in context and then it does generalize right um and that's um that's actually uh consistent with this kind of cool study that um sam gershman um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.022,
    "end": 2975.868,
    "text": " has written some stuff about back in 2015-ish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.948,
    "end": 2990.051,
    "text": "It's been a little while, but where you can do more or less the same thing with rats with just classical conditioning experiments where you play a tone, they get shocked over and over again with some probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.071,
    "end": 2990.672,
    "text": "So now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.787,
    "end": 2995.277,
    "text": " You play the tone and they kind of jump or freeze or do something implying that they'll shock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.52,
    "end": 3001.07,
    "text": "And then the standard thing to do during extinction is you just present the tone over and over again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.11,
    "end": 3003.695,
    "text": "You don't show the shock at all or you don't get the shock at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.735,
    "end": 3005.199,
    "text": "And so then the responses slowly die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.421,
    "end": 3010.45,
    "text": "But similar to with exposure therapy, you bring the rats back a day later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.43,
    "end": 3032.286,
    "text": " you play the tone again and they do have this kind of spontaneous recovery is what it's called where they start to have the fear response again um which means they're doing basically the same thing right the rats too are just inferring okay i'm not sure if i'm still in the safe context so so what they showed though is that if you do the extinction um if you do the extinction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.502,
    "end": 3048.013,
    "text": " time course a little differently then you can actually prevent this spontaneous recovery and the way they did it is instead of during extinction just abruptly completely stopping the the association between the tone and the shock",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.993,
    "end": 3053.498,
    "text": " What they did is they just said, okay, for a little while, tone is associated with shock 90% of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.678,
    "end": 3057.081,
    "text": "Okay, now for a while, tone is associated with shock 80% of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.241,
    "end": 3058.583,
    "text": "Okay, now 70% of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.603,
    "end": 3059.283,
    "text": "They taper them off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.744,
    "end": 3064.468,
    "text": "Yeah, and what that does, you can kind of think about it, is the prediction errors are never that big, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.068,
    "end": 3069.332,
    "text": "And if the prediction errors are never that big, then that's not good evidence for the shift in context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.253,
    "end": 3070.493,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.614,
    "end": 3078.0,
    "text": "So it does cause this slow overriding of the original likelihood function as opposed to promoting the state inference thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.98,
    "end": 3083.027,
    "text": " Um, and when they did it that way and then they tested their rats later, they didn't have the spontaneous recovery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.067,
    "end": 3086.712,
    "text": "Like the, the fear responses didn't come back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.732,
    "end": 3087.894,
    "text": "Um, and that is fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.214,
    "end": 3090.697,
    "text": "It's very, it's, it's quite counterintuitive though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.239,
    "end": 3092.44,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.46,
    "end": 3106.519,
    "text": "I think you would be, one would be under the presumption that if you just kept providing evidence, you know, if you kept tying an observation to a different state, that would just become entrenched, but it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.988,
    "end": 3113.417,
    "text": " it does make sense that that itself becomes this kind of crystallized thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3113.597,
    "end": 3117.583,
    "text": "And then once you take them out and put them back in, then the previous one still has that precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.004,
    "end": 3119.165,
    "text": "That's really fascinating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.466,
    "end": 3136.59,
    "text": "You also said something very interesting there, which was, um, it was kind of under the radar, but the difference between having a strong preference to be somewhere or to have something or to be something or whatever versus, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.925,
    "end": 3164.215,
    "text": " had like having a strong dis preference not to be somewhere be something have something so a positive versus a double negative i've often found this in in active inference i don't think it's been particularly well codified what the difference is between those so people say oh um i want to be um 37.8 right in some sub-personal way i want to be 37.8 degrees celsius and so i take action to restore that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.072,
    "end": 3169.457,
    "text": " But you could well cast as I don't want to be 40 degrees Celsius.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.539,
    "end": 3170.819,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.64,
    "end": 3174.443,
    "text": "Is there a technical difference between those?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.905,
    "end": 3190.202,
    "text": "So, I mean, one thing that I guess is kind of unique about the way that active inference encodes preferences compared to, you know, more kind of like traditional formalisms like reinforcement learning that cast things explicitly in terms of reward function is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.503,
    "end": 3195.594,
    "text": " Strictly speaking, an active inference agent isn't really trying to maximize reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3195.654,
    "end": 3198.441,
    "text": "They're trying to minimize divergence from a target distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.383,
    "end": 3205.035,
    "text": "And that actually has certain interesting implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.893,
    "end": 3222.315,
    "text": " One thing to consider with that, though, is that unlike in things like reinforcement learning, all of your preferences kind of constrain each other in the sense that the whole distribution has to add up to one, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.576,
    "end": 3233.149,
    "text": "So I think that you will have to kind of, relatively speaking,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.597,
    "end": 3238.03,
    "text": " basically you will only be able to specify relative preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.692,
    "end": 3241.603,
    "text": "So I think that if you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.87,
    "end": 3252.526,
    "text": " if you have a distribute a preference distribution where the kind of highest mass is over, you know, like 38 ish degrees, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.666,
    "end": 3262.381,
    "text": "Then, then the fact that it kind of tails off on both sides simultaneously guarantees that you disprefer being above or below that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.981,
    "end": 3267.388,
    "text": "Um, so, so I don't know explicitly whether or not there is, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.875,
    "end": 3273.463,
    "text": " whether or not there's any way to encode those in a way that's different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.405,
    "end": 3280.473,
    "text": "There are interesting things you can do by putting kind of like negative preferences for something and positive preferences for another thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.513,
    "end": 3285.801,
    "text": "If there's like an observation you can lock as kind of like a baseline value of like zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.163,
    "end": 3288.465,
    "text": "When the thing gets normalized,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.154,
    "end": 3298.989,
    "text": " to turn it back into an actual probability distribution, then it does still end up being kind of a precise preference for one thing and dispreference for the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.029,
    "end": 3300.892,
    "text": "And they do still end up being relative to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.932,
    "end": 3311.027,
    "text": "And the main thing that we tend to see when we do simulation stuff and those sorts of settings is it just tends to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.007,
    "end": 3314.852,
    "text": " lead to this kind of like anti exploration behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.912,
    "end": 3326.727,
    "text": "When when, you know, one thing's really negative, where it's kind of like, the, the agent is just kind of this, like, you know, better safe than sorry, you know, behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.909,
    "end": 3339.023,
    "text": "But I, but I think there are, there should definitely be ways of encoding those in terms of all just kind of relative, relative positive values that end up normalizing to the same distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.593,
    "end": 3339.894,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.174,
    "end": 3358.446,
    "text": "Yeah, I think part of the reason why I asked that is because I think it's a point that you make in the papers that you've written on interceptive inference, which is that when we speak of sorts of so called aberrant interceptive inference, a lot of papers are not very clear whether they're talking about the underweighting of priors or the overweighting of the likelihood distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.946,
    "end": 3359.307,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.455,
    "end": 3368.673,
    "text": " Um, I think part of the problem is people think of, uh, precision waiting as like a necessary zero sum game such that you can't have both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3369.455,
    "end": 3374.224,
    "text": "So if I have, uh, reduced precision over my likelihood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.373,
    "end": 3392.4,
    "text": " by necessity, that will lead to increased precision over my prior, if I've decreased precision of my prior by necessity, at least to an uptake in the precision of the likelihood, or you show at least in this 2020 paper, the one that I read from PLOS, we did the interoceptive perturbation condition isn't the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3393.783,
    "end": 3394.103,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.302,
    "end": 3397.267,
    "text": " Where do you think that kind of false intuition comes from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3397.307,
    "end": 3415.315,
    "text": "It comes from the fact that people usually in the way that they, at least in these more kind of conceptual papers, comes in part from the fact that these are under, they're talking about models that have Gaussian assumptions with continuous distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.902,
    "end": 3420.708,
    "text": " Um, cause if you have, if you just have on along a single dimension, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.769,
    "end": 3429.28,
    "text": "If you have like a distribution that defines the likelihood function and a distribution that defines the, um, prior belief, then, then there are right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.3,
    "end": 3436.91,
    "text": "When I turn up one or turn down the other, then there's a bunch of different ways that I can kind of combine those things to lead to the same posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.671,
    "end": 3439.273,
    "text": "Um, so it does become hard to distinguish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.014,
    "end": 3444.981,
    "text": "Um, so it depends on the dimensionality and depends on whether you were talking about continuous or categorical distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.467,
    "end": 3450.993,
    "text": " Um, so, so in, in the, in the case of what we're doing, these are discrete distributions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.013,
    "end": 3469.472,
    "text": "So in, in discrete models with the dimensionality, the way that we have it set up, um, it makes, uh, that makes clearly distinct behavioral predictions, but, um, but in the, uh, in the kind of unidimensional Gaussian, um, set up, um, then you, you do get this more, um, only the relative weighting matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.254,
    "end": 3471.354,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.374,
    "end": 3471.834,
    "text": "Yeah, yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3471.974,
    "end": 3472.555,
    "text": "That makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.429,
    "end": 3476.575,
    "text": " Okay, so thus far, I know we haven't got too much time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.595,
    "end": 3487.498,
    "text": "But thus far, I know, we've kind of been speaking generally about perceptual updating and parameter updating, or parameter learning and belief updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.039,
    "end": 3490.223,
    "text": "But we also have structure learning and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.726,
    "end": 3505.241,
    "text": " And I think you make a really nice point to say that sort of something like introducing a concept to distinguish between, um, or, or to yes, to let's say split up a concept that you had before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.301,
    "end": 3509.005,
    "text": "So if I had anger now, maybe I can turn that into rage and fury.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.346,
    "end": 3510.446,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.467,
    "end": 3513.43,
    "text": "Um, I think, I believe you call that emotional granularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.751,
    "end": 3515.211,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.231,
    "end": 3515.772,
    "text": "And, uh, and, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.072,
    "end": 3516.252,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.292,
    "end": 3518.415,
    "text": "And the emotion and the emotional state inference context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.455,
    "end": 3518.635,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3518.655,
    "end": 3523.982,
    "text": "We would talk about that in terms of granularity or, uh, yeah, that's usually the, probably the best way to talk about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3524.883,
    "end": 3524.983,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.003,
    "end": 3539.802,
    "text": "It's a really fascinating concept because it, it, it, I think on, on first glance, it seems like, uh, it seems like a sort of just linear benefit, the more emotional granularity I have the better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.423,
    "end": 3566.886,
    "text": " yeah i mean what that what the direct relationship would be between like the uh the number of you know states in a state space and uh and something to do with gamma i think is is going to be fairly indirect um but for a number of reasons but um i mean i think with most things right i mean the general answer is going to be that um it's not so much about complexity per se as more complexity than necessary yeah right so so um right you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.018,
    "end": 3571.267,
    "text": " you know, complexity, adding complexity is good if it increases accuracy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.65,
    "end": 3579.846,
    "text": "So what it would mean, right, to be more complex than necessary would be that there's a mismatch to the actual generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.298,
    "end": 3601.024,
    "text": " I think that if you're overfitting to the generative process, if you're inventing more categories than there actually are distinctions to make, then obviously that's going to be problematic because you're going to think you have more information than actually you do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3601.342,
    "end": 3621.745,
    "text": " But so long as you're carving up your state space in a more fine-grained way, and that actually does add to the informativeness of the information that your generative model is able to kind of pick up and then use to inform policy selection, then I would expect it would be the more the better, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.765,
    "end": 3628.653,
    "text": "It's just the more... So it's the more accurate information you have, the more informed policy selection will be, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3628.713,
    "end": 3630.235,
    "text": "So as long as...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.215,
    "end": 3659.513,
    "text": " you have you're good at inferring the right you know posterior over what emotional state you're in and each emotional state that you kind of have have acquired into your generative model um if each of those does in fact make unique um um predictions about patterns of current and future observations under that state then that yeah i mean it'll be better just because it'll should right on average just make policy selection more informed right right right but um yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.421,
    "end": 3664.027,
    "text": " Thinking more broadly about the distinction between structure learning and parameter learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3665.128,
    "end": 3675.084,
    "text": "Do you see these as bright dividing lines or do you see them as being kind of philosophically vague as to when parameter learning becomes structure learning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.927,
    "end": 3679.912,
    "text": "Um, you know, like, I guess it's just, it's just tricky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.092,
    "end": 3688.065,
    "text": "I mean, like you get in the weeds with some of this stuff because people use structural learning, the term structural learning to mean several",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.957,
    "end": 3695.668,
    "text": " Structural learning itself is a superordinate category with a bunch of different exemplar things within it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.469,
    "end": 3714.238,
    "text": "I don't know if you saw this one paper on structural learning specifically that we put out a few years ago where it was just a dumb example of people trying to learn coarse-grained or fine-grained different types of birds and fish and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.218,
    "end": 3715.66,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.86,
    "end": 3733.948,
    "text": "And, you know, so that it was like, you could just learn like these broad categories of bird and fish, or you could kind of like, learn to carve it up into specific types of birds, specific types of fish, and they just kind of each of those does it was defined with respect to specific like patterns of covariance among certain sorts of observable features, right, like wings versus gills and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.3,
    "end": 3751.684,
    "text": " size and color and things like that but um you know in that particular case the way that like structure learning was posed was in relation to kind of like inferring how many states need to be in your state space right to account for account for data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3751.85,
    "end": 3760.545,
    "text": " Um, and so, and so, um, that has to do with kind of the setup of the structure of the generative model proper, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.585,
    "end": 3768.88,
    "text": "Like how many, how many types of states, how many states, how many, how many, how many state factors, how many levels of states with any state factor, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.86,
    "end": 3786.345,
    "text": " So in the general POMDP scheme, that is distinguishable from parameter learning in the sense that parameters are usually kind of the values of the entries into the matrices within things like the likelihood function, transition function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.325,
    "end": 3796.88,
    "text": " and et cetera, um, that you update, but you update those under the assumption that like, you know, number of number of columns in the, in each matrix are, are kind of fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3796.9,
    "end": 3797.661,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.681,
    "end": 3797.801,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.821,
    "end": 3810.358,
    "text": "So, so, so if you're talking about kind of this granularity kind of fine graining of, of your, of the concepts that you have, um, then, then there is a clear distinction between, um, between, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3810.473,
    "end": 3813.021,
    "text": " those examples of parameter learning and structural learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.583,
    "end": 3819.302,
    "text": "But like I said, there's other types of structural learning and the actual implementation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.856,
    "end": 3844.108,
    "text": " of how you do structural learning also matters because you know in our example um you know we we use this kind of like little trick right where we just kind of said you know we're we're actually gonna you know stick the matrices in as though there's a bunch of these kind of extra unused columns you know we didn't have to kind of like explicitly add states to the state space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.088,
    "end": 3864.561,
    "text": " we just kind of had a bunch of states that were just kind of like sitting there silently unused and then the way that and then the way that the thing kind of worked was just that you know what they meant to be unused was the distributions were just completely flat right so they didn't predict really anything unique about the observations um and so and so the way that that would work is just that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.452,
    "end": 3877.995,
    "text": " More or less that if you got some pattern of observations that was consistent with one of the kind of informative likelihood functions under a kind of state that you already had, then the posterior will be precise over that state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.215,
    "end": 3882.783,
    "text": "And, you know, you would have a basically zero posterior over all the unused columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.843,
    "end": 3886.009,
    "text": "And so you wouldn't have any parameter updating under those columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.495,
    "end": 3901.095,
    "text": " But if you had some pattern of observations and they were really inconsistent with any of the informative mappings that you had, then effectively what that would do is it would mean that the flat mappings would better explain the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3901.531,
    "end": 3902.713,
    "text": " Right, right, right, right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3902.733,
    "end": 3913.628,
    "text": "And you know, and as soon as like the flat mapping better explains the data, then you end up with a precise posterior over one of these unused columns, right, whichever one happens to explain it best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.209,
    "end": 3916.832,
    "text": "And then you just start learning the parameters under that new column.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3917.473,
    "end": 3917.714,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.294,
    "end": 3922.32,
    "text": "So so and then you, that's just a way of learning a new informative mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.34,
    "end": 3923.742,
    "text": "So it's kind of like effectively now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.941,
    "end": 3926.885,
    "text": " you have a new column, you've expanded your state space, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.345,
    "end": 3939.38,
    "text": "And you could, you could do that a little bit more explicitly than we did by writing in some additional function that like explicitly, you know, just like added new columns to the state space or something, as opposed to just having these unused ones sitting around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.722,
    "end": 3948.632,
    "text": "But my point is, is that the relationship between structural learning and parameter learning is very, they're very tightly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3949.0,
    "end": 3951.423,
    "text": " intertwined in that case, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3951.463,
    "end": 3960.672,
    "text": "Because when you start learning the parameters, the thing that leads you to start learning parameters is the exact thing that is causing you to do structural learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.313,
    "end": 3962.394,
    "text": "Right, right, right, right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3962.494,
    "end": 3963.475,
    "text": "Yes, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.556,
    "end": 3967.64,
    "text": "But again, that's one implementation, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3967.7,
    "end": 3969.061,
    "text": "So I'm saying that that won't be true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.121,
    "end": 3974.687,
    "text": "That doesn't need to be true generically, but that will be true in some cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.017,
    "end": 3993.317,
    "text": " yeah yeah yeah yeah well it seems like they all to yeah they all lean on one another in some kind of recursive manner where you can't really have structure learning without learning the parameters in you know of that structure in the first place nor the belief updating that allows you to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.905,
    "end": 4008.522,
    "text": " kind of get there in the first place right in a dynamic system in a dynamically changing system yeah i mean i think i think it's just and again i can't i can't really say with confidence how well this will generalize to other cases of structural learning or or even just other kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4009.143,
    "end": 4010.906,
    "text": " generative model setups and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.447,
    "end": 4031.202,
    "text": "But yeah, at least in this case, you have to effectively infer that the current informative parameters and parameter based mappings that you have are not doing a good job of explaining something and then end up with a very low posterior distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4031.182,
    "end": 4051.755,
    "text": " over or a posterior that assigns a very low probability to any of the states you currently have in your state space and then yeah and then so it's like you get the right posterior based on you know the based on the fact that your current parameters are not good expla you know don't provide good explanations for the data and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4052.292,
    "end": 4059.264,
    "text": " by starting to update different set of parameters, you end up leading to doing something that is effectively structural learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4059.284,
    "end": 4063.091,
    "text": "So it's, yeah, they're just very, yeah, it is all just very kind of tightly connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.131,
    "end": 4063.852,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.872,
    "end": 4063.973,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.993,
    "end": 4064.273,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4064.293,
    "end": 4072.748,
    "text": "Well, it'd be interesting to see if you could sort of disambiguate them, you know, in a model, like whether you could just have, I guess there's a,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4072.947,
    "end": 4075.09,
    "text": " Yeah, conceptually, though, I think that's tricky, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.11,
    "end": 4079.977,
    "text": "Because you somehow have to say I need structural learning only because well, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.997,
    "end": 4082.3,
    "text": "Well, that's why I'm kind of by recursive nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.861,
    "end": 4086.546,
    "text": "I don't know if recursion is even the right way of talking about it might be sort of nesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.249,
    "end": 4094.337,
    "text": "In some sense that belief updating drives parameter updating, which like ultimately feeds into structural learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.577,
    "end": 4094.818,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.459,
    "end": 4095.599,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.58,
    "end": 4096.861,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.522,
    "end": 4098.583,
    "text": "So final question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4098.968,
    "end": 4099.669,
    "text": " Big question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.17,
    "end": 4106.318,
    "text": "You've got this paper coming out, the so-called empirical status of predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.338,
    "end": 4107.26,
    "text": "And active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.5,
    "end": 4108.461,
    "text": "And active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4108.882,
    "end": 4109.062,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4109.162,
    "end": 4110.865,
    "text": "Is that the whole name of the paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4112.086,
    "end": 4113.588,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4113.608,
    "end": 4127.608,
    "text": "It's a sort of classic critique leverage that active inference that it's self-contained and it's an echo chamber and it's a lot of philosophers and mathematicians kind of spitballing these fancy ideas, but it doesn't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4127.673,
    "end": 4128.694,
    "text": " This is a common critique.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.714,
    "end": 4129.435,
    "text": "I'm not saying it's true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.056,
    "end": 4130.457,
    "text": "Oh, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.477,
    "end": 4130.737,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4130.897,
    "end": 4131.959,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.979,
    "end": 4137.186,
    "text": "Oh, well, it would be odd if I were to promulgate that position as the host of this podcast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.206,
    "end": 4137.667,
    "text": "Oh, no, no, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.707,
    "end": 4138.207,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.227,
    "end": 4140.891,
    "text": "I thought you were saying that that was the thrust of our paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.131,
    "end": 4142.453,
    "text": "No, no, no, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4142.473,
    "end": 4144.276,
    "text": "I'm saying it's a common critique from those on the outset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.296,
    "end": 4145.818,
    "text": "I don't remember saying all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.838,
    "end": 4146.479,
    "text": "No, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.499,
    "end": 4147.821,
    "text": "I know you didn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.841,
    "end": 4149.263,
    "text": "But it's a common critique, at least.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.303,
    "end": 4156.212,
    "text": "I mean, that might be oversimplifying the critique, but that, you know, this theory of everything...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.748,
    "end": 4161.598,
    "text": " is overgeneralizing and it doesn't have an evidential basis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4164.323,
    "end": 4172.901,
    "text": "Having done this sort of deep dive into the empirical status of active inference and predictive coding, what are the conclusions that you guys have drawn?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.37,
    "end": 4179.68,
    "text": " I mean, I just think I kind of think at the end of the day, I mean, it amounts to be something kind of similar to what I think you'll see in a lot of review papers for most things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.74,
    "end": 4180.201,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.221,
    "end": 4184.749,
    "text": "This is just that there's a lot of stuff where more work needs to be done to be for it to be definitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.829,
    "end": 4187.573,
    "text": "I mean, that's kind of like the very oversimplified conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.593,
    "end": 4195.446,
    "text": "I mean, I would say that I mean, one thing that I hope that we tried to make clear is just.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4195.426,
    "end": 4202.255,
    "text": " It's more that like there's just lots of different levels of claims with respect to both predictive coding and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.856,
    "end": 4207.583,
    "text": "And they all kind of need to be tested in a way that's a little bit, at least partially independent of each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.663,
    "end": 4207.923,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.943,
    "end": 4217.516,
    "text": "So, I mean, especially in the philosophy of literature, people will even talk about really broad like categories like, you know, just like predictive processing, you know, quote unquote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4217.536,
    "end": 4225.247,
    "text": "But like, I mean, if you want to move from that down to stuff that is actually testable requires.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.392,
    "end": 4231.588,
    "text": " a bunch of, there's a bunch of kind of layers that you have to kind of work through to get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4231.608,
    "end": 4236.604,
    "text": "So you kind of say, okay, well, predictive processing, it's very generic idea that in some way,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.107,
    "end": 4266.793,
    "text": " of the main things the brain does is predict stuff i guess right that's like okay well you know two of the most kind of like prominent but certainly not the only possible categories for that are like predictive coding and perception and active inference and action but then even from there right i mean like predictive coding makes particular um explain or makes particular predictions if what you're talking about is um something about the uh the the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4266.773,
    "end": 4278.049,
    "text": " the predictive coding algorithm right as defined right which is which doesn't necessarily need to make predictions at the level of the kind of like neurobiological implementation right so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.367,
    "end": 4280.671,
    "text": " And same thing, same thing with active inference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4280.711,
    "end": 4284.437,
    "text": "Active inference or say, okay, well, what type of active inference are we talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.457,
    "end": 4287.782,
    "text": "Are we talking about like the, you know, continuous state spaces?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.823,
    "end": 4289.265,
    "text": "Are we talking about discrete state spaces?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.405,
    "end": 4304.61,
    "text": "And, you know, like, are we talking about, um, you know, commitments related to, you know, some of these like claims about, you know, the gamma stuff and dopamine, or, you know, are we just talking about things about categorical state inference and that, and that, that depends on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.59,
    "end": 4310.884,
    "text": " minimizing variational for energy through like a variational message passing scheme, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4311.105,
    "end": 4314.412,
    "text": "And okay, are we actually hypothesizing variational message passing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4314.573,
    "end": 4316.798,
    "text": "Are we hypothesizing marginal message passing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4316.858,
    "end": 4318.802,
    "text": "Or are we hypothesizing that the implementation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.137,
    "end": 4323.363,
    "text": " draws or that the algorithm is doing some sort of belief propagation thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4323.944,
    "end": 4329.373,
    "text": "And then even there, that's still all just at the algorithmic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.934,
    "end": 4341.972,
    "text": "And then you have to say, okay, well, if I commit to some algorithm, if I commit to POMDP discrete state space, this particular generative model structure for this task,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4341.952,
    "end": 4362.93,
    "text": " you know with this you know with this message passing scheme you know as i said then all right there's like probably at least like 20 ways that you could set up a neural network right to solve that right so then you also have to have a hypothesis about okay what am i what what implementation you know am i am i testing right and what are the predictions of that implementation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.417,
    "end": 4363.657,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.677,
    "end": 4383.102,
    "text": "So if I'm doing something at the neuroscience level, then I'm going to say, okay, it's kind of this very kind of hierarchical thing where it's like, you know, this particular neural prediction that falls from this neural implement hypothesis, neural implementation that falls from this specific narrow algorithmic commitment, you know, like from this larger kind of framework, you know what I'm saying?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.122,
    "end": 4385.104,
    "text": "So it's like, you start making exclusions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.472,
    "end": 4397.98,
    "text": " Yeah, so testing these things, what it even means to be testing these things is kind of complicated because by the time you can actually get down to something that's empirically testable, you've narrowed it down a ton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.432,
    "end": 4406.906,
    "text": " And ruling out one implementation doesn't falsify the objective processing, nor does it falsify active inference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4406.926,
    "end": 4413.658,
    "text": "It just means you ruled out that a particular implementation of a particular algorithm within the active inference framework, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4413.678,
    "end": 4416.643,
    "text": "So it's like, okay, well now I'm testing implementation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.623,
    "end": 4445.567,
    "text": " hypothesis too um so it's a you know so that that's tough right so then um but a lot of you know but a lot of what's been done is much more um well I should say with with predictive coding a lot of stuff's been done at the at the neural level with active inference it's very minimal has been done in terms like neuroscience um neuroscientific studies like Philip Schortenbeck had a cool study in like 2015 where they did um where they did uh some of the um some of the uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4445.665,
    "end": 4453.123,
    "text": " like midbrain dopamine results in relation to some of the beta updating stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.143,
    "end": 4458.797,
    "text": "I mean, it's called alpha in that paper, so like slightly older symbolism, but same basic idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.351,
    "end": 4479.756,
    "text": " But so, you know, so there's that, and then, you know, there's kind of like with predictive coding, for example, you know, I think many people would say that one, you know, one specific commitment, at least to kind of like vanilla forms of, you know, hypothesis predictive coding architectures is like, okay, well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.736,
    "end": 4482.881,
    "text": " prediction errors get passed upward, predictions get passed downward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4483.342,
    "end": 4487.528,
    "text": "There's kind of these separate populations of prediction units and prediction error units.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.009,
    "end": 4498.926,
    "text": "Typically, it's like, okay, well, the prediction error units are in cortical layer two, three, and the deep prediction units are in pyramidal cells in layer five and six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.906,
    "end": 4519.508,
    "text": " But then when you actually look at some of these more complicated canonical microcircuit models and things like that, that really explore in detail how you would do predictive coding in a way that would kind of match up to the actual cortical columnar architectures that we know about from micro anatomical actual brain studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4520.089,
    "end": 4522.872,
    "text": "I mean, it becomes way more complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4522.852,
    "end": 4533.827,
    "text": " You have specific roles of granule cells, and then you have the sorts of predictions and prediction errors that are hypothesized to be passed around through different inner neurons, and then how those pass signals up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.39,
    "end": 4544.18,
    "text": "Prediction error signals need to be inhibitory, but the between column connections are all glutamatergic, and so they're excitatory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.981,
    "end": 4550.749,
    "text": "So you need to basically have any prediction error signal be excitatory, but then pass through some inhibitory inner neuron",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.37,
    "end": 4555.838,
    "text": " at the receiving end to then turn it into an inhibitory thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.379,
    "end": 4570.105,
    "text": "And then as opposed to the simple kind of vanilla predictive coding architectures or algorithm, most of the canonical microservice circuit stuff has been pitched in terms of these more kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.422,
    "end": 4580.38,
    "text": " temporally extended versions of predictive coding where you have like at each level, you're not just representing a hidden state, but you're also representing what they call like a hidden cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.222,
    "end": 4585.63,
    "text": "And the distinction between a hidden state and a hidden causes is that like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.711,
    "end": 4589.718,
    "text": " One of them actually predicts the dynamics of the states at the level below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.419,
    "end": 4596.689,
    "text": "Um, so it's kind of like hidden states to say like hidden state is, or now I'm mixing up which one it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.411,
    "end": 4599.674,
    "text": "One of them either hidden state or hidden cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.335,
    "end": 4606.065,
    "text": "Uh, I mean, this is just very jargony, just arbitrary choice of terminology to a certain extent, but, but.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.838,
    "end": 4608.781,
    "text": " Well, I'll say it the way that's a little more intuitive to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.002,
    "end": 4623.868,
    "text": "But so if Hidden State is like birds singing a song at one level, then I just have some representation about probability of birds singing song or something like that, fairly abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.848,
    "end": 4627.954,
    "text": " But then that then sends a signal to represent this hidden cause thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4627.994,
    "end": 4635.464,
    "text": "And what the hidden cause thing does is send predictions down to the level below about like some series of notes, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4635.544,
    "end": 4644.156,
    "text": "Like in some sequence to the level where the hidden state at that level is like representing what note is happening at a unit at some time period.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.937,
    "end": 4651.847,
    "text": "So even there, right, those are both predictive coding, but those are two different predictive coding theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.827,
    "end": 4663.677,
    "text": " So anyway, I mean, so just to point out fairly long-windedly that there's just a lot of complexity in specifying what you're in fact even testing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.943,
    "end": 4673.858,
    "text": " Um, but the, um, but the main, the main thing, I mean, the main kind of broad strokes result was just that, um, in predictive coding, I mean, there's certainly nothing that rules it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.199,
    "end": 4674.419,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.499,
    "end": 4683.994,
    "text": "I mean, there's, um, there's some cool, you know, results probably like the strongest results that, um, would suggest something like that has to be going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4683.974,
    "end": 4707.957,
    "text": " is um like findings related to like omission responses right where brain activity increases when you expect to get us to get a stimulus and the stimulus is absent yeah right so like if the stimulus is stimulus comes right it should trigger some activity under a feed forward sort of hypothesis but the absence of something should never trigger yeah yeah let's just go classic schultz and montague",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4708.544,
    "end": 4727.295,
    "text": " Yeah, but emission responses and other things like error-related negativity and a lot of the kind of more standard stuff that looks like prediction and prediction error responses that are consistent with predictive coding, they certainly don't provide really precise evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.275,
    "end": 4733.203,
    "text": " you know, particular layer two, three neurons that are representing prediction errors and five, six ones that are going to predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4733.223,
    "end": 4745.941,
    "text": "There are a couple of cool studies that have come out like super recently though, that do look like with like laminar, um, fMRI and things like that, that do are starting to support these kind of like distinct populations of error neurons and predict neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.961,
    "end": 4746.882,
    "text": "So that stuff's exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4747.643,
    "end": 4754.233,
    "text": "Um, it's all very, well, you know, it's a niche, but at least it's, it's incorporating it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.253,
    "end": 4755.274,
    "text": "Well, at least it sounds like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4755.828,
    "end": 4769.628,
    "text": " from your investigation, it's beginning to, well, I'd like to think that it's beginning to hone down on some specific ways that we can get more precise hypotheses and ways of testing those hypotheses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4770.189,
    "end": 4776.358,
    "text": "I mean, it's, it's, it's, it's right, you know, if, you know, the free, the main papers 2009 2010.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4778.642,
    "end": 4784.13,
    "text": "Fair enough that it's taken a little while to get it's, you know, it to get to stop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.583,
    "end": 4802.621,
    "text": " reaching that kind of finer precision, that level of granularity, that level of, I think, to my eyes, some of that philosophical work needed to be done just to lay out exactly the parameters, if you pardon the pun, of the explorandum of what we're trying to find out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4803.322,
    "end": 4804.825,
    "text": "So I don't know, it sounds promising to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4805.146,
    "end": 4805.747,
    "text": "It sounds exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4806.52,
    "end": 4822.285,
    "text": " Yeah, no, I mean, I think, yeah, I mean, certainly, I think, I think we need to hold things to a given, I mean, as you say, right, given that these, you know, these particular theories are, you know, much more recent, right, than other, like, you know, computational neuroscience theories that have had a lot more time, right, to be tested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4823.306,
    "end": 4826.892,
    "text": "So, so yeah, I mean, I think we need to be fair, given the amount of time that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.872,
    "end": 4853.689,
    "text": " that um you know these things have been uh these things have even been around to test and the you know the number of groups that have been motivated to you know put together studies and get them funded right to do these sorts of tests um absolutely um you know i mean and and with um and with respect to uh you know active inference i mean that's even more true right i mean the the actual kind of like empirically testable like behavioral modeling you know sorts of you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4854.158,
    "end": 4856.202,
    "text": " you know, sufficient, sufficiently precise, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4856.222,
    "end": 4866.685,
    "text": "Formalisms for, um, you know, like the kind of stuff that we do, you know, what's, that's been around like, well, it's since like 2017, you know, and it's, you know, been kind of evolving from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4866.865,
    "end": 4870.553,
    "text": "And, and so, um, and so, you know, much, much less time even.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.613,
    "end": 4871.475,
    "text": "And, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.894,
    "end": 4876.659,
    "text": " You know, I mean, I think there's a lot of things that, you know, I mean, we still need to do, I mean, along the approach that we're taking, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.679,
    "end": 4891.994,
    "text": "So, I mean, primarily, you know, what we've, you know, the stuff that we review that, you know, that we've done with, you know, like trying to find empirical support for active inference probably hasn't really up until now done a good enough job of doing model comparison against competing models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4892.435,
    "end": 4897.059,
    "text": "You know, our focus has been largely kind of like computational psychiatry focused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.139,
    "end": 4900.703,
    "text": "So the idea has been more, okay, let's define a set of active inference models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.683,
    "end": 4926.657,
    "text": " fit those models to behavior and see where we can find differences in those models between clinical groups and healthy groups right so we can show that like in an absolute sense right like active inference models could explain data preview you know reasonably well right like on a on a model on a task where like chance action probability would be like one-third you know like these models can explain behavior with you know assigning probabilities around like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4926.637,
    "end": 4931.403,
    "text": " you know, between like 0.65 and 0.7 something, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.463,
    "end": 4939.714,
    "text": "So, I mean, it's, you know, much, much better than chance and not too different than what you'd see in other computational neuroscience studies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4940.695,
    "end": 4951.569,
    "text": "But, you know, that doesn't directly compare active inference models to, you know, other classes of models, right, that have already been around, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.589,
    "end": 4953.792,
    "text": "And so that's a little bit more the kind of thing we've been trying to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4953.772,
    "end": 4980.37,
    "text": " recently as to more definitively kind of say you know how much you know can we find evidence for active inference models that is not equal evidence for other models that have been around for longer yeah yeah yeah no that sounds absolutely worthwhile and yeah i think you're i think some people are you know they don't they almost don't want to do that because if it turns out that an rl model does better than an active inference model then like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4980.704,
    "end": 4981.825,
    "text": " Let's just throw in the towel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.226,
    "end": 4984.509,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4984.629,
    "end": 5005.395,
    "text": "Even that, I think, needs to be kind of understood with a little bit of a grain of salt, though, because, well, you can worry that there are tasks where the tasks are simple enough that an RL model will do a perfectly good job explaining what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.375,
    "end": 5026.523,
    "text": " and an active inference model would basically predict the exact same thing right as a reinforcement learning model and in that case you know maybe the active inference model is more complicated but you know i mean that's just because in those contexts they're you know they have a certain isomorphism you know yeah to them so i think i think you have to you have to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.503,
    "end": 5055.295,
    "text": " make these comparisons in tasks where um like a simpler model certainly could explain behavior equally well but but there's there's reason to think other models that there could be the um patterns of dynamics in the in the choice behavior that um that could differentiate right active inference models from reinforcement I like it Ryan I like it you're staying true to the to the field I like it it's good that loyalty is much needed but no I I I really do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.68,
    "end": 5059.648,
    "text": " admire the intellectual rigor and the academic rigor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5060.389,
    "end": 5060.99,
    "text": "It's much needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5061.952,
    "end": 5066.421,
    "text": "And I certainly wouldn't want to say our stuff and only our stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5066.441,
    "end": 5070.949,
    "text": "I mean, there are other people that are doing very recently that have been doing really cool stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.969,
    "end": 5072.372,
    "text": "Like there's this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.061,
    "end": 5075.644,
    "text": " like the first office lesson, like Gibson or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5075.664,
    "end": 5076.966,
    "text": "I can't remember Sam Gibson.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5076.986,
    "end": 5085.877,
    "text": "Maybe I don't call me on that, but, but they did this really cool, um, um, study where they took like these two, um, a couple, or maybe it was like four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5085.897,
    "end": 5094.207,
    "text": "I think it was, yeah, four different like publicly available data sets, um, from, uh, on the two-step task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5094.768,
    "end": 5102.798,
    "text": "Um, two-step tap is a very kind of classic, um, RL task that like basically was designed specifically to estimate how much people are doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.778,
    "end": 5106.461,
    "text": " more kind of like model-based versus model-free sorts of planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.222,
    "end": 5110.345,
    "text": "And, I mean, super widely used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.385,
    "end": 5117.752,
    "text": "I mean, people have shown really cool stuff with, you know, like developmentally, you know, like kids as they get older start to look more model-based.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5117.772,
    "end": 5118.392,
    "text": "Right, right, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5118.652,
    "end": 5122.796,
    "text": "You know, basically it means they actually start to use an actual transition function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.016,
    "end": 5123.877,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.158,
    "end": 5124.418,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.779,
    "end": 5130.203,
    "text": "And, but, you know, so what they did is they took models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.183,
    "end": 5130.744,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5130.764,
    "end": 5139.98,
    "text": "Like the classic, you know, widely used model based model free kind of combo model that typically gets used for for that task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5140.481,
    "end": 5147.593,
    "text": "And then they also fit that same data to to like a competing active inference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5148.395,
    "end": 5155.026,
    "text": "And in two of the four data sets, model comparison was kind of equivocal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5155.192,
    "end": 5159.818,
    "text": " Um, and in the other two data sets, active inference models did win in model comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.419,
    "end": 5162.201,
    "text": "Um, for that, and these are pretty large data sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.241,
    "end": 5165.566,
    "text": "And again, but that's a very, it's another, you know, very kind of classic task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5165.586,
    "end": 5174.578,
    "text": "So the fact that, uh, the fact that active inference did a better job of explaining two-step tax behavior, I thought, you know, I thought that was actually like incredible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5174.598,
    "end": 5174.758,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.038,
    "end": 5175.278,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.298,
    "end": 5175.679,
    "text": "Well, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5175.699,
    "end": 5180.686,
    "text": "I mean, when it starts infiltrating better than what we've done in terms of actually testing active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.587,
    "end": 5181.807,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.938,
    "end": 5210.292,
    "text": " when it starts entering into the space where others should dominate that's you know that's when you know it's onto something ryan i know you're you're the world's busiest man uh filling out forms and and all sorts uh and so i'm incredibly appreciative we've just hit the hour and a half mark um well thank you so much for for giving me your time and educating me i feel i mean every time i have people on whether they're philosophers neuroscientists mathematicians",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5210.643,
    "end": 5211.103,
    "text": " and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5211.364,
    "end": 5217.35,
    "text": "It's always such a pleasure to, to learn more about the work they're doing, in terms of what you've got coming up of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.41,
    "end": 5219.813,
    "text": "So this paper that is coming out in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5219.833,
    "end": 5225.058,
    "text": "That's out, people can read it, although it supposedly out in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5226.22,
    "end": 5226.64,
    "text": "What else?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5227.181,
    "end": 5228.622,
    "text": "What else have you got coming up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5228.662,
    "end": 5230.364,
    "text": "Where can people find your work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5230.464,
    "end": 5235.79,
    "text": "How can people reach out to you if they're interested in asking questions or collaborating or whatever it might be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5236.563,
    "end": 5237.305,
    "text": " Oh yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.325,
    "end": 5248.929,
    "text": "I mean, you know, any, anything on our, you know, our, uh, lab website, uh, you know, or email me, you know, like our, our smith at Laurier Institute.org, uh, you know, feel free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.949,
    "end": 5252.818,
    "text": "Uh, yeah, we'll, we'll link the Twitter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5252.938,
    "end": 5256.225,
    "text": "I mean, you know, the typical routes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.205,
    "end": 5258.128,
    "text": " All the, all the standards, the standard stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5258.168,
    "end": 5262.655,
    "text": "I mean, my email is also typically the one that's like the corresponding author email on most papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.735,
    "end": 5270.226,
    "text": "So, um, you know, and there's certainly lots, uh, lots of ways to get in contact with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5270.707,
    "end": 5272.249,
    "text": "So desire, but great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.47,
    "end": 5274.813,
    "text": "Well, we'll make sure we link everything below.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5274.833,
    "end": 5278.218,
    "text": "Uh, so thank you once again from me and the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5278.238,
    "end": 5279.36,
    "text": "It's been really, really fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.281,
    "end": 5280.462,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5280.522,
    "end": 5282.044,
    "text": "No, thank you very much for having me.",
    "speaker": "SPEAKER_01"
  }
]