[
  {
    "start": 2.915,
    "end": 6.197,
    "text": " Hello and welcome everyone to the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6.717,
    "end": 11.179,
    "text": "This is our quarterly roundtable update number four in 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 11.679,
    "end": 20.903,
    "text": "It's December 14th, 2022, and we're recording and then instantly premiering this video due to some tech difficulties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 22.304,
    "end": 24.405,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.045,
    "end": 30.748,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 31.82,
    "end": 37.49,
    "text": " This is a recorded and an archived live stream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.412,
    "end": 42.82,
    "text": "All backgrounds and perspectives are welcome, and we'll follow video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.468,
    "end": 49.674,
    "text": " All right, today in the quarterly roundtable, we're going to have three main sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.774,
    "end": 61.787,
    "text": "We're going to give some updates at the Institute scale, then talk about developments in education and research, and finally discuss a little bit Active Inference Institute in 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 63.709,
    "end": 68.511,
    "text": " However, first, those who are here, let's go around and say hello.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.951,
    "end": 77.413,
    "text": "And if you would like one memory or special part of this year, just something you'll kind of take with you going forward in 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 79.474,
    "end": 81.115,
    "text": "Whoever wants to go first, just go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.355,
    "end": 84.496,
    "text": "I'm Dave Douglas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 85.176,
    "end": 87.777,
    "text": "I was really pleased to get...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 88.888,
    "end": 117.015,
    "text": " praise from Professor Mark Solms, a creator of a couple of different major waves in contemporary psychoanalysis and neuroscience, telling us it's going to be a massive contribution that we are not only recording our in-depth discussion and presentation with him, but publishing the transcript, which is what I was hoping to hear",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 118.835,
    "end": 128.663,
    "text": " every time we inconvenienced ourselves and stayed up late to get things out there that we're perceived as having an impact.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 131.225,
    "end": 131.605,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.785,
    "end": 132.646,
    "text": "That's great to hear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.666,
    "end": 141.493,
    "text": "Hey, everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 143.826,
    "end": 150.528,
    "text": " This quarter we finished one another intensive on system thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 151.148,
    "end": 171.475,
    "text": "It is not quite related to the active interest theory activity, but in a way it helps our participants to communicate with each other and move forward our internal projects and their own projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 179.812,
    "end": 180.132,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.152,
    "end": 187.856,
    "text": "So I think for me this year was probably the funnest part was the quantum stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.636,
    "end": 190.757,
    "text": "I really enjoyed that a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.317,
    "end": 196.1,
    "text": "And I think that like releasing the video transcript for that will be great and hopefully impactful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.6,
    "end": 202.783,
    "text": "And I'm looking forward to doing more quantum information related type of work in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.619,
    "end": 208.223,
    "text": " And I think that that was probably the funnest memory for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.949,
    "end": 231.742,
    "text": "I think interested was organizational aspects and transformation and possibly related to it in other aspects, rhythms that institute",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 252.366,
    "end": 258.821,
    "text": " Your structure, it's a good opportunity for next years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 261.667,
    "end": 261.948,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 263.1,
    "end": 263.5,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 264.14,
    "end": 270.762,
    "text": "Let's jump right in and just raise your hands whenever you want to address something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.542,
    "end": 273.723,
    "text": "And on we go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 275.143,
    "end": 282.545,
    "text": "Well, there's so many ways to cover what happened in the previous years, but this image meme partially suffices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.325,
    "end": 287.306,
    "text": "So on the left side, we have the Active Inference Lab, AIL.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 288.226,
    "end": 295.153,
    "text": " And on the right side, we have us today, which is the Active Inference Institute, AII, heading into 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 296.194,
    "end": 299.958,
    "text": "And we were the Active Inference Lab from the first days of 2021 till the middle of 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 303.578,
    "end": 304.538,
    "text": " for about 18 months.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 305.459,
    "end": 312.942,
    "text": "And since the middle of 2022, we've been transforming on multiple levels into the Active Inference Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.462,
    "end": 319.744,
    "text": "So some baseball card statistics, ActInfLab born 2020, AII born in the middle of 22.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 320.065,
    "end": 321.025,
    "text": "By the end of 2021, we had 133 live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.085,
    "end": 322.886,
    "text": "We added about 85 or 84 more in 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 331.687,
    "end": 336.011,
    "text": " Back in 2021, the active inference ontology was just a terms list.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 336.712,
    "end": 341.896,
    "text": "Today, it includes definitions, translations into many languages and examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 343.298,
    "end": 346.941,
    "text": "In 2021, the active inference textbook did not exist yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 347.722,
    "end": 353.187,
    "text": "Today, we're continuously delivering interactive learning groups and building an epistemic niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 354.591,
    "end": 360.779,
    "text": " In 2021, the Active Inference Journal existed only for special events as a proof of principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 361.3,
    "end": 368.73,
    "text": "And today, which we'll discuss later, we're rapidly transcribing, translating, augmenting, and versioning transcripts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 369.901,
    "end": 374.683,
    "text": " And in the Active Blockference project in 2021, it was just a dream within a dream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 375.344,
    "end": 389.091,
    "text": "And today we're actually implementing Active Inference in the CAD-CAD and there's other rows that could have been added, but just a little summary that brings us into our opening section on updates at the organizational scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 390.461,
    "end": 403.687,
    "text": " So first, related to the formal changes and updates at the Institute, we would like to welcome and appreciate our inaugural cohort of the Board of Directors, which began their work in November 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 403.868,
    "end": 412.012,
    "text": "That's John Klippinger, Raphael Kaufman, Daniel Friedman, Dean Tickles, Blue Knight, and Mike Smith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.132,
    "end": 421.119,
    "text": " The Board of Directors has had their first meeting, and over the about next month or so, the Board of Directors will be selecting officers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.96,
    "end": 437.595,
    "text": "So we are actively seeking self-nominations and suggestions for those who would like to serve in an officer position, president, vice president, secretary, treasurer, especially with experience in governance, financial, nonprofit, and education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 438.82,
    "end": 449.662,
    "text": " So just signal interest in a position or more generally, and we will be able to find a way for you to contribute as soon as you're ready to in the right way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 451.283,
    "end": 465.946,
    "text": "And we're going to be taking some steps as a nonprofit and as an organization, for example, towards tax exempt 501c3 status, developing partnerships with other institutions and building our grants program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.586,
    "end": 468.026,
    "text": "Anyone want to add anything here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.208,
    "end": 485.435,
    "text": " The installment of the board of directors also allows us to take a look back on our scientific advisory board and those who served in 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 486.035,
    "end": 502.045,
    "text": "So Bradley Alicia, John Boyk, Matt Brown, John Clippinger, Scott David, Jeff Emmett, Chris Fields, Carl Friston, Raphael Kaufman, Anatoly Levenchuk, Roslyn Moran, Elba Serrano, Carol Van Hoof, Tim Verbellen, Swan Webb,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 502.825,
    "end": 503.626,
    "text": " and Michael Zargum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 504.287,
    "end": 519.284,
    "text": "So big appreciations to all of those who served in the Scientific Advisory Board this year and were actively soliciting SELF and ALLO nominations for the Scientific Advisory Board in 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 521.426,
    "end": 526.75,
    "text": " And just connect to us via email if you're interested and we can provide you the forms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.291,
    "end": 543.803,
    "text": "And now we can more clearly delineate the formal roles of the board of directors, which are to implement institute scale formal strategy and governance specification and oversight of officers and to apply active inference at the organizational scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 544.423,
    "end": 549.566,
    "text": " from the insight and guidance-based work of the Scientific Advisory Board.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.206,
    "end": 572.358,
    "text": "And their roles and functions include the stewardship of organizational units, education and research, assisting with project development at different stages, periodic meetings as a Scientific Advisory Board quarterly, as well as subset meetings with a special interest focus, and other areas of insight and engagement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.858,
    "end": 573.819,
    "text": "Any comments?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 582.082,
    "end": 582.362,
    "text": " All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 585.765,
    "end": 591.05,
    "text": "Another helpful view is that of the chains of creation of the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 591.39,
    "end": 601.458,
    "text": "So these edges reflect defined types of relationships that are not merely part whole or compositional, but enabling or constructor chains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 602.998,
    "end": 625.771,
    "text": " And the Institute is on the far left here, which enables and creates organizational unit niches, the educational and research organizational units that enable and facilitate projects, which then have attention on project specific systems of interest and their accompanying working products and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.531,
    "end": 631.874,
    "text": "Anyone want to add any comments on this systems engineering diagram as it relates to the Institute?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 637.626,
    "end": 647.775,
    "text": " So yeah, basically, this schema is helping us to manage attention on specific works someone is doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 648.775,
    "end": 665.269,
    "text": "And I believe next year, we will bring more systems concepts in place in different types of modeling and modeling for definitions of these different parts of enabling chain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 666.863,
    "end": 674.828,
    "text": " And so we will have opportunity in case we have some developments in terms of number of participants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 676.829,
    "end": 685.315,
    "text": "We can manage all organizational work with support of such attention management system, let's say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 692.64,
    "end": 692.9,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 694.141,
    "end": 694.581,
    "text": "Carrying on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.109,
    "end": 702.632,
    "text": " We're continuing to work and revise on the logo and brand redesign for the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 703.432,
    "end": 706.113,
    "text": "So for now, we'll just leave it as a gray box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 706.533,
    "end": 712.215,
    "text": "But there's some really exciting and artistic designs that we're working with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 712.896,
    "end": 720.059,
    "text": "And we're looking forward to sharing more about those designs and the designer when the time is right in the beginning of the year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 721.139,
    "end": 725.661,
    "text": "Okay, on to talking about different modalities of participation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.59,
    "end": 736.517,
    "text": " So, what previously was referenced by just saying come participate in the Institute is now more clearly annotated as a volunteer program.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.198,
    "end": 751.308,
    "text": "So, of course, everyone is always welcome to engage with asynchronous Active Inference Institute materials like live streams and publications, and everyone is welcome to join synchronous drop-in meetings in the Discord.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.438,
    "end": 761.623,
    "text": " The volunteer program keeps you in the loop about specific affordances for contribution and facilitates your participation across projects and learning groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 762.123,
    "end": 779.632,
    "text": "So a volunteer is somebody who wants to take an active step in their learning and applying of active inference and maybe focus in on one or more project and also just make sure that they're in the loop with high quality communication about different affordances to participate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 780.812,
    "end": 796.014,
    "text": " And excitingly, that informal lane for participation separated out from the internship program gives us a lot of expressivity to work with those who want to have a more accountability and a higher intensity engagement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.983,
    "end": 800.706,
    "text": " So the internship program was mentioned in the previous roundtable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.607,
    "end": 814.359,
    "text": "And after initializing the official internship program in October of 2022, sorry, typo there, we have 12 registered interns who are currently active and several more will be beginning in early 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.639,
    "end": 821.725,
    "text": "So this was really awesome to be meeting and connecting with some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.041,
    "end": 840.876,
    "text": " institute participants who have been around a long time and who were looking to take the next step in their work, as well as a lot of others who came in because this idea of an internship, which can be a real formal recognized contribution, was very salient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.456,
    "end": 844.759,
    "text": "So the internship consists of several main parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.419,
    "end": 848.181,
    "text": "The first main part is education.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 849.082,
    "end": 862.709,
    "text": " And that active education looks like joining one or more learning group, specifically the textbook group and the systems thinking intensives, as well as some self-driven education around reading and listening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.803,
    "end": 872.905,
    "text": " The second component of the internship is the project-based learning, a contribution to an institute project, which we're going to go through in the coming slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 873.605,
    "end": 884.327,
    "text": "And there's a mentorship and facilitation component such that the interns and the institute's visions and goals and preferences are all aligned in action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 885.087,
    "end": 890.988,
    "text": "So this is a great program that we look forward to really bolstering and carrying forward year after year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 892.188,
    "end": 893.629,
    "text": " Any comments on these points?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.516,
    "end": 901.756,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 902.436,
    "end": 918.529,
    "text": "And so just to close out the institute level section, we've continued to grow across our social media platforms and look forward to anyone who wants to contribute to help develop these platforms as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 920.488,
    "end": 925.029,
    "text": " Onto the education organizational unit, EduActive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 926.272,
    "end": 934.575,
    "text": " One of the keystone educational aspects of our year for many of us was the Active Inference textbook group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 935.415,
    "end": 944.218,
    "text": "The Active Inference textbook of Parr, Pizzulo, and Friston was released as an open source textbook at the end of March 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 945.099,
    "end": 950.06,
    "text": "And we were ready to spin up the first cohort of the textbook group in May 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.111,
    "end": 963.796,
    "text": " And now about six months later, the first cohort has completed their study of the text and they are invited to serve in a learning assistant role for future cohorts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 965.357,
    "end": 973.02,
    "text": "In about September through December, we had the second cohort begin the first half of the textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 973.8,
    "end": 982.366,
    "text": " And so in January 2023, cohort two is going to complete chapter six through 10, and the third cohort is going to begin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 983.927,
    "end": 993.253,
    "text": "What we do in the textbook group is continual deployment of value added services and scaffolding of a shared epistemic niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.994,
    "end": 998.457,
    "text": "Of course, if somebody wants to read and work on the textbook alone, they're welcome to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 999.337,
    "end": 1001.579,
    "text": "And we also hope to cultivate a space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1002.159,
    "end": 1028.086,
    "text": " in the textbook groups that's engaging and allows people to increase their familiarity and fluency and rigor of understanding of active inference through using questions and developing discourse, through using the active inference ontology and weaving the ontology through their thinking, and also to develop their mathematical bases, whether that's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1028.953,
    "end": 1041.487,
    "text": " thinking about the fundamentals of statistics and linear algebra and Bayes theorem, or whether people are interested in a more advanced work, like connecting the dots between different formalisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.355,
    "end": 1044.016,
    "text": " So it was an awesome year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1044.256,
    "end": 1055.864,
    "text": "We had probably 50 around there participants who were active in different ways and who also got activated into some other projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.465,
    "end": 1061.668,
    "text": "So we just encourage you, whether you're listening to this early enough to join cohort three in January, 2023,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1063.209,
    "end": 1068.813,
    "text": " or whether you're listening later, we'll still be offering this and other textbook groups.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1069.374,
    "end": 1077.7,
    "text": "So if you want to learn and learn well together, then the textbook group is going to be a unique and special opportunity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1078.441,
    "end": 1079.702,
    "text": "Anything that people want to add?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.327,
    "end": 1086.607,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1088.309,
    "end": 1110.726,
    "text": " let me add something it was very nice how it was grow from ontology for using for this value added services so the work what was done with ontology and i think it's mostly because of the tool the coder but anyway for in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1112.893,
    "end": 1133.529,
    "text": " augmenting this work with the textbook in a group and having such affordances in terms of like meta data or quick access for some additional information it really brings more value for educational process with the textbook it's like make it interactive",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1136.149,
    "end": 1136.49,
    "text": " Agreed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1136.51,
    "end": 1142.542,
    "text": "There can be a lot to look at and go through, which is only what we should expect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1143.765,
    "end": 1146.951,
    "text": "But the structure of the learning environment",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1148.129,
    "end": 1155.652,
    "text": " asynchronously and synchronously is simply not possible to offer or derive alone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1156.292,
    "end": 1168.556,
    "text": "So again, we hope it's something like a center of gravity for people who want to be proactive and in this type of scientific and educational space really catalyze their learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1170.437,
    "end": 1174.939,
    "text": "Onto the live streams and the educational functions of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1176.118,
    "end": 1184.045,
    "text": " In the fourth quarter of 2022, we had just an amazing set of guests and focal paper discussions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1184.825,
    "end": 1199.198,
    "text": "We had guests in the math stream related to category theory, in the organization stream relating to strategy and governance, in the model streams related to branching time active inference and the PyMDP package.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.35,
    "end": 1208.154,
    "text": " and guests in the guest streams related to radical and activism, math art, artificial intelligence, and biological intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1209.174,
    "end": 1215.217,
    "text": "And we featured three papers in the discussions around the paper streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1215.918,
    "end": 1220.94,
    "text": "And that was a worked example of the Bayesian mechanics of classical objects in Livestream 49.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1222.401,
    "end": 1231.103,
    "text": " Interoception as Modeling, Allostasis as Control in Livestream 50, and Canonical Neural Networks Perform Active Inference in 51.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1231.883,
    "end": 1234.544,
    "text": "And each of these series were exceptional.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.504,
    "end": 1245.087,
    "text": "The authors joined, and we had a .Zero crew each time who was really committed to understanding and communicating the material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.107,
    "end": 1253.572,
    "text": " So there are many ways you can help us co-create special and engaging live streams in 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1254.572,
    "end": 1262.577,
    "text": "You are always welcome to participate in preparing and enacting live streams, whether you do or don't want to actually join a live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1263.698,
    "end": 1269.582,
    "text": "It's also great to self-nominate or suggest or introduce somebody to join for a stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.686,
    "end": 1276.089,
    "text": " It's also a great opportunity to collaborate on a dot zero background and context video.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1276.609,
    "end": 1282.653,
    "text": "That's a great way to have your studying leveraged and amplified by thousands of folds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1282.833,
    "end": 1285.475,
    "text": "Your notes will not just live on your own computer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.615,
    "end": 1288.576,
    "text": "They'll exist in a space where others can benefit from them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1289.577,
    "end": 1293.419,
    "text": "And feel free to just join those regular live stream meetings to learn more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1293.879,
    "end": 1294.74,
    "text": "Any more comments?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1300.223,
    "end": 1310.159,
    "text": " One ongoing series that is capturing the last few slots and is ongoing is the Governing Continuous Transformation Bookstream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1310.479,
    "end": 1311.962,
    "text": "Lou, want to add any words on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1314.116,
    "end": 1314.196,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.457,
    "end": 1327.289,
    "text": "So I think I was inspired by the transformation of the lab to the institute and by joining the board of directors to study governance in a more formal way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.03,
    "end": 1337.299,
    "text": "So we have this book that is a recent text that reframes governance in the light of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1337.939,
    "end": 1349.866,
    "text": " So we undertook study, Tyler Sullenberg and myself and Daniel have been participating in the dot zero versions of the book stream, and we're doing one video per chapter of the text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.566,
    "end": 1355.409,
    "text": "And we will get together for some discussions at the end of each book section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.449,
    "end": 1367.115,
    "text": "So if you want to participate either in joining the dot zero or in a discussion of the material presented in the text, get in touch because we would love to have other perspectives and additional feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.939,
    "end": 1369.219,
    "text": " Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1370.34,
    "end": 1377.503,
    "text": "Well, as alluded to earlier by Dave, these live streams are not just a dead end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1378.463,
    "end": 1383.205,
    "text": "At the Active Inference Journal, we pick up where the live stream ends.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.126,
    "end": 1391.309,
    "text": "And our goal is to increase the accessibility and indexability of live streams and audio visual material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1392.089,
    "end": 1397.992,
    "text": "So to give a summary of just an instance, like a case of the journal,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1399.092,
    "end": 1406.154,
    "text": " We took the transcript of guest stream 16 with Mark Solms on consciousness as precision optimization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1406.894,
    "end": 1412.495,
    "text": "Here's a screenshot with Mark, myself, Steven, and Dave having those live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1413.276,
    "end": 1422.338,
    "text": "And then through the development of a journal utilities GitHub repo and a tremendous amount of scripts and expertise from Dave, we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.407,
    "end": 1434.455,
    "text": " The outcome with some automated and some manual components is an augmented transcript that contains different features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1435.156,
    "end": 1440.24,
    "text": "It can be as plain as what comes off of the transcription artificial intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1440.86,
    "end": 1449.707,
    "text": "It can be as rich as hyperlinked and interactive with embedded images, translations, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1451.11,
    "end": 1454.254,
    "text": " And as of today, December 14th,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1455.56,
    "end": 1461.304,
    "text": " We have DOIs for all of the paper live streams that occurred during 2022.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1461.724,
    "end": 1467.668,
    "text": "And now we're working through the backlog of previous streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.008,
    "end": 1480.857,
    "text": "And so what that looks like on the live stream CODA page is you'll find the event name, the date it was live streamed, the video watch link, the title and link to the paper and information on the guests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1481.317,
    "end": 1485.18,
    "text": "You'll also find that there are a link to the slides.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1486.521,
    "end": 1495.588,
    "text": " a link to the transcript, a DOI provided if you want to cite it, and also a link to the GitHub where that series can be versioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.748,
    "end": 1501.392,
    "text": "So people can fix typos in a decentralized way that's incremented and trackable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1501.832,
    "end": 1511.019,
    "text": "They can also add simulations and all kinds of other contributions that people might want to do so that the thread of these discussions stays alive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1511.94,
    "end": 1515.483,
    "text": " Dave, it was great work and a fun time this year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1515.803,
    "end": 1518.786,
    "text": "What would you like to add or provide?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1522.89,
    "end": 1528.154,
    "text": "Well, we're just getting going.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1529.475,
    "end": 1536.862,
    "text": "In a few very technical and very high impact field, notably virology,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1538.008,
    "end": 1539.129,
    "text": " and public health.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1539.249,
    "end": 1553.195,
    "text": "There has been a huge push internationally across disciplines to get word level, phrase level, conceptual graph level access to all researchers.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1554.377,
    "end": 1559.142,
    "text": " It's a lot of material, but it is a small fraction of all of the scholarly activity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1560.103,
    "end": 1571.194,
    "text": "I think even in that field, the presentation, the reuse of spoken material is still pretty minor.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1574.125,
    "end": 1596.926,
    "text": " between the various text repositories the different uh open science initiatives and active inference institute i think just continuing to push to make particularly interdisciplinary and transdisciplinary ongoing real-time scholarship the norm over the next",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1598.629,
    "end": 1602.819,
    "text": " few years will really pay off tremendously.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1603.099,
    "end": 1606.507,
    "text": "There's a lot of legal battles that are going to be getting worse.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1607.189,
    "end": 1607.89,
    "text": "Folks that want to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1609.161,
    "end": 1617.085,
    "text": " take possession, take ownership of the entire genome of every organism and charge you to know anything.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1618.326,
    "end": 1627.351,
    "text": "In my opinion, criminally evil activity is being run through legal systems and...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1631.213,
    "end": 1649.254,
    "text": " common law one hopes that simply overwhelming this with virtuous activity is going to help to make that much less of a pathology that's afflicting the species and other species wow",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1651.192,
    "end": 1655.035,
    "text": " from transcription to the Metacrisis and back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1655.936,
    "end": 1658.678,
    "text": "It's really been educational though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.318,
    "end": 1670.607,
    "text": "And we all know just in the unrecorded private conversations we have and in the seminars and in the meetings that we've had over the previous years enabled by video conversation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1671.934,
    "end": 1680.761,
    "text": " Amazing things are said and amazing perspectives are shared by experts, beginners, all kinds of experts and people with their own lived experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.542,
    "end": 1687.106,
    "text": "And yet the best we can do in many situations is link to a video and sometimes not even that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1688.087,
    "end": 1708.092,
    "text": " So to have all of the transcripts and an increasing number of captions and their translations in a searchable and trainable and accessible form is, again, as Dave mentioned, we hope that this can become a continuous development",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.472,
    "end": 1735.48,
    "text": " leaving a huge amount of functional products in the niche and the costs are not high and it is more possible than ever truly within the last several months there were developments in speech and text processing that changed our ways of working so that was just quite exciting to have set out on this path years ago and see so much of it evolve in the last few months alex or anyone else",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.497,
    "end": 1769.103,
    "text": " yeah it's actually transformational project and for institute because it was in the beginning of the year it was like a dream to have all videos in transcripts and this project i believe heavily technology driving with dave's expertise give us these pictures when we actually have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1770.672,
    "end": 1794.76,
    "text": " and transcripts and have backlog when we can improve and having this text corpus for any where as institute we are on frontier in terms of using tools that we have from ai developments and all these text form content will",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.956,
    "end": 1801.361,
    "text": " will be developed in different ways with all different kinds of new technologies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1804.684,
    "end": 1805.025,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.785,
    "end": 1806.086,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.867,
    "end": 1808.348,
    "text": "Carrying on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1809.869,
    "end": 1813.833,
    "text": "Ivan, want to describe the work in the Systems Engineering Intensive?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.973,
    "end": 1816.433,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1817.394,
    "end": 1824.78,
    "text": "So next year we start new intensive for four weeks for beginning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1825.641,
    "end": 1842.595,
    "text": "And this type of intensive will mostly for our interns, but we are open to and welcoming all others who are interested in systems engineering approach.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1844.198,
    "end": 1866.395,
    "text": " We will go in through the concepts and mostly on role concepts like they are the cornerstone in the systems engineering and it's very helpful to negotiating within the projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1867.836,
    "end": 1868.056,
    "text": "So",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1871.083,
    "end": 1874.86,
    "text": " besides all of the theory part, we will have",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1876.556,
    "end": 1900.23,
    "text": " a practical part and we also have some cases like you can see here with the concepts and examples from the real life it's help it will have to understand the systems engineering approach more precisely.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1905.552,
    "end": 1905.872,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.333,
    "end": 1911.678,
    "text": "So it's going to be four weeks synchronous with also asynchronous work and learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1911.698,
    "end": 1914.341,
    "text": "Want to add a few more details here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1914.361,
    "end": 1917.224,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1918.145,
    "end": 1928.596,
    "text": "Here is, we'll provide the RSVP form for your confirmation and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1931.102,
    "end": 1938.867,
    "text": " Here we provide some specific dates and if you are available for specific dates.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1940.488,
    "end": 1948.874,
    "text": "And if you have more questions, you can easily reach us out via email.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1952.754,
    "end": 1953.054,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1953.674,
    "end": 1980.44,
    "text": "This like active inference, it's a framework that helps us think, shapes and scaffolds our attention and affordances, and also marries well with active inference as we continue to think about the Institute and all of its attendant systems as something like a synthesis of active inference with systems engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.611,
    "end": 1984.013,
    "text": " want to summarize this slide?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1985.215,
    "end": 1987.678,
    "text": "Yeah, just one thought for Priya.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1987.739,
    "end": 1989.701,
    "text": "So this time we will provide",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1995.511,
    "end": 2000.213,
    "text": " the linkage between active inference and system thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2000.373,
    "end": 2013.198,
    "text": "And I believe we can publish some small review on what the entire linkage is now and how we consider it now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2018.82,
    "end": 2029.786,
    "text": " Yes, this type of activity is part of the educational program of the Institute for Augmented Intelligence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2032.648,
    "end": 2042.514,
    "text": "You can see here the link of the Institute and part of the courses that are available in English.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2045.185,
    "end": 2059.495,
    "text": " partly translated by an anonymous translation, so it could be somehow not so plain English, but anyway, it's very interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2064.218,
    "end": 2085.451,
    "text": " useful content to moving any projects forward to their purposes, whatever research projects is or industrial or whatever projects you are launching now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2089.393,
    "end": 2089.733,
    "text": "Excellent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2091.158,
    "end": 2094.04,
    "text": " All right, any final comments on education?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2099.964,
    "end": 2102.305,
    "text": "It's been quite an educational year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2103.046,
    "end": 2116.094,
    "text": "Those who are in the game and listened to some conversations, joined a few, read some papers, scanned the social medias, stayed abreast of what was happening and changing in our field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2117.535,
    "end": 2139.634,
    "text": " incredible actually when people look back on 2022 and plus or minus several years from now there's so much happening and so much to learn that those who choose to act first and step into the fray are already learning at least for myself more than we thought was possible",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2141.443,
    "end": 2143.243,
    "text": " Onto the research projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2143.544,
    "end": 2158.227,
    "text": "So here we're just going to more cursorily overview some research projects because they're all in progress with a lot of different outcomes and just join the meetings for these projects when we pick back up in 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2159.127,
    "end": 2166.229,
    "text": "So in the active inference ontology, we are continuing to develop the ontology, fleshing out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.029,
    "end": 2179.458,
    "text": " the terms list, as well as associated definitions, examples, counter examples, and so on, as well as the translations into different languages and with the mathematics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2180.059,
    "end": 2187.104,
    "text": "This is what facilitates an engineering grade approach to the active inference knowledge ecosystem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2188.985,
    "end": 2190.926,
    "text": "In the active block inference project,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.974,
    "end": 2194.335,
    "text": " primarily with a development work of Jakob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2195.035,
    "end": 2204.819,
    "text": "We've continued to explore computational implementations of active inference, primarily in Python and PyMDP, but also in a few other ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2205.76,
    "end": 2207.881,
    "text": "And this will be a continued",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2208.841,
    "end": 2231.348,
    "text": " uh active locus in 2023 we had a paper and a poster and maybe some other outcomes from this project in 2022 and we're going to make it even more this year in robotics and embodied we have jf facilitating a really unique project and direction",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2232.754,
    "end": 2259.882,
    "text": " It's been great to have JF's experience with the physical and the metaphysical, one might say, and the way that they come together in these society of Lego entities, but also a great project and offering where those who want to learn more about symbolic active inference and robotics can connect with JF and work on this really unique project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2260.862,
    "end": 2279.414,
    "text": " And then there's a few other projects seeds that we're looking to activate as needed, which is the graphical interface project, asking what is it like to learn and apply active inference from a visual and intermodal perspective, highlighting accessibility and rigor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2281.116,
    "end": 2300.493,
    "text": " And in the cognitive agent modeling project, where we're doing research analysis to understand the similarities and differences amongst different cognitive modeling frameworks, such as active inference and others, so that in the future, when we say, well, we study attention this way, we can also...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2301.334,
    "end": 2310.163,
    "text": " flesh that out by saying, and these other common frameworks that are used in field one, two, three study attention this way, and this framework doesn't use attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.343,
    "end": 2317.029,
    "text": "And so this is why we think that active inference could do better than this framework in this place and help this framework in this way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2318.07,
    "end": 2328.141,
    "text": " And then we have the individual research projects, which just reflect the research projects that driven individuals are the champions of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2329.302,
    "end": 2339.512,
    "text": "And they're not always going to be carried out using the ONFT, ontologies, narratives, formal documents, and tools of the institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.313,
    "end": 2349.575,
    "text": " which is to say it's not necessarily a CODA document owned by the Active Inference Institute with an open source dedication, but it could be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2350.576,
    "end": 2362.679,
    "text": "And these research projects have been very fruitful and engaging, and it's been an honor to connect with so many diverse individuals who are making it happen in their own way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.479,
    "end": 2371.642,
    "text": " And sometimes working amidst the traditional research structures, but needing an outlet that's not what they have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2372.282,
    "end": 2376.064,
    "text": "And other times coming from outside of traditional research structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.944,
    "end": 2379.465,
    "text": "And that's just really special to see at the Institute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2381.145,
    "end": 2387.848,
    "text": "Just to give a little one more detail on active block friends with some memes and roadmaps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2389.358,
    "end": 2397.563,
    "text": " Our main conceptual focus this year was understanding the multi-agent case for active inference simulations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2398.844,
    "end": 2415.054,
    "text": "Understanding the dimensionality and some of the constraints and processes associated with multi-agent simulations will then let us revisit different POMDP, partially observable Markov decision process, modeling schemes, and heuristics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2416.152,
    "end": 2420.974,
    "text": " And we think of active block for instance having two primary departments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2421.994,
    "end": 2436.08,
    "text": "On the theoretical side, there's a host of questions related to different functionalities of models and computational implementations, as well as exciting areas like quantum active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2437.0,
    "end": 2450.61,
    "text": " And on the applied side, there are various settings and use cases where we can really start to make that last mile between a general purpose package and a domain specific use case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2453.432,
    "end": 2456.074,
    "text": "Any final comments on research?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2460.357,
    "end": 2460.577,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2462.867,
    "end": 2472.229,
    "text": " Well, there are so many ways to talk about what comes next, and I'm hoping that in early 2023, we'll be communicating those to all of you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.33,
    "end": 2478.751,
    "text": "Here's just one synthesis visualization to help those who might want to see.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.272,
    "end": 2485.533,
    "text": "We are niche-bound on all sides, and we wouldn't want it any other way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2486.741,
    "end": 2505.883,
    "text": " At the institute scale, we have a renewed understanding and structural enablements with the board of directors in a formal governance role and the scientific advisory board as a broader global cohort of individuals who want to be scientific informal advisors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2506.884,
    "end": 2519.335,
    "text": " And we're continuing to develop our grants and partnership programs, as well as make advancements on the Bolts domains, business, operational, legal, technical, and social.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.577,
    "end": 2528.523,
    "text": "Within the Institute, we have two organizational units, the EduActive Educational Unit and the Research Unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2529.756,
    "end": 2546.35,
    "text": " At the research and education unit level we're interested to have stewarded development by those who have that kind of vision and capacity to share and generally to increase participation quality and quantity and.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.972,
    "end": 2549.854,
    "text": " increase our capacity to model projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2550.434,
    "end": 2563.563,
    "text": "For example, in 2022, we were able to develop an improved meta model or a template for live streams, which enabled us to increase the quantity and quality of the live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.003,
    "end": 2571.388,
    "text": "And we look forward to doing those kinds of meta modeling approaches across other working product and system of interest types.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.529,
    "end": 2590.98,
    "text": " And the last mile where the work is actually done, where the epistemic rubber hits the pragmatic road, is in the projects, where we hope and expect and prefer to see sustained participation from global participants, volunteers, and interns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2591.841,
    "end": 2597.104,
    "text": "And it's through the projects and the services that they project back into the niche and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2598.035,
    "end": 2602.94,
    "text": " by which we actually close the loop through continual action, inference and service.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2603.54,
    "end": 2606.864,
    "text": "So here's the live streams going out through a data channel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2607.384,
    "end": 2610.347,
    "text": "Here's the transcripts leaking out of a GitHub repo.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2610.867,
    "end": 2616.693,
    "text": "Here's somebody translating the ontology into a new language so that all the previous projects can be empowered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2617.074,
    "end": 2618.255,
    "text": "Here's a script coming out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2618.675,
    "end": 2620.177,
    "text": "Here's some other ambassadorship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2620.697,
    "end": 2632.605,
    "text": " And so this is just one way we are representing to you and to ourselves what the Institute is and what it does in a complex and changing niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.026,
    "end": 2637.409,
    "text": "Any multi-level thoughts that you fellows would like to share?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2637.429,
    "end": 2645.855,
    "text": "The last two ones like thinking systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2654.338,
    "end": 2661.841,
    "text": " Okay, 2022 was a year of artificial intelligence generated images and text for many.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2662.321,
    "end": 2670.664,
    "text": "So thought we'd throw out a few computer generated, not designer generated logos, but they're pretty cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2670.724,
    "end": 2673.305,
    "text": "We made many more and had fun times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2673.745,
    "end": 2680.488,
    "text": "I think all of us dialoguing and next year in the active diffusion project, we'll have a lot more to say about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2682.421,
    "end": 2686.507,
    "text": " Well, what would a good understanding enable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.398,
    "end": 2694.341,
    "text": " of the Institute and our niche, what are some unique predictions and implications of our work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2695.061,
    "end": 2699.783,
    "text": "What are the next steps for free energy principle and active inference and the Institute?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.763,
    "end": 2703.024,
    "text": "What are the goals of this researcher work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.144,
    "end": 2704.825,
    "text": "And what are you still curious about?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2705.665,
    "end": 2712.548,
    "text": "A closing round from everyone as we have our final live stream of the year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.199,
    "end": 2720.402,
    "text": " I want to know more about this active diffusion project and where can I sign up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.403,
    "end": 2722.124,
    "text": "Sounds way fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.144,
    "end": 2724.046,
    "text": "That's my closing thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.967,
    "end": 2726.229,
    "text": "Catechism incoming.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.054,
    "end": 2735.919,
    "text": "So it's like closing round table for this year.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2735.939,
    "end": 2739.703,
    "text": "I believe we can say that it was quite a journey.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2741.147,
    "end": 2769.475,
    "text": " and we redefining a lot of stuff in terms of our own understanding about understanding of niche and adopting our structure to be able to be more and more valuable for for different communities for different possible interests and stakeholders so next years",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2770.635,
    "end": 2772.776,
    "text": " And let it look bright.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.257,
    "end": 2776.677,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.457,
    "end": 2779.038,
    "text": "Ivan and Dave?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.358,
    "end": 2785.54,
    "text": "Yeah, for me, the most exciting thing is our internship.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2786.3,
    "end": 2793.983,
    "text": "And I'm really looking forward to how people from different domains will",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2796.428,
    "end": 2811.159,
    "text": " learn more about active inference and bring their perspective into this area and get back our perspective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2813.541,
    "end": 2815.582,
    "text": "This will be very awesome, I think.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2818.044,
    "end": 2818.825,
    "text": "Thank you, Dave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.089,
    "end": 2826.374,
    "text": " That's extraordinary, the range of interests and expertise that have come through.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2826.915,
    "end": 2829.857,
    "text": "Some folks, you see their faces every week.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2829.958,
    "end": 2833.461,
    "text": "Some folks are working hard, but behind the scenes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2833.481,
    "end": 2835.582,
    "text": "There have been folks that...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2837.122,
    "end": 2841.904,
    "text": " dropped in a lot a year or two ago, we haven't seen for a while.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2842.384,
    "end": 2861.633,
    "text": "I suspect they are greatly enriched by this collaboration and that some of them will come back and whether we see them or not, they're using what they've learned, both the soft and the hard skills in enriching other areas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2864.034,
    "end": 2865.815,
    "text": "Wow, totally agree with all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.259,
    "end": 2880.993,
    "text": " I may have to sneak in a final separate stream to review one slide per guest stream or paper because we truly had such a range of guests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.893,
    "end": 2889.401,
    "text": "And for those who tune in asynchronously or those who join the meetings,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2891.118,
    "end": 2893.68,
    "text": " It's been incredible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2894.32,
    "end": 2914.035,
    "text": "The bravery and the honesty and the authenticity that learners and researchers all around the world brought to this little corner of the internet in its truly earliest days will always be remembered.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2916.797,
    "end": 2918.939,
    "text": "Okay, till next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2920.879,
    "end": 2921.544,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  }
]