[
  {
    "start": 6.545,
    "end": 26.106,
    "text": " all right hello and welcome it's january 17th 2025 and we're in active inference guest stream 96.1 with ron edelman discussing designing intelligent experiences for trust so thank you ron for joining and looking forward to your presentation and the discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.352,
    "end": 30.82,
    "text": " All right, so really happy to be here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.84,
    "end": 47.436,
    "text": "I must say that I'm only here because I randomly reached out to Carl and he was very kind and generous and he decided to, you know, entertain some conversations and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.108,
    "end": 49.973,
    "text": " Those, it's been about two years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.237,
    "end": 58.358,
    "text": "Those conversations led to a couple of presentations, meeting some really incredible people involved in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.378,
    "end": 62.269,
    "text": "And it really kind of set me on a new course, new ways of thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.688,
    "end": 77.368,
    "text": " And I wanted to share a more practical, perhaps implementation practitioner approach to what are the real world problems we're seeing with integrating the brilliant community of people who are trained in Bayesian statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.59,
    "end": 81.674,
    "text": "It's a completely different way to think about problem solving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.115,
    "end": 88.003,
    "text": "And if you start working with product managers, with designers, business folks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.983,
    "end": 93.028,
    "text": " they might have just a very different framework for thinking about how to create systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.07,
    "end": 100.756,
    "text": "And I just want to kind of share an experience I had, which kind of changed my life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.836,
    "end": 101.877,
    "text": "And it was about music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.599,
    "end": 106.842,
    "text": "And I was really struggling to learn the Western style of music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.203,
    "end": 109.485,
    "text": "And I had a teacher who studied in India.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.226,
    "end": 116.472,
    "text": "And so they have a different way, it's instead of writing things down in straight lines, and you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.806,
    "end": 118.228,
    "text": " You sing your music first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.288,
    "end": 119.129,
    "text": "It's called conical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.209,
    "end": 123.455,
    "text": "So, um, quarter notes would be takademi, takademi, takademi, takademi, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.636,
    "end": 128.002,
    "text": "Triplets would be takita, takita, takita, takita, takita.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.022,
    "end": 142.442,
    "text": "And that system of learning accelerated me more than in a few weeks than years of like taking music lessons and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.38,
    "end": 154.816,
    "text": " The reason that this, I think, is important is because it introduced me to the idea around having a trusted source of truth in collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.938,
    "end": 168.717,
    "text": "All of a sudden, when I was playing music, we could all agree, you know, metronomes, timing, it opened up an entire language for me for how to interface with others, be completely creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.81,
    "end": 173.754,
    "text": " have that freedom to collaborate, but it was also safe, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.794,
    "end": 178.778,
    "text": "Like it was also, we could remain within the constraints of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.819,
    "end": 183.703,
    "text": "And that unlocked all kinds of incredible learning experiences for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.664,
    "end": 192.391,
    "text": "And since then I've viewed information flowing through organizational networks, kind of through the lens of music.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.011,
    "end": 199.277,
    "text": "Like what is our metronome that allows us to collaborate when we're building software?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.409,
    "end": 207.582,
    "text": " when we're providing recommendations to customers, when we're troubleshooting operational and business processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.986,
    "end": 217.738,
    "text": "And I think Carl enjoyed my analogy of synchronization in music when talking about these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.778,
    "end": 226.311,
    "text": "So he called it computational psychiatry, not words I would use, but that's how this journey kind of began for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.135,
    "end": 228.837,
    "text": " So just a little bit about me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.659,
    "end": 231.421,
    "text": "I've written two books now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.461,
    "end": 233.805,
    "text": "The first one came out last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.845,
    "end": 236.789,
    "text": "It's Unifying Business Data and Code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.55,
    "end": 240.775,
    "text": "It was incredible to write an O'Reilly book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 241.897,
    "end": 247.224,
    "text": "And that book deal got me a second book deal, The Language of Innovation, which is coming out in a couple of months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.226,
    "end": 255.977,
    "text": "And my life has been around meeting incredibly talented people and figuring how do we leverage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.328,
    "end": 264.438,
    "text": " that creative brain power and passion and help organizations minimize their costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.219,
    "end": 275.331,
    "text": "And I think that I view myself as kind of a bridge, a connector between all these different worlds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.351,
    "end": 283.821,
    "text": "And unifying business data and code was kind of my first exploration into how we formalize methodologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.206,
    "end": 287.93,
    "text": " to get everyone to have, quote unquote, a metronome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.95,
    "end": 295.158,
    "text": "So how did we get to the idea of why is trust interesting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.178,
    "end": 306.43,
    "text": "Well, it started with a conversation with Carl, I think, at his theoretical neurobiology group, where I asked, what is the definition of understanding?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.452,
    "end": 310.635,
    "text": "And he was like, well, it's quite simply",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.122,
    "end": 313.604,
    "text": " It's a shared model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.025,
    "end": 317.688,
    "text": "If you both have the same inputs, you should both have the same outputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.288,
    "end": 324.214,
    "text": "And that for me was how I connected back to the idea of the metronome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.035,
    "end": 331.0,
    "text": "Because in reality, we don't have shared metronomes in a business.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.28,
    "end": 337.806,
    "text": "In fact, I would say if you go to two different departments and you say, what does this word mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.866,
    "end": 340.268,
    "text": "Usually they will give me a different definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.458,
    "end": 357.212,
    "text": " And even if I ask two people within the same department, just as a pure consulting kind of approach on process optimization or architecture, explain to me how this process works, it is almost never described to me the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.814,
    "end": 372.027,
    "text": "So this is a really hard problem because if we're going to be able to have AI make decisions and people can't even agree on what the operational reality is, how is an AI going to do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.263,
    "end": 383.475,
    "text": " So the metronome for me is just a symbol of, it's always something I could trust.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.015,
    "end": 388.802,
    "text": "It was just something I could like let go of holding on to what I think is right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.964,
    "end": 394.03,
    "text": "And I just, this is the truth and everyone else can align around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.231,
    "end": 395.652,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 397.606,
    "end": 402.695,
    "text": " it was really interesting for me to approach the problem of like, how would you computationally define it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.316,
    "end": 415.897,
    "text": "And I will tell you, I do not have a computational definition of trust right now, but I am thinking about frameworks, approaches, ways to quantify it and engineer trust in systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.378,
    "end": 419.283,
    "text": "And this to me is a very, very exciting problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.406,
    "end": 422.348,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 423.475,
    "end": 435.748,
    "text": " best analogy I had was when I was just, I was feeling a little tired and I started, you know, watching some TV and I pulled up the movie Edge of Tomorrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 435.868,
    "end": 441.534,
    "text": "For those of you that don't know Edge of Tomorrow, it's Groundhog Day meets sci-fi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.535,
    "end": 452.605,
    "text": "Tom Cruise keeps dying over and over in this battle with aliens and each time he wakes up, he's learned from his previous experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.424,
    "end": 479.892,
    "text": " but there's one scene in the in the movie which really kind of helped me think of ways to articulate ways we can think about trust so in the beginning tom's like smiling he's laughing you know 100 feeling safety and control the general says you're going to go out into the battlefield and he's a tom cruise is a reporter you're going to report on the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.12,
    "end": 492.328,
    "text": " on the war, Tom's afraid of this, and so he threatens the general, if you send me into battle, I'm going to basically make you look bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.713,
    "end": 498.64,
    "text": " And so then the general then says, I'm going to call you a deserter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.241,
    "end": 505.448,
    "text": "And he throws Tom not into a reporter role, but actually into this mechanized combat suit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.249,
    "end": 509.192,
    "text": "And Tom doesn't even know how to use the suit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.973,
    "end": 515.499,
    "text": "And eventually the sergeant says, jump or die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.42,
    "end": 522.147,
    "text": "And it's in this particular moment where it's like the opposite of trust kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 523.477,
    "end": 524.498,
    "text": " felt clear to me, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.878,
    "end": 526.8,
    "text": "He has no certainty of what's going to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.86,
    "end": 527.661,
    "text": "It's pure chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.002,
    "end": 529.663,
    "text": "He has no control over these events.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.024,
    "end": 533.247,
    "text": "He has no safety because he's going to die, possibly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.287,
    "end": 538.292,
    "text": "And, you know, he has no understanding of like, what the heck is even happening to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.695,
    "end": 553.467,
    "text": "And if we look back at how LLMs, and not everything is LLMs, but LLMs seem to be very hot and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.683,
    "end": 558.127,
    "text": " But I think this is true for any kind of machine learning probabilistic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.088,
    "end": 571.561,
    "text": "When we are in situations, granted it's not the edge of tomorrow with that situations, but when we are in a situation where we have to make decisions that could be life or death, it could be patient care.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.081,
    "end": 576.746,
    "text": "It could be the life or death of a company if you make a wrong decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.127,
    "end": 580.99,
    "text": "It could be the difference between layoffs, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.096,
    "end": 605.831,
    "text": " When we use these probabilistic systems and we're leaving the deterministic approach, we have a clash because there's a lot of attention on fine-tuning and prompt engineering and trying to force these AI systems to behave deterministically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.893,
    "end": 608.395,
    "text": "But they are not deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.885,
    "end": 621.374,
    "text": " And so I want to think about these four dimensions around certainty, control, safety, and understanding, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.394,
    "end": 634.487,
    "text": "So when we have what's, if you're familiar with a paper called Toolformer, it introduces these kind of two terms, post-processing and pre-processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.648,
    "end": 640.153,
    "text": "And so what OpenAI did when they first kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.247,
    "end": 644.991,
    "text": " shaped the entire industry, right, that we now are thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.151,
    "end": 659.846,
    "text": "It's you give us all of your, you know, put everything in a vector database that you send, you do your fine tuning, your prompt engineering, and, you know, our AI is going to be super, you know, quote unquote, super intelligence, general intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.546,
    "end": 667.153,
    "text": "It's really good if that's your business model to have companies do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.977,
    "end": 669.279,
    "text": " It's in their benefit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.519,
    "end": 674.146,
    "text": "It's in the cloud provider's benefit for a business to have really messy data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.291,
    "end": 687.746,
    "text": "And of course, preprocessing is hard because you can't possibly know in advance all the ways things will be used and all the rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.108,
    "end": 692.753,
    "text": "And we're left with this kind of black box situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.96,
    "end": 700.869,
    "text": " And it leaves this black box situation obviously is very ambiguous, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.889,
    "end": 711.025,
    "text": "And when we're going shopping and we want to buy a cup of coffee, we don't want to have a probabilistic answer to what a cup of coffee costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.347,
    "end": 716.614,
    "text": "We want to know this is how much it costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.016,
    "end": 737.37,
    "text": " every single time when we're going to make our decision right and so how do we bring in these probabilistic and deterministic systems into user experiences another dimension around safety compliance is typically governance kind of things is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.806,
    "end": 765.332,
    "text": " just sharing my experience first of all if you're into if you're a taxonomist or you know if you're if your knowledge graphs and linked data are your thing incredibly powerful great but i do want to share with people what the problems i see from in the real world companies that are trying to implement these approaches you have a very small group of people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.257,
    "end": 771.724,
    "text": " who cannot possibly know everything in the company and every operation and define things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.505,
    "end": 776.871,
    "text": "So they quickly become bottlenecks for these top-down rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.072,
    "end": 781.637,
    "text": "And the bottom-up requests become an overwhelming tsunami.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.838,
    "end": 784.38,
    "text": "So people just go around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.641,
    "end": 787.104,
    "text": "And now you have the worst of these worlds, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.124,
    "end": 791.349,
    "text": "Because you're paying for enterprise software that you're also not using.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.25,
    "end": 795.775,
    "text": "And you have all this shadow IT kind of things going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.619,
    "end": 816.976,
    "text": " And when we, you know, thinking of biology, like when ants leave these trails, we typically have a really hard time leaving trails of how we solve tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.417,
    "end": 826.825,
    "text": "But if we can find a way to leave trails, these audit trails of how do we solve cognitive tasks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.488,
    "end": 834.434,
    "text": " We create the opportunity for kind of an organizational scale learning, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.454,
    "end": 858.043,
    "text": "So the difference between the top-down approach and this complex adaptive systems approach is if you just can observe how people are solving tasks, you will have a fluid way to see what are the rules and processes people are following in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 859.964,
    "end": 863.348,
    "text": " autonomously with freedom, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.568,
    "end": 867.253,
    "text": "And how are the interactions with governance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.074,
    "end": 877.124,
    "text": "And this is what was the origin of what I was really interested in working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.144,
    "end": 887.997,
    "text": "So I had a previous startup where we basically pulled all public data from GitHub,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 888.685,
    "end": 894.977,
    "text": " If you're a developer and you did some code, we had data on you and your code and down to the commit level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 895.618,
    "end": 899.406,
    "text": "And we were trying to sell it to recruiters like, hey, do you want developers?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.947,
    "end": 903.313,
    "text": "We can analyze people's codes and recommend developers for you to recruit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.598,
    "end": 906.499,
    "text": "But I had a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.221,
    "end": 910.407,
    "text": "I had two weeks for a big demo to like, you know, one of these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.825,
    "end": 925.345,
    "text": " Fortune 50 companies and all our data was in a SQL database and I wanted to use AI and I didn't have time to learn lane chain and figure out how to convert things into a vector database.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.946,
    "end": 932.936,
    "text": "I had to hack something together, which would enable me to use natural language to query a database.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.418,
    "end": 940.326,
    "text": "And so I decided to take a really old school approach, just using regular expressions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.297,
    "end": 951.328,
    "text": " And that is what I'm trying to formalize into a protocol, which I call trust loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.789,
    "end": 957.795,
    "text": "So before I go into anything, Daniel, are there any questions coming up or any comments, or should I proceed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.536,
    "end": 958.897,
    "text": "Not yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 959.637,
    "end": 959.998,
    "text": "Proceed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.018,
    "end": 960.218,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 960.999,
    "end": 961.8,
    "text": "Very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.82,
    "end": 970.33,
    "text": "So we want to take these kind of four dimensions and just think about them in terms of how we're designing systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 970.495,
    "end": 973.418,
    "text": " where people can learn and then the whole organization can learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.278,
    "end": 981.985,
    "text": "And where I think this could be really interesting is, you know, someone responded as I started posting about this, about the EEU AI Act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.928,
    "end": 986.289,
    "text": "How are you going to be compliant?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.309,
    "end": 999.22,
    "text": "And I think this particular protocol has a lot of promise around compliance because everything is meant to be open and transparent and with trails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.993,
    "end": 1009.885,
    "text": " And I'm trying to bridge them together, bringing some reinforcement learning principles, some active inference principles, but that is kind of what is guiding my approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.786,
    "end": 1015.692,
    "text": "So what does the architecture look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1016.013,
    "end": 1020.598,
    "text": "First of all, we need to integrate into a user interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.96,
    "end": 1027.907,
    "text": "And then we need to be able to have a registry of rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.317,
    "end": 1054.063,
    "text": " The approach I took is to have an LLM look at my rules and then recommend suggestions to dynamically improve with a feedback loop, any kind of rule management for me as an individual, but it could also be for a system if there are like compliance or regulatory requirements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.82,
    "end": 1060.384,
    "text": " And then lastly is this kind of cognitive audit trail, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.725,
    "end": 1064.762,
    "text": "So I'm going to give you a very super simple example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.548,
    "end": 1071.675,
    "text": " But let's say I, and this is literally the most simple example I could come up with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.055,
    "end": 1078.584,
    "text": "But let's say for example, I have this chat interface and I wanna ask a question about my data, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.604,
    "end": 1083.29,
    "text": "Like let's say I have some dataset or database and I wanna calculate revenue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.37,
    "end": 1092.842,
    "text": "So like if I were to post a question, you know, can you tell me what my revenue was, et cetera, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.189,
    "end": 1104.643,
    "text": " and there are clearly some bugs, simply asking up here a feedback loop, what do you mean by revenue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.665,
    "end": 1107.307,
    "text": "Do you mean net or gross?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.288,
    "end": 1111.092,
    "text": "Because these are wildly different calculations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1113.455,
    "end": 1115.218,
    "text": "This is incredibly, incredibly simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.88,
    "end": 1123.369,
    "text": "It is merely identifying possible ambiguity in my language and then saying, hey, is this what you mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.497,
    "end": 1129.503,
    "text": " Or, hey, do you wanna use the revenue calculation from this particular database?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.185,
    "end": 1134.629,
    "text": "Now, why is this important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.649,
    "end": 1153.491,
    "text": "Well, let's go back to this slide here, because I think the important question is why use AI at all?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.192,
    "end": 1166.847,
    "text": " if you can accomplish your task in the most efficient manner, that doesn't mean there needs to be AI involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.409,
    "end": 1180.204,
    "text": "So there was a really interesting metric from Versys recently, which I know everyone here is a fan of, that it beat,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.775,
    "end": 1188.728,
    "text": " OpenAI's mastermind gameplay versus 01, I think the 01 model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.768,
    "end": 1197.342,
    "text": "And it said 01, I think it was like, took five hours and cost $200 and it was only 70% accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.063,
    "end": 1203.132,
    "text": "And versus was 100% accurate, took five seconds and like cost 50 cents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.953,
    "end": 1205.095,
    "text": "That's amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1205.125,
    "end": 1205.646,
    "text": " I love that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.227,
    "end": 1206.747,
    "text": "I love that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.928,
    "end": 1210.533,
    "text": "And this is no disrespect to versus or anyone in AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.553,
    "end": 1213.857,
    "text": "But my immediate question was, hang on a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.438,
    "end": 1222.49,
    "text": "I'm pretty sure the algorithm to solve mastermind exists in a JavaScript file somewhere on GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.534,
    "end": 1228.398,
    "text": "And that means zero cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1228.418,
    "end": 1232.323,
    "text": "And instead of taking seconds, it's milliseconds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.343,
    "end": 1233.445,
    "text": "And 100% accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.007,
    "end": 1240.333,
    "text": " I actually checked it was Python code is the code I checked, but same thing, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.353,
    "end": 1252.511,
    "text": "And so it just kind of reinforced this idea around, hey, the whole industry is barreling at 100 miles an hour towards this post-processing paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.113,
    "end": 1254.714,
    "text": "But why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1254.734,
    "end": 1260.222,
    "text": "Why should we send everything through AI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1260.242,
    "end": 1264.748,
    "text": "How do we know what we should send through AI and what we should not send through AI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.715,
    "end": 1295.41,
    "text": " And so that is what the trustee protocol is meant to do is we're trying to figure out how do we route which types of cognitive tasks already have rules and deterministic processes to solve and which ones don't exist in our rules registry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.098,
    "end": 1300.004,
    "text": " So that that is where AI can shine, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.526,
    "end": 1321.077,
    "text": "Because if the reality is, as I've read, I haven't personally audited, that a single query for a, you know, kind of an enterprise, mid and enterprise company can cost a couple hundred dollars to process and hallucinates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.883,
    "end": 1327.609,
    "text": " Is that really cost efficient, especially if there's a deterministic solution out there that works 100%?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.33,
    "end": 1338.62,
    "text": "And just to be clear on as much as I think AI is amazing at certain tasks, this just came across this morning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.68,
    "end": 1340.802,
    "text": "So I just want to put it up here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.483,
    "end": 1344.706,
    "text": "I didn't believe it when someone posted this on Blue Sky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.746,
    "end": 1347.809,
    "text": "So I typed it in myself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.889,
    "end": 1351.873,
    "text": "It's not the exact same wording, but I got the exact same result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.22,
    "end": 1355.483,
    "text": " So then I'm like, okay, well, is this a Google thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.543,
    "end": 1357.847,
    "text": "Or maybe it's like, what if I give it to Claude?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.129,
    "end": 1362.434,
    "text": "So I gave this to Claude and asked, is this correct?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.995,
    "end": 1368.222,
    "text": "And Claude was like, yeah, no, your glass of water will not freeze at 27 degrees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.085,
    "end": 1374.271,
    "text": "So I said, but isn't 27 degrees lower than 32 degrees?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.832,
    "end": 1378.097,
    "text": "And it said, oh, yeah, expertise has far less infrastructure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.955,
    "end": 1383.561,
    "text": " think that like slapping on AI is going to be safe and reliable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.325,
    "end": 1387.947,
    "text": "Which leads me to another question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.269,
    "end": 1390.39,
    "text": "How do you even measure that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.352,
    "end": 1404.81,
    "text": "So if you look at Chatbot Arena, right, if I have the name right, where you have two different LLM models and people are picking what they prefer, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.95,
    "end": 1421.027,
    "text": " A model has a preferred answer, but different people in different contexts with different language might have what they call a preferred, you know, or a correct answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.128,
    "end": 1426.694,
    "text": "And a preference is not necessarily a deterministic correct answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.439,
    "end": 1430.699,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1431.059,
    "end": 1433.002,
    "text": "I'm going to pause there, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.863,
    "end": 1435.725,
    "text": "Any, any questions or should I continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.038,
    "end": 1442.285,
    "text": " I'm writing some things down, a lot of cool points to discuss.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.305,
    "end": 1445.649,
    "text": "And if anyone watching live wants to write questions, they can go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.669,
    "end": 1446.33,
    "text": "Continue, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.35,
    "end": 1447.091,
    "text": "Okay, good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.111,
    "end": 1450.936,
    "text": "Yeah, I want this to be interactive and not me just rambling on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.956,
    "end": 1464.413,
    "text": "So if you have anything you're curious about or not, so what we're hoping to do is to create a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.528,
    "end": 1469.855,
    "text": " very basic protocol protocol is a guarantee.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.875,
    "end": 1478.607,
    "text": "If you're gonna build these types of systems, just a simple scaffolding of here is how you do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.648,
    "end": 1486.077,
    "text": "And so what we need to do is have our intents predicted from our words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.08,
    "end": 1491.244,
    "text": "We need to reflect them back to the user.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.713,
    "end": 1494.957,
    "text": " so that we can see the intent of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.977,
    "end": 1509.496,
    "text": "I don't know if Riddhi is here, but she's the one that kind of like, she's amazing and she's the one that kind of introduced me to that idea around how do we see into the mind of our AI systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.896,
    "end": 1511.859,
    "text": "Like what is the belief of the system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.56,
    "end": 1516.725,
    "text": "And I think if people are concerned about the EU AI Act,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.705,
    "end": 1526.159,
    "text": " That's exactly what they want to be able to have is how much uncertainty exists in your model and in your system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.66,
    "end": 1538.477,
    "text": "Because going back to that chatbot arena, you might have preferences of model answers, but that is very different than how efficient the system is at completing a task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.419,
    "end": 1539.719,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.3,
    "end": 1547.487,
    "text": "Like your model might have a good answer, but is it what the person who's using the model needs to solve their problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1548.508,
    "end": 1556.997,
    "text": "Which is a much different benchmark, especially when you start calculating the cost of running some of these models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.779,
    "end": 1569.409,
    "text": "Secondly, there's security issues, but being able to configure rules for these intents, what is deterministic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.845,
    "end": 1574.971,
    "text": " and what is probabilistic, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.991,
    "end": 1578.936,
    "text": "And there's one thing that kind of shocked me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.097,
    "end": 1580.278,
    "text": "Oops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.298,
    "end": 1585.645,
    "text": "There's one thing that kind of shocked me that because I'm in presenter mode, I can't move things around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.526,
    "end": 1594.536,
    "text": "But I don't know if you see here using Claude, the API, I ran prep my,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1595.495,
    "end": 1622.599,
    "text": " mouse wheels accidentally getting hit all the time okay so if running plot there's a um like a hundred percent success rate if i ran it through the user interface but if i run it through the api and this is the a benchmark of math word problems that openai released the accuracy dropped to 30 percent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.718,
    "end": 1626.399,
    "text": " Why is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.06,
    "end": 1641.116,
    "text": "Well, it's because the user interface when you use the web app has all kinds of fine tuning that you and I have no idea exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.758,
    "end": 1644.1,
    "text": "It's a black box to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.403,
    "end": 1650.848,
    "text": "And when we run it through an API, we don't have the benefit of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.84,
    "end": 1666.875,
    "text": " And the reason this is important is because when I, and I'm gonna stop sharing my screen now, when I told my friend this, who uses Cloud on a regular basis for data engineering tasks, he had no idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.076,
    "end": 1673.681,
    "text": "So he had no idea he had to do all this extra, because he's like, in the web UI it works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.443,
    "end": 1680.548,
    "text": "Once I get it working in the web UI, why don't I just like, you know, automate it through APIs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.333,
    "end": 1688.682,
    "text": " not necessarily bother even bothering to benchmark it because he trusted the web user interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.164,
    "end": 1707.909,
    "text": "So I think that we're really an immature kind of industry trying to apply AI to solve really hard problems that often have really significant safety compliance decision-making impacts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1707.929,
    "end": 1711.935,
    "text": "And I don't think we really have a way to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.215,
    "end": 1735.324,
    "text": " understand how to design an engineer trust and so that's that's what i'm passionate about i just kind of wanted to you know share with the community some some of my research and you know i think there's there's i could ramble on here but i also don't know if uh i'd like to like kind of take a pause and see if anyone has any questions or comments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.953,
    "end": 1738.333,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.494,
    "end": 1740.896,
    "text": "I will read a question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1740.976,
    "end": 1744.36,
    "text": "Anyone else can write, and then I can make some other comments and questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.52,
    "end": 1744.761,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1746.142,
    "end": 1757.054,
    "text": "Reconfigurability Trainer writes, Ron, did your work building the architecture include non-compliance related performance KPIs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.575,
    "end": 1760.558,
    "text": "If so, did anything about that exercise surprise you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.141,
    "end": 1766.425,
    "text": "Non-compliant paced performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.417,
    "end": 1770.14,
    "text": " other KPIs not related to system compliance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.021,
    "end": 1771.382,
    "text": "Got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.942,
    "end": 1781.954,
    "text": "So if you haven't seen the startup Unify.ai, I was really surprised reading all the logos that use their service.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.354,
    "end": 1788.902,
    "text": "And I think they're really well supported by the Hugging Face leadership.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.76,
    "end": 1796.327,
    "text": " they distilled it down to three metrics, cost, speed, accuracy, and you can test any model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1796.407,
    "end": 1817.168,
    "text": "And so I haven't used their service, but they seem to have a really good way for as simple as possible, as simple API calls for people that test various models, various prompt engineering, various fine tuning for benchmarking that has nothing to do with compliance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.502,
    "end": 1831.702,
    "text": " I think though, there's a disconnect for me around, um, I've worked with some brilliant data scientists and AI engineers who, you know, working on their local host, local machine would have incredible results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.162,
    "end": 1845.18,
    "text": "And then they think good luck getting that into production, uh, in the real world with like, you know, uh, outside of training, uh, I forget the term, but when you, when you have examples that are outside of your training set, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.409,
    "end": 1854.183,
    "text": " And so that just brings me back to this idea of benchmarking is absolutely important for models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.465,
    "end": 1869.97,
    "text": "It will not get me to say anything else, but if you're not benchmarking in the real world, how those models are interacting operationally and what the impact to the business is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.249,
    "end": 1895.485,
    "text": " Eventually someone in the finance department is going to be like, hey, we just invested $5 million into AI and we have to now have $3 million worth of extra HR costs to maintain all these complex new systems and our sales or whatever, our marketing, we don't have any real improvements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.983,
    "end": 1898.685,
    "text": " I've been around to see those kinds of layoffs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.745,
    "end": 1899.606,
    "text": "They're not fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.247,
    "end": 1917.388,
    "text": "And so I think that the discipline, the business discipline that a data scientist could benefit from is really starting to include thinking about benchmarks beyond simply model performance or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.714,
    "end": 1925.221,
    "text": " That's very interesting to kind of echo a piece back there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.241,
    "end": 1938.517,
    "text": "Within a compliance testing sandbox skeleton or scaffold, then other kinds of measures and performances can be evaluated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.097,
    "end": 1945.485,
    "text": "But to pursue those measures only,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.022,
    "end": 1959.439,
    "text": " when the vector of the performance isn't necessarily aligned with that of the compliance, then is going to lead to some kind of go-no-go with compliance down the road that might not be trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.479,
    "end": 1962.363,
    "text": "But if it was trivial, then it would have been trivial in any order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.663,
    "end": 1973.937,
    "text": "But in situations where it isn't trivial, then you want to make sure that you have the expressivity to test different compliance environments almost before you test the size of the data, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.828,
    "end": 1977.913,
    "text": " You brought up a really important point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.895,
    "end": 1983.643,
    "text": "So I'm not sure if people are familiar with the whole world models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.326,
    "end": 1985.967,
    "text": "Kind of buzz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.388,
    "end": 1988.472,
    "text": "Yann LeCun, if I'm pronouncing his name right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.772,
    "end": 1994.001,
    "text": "He's been tweeting or posting on LinkedIn about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.432,
    "end": 1997.695,
    "text": " Fei-Fei, is it Fei-Fei Ling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.795,
    "end": 1999.677,
    "text": "I'm not sure if I'm asking her name, my apologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2000.298,
    "end": 2005.644,
    "text": "At Stanford, she just raised $200 million for her startup on world models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.465,
    "end": 2013.514,
    "text": "And there were a couple of things there that I just wanted to point out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.037,
    "end": 2022.705,
    "text": "The first one is when we have a simulator, like a physics simulator,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.36,
    "end": 2023.721,
    "text": " right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.941,
    "end": 2026.705,
    "text": "Like a car driving simulator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.246,
    "end": 2030.01,
    "text": "And we can run that simulation a million times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.032,
    "end": 2036.4,
    "text": "And then out of that million times, maybe we can do some like, you know, deep learning on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2038.623,
    "end": 2041.467,
    "text": "That is a fixed rule system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.008,
    "end": 2049.84,
    "text": "There are, there are rules just like when we're doing compliance, our simulators have things they are physically bound to follow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.799,
    "end": 2056.427,
    "text": " The rules are known, just like when you have alpha zero playing chess or whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.088,
    "end": 2059.472,
    "text": "Games are fixed rule systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.253,
    "end": 2065.801,
    "text": "In the real world, in business, the rules are constantly changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.422,
    "end": 2067.684,
    "text": "Legislation changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.245,
    "end": 2070.027,
    "text": "The ways people operate changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.769,
    "end": 2071.93,
    "text": "HR rules change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.751,
    "end": 2073.773,
    "text": "Language changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.636,
    "end": 2080.603,
    "text": "There's no fixed simulator you can have for a business.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.389,
    "end": 2110.168,
    "text": " And so the approach that we're proposing with trust the protocol is to say, okay, if we cannot impose some top down fixed rule stimulator, but we can create those, remember I had that image of the ants trails that if we can collect all these like ant trails for how things are actually getting done, what do people mean by these different words?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.925,
    "end": 2119.517,
    "text": " You can have a, and I don't know the actual technical term for this, but it's like a liquid simulator, fluid simulator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.038,
    "end": 2125.365,
    "text": "It's revealing things that are happening by these quasi rules that are emergent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.707,
    "end": 2136.16,
    "text": "And that hopefully can create world models, but not through a fixed system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.18,
    "end": 2137.101,
    "text": "That was the first thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.486,
    "end": 2142.975,
    "text": " I wanted to say before I go on to the second thing, the answer is that, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.995,
    "end": 2151.289,
    "text": "Um, the second thing was I was lucky enough to do this like little case study for, um, precision medicine department of Stanford.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2151.51,
    "end": 2162.548,
    "text": "Um, and they were doing a hackathon around people who had rare diseases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.068,
    "end": 2171.617,
    "text": " So the precision medicine lab had very few patients, but they had lots and lots and lots of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.777,
    "end": 2186.933,
    "text": "I mean, genomic data, proteomic data, metabolic data, like if you name it, they were just barraging them with tests to create the most massive data sets they could on the few people they had with these very rare diseases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2189.157,
    "end": 2198.348,
    "text": " And to prepare for that hackathon, I met with another Stanford team that was trying to create like the largest physics dataset in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.509,
    "end": 2204.555,
    "text": "I'm wondering if they were actually part of this Feifei Lang world model thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.755,
    "end": 2218.05,
    "text": "But what was really interesting that they did is they collected all this data and then they ambiguated everything to numbers that you couldn't see what the columns were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.3,
    "end": 2219.021,
    "text": " of the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.744,
    "end": 2224.089,
    "text": "And I thought that was a really interesting approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.33,
    "end": 2228.396,
    "text": "And so I asked the organizer of the hackathon why, you know, what was behind it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.178,
    "end": 2244.983,
    "text": "And he goes, because we found when we have these data sets, with the words in the columns, the people who are experts, right, the trained PhDs in their field, regularly underperformed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.418,
    "end": 2250.565,
    "text": " people who had no knowledge or expertise of that field, but they were purely machine learning experts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.287,
    "end": 2258.495,
    "text": "And I thought that was I thought that was very interesting as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.316,
    "end": 2272.152,
    "text": "That doesn't tie into the, to the compliance thing, but just this, this idea around creating simulators and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.688,
    "end": 2297.194,
    "text": " removing even our own language and constraints in how we think, and just completely trusting good practices, those seem to be the highest benchmark approaches, at least talking to an expert in the field that created this massive physics dataset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.148,
    "end": 2317.638,
    "text": " Yeah, in the design architecture you outlined and kind of connecting it to, let's say, employee nestmate ants leaving their traces through a sandbox or something like that, it made me think about the metacognitive environment that cognitive tasks are performed in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.219,
    "end": 2321.865,
    "text": "Like, if the company were playing board games,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.875,
    "end": 2328.522,
    "text": " which model or method should be applied to each of the cognitive games.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.403,
    "end": 2339.614,
    "text": "And then the metacognitive task, you could bring out the heavy or expensive one too often, or you could bring out the lightweight, less performant one or narrow one too often.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.654,
    "end": 2346.162,
    "text": "So that's like sort of thinking too much or too little, these kinds of metacognitive or attentional tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.823,
    "end": 2349.726,
    "text": "And it's almost like, okay, over the last...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.706,
    "end": 2368.575,
    "text": " years we've started to see the upswing of the capacity of the sort of like horsepower of the statistical probabilistic which has always existed as this dual thread along the more expert rule-based regular expression type systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.555,
    "end": 2388.657,
    "text": " and then it's like okay so we know at the very least we have whether we think about it with system one system two or you know thinking symbolically and rule-based or thinking probabilistically and and numerically and then it's like now where and how within an enterprise auditing and compliance environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.805,
    "end": 2401.197,
    "text": " that also creates not just the required operations that are that are needed, but also the training data, where it's like, what are the low hanging fruit that we can use the shorter ladder for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2401.257,
    "end": 2404.46,
    "text": "What are the high hanging fruit that like no one has been able to hit?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.021,
    "end": 2406.682,
    "text": "What so what's our reach goal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.123,
    "end": 2416.872,
    "text": "It's like, you know, because we're starting to see we have all these different affordances to deploy that have wildly different capacities and different costs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2416.852,
    "end": 2422.518,
    "text": " You could outsource it to someone for thousands of dollars over weeks, or we could do this for hundreds of dollars over minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.099,
    "end": 2430.327,
    "text": "And when you burn through hundreds in just hitting one query, those are critical and they really add up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.288,
    "end": 2431.988,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.009,
    "end": 2435.953,
    "text": "And that's kind of smiling because I was just like, you got it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.993,
    "end": 2441.419,
    "text": "Like, that's exactly what we're trying to architect here is when do you use AI?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.539,
    "end": 2442.42,
    "text": "When not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.182,
    "end": 2445.323,
    "text": "Which model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.623,
    "end": 2446.705,
    "text": " Which approach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.607,
    "end": 2449.11,
    "text": "When do you use an expert system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.312,
    "end": 2463.497,
    "text": "It's a really interesting problem because if you're measuring against operational performance versus the model performance, you might have very simple hacks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.793,
    "end": 2471.402,
    "text": " which are way cheaper to implement, faster to implement, less IT complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.584,
    "end": 2479.694,
    "text": "And I feel like that is completely off the radar right now, because everyone's like rushing towards this new paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.236,
    "end": 2489.788,
    "text": "Yeah, not every company is a frontier slash foundation model AI research lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.494,
    "end": 2519.151,
    "text": " so why use something more complex um i'll read another question from the chat and then anyone else can write more okay andrew peshea wrote nice talk all relevant points topics on trust regarding agent activity do you have an opinion on the uses of actor critic frameworks in the case of llms for output refinement fact checking etc yeah great question um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2519.772,
    "end": 2524.259,
    "text": " I think I heard, was the word expert in there or opinion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.319,
    "end": 2525.36,
    "text": "I'm not sure what it was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.681,
    "end": 2527.444,
    "text": "Let me just say, I just have an opinion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.484,
    "end": 2539.682,
    "text": "I'm just going through, you know, it's funny because writing a book or getting published, now you get questions, oh, like I have some secret answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.922,
    "end": 2543.227,
    "text": "No, I'm figuring all this out just like everyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2545.21,
    "end": 2547.754,
    "text": "And I can tell you what I've been doing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2548.763,
    "end": 2553.149,
    "text": " I'm interested in and where I think being an author is awesome and where it sucks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.83,
    "end": 2561.761,
    "text": "So being where being an author is awesome is that you're completely removed from having to do any of the work, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2561.821,
    "end": 2568.97,
    "text": "Like I got to spend two years not coding and just thinking about all these ideas and talking to the most interesting people I could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.071,
    "end": 2571.334,
    "text": "And, you know, what about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.374,
    "end": 2571.894,
    "text": "What about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.934,
    "end": 2572.135,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.517,
    "end": 2577.522,
    "text": "And so when we talk about these agentic actor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2578.531,
    "end": 2582.678,
    "text": " paradigms, I can share with you what I've learned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.219,
    "end": 2594.82,
    "text": "But it's not from a practitioner point of view, it is purely from reading, thinking, imagining, and working on my own little kind of agentic little experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.042,
    "end": 2598.827,
    "text": "So it's clearly very, very valuable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.847,
    "end": 2603.155,
    "text": "I think for me personally, just even like through the chat UI,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.438,
    "end": 2607.826,
    "text": " for me to write something and then, you know, Claude will be like, that's awesome, that's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.846,
    "end": 2615.298,
    "text": "And then you build it up and then like, I'll send it in a new chat and I'll say, okay, now you're gonna be the role of a critic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.24,
    "end": 2619.085,
    "text": "Tell me all the things that's wrong, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.689,
    "end": 2620.61,
    "text": " Go through that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.81,
    "end": 2634.322,
    "text": "And Andrew Ng, actually a friend, a good friend, Yoshi, he pointed me to a recent Andrew Ng talk where he talks about this emergence of AI product managers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.763,
    "end": 2638.266,
    "text": "And he talks about this multi-actor role.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.306,
    "end": 2647.114,
    "text": "Like you have the first brainstorm partner, then the critic, and then maybe the engineer who has to take the critic and figure out how to build it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.499,
    "end": 2660.477,
    "text": " You know, and you can see now in the, like, in the LLM chain of thought reasoning approaches, they are definitely, you know, they're even saying like, hey, criticizing or reviewing, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.858,
    "end": 2666.446,
    "text": "So it's clearly a pattern that I think has great value and is being engineered and implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2667.427,
    "end": 2674.237,
    "text": "However, I recently had an experience with someone from the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.257,
    "end": 2675.198,
    "text": "I don't know if Lance is here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.238,
    "end": 2675.959,
    "text": "He's amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.059,
    "end": 2676.46,
    "text": "I love him.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.912,
    "end": 2679.717,
    "text": " It's still incredibly helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.298,
    "end": 2685.146,
    "text": "I recently worked on this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.166,
    "end": 2696.946,
    "text": "It's the first time I've ever submitted anything for a talk, RLDM in Ireland, Reinforcement Learning Multidisciplinary Conference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.196,
    "end": 2704.907,
    "text": " on cognitive world models, which is like, how do we take the world model approach introduced in 2018, where you create a simulation of a simulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.508,
    "end": 2706.169,
    "text": "Super cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.391,
    "end": 2715.643,
    "text": "And now if we had trust the protocol, instead of a fixed rule simulator, we take this like emergent kind of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2717.412,
    "end": 2721.637,
    "text": " And I tried to write the paper using kind of this actor approach, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2721.958,
    "end": 2723.62,
    "text": "I did my best.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.72,
    "end": 2727.825,
    "text": "And then I was like, Hey, before I submit to this conference, I've never written an academic paper before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.365,
    "end": 2729.467,
    "text": "Don't have a PhD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.288,
    "end": 2731.369,
    "text": "Totally intimidated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.409,
    "end": 2732.31,
    "text": "Help me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.61,
    "end": 2732.991,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.011,
    "end": 2733.211,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.231,
    "end": 2735.214,
    "text": "Then I said, please critique it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.714,
    "end": 2736.075,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.095,
    "end": 2736.836,
    "text": "You know how to improve it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.036,
    "end": 2746.948,
    "text": "And I tried to go through that multi-actor approach to using LLM, which again, I think is incredibly valuable, blah, blah, blah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.988,
    "end": 2747.048,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.382,
    "end": 2773.002,
    "text": " then i sent it to lance right someone who actually does um who i trust deeply right there's no better person other than carl i can think of right um and maybe ready right so i he took a look at the paper and immediately he's like it's missing boom boom boom he's like you should try asking chat gpt for help not knowing that i was using cloud like the whole time and like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.37,
    "end": 2785.694,
    "text": " It was really interesting for me to see that despite using that multi-actor approach, none of the things that Lance pointed out did I get feedback from those multi-actors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.058,
    "end": 2791.024,
    "text": "And I think that's, how do you benchmark that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.527,
    "end": 2794.152,
    "text": " Yeah, that's awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.352,
    "end": 2808.797,
    "text": "One thought, and I've seen this also come up many, many times is like, even when a character or a persona prompt layer is added, so it's like, okay, you're an engineer or you're a product designer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.058,
    "end": 2816.691,
    "text": "So it's kind of preempting trying to warm up or put these general purpose models into character.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.671,
    "end": 2828.327,
    "text": " In some sense, the response that gets pinged back is always going to have been like washed or brought back towards the center of gravity of this model that was trained on prior text.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.888,
    "end": 2840.804,
    "text": "And so sometimes it's like if somebody has three authentic ideas, one, two, three, and then they ask for it to be upgraded and it looks on a first pass like the professionalism has been brought up greatly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.824,
    "end": 2845.53,
    "text": "But at this point, we all know that we can get those",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.219,
    "end": 2872.615,
    "text": " kinds of responses looking professional back rapidly and maybe it converges to common idea three four five and if they had just sent the authentic one two three with the typos and all it's like we know that it could have we could have added more and then also um seeing what isn't there is very different than just augmenting what is there um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.708,
    "end": 2896.442,
    "text": " read a question from the chat on this theme a little bit okay reconfigurability trainer wrote what are your expectations on how legacy enterprise architecture will have to change to adapt to ai how much it change do firms have control over versus locked in by service providers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2896.608,
    "end": 2918.329,
    "text": " yeah i think this is the is like a critical critical point of what i'm interested in with this presentation today is there's okay there's two layers to this the first is a ton of working decades long investment in infrastructure already exists so the idea that you're going to take",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.512,
    "end": 2933.128,
    "text": " decades worth of PDFs and data and dump it all into a vector database and do your prompt engineering and fine tuning and use that instead of all these systems and investment that work, that's just insane to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.768,
    "end": 2934.329,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.689,
    "end": 2944.84,
    "text": "Until we can show that Google can know that 27 degrees is below 32 degrees,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.904,
    "end": 2970.321,
    "text": " right like these are not trusted systems they're probabilistic systems and the the amount of cost is just you know outstanding uh astounding sorry numbers and so the idea and i know it's like people want to learn these skills you get a big k jump if you have like lane chain and vector db and you're you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.229,
    "end": 2975.034,
    "text": " And everyone's starting from scratch, so you can become an expert quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2976.917,
    "end": 2980.001,
    "text": "But there's already a ton of infrastructure that works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.301,
    "end": 2989.834,
    "text": "And so rather than fire hosing everything through AI, how do you control what is AI and what is not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.255,
    "end": 2991.837,
    "text": "How does even the business",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2992.019,
    "end": 2999.962,
    "text": " team decide what specific data is going to be good and useful and have an ROI to use that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.062,
    "end": 3002.67,
    "text": "It just feels like a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.562,
    "end": 3017.365,
    "text": " It feels like businesses feel so much pressure to adopt this, that the C-level has so much pressure to show to shareholders, here's how we are going to have competitive edge and we're going to be a leader and adopt AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.766,
    "end": 3021.632,
    "text": "They haven't first really thought through some of these questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.672,
    "end": 3027.342,
    "text": "And so I think that leveraging existing infrastructure is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.862,
    "end": 3032.729,
    "text": " The number one thing companies can do is just like avoid AI when possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.009,
    "end": 3033.249,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.79,
    "end": 3051.094,
    "text": "But there are things that AI can do that deterministic systems can't, which leads me to the other side of the coin here, which is I've been in organizations that have massive means like a million dollars a year in like these data catalog and data management systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.154,
    "end": 3057.463,
    "text": "And like you talk to the business leaders or the BI leaders and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.945,
    "end": 3063.051,
    "text": " and the data teams, and they're not even understanding each other, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.091,
    "end": 3065.414,
    "text": "The business people say, oh, do this, it seems so basic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.835,
    "end": 3069.36,
    "text": "And then the data teams, they do all this stuff and it's not matching expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3070.261,
    "end": 3074.407,
    "text": "And the data teams are like, we're not mind readers for what the business wants, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.868,
    "end": 3080.716,
    "text": "And so the problem there is that the existing infrastructure doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.76,
    "end": 3085.763,
    "text": "That's where I think AI can shine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.013,
    "end": 3098.308,
    "text": " That's where I think AI actually has an incredible advantage around when you have all this inefficiency in getting people to collaborate on IT infrastructure, which is deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.47,
    "end": 3108.401,
    "text": "That's where I think an LLM or something can unify people on language and approaches and intent, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.762,
    "end": 3113.067,
    "text": "So I think that's a really important question that you just highlighted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.595,
    "end": 3122.93,
    "text": " I think these are some key issues that are to live with, not to defeat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3122.95,
    "end": 3131.207,
    "text": "If we equate determinism with safety and probabilistic with danger, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.233,
    "end": 3134.496,
    "text": " we're not even going to get out of bed in the morning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3134.716,
    "end": 3140.123,
    "text": "Like in cognitive security, we have one joke that the safest airport is a parking lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3140.643,
    "end": 3156.062,
    "text": "You're not going to have any issues with the airplanes there, but the surfaces and the processes that are being actually done, they can't be deterministically known ahead of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.084,
    "end": 3158.085,
    "text": "Little motifs can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.105,
    "end": 3160.688,
    "text": "And so obviously again, low hanging fruit,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.668,
    "end": 3165.259,
    "text": " But then understanding everything is a threshold of tolerance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.279,
    "end": 3173.62,
    "text": "There's always a probabilistic element to safety in the real soft and fuzzy world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3174.442,
    "end": 3178.592,
    "text": "And so understanding how all of these...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3178.859,
    "end": 3194.218,
    "text": " difference um on one hand like constraints and strictures and formal language like what is reasonable and all of this what is risky and then on the other hand that the the experiences in the actual like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.582,
    "end": 3223.767,
    "text": " what cognitive science is pointing at yes people talk about affordances and umvelts and all these different aspects that help us study across different systems but like just taking into people's day-to-days experiences and what is um how do we even accurately evaluate whether something is too risky or not or what these trade-offs are and um it's hard to have situational awareness it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3224.084,
    "end": 3235.679,
    "text": " I'm sure even without knowing at the enterprise scale, because it is like mapping intents, preferences, what capacities and all these different features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.42,
    "end": 3246.313,
    "text": "Again, the kinds of things that in cognitive science and active inference we work on with the models, those are features in the world too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.314,
    "end": 3253.602,
    "text": "And then how do we even know like where, when, how, what if, and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.932,
    "end": 3282.88,
    "text": " it seems like now is the time to be exploring in those directions yeah yeah and and we're almost at a at a time so i just want to throw out there i want i'm going to comment on that in a second but just before i forget um thank you all for anyone who's who's uh shared your time with me today um i definitely am looking to connect with people in the active inference community whether",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.231,
    "end": 3298.953,
    "text": " It's just to say, hello, if I want to meet people, I want to learn, or if you're interested in, we're looking for a case study partner to basically try out the trusted protocol to this talk has now led to some conversations with investors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.034,
    "end": 3305.623,
    "text": "So if you want to connect, please connect because I'm really excited about this, these problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.224,
    "end": 3309.829,
    "text": "And I would like to kind of leave on a, on a note,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3310.585,
    "end": 3321.024,
    "text": " around systems and what you alluded to, like this real-world emergent kind of situation we have in enterprises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.006,
    "end": 3324.33,
    "text": "There was a Santa Fe Institute talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.451,
    "end": 3325.593,
    "text": "I don't know why I like ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.853,
    "end": 3327.396,
    "text": "I like ants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.967,
    "end": 3337.24,
    "text": " So they were talking about the efficiencies of colonies and how well they can adapt and learn and solve problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.781,
    "end": 3344.291,
    "text": "And the one thing that struck me, the scientist's entire research came down to this one line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.471,
    "end": 3354.345,
    "text": "And she said, the density of feedback loops in a system directly correlate to how quickly it can adapt and learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.237,
    "end": 3377.825,
    "text": " And so the reason that this protocol is called the trust loop protocol is because it's really a UX kind of interface via just an API to get that feedback across various systems between probabilistic and deterministic and blend them together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.305,
    "end": 3381.369,
    "text": "And yeah, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.389,
    "end": 3384.653,
    "text": "Is there anything else, Daniel, or how do you feel about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.962,
    "end": 3415.602,
    "text": " could make many comments on on ants i'm i'm um what comes to mind is um over the decades of ants research um people are trying to understand like how do on every continent except of course ironically antarctica how do these collective behavioral strategies work in all these different niches with different regularities so those are kind of like different business operating environments or like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3415.582,
    "end": 3428.798,
    "text": " market conditions or something like that and so and there can be multiple species different strategies in the same niche so people have tried to apply all kinds of different approaches and famously eo wilson",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.554,
    "end": 3433.003,
    "text": " promoted the caste ergonomic hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.524,
    "end": 3446.938,
    "text": "The idea that something like an Adam Smith 1776 type story, like free market in the colony, colonies that are better from this economic perspective, are...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3446.918,
    "end": 3474.192,
    "text": " maximizing the amount of income food you know and outcome reproductively per unit of biomass so that's one view um and that relates like optimal foraging a lot of other concepts and then as a contrasting voice to that sort of economic optimization researchers like my phd advisor deborah gordon highlighted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3475.1,
    "end": 3489.177,
    "text": " some things like you mentioned, such as the rate and the frequency of interactions, the types of interactions and learning and developmental trajectories, those capacities and those patterns",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.135,
    "end": 3517.83,
    "text": " can dominate such that whatever the economics are they sort of are however they end up but they're being driven by these micro level interactions and so it's like i when thinking about businesses or other epistemic environments um just how two people can look at the same colony you know same institute same company whatever it happens to be and both",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.468,
    "end": 3543.362,
    "text": " its viability economically can be seen from that like macroeconomic perspective otherwise it's not going to persist but also the the micro interactions are the i mean if if um if there's a great foraging plan but the pheromone evaporates too rapidly then it's not gonna work and so it's like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3543.882,
    "end": 3564.54,
    "text": " where are we at with digital cognitive or knowledge work or information spaces which is largely what we're talking about including how those are propagating into physical spaces logistics and supply and all these different areas physical spaces that have the information space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.33,
    "end": 3578.884,
    "text": " influencing them and then what are going to be the sort of macro structural properties of the system that no nestmate could could grapple with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.539,
    "end": 3599.396,
    "text": " And then how is that going to relate to the first person considerations like accessibility, felt sense of trust, cognitive overhead, and kind of like if those can connect, then there will be at least local harmony and success.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3600.617,
    "end": 3609.124,
    "text": "But there's way more ways for those not to connect, way more unsuccessful collective behavioral strategies than successful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.678,
    "end": 3616.127,
    "text": " And so in the digital space where there's almost total degrees of freedom of design,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3617.339,
    "end": 3620.924,
    "text": " what does that interface look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.944,
    "end": 3622.707,
    "text": "And you're approaching it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.388,
    "end": 3624.93,
    "text": "And also, what is that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3625.01,
    "end": 3628.776,
    "text": "It's like interfaces all the way down, markup blankets all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3628.836,
    "end": 3635.265,
    "text": "What is that interface between the business intelligence and the API call?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.325,
    "end": 3637.709,
    "text": "Like all these different connectors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3638.83,
    "end": 3642.756,
    "text": "But if even one critical one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3643.9,
    "end": 3667.495,
    "text": " is not how it needs to be or not as functional as it could be that's what Improvement should seek to Target and what proactive design should seek to prevent hopefully we'll see this is also new but I'm hoping if we can get a good case study",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.318,
    "end": 3682.575,
    "text": " then we should be able to quantify some of these benchmarks around connectivity through interfaces, through different systems, across tasks, various models, between deterministic and probabilistic rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.795,
    "end": 3684.798,
    "text": "That's my next step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.958,
    "end": 3687.361,
    "text": "I hope we can come up with some empirical evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.143,
    "end": 3691.506,
    "text": "What zone would the case study be?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3691.526,
    "end": 3693.488,
    "text": "And then how can people contact you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.289,
    "end": 3695.811,
    "text": "Oh, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.162,
    "end": 3699.526,
    "text": " My email address is Ron at Ron edelman.com.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.348,
    "end": 3715.287,
    "text": "Um, uh, and the, the zone, I don't know, like talking to the head of a hospital for one possible case study, um, a couple of incubators, uh, food industry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.427,
    "end": 3716.028,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.088,
    "end": 3722.036,
    "text": "Like there's all kinds of conversations until someone actually signs an agreement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.417,
    "end": 3722.777,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.618,
    "end": 3728.604,
    "text": " Who knows, nothing may come out of it, but I do think we have a compelling approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3728.905,
    "end": 3731.408,
    "text": "I think this is a really hard, expensive problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.309,
    "end": 3745.846,
    "text": "And if we can find someone who's willing to give us a chance just to like demonstrate as, as, you know, I guess, I understand it's an N of one, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.187,
    "end": 3748.95,
    "text": "But if we can demonstrate, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.078,
    "end": 3754.569,
    "text": " that we can show the, I wanna use your language, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.251,
    "end": 3768.222,
    "text": "The act itself of making these connections across various interfaces, just doing that can add value, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.64,
    "end": 3771.285,
    "text": " The digital equivalent of pheromones, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.585,
    "end": 3777.697,
    "text": "But that's, that's effectively what we're calling these cognitive auditable cognitive trails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.158,
    "end": 3789.458,
    "text": "It's just meant to say like, we're leaving these little pheromone drops, creating a data set that then can be handed over to a data science team to analyze and hopefully come up with insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.24,
    "end": 3791.442,
    "text": "Um, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.923,
    "end": 3804.03,
    "text": " epic okay good luck ron thank you to all the live chatters thank you for presenting and looking forward to learning more thank you so much everyone bye",
    "speaker": "SPEAKER_01"
  }
]