[
  {
    "start": 7.759,
    "end": 22.084,
    "text": " hello and welcome everyone this is active inference guest stream number 66.1 on december 6 2023 today we are very excited and honored to have a presentation and discussion with adrian bajan",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.186,
    "end": 27.908,
    "text": " First in this session, Susan Hasty is going to provide some slides and context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.508,
    "end": 32.529,
    "text": "Adrian will provide a talk and we'll have a discussion on through the hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.969,
    "end": 35.83,
    "text": "And then Susan and I will stay on the live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.91,
    "end": 39.552,
    "text": "So if you have any comments or questions, please feel free to write them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.832,
    "end": 43.333,
    "text": "So thank you both for joining and Susan to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.334,
    "end": 46.154,
    "text": "Thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 48.684,
    "end": 56.927,
    "text": " and I'm so excited, and thank you so much for affording this opportunity, Dr. Bajang.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.467,
    "end": 60.468,
    "text": "I thought that we would actually begin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 60.488,
    "end": 76.134,
    "text": "I wanted to introduce you, and as I was thinking about it, I could spend probably the entire time just going over all the citations and awards that you've received, and so I thought, though, that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.604,
    "end": 84.705,
    "text": " What I really wanted to share was something that is not necessarily in the public domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.426,
    "end": 103.789,
    "text": "I wanted to really dig into the significance of the Constructal Law and the difference it's made not only for, I think, the world, which most people don't appreciate, I think, and also the significance it's made for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.059,
    "end": 109.612,
    "text": " It's definitely changing paradigms across the globe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 112.489,
    "end": 119.272,
    "text": " This, of course, is Adrian's many publications and his many citations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 119.752,
    "end": 127.135,
    "text": "I think there's 90,000 citations of his work alone to date.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 127.615,
    "end": 140.78,
    "text": "But what I'd like for the audience to really take away is really thinking about life in a new paradigm and how the Constructo Law can inform us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 141.72,
    "end": 153.871,
    "text": " of how I think about a difference in not only just what is life, but also what is power and what is evolution and change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.572,
    "end": 164.581,
    "text": "And I'll give you a good example of where we will talk about a flow paradigm or flow architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.621,
    "end": 166.703,
    "text": "And in thinking about architecture,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.697,
    "end": 178.962,
    "text": " one idea that still permeates society and I think holds back progress is how we think about hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.382,
    "end": 186.045,
    "text": "And Adrian's books has definitely informed me to think very differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.065,
    "end": 191.088,
    "text": "You know, we still think about hierarchy like we built them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 192.103,
    "end": 196.907,
    "text": " in pyramids 4,500 years ago, you know, where we housed dead people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.069,
    "end": 204.935,
    "text": "And so this actually has the potential to change that and to really think differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.276,
    "end": 217.906,
    "text": "One thing that a lot of people don't realize is that scientists from around the globe have been coming together for over 14 years annually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.149,
    "end": 228.032,
    "text": " and presenting their findings and how they've taken this and spread it into every domain imaginable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.032,
    "end": 235.394,
    "text": "This was actually a doctor, Dr. Lucia, who I believe is in Italy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.934,
    "end": 248.077,
    "text": "He shared with me just last night in talking about it and how he's actually taken the constructal law and made innovations in research in cancer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.429,
    "end": 267.103,
    "text": " And I thought his quote was just so powerful in terms of how we think differently about reality by really understanding and going very deep and contemplating how the Constructor Law is so significant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.105,
    "end": 279.013,
    "text": "This actually, what I think is, what I've discovered and uncovered",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 280.24,
    "end": 307.203,
    "text": " is that it's actually spread far beyond the halls of academia, and I'm going to make a bold prediction because we're going to be talking about predictions, and I'm going to predict that Dr. Bajan will be awarded the Nobel Prize because it's not just the citations of his work, but when we look at and you go deep, you're going to find",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.998,
    "end": 312.982,
    "text": " that people are using the Constructal Law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.042,
    "end": 322.63,
    "text": "For example, this one academic paper has already had many, many citations in and of itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.911,
    "end": 329.296,
    "text": "It's being talked about in terms of religion and in terms of indigenous societies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.856,
    "end": 335.841,
    "text": "It's impacted architectures in how airports and how structures are being made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.001,
    "end": 351.348,
    "text": " And for me personally, I'm not coming out of academia, but reading it and understanding the Constructal Law really has given me an incredible awe and appreciation for science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.468,
    "end": 355.409,
    "text": "It's actually given me a new appreciation for life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 356.29,
    "end": 359.932,
    "text": "And so here's just a few of the ways that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 361.354,
    "end": 376.652,
    "text": " that chat gtp just put together here is how it's already spawned new ways of thinking about every area of of of application and innovation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.991,
    "end": 388.636,
    "text": " And so what we're going to be talking about today is really focused on Adrian's books that are accessible to people like me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 388.656,
    "end": 401.662,
    "text": "I mean, I would not have been able to dig into the many, many publications and receive the depth of understanding of it without reading these books.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.762,
    "end": 403.263,
    "text": "And I actually called them...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.02,
    "end": 418.024,
    "text": " the essence of strategic thinking because when we think about prediction, we are thinking about how we're strategically going to move forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.564,
    "end": 427.628,
    "text": "So today we're going to focus on the physics of life and Adrian has agreed to give us another chance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.089,
    "end": 435.252,
    "text": "So we may not be able to cover all the many questions that have come through our forum, but we will be digging into them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.265,
    "end": 447.512,
    "text": " After after after we'll dig into some of them that come in on the chat today and and then we will also be exploring them in a future in future sessions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.552,
    "end": 451.374,
    "text": "So so with that, I'll turn it over to you, Adrian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.674,
    "end": 459.439,
    "text": "And and I look forward to this and I hope the audience really enjoys this and is inspired as I've been.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 476.085,
    "end": 483.731,
    "text": " Thank you, Susan and Daniel, for the invitation to speak to your audience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 484.492,
    "end": 488.174,
    "text": "Of course, I'm very grateful and humbled by the introduction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 488.194,
    "end": 490.516,
    "text": "I saw that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 493.496,
    "end": 501.101,
    "text": " In order to get the discussion going, it would help if I show you a few concepts, black on white.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 501.121,
    "end": 513.869,
    "text": "The slides I happen to have at my disposal are from a very brief lecture I gave at the 13th Constructed Law Conference in Turin, Italy, just two months ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 515.31,
    "end": 519.632,
    "text": "It was a lecture about vascular flow structures, but the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 521.133,
    "end": 526.176,
    "text": " The myth of the presentation is about how to predict the design evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 527.377,
    "end": 536.043,
    "text": "Vascular is in fact a good title for the subject that interests your audience, namely how the brain works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 536.983,
    "end": 541.206,
    "text": "The brain is eminently a vascular architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 541.746,
    "end": 548.831,
    "text": "It is predictable from the constructor law in many ways, in many respects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 551.568,
    "end": 574.001,
    "text": " okay and so i um i start my presentation first of all with the definition of the meaning the meaning of the words i am i'm a professor meaning i teach students to how to think and how to question themselves and how to display humility humility when hearing ideas",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 575.641,
    "end": 585.004,
    "text": " And so the meaning of the word vascular from Latin is something that looks like vessels conveying blood or lymph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 585.844,
    "end": 598.147,
    "text": "This is a design, an architecture that speaks of flow, which means movement, and hierarchy, which as you'll see very soon is one kind of drawing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 598.983,
    "end": 605.248,
    "text": " And now, the word design should not scare anybody who is in love with science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.688,
    "end": 608.651,
    "text": "Design is poo-pooed in physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 610.252,
    "end": 613.654,
    "text": "It shouldn't be because it really means drawing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 614.875,
    "end": 617.377,
    "text": "It came into English from French, dessin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 618.578,
    "end": 621.06,
    "text": "The French got it from the Italians, disegno.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 621.581,
    "end": 625.764,
    "text": "It really means a sign, an image that conveys a message.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 626.5,
    "end": 645.05,
    "text": " And here I just juxtaposed two versions of the same drawing, the river delta and the human lung, to drive the point that the drawing unites the animate with the inanimate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.391,
    "end": 649.153,
    "text": "And when the drawing does that, it means that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 650.169,
    "end": 661.454,
    "text": " The phenomenon that the drawing represents belongs to nature, not to a particular compartment in science or a particular department on the university campus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 662.834,
    "end": 665.755,
    "text": "The drawing unites.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 667.136,
    "end": 671.518,
    "text": "If there is one single message from my introduction here, it is that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 672.658,
    "end": 679.521,
    "text": "Another thing about what I'm showing you is that natural things are physical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 680.433,
    "end": 708.006,
    "text": " physical they are observable visible palpable measurable and movable they are common sense they are not jargon i speak of drawings of architecture of images natural things have configuration shape structure rhythm they have flow and and their their mother is the fact that they have freedom to change that means they have freedom to evolve",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 712.614,
    "end": 719.016,
    "text": " The freedom to evolve comes from the fact that these things are moving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 719.036,
    "end": 726.278,
    "text": "They are moving because they are set in motion by flow architectures that function as engines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 727.418,
    "end": 730.979,
    "text": "Most of these engines are natural.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 731.499,
    "end": 733.4,
    "text": "Only a few of them are human-made.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 734.463,
    "end": 742.592,
    "text": " In any case, every single such engine is driven by one kind of energy source.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 742.652,
    "end": 746.237,
    "text": "You can think about the sun driving the movement of the atmosphere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 746.257,
    "end": 750.441,
    "text": "The atmosphere is a globe-sized engine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 751.082,
    "end": 755.147,
    "text": "The engine produces power, and the power drives movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.557,
    "end": 780.431,
    "text": " and well the movement is the source of another phenomenon which is called dissipation or friction because the mover has to get the environment out of the out of the way the environment the niche does not get out of the way unless it is pushed and in the rectangular box i show the engine",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.307,
    "end": 795.713,
    "text": " driven by an energy source, the work or power produced by the engine, and then the fact that in the green breaks or interfaces between mover and environment are dissipating the power.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 796.353,
    "end": 806.877,
    "text": "So if you sum up these white fat arrows, the energy input from the energy source is dumped 100% into the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 807.318,
    "end": 808.258,
    "text": "But in the meantime,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 809.096,
    "end": 832.771,
    "text": " inside the box because of flow architecture something was moved from one spot one place to another that phenomenon is called locomotion it could be animal it could be vehicular it could be well uh we should have a current and all the other things we we know about so the bottom line is that um nature is movement with flow architecture",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 833.431,
    "end": 842.356,
    "text": " that really unites the geophysical with the biological, with the social organization, which is emotion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 843.256,
    "end": 845.258,
    "text": "These are images that change over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.778,
    "end": 847.159,
    "text": "They are not still art.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 847.639,
    "end": 858.685,
    "text": "You can think of them as movies, many, many movies running at the same time, but every single one having the same plot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 859.392,
    "end": 865.453,
    "text": " The plot is that the movie has direction, meaning the changes have a directionality to them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 866.273,
    "end": 867.954,
    "text": "And I recognize this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 868.994,
    "end": 872.655,
    "text": "Published it first in 1996 several times then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 872.675,
    "end": 876.155,
    "text": "It's called The Constructed Law of Evolution in Nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.175,
    "end": 883.357,
    "text": "Or meaning the announcement that, hey, listen, it's the design in nature, stupid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.677,
    "end": 889.038,
    "text": "It's been overlooked everywhere, physics, thermodynamics, but not in engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 889.935,
    "end": 891.756,
    "text": " which is my background.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 893.117,
    "end": 898.659,
    "text": "So I wrote that for a flow system to persist in time, and that's the definition of the life state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 899.479,
    "end": 902.981,
    "text": "It must evolve with freedom such that it provides greater access.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 903.901,
    "end": 910.564,
    "text": "I illustrate that with three drawings from the evolution of a river basin on the floor of a laboratory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 911.545,
    "end": 918.748,
    "text": "From time to time, the architecture flows more and more easily because of erosion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 920.815,
    "end": 928.58,
    "text": " But at every point in time, the river basin is a tree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 930.421,
    "end": 941.087,
    "text": "The Constructor Law announces, probably screaming from the rooftops, that there is a direction of nature that points toward the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 941.107,
    "end": 948.972,
    "text": "If you know this statement, if you run it through the wheels of your mind,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 949.696,
    "end": 953.699,
    "text": " you have the ability to anticipate the so-called future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 953.719,
    "end": 968.028,
    "text": "To continue, again, because I teach the importance of knowing the meaning of the words and the importance of using common sense terminology, here is what we mean by evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 968.088,
    "end": 971.81,
    "text": "It is a sequence of changes in flow configuration and time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 972.471,
    "end": 977.474,
    "text": "Freedom is not some intangible, it is an actual physical thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 978.506,
    "end": 983.41,
    "text": " features that allow a system to change, and freedom can be measured.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 984.571,
    "end": 993.719,
    "text": "In design, freedom is measured in terms of the number of degrees of freedom, the number of ways in which you can change something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 994.784,
    "end": 1008.011,
    "text": " Freedom can also be measured in terms of the effect of increasing this number of degrees of freedom has on the performance, on the ability of the mover to move more easily.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.655,
    "end": 1015.482,
    "text": " You can think of it as straitjacketing the flow of a river.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1015.962,
    "end": 1028.295,
    "text": "Well, that river will flow less fast, meaning slower, and not as far as a river that's not straitjacketed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1029.055,
    "end": 1039.54,
    "text": " In fact, the river that's straitjacketed has a personality of its own to revolt and remove the obstacles out of the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1040.08,
    "end": 1049.984,
    "text": "The fallen tree log, the levees at New Orleans, the history of Earth is that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.084,
    "end": 1056.287,
    "text": "It is about removing obstacles in order to secure greater freedom for what moves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1057.191,
    "end": 1069.157,
    "text": " And this evolutionary design, as I just illustrated, facilitates access, access to flow and areas, volumes, and that, of course, includes society.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1070.117,
    "end": 1076.82,
    "text": "Now, access, I checked the dictionary, although I shouldn't have to because I come from a Latin-based language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1077.38,
    "end": 1080.682,
    "text": "It means the action of coming toward or near something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1080.782,
    "end": 1085.184,
    "text": "It comes from accessus accedere in Latin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1086.119,
    "end": 1088.221,
    "text": " It is a word available in English.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1089.061,
    "end": 1097.308,
    "text": "And this movement naturally, by itself, untouched, tends toward an architecture that's multiscale,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1098.195,
    "end": 1121.123,
    "text": " uh it's called hierarchy uh or arborescent if you will um it is a drawing um that distinguishes itself through a few large channels uh cohabitating with many small channels in fact they're moving the same stuff and they're moving it in harmony the few are not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1122.152,
    "end": 1123.233,
    "text": " exploiting the many.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1124.293,
    "end": 1128.936,
    "text": "The many are not revolting against the few.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1129.316,
    "end": 1136.02,
    "text": "They're all flowing together in order to facilitate flow over the entire available space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1136.5,
    "end": 1140.663,
    "text": "And this configuration springs out of nowhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1140.683,
    "end": 1142.564,
    "text": "It is nature itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1144.503,
    "end": 1149.184,
    "text": " My beginning in this line of thinking was actually before 1996.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1149.484,
    "end": 1159.227,
    "text": "The problem that got my publishing going is here in the left-hand corner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1159.807,
    "end": 1165.328,
    "text": "It was the question of how to shape a rectangular space that generates heat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1165.891,
    "end": 1173.713,
    "text": " how to shape it so that the generated heat current exits with the greatest ease.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1173.873,
    "end": 1187.016,
    "text": "That means it is rejected by a rectangle that is the least hot, meaning with the smallest temperature difference between itself and the ambient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1187.814,
    "end": 1212.792,
    "text": " and in other words i gave myself one degree of freedom which is the shape of the rectangle a shape that varied from square to shallow rectangle the answer to my question was the uh the the rectangle in the in the middle which is not too shallow not too square um but that was the click because from freedom to change something i discovered one drawing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1213.459,
    "end": 1222.044,
    "text": " Before this exercise, when I posed the problem of how to shape it, not knowing the answer, I did not have a drawing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1222.714,
    "end": 1228.479,
    "text": " And you see, in predicting evolution, the thinking begins with a blank page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1229.12,
    "end": 1237.467,
    "text": "It is the most honest kind of beginning, meaning the least biased way in which to start posing questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1239.309,
    "end": 1244.854,
    "text": "That beginning has a chapter with a blank page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1244.874,
    "end": 1247.657,
    "text": "The chapter is called, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1248.057,
    "end": 1248.918,
    "text": "You see, I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1249.736,
    "end": 1252.939,
    "text": " But I discovered this, and the rest is history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1253.159,
    "end": 1267.031,
    "text": "In the year 2000, I wrote the first full-length book about the multitude of examples of this type, ranging from geophysics, river basins, lightning and everything, snowflakes,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1268.317,
    "end": 1280.792,
    "text": " to physiology breathing blood circulation ejaculation all these things are in uh in um in accord with um with the constructor law",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1283.057,
    "end": 1287.399,
    "text": " And then, since then, I've shown a few other things that I will illustrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.459,
    "end": 1299.126,
    "text": "But the most important message from this beginning is that in science, quite often, the first question is overlooked.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1299.706,
    "end": 1302.848,
    "text": "And the first question should be, what is the phenomenon?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.148,
    "end": 1306.069,
    "text": "Meaning, what are we talking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1306.85,
    "end": 1310.772,
    "text": "And in the case of design and nature, the phenomenon",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.716,
    "end": 1334.905,
    "text": " is meaning the elephant in the uh in the room is the evolution of flow configuration it could be the room it could be the field or or the ocean in other words ocean in other words nature itself so um that phenomenon is change with direction uh also known as uh uh the passing of time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.872,
    "end": 1347.819,
    "text": " Now, getting closer to the subject of interest, these hierarchical architectures can be simple or complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.879,
    "end": 1352.162,
    "text": "Here I have two drawings of the same kind of flow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1352.262,
    "end": 1357.125,
    "text": "It is a flow that connects one point with many, many points on a circle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1359.287,
    "end": 1364.67,
    "text": "In the first disk design on the left,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1366.901,
    "end": 1372.282,
    "text": " The maker of the design had a very large number of degrees of freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1372.302,
    "end": 1383.805,
    "text": "They are called L and Phi and Gamma and Beta and X. Look, and that took three years to do in the course of a doctoral thesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1384.686,
    "end": 1385.926,
    "text": "It's called the perfect design.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1386.844,
    "end": 1413.122,
    "text": " and then on the right one example that was done a lot faster by um by recognizing very few degrees of freedom called capital l and on the next slide the performance of these two designs the perfect shown as a black dot and the uh cheaper one uh with the white squares",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1414.248,
    "end": 1424.075,
    "text": " That performance plotted with this lowercase f, which is a number proportional to the flow resistance between the center and the perimeter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1425.676,
    "end": 1435.923,
    "text": "And on the abscissa, this capital N is the number of points on the perimeter, which means that migrating to the right, the design is more complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1437.378,
    "end": 1449.965,
    "text": " You see here that the two drawings may look different, even though they are both point-to-circle trees, but their performance is quite similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1449.985,
    "end": 1452.326,
    "text": "In other words, a simpler and cheaper design will do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1453.206,
    "end": 1456.188,
    "text": "In other words, the maker of the design does not waste time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1465.486,
    "end": 1475.574,
    "text": " The maker of design is wiser than the one that gilds the lily, you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1477.415,
    "end": 1491.526,
    "text": "And that leads to another way to organize the presentation, which is that if you polish something ad infinitum, you are not creating nothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1492.182,
    "end": 1494.184,
    "text": " So, perfection is the enemy of evolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1494.224,
    "end": 1497.886,
    "text": "This is a dictum from Voltaire originally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1497.906,
    "end": 1502.65,
    "text": "It happens to be true from the point of view of the Constructor Law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1503.77,
    "end": 1517.28,
    "text": "In fact, I discovered it, but I also discovered the first discoverer, in this case Voltaire, because I'm a fan of the history of good ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1518.124,
    "end": 1525.389,
    "text": " And here's how the enemy of evolution, if you know it, benefits us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1526.349,
    "end": 1531.113,
    "text": "The movement of people on the surface of the Earth is hierarchical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1531.713,
    "end": 1537.036,
    "text": "We don't move around tracing the grid on the surface of the city.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1537.537,
    "end": 1543.02,
    "text": "We congregate, we gather, we collect ourselves to one point of attraction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1545.454,
    "end": 1548.038,
    "text": " Use your imagination, you know, public square.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1548.058,
    "end": 1557.19,
    "text": "And then at the end of the event, we migrate outward to the area as a circular river delta.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.21,
    "end": 1561.256,
    "text": "And in so doing, we organize our society hierarchically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1562.271,
    "end": 1584.791,
    "text": " uh here's an even better example of how it is going because you see in the previous drawing which is the simplest possible this city block does not show the smallest alleys and the cul-de-sacs and the the lawns across which people walk but here in the drawing of the atlanta airport",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1585.701,
    "end": 1611.486,
    "text": " uh we see the walking this is on the left side vertically along the concourses um the uh the vehicle there's only one train shown as a black line um the by the way once again uh the the slow and the fast are carrying every the same the same flow meaning the same crowd of people access is provided from any gate to any other gate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1612.271,
    "end": 1622.615,
    "text": " And the figure of merit or the performance of the whole, I'm talking about the whole flow system, which is rectangular, can be measured in several ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1622.915,
    "end": 1628.978,
    "text": "One of them is the average travel time between one gate and all the other gates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1629.598,
    "end": 1630.739,
    "text": "So keep that in mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.099,
    "end": 1633.34,
    "text": "Travel time averaged over the area.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1633.44,
    "end": 1635.861,
    "text": "That's the measure of performance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1637.041,
    "end": 1641.503,
    "text": "The movement is with two speeds, fast along the train.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1642.536,
    "end": 1663.27,
    "text": " uh slower perpendicular to the train any one of us is this capital letter q and um and the territory is uh has a is has a fixed size because area costs money but a variable shape a variable ratio of h divided by l",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1664.537,
    "end": 1674.359,
    "text": " It is possible to show, almost on the back of an envelope, how the average travel time depends on the shape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1675.339,
    "end": 1679.52,
    "text": "Time is on the ordinate, the shape is on the abscissa.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1680.44,
    "end": 1687.741,
    "text": "And you see here a bucket-shaped curve, which is a minimum, shown as an empty circle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1689.041,
    "end": 1693.582,
    "text": "The shape at that location is called H divided by L optimum.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1695.035,
    "end": 1698.697,
    "text": " and the time is minimum in that particular design.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1699.197,
    "end": 1724.128,
    "text": "The discovery, meaning to put physics at the disposal of all that, is that a little bit of imperfection, meaning travel time that's just slightly longer than the smallest imaginable, gives the designer a significant bandwidth of freedom",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1724.827,
    "end": 1733.75,
    "text": " Freedom to choose a shape that's comparable with the mathematically best shape, but not exactly the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1734.931,
    "end": 1750.556,
    "text": "In fact, the person who is endowed with this kind of secret will not spend time on finessing this particular sculpture to the point of identifying the absolute best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1751.212,
    "end": 1763.262,
    "text": " So, imperfection or the freedom of choosing and then moving on is the mother of diversity in nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1763.543,
    "end": 1773.011,
    "text": "Diversity happens from this freedom not to fall in love with the absolute best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1774.04,
    "end": 1799.754,
    "text": " and there are people in several domains including biology who would talk about nature makes makes mistakes no nature doesn't make mistakes nature simply doesn't have time to to focus on on finessing itself what works is kept that is the slogan that i think comes closer to how nature works",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1801.688,
    "end": 1815.514,
    "text": " One aspect of movement, geophysical, biological, and also human, is the so-called logistics S-curve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1817.275,
    "end": 1824.478,
    "text": "Anything that spreads freely on an area or in a volume, it spreads not only in space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1824.558,
    "end": 1830.861,
    "text": "You can imagine the milk spilled on the kitchen floor, it spreads in time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1831.79,
    "end": 1845.419,
    "text": " And the invaded territory, which in these rising curves is indicated in the vertical direction, this invaded territory grows in S curve fashion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1845.84,
    "end": 1849.222,
    "text": "It grows slow, fast, slow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1850.053,
    "end": 1855.814,
    "text": " And the reason for that, by the way, here are a few more examples that are relevant to what I'm going to show you next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1856.735,
    "end": 1858.235,
    "text": "These are actual measurements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1858.435,
    "end": 1860.616,
    "text": "Every single curve is an S curve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1861.156,
    "end": 1866.837,
    "text": "On the left is the power production in the United States as an S curve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1868.417,
    "end": 1870.858,
    "text": "That is up to 10 years ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.878,
    "end": 1879.12,
    "text": "On the right are the total miles driven in the US per year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1879.884,
    "end": 1886.128,
    "text": " And at the very bottom are the movers themselves, meaning the world population.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1886.648,
    "end": 1894.392,
    "text": "That is also an S curve, which is already hitting the ceiling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1894.412,
    "end": 1904.998,
    "text": "I remember when I was an undergraduate in 1970, the rage was about the fact that there's a population explosion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1905.018,
    "end": 1907.5,
    "text": "And the end of...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1908.869,
    "end": 1925.738,
    "text": " the end of oil and lots of other things of this kind and um well um as i said in the beginning humility plays a role in science um it's much much more useful for the thinker to start with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1926.454,
    "end": 1952.277,
    "text": " i'm not so sure i'm not so sure let me look into it even if i believed these uh things uh it's very important that i quit i'm the i i i am the first to question them and the reason why the s curve should be an s and it is predictable is this uh anything that spreads again the milk on the kitchen floor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1953.075,
    "end": 1974.174,
    "text": " initially it invades the territory as something that moves fast and far and narrow like a finger and once the finger hits the the wall the wall uh the in this case the milk spreads laterally",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1975.084,
    "end": 2000.4,
    "text": " uh i call i call these two phases of uh of the occupation uh by using words from the military invasion and then consolidation it's always this way and well but as you can see in the uh lower right hand corner um invasion invades the area at an accelerate accelerating uh rate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2001.896,
    "end": 2016.765,
    "text": " and consolidation continues at a decelerating rate and so these two arcs are spliced together obviously naturally and together they make up the s curve so this is the prediction",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2017.575,
    "end": 2021.497,
    "text": " Where does the hierarchy come in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2021.517,
    "end": 2032.422,
    "text": "The hierarchy is an add-on, meaning the next slide, which I don't have, which is that things that spread on a surface,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2032.962,
    "end": 2039.187,
    "text": " spread in arborescent fashion, not as a single needle as in this particular example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2039.788,
    "end": 2048.274,
    "text": "And the tree spreads the stuff even faster than what I illustrated here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2048.515,
    "end": 2057.722,
    "text": "In other words, something that spreads as a tree will have an S that is taller during its viral",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2062.148,
    "end": 2063.531,
    "text": " Intermezzo, you see?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2063.551,
    "end": 2074.77,
    "text": "And so let's see, that's basically the, let's call it the preparatory material for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2076.001,
    "end": 2078.361,
    "text": " for showing us who we are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2079.782,
    "end": 2085.263,
    "text": "This is an image of human movement today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2085.323,
    "end": 2091.004,
    "text": "It is primarily due to aviation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2091.744,
    "end": 2096.605,
    "text": "We all move on the globe from any point to any other point imaginable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2096.625,
    "end": 2104.407,
    "text": "Those who originate from, let's say, diametrically opposed points",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2105.554,
    "end": 2110.919,
    "text": " necessarily will have to flow through the heart of this vascular architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2111.419,
    "end": 2117.965,
    "text": "The heart is where this architecture was born, which was Europe and North America.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2117.985,
    "end": 2125.631,
    "text": "And that is where the architecture has grown the most, which is why it is in deep red right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.552,
    "end": 2129.114,
    "text": "And so the movement is hierarchical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.475,
    "end": 2137.721,
    "text": " The physics of movement is that to move more, you must burn more fuel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2138.261,
    "end": 2146.55,
    "text": "So the burning of fuel on the globe must be hierarchical, meaning I'm looking at this image and I read the movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2148.155,
    "end": 2151.376,
    "text": " Another, Adrian, reads the burning of fuel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2151.936,
    "end": 2160.938,
    "text": "And as you'll see next, the burning of fuel is in fact proportional to the wealth available on the globe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2161.138,
    "end": 2163.039,
    "text": "As in, have money, will travel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.039,
    "end": 2172.681,
    "text": "And also on the next slide, I'll show you that increasing hand in hand with the wealth and fuel use and movement is freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2174.333,
    "end": 2184.786,
    "text": " and that's this is the final slide on the left hand side is the these are the facts these are data people today like to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.832,
    "end": 2190.633,
    "text": " who pray in the church of data and data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2190.653,
    "end": 2191.574,
    "text": "Well, here's data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.634,
    "end": 2192.454,
    "text": "These are the facts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.514,
    "end": 2204.458,
    "text": "Those dots show that every group on the globe falls on the diagonal between energy use and annual wealth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.1,
    "end": 2221.512,
    "text": " Which means that what is the annual use of energy in physics and engineering is just another language in which to tell the story of hierarchical distribution of wealth on the globe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.052,
    "end": 2238.018,
    "text": " meaning that economics and physics are two sides of the same coin, meaning two ways in which to describe the same drawing, and the drawing is hierarchical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2239.879,
    "end": 2243.38,
    "text": "All these dots are racing upward along the diagonal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2244.002,
    "end": 2253.588,
    "text": " Because, as everybody knows, every government reports annually its increase in GDP, in wealth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2254.128,
    "end": 2268.116,
    "text": "Well, the government doesn't brag about the increase in the burning of fuel, which of course means that no country is going to cut down its consumption of fuel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2269.012,
    "end": 2292.76,
    "text": " um and on the right hand side in other words the red arrow the direction of the bicyclists in the peloton and the to the france is the future on the right hand side the same data with the annual energy use on this time on the ordinate and on the abscissa the the competitiveness with regard to economic freedom the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2293.815,
    "end": 2298.317,
    "text": " The arrow that points toward the future is the same as on the left hand side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2298.897,
    "end": 2301.118,
    "text": "The dots are the same as on the left hand side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2301.578,
    "end": 2313.483,
    "text": "And they tell the story of a world that another peloton of bicyclists that are racing upward, even though most most governments don't know it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2315.35,
    "end": 2325.357,
    "text": " that the evolution of the society of the globe is toward not only greater movement, easier movement, but also greater freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2326.678,
    "end": 2333.703,
    "text": "And that takes me to the slide that Susan showed you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2334.323,
    "end": 2340.548,
    "text": "The mother, if I were to say, the mother of nature is in this direction from freedom",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2341.742,
    "end": 2362.718,
    "text": " of change as possible from change evolution is possible and from evolution the nature that we are and which surrounds us um has become possible as well thank you thank you thank you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2366.61,
    "end": 2371.734,
    "text": " Susan, would you like to provide a first reflection or direction here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.7,
    "end": 2383.343,
    "text": "Well, before it evaporates, you were shaking your head.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.363,
    "end": 2386.666,
    "text": "So I want to see what's alive for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.896,
    "end": 2418.179,
    "text": " I wrote down many things I have many questions to ask so but please feel free to ask one first and I'll prepare okay um what what really stood out for me um and I'm I'm slightly prejudiced because I've been going through the the physics of life so yeah that's uh the in so many semi um ideas were captured in that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.789,
    "end": 2432.96,
    "text": " But what really stands out for me, Adrian, is I'm seeing the system as object and structure as a verb.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.437,
    "end": 2441.178,
    "text": " No, structure is a noun.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.858,
    "end": 2451.96,
    "text": "Structure comes from the same word as, well, has the same origin as the word strewn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.12,
    "end": 2458.301,
    "text": "Strewn meaning spread, spread in this case on a page or on a canvas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2460.422,
    "end": 2461.222,
    "text": "It's a drawing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2461.422,
    "end": 2465.423,
    "text": "It's a drawing with a message streaming out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2466.227,
    "end": 2471.511,
    "text": " So structure is, to structure is a verb.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2471.751,
    "end": 2484.619,
    "text": "Clearly most of this is now in the languages of the Indo-Europeans tend to have both, they could be both noun and verb.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.299,
    "end": 2491.223,
    "text": "That is a feature of this group of languages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2491.283,
    "end": 2494.265,
    "text": "But I don't think it's limited to the Indo-European.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2494.305,
    "end": 2495.026,
    "text": "The point is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2496.431,
    "end": 2507.536,
    "text": " Yes, I applaud everybody's interest in the meaning of the words, because quite frankly, we're surrounded, we're actually drowning in jargon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2508.816,
    "end": 2510.177,
    "text": " Jargon is a good term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2510.897,
    "end": 2520.922,
    "text": "It applies to locker room discussion, a language that's understood only by 20 people, all of them men, you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2520.942,
    "end": 2527.805,
    "text": "It's just like any department of physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2527.945,
    "end": 2530.046,
    "text": "Oops, sorry, I didn't mean to put it that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2532.032,
    "end": 2534.873,
    "text": " You get the idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2535.093,
    "end": 2548.838,
    "text": "The object here, which is why I continue to praise Galileo Galilei and Da Vinci and these people, the object is to make these ideas or ahas accessible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2549.631,
    "end": 2572.103,
    "text": " to uh to everybody to everybody it doesn't mean to dilute them or to dumb them not at all it means it means it means to display humility and to speak in a way not only to speak but to make drawings that that open the eyes of people",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.948,
    "end": 2600.138,
    "text": " and i'm fortunate because as a professor i have this uh freedom to in fact i just uh lectured today the freedom to make drawings the freedom to uh to uh we asked to tell a joke uh every once in a while um uh maybe a self-deprecating joke the point is that the uh the the flow of science the flow of science uh benefits from um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2600.996,
    "end": 2630.44,
    "text": " from first of all modesty but also the ability to ask questions and to question the idea but to question the the speaker including yourself so so let me let me do that now um and and help me understand where i'm confused because i guess i'm when i say the structure is verb i'm thinking about how we're talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.733,
    "end": 2658.815,
    "text": " um configuration and reconfiguration and um and how the drawing actually turns into a movie oh that yeah that i can get a you know my head around um and um and specifically you know what when i'm where i'm grappling with this and it's opening doors is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.818,
    "end": 2688.631,
    "text": " how to think about using the constructor law the difference specifically between the tree structure which to me is shape and and the s curve and that is time so when i'm thinking about reconfiguration help me understand you know where you know when i'm thinking about movement and flow and the configuration architecture",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2689.863,
    "end": 2692.466,
    "text": " How is that informing me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.826,
    "end": 2693.567,
    "text": "Well, where am I?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2694.648,
    "end": 2695.428,
    "text": "Well, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.39,
    "end": 2705.438,
    "text": "A hierarchical drawing like the river basin has many, many shapes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2705.738,
    "end": 2707.96,
    "text": "The biggest is the shape of the page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2708.65,
    "end": 2725.462,
    "text": " inside of it there is the shape of the angle between two tributaries the drawing is full of such angles those angles are all different well but at the same time they're all similar because they're all kind of close to 75 degrees or 50 degrees",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2728.503,
    "end": 2736.186,
    "text": " So you have shapes galore, if that is what interests you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2736.206,
    "end": 2739.588,
    "text": "Others are interested in lengths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2740.488,
    "end": 2745.27,
    "text": "Well, there are many channels, and the lengths are themselves hierarchical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.71,
    "end": 2750.132,
    "text": "Some are longer, others are shorter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.534,
    "end": 2759.803,
    "text": " The more of these, let's call them shapes and lengths, the more complex the drawing is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2759.883,
    "end": 2763.728,
    "text": "And complex, you have to be very careful with this word, is one that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2767.955,
    "end": 2793.568,
    "text": " places the discussion closer to the locker room meaning the the jargon because it hides hides these elements that i was enumerating complex the word itself means means twisted together and well that's if i use that word i i declare defeat not victory you see if it's twisted together",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2794.989,
    "end": 2799.672,
    "text": " I cannot even wish myself good luck because there is no luck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2800.973,
    "end": 2816.245,
    "text": "In any case, I know what it means and to me a word like that is an invitation to question the word, to question the speaker, to ask myself what is the drawing that's complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2816.765,
    "end": 2817.226,
    "text": "If you ask",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2817.95,
    "end": 2830.017,
    "text": " If you ask this question, you discover that the drawing is not that complex, because if you can make it, it is not twisted together, you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2830.037,
    "end": 2841.603,
    "text": "It is twisted together, meaning like one of these truly fractal drawings, when you cannot draw it, you see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2843.056,
    "end": 2859.111,
    "text": " uh so on and on look we can we can uh let's say uh uh slice the orange here and small slices but we're wasting our time if we do that the point is that um to answer you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2860.333,
    "end": 2873.142,
    "text": " The words that we use are very useful, but they also tend to separate us, to keep us apart, if we do not agree on their meaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2874.002,
    "end": 2880.827,
    "text": "And that's why I interjected and I added some imagery to the words that you're speaking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2881.827,
    "end": 2893.139,
    "text": " okay and by the way uh structure uh same origin as strewn well that's where the s curve uh phenomenon is you know the the spreading is s curve",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2894.094,
    "end": 2921.025,
    "text": " uh it's growth also known as growth um the collecting is uh also as curved uh which is also growth you know during the the the reaping of a harvest the the flow of the grain from the area to the silo is a stream that grows slow fast slow the direction of the flow is not the phenomenon",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2921.799,
    "end": 2927.256,
    "text": " The history of the flow is the phenomenon and it is called the S-curve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2928.212,
    "end": 2953.331,
    "text": " um also known as the logistics uh s curve or the logistics curve and um i can tell you the history of that if you're interested the point is that logistics are from a military military um what's the word um yeah they call logistics the the flow of material uh food not just ammunition but uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2954.231,
    "end": 2980.892,
    "text": " mobile hospitals and the infirmaries and all these things that are flowing and moving behind behind the troops and there's a great quote from napoleon napoleon bonaparte he said amateur he was talking about generals amateurs talk talk strategy professionals",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2981.934,
    "end": 3010.371,
    "text": " talk logistics logistics and that was napoleon the quote is even better now because of the english language as belonging to general omar bradley who used it without crediting napoleon so so but in any case these are two very important figures who knew which end is up think about it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3011.358,
    "end": 3017.044,
    "text": " highly successful, because you see it today in the conflicts that are raging.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3017.745,
    "end": 3023.071,
    "text": "It's not about what goes on, meaning not only what goes on on the front,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3024.014,
    "end": 3037.743,
    "text": " It is about the logistics or the power of the society behind the military activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3037.763,
    "end": 3045.568,
    "text": "This is extremely important to learn from every news item today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3048.951,
    "end": 3063.512,
    "text": " well thank you I'll give a reflection and connect just a few areas of flow that I think really speak to some of the points so the key reflection is nature is not broken by Department",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.699,
    "end": 3067.881,
    "text": " it's not broken or mistaken in any way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.821,
    "end": 3077.186,
    "text": "And that is radically different than many organizational structures, including in learning and education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.726,
    "end": 3081.808,
    "text": "And so that's a big question mark and a big open space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.928,
    "end": 3087.851,
    "text": "And then there was some pictures and some words and some symbols, but that's a starting place that's perennial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3089.172,
    "end": 3091.053,
    "text": "I thought of two kind of flows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.276,
    "end": 3112.406,
    "text": " evoked in your description the first was drawing with a ballpoint pen on the page and the ink as it diffuses through the paper and about how there's a trace and then there's you could imagine filling the channels of the paper and different properties of the paper and just about how the act of drawing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.346,
    "end": 3133.707,
    "text": " is and and why the line it fixes at a certain point that's the s curve has flowed to its flow it dries solvent is gone so on so you can go into more detail but just in that act and then another one perhaps more in a informational space is the jargon and the jargon can be piercing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.858,
    "end": 3140.881,
    "text": " but it can be a grappling hook to go a hundred miles out and get really specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3140.981,
    "end": 3149.124,
    "text": "I'm talking about theta sub delta of figure four of your 2012 paper, and that can go all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.905,
    "end": 3154.107,
    "text": "And then there's that second phase of expansion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.407,
    "end": 3156.188,
    "text": "It's not just about throwing needles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3157.344,
    "end": 3162.169,
    "text": " It's about throwing the needle to the wall that was your engineered setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.89,
    "end": 3174.262,
    "text": "And then if it makes contact, then there's this secondary phase that's the actual overture and the initial precision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.612,
    "end": 3190.753,
    "text": " technical detail is a first contact if even that and again that gives science education and Praxis I think a real challenge and opportunity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3192.972,
    "end": 3206.983,
    "text": " I think you hit the nail on the head three times real hard, and it's the same nail, even though every time it issued a different scream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3209.305,
    "end": 3212.287,
    "text": "But that is, in fact, very accurate, very accurate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3212.488,
    "end": 3214.109,
    "text": "And it happens, just a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.391,
    "end": 3224.312,
    "text": " And it does happen the way that you professed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3224.812,
    "end": 3232.755,
    "text": "It does happen, even after it hits the wall, in all your examples, because happening is nature itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3234.075,
    "end": 3241.638,
    "text": "Let's say the campus divided into departments that don't talk to each other is unnatural.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3242.418,
    "end": 3243.478,
    "text": "It's unnatural.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3243.498,
    "end": 3248.44,
    "text": "These barriers have been disregarded by...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3251.363,
    "end": 3255.067,
    "text": " by clear thinkers all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3255.087,
    "end": 3274.046,
    "text": "The ones who have made progress or contributions are the professors or researchers that have this innate ability to scale fences and jump over them or to get drunk and step off the curb and fall on the street.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3274.967,
    "end": 3277.65,
    "text": " These are the people who made the history of science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3279.212,
    "end": 3280.915,
    "text": "They're called polymaths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3281.716,
    "end": 3283.138,
    "text": "And we have them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.158,
    "end": 3287.703,
    "text": "I know even here at Duke, I know the few who are this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3287.744,
    "end": 3288.565,
    "text": "They are my friends.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3289.521,
    "end": 3294.946,
    "text": " And we're too busy to start a revolution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3295.486,
    "end": 3300.891,
    "text": "But the future is the way you sketched it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3301.451,
    "end": 3315.983,
    "text": "It will continue to be one of filling in the spaces, or rediscovering or repeating what others have done in a sketchy fashion, or maybe throwing a jargon word out there, or perhaps as a joke.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3317.564,
    "end": 3322.952,
    "text": " or even more effective as a non-PC joke.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3323.593,
    "end": 3325.196,
    "text": "And then the people say, aha, aha.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3327.288,
    "end": 3344.113,
    "text": " And in the beginning, this act, this spark you described takes roots and fills the space because a good idea is like food for the hungry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3344.394,
    "end": 3354.777,
    "text": "It attracts participants, it attracts students, it attracts disciples, followers, second generation teachers or artists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3355.629,
    "end": 3357.41,
    "text": " And I'll come back to your first example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3357.45,
    "end": 3361.373,
    "text": "When you started speaking, I saw immediately the history of painting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3362.013,
    "end": 3371.199,
    "text": "The first thing that Da Vinci and these people, Michelangelo, did was to make a very fast pencil sketch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3373.073,
    "end": 3393.639,
    "text": " something that only they recognized because it was already in their minds and today with all this instrumentation people are discovering as traces of graffiti on the canvas that have been covered much later with various colors over and over again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3394.499,
    "end": 3397.38,
    "text": "Yes, that's the way nature really works and nature is also",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3401.599,
    "end": 3428.474,
    "text": " the brain itself let's face it there's no other there's no other architecture that works except the one that i've sketched crudely in my uh in my uh exposition here susan do you want to give a kind of closing question or comment while we have adrian i'm going to begin with a blank slate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3432.049,
    "end": 3438.291,
    "text": " I'm available a little longer if you have food for the hungry here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3441.372,
    "end": 3443.152,
    "text": "I'll ask a question from the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3444.113,
    "end": 3444.753,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.653,
    "end": 3448.674,
    "text": "Upcycle Club writes, a question to Professor Bijan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.374,
    "end": 3457.797,
    "text": "What are the biggest unanswered questions or areas of exploration within constructal theory that you hope future researchers will investigate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.758,
    "end": 3460.318,
    "text": "Good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3462.695,
    "end": 3468.038,
    "text": " I've been kicking this ball for almost 40 years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3471.301,
    "end": 3477.925,
    "text": "Not in the direction of discovering the biggest that need to be discovered or to be explored, but out of curiosity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3477.945,
    "end": 3484.77,
    "text": "Today, as you saw in Susan's presentation, there's a world movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3485.39,
    "end": 3486.831,
    "text": "It's populated primarily by",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3487.58,
    "end": 3490.983,
    "text": " by younger people who are, in fact, competing with me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3492.425,
    "end": 3498.951,
    "text": "Clearly, I'm not at the start of my career, but they are beginning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3499.491,
    "end": 3503.555,
    "text": "And in fact, they're quite creative and productive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3507.579,
    "end": 3511.082,
    "text": "My own new work is about asking",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3514.305,
    "end": 3521.828,
    "text": " questions about this field that have not been asked or answered.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3523.628,
    "end": 3530.89,
    "text": "The Construct Law has not been refuted by anyone in its, you know, already four decades.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3531.311,
    "end": 3531.771,
    "text": "Nobody.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3532.511,
    "end": 3534.712,
    "text": "So I decided to question it myself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3535.672,
    "end": 3538.093,
    "text": "To say, listen, let me, what was that word?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3538.353,
    "end": 3538.673,
    "text": "Let me...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3546.425,
    "end": 3550.688,
    "text": " Let me prove it wrong, but there's this word from Karl Popper about... Falsification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3551.429,
    "end": 3556.893,
    "text": "Yeah, let me falsify it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3557.893,
    "end": 3564.338,
    "text": "I'm looking for phenomena that at first viewing seem to contradict the Constructor Law.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3565.199,
    "end": 3565.459,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3566.654,
    "end": 3594.786,
    "text": " and uh because i have the talent of looking around and uh and um yeah i keep my eyes open yes uh when there's a heavy downpour and the the rain falls on um on dirt the um the obviously the river river basin is born but the river channels uh flow um with cataracts",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3596.243,
    "end": 3610.093,
    "text": " They develop a periodic sequence of little pools interspaced with mini waterfalls, cataracts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3611.854,
    "end": 3617.058,
    "text": "Yes, the river is putting the brakes on itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3618.639,
    "end": 3623.362,
    "text": "Yes, it's a contradiction of the Constructa Law, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3624.623,
    "end": 3625.664,
    "text": "So I question it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3627.023,
    "end": 3627.944,
    "text": " And I published it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3628.885,
    "end": 3636.411,
    "text": "And I discovered in the course of proving the Constructor Law wrong, that the Constructor Law is right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3637.251,
    "end": 3654.485,
    "text": "The water that flows in a periodic fashion flows faster than in the textbook of water flowing uniformly and steadily down an incline, along an inclined plane.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.085,
    "end": 3671.958,
    "text": " And the reason why the interrupted flow is faster is there is nothing more perfect for the flow of water than to fall without friction, to fall over a dam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3673.259,
    "end": 3682.967,
    "text": "So the water and the erodible soil have in themselves this tendency called freedom",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3684.42,
    "end": 3685.921,
    "text": " to facilitate access.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3687.041,
    "end": 3695.424,
    "text": "And yes, I was excited not to prove myself right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3695.584,
    "end": 3702.726,
    "text": "I was actually trying to find the limited applicability of this concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3703.966,
    "end": 3705.507,
    "text": "And in this case, I did not find it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3706.827,
    "end": 3709.968,
    "text": "And I am continuing this sort of I'm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3714.135,
    "end": 3718.197,
    "text": " In the same room, I'm both a prophet and a gadfly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3718.357,
    "end": 3722.279,
    "text": "I'm trying to prove Adrian wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3723.299,
    "end": 3728.762,
    "text": "It's exciting, but I'm an audience of one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3730.128,
    "end": 3734.111,
    "text": " I talk to my wife, and she knows where I'm coming from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3734.852,
    "end": 3740.276,
    "text": "And all of it is worth laughing, in fact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3741.296,
    "end": 3746.38,
    "text": "But if we don't laugh, we have no future, frankly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3748.461,
    "end": 3758.989,
    "text": "So just to kind of wrap up, I think I read the paper you're talking about, but I remember something about the Eddies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3763.155,
    "end": 3777.719,
    "text": " And that kind of brought me back to what Daniel's question was about as far as how we break free these silos and how does that form?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3779.02,
    "end": 3787.382,
    "text": "And also, I think that also speaks to maybe the second session that we can hold, which is about the freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.177,
    "end": 3814.891,
    "text": " because we really that is of itself that's a topic that is just so rich i'm happy to mention the eddies because that was an earlier um example of uh my questioning this uh this principle people all over people all over uh view turbulence especially in the applied the world",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3815.532,
    "end": 3817.133,
    "text": " Turbulence is something bad.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3817.594,
    "end": 3819.515,
    "text": "Something that increases friction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3820.816,
    "end": 3821.136,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3822.117,
    "end": 3822.457,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3822.798,
    "end": 3828.222,
    "text": "Something that's not as good as a smooth flow called laminar flow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3828.242,
    "end": 3832.725,
    "text": "The one with the smooth streamlines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3833.125,
    "end": 3834.587,
    "text": "This is what you see in the textbook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3835.207,
    "end": 3836.108,
    "text": "Yeah, turbulence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3836.148,
    "end": 3837.389,
    "text": "This complicated thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3837.409,
    "end": 3839.931,
    "text": "You know, eddies, rubbing, and meh.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3840.551,
    "end": 3841.372,
    "text": "Well, you know what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3842.225,
    "end": 3866.438,
    "text": " turbulent flow is constructile as well because because compared with the laminar turbulent flow uh uh answers the question of what really flows what flows is not the fluid what flows is the movement across the fluid meaning the movement from the fast to the slow",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3867.296,
    "end": 3887.018,
    "text": " in other words the mixing the mixing is you know the mixing is known in physics as the transfer of momentum that is what's facilitated by this sudden change in the drawing from smooth layers to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3887.796,
    "end": 3889.939,
    "text": " two things that appear to be complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3889.979,
    "end": 3891.661,
    "text": "By the way, they're not complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3891.861,
    "end": 3897.669,
    "text": "One, I did predict the sizes of these eddies and their speeds and their hierarchy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3897.709,
    "end": 3899.111,
    "text": "They are hierarchical, the eddies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3899.772,
    "end": 3902.456,
    "text": "The eddies are basically these trees",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3903.914,
    "end": 3907.858,
    "text": " the trees that I drew, like the trees of a river basin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3909.66,
    "end": 3925.135,
    "text": "But the river basin that becomes this turbulent pool is a tree, the channels of which are embedded in the same fluid, which is the pool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3926.537,
    "end": 3934.983,
    "text": " And every channel is unstable and becomes curved, becomes an eddy, and it rolls over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3935.003,
    "end": 3951.475,
    "text": "And the tree that I just sketched becomes a bouquet of broken branches that continue to roll, that continue to roll, filling the space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3952.33,
    "end": 3965.628,
    "text": " but you can see their birth in in the little speech that i gave um and in any case there's a hierarchy of eddies in every so-called turbulent flow field",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3966.565,
    "end": 3989.253,
    "text": " now the doctrine of turbulence research is not like what i just spoke it is about a a uniform distribution over the field over the pool of eddies of various sizes as if there are these uh you know fruits of various sizes all thrown into a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3989.813,
    "end": 3993.735,
    "text": " pot and mixed around with chocolate sauce.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3993.755,
    "end": 3996.356,
    "text": "That's not what turbulence is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3996.396,
    "end": 4006.881,
    "text": "Turbulence is a broken tree structure, the branches of which keep rolling, embedded in each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4007.701,
    "end": 4017.126,
    "text": "And that so-called mixture is the one that vehicles the movement of movement across the volume.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4018.456,
    "end": 4037.265,
    "text": " without it without it um without it there would be no uh frankly without turbulence there would be no life on earth uh everything would be stagnant cool of i don't know what a layer a layer of no life uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4038.93,
    "end": 4040.691,
    "text": " And then another layer of no life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4040.871,
    "end": 4042.973,
    "text": "In other words, no mixing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4044.053,
    "end": 4049.476,
    "text": "By the way, so mixing, we know this from other stories of science and history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4049.617,
    "end": 4055.5,
    "text": "Mixing is, in fact, the mother of not only life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4055.52,
    "end": 4062.264,
    "text": "You get species from events of encounter or meeting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4068.226,
    "end": 4090.073,
    "text": " um and new species from for example from interbreeding and so on and so without mixing there is nothing on earth nothing so one final question um that speaks back to your slide on nothing moves unless it's pushed yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4091.641,
    "end": 4092.121,
    "text": " That's right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4093.522,
    "end": 4103.545,
    "text": "It's as if one has to explain that a peasant knows that a horse is needed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4103.565,
    "end": 4108.086,
    "text": "You don't need only a cart.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4109.846,
    "end": 4110.927,
    "text": "And I come back to...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4112.366,
    "end": 4125.35,
    "text": " So the news of the day, the logistics, the ability to move things, the ability to power things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4126.09,
    "end": 4131.052,
    "text": "This is extreme.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4131.212,
    "end": 4136.954,
    "text": "I would say is the most important because society itself is alive because of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4138.317,
    "end": 4159.504,
    "text": " of the power that it the society produces and that the power by the way something else that people don't realize is spent as soon as it is produced it is spent and and destroyed dissipated as soon as it is made and that is called movement or life",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4160.513,
    "end": 4164.935,
    "text": " Life means to destroy the power that is available to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4165.455,
    "end": 4167.896,
    "text": "You don't have to look at today's advanced society.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4167.956,
    "end": 4170.558,
    "text": "Look at any animal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4171.838,
    "end": 4184.644,
    "text": "The movement of the animal is the physical movie of how the useful energy embodied in the food is being destroyed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4184.664,
    "end": 4188.946,
    "text": "No food, no animal movement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4190.387,
    "end": 4208.748,
    "text": " simple as that no food and no engine which is the animal itself that means death not life death and uh these are basic facts of physics is you don't need an education in the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4209.93,
    "end": 4239.493,
    "text": " uh whatever anthropology or uh yeah you could use an education in a veterinarian medicine that's where you get this much broader picture of who we are um thank you adrian we really appreciated it hope to talk to you another time all right thank you thank you for the opportunity to get to know each other thank you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4240.495,
    "end": 4241.836,
    "text": " Yes, thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.077,
    "end": 4244.997,
    "text": "Very insightful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4245.798,
    "end": 4246.138,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.638,
    "end": 4252.201,
    "text": "Well, Susan, I have many random remarks to share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.241,
    "end": 4253.681,
    "text": "Would you like to share anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4254.542,
    "end": 4255.042,
    "text": "Go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.062,
    "end": 4255.782,
    "text": "Go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4255.842,
    "end": 4258.084,
    "text": "And then, of course, what's going on in the chat?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4260.359,
    "end": 4260.659,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.94,
    "end": 4261.18,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.501,
    "end": 4262.702,
    "text": "I'll read a few.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.984,
    "end": 4265.386,
    "text": "Traveling fast and slow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.886,
    "end": 4267.829,
    "text": "That reminded me of thinking fast and slow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.849,
    "end": 4275.759,
    "text": "And then in the airport, there was the fast backbone and the slow walking on the edges thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4276.257,
    "end": 4290.613,
    "text": " But in terms of thinking fast and slow, actually the fast part is on the edges of the biological organism with the reflexes and the reactivity and the slower part is the backbone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.633,
    "end": 4292.475,
    "text": "So it's like kind of the same but different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.576,
    "end": 4315.662,
    "text": " um another piece was he said that the first question is often overlooked like what phenomena are we looking at what's the system of interest and then that made me think about like biomechanics like an elbow moving and so in the physics textbook or in an example it's like well there's a weight on the end of a stiff rod and it's set up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4316.542,
    "end": 4341.841,
    "text": " but that's kind of the last mile question the phenomena of the arm is a broader phenomena and so you still may want to have that very reduced disciplinary model it's small it's useful it can give insight and so on it's just part of a bigger tapestry about that phenomena",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.842,
    "end": 4357.155,
    "text": " and that's a different starting point for the conversation and the collaboration on that topic that's not disciplinary so the entry point of the real system and the entry and returning point",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4359.654,
    "end": 4386.663,
    "text": " is by definition the broader conversation than the kind of terminal scientific artifact which as we discussed that's kind of the narrow but far as opposed to the broader and and kind of softer but more space and closing yes and actually you know that brings up um you know when you think about phenomenon",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.925,
    "end": 4415.644,
    "text": " um yeah i almost want to go to you know what is the context but phenomenon is actually you know what is flowing what you know what so when we kind of pull that in as far as the fast and the slow how much and you know a lot of times by injecting that you're actually putting turbulence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.165,
    "end": 4445.462,
    "text": " into a conversation which you know which if somebody is um associating turbulence with conflict then they might be actually distorting it extorting the freedom of what can emerge um and so you know this comes back to the invasion acceleration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.693,
    "end": 4450.987,
    "text": " He spoke about, and then the consolidation is the deceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4453.26,
    "end": 4455.261,
    "text": " Yeah, a few points on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.421,
    "end": 4460.865,
    "text": "First, I think a question I'd love to learn more about is like trends are not monotonic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.725,
    "end": 4468.069,
    "text": "So just because things have been a certain way for the last 50 or 100 years doesn't even mean the sign is going to be the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.109,
    "end": 4470.93,
    "text": "So I'd be interested to see how that kind of change comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4471.351,
    "end": 4474.333,
    "text": "But I'm thinking about a car's engine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.033,
    "end": 4481.277,
    "text": "There's parts where the laminar flow is the desirable trait for transfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.037,
    "end": 4494.18,
    "text": " and then there's parts where mixing like liquid and gas and thermal mixing is more important and they simply are not the functional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.475,
    "end": 4511.93,
    "text": " they play complimentary functional roles it's literally like fast and slow and there's never a reason why especially considered apart from a specific system it basically can't be said which of those tendencies are you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.849,
    "end": 4536.666,
    "text": " even you know how to compare them which is why even though we were looking at a two-dimensional shape with the rectangle there was only one degree of freedom which was the ratio so that reflects i think having a simple we need to capture that yeah yeah capture that yeah this this actually so if we were to translate this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4537.367,
    "end": 4546.289,
    "text": " and bring in some active inference, what's kind of coming alive for me in this is the difference between exploration and exploitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4549.13,
    "end": 4549.35,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.85,
    "end": 4554.791,
    "text": "Like he showed a parabola with a ball rolling to the bottom of the hill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4554.851,
    "end": 4559.753,
    "text": "And then there was kind of a zone of tolerance, like within 10% of the Y axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4560.353,
    "end": 4563.413,
    "text": "And so it was a pretty shallow bowl, wide bowl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4563.754,
    "end": 4564.874,
    "text": "So there was a lot of play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.908,
    "end": 4586.706,
    "text": " that would keep it within a 10% tolerance on the Y. Now, to persistently optimize that, all the ball needs to know is the slope of which direction it should head it, given that it's already knowing that it's within this zone of controllability, which is how all bodies are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.846,
    "end": 4591.95,
    "text": "Everyone has been part of an unbroken chain of blood sugar regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.811,
    "end": 4599.314,
    "text": " So the evolutionary and the developmental prior is that the physiological state is already in the zone of control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.114,
    "end": 4608.258,
    "text": "And then it's just a directional issue to head towards the bottom of the bowl, but you can't stop...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.908,
    "end": 4632.774,
    "text": " x change you can't stop climate from changing you can't stop physiology from changing that's not to say you can't de-risk and think about real consequences of action but just taking it at the most narrow technical sense of change through time and evolution all things are changing there's no point in trying to halt change",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.369,
    "end": 4662.226,
    "text": " it's a simpler actionable heuristic for the ball on the ball uh bottom of the bowl which way is the free energy flowing yep path of least resistance um and yeah this kind of comes back to the phenomenon of how do we predict um and um and in fact i would suggest let me share my screen because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4662.981,
    "end": 4670.345,
    "text": " For those people listening, I just – Go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4671.346,
    "end": 4672.146,
    "text": "Yeah, do you see it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.166,
    "end": 4672.646,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4673.867,
    "end": 4680.971,
    "text": "So, yeah, I mean, just putting that – being able – I constantly go back to and reread this law.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4681.031,
    "end": 4687.835,
    "text": "In fact, the reason I said earlier that I'm going back to is a clean slate because it was like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4688.621,
    "end": 4700.103,
    "text": " you know, whenever I have the opportunity to speak with Adrian, he puts something out there and I'm like, what I thought, you know, I was reading into it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4700.323,
    "end": 4713.845,
    "text": "It was kind of, you know, that's kind of going to that, the phenomenon of exploration and, you know, seeing what's out there, you know, how are we perceiving the world, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.226,
    "end": 4717.806,
    "text": "And then how do we switch",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4718.84,
    "end": 4742.78,
    "text": " to exploitation and when i'm saying exploitation i'm talking about how do we move from being in the world to how do we move to remaking the world or or or changing yet doing what he talked about originally is is how do we um how do we construct um the the um the world around us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.113,
    "end": 4746.153,
    "text": " for our niche construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.254,
    "end": 4749.174,
    "text": "Actually, he does reference niche construction in the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4750.835,
    "end": 4759.517,
    "text": "And so how do we do that so that we're using the least amount of necessary energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4760.377,
    "end": 4773.62,
    "text": "Because I think that one question that I had, which I think would be a topic for a future conversation, is how do we know when we are violating the constructor law?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.484,
    "end": 4783.849,
    "text": " And this ties back to the belief update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4786.852,
    "end": 4792.518,
    "text": "If I could, I'd like to connect a few of the words you have on this slide, the active ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4792.538,
    "end": 4798.344,
    "text": "And that's kind of like, as we explore all the time, that's how we kind of begin that bi-directional conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4798.384,
    "end": 4800.786,
    "text": "So like for a finite size system,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4801.772,
    "end": 4815.84,
    "text": " that is a thing system of interest it's a thing it's the blanket and the internal states of the particular partition the particle the thing itself to persist in time non-equilibrium steady state or a similar",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.352,
    "end": 4825.375,
    "text": " Phrasing, talking about the path of least action of the stationary state or the attractor or the trajectory or the path of that thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.395,
    "end": 4831.057,
    "text": "So we're talking about the same kind of system of interest and then evolve with freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.778,
    "end": 4835.779,
    "text": "As we heard, these terms are plain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4837.06,
    "end": 4845.263,
    "text": "And so evolve being changed through time, notably not taking on the kind of intergenerational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4847.042,
    "end": 4848.544,
    "text": " connotation of evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.144,
    "end": 4855.751,
    "text": "Some people like in biology would say something like, well, evolution happens between generations and development and ecology happens within a generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.771,
    "end": 4859.134,
    "text": "But here, time evolution is being used more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4859.975,
    "end": 4860.336,
    "text": "Freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4861.363,
    "end": 4864.846,
    "text": " was described in terms of degrees of freedom, statistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.347,
    "end": 4872.273,
    "text": "And we could also think about rule-based degrees of freedom as affordances, as the knobs that can be changed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4872.313,
    "end": 4875.336,
    "text": "Those are the degrees of freedom on that interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.337,
    "end": 4880.32,
    "text": "And then to the last piece, the providing easier and greater access to what flows,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4881.081,
    "end": 4909.191,
    "text": " here i um think to the recent guest stream 63.1 that discussed the philosophical status of material and information flows and more logistics yes and then of course the the joke i guess was like the logistic curve but it's like logistic and logistics and then what status to accord to material flows and informational flows in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.291,
    "end": 4929.821,
    "text": " integrated, autopoetic, mortal computational systems where there's a weaving of the blood flow of the brain and the ion flow and the nutrients, and there's an informational flow, semantic flow, that is not strictly described by the material architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.763,
    "end": 4937.105,
    "text": "Now, to pull back to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4939.457,
    "end": 4968.322,
    "text": " okay so put that in the frame of reference in terms of one thing he said that was like blew my mind was um it's not the it's not the what is flowing when he was referencing what is flowing and i'm you know and so what you just said um where i'm going with this and you know if this if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4969.045,
    "end": 4978.354,
    "text": " Tell me if this is where you're thinking is epistemic and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4980.436,
    "end": 4983.079,
    "text": "So what is flowing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.099,
    "end": 4992.348,
    "text": "I mean, once we can calculate that, and he also gave a calculation for degrees of freedom,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4997.148,
    "end": 4997.448,
    "text": " Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.528,
    "end": 4998.709,
    "text": "These are great directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4998.729,
    "end": 5001.111,
    "text": "I'll just go to a different angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5001.612,
    "end": 5013.801,
    "text": "I thought it was, I loved his recurrent connection with drawing and art and about the sketches that are being discovered behind paintings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.542,
    "end": 5026.031,
    "text": "That's like deeper blankets of the painting, deeper levels of historical meaning and cross-referencing like, oh, this one is signed at an earlier date and we have this letter so we know that they were speaking with this person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.051,
    "end": 5026.331,
    "text": "So it's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.772,
    "end": 5029.997,
    "text": " Deeper in space and time and causality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5030.798,
    "end": 5039.452,
    "text": "And then even artists like Kandinsky would go through many iterations and many sketches on even...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5041.298,
    "end": 5062.087,
    "text": " non-representational or post-representational however you want to think about the kind of art that's not like a landscape but the painting was then synesthetic with auditory and so that kind of brings together not to resolve but for the beauty of the snapshot the noun structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5063.217,
    "end": 5067.278,
    "text": " and the dynamics to structure as a verb and as a process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5067.538,
    "end": 5076.821,
    "text": "And like the fact that you can't disentangle or drop one or the other, prioritize one or the other, they're literally snapshots of the movie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.082,
    "end": 5078.562,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5078.942,
    "end": 5079.362,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5079.742,
    "end": 5089.605,
    "text": "And, and it's kind of tie that back to, um, you know, the path of least action and, um, and, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.87,
    "end": 5115.426,
    "text": " But it reminds me of a saying, and correct me if I'm not getting this correct, but the difference between, the saying goes, is the difference between an average artist and an expert or a master artist is knowing when to paint the last paint stroke.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5120.711,
    "end": 5121.492,
    "text": " that's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5121.632,
    "end": 5124.934,
    "text": "It reminds me of, I would have written a shorter letter if I had more time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.994,
    "end": 5131.698,
    "text": "Like there's these kind of, are they intuitive or are they counterintuitive because it's knowing what not to do and when to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5132.378,
    "end": 5132.598,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5132.979,
    "end": 5133.299,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5133.579,
    "end": 5133.939,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5134.199,
    "end": 5136.221,
    "text": "And this, yeah, this, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5136.661,
    "end": 5136.801,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5136.821,
    "end": 5145.146,
    "text": "That's, that's a, that's a great way to, to wrap that up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.206,
    "end": 5145.547,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5145.687,
    "end": 5149.109,
    "text": "Because it comes back to, you know, the,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5152.267,
    "end": 5155.709,
    "text": " the path of least resistance and, you know, and the freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.01,
    "end": 5164.835,
    "text": "And so oftentimes the affordances, if people don't understand that, you know, they're actually pushing too hard or over-designing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5166.856,
    "end": 5177.842,
    "text": "And, you know, how do we use the constructive law and active inference to his point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5178.103,
    "end": 5181.785,
    "text": "I mean, it's like power is spent as soon as it's produced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5186.189,
    "end": 5199.616,
    "text": " i'll make a few more contact points with active inference one question i have is like where's the observer we've explored a lot this year with chris fields's course in the quantum information sciences and so on about the role of the observer so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5201.084,
    "end": 5226.307,
    "text": " should we think of these flow processes as only or actually occurring on the material substrate if so where is the space for the observer or the poly computing of mike levin so that's one open question and then i think another important touch point is like notions of hierarchy which you return to and there was like a very unconventional hierarchy represented with people's diffusion from city blocks",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5227.332,
    "end": 5235.237,
    "text": " Like smaller and bigger parties going to and leaving at different times, and then the diffusion maps across the city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5235.257,
    "end": 5237.378,
    "text": "And so it's like, that's one representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.878,
    "end": 5246.523,
    "text": "He kind of contrasted that flow hierarchy with like a pyramid type representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5246.843,
    "end": 5247.504,
    "text": "Maybe you mentioned this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.944,
    "end": 5256.169,
    "text": "And then that made me think about two ways that we see the hierarchical models in active inference, that are different than both the pyramid and the city blocks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.889,
    "end": 5267.751,
    "text": " One of them is the spatial enclosure, nested blankets, nested models that are enclosing each other, not just diffusing into the same city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5268.311,
    "end": 5280.114,
    "text": "And then another is the metacognitive with the work of Sanford Smith et al in Livestream 28 with the hierarchical model representing metacognitive layers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5281.694,
    "end": 5299.38,
    "text": " So between the pyramid, the city streets, the enclosure and the mines, that one symbol bridges us already such that it puts the brunt of the question on what to do and how to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.214,
    "end": 5328.639,
    "text": " yeah yeah a lot so much to explore something that's exciting uh so to wrap up and to capture is there any other questions not that we have to answer them now but if you can you know just kind of read off any other questions that might have shown up in the live chat i'll capture those and you know and we can start kind of a repository of what you know what showed up today um and uh and that way we can use it to explore explore further",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5329.266,
    "end": 5356.821,
    "text": " yeah we will continue the kind of series and the curating of questions I'll just read one Mills 8102 wrote what are the factors or conditions that afford the restructuring of a flow system does it always require the imposition of sufficient demand on that system to change does it take a crisis one question I have is where are perception and action hmm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5361.749,
    "end": 5363.41,
    "text": " Do you have any last comments or thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5365.632,
    "end": 5366.793,
    "text": "Just my head spinning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5368.494,
    "end": 5368.694,
    "text": "Wow."
  },
  {
    "start": 5369.274,
    "end": 5369.495,
    "text": "Well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5369.835,
    "end": 5370.055,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.415,
    "end": 5370.655,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.675,
    "end": 5372.497,
    "text": "Thank you, Susan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5372.957,
    "end": 5373.457,
    "text": "And thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.878,
    "end": 5375.259,
    "text": "Farewell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5375.339,
    "end": 5375.679,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5376.66,
    "end": 5377.16,
    "text": "Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5377.18,
    "end": 5377.861,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5378.041,
    "end": 5378.241,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]