[
  {
    "start": 9.909,
    "end": 10.769,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 11.49,
    "end": 17.832,
    "text": "This is Active Inference guest stream 66.2 on February 15th, 2024.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 18.553,
    "end": 24.575,
    "text": "We're very much looking forward to this follow-up on a very delightful 66.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 25.016,
    "end": 28.637,
    "text": "So thank you, Susan Hastie, for organizing and helping with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 28.677,
    "end": 29.958,
    "text": "To you for the introduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 35.28,
    "end": 36.04,
    "text": "Unmute and continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 37.141,
    "end": 37.381,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.922,
    "end": 42.103,
    "text": " Okay, thank you, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.023,
    "end": 45.264,
    "text": "And thank you, Adrian, for coming back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.766,
    "end": 53.408,
    "text": "Our last session, we covered Design in Nature, your book on Design in Nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 54.149,
    "end": 61.953,
    "text": "And this is my favorite book of all, which is what we're going to cover today, which is Evolution and Freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 62.013,
    "end": 68.176,
    "text": "So I'm going to turn it over to you, and I look forward to this presentation and our discussion afterwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.751,
    "end": 81.636,
    "text": " OK, thank you for the invitation, especially in view of the fact that this is my second appearance on your show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.517,
    "end": 93.241,
    "text": "The written version of our discussion is in this book, which is still relatively fresh.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.401,
    "end": 98.823,
    "text": "And I prepared a few slides for the next 20 or 25 minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.003,
    "end": 121.841,
    "text": " The first slides are a brief review of my previous presentation, which is about the fact that the phenomenon that screams to be recognized in nature, or for that matter in physics, is the appearance and then the evolution of the flow configuration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.761,
    "end": 127.663,
    "text": " The flow configuration, as you can see here, unites the animate with the inanimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.063,
    "end": 132.204,
    "text": "In other words, it does away with the dichotomy inherited from the church.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.144,
    "end": 146.208,
    "text": "And with that idea going forward, everything that flows and moves on earth is driven by power, which comes from the consumption of fuel and food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.045,
    "end": 154.568,
    "text": " There are flow architectures, most of them natural, that function as engines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.608,
    "end": 161.692,
    "text": "For example, the atmosphere, the hydrosphere, all these things that move are driven by power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 163.002,
    "end": 167.144,
    "text": " And as they move and as they morph, they dissipate the power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.224,
    "end": 170.405,
    "text": "And I call the dissipated features breaks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.566,
    "end": 183.45,
    "text": "And on the right-hand side, you see a summary of everything, which means the geo, the bio, and the socio are morphing, meaning evolving flow architectures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.62,
    "end": 191.143,
    "text": " The statement that emerges after all these observations, again, is based on observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.243,
    "end": 199.228,
    "text": "In other words, this law of evolution in nature is of empirical origin like all laws of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.081,
    "end": 209.068,
    "text": " And it says that it actually defines the life state, which is our subject today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.088,
    "end": 216.414,
    "text": "For a flow system to persist in time, it must evolve with freedom such that it provides greater access.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.514,
    "end": 229.144,
    "text": "So the phenomenon is the evolution of flowing form, which is actually the time arrow or the definition of future as something different than the present and the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.461,
    "end": 237.024,
    "text": " The keywords are only two, the ones that will give us support in the conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.284,
    "end": 245.869,
    "text": "So, the definition of evolution from the dictionary is changes that occur in a discernible direction in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.43,
    "end": 258.376,
    "text": " That direction is known by many names, objective, purpose, goal, but there are many other such words that represent common sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.776,
    "end": 268.341,
    "text": "Freedom are physical features that allow an entity, we call that system and dynamics, to exhibit changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.889,
    "end": 274.893,
    "text": " Freedom can be measured in terms of the number of degrees of freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.933,
    "end": 285.022,
    "text": "For example, the piston moving in and out of the cylinder of the engine has one degree of freedom, which is the position of the piston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.423,
    "end": 292.448,
    "text": "Other configurations, the natural ones, have innumerable degrees of freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.106,
    "end": 296.75,
    "text": " You can look at the direction in which your cat is moving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.433,
    "end": 304.918,
    "text": "Anyway, the freedom description is a very thick book of examples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.34,
    "end": 313.788,
    "text": "The punchline is that without this physical feature called freedom, there can be no evolution and no design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.418,
    "end": 318.021,
    "text": " And for that matter, no direction in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.662,
    "end": 321.424,
    "text": "The book has 11 chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.524,
    "end": 330.471,
    "text": "Time is short, so if I'm lucky, I'll touch on the chapters highlighted in red.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.311,
    "end": 333.773,
    "text": "And I'll take them one at a time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 335.134,
    "end": 338.417,
    "text": "Economies of Scale is an observation from economics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.376,
    "end": 344.56,
    "text": " Coming from design and nature, this observation is predictable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.42,
    "end": 350.383,
    "text": "In the upper left-hand corner, this is a classroom exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.423,
    "end": 365.093,
    "text": "You can show easily that if a stream of a particular flow rate flows through two parallel tubes, meaning one stream divided to flow in parallel through those two tubes,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 365.839,
    "end": 373.964,
    "text": " That stream flows a lot easier through a single tube with a flow volume equal to the sum of the previous two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.995,
    "end": 401.782,
    "text": " In the second example, if the flow is external to the solid walls, that is, for example, in two barges that are pulled up the river by two tugboats, well, the total load on those two barges is pulled a lot easier on a single barge that is bigger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.502,
    "end": 409.147,
    "text": " So, in going from left to right, in both examples, from left to right, it is easier to go from 2 to 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.787,
    "end": 431.383,
    "text": "And that, according to the Constructal Law, direction of evolution from 2 to 1 suggests that these two examples, the phenomenon of accretion or confluence or association is part of nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.003,
    "end": 440.667,
    "text": " If that is so, then why is it that the flows everywhere around us are not of one big size?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.767,
    "end": 454.293,
    "text": "And the reason is that the flows on areas and inside of volumes, such as the animal body, are flows between one point in an area and one point in a volume.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.793,
    "end": 459.515,
    "text": "In other words, flows between one point and very, very, very many points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.376,
    "end": 473.04,
    "text": " And this kind of, let's call it, design a challenge is satisfied or answered by a flow architecture called hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.02,
    "end": 477.462,
    "text": "And again, empirically, hierarchies are everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.582,
    "end": 480.863,
    "text": "But those who are curious can discover them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.458,
    "end": 486.983,
    "text": " one by one and report them in ways that are memorable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.324,
    "end": 498.496,
    "text": "The easiest way to memorize a punchline is to arrive at the same punchline many times in presumably disconnected domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.976,
    "end": 499.697,
    "text": "So here in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.678,
    "end": 511.104,
    "text": " in a social organization, the hierarchy of cities in Europe plotted on the vertical versus the city rank.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.384,
    "end": 513.846,
    "text": "Clearly, the big cities are very few.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.8,
    "end": 531.125,
    "text": " The biggest one is only one, and then these descending lines, best known empirically as Zipf distributions, are proceeding the same way with a relatively fixed slope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.805,
    "end": 542.108,
    "text": "Over time, the lines move upward because population has been increasing, but the hierarchy remains the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.848,
    "end": 554.425,
    "text": " The zigzag line at the very top is a prediction of this descending trend, one based on a very simple model that I use in my classroom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.425,
    "end": 558.167,
    "text": " from cities in Europe to trees in the forest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.729,
    "end": 567.093,
    "text": "You see these two areas that occupy the descending diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.814,
    "end": 577.48,
    "text": "They represent data based on assuming several patterns of distribution of tree canopies on the forest floor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.56,
    "end": 579.902,
    "text": "These are tree canopies seen from above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.642,
    "end": 595.787,
    "text": " Regardless of what the pattern of construction you choose, the hierarchy is relatively rigid and it looks just like the hierarchy of cities distributed over a continent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.007,
    "end": 598.207,
    "text": "Here's another example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.927,
    "end": 599.908,
    "text": "This is in fact a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.078,
    "end": 610.502,
    "text": " an icon of the distribution of animal populations on the globe, population size versus body size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.022,
    "end": 623.007,
    "text": "It is a descending association, which, if one gets really curious, could punctuate with actual data from the zoology literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.427,
    "end": 625.608,
    "text": "Clearly, we're familiar with aircraft,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.228,
    "end": 631.272,
    "text": " airplanes are falling on the same line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.292,
    "end": 639.597,
    "text": "And the positive line is that the hierarchy is natural and the one size is not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.398,
    "end": 652.146,
    "text": "So that's a very important line to keep in mind as we, I don't know what I did that I lost my, oh my God.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.951,
    "end": 655.512,
    "text": " I cannot change this slide though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.792,
    "end": 656.553,
    "text": "What am I doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.518,
    "end": 662.978,
    "text": "Here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.739,
    "end": 667.401,
    "text": "So now I get to the next topic, inequality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.421,
    "end": 672.605,
    "text": "Here's the movement, the actual movement on the area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.906,
    "end": 677.169,
    "text": "Most familiar to us is the movement of freight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.707,
    "end": 689.57,
    "text": " It is on an area, it has many participants, but the few are large, big, they travel fast, and they travel long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.611,
    "end": 701.094,
    "text": "The same freight is carried by a multitude of smaller vehicles traveling slowly in short distances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.774,
    "end": 702.814,
    "text": "The freight is one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.374,
    "end": 705.655,
    "text": "The freight is the one that scans the area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.535,
    "end": 719.122,
    "text": " And this coexistence of the few with the many is stable, it is stasis, it is harmonious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.542,
    "end": 727.686,
    "text": "In the animal realm is the same story, you see down the slide the coexistence of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.366,
    "end": 745.237,
    "text": " few large and long and fast, with the prey that move short, slow, and the prey is very numerous, which is a coexistence that does not change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.978,
    "end": 757.345,
    "text": "Now, in the human realm, we see it also, let's say, in our lifetime, the hierarchy of movement on the globe,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.195,
    "end": 761.397,
    "text": " It is in this case represented by aviation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.758,
    "end": 773.565,
    "text": "The color red is about high density movement of people, people who are flying carpets called airplanes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.526,
    "end": 778.949,
    "text": "And the rest of the globe is all in motion, it is interconnected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 779.671,
    "end": 794.478,
    "text": " But sooner or later, individuals from the blue area have access to other points in the blue area by passing through the two chambers of the heart of world aviation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.382,
    "end": 802.787,
    "text": " So, incidentally, hierarchy in movement is synonymous with hierarchy in the consumption of fuel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.407,
    "end": 806.729,
    "text": "And what you see on the image has emerged naturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.929,
    "end": 813.033,
    "text": "It is not the result of a dictate from, say, the United Nations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.319,
    "end": 827.002,
    "text": " Now, on the left side, we learned that the hierarchy in movement and fuel use is synonymous with the hierarchy in the distribution of wealth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.742,
    "end": 838.184,
    "text": "On the left side, data from economics show the coincidence that if you plot the wealth on the vertical,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.78,
    "end": 847.563,
    "text": " and the consumption of fuel on the horizontal, the populations of the world fall on the diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.504,
    "end": 857.587,
    "text": "I regard this first graph on the left side as an entry in a dictionary, which explains what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 859.748,
    "end": 879.1,
    "text": " is known as wealth distribution in economics, is known as the consumption of fuel, or for that matter, the distribution of human movement in engineering and in physics and social dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.091,
    "end": 891.215,
    "text": " On the right-hand side, the same data are plotted with fuel use on the vertical and economic freedom on the horizontal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.835,
    "end": 899.618,
    "text": "The arrow pointing toward the future, because by the way, all these dots are racing upward, meaning listen to governmental reports.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.678,
    "end": 908.341,
    "text": "They all are about this year being better than last year, if the people get lucky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.27,
    "end": 920.421,
    "text": " Then, on the right-hand side, you see the dots are migrating toward greater freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.862,
    "end": 928.989,
    "text": "This is obvious graphically, but not known very well to the general public.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.511,
    "end": 945.556,
    "text": " Now, looking more closely at what's going on, in every such country, advanced or not so advanced, the population has unequal access to wealth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.858,
    "end": 955.562,
    "text": " common presentation of the distribution of wealth in society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.722,
    "end": 968.011,
    "text": "One vertical direction is the accumulated share of income that belongs to a particular fraction of the population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.806,
    "end": 972.848,
    "text": " So the income share is called epsilon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.368,
    "end": 975.73,
    "text": "The fraction of the population is beta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.91,
    "end": 978.811,
    "text": "We'll see this graph more than once after this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.632,
    "end": 988.316,
    "text": "And if the distribution of income were to be uniform over the population, then the curve should be the straight diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.338,
    "end": 991.421,
    "text": " But none of the curves are straight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.461,
    "end": 999.512,
    "text": "They are, in fact, convex, with, say, France and Germany being relatively close to the diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.645,
    "end": 1011.293,
    "text": " The US and China, although similar to each other, are more convex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.293,
    "end": 1021.901,
    "text": "And Brazil and South Africa, arguably less developed than the previous four, have curves that are even more convex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1022.611,
    "end": 1025.772,
    "text": " meaning deviating from the diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.153,
    "end": 1032.094,
    "text": "We're going to see very soon why this convex curve is natural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.114,
    "end": 1049.74,
    "text": "And I decided to illustrate or to present the answer by imagining a population, unlike in this graph about the four or six countries, a population of things that do not represent human society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.46,
    "end": 1070.806,
    "text": " And I have on the left side images of the so-called river basins, beginning with the actual river, River Delta, then the river basin of air flow through the lungs, river basin of water being pumped upward by the tree in Africa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.587,
    "end": 1078.009,
    "text": "And then in the bottom photograph, the river basin of skiers coming down the slope toward the chalet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.588,
    "end": 1091.537,
    "text": " They're all hierarchical, and their convex curves are crowded in the lower left corner of the epsilon versus beta graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.188,
    "end": 1098.37,
    "text": " In other words, by the way, the rest of the picture shows details of that crowdedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.13,
    "end": 1101.411,
    "text": "For the details, you have to flip through the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.631,
    "end": 1115.176,
    "text": "The point is that in the absence of people in the population on this flowing system, the inequality is much, much, much worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.856,
    "end": 1121.098,
    "text": "So social existence, meaning living together,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.058,
    "end": 1129.306,
    "text": " has brought these curves upward from the lower right corner in the direction of the diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.786,
    "end": 1135.712,
    "text": "This is, in my opinion, good news, but it is relatively unknown.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.132,
    "end": 1145.001,
    "text": "And the comparison between the living society and the, by the way, they're all life-force systems, but the comparison between the human society",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.982,
    "end": 1155.324,
    "text": " in a society of things that flow without people connected to their neighbors, that difference is striking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.665,
    "end": 1163.567,
    "text": "This brings me to two examples of social organization and how it benefits from innovation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.287,
    "end": 1172.269,
    "text": "The first example is a look at prehistory beginning from left to right in the vertical direction that Q",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.499,
    "end": 1181.025,
    "text": " represents the rate of loss of heating from a container with hot water being used by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.438,
    "end": 1192.28,
    "text": " primitive population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.82,
    "end": 1208.953,
    "text": "On the abscissa, that's the horizontal direction, is that M tilde is dimensionless and is proportional to the rate of hot water consumption by one individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.973,
    "end": 1217.681,
    "text": "It means that on the abscissa, the direction of time from prehistory to modern times is from left to right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.306,
    "end": 1241.031,
    "text": " Now, if you look at the piecewise linear curve that emerges, it starts on the left with the hunting and gathering, individuals living in huts, one pot of hot water, meaning on fire, for one particular hut.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.818,
    "end": 1250.125,
    "text": " and that pot leaks heat to the ambient, and that rate of heat leak is proportional to the Q on the ordinate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.986,
    "end": 1259.172,
    "text": "Now the invention, the first one was the idea of having a larger pot of hot water",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.102,
    "end": 1264.226,
    "text": " as shown in the example called N equals 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1265.047,
    "end": 1273.657,
    "text": "And then from that pot, the individuals are growing their own supply of hot water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.64,
    "end": 1296.188,
    "text": " And then climbing up the curve, one invention after the next leads to a social organization or leads to association, more individuals or more neighbors coming together and benefiting from one central source of hot water.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.888,
    "end": 1303.671,
    "text": "And what's interesting here is that from one invention to the next, the slope of the curve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.598,
    "end": 1321.441,
    "text": " uh decreases and that means that on a per individual basis it becomes less costly or the loss diminishes and therefore everything about hot water becomes more economical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.196,
    "end": 1331.682,
    "text": " The next graph is about another invention called dendritic design as opposed to radial design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.162,
    "end": 1345.59,
    "text": "So the dendritic design is an invention that allows the user to get by by paying even less for heat loss to the ambient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.65,
    "end": 1348.332,
    "text": "In other words, the making of hot water becomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.111,
    "end": 1350.191,
    "text": " more economical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.811,
    "end": 1373.497,
    "text": "The radial designs envelope is at the top, and you see these thin lines, they have to do with the invention, and the thin lines are descending, they're sliding downward as the size of the population, called the capital N, increases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.807,
    "end": 1383.875,
    "text": " A second example of what an invention does for the benefit of the whole population is here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.895,
    "end": 1396.045,
    "text": "I proposed this image of complete equality of a population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.126,
    "end": 1399.427,
    "text": " It's spelled out at the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.687,
    "end": 1417.519,
    "text": "You have a square domain populated with equal inhabitants, equal inputs of something, for example, water or hot water or whatever, milk if you want, and equal channels are obeyed by equal flow rates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.227,
    "end": 1430.559,
    "text": " And this area is an area that facilitates the flow of this something from the area to the point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.959,
    "end": 1437.067,
    "text": "And the point, called the source or the sink, is in the lower right corner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.173,
    "end": 1451.096,
    "text": " And going from the upper right to the lower left, the grid becomes finer, which means that the population increases on the square.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.1,
    "end": 1463.684,
    "text": " And in that direction, the convex curve of epsilon versus beta migrates toward the corner in the lower right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.185,
    "end": 1471.547,
    "text": "In other words, the distribution of this flow over the population becomes less and less equal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.108,
    "end": 1476.709,
    "text": "And that direction is the direction of the increase in the size of the population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.252,
    "end": 1481.834,
    "text": " So this is the first conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.854,
    "end": 1484.816,
    "text": "Next is what can be done about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.398,
    "end": 1492.083,
    "text": "And by the way, you may have thought of communism if you look at the first paragraph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.484,
    "end": 1505.875,
    "text": "This imposed equality on the population is easy to imagine, maybe kind of more difficult to implement, but that has been tried.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.528,
    "end": 1523.433,
    "text": " But when there's movement from the area to one point, source or sink, clearly the individual in the vicinity of that very special point benefits from a bigger beta",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.26,
    "end": 1530.982,
    "text": " corresponding to very few people like himself or herself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.722,
    "end": 1533.203,
    "text": "Anyway, what can be done about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.663,
    "end": 1544.527,
    "text": "Assume that the design has only two times two participants, as in the upper right, that simplest square.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.545,
    "end": 1549.327,
    "text": " And the simplest square is investigated here first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.268,
    "end": 1557.212,
    "text": "It is reproduced in the lower right corner and it's labeled design without innovation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.934,
    "end": 1566.338,
    "text": "To the left, there are two designs in which one innovation was implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.758,
    "end": 1570.28,
    "text": "And that innovation is represented by the solid arrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.05,
    "end": 1577.694,
    "text": " The solid arrow is the idea of somebody to reduce the flow resistance between two neighbors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.575,
    "end": 1592.284,
    "text": "So, in other words, the flow was liberated by one inventor with regard to his or her access to an adjacent neighbor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.185,
    "end": 1599.749,
    "text": "And you see here that regardless of where this inventor was located on the square,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.575,
    "end": 1609.565,
    "text": " The effect of liberating the flow is to move the curve, that curve, to move it closer to the diagonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.246,
    "end": 1616.853,
    "text": "So a single innovation is a local design change that benefits",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.354,
    "end": 1621.315,
    "text": " the entire population, not only the inventor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.696,
    "end": 1641.66,
    "text": "Next, again, all these examples have to do with changes, changes that happen in flow rates and the distribution of flow rates called movement and wealth and all these other things, including freedom over the population.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.381,
    "end": 1651.11,
    "text": " Another way to characterize all these things, the hierarchy and the inequality and so on, is the word diversity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1651.17,
    "end": 1661.019,
    "text": "Here I show several images of diversity in what concerns us the most, which is human society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.22,
    "end": 1665.504,
    "text": "This is my graphic way of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.568,
    "end": 1671.169,
    "text": " of putting in front of you where the Homo sapiens came from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.55,
    "end": 1677.651,
    "text": "This is a picture of the past two or three millennia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.051,
    "end": 1688.533,
    "text": "It began with the Homo erectus and then the first migration was two million years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.554,
    "end": 1693.395,
    "text": "The next, the Neanderthals and Denisovans was 500,000 years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1696.214,
    "end": 1705.119,
    "text": " And then the rest, you can leave the labels on this fork-shaped flow architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.7,
    "end": 1712.224,
    "text": "What I think you should pay attention to is the word artifact, which is in the red at the very top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.964,
    "end": 1713.785,
    "text": "All this movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.865,
    "end": 1726.05,
    "text": " movement toward the diversification of the population of Homo sapiens had to do with change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.49,
    "end": 1729.891,
    "text": "Change, which means, if you want, inventions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.352,
    "end": 1734.253,
    "text": "On the abscissa, on the timeline, fire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.793,
    "end": 1741.176,
    "text": "Fire was an add-on that empowered the prehistoric human.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.909,
    "end": 1748.914,
    "text": " Next, in the fire, because of fire, the first migration out of Africa became possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.495,
    "end": 1751.056,
    "text": "Next came clothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.516,
    "end": 1762.685,
    "text": "Clothing made the second migration possible, clearly, in the direction of North and Northeast Europe and Eurasia, Siberia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.886,
    "end": 1765.607,
    "text": "Clothing, big deal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.588,
    "end": 1769.61,
    "text": "Fire and clothing both have to do with power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.083,
    "end": 1774.571,
    "text": " power and heating, or the retention of that heating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.332,
    "end": 1782.304,
    "text": "And then the third power-related change or artifact was boating, boating which enabled",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.338,
    "end": 1794.083,
    "text": " these early humans and hominids to invade the world as we know it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.483,
    "end": 1805.789,
    "text": "The result, as you see the horizontal lines, is the diverse population that characterizes the globe today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.619,
    "end": 1821.316,
    "text": " And now all that means that modern humans are the object of the history that is taught in schools, that history is only the blink of one eye, 10,000 years, no more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.78,
    "end": 1828.423,
    "text": " And in this direction, more of the same took place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.463,
    "end": 1851.483,
    "text": "You look at these artifacts on the timeline at the very bottom, agriculture, the wheel, domesticated animals, and then, of course, the mechanism, the machines, language, of course, and literature, printing press, all the way to today's advancements in human affluence, which are, in fact,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1852.327,
    "end": 1854.788,
    "text": " possible because of the Industrial Revolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.808,
    "end": 1878.077,
    "text": "And now, coming even closer to who we are and closer to the present, science itself is an evolutionary design that took place and continues to take place because of freedom, freedom to innovate, freedom to communicate,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.644,
    "end": 1880.025,
    "text": " and freedom to implement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.585,
    "end": 1882.807,
    "text": "My own specialty is thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.067,
    "end": 1892.633,
    "text": "This is relatively new science, 150 years since it started to spread seriously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.193,
    "end": 1900.197,
    "text": "Before thermodynamics, the science had very strong legs, all of them successful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.338,
    "end": 1903.339,
    "text": "The heating part was called caloric theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.191,
    "end": 1907.752,
    "text": " The rest of it without heating was called mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.812,
    "end": 1912.933,
    "text": "This is as old as even before the Greeks, the old Greeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.713,
    "end": 1919.855,
    "text": "And, of course, evolution, which really means design, is also even older than the previous two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1920.075,
    "end": 1934.379,
    "text": "We see it in everything from cave paintings to the Renaissance and, of course, the kind of designing and construction that is going on today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.143,
    "end": 1942.97,
    "text": " Along the way, the science became unified with the constructor law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.47,
    "end": 1955.801,
    "text": "The branch called the heat transfer or thermal engineering joined the rest of the theory and became what I'm teaching today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.76,
    "end": 1965.866,
    "text": " and what I think is a very, very powerful science of thermodynamics with design evolution in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.966,
    "end": 1971.91,
    "text": "So, where is this arrow pointing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.01,
    "end": 1973.911,
    "text": "Obviously, it's pointing toward the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.852,
    "end": 1979.615,
    "text": "But the present, unfortunately, is a little bit complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.114,
    "end": 1984.418,
    "text": " Let me go back to the previous story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.919,
    "end": 1990.486,
    "text": "If you read any book of the history of physics or the history of thermodynamics, you'll find",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.848,
    "end": 2003.256,
    "text": " a story about individuals, the very few, beginning with Sadi Carnot and his father, named Lazar Carnot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.357,
    "end": 2011.582,
    "text": "Before that, of course, Archimedes and many of these very, very few distinguishable names.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.402,
    "end": 2017.986,
    "text": "And design evolution has its own luminaries, individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.466,
    "end": 2032.59,
    "text": " individuals who lived and created in places that were known for creativity and for the sanctity of the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.871,
    "end": 2038.772,
    "text": "Places geographically, but also places in the history of the human civilization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.913,
    "end": 2047.775,
    "text": "The names of these individuals speak of who they were, where they lived, and what language they spoke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.464,
    "end": 2055.907,
    "text": " Well, less and less of that is the character of what goes on today in science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.927,
    "end": 2069.332,
    "text": "This is a cartoon from the very popular French magazine called Pour la Science, which is something between the American scientist and the scientific American.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.091,
    "end": 2077.558,
    "text": " You see here a joke about what you see published these days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2077.798,
    "end": 2097.715,
    "text": "Articles co-authored by 10 or 20 or sometimes 40 co-authors, which give the impression or attempt to perpetuate the view that better science comes from the larger group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.771,
    "end": 2100.652,
    "text": " That is a view that's not original.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.413,
    "end": 2115.6,
    "text": "It happened with the co-activization of agriculture and the history of the 20th century is very clear about the success of that, success in quotation marks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.22,
    "end": 2121.463,
    "text": "Well, this is the present and luckily in it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.014,
    "end": 2124.095,
    "text": " This is what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2124.555,
    "end": 2141.284,
    "text": "In it, there are individuals, just like in the books of the history of science, who, by their very nature, do not feel at home marching in columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.665,
    "end": 2147.968,
    "text": "They simply run away, if they can survive, or they shy away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.308,
    "end": 2151.77,
    "text": "They are not joiners.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.745,
    "end": 2162.868,
    "text": " They are happy with their ideas because only that way they can climb peaks, unlike the margin columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.629,
    "end": 2170.911,
    "text": "So I end with the view of this little man conquering Mount Everest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.65,
    "end": 2176.974,
    "text": " I made that drawing in 1975 with a big pen in one stroke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.914,
    "end": 2185.499,
    "text": "1975 is when I was leaving MIT to become a postdoc in Berkeley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.681,
    "end": 2197.047,
    "text": "That caricature is Adrian, attracted by the idea somewhere at the very top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.038,
    "end": 2204.383,
    "text": " And this is on the left, how it looks from that very high position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.664,
    "end": 2215.332,
    "text": "The single investigator, the one driven by ideas, does two things, and both are comforting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.512,
    "end": 2215.792,
    "text": "One is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.426,
    "end": 2219.627,
    "text": " He steps on dead wood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.368,
    "end": 2228.672,
    "text": "That's a metaphor for everything from old ideas and inactive or groups that are not created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.073,
    "end": 2241.56,
    "text": "By the front of the individual, there is an infinite blue sky of opportunity in which the ideas could be projected, tried, and implemented.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.754,
    "end": 2246.116,
    "text": " So this is the thread of the book, once again, on the right-hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.597,
    "end": 2248.438,
    "text": "And I thank you for your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.841,
    "end": 2253.281,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2254.342,
    "end": 2255.063,
    "text": "Thank you, Adrian.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2255.923,
    "end": 2258.045,
    "text": "Should I stop sharing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.786,
    "end": 2260.406,
    "text": "You can leave it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2261.267,
    "end": 2261.547,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.588,
    "end": 2264.109,
    "text": "Susan, would you like to begin?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.37,
    "end": 2265.91,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.93,
    "end": 2267.011,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.628,
    "end": 2290.78,
    "text": " So what I'd like to do is kind of share some insights that have occurred to me and get you, Daniel, and you, Adrian, of whether I'm on the evolutionary track, right, or it'll give us something to riff about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.222,
    "end": 2297.964,
    "text": "So as I reread this, and I have an autographed copy here,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2299.902,
    "end": 2325.604,
    "text": " it really, the impact became much more powerful for me because one, I started understanding that there's a correlation and there's a difference in the language here, but there's a correlation, Daniel, that active, what the structural law does is actually validate active inference because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.61,
    "end": 2337.777,
    "text": " What constructive law is saying is that nature is going to evolve based on minimizing heat transfer or heat loss.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2338.057,
    "end": 2345.341,
    "text": "And free energy is saying the same thing with, you know, we are driven to minimize our free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.798,
    "end": 2348.078,
    "text": " Oh, no, no, no, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.519,
    "end": 2349.259,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.599,
    "end": 2350.459,
    "text": "Hold on, Adrian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.119,
    "end": 2358.461,
    "text": "Yeah, I know that these are two different terms, but I'm just trying to connect this for the audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.622,
    "end": 2363.343,
    "text": "And so I have some really specific questions for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.663,
    "end": 2370.085,
    "text": "So I want to kind of stay on track here and not get caught up in too much of the definitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.405,
    "end": 2374.106,
    "text": "Because one is the audience that's going to watch this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.887,
    "end": 2393.981,
    "text": " they're probably not going to be as astute about the hard science of thermodynamics versus the machine learning, the biology, the psychology, the philosophy that we really talk about here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.321,
    "end": 2399.665,
    "text": "So I'm just kind of threading that needle just so when I kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2400.669,
    "end": 2419.003,
    "text": " start start trying to capture the essence of the beauty quite frankly of the constructor law they're able to connect those those blankets okay um let me let me let me respond to what you bring up okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.64,
    "end": 2422.481,
    "text": " I think more highly of the audience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.561,
    "end": 2436.531,
    "text": "I think the audience is astute and even those like Adrian who are not experts in a particular corner of science are able to connect the dots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.312,
    "end": 2441.935,
    "text": "This is why my way of teaching is to use",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.016,
    "end": 2470.845,
    "text": " uh common language whenever uh whenever possible uh and that is the direction in which i i want to push our dialogue here i want to i want to respond to a few things that you said first design in nature or evolution is not about minimizing heat loss it is about providing meaning evolutionary design changing design morphing design to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.165,
    "end": 2475.367,
    "text": " to facilitate flow or movement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.807,
    "end": 2488.033,
    "text": "In every example of mine, the mover, the answer to the question, what moves, was the individual or the group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.473,
    "end": 2497.758,
    "text": "And yes, the individual, which is why it started with hunting and gathering, benefited as a mover, meaning as a living body,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.542,
    "end": 2506.498,
    "text": " benefited from not wasting heat from the pot of hot water, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.236,
    "end": 2511.637,
    "text": " meaning the individual benefited from being economical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2511.717,
    "end": 2524.119,
    "text": "Here you see the word being economical or being thrifted as another way of expressing the natural tendency encapsulated in the Constructor Law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.719,
    "end": 2529.14,
    "text": "So that is design in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.58,
    "end": 2534.621,
    "text": "Second, design in nature has nothing to do with what you call free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.39,
    "end": 2540.919,
    "text": " It is about this moving architecture that keeps on changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.259,
    "end": 2550.354,
    "text": "And yes, in order to move the object, I call it the thermodynamic system, the entity must be pushed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.025,
    "end": 2562.835,
    "text": " and the pushing comes from power, and the power comes from architectures, most of them natural, a few of them made by people called engines, were functioning as engines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.275,
    "end": 2573.163,
    "text": "What those systems consume from animals to people into the entire globe are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.796,
    "end": 2579.199,
    "text": " called food, fuel, and solar input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.899,
    "end": 2582.28,
    "text": "And those things are not free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.882,
    "end": 2587.122,
    "text": " Those things are not free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.002,
    "end": 2592.183,
    "text": "I can give you examples of how dear every single one is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.163,
    "end": 2598.744,
    "text": "And finally, you and I had a conversation via email.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.285,
    "end": 2611.247,
    "text": "If the audience would like to find out what free energy means, I would be happy to come back and give you, again, common sense or common language",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2612.387,
    "end": 2617.988,
    "text": " presentation of what is meant by free energy in thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.348,
    "end": 2623.889,
    "text": "It is a pretty good name for something that was coined around 1860.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.13,
    "end": 2629.27,
    "text": "But no, free energy is not free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.951,
    "end": 2636.432,
    "text": "And it is not responsible for setting things in motion or for creating changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.382,
    "end": 2638.243,
    "text": " Quite the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.323,
    "end": 2656.177,
    "text": "Free energy is a mathematical formula useful in the description of an entity that is in perfect equilibrium with its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.697,
    "end": 2657.258,
    "text": "In other words,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.335,
    "end": 2663.341,
    "text": " an entity that is not pushed by the surroundings or pushing the surroundings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.543,
    "end": 2677.539,
    "text": "But it is useful for other reasons which require an hour-long discussion and some illustration that I offer to produce if people are curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.087,
    "end": 2688.815,
    "text": " But by the way, I'm not criticizing anybody, and certainly the free energy principle is something else, not free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.975,
    "end": 2694.499,
    "text": "Keep in mind, these are two different notions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.501,
    "end": 2707.77,
    "text": "But it's very important to be very clear about the fact that in our conversation we respect the meaning of the words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.599,
    "end": 2710.12,
    "text": " Absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.18,
    "end": 2720.25,
    "text": "And thank you for that, because that actually enriched how I'm tying or binding these together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2720.27,
    "end": 2725.475,
    "text": "I kind of like to point to the economical, because that actually makes a lot of sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.696,
    "end": 2733.003,
    "text": "But in reading the book, what I did get a distinction of, and again, I want to hear",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.783,
    "end": 2744.807,
    "text": " correct me, that's not a problem, is that when we're thinking about active interference annual, we're really more focused on the agents and the interactions with the agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2745.347,
    "end": 2756.452,
    "text": "And what occurred to me, especially as I was looking through your slides, Adrian, is that the flow architecture, one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.22,
    "end": 2767.008,
    "text": " it's kind of pointing us toward what is actually flowing, and so many of our mental models are static.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2767.228,
    "end": 2775.075,
    "text": "So this is where I think that you do have to really wrestle with this, but understanding how nature is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.796,
    "end": 2806.203,
    "text": " um is designing and coalescing um and how we as interactive agents in these flow architectures are um are reacting to the um the the natural things i mean in other words in in condensing the information i was like okay the flow architecture is the natural things that are observable palatable movable and measurable okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.463,
    "end": 2815.327,
    "text": " And the flow direction and the configuration and the time, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.407,
    "end": 2820.289,
    "text": "rhythm, is actually what needs to be free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2821.71,
    "end": 2833.555,
    "text": "And I pulled one thing that I thought was really rich in terms of these features, which again are contextually bound, but they're flowing together",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2834.133,
    "end": 2846.977,
    "text": " And one point I wanted to make was is that they have to be or ask you about in terms of how are those features needing to be independent first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.697,
    "end": 2852.758,
    "text": "And number two is how they are flowing together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.798,
    "end": 2862.821,
    "text": "You pointed at it in one of the slides here, but how they are actually more economical when they are powering together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.773,
    "end": 2868.615,
    "text": " Which I think is a really key aspect here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.375,
    "end": 2871.916,
    "text": "Let me respond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.537,
    "end": 2888.383,
    "text": "I confess, early on, that's 25 years ago, coming from engineering, I saw flow first before I saw the configuration or the design",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.342,
    "end": 2891.505,
    "text": " flowing or changing or morphing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.126,
    "end": 2898.654,
    "text": "The phenomenon is not the flow and the direction or for that matter the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2899.83,
    "end": 2903.251,
    "text": " the decrease in the so-called flow resistance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.731,
    "end": 2922.476,
    "text": "The phenomenon is the tendency of the design to change, all of it to change, so that movement, which belongs to the body but also to the niche around it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.996,
    "end": 2925.799,
    "text": " that movement is facilitated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.819,
    "end": 2935.329,
    "text": "A friend of mine the other day brought up the example of one of the valves moving and flapping inside the human heart.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.541,
    "end": 2941.724,
    "text": " Yes, the valve is the niche, the flow is the blood flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.224,
    "end": 2944.325,
    "text": "The blood flow has eddies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.745,
    "end": 2947.166,
    "text": "The blood flow is constantly morphing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.767,
    "end": 2954.03,
    "text": "Keep in mind that the flow of liquid is complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.05,
    "end": 2958.432,
    "text": "It's like stuffing a rope down the throat of a gun barrel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.932,
    "end": 2964.415,
    "text": "It has configuration that's invisible to most mortals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.055,
    "end": 2984.199,
    "text": " And in the case of the living organ, the heart, the stuffing of the rope called the blood flow brings with it the rhythmic, the loving deformation of the flap of the valve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.88,
    "end": 2990.661,
    "text": "And this is all for the benefit of the moving animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.513,
    "end": 2993.935,
    "text": " Yes, the freedom and the life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.076,
    "end": 2997.659,
    "text": "I call it access, according to Constructor Law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.399,
    "end": 3000.281,
    "text": "The freedom is freedom galore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.601,
    "end": 3005.946,
    "text": "In the description of what I just told you, there are innumerable degrees of freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3006.247,
    "end": 3013.734,
    "text": "You know, the bending of the flap, the direction of the flap, the rhythm of the flap, and that's only about the flap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.214,
    "end": 3017.297,
    "text": "But when I get into the eddies inside the blood flow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.052,
    "end": 3019.973,
    "text": " Well, those are innumerable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.654,
    "end": 3022.115,
    "text": "Once again, hierarchical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.495,
    "end": 3024.056,
    "text": "A few large and many small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.436,
    "end": 3025.097,
    "text": "And they move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.857,
    "end": 3028.799,
    "text": "These blobs moving speak of rhythm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.179,
    "end": 3032.141,
    "text": "But if you take a snapshot, you see hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.182,
    "end": 3034.723,
    "text": "Yes, it's complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.083,
    "end": 3036.624,
    "text": "But it happened naturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.644,
    "end": 3043.229,
    "text": "And the direction of the happening is toward making a better and better animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.469,
    "end": 3048.511,
    "text": " a longer-living animal, a longer-traveling animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.932,
    "end": 3055.014,
    "text": "Why should the animal evolve in that direction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.474,
    "end": 3068.059,
    "text": "Because the animal, along with his or her compatriots, is a participant in the river basin of water called humanity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.692,
    "end": 3090.155,
    "text": " humanity is spending water on the globe and morphing and evolving and getting okay better at moving itself which means moving water just like any river basin or just like the hydrosphere and it's all a relatively boring conclusion because it's always the same conclusion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3090.696,
    "end": 3098.515,
    "text": " But it is a beautiful conclusion because it makes us not waste time on something that repeats itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.233,
    "end": 3120.676,
    "text": " and gives us the opportunity to come up with uh with better ideas or new ideas or uh frankly uh a bigger noise to say aha aha and i'll say another thing before i stop um you brought up more freedom yes it's very important in um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3121.849,
    "end": 3148.318,
    "text": " in my modest way of teaching these things, I show what happens if you have one of these morphing designs, anything such as a very simple drawing of a river basin, and what happens if you increase the number of degrees of freedom from one version of the design to the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.979,
    "end": 3149.779,
    "text": "So I show",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.738,
    "end": 3162.088,
    "text": " This is with pencil and paper, that as the number of degrees of freedom increases, the access, which is measured in many ways, increases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.388,
    "end": 3170.015,
    "text": "If what flows is people walking through the streets and everything, including vehicles, that means wealth increases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.296,
    "end": 3173.698,
    "text": " in the direction of greater freedom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.158,
    "end": 3184.768,
    "text": "And this is why it's no coincidence that the distribution of innovation on the globe is non-uniform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3185.289,
    "end": 3188.351,
    "text": "Non-uniform just is non-uniform.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3188.391,
    "end": 3194.017,
    "text": "In fact, it coincides with the non-uniform distribution of wealth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.855,
    "end": 3211.705,
    "text": " wealth and the consumption of fuel and all these other things that are that are undeniable so this is the coincidence to keep in mind and keep it in mind when you hear people calling for uh uniform distribution of this and uniform distribution of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.345,
    "end": 3225.075,
    "text": " and for certain groups to cut down in the consumption of fuel and to stop using commercial aviation because they are burning too much fuel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3226.076,
    "end": 3226.856,
    "text": "Think about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.176,
    "end": 3230.459,
    "text": "Think about how intelligent that proposal would be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.039,
    "end": 3243.107,
    "text": " And by the way, the reason it's not intelligent is because even if you implement it, it is calling to be replaced tomorrow, because that kind of change is unnatural, you see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.127,
    "end": 3245.708,
    "text": "Unnatural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.329,
    "end": 3250.171,
    "text": "Okay, so here's where I'm confused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.853,
    "end": 3256.575,
    "text": "And so help me to kind of pull this together, because we talk a lot about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.504,
    "end": 3263.148,
    "text": " about self-organizing systems and about degrees of freedom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.728,
    "end": 3287.408,
    "text": "And what I'm kind of teasing out, and maybe I'm confused, maybe not, but as I'm digging into this and really appreciating the richness of your precision of your language, I want to kind of capitalize on as the evolution occurs and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.301,
    "end": 3300.167,
    "text": " and how going back to the inequality and how the system is naturally going to lead to the different areas and volumes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3300.307,
    "end": 3305.27,
    "text": "The point of the area and the volume, I think that's one of the richest things that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.018,
    "end": 3328.052,
    "text": " probably the hardest to grasp in here, but also the more volume there is, and this is a question, then the more coalescence, the accretion, I believe, increases, but that also leads to fragmentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3328.732,
    "end": 3332.815,
    "text": "How does that relate to the point in the area?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.999,
    "end": 3335.78,
    "text": " Let me address that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.86,
    "end": 3345.623,
    "text": "This big volume you referred to is one feature of the object or of the design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.643,
    "end": 3347.923,
    "text": "It's called size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.464,
    "end": 3352.965,
    "text": "Everything that we use in our discussion today",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.685,
    "end": 3359.59,
    "text": " is about a thing with many features including size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.311,
    "end": 3363.433,
    "text": "Size is a natural feature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.453,
    "end": 3366.816,
    "text": "I started that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.477,
    "end": 3373.0,
    "text": "Not everything is big or not everything should be this small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.422,
    "end": 3377.304,
    "text": "Everything should be this size.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.884,
    "end": 3380.586,
    "text": "And if you look carefully at the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.251,
    "end": 3404.89,
    "text": " literature that grew around the constructor law, you'll see many predictions of what the size of the bird should be, the size of this airplane should be, and the size of this helicopter should be, because size is a natural feature of the moving flow system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3405.67,
    "end": 3415.977,
    "text": " And so, what moves is a more complicated story than accretion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.177,
    "end": 3419.919,
    "text": "Accretion comes from celestial bodies where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.676,
    "end": 3434.553,
    "text": " let's say, particles in the primordial soup attract each other and they come together, or forget about the thing that nobody saw, nobody saw the primordial soup, but you can actually look at",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.4,
    "end": 3452.268,
    "text": " at little suspensions of dust and how they become dust aggregates shaped just like snowflakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3453.109,
    "end": 3459.133,
    "text": "You see this in hidden corners somewhere in a room where no one has been for about 30 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.354,
    "end": 3461.815,
    "text": "These dendrites of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.005,
    "end": 3469.113,
    "text": " of the particles that came together because of mutual electrostatic attraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.633,
    "end": 3474.621,
    "text": "And yes, those systems by this time are dead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.629,
    "end": 3492.034,
    "text": " They are not the object of our discussion, although en route to those dendrites, they were alive and behaving just like any other flow architecture, in their case proceeding from a volume to one point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.434,
    "end": 3495.375,
    "text": "So I come to the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.316,
    "end": 3510.026,
    "text": " Anyway, the observation is that the design in nature is not about accretion, that's just one kind of flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3510.946,
    "end": 3521.034,
    "text": "It is about the whole architecture that has this purpose of enabling easier movement for the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.804,
    "end": 3522.284,
    "text": " the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3522.464,
    "end": 3532.927,
    "text": "I think what's difficult here, I recognize where my peers feel difficult to grasp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.567,
    "end": 3538.049,
    "text": "The difficulty is to get away from the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3539.725,
    "end": 3552.676,
    "text": " from the present tendency of splitting hairs, called respecting too much the infinitesimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.956,
    "end": 3554.277,
    "text": "It's called reductionism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.919,
    "end": 3559.061,
    "text": "This discussion about design in nature is about the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.442,
    "end": 3560.442,
    "text": "It's about the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.462,
    "end": 3565.407,
    "text": "It's about rising above the ground and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.489,
    "end": 3577.734,
    "text": " and engage in holism, holism, and getting away from disciplines and becoming a polymath.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.975,
    "end": 3586.218,
    "text": "If you become a polymath, you become closer to being a street person, a person who looks at this poster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.318,
    "end": 3591.921,
    "text": "This poster reads 10 different books, 10 different books, not just narrow, narrow, narrow, narrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.641,
    "end": 3612.478,
    "text": " and a person who does not live in a cubicle or in a locker room, a person who has many friends, a person who knows more than one language, a person, yes, this is meaning a truly, truly common person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.278,
    "end": 3618.503,
    "text": "And that's the invitation to the scientists to get out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.162,
    "end": 3648.389,
    "text": " get out of the department you know physically or figuratively and smell the roses uh because beauty beauty is uh where you don't don't expect to find it okay meaning it's uh it's maybe maybe behind the house or the neighbor that's probably where the beauty is so well this one because that's what say rich but i could go on for hours i'm going to turn this back over to daniel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.208,
    "end": 3671.502,
    "text": " um yeah because i thank you so much because this has been thank you susan just in our last minutes um i'll just add a few small points um first just beginning with the last common person is that what is held in commons a commons person and the stewardship of the commons then in your drawing with a mountain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3672.469,
    "end": 3676.653,
    "text": " There was the peak up and there was the path out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3677.133,
    "end": 3682.578,
    "text": "And it was like a person walking on a path forward out and a river afloat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3683.099,
    "end": 3686.902,
    "text": "And time, as you began with, is goal flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3687.383,
    "end": 3689.345,
    "text": "It flows in the goal-oriented direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3689.525,
    "end": 3690.406,
    "text": "Yes, there's more to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3691.146,
    "end": 3693.629,
    "text": "And it's flowing, falls, rolled downhill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3694.309,
    "end": 3696.511,
    "text": "And the organism walks forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3696.551,
    "end": 3697.792,
    "text": "It can't walk backwards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.693,
    "end": 3703.759,
    "text": " And then the last point is the distributions empirical that you presented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3704.76,
    "end": 3711.186,
    "text": "Jeffrey West and others have highlighted that empirical aspect of the outcomes and their distributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3711.827,
    "end": 3718.594,
    "text": "However, you tied that to the zero to one to two to three dimensional distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.495,
    "end": 3738.76,
    "text": " um transfer point where from one to two is like a point spreading out on a plate and three dimensional is like a point radiating out these are fundamental equations that are kind of in your engineering toolkit because they have to do with like for example heat distribution but that's just related to the modes of vibration and the degrees of freedom of the molecules",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3739.68,
    "end": 3747.304,
    "text": " as a secondary distributional approximation to an actual size specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3747.665,
    "end": 3765.715,
    "text": "And that's why there are river bifurcations that are this big and not river bifurcations that are a micron and all these other kinds of things that are not just the neutral we need to explain away about nature, but just straight down the middle with what the study of nature is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3767.56,
    "end": 3768.081,
    "text": " That's right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.462,
    "end": 3771.204,
    "text": "Yes, I couldn't agree more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.224,
    "end": 3779.832,
    "text": "I get enlightened by this kind of commentary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3783.415,
    "end": 3786.058,
    "text": "You mentioned Jeffrey West.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.138,
    "end": 3787.339,
    "text": "He's one of the few",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.819,
    "end": 3794.062,
    "text": " in whose company I feel at home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.122,
    "end": 3814.152,
    "text": "It's important once again to look at life from both sides, as in the song, and make a very strong effort not to become an ideologue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3819.033,
    "end": 3830.135,
    "text": " I like the opposite of that, which is that my students' idea may be better, you see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.155,
    "end": 3832.476,
    "text": "I get corrected every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.756,
    "end": 3834.256,
    "text": "I teach this course right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3834.336,
    "end": 3836.837,
    "text": "I teach it to an overflow crowd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.177,
    "end": 3843.158,
    "text": "And quite frequently, not every day, they correct me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.878,
    "end": 3845.299,
    "text": " They say, how about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.139,
    "end": 3851.921,
    "text": "And it's like free food for me, this sort of reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.822,
    "end": 3855.562,
    "text": "The listeners should pay attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.682,
    "end": 3858.103,
    "text": "I don't get these comments from my colleagues, okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.744,
    "end": 3862.985,
    "text": "I get them from these nobodies, from these nobodies called students.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.106,
    "end": 3865.366,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.597,
    "end": 3867.618,
    "text": " Don't say that too loud.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3868.118,
    "end": 3869.66,
    "text": "It's a perfect note.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3869.76,
    "end": 3889.054,
    "text": "And it's one of the things I've always loved the most is outside of the organizational structure and the shape of the building is about the fact that it's first principles and about the opportunity, though, unlikelihood or not of a transformative epistemic relationship across all language and all professional boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3889.855,
    "end": 3894.058,
    "text": "So thank you, Adrienne, for also living this and sharing how you've done it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3895.071,
    "end": 3895.251,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.032,
    "end": 3896.152,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.193,
    "end": 3896.974,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3897.734,
    "end": 3898.656,
    "text": "This has been awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.337,
    "end": 3900.338,
    "text": "Thank you to both of you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.358,
    "end": 3901.199,
    "text": "Until next time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3901.219,
    "end": 3901.319,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  }
]