[
  {
    "start": 8.683,
    "end": 27.314,
    "text": " hello and welcome it's september 20th 2020 23. we're at the active inference institute in the course active inference for the social sciences and here with mal abarasan who will be presenting today on norm scripts and linguistics under active inference so thank you mal to you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.375,
    "end": 31.536,
    "text": " Awesome, so hi everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 31.816,
    "end": 38.54,
    "text": "As last time, there was a presentation on semiotics and semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.64,
    "end": 43.463,
    "text": "I won't dig too far into linguistics, but I'll touch on it at the end of the course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 44.944,
    "end": 47.145,
    "text": "So, what are we going to do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.986,
    "end": 55.43,
    "text": "In this module, we're going to explore the concept of active inference and its relevance to social norms and human decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 56.44,
    "end": 69.849,
    "text": " As you will have seen in the previous classes, active inference is a theoretical framework that seeks to explain how organisms, including humans, engage with their environment to minimize uncertainty and maintain their internal states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 70.289,
    "end": 78.615,
    "text": "We're not going to dig into these concepts too much because I assume they have been previously explained at length.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 78.675,
    "end": 82.258,
    "text": "However, I will explain how they connect to social phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 83.223,
    "end": 95.028,
    "text": " So this framework has significant implications for understanding social behavior as it can help explain how individuals conform to social norms and make decisions based on the expectations of others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 96.169,
    "end": 110.455,
    "text": "We'll delve into the role of active inference in human societies, emphasizing how humans and other organisms constantly seek to minimize their uncertainty about the world by updating their beliefs and taking actions to maintain a stable internal state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 112.179,
    "end": 114.622,
    "text": " This is a crucial process for survival.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.942,
    "end": 119.788,
    "text": "It allows individuals to predict and adapt to their environment in the context of human societies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.889,
    "end": 132.402,
    "text": "Active inference plays a critical role in explaining how individuals navigate complex social situations, conform to social expectations, and make decisions that align with their beliefs and values.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.746,
    "end": 144.456,
    "text": " Furthermore, we'll explore the concept of deontic value with inactive inference, which refers to the value attributed to actions based on their adherence to social norms and expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.578,
    "end": 157.848,
    "text": "By adhering to social norms, individuals can minimize the uncertainty associated with their actions and maintain a sense of predictability and stability in their social environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 158.752,
    "end": 167.722,
    "text": " So together, all these insights will provide you with a comprehensive understanding of the complex interplay between active inference, social norms, and human decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 168.984,
    "end": 169.604,
    "text": "So let's dive in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.694,
    "end": 172.996,
    "text": " We'll start by introducing a philosophical framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.576,
    "end": 182.422,
    "text": "Building on the framework of active inference, inactivism offers us a complementary lens to understand the dynamic and contextual nature of social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 183.002,
    "end": 193.029,
    "text": "So while active inference provides the computational underpinnings for understanding social norms and decision-making, we still need to anchor ourselves within a larger theoretical framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 193.689,
    "end": 200.614,
    "text": "Inactivism enriches this perspective by emphasizing the practical and developmental aspects of social understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 203.216,
    "end": 204.076,
    "text": " What is inactivism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.157,
    "end": 221.148,
    "text": "If it hasn't been introduced before, inactivism is a philosophical stance that extends beyond traditional theories of cognition, emphasizing the role of interactions and relational dynamics in shaping both individual and social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 223.47,
    "end": 231.692,
    "text": " It argues that cognition is a dynamic, real-time, fluid, and contextual social action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.553,
    "end": 239.455,
    "text": "Generative models in hermeneutics serve as a cognitive structure and framework for interpretation, respectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.211,
    "end": 257.716,
    "text": " These elements are continuously updated based on social interactions and signals, thereby facilitating effective communication and understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 259.017,
    "end": 268.122,
    "text": "Hermeneutics provides a theoretical framework for interpreting social signals and cues, crucial for effective social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 269.775,
    "end": 278.197,
    "text": " So, hermeneutics allows for a nuanced understanding of contextually constituted meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.398,
    "end": 288.32,
    "text": "It goes beyond the conventional notion of self-contained objects to explore the deeper contextual meanings in behavior and cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 290.489,
    "end": 302.638,
    "text": " Gadamer's hermeneutics offers a way to analyze social action that goes beyond positivist and humanist approaches by fusing the conceptual schemes of the observer and the social actor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.379,
    "end": 316.488,
    "text": "It complements inactivism by providing the interpretive framework that are continuously updated through social interactions, enriching our understanding of cognition as dynamic, real-time, and contextual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 319.352,
    "end": 337.615,
    "text": " In the realm of social cognition, inactivism introduces the concept of generalized synchronization, which allows for a nuanced understanding of how social interactions mutually influence cognitive processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 339.556,
    "end": 343.676,
    "text": "The relationship between individual beliefs and social expectations is complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 344.356,
    "end": 347.997,
    "text": "It's fundamentally shaped by our interactions with the others and the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 350.043,
    "end": 355.647,
    "text": " we thus see that meaning is co-constituted by the individual and the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 356.688,
    "end": 366.815,
    "text": "If we adopted an activist and hermeneutics approach, we find the philosophical foundations that lead into a comprehensive overview of the intersection with social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 367.876,
    "end": 373.66,
    "text": "If you want more references to read about these topics, you can ask me at the end of the class and I can send you a few.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 375.948,
    "end": 384.17,
    "text": " It's essential to note, however, that there are some criticisms that point out the limitations of inactivism in explaining social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 385.971,
    "end": 394.973,
    "text": "One of the key criticisms is that current articulations of inactivism are not yet up to the task when it comes to explaining complex social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.756,
    "end": 405.759,
    "text": " Despite these criticisms, inactivism provides a consistent epistemology for a psychology that is intrinsically social.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 407.93,
    "end": 415.897,
    "text": " Looking forward, the field of inactivism and social cognition is ripe for exploration and would benefit from a deeper connection to active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 416.178,
    "end": 429.37,
    "text": "There has been such research, so researchers like Maxwell Ramstad has developed a concept of inactive inference, which offers a promising avenue for integrating inactivism and active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 430.563,
    "end": 439.027,
    "text": " His research aligns with folk psychology and suggests that these frameworks can coexist and enrich our understandings of social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 440.688,
    "end": 449.412,
    "text": "Future other directions could involve, for instance, integrating inactivism with other cognitive theories and exploring its applicability in real-world social scenarios.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 449.953,
    "end": 454.495,
    "text": "Through its connection to active inference, we can make accurate and testable predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 456.721,
    "end": 473.133,
    "text": " So while inactivism now provides us with a foundational understanding of cognition and social interaction, the concept of agency further enriches this understanding by introducing more philosophical perspectives that align with or diverge from inactivism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 473.233,
    "end": 477.656,
    "text": "So we can build on top of inactivism through the notion of agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.652,
    "end": 487.819,
    "text": " So we will now focus on the key issue of inactivism, which is how does agency emerge?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.899,
    "end": 492.724,
    "text": "How do things self-organize through their interaction with the environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.764,
    "end": 494.245,
    "text": "Why are they not fully determined?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.066,
    "end": 504.055,
    "text": "How can we account for agency in a system where effectively self-organization is seen as some degree of determined by the materiality of the agent and its environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 506.556,
    "end": 514.902,
    "text": " Agency is a complex construct that has been explored through a multitude of philosophical and scientific frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.123,
    "end": 528.793,
    "text": "One prominent approach is the inactive affordance-based perspective, which underscores the centrality of the I-can notion in shaping both cognitive processes and behavioral outcomes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.134,
    "end": 536.796,
    "text": " So Maxwell-Ramstein again substantiates this perspective and resonates with the research conducted by Bruinberg in 2018.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.056,
    "end": 543.857,
    "text": "He posits, for instance, that agency is far from being a mere passive state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 544.257,
    "end": 548.038,
    "text": "Rather, it involves active, dynamic engagement with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 550.339,
    "end": 559.561,
    "text": "Current investigations in this domain are being, for instance, continued by researchers like Rudi Pitlia, who is working on connecting properly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 560.514,
    "end": 565.639,
    "text": " the psychological phenomenon of agency in active inference modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 567.14,
    "end": 574.527,
    "text": "In parallel, Tom Holtz's Bayesian models conceptualize active inference as a Bayesian process aimed at minimizing prediction error.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 576.075,
    "end": 590.199,
    "text": " This model finds support in the work of Cal and Kopp and suggests that agency is an active endeavor to align sensory inputs with internal predictions, thereby fostering a sense of control and self-efficacy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.179,
    "end": 598.921,
    "text": "The cybernetic interpretations offers a more mechanistic lens, focusing on control mechanism and homeostasis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 600.205,
    "end": 611.693,
    "text": " In this view, agency is not just about accurate predictions, but also about maintaining a balanced state through dynamic interactions with the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 613.074,
    "end": 620.019,
    "text": "Recent studies highlight the significance of performance-based inferences in shaping our sense of agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 622.796,
    "end": 632.403,
    "text": " That approach suggests that the congruence between our actions and their expected outcomes plays a pivotal role in strengthening or weakening our sense of agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.824,
    "end": 643.431,
    "text": "So collectively, these diverse interpretations serve as intellectual bridges connecting the domains of philosophy, psychology, and computational neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.707,
    "end": 658.279,
    "text": " They offer complementary insights that enrich our understanding of agency, thereby contributing to the broader discourse on inactivism and its application in understanding complex cognitive and social phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.942,
    "end": 665.005,
    "text": "So how is agency extended?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.758,
    "end": 674.924,
    "text": " Deep temporal models and the concept of agency both focus on the minimization of uncertainty and the optimization of decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.285,
    "end": 692.317,
    "text": "Deep temporal models provide a computational framework that can model the complex, time-dependent patterns of behavior and cognition, offering insights into how agencies exercise in dynamic social contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 693.874,
    "end": 713.884,
    "text": " In the context of our overall goal of understanding scripts through active inference, combining deep temporal models with theories of agency allows us to create more nuanced and predictive models of how individuals navigate social norms and make decisions through goal-directed actions across different scales of concern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 715.515,
    "end": 730.071,
    "text": " In social cognition, deep temporal models help individuals anticipate and adapt to changes in their social environment across timescales that go beyond what would be considered simply reactive, thereby reducing uncertainty and enhancing decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 732.594,
    "end": 736.819,
    "text": "An individual can plan and extend agency beyond the current moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 738.755,
    "end": 748.037,
    "text": " So in the realm of planning algorithms, deep temporal models allow us for a theoretical foundation for optimality, especially when resources are limited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 749.277,
    "end": 754.698,
    "text": "They enable state abstraction and cognitive control, essential elements in hierarchical planning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 756.258,
    "end": 764.08,
    "text": "Deep temporal models also contribute to various cognitive processes such as action understanding and language processing, which we will discuss later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 765.233,
    "end": 773.363,
    "text": " They can be interpreted and integrated into deep reinforcement learning algorithms to develop socially aware navigation policies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 774.885,
    "end": 784.317,
    "text": "Deep temporal models thus serve as a computational bridge between the neural mechanisms of action, understanding, and the cognitive processes that give rise to agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 786.949,
    "end": 798.431,
    "text": " So what might be potentially a neural mechanism that allows us to connect deep temporal models to social interactions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.592,
    "end": 803.612,
    "text": "This is where we bring in the insights from mirror neuron systems and active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 804.653,
    "end": 811.774,
    "text": "This way we can have a more comprehensive model that not only predicts but explains how individuals exercise agency in complex social landscapes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.565,
    "end": 826.455,
    "text": " Here, mirror neurons serve as a neural cornerstone for social cognition, firing not only during the execution of an action, but also during the observation of that same action performed by another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.876,
    "end": 836.904,
    "text": "These specialized neurons are central to the continuous updating of internal models of the environment, including the actions and intentions of others.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 838.373,
    "end": 849.92,
    "text": " They minimize uncertainty and facilitate navigation through complex social landscapes, allowing us for smoother social interactions and more effective communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 851.842,
    "end": 857.405,
    "text": "So here, the deep temporal models are hierarchical generative models that offer a computational framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.626,
    "end": 865.19,
    "text": "And these models are adept at handling the complexities of self-agency and other agencies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 866.502,
    "end": 878.271,
    "text": " In the context of self-agency, a deep temporal model affords a high bias or precision to proprioceptive predictions, which gives us a nuanced understanding of one's own actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.753,
    "end": 888.239,
    "text": "When observing another, this bias is adaptively suppressed, enabling the system to be flexible and context sensitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 890.899,
    "end": 897.405,
    "text": " The interplay between mirror neurons and deep temporal model is thus a compelling area of research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 898.446,
    "end": 906.413,
    "text": "Mirror neurons contribute to the process of updating internal models, which is a core function of deep temporal models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 907.755,
    "end": 913.4,
    "text": "This synergistic relationship allows for a more nuanced understanding of action prediction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 917.932,
    "end": 922.755,
    "text": " We can see a deep and significant implication for long-term planning in social context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.396,
    "end": 935.804,
    "text": "The continuous updating of internal models facilitated by mirror neurons and computationally powered here through the deep temporal models is crucial for making complex decisions and planning future social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 938.125,
    "end": 944.95,
    "text": "There's been recent research that indicates that our capacity to understand actions extend beyond the mirror neuron systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 945.677,
    "end": 949.26,
    "text": " which involves the activation of areas signaling unexpected events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 950.781,
    "end": 966.514,
    "text": "This adds another layer of complexity to the already intricate interplay between the neurons and the models, which suggests that our understanding of action prediction and social cognition is far from complete, but is advancing rapidly thanks to these integrated frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 968.001,
    "end": 981.432,
    "text": " Given the ongoing research on mirror neurons, we have to consider how computational models like deep temporal models can offer a more nuanced framework for studying these neural mechanisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 982.833,
    "end": 987.917,
    "text": "Let's try to think about some of the issues with mirror neuron research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 990.154,
    "end": 991.555,
    "text": " It's not without controversy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 992.235,
    "end": 998.137,
    "text": "Some critical reviews argue that there's no compelling evidence supporting the role of mirror neurons in action understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 999.338,
    "end": 1006.14,
    "text": "Others can suggest that mirror neurons may be involved in lower level processes of action perception, but not in higher level intention understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1007.14,
    "end": 1015.124,
    "text": "So we need more studies to control for premotor contributions to action perception and provide a clearer definition of what is meant by action understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1016.484,
    "end": 1018.705,
    "text": "This is particularly important as some research indicates that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.554,
    "end": 1023.215,
    "text": " there may be no proof that mirror neurons lead to action understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1025.456,
    "end": 1027.997,
    "text": "This doesn't mean that it negates the importance of these systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1028.037,
    "end": 1033.46,
    "text": "It means we need more research to make sure that they are, in fact, related to action understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1034.9,
    "end": 1044.484,
    "text": "The functional properties of the mirror neuron system indicates that action understanding may primarily be based on the motor cognition that underpins one's own capacity to act.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.748,
    "end": 1052.431,
    "text": " So we will now consider how these neural mechanisms can be integrated into broader frameworks like extended and optimized active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.712,
    "end": 1064.877,
    "text": "So by doing so, we can leverage generative models to provide a more nuanced understanding of action perception, prediction, social cognition, and adapting behaviors to lead us to scripts, gender perspectives, and cultural affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1067.499,
    "end": 1069.32,
    "text": "We have expanded in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1070.34,
    "end": 1072.101,
    "text": "Now let's expand in space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.914,
    "end": 1083.337,
    "text": " Extended and optimized active inference represents a comprehensive framework that bridges between internal cognitive processes and external environmental interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1084.957,
    "end": 1097.421,
    "text": "Generative models serve as the cornerstone, extending beyond the confines of an organism's brain and body to incorporate external cognitive resources such as maps or written language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1098.53,
    "end": 1107.455,
    "text": " This extension not only enhances the efficiency and accuracy of these models, but also has practical implications in various domains like social interactions and language processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1109.696,
    "end": 1119.442,
    "text": "If we think of a cognitive niche, the framework introduces key dynamics like selective, developmental, and organism niche coordination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.891,
    "end": 1132.424,
    "text": " The dynamics elucidate the intricate relationship between organisms and their environment, including the reciprocal effects of environmental modifications and selection pressures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.246,
    "end": 1139.052,
    "text": "In sequential dynamics, generative models facilitate effective communication and understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1140.691,
    "end": 1153.397,
    "text": " They allow us to see the emergence of behavioral and neurophysiological correlates, such as theta-gamma coupling, which we will discuss later, in neural activity, which can be seen as an emergent property of belief updating under variational message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1155.938,
    "end": 1165.082,
    "text": "Building upon the foundational aspects of extending and optimized active inference, it's crucial to delve into its specific applications in social contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.957,
    "end": 1181.503,
    "text": " When we optimize our generative models through social scripts and norms, we can see how extending active inference serves as a practical tool for navigating and modifying complex social landscapes, aligning with the framework's broader goals of cognitive niche construction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1184.104,
    "end": 1189.826,
    "text": "So we can see that this integrates both internal and external cognitive resources to optimize the generative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1193.189,
    "end": 1200.797,
    "text": " Scripts serve as a cognitive blueprint that reduce the uncertainty and facilitate successful social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1201.618,
    "end": 1206.363,
    "text": "They're continuously updated through adapted changing social landscapes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1207.124,
    "end": 1210.167,
    "text": "They enhance the fluidity and adaptability of social behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1212.071,
    "end": 1223.322,
    "text": " Social norms act as a macro-level behavioral expectation that shapes the social environment and creates favorable niches for human interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.743,
    "end": 1232.491,
    "text": "These norms are internal representations that help individuals navigate complex social environments effectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.399,
    "end": 1244.502,
    "text": " So here, cognitive niche construction involves active modification of the environment to create those favorable contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.403,
    "end": 1255.826,
    "text": "Extended active inference takes this a step further by allowing for the optimization of generative models, creating environments that are not just favorable, but also harmonious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.503,
    "end": 1268.271,
    "text": " The comprehensive approach here has implications that span from psychology, sociology, artificial intelligence, and allows us to potentially set the stage for future research in cognitive science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.933,
    "end": 1277.638,
    "text": "So here we see that there's an importance to optimizing internal models for effective social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1278.854,
    "end": 1294.822,
    "text": " So while extended active inference focuses on the broader cognitive architecture involving generative models and social norms, here we zero in on the role of deontic value and social conformity, providing a more nuanced understanding of how individuals adapt and shape their social environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.463,
    "end": 1305.127,
    "text": "So the concept of deontic value refers to the value attributed to actions based on their adherence to social norms and expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.386,
    "end": 1309.907,
    "text": " It allows us to guide individual choices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.207,
    "end": 1323.772,
    "text": "When faced with a decision, an individual way, the deontic value of potential actions against other factors like personal preferences, beliefs, to determine the most appropriate course of action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1323.792,
    "end": 1325.893,
    "text": "If you'll just allow me one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1330.894,
    "end": 1335.476,
    "text": "So this ties us very nicely to the notion of agency that we explored before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1337.119,
    "end": 1351.927,
    "text": " In Regimes of Expectations by Axel Constant, we elaborate that deontic cues enable the environment to learn about the behavior of its inhabitants, effectively outsourcing the epistemic and pragmatic values of any behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1355.69,
    "end": 1359.772,
    "text": "You can see that the extension of active inference here takes on a whole other meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1362.601,
    "end": 1375.546,
    "text": " Active inference allows for dynamic adaptation, enables the individual to update their internal models, better anticipate, and connect to their environment such that the environment and the individual mutually model each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1375.566,
    "end": 1382.528,
    "text": "The ontic value here serves as a common thread between active inference and regimes of expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1386.015,
    "end": 1393.096,
    "text": " Through these regimes of expectation and active inference, we'll achieve a better understanding of social conformity and decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.237,
    "end": 1410.92,
    "text": "Regimes of expectation centers on the computational construct of deontic value, which we explained before, and aligns with the broader research on social conformity, especially the winner-takes-all model proposed by Frank in 2008.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.409,
    "end": 1425.776,
    "text": " Social expectation here plays a significant role in shaping human decisions, and specifically social conformity acts as a learning strategy which is effective in uncertain environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1427.277,
    "end": 1439.564,
    "text": "So now that we build on the foundational role of deontic value and the regimes of expectation, we find that this computational construct also serves as a crucial weighing factor in individual decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.806,
    "end": 1445.789,
    "text": " So we'll see how we can put this effect directly on decision making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1449.352,
    "end": 1459.699,
    "text": "Regimes of expectations have basically a function of fitness enhancing social conformity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.92,
    "end": 1464.723,
    "text": "It suggests that conforming to social norms has evolutionary advantages.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.092,
    "end": 1472.597,
    "text": " it leads into a circular causality between shared Bayesian expectations and individual policy selection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1474.319,
    "end": 1482.205,
    "text": "It's consistent with findings by Sanfi in 2014, which emphasize the importance of norms and expectations in social decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1485.628,
    "end": 1492.174,
    "text": "So now that we have how the environment and the individual co-construct through these regimes of expectations,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1494.258,
    "end": 1500.101,
    "text": " We will find how this allows us to construct a sense of self, specifically the social self.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.422,
    "end": 1511.387,
    "text": "Here, social norms and shared Bayesian expectations link our individual and collective decision-making processes to the broader understanding of selfhood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1518.47,
    "end": 1522.372,
    "text": "So how does active inference allow us to model how we derive the sense of self?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1524.022,
    "end": 1530.666,
    "text": " Let's start by explaining the three main types of selves, minimal, narrative, and social.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1532.647,
    "end": 1541.732,
    "text": "The minimal self is the pre-reflexive experience of being a subject, emphasizing the body's role in shaping subjective experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.874,
    "end": 1552.539,
    "text": "The narrative self is shaped by personal stories and experiences, highlighting the importance of generative models in organizing these experiences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.884,
    "end": 1564.791,
    "text": " aligns with the active inference formalism and psychological desires, providing a coherent narrative that guides our sense of self across time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.493,
    "end": 1576.98,
    "text": "So social self emerges from interactions with others and is influenced by social norms, values, and shared generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1579.742,
    "end": 1583.485,
    "text": "This concept is supported by the full concept of intentionality,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1584.144,
    "end": 1588.727,
    "text": " which includes desires, beliefs, intentions, awareness, and skill.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1591.009,
    "end": 1600.475,
    "text": "Understanding these facets of the sense of self through the lens of active inference gives us an integrative cognitive process for emotions and social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1602.356,
    "end": 1610.962,
    "text": "So now we'll delve more into the intricacies of the social self to show that the generative model and social scripts discussed earlier are integral to its formation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1612.025,
    "end": 1624.729,
    "text": " These scripts, optimized through extended active inference, not only guide our social interactions, but also contribute to the shaping of that self, creating a seamless interplay between individual cognition and collective social behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1627.31,
    "end": 1636.213,
    "text": "So as we said earlier, social scripts are the cognitive blueprints that guide individuals through a myriad of expected actions or events in social contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.486,
    "end": 1642.951,
    "text": " These scripts are essentially generative models that help individuals predict and navigate social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1644.353,
    "end": 1645.233,
    "text": "They're indispensable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1645.313,
    "end": 1652.0,
    "text": "They allow us to continuously update our internal models to minimize uncertainty and achieve a stable internal state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1653.561,
    "end": 1660.448,
    "text": "It's particularly important in a world where social interactions are increasingly complex and laden with unspoken expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1663.916,
    "end": 1674.883,
    "text": " This optimization serves as a micro-level mechanism that complements the macro-level influence of social norms and deontic values, creating a cohesive understanding of social behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1677.265,
    "end": 1691.595,
    "text": "Social scripts can be enshrined in deontic cues, which enable the environment to learn about the behavior of its inhabitants, effectively outsourcing the epistemic and pragmatic values of any behavior, as we saw earlier in cognitive niche construction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.598,
    "end": 1705.866,
    "text": " The concept of contextual modulation integrates sensory and motor cues to influence our actions and decisions, allowing for dynamic adaptation and refinement of generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.849,
    "end": 1723.398,
    "text": "Through this modulation, we can see how social scripts and norms are shaped and adapted over time, which promotes the adaptability in the face of changing environments of individuals embedded in that environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.708,
    "end": 1746.401,
    "text": " Now, contextual modulation here is pretty important, and the mechanism not only refines our generative model, but also provides the adaptive flexibility required in complex environments, which unites the theoretical underpinnings of active inference with empirical findings on adaptive behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1750.502,
    "end": 1761.472,
    "text": " According to Francesco Donnarumma, action perception is an active inferential process that combines motor prediction and hypothesis testing, crucial for understanding social scripts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1763.013,
    "end": 1769.84,
    "text": "Adaptive social behavior thus results from the dynamic interplay of socio-affective and socio-cognitive processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1771.502,
    "end": 1780.651,
    "text": " Research by Berg-Murza provides proof of concept that social context may alter perception, enabling more adaptive behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.473,
    "end": 1792.823,
    "text": "It's also supported by studies that reveal how instinctive behavior circuits in hypothalamus dynamically encode spatial and sensory cues to drive adaptive social behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1795.182,
    "end": 1812.596,
    "text": " Contextual modulation and social scripts are integral to adaptive behavior and action perception, which allows us to show how social interactions are crafted through these different scale, these deep temporal models that integrate various kinds of priors at different scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1814.117,
    "end": 1820.602,
    "text": "So here, contextual modulation acts as a linchpin in the integration of social scripts into the generative models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1823.746,
    "end": 1830.829,
    "text": " We can now appreciate how generative model and social scripts coalesce to form a comprehensive framework for understanding interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.491,
    "end": 1852.558,
    "text": "So, active inference is a nuanced lens to explore how power dynamics shape shared generative models, thereby influencing the cultural affordances available to individuals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.855,
    "end": 1863.922,
    "text": " For instance, epistemic communities serves as platforms where power dynamics can significantly shape shared beliefs and actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1865.083,
    "end": 1884.578,
    "text": "Through the construction of certain niche, we can see that existing power structure lead to the creation of environments that perpetuate these structures through certain kinds of scripts, certain kinds of norms, and through the valence that we associate to our sense of self relative to these scripts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1886.613,
    "end": 1891.055,
    "text": " Cultural affordances here are dynamically influenced by power-tinged asymmetries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.876,
    "end": 1900.36,
    "text": "These asymmetries can affect how individuals perceive and enact social scripts, which further shapes the cultural affordances that they encounter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1903.582,
    "end": 1908.824,
    "text": "We see how deeply intertwined cultural affordances are with power dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.805,
    "end": 1915.708,
    "text": "It allows us to understand societal structures in more depth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1917.921,
    "end": 1930.087,
    "text": " So when we expand the scope of active inference and cultural affordance negotiation, we can dive into a case study, that of gender norms and gender fluidity to broader cultural contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1931.808,
    "end": 1934.77,
    "text": "This exemplifies the influence of power dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1937.171,
    "end": 1946.556,
    "text": "So just as individuals navigate and adapt to cultural affordances that are deeply shaped by societal power structures, they have to navigate gender-related affordances that they also engage with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1951.246,
    "end": 1954.589,
    "text": " So through this, we can also understand the concept of gender fluidity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1956.071,
    "end": 1963.838,
    "text": "Here, generative model plays a specific role, which is to adapt to changing societal norms and gender-related affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1963.898,
    "end": 1965.379,
    "text": "These are cultural affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1967.341,
    "end": 1975.329,
    "text": "This dynamic from a niche construction allows individuals to create and adapt environments that reflect their evolving gender identity and expression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1978.186,
    "end": 1981.667,
    "text": " The concept of affordance negotiation is particularly relevant here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.867,
    "end": 1991.61,
    "text": "It refers to the process by which individuals adapt their behavior to maximize opportunities and minimize challenges in their environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1993.75,
    "end": 1999.672,
    "text": "In the context of gender fluidity, it involves navigating complex social scripts and norms that shape gender expression.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2002.375,
    "end": 2008.639,
    "text": " Research suggests that these gender differences in negotiation are contextually bound and can be subject to change.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.28,
    "end": 2020.247,
    "text": "By understanding how individuals navigate these social scripts and norms, we can for instance address the limitations or constraints that affect expressions of their gender identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2022.648,
    "end": 2030.213,
    "text": "So here, gender through the lens of active inference as a case study and affordance negotiation gives us a comprehensive view of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2031.556,
    "end": 2036.161,
    "text": " the social psychology and how it can apply to gender studies, for instance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2036.201,
    "end": 2038.963,
    "text": "But this is true for many other kinds of cultural phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2041.406,
    "end": 2046.751,
    "text": "So we build now on the understanding of how active inference and power dynamics shape cultural affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.834,
    "end": 2054.879,
    "text": "We can see how this allows us to understand potentially puzzling actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.227,
    "end": 2061.669,
    "text": " which are shaped by social scripts and the dynamics within the epistemic communities they inhabit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2061.749,
    "end": 2073.893,
    "text": "So we have defined how scripts allow us to interpret different kinds of behaviors and how people navigate their desired outcomes given these social scripts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2075.933,
    "end": 2079.414,
    "text": "So what happens when we are faced with puzzling actions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2080.775,
    "end": 2084.256,
    "text": "People rely on their generative models to update their beliefs and expectations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2085.103,
    "end": 2089.425,
    "text": " So do we interpret these behaviors based on inherent traits or situational reasons?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2091.505,
    "end": 2098.868,
    "text": "Here, traits and motives interact in predicting behaviors, channeling the behavioral expression throughout one's life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2099.688,
    "end": 2104.29,
    "text": "On the other hand, contextual cues significantly influence the interpretation of ambiguous behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2105.228,
    "end": 2118.731,
    "text": " Social scripts guide our expectations in social situations can either be adapted when confronted with unexpected behavior or allow us to shift from script to script to have a better prior over what we might expect next.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2121.092,
    "end": 2126.453,
    "text": "So for instance, this challenge is particularly pronounced for those who diverge from established social norms and script.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2127.214,
    "end": 2132.555,
    "text": "Their interpretations are influenced by the dynamics of information spread within their epistemic communities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2134.136,
    "end": 2141.944,
    "text": " Understanding ambiguous social behaviors is not just about individual cognition, but also about the social and cultural contexts that shape our interpretations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2145.248,
    "end": 2152.135,
    "text": "So now we're going to dive from this point into the specific contextual factors that further nuance our understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2153.809,
    "end": 2166.578,
    "text": " Our former discussion emphasized the influence of power and social norms, and now we're going to turn our attention to the impact, say, of social anxiety, behavioral flexibility, and goal-oriented perception in shaping our interpretations of social behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.62,
    "end": 2175.044,
    "text": "Understanding social behaviors often requires an approach that goes beyond trait-based interpretations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2176.308,
    "end": 2182.411,
    "text": " Contextual factors like social anxiety can significantly influence how we interpret an ambiguous social cue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2183.132,
    "end": 2190.496,
    "text": "For instance, using the most likely prior rather than being open to other kinds of interpretations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2192.277,
    "end": 2195.278,
    "text": "Behavioral flexibility is another crucial aspect to consider.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2196.519,
    "end": 2202.022,
    "text": "It allows for adaptability and nuanced understanding of social behaviors across different social contexts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2202.478,
    "end": 2207.302,
    "text": " such that a same script can be interpreted different ways through different kinds of behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.184,
    "end": 2212.807,
    "text": "The concept of goals here plays an important role in social perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2213.567,
    "end": 2227.699,
    "text": "They can serve to provide a broad implication for where we understand an individual to try to be headed, such that while their lower-level script may be different from the one we have, their higher-level script is still interpretable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.874,
    "end": 2238.779,
    "text": " So now we're going to try to see what can be the outcomes in real life of all these processes together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.639,
    "end": 2246.424,
    "text": "We're going to focus on cognitive mechanisms that underpin social phenomena like confirmation bias and echo chambers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2247.905,
    "end": 2260.633,
    "text": "Building on the concept of active inference, we explore how individuals not only interpret ambiguous social cues, but also actively seek information that confirm their preexisting belief, thereby shaping epistemic communities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2265.509,
    "end": 2271.013,
    "text": " Confirmation bias is a cognitive tendency that affects information spread and decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2272.054,
    "end": 2279.319,
    "text": "It is driven by agents seeking information that confirms their pre-existing belief while avoiding challenging information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.519,
    "end": 2287.024,
    "text": "This is an effective way of using action to minimize free energy rather than updating beliefs in a costly manner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.15,
    "end": 2298.337,
    "text": " Echo chambers amplify this bias by creating self-reinforcing loops where individuals selectively expose themselves to aligned information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.698,
    "end": 2307.544,
    "text": "So research indicates that network structures contribute to the persistence of echo chambers, thereby affecting policymaking and public discourse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2308.945,
    "end": 2314.049,
    "text": "The minimization of free energy transfers to the network, thereby shaping the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2315.626,
    "end": 2322.232,
    "text": " We can see here how there is a loop where the environment both shapes the individual who will in turn continuously shape the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2323.853,
    "end": 2336.124,
    "text": "Interestingly, some studies have identified a reverse confirmation bias, whereby some people actually do seek out information in an explorative manner, which again aligns with this idea of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.543,
    "end": 2339.565,
    "text": " of active inference epistemic value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.185,
    "end": 2349.351,
    "text": "And here we may try to ponder why certain people are more likely to break out of their echo chambers rather than stay in them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.871,
    "end": 2362.739,
    "text": "This may align potentially with deep temporal models, whereas we can see value at a later point in time and perhaps focus more on this expected value.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.101,
    "end": 2367.404,
    "text": " value rather than on the direct value of the confirmation bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2370.446,
    "end": 2382.773,
    "text": "To mitigate such biases, we can use strategies such as fostering epistemic change through diverging information and encouraging reflection to break apart echo chambers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.615,
    "end": 2388.877,
    "text": "Now we've explored a little bit confirmation bias and echo chamber.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2390.131,
    "end": 2394.313,
    "text": " We can see how this extends to human communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2395.534,
    "end": 2406.919,
    "text": "This allows us to explore the principles of active inference, which shape individual cognitive tendencies and the influence of the broader dynamics of communication and collective intelligence on the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.36,
    "end": 2418.605,
    "text": "So we can link communicative behavior to biological imperative of minimizing free energy, which emphasizes the action-oriented nature of communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2419.96,
    "end": 2427.176,
    "text": " The framework allows for adaptive behavior even when the models deviate from veridical representations of the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2429.588,
    "end": 2440.177,
    "text": " How do we justify that people lie or that people say things which don't seem to align properly with what everybody else seems to believe about the environment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2440.257,
    "end": 2442.118,
    "text": "Effectively, this is an action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2442.458,
    "end": 2450.505,
    "text": "You're trying to push a belief onto the environment such that there is a potential for the environment to be shaped in a way that evidences your beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2453.53,
    "end": 2460.737,
    "text": " So we can think of cognitive control here, whereby active inference has an effective goal maintenance in working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2461.577,
    "end": 2467.383,
    "text": "It provides top-down guidance for overt behavior moving beyond stereotyped responses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2468.263,
    "end": 2474.209,
    "text": "Our understanding of communication is enriched by introducing neurobiologically plausible computational hypotheses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2475.81,
    "end": 2479.474,
    "text": "The ecological approach to active inference is a framework that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2480.939,
    "end": 2485.2,
    "text": " understand the complexities of human communication across different scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2485.9,
    "end": 2495.942,
    "text": "It explores how individuals contribute to the collective intelligence of a group or society by fostering a collaborative approach that leverages diverse skills and knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.962,
    "end": 2500.603,
    "text": "This is one of the reasons echo chambers are maintained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.323,
    "end": 2507.644,
    "text": "They're efficient in the transmission of information and promote collaboration among agents who overtly share a model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2510.911,
    "end": 2518.314,
    "text": " So now we're going to look at a more detailed understanding of ecological dimensions of this discourse.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.135,
    "end": 2530.919,
    "text": "Context, as we saw earlier, plays a crucial role in the activation of predictive inferences, which offers further support for ecological approaches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.199,
    "end": 2539.462,
    "text": "Active inference models contain terms that encode both the object of desire and the strength of desire at the psychological level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2540.646,
    "end": 2549.088,
    "text": " So the context of inactive inference suggests that generative and recognition models are best cast as realizing inference and control under the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.249,
    "end": 2564.872,
    "text": "So in this way, communication through the active inference lens gives us an action-oriented nature of cooperative communication where together we mutually craft our models such that we can achieve a common goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2567.813,
    "end": 2569.093,
    "text": "So now, and lastly,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2570.253,
    "end": 2575.938,
    "text": " Let's dive into a very short overview of how this may translate to language processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2577.98,
    "end": 2579.921,
    "text": "So remember we discussed deep temporal models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2581.383,
    "end": 2586.247,
    "text": "Here, they enable us to explore the sequential dynamics of language processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2587.488,
    "end": 2593.914,
    "text": "The models are hierarchical, where inference at higher levels informs the selection of words at lower levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2595.083,
    "end": 2600.826,
    "text": " This hierarchical structure allows for the accumulation of evidence over nested timescales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2602.086,
    "end": 2611.91,
    "text": "One key aspect is the emergence of behavioral and neurophysiological correlates in those sequential dynamics, like the theta-gamma couplings that we discussed earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2612.751,
    "end": 2622.175,
    "text": "It's a phenomenon that, again, was observed and allows us to measure belief updating under variational message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.127,
    "end": 2627.888,
    "text": " Thus, generative models aren't just predictive but also explanatory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2628.168,
    "end": 2631.789,
    "text": "They can help us understand neural mechanisms like language comprehension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2635.39,
    "end": 2640.892,
    "text": "In cognitive control, linguistics can be cast as individual agents, contributing to the intelligence of the group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2642.423,
    "end": 2648.764,
    "text": " And the research shows that generative models are central to the perception and interpretation of the linguistic signals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2649.865,
    "end": 2655.446,
    "text": "We have a structural understanding of sequences of words and their context sensitivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2656.886,
    "end": 2665.548,
    "text": "This enables the agent to resolve uncertainty about the underlying conceptual, semantic, or lexical causes of sensory input.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2668.089,
    "end": 2676.857,
    "text": " It can incorporate beliefs about narratives, the type of question, the scenic state of the world, a semiotic factor indicating the topic of discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2678.538,
    "end": 2683.263,
    "text": "These factors generate expectations for the lower level, such as syntax and semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2685.385,
    "end": 2692.291,
    "text": "Models enable inference through this deep temporal structure about the narrative, such as those seen in reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2695.765,
    "end": 2704.969,
    "text": " Here, the neural processes can be understood in terms of simulating the epistemic forage seen in reading and other language-related activities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.77,
    "end": 2719.795,
    "text": "So, to conclude, we have seen a comprehensive understanding of active inference in activism and their interplay in shaping social cognition and behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2721.36,
    "end": 2732.189,
    "text": " We have explored various philosophical perspectives, such as the inactive affordance-based perspective, the Helmholtz-Hume-Bayesian model, and highlighted their contribution to understanding our social interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2733.29,
    "end": 2742.178,
    "text": "We've explored deep temporal models as a potent computational tool for modeling complex, time-dependent patterns in social cognition, such as in language as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2743.2,
    "end": 2753.027,
    "text": " We've discussed the role of mirror neurons, emphasizing their potential centrality in continuously updating internal models of the environment and their significance in social cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2753.047,
    "end": 2761.252,
    "text": "We've discussed potential future directions for research if you are interested in these topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.474,
    "end": 2772.9,
    "text": "So here, the interplay between active inference and activism, computational models like deep temporal models, give us a multidimensional view of social cognition and agency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2774.44,
    "end": 2782.124,
    "text": " It broadens the scope of research, but also brings us closer to our goal of understanding the complex cognitive and social phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2784.785,
    "end": 2789.287,
    "text": "So for next class, I offer you an opportunity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2790.708,
    "end": 2799.732,
    "text": "You should pick a text from this session, from the references that will be made available, or one that you find yourself in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2801.309,
    "end": 2807.173,
    "text": " read it, and try to explain how it ties to the concepts that we explored today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2808.374,
    "end": 2816.2,
    "text": "Ideally, you can present it to the group, take five minutes, explain what the text says and how it connects to the contents of the course.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2817.541,
    "end": 2820.683,
    "text": "If you have any questions, we can potentially take them now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2827.948,
    "end": 2828.509,
    "text": "Thank you, Mao.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.109,
    "end": 2830.03,
    "text": "That was epic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.582,
    "end": 2854.218,
    "text": " right well people can write questions in the chat i'll just read one all right where does identity and ideology fit in my presentation or in the in the framework that i'm presenting so i'm going to assume it's in the framework um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.487,
    "end": 2857.628,
    "text": " Identity fits as a social self, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2857.808,
    "end": 2864.512,
    "text": "Identity is literally how you craft your selfhood relative to the narratives that you're given.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2864.992,
    "end": 2868.073,
    "text": "So it's precisely the social self that we discussed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2868.754,
    "end": 2882.741,
    "text": "Ideology corresponds to a looser, let's say weak script that allows you to shift the valence of certain values across certain norms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.201,
    "end": 2883.361,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2884.406,
    "end": 2895.034,
    "text": " Let's assume that you understand values as a higher or lower probability for a type of high level behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2895.254,
    "end": 2896.575,
    "text": "So I value kindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2897.115,
    "end": 2913.967,
    "text": "There'll be a high prior over kindness and therefore the paths, the policies that leads to what I ascribe to as kindness will therefore become more likely to be adopted and will become a norm if more of us value the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.083,
    "end": 2926.959,
    "text": " The key issue here is how do I associate the semantics of kindness to the actual pragmatic representations and actions that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2927.278,
    "end": 2929.079,
    "text": " correspond to what I believe to be kindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2929.379,
    "end": 2931.681,
    "text": "And this is where the co-construction happens, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2932.101,
    "end": 2936.504,
    "text": "We communicate together and I'm going to say, this is kindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2936.804,
    "end": 2941.567,
    "text": "I'm acting on the world to determine now this is what we will believe to be kindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2941.647,
    "end": 2944.789,
    "text": "And I value kindness very highly because that's my ideology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2944.829,
    "end": 2947.15,
    "text": "And therefore this is what we should be doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2947.47,
    "end": 2956.376,
    "text": "All these things connect together through the interaction of the environment, the symbols encrusted in the environment that I share and co-construct through communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2959.241,
    "end": 2959.461,
    "text": " Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.521,
    "end": 2966.602,
    "text": "And how does that have an impact on affordances was a follow-up question there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.323,
    "end": 2978.644,
    "text": "So if we go back to the part of the course about affordances, we saw that certain things are made more likely given the niche that you are in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.985,
    "end": 2988.166,
    "text": "If you understand the ontic cues, you see that there's going to be some signals that pull you as attractors in a specific direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2989.127,
    "end": 2993.17,
    "text": " So let's assume that we have an ideology, again, that promotes kindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2993.851,
    "end": 3002.077,
    "text": "In the environment, it is highly likely that potential pathways towards kindness will be made more available.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3002.837,
    "end": 3009.702,
    "text": "So for instance, let's assume that we believe that giving money to people is kindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3010.163,
    "end": 3013.085,
    "text": "There's going to be more initiatives for you to give money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3013.485,
    "end": 3017.868,
    "text": "So for instance, I don't know if you guys have taken the plane recently, but Air Canada...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.942,
    "end": 3031.593,
    "text": " has started a program where if you have loose change in your pockets, you can put it in the seat in front of you in a little pocket thing and you can put the money there and they're going to donate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3031.633,
    "end": 3034.195,
    "text": "Now, I'm not saying that's kindness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3034.235,
    "end": 3037.318,
    "text": "We can argue about the politics of it all and the tax, etc.,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.666,
    "end": 3041.687,
    "text": " But this is an affordance that wasn't there before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3042.587,
    "end": 3044.027,
    "text": "And now it's in my environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3044.387,
    "end": 3050.129,
    "text": "Now I don't have to take it, but it's now more readily available for me to actually act on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.509,
    "end": 3052.329,
    "text": "And you can see this across every level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3052.789,
    "end": 3057.49,
    "text": "It's just that most affordances are invisible to us as affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3057.57,
    "end": 3059.211,
    "text": "We just react to them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.251,
    "end": 3064.892,
    "text": "We just exist within them, but we don't consider they wouldn't be there, such as a bathroom in a house.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.632,
    "end": 3070.697,
    "text": " This is one of the things that allows us to think more critically about what it means to be homeless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3071.518,
    "end": 3073.02,
    "text": "Like, to you it seems obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3073.04,
    "end": 3075.002,
    "text": "When you need to go to the bathroom, you'll go to the bathroom, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3075.022,
    "end": 3076.564,
    "text": "There's a bathroom available to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3077.204,
    "end": 3080.868,
    "text": "But there isn't one for people who live outside because they don't have a home.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.449,
    "end": 3085.413,
    "text": "And yet we've criminalized the act of relieving yourself outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3085.953,
    "end": 3086.975,
    "text": "So we've basically said...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3088.587,
    "end": 3111.369,
    "text": " don't pee or if you pee well you're now criminal so being homeless by virtue of not having access to the same affordances means it's effectively criminal to be homeless so these are the kinds of ways that um ideology shapes our affordances and effectively pulls us in a state of attraction and effectively in in different states of power as well because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.109,
    "end": 3133.932,
    "text": " we collectively have decided that the only people who get to have the the right to certain affordances are the people who have enough money to live in a house et cetera et cetera et cetera thanks there's a lot there all right I'll read a comment this is something you could address right now or save it for the discussion or however you want Michael wrote",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3135.046,
    "end": 3142.812,
    "text": " Would you be open to attempting to map a social or personal narrative rather than another element in the literature, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.912,
    "end": 3145.494,
    "text": "translating the hero's journey or 12-step recovery?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.395,
    "end": 3149.577,
    "text": "I'm not sure I understand attempting to map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3150.057,
    "end": 3162.447,
    "text": "Like, connect the active ontology and formalisms to a more broadly understood narrative or specific script rather",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.087,
    "end": 3164.327,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3164.928,
    "end": 3180.858,
    "text": "I mean, so big fan of the hero's journey, but why do we want, say, why do we feel like the hero's journey in itself is valuable?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3181.718,
    "end": 3183.86,
    "text": "We feel that it's valuable because we feel that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3185.2,
    "end": 3211.284,
    "text": " it is a very easy explanation for uh why somebody would have value and it is usually um easy to minimize free energy through well there's a clear path right this person wasn't the result of very complex interactions of the environment or whatever it's actually no no it's all him he just understood the he understood what he had to do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.604,
    "end": 3214.567,
    "text": " He figured out what he had to do, and there you go, he was able to do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.607,
    "end": 3221.795,
    "text": "And so this is a signal for perfect fitness to the landscape, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.855,
    "end": 3224.177,
    "text": "It's perfect cognitive grip.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3224.938,
    "end": 3225.338,
    "text": "So it's like...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3226.417,
    "end": 3245.61,
    "text": " There's an underlying assumption that this one person was able to update their generative model sufficiently such that they were perfectly able to grab every affordance that the environment gave them to go towards their stated objective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3246.011,
    "end": 3247.892,
    "text": "So in terms of active inference, it's pretty simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3247.912,
    "end": 3252.175,
    "text": "It's someone that has the capacity to go from a very unfit generative model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.575,
    "end": 3262.967,
    "text": " to a very fit generative model relative to the environment and so we like that narrative because it's like okay well then that means everybody can do it right if if if we can go from um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.99,
    "end": 3292.817,
    "text": " failure to being a hero and all we have to do is take one or two hardships and go through it um then then it's possible now there's also some deification here right because usually the hero's journey goes through some very very difficult elements and comes out on the other side um and we assume that because they can there's a rationale of meritocracy which is um the world is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3294.301,
    "end": 3319.118,
    "text": " relatively equal for everybody so it tries to pull away from every other power factor um ecological factor and it's like no no it's it's all about how you're able to to fix your generative model to do the right things that you have to do um so that's why i'm not a fan of it but i hope it was this the mapping you were looking for in terms of active inference and um energy minimization kind of thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3321.51,
    "end": 3348.858,
    "text": " here's one thought on that the hero's Journey or another archetypal attractor just archetype or just a thread that way it embeds a concise narrative account that is is made legible through storytelling that we can understand and uh it embodies not just kind of mythical things but also like real structural",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.754,
    "end": 3377.135,
    "text": " implicit features that's why some stories can be so short and and so transferable across context because they abstract but also they it's what they do include in those cases and then you talked about how that conveys something about value which is what supports social norms and social values which of course you can't point at anywhere yet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3378.737,
    "end": 3384.481,
    "text": " What can you say about what are social norms or forces or what is the social?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.704,
    "end": 3390.765,
    "text": "What is the social?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3397.489,
    "end": 3398.97,
    "text": "I think you can point to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.23,
    "end": 3402.752,
    "text": "I think you can effectively point to processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.832,
    "end": 3407.295,
    "text": "You can point to material realities, institutions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.057,
    "end": 3421.662,
    "text": " I think we tend to use the notion of the social to contrast it with the notion of the individual.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.282,
    "end": 3423.983,
    "text": "It's just that nothing's ever that simple.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3425.143,
    "end": 3425.924,
    "text": "The individual is...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3427.538,
    "end": 3453.192,
    "text": " always built because of other individuals so there's there's no really such thing as an individual you're always embedded within something so the the real question is what's the scale um that you're interested in and what is identifiable as what may be within or without or outside of your control within that scale and we generally",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3454.375,
    "end": 3459.597,
    "text": " make a sort of conflation between what is social and what is uncontrollable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3460.097,
    "end": 3462.177,
    "text": "Even that's not necessarily true as we saw, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3462.237,
    "end": 3471.5,
    "text": "Because we, through our actions, which can be verbal, which can be physical, we reiterate or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3473.342,
    "end": 3479.516,
    "text": " push on what constitutes what is valued by other actors within the same locality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3479.596,
    "end": 3483.705,
    "text": "So if you're asking what constitutes culture,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3484.795,
    "end": 3496.145,
    "text": " Well, at the level of my house, culture is we go to bed around 10 to 11, because if you don't go to bed at 11, you're going to make noise and you're going to wake me up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3496.545,
    "end": 3499.007,
    "text": "So our shared culture is this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3499.087,
    "end": 3503.872,
    "text": "This is something that we repeat over time that constitutes an attractor for more than just me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3504.552,
    "end": 3528.587,
    "text": " um if i look at the level of my building it's nobody puts plants outside on their balcony if it's at the level of montreal um it's there's potholes everywhere and we're not bitching really about it we've all accepted there's potholes everywhere so it's part of our culture it becomes part of our conscious um and so why is it cultural it's because we can see that this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3530.023,
    "end": 3555.803,
    "text": " behavior these expectations translate not just to you to your own model but it translates to the model of other people as well and they can expect the same for you it's something which is uh definitely shared so i think you can easily point to things once you define the scale at which it becomes manifest thanks really interesting all right a question from upcycle club who wrote",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3557.153,
    "end": 3565.517,
    "text": " In terms of the philosophical dimensions of agency and active inference, what is the role of self-referentiality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.759,
    "end": 3587.201,
    "text": " I think you'd have to define the term, but if I understand correctly, we saw that you have to both model yourself and model the rest of the world in order to understand whether your actions are likely to have the effects you want to have on the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3587.648,
    "end": 3595.311,
    "text": " So this self-referentiality, if I understand correctly, but I could be wrong, is this notion of accurately modeling yourself as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3595.751,
    "end": 3597.692,
    "text": "Does that answer the question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.133,
    "end": 3599.353,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.153,
    "end": 3600.433,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.873,
    "end": 3604.115,
    "text": "A question from Michael who wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.129,
    "end": 3612.051,
    "text": " I work with marginalized communities who experienced the larger culture as dominant and scientifically enabled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.712,
    "end": 3620.414,
    "text": "How should such communities fortify themselves against the more skillful extractive cultures?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.135,
    "end": 3630.398,
    "text": "I mean, that's the, that's the main question that's been for counter cultures forever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3630.418,
    "end": 3630.458,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3634.249,
    "end": 3636.21,
    "text": " It depends what you mean by fortify yourself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3638.012,
    "end": 3641.534,
    "text": "If you mean be less likely to be extracted from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.321,
    "end": 3648.424,
    "text": " I think the question is being extracted from without getting something in return.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3648.444,
    "end": 3659.052,
    "text": "Because effectively, as you saw, for coordination to happen, you must provide something for the group in order for the group to move further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3659.112,
    "end": 3661.854,
    "text": "So it's always a little bit extractive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3661.914,
    "end": 3668.379,
    "text": "You will always expand some degree of free energy in order to move towards the policy that you've chosen as a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3668.8,
    "end": 3669.74,
    "text": "So there's two elements here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3670.521,
    "end": 3671.522,
    "text": "Chosen as a group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3672.466,
    "end": 3675.148,
    "text": " And there should be a return on that as well, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3675.168,
    "end": 3679.13,
    "text": "It shouldn't be just you pay, nobody else gives you something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3679.17,
    "end": 3692.317,
    "text": "So it's the degree to which the system minimizes everybody's free energy rather than minimizes this group's, and this group is still at high free energy, low allostatic, high allostatic load, etc.,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3693.363,
    "end": 3697.385,
    "text": " So what you mean, I'm not the expert on that specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3697.425,
    "end": 3702.767,
    "text": "I'm sure there are people who have worked with marginalized group way more than I have give you better insights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3703.307,
    "end": 3710.37,
    "text": "But from what I've read and from if I can derive from the theory that we've presented today, it's.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3712.73,
    "end": 3721.434,
    "text": "You need to have a strong narrative that supports your capacity to increase your fitness landscape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3722.483,
    "end": 3727.485,
    "text": " And maintains the bonds, the mark of blanket around your group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3729.386,
    "end": 3739.83,
    "text": "If your group is likely to dissolve all the time, if it's constantly threatened and shaky, it's not going to be able to go very far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3740.17,
    "end": 3741.731,
    "text": "It's always going to be in protective mode.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3742.87,
    "end": 3756.26,
    "text": " So you need to ensure that the group has strong bonds, that the group can expand, and that the group can together enact policies that lead it to minimizing free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3756.96,
    "end": 3769.809,
    "text": "And relative to the larger group, that generally entails having more and more connections with individuals from the larger group such that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3772.526,
    "end": 3778.511,
    "text": " you are capable of changing their model little by little.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3779.332,
    "end": 3790.822,
    "text": "You want to have a strong boundary, but you don't want to be unable to communicate with the external group because if you do that, you can't communicate and co-construct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3792.503,
    "end": 3792.823,
    "text": "So it's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3793.962,
    "end": 3814.786,
    "text": " It seems trivial, but it's developing allyships where you have people from the larger group that become people that adopt your message and allow the expansion of your group and the ideology or the generative model of your group to be integrated within what determines the policies of the higher level group, or at least of the dominant extractive group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3816.053,
    "end": 3816.794,
    "text": " I hope this helps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3817.094,
    "end": 3826.967,
    "text": "I know it's not as concrete as one might want, but I'm sure people with much more experience in these fields would have much better answers for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3826.987,
    "end": 3832.695,
    "text": "I have a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3834.267,
    "end": 3862.283,
    "text": " i've long had about some of your different research projects which are presented here often there's this modeling of both the view from the inside with phenomenology and also a view from the outside so what can you say about active inference and that like what what does that mean where does that come from how does that matter for the personal and the social",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.856,
    "end": 3867.537,
    "text": " So imagine a mark of blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3869.198,
    "end": 3872.72,
    "text": "Every mark of blanket entails there's an outside and an inside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3872.74,
    "end": 3874.961,
    "text": "Now you can always redraw it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3875.501,
    "end": 3879.383,
    "text": "You can always consider it's wider, smaller.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3880.403,
    "end": 3883.005,
    "text": "Inside your mark of blankets, there are mark of blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3883.145,
    "end": 3884.866,
    "text": "It's all mark of blankets all the way down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3886.013,
    "end": 3894.807,
    "text": " So this notion of internal and external is only useful in relation to the measurement of a joint probability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3895.068,
    "end": 3895.548,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3897.251,
    "end": 3897.912,
    "text": "It's not...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3901.212,
    "end": 3904.033,
    "text": " It's not ontological in the sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3904.574,
    "end": 3918.941,
    "text": "I can consider that my cells also have an internal model and an external model, and I'm just some emergent scale given the connection between all these models that have an internal and external model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3920.868,
    "end": 3930.892,
    "text": " Um, this group right now has a mark of blankets, which means us, we have spoken and people who have not spoken to us do not have access to this information here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3931.292,
    "end": 3934.813,
    "text": "And in order to exchange information, they'll probably have to speak to some of us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3935.253,
    "end": 3944.577,
    "text": "And so there'll be, um, there'll be an action that we put upon the world as a group with some degree of cohesion over time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3945.464,
    "end": 3955.006,
    "text": " So I think we have to understand internal and external really in those terms, in terms of temporality and objective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.366,
    "end": 3959.526,
    "text": "Outside of that, these are illusory boundaries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3959.927,
    "end": 3967.548,
    "text": "They're not real, and because they're not real, we can sort of eschew essentialism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3969.168,
    "end": 3973.769,
    "text": "If a boundary can always be redrawn relative to some kind of observer, then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3975.359,
    "end": 3977.041,
    "text": " Everything is always observer-relative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3977.242,
    "end": 3981.467,
    "text": "There's no such thing as a thing which is a thing in itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3981.547,
    "end": 3983.029,
    "text": "It's always relational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3983.149,
    "end": 3984.611,
    "text": "It's always phenomenal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.252,
    "end": 3987.815,
    "text": "And how does this tie to phenomenality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3987.855,
    "end": 3988.036,
    "text": "Well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.714,
    "end": 4008.332,
    "text": " Because we are talking through this market blanket, because we don't actually have access to the rest of the world except through this boundary, the internal model is what effectively wiggles relative to the external world, and therefore...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4010.134,
    "end": 4018.459,
    "text": " you get phenomenality from this remodeling of the external world from this given boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4018.899,
    "end": 4028.845,
    "text": "So for instance, our group's phenomenality of everybody else is our shared representation of who that even means, of what that even means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4029.345,
    "end": 4033.548,
    "text": "We have this phenomenal representation of that group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4033.668,
    "end": 4035.569,
    "text": "We could even potentially create",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4038.502,
    "end": 4039.562,
    "text": " symbols for them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4039.963,
    "end": 4048.706,
    "text": "We could create actual representations, which would become what constitutes qualia at the level of our group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4049.327,
    "end": 4051.788,
    "text": "I think I've answered your question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4051.908,
    "end": 4053.088,
    "text": "I get lost in my thoughts sometimes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4053.128,
    "end": 4055.089,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4055.409,
    "end": 4059.851,
    "text": "I'm going to read a comment from Avel, who just requested this comment to be read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.832,
    "end": 4061.292,
    "text": "Avel wrote,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4062.421,
    "end": 4064.883,
    "text": " I'd like to add some things about the ideology question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4065.323,
    "end": 4068.405,
    "text": "You have a diversity of definitions of ideology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.485,
    "end": 4072.208,
    "text": "For the purposes of the demonstration, I'll cluster them into two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.008,
    "end": 4074.449,
    "text": "One, post-structuralist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4074.75,
    "end": 4079.033,
    "text": "In this context, an ideology is any system of value or of instrumentation of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.133,
    "end": 4080.534,
    "text": "This is the definition Mao used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.074,
    "end": 4086.598,
    "text": "In this case, everything is ideology because the basic way we perceive the world is value-ridden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.218,
    "end": 4088.739,
    "text": "And two, structuralist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4089.64,
    "end": 4117.818,
    "text": " in this context an ideology is a system of discourse that dominates a given social context for structuralist definitions to apply you need a lot more than shared values you need a clergy that maintains and diffuses the specific discourse underlying the ideology I have a limited insight in the historical evidence but as of my understanding ideology as factor of mass mobilization is pretty much an early modern particularism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4122.662,
    "end": 4128.106,
    "text": " Do you want to add anything?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4128.126,
    "end": 4131.969,
    "text": "I feel like if we cast it in terms of active inference, it would be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4134.426,
    "end": 4159.345,
    "text": " active states right like you need um you need something which acts upon the world in order to create the self-evidencing you require and that would be like the clergy right you need to push these beliefs onto the world you can't just sort of let them happen especially if we talk about precision right because remember everything wiggles everything's always non-stationary we move we change we interpret we reinterpret those degrees of uncertainty",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4160.146,
    "end": 4182.667,
    "text": " so how do we make sure that we continue over time right that we don't just dilute that our boundary stays very strong that's what is discussing earlier with the with the groups that want to be avoid extractivism you need to proselytize you need to make sure the same narratives we return we always return to that same narrative and how if we look at like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4183.721,
    "end": 4206.085,
    "text": " clergy for instance um i don't know if it was a mistake or not but for a time the only way to preach was in latin which means the only way to access the word of god was through these people who not only um had to give you the word of god but they also controlled what it meant because you don't speak latin i'll speak latin i'm gonna believe you you you have that knowledge",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4206.545,
    "end": 4215.549,
    "text": " So it goes back to these structures of power where there's some people that have more access to influencing others, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4215.569,
    "end": 4227.755,
    "text": "They can push their beliefs with more precision on others and others just kind of have to follow because they have no real way to themselves interpret and potentially shift narrative themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4233.661,
    "end": 4235.282,
    "text": " When you do that, I feel like I'm preaching.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4235.842,
    "end": 4237.082,
    "text": "Oh, there's just a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4237.322,
    "end": 4238.002,
    "text": "There's a lot there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.123,
    "end": 4247.886,
    "text": "One part that I thought was very interesting was variational free energy is about observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.106,
    "end": 4254.168,
    "text": "And in what you had added just recently, you talked about like the measurement of a joint probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4255.008,
    "end": 4259.31,
    "text": "There has to be like an aboutness of sensory observations for that thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4261.218,
    "end": 4287.944,
    "text": " otherwise it has not even a sensory it's not even an inanimate thing unless it has this that doesn't mean it's an interesting thing and i think that's what the recent work helps clarify with a sort of taxonomy from inert to more classically active control systems on through just the infinite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.922,
    "end": 4306.722,
    "text": " possibilities of broadly cognitive modeling ecosystems of shared intelligence yeah it's fun i think that's a really interesting uh a really interesting distinction you just made so the the paper um by um lance and co um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4309.525,
    "end": 4327.746,
    "text": " maybe that is the key because I am okay so maybe this is a hot take but I generally lean towards panpsychism I do believe that if consciousness is the substrate then everything is some degree of conscious and we can stop using the word conscious and we can use the word model right there's a degree to which um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.507,
    "end": 4335.23,
    "text": " There's a response between the internal states of a Markov blanket and the external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4335.29,
    "end": 4340.372,
    "text": "So there is some exchange of information there, and whatever is done with the exchange may be nothing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4340.872,
    "end": 4344.274,
    "text": "And this may be the aboutness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4345.074,
    "end": 4347.735,
    "text": "Your internal model has no aboutness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4348.275,
    "end": 4355.378,
    "text": "It's just there's information that was inputted, and the only thing that it outputs is a constance of its boundary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4355.498,
    "end": 4356.379,
    "text": "And that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.455,
    "end": 4379.462,
    "text": " And therefore, in order to have aboutness, you have to have the possibility for your internal states to shift, to move your boundaries somehow towards something more specific, to segregate, to discretize the external world into things that have more or less valence relative to your objectives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4379.942,
    "end": 4383.543,
    "text": "Very, very akin to what Donald Hoffman is suggesting, basically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4388.427,
    "end": 4416.156,
    "text": " Building on that and throughout your presentation, I got a sense of the kind of two cultures, the sciences and the humanities, not that they were exactly being represented in the talk, but in terms of excellent style and classical approach and the non-overlapping magisteria idea that there's sort of a separable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4418.055,
    "end": 4443.807,
    "text": " technical from the social and it's even though it's it's widely clear that the beliefs in the moment shape the niche that has these feedback things the development of top-down architectures in some way that become top-down affordances for those or other people at some future time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.842,
    "end": 4451.964,
    "text": " So where do we go from there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.984,
    "end": 4471.255,
    "text": "And just like thinking about that space, you know, in what, how do you, how do you approach chapter six of the textbook in terms of the recipe for the active inference generative model for a social setting, for a social setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.076,
    "end": 4473.296,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4479.668,
    "end": 4506.124,
    "text": " i think we go from semantics and we map the semantics of a group and you you you qualify what that group is maybe the description length of that group is extreme maybe the description length is um my neighbor your neighbor me and uh three of their cats but not the fourth you know what i mean like maybe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4507.449,
    "end": 4510.271,
    "text": " there's a cluster there and we map the semantics of that group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4511.171,
    "end": 4512.292,
    "text": "And it's very specific.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4513.092,
    "end": 4527.942,
    "text": "And then through those semantics, there's an inherent causal structure of the beliefs through which we could together, like our own little experts, try to map, well, okay, what are our states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4528.042,
    "end": 4529.082,
    "text": "What are our observations?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4529.142,
    "end": 4530.103,
    "text": "How do we map to this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4531.224,
    "end": 4532.585,
    "text": "And we try to test that model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4533.621,
    "end": 4537.743,
    "text": " And then let's assume that we disagree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4538.223,
    "end": 4556.53,
    "text": "So we're going to have different kind of breakdowns of reality and we're going to test the different models in a sort of Bayesian expansion or Bayesian model reduction or just, you know, testing different models and DCM style and seeing which one maps better to the expected observations we're going to see given our model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4558.431,
    "end": 4586.973,
    "text": " and you can do this for anything you can do this for a small group of neighbors you can do this for a very large group of people you can do this for participant research you can do this for medicine i think it's really about how do people carve nature at its joints and can they point to the exact observations which they believe are part of the carvings or not i think that's possible in social sciences",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4587.583,
    "end": 4599.826,
    "text": " It's just about taking the time to formalize how observations map to the carving together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4599.846,
    "end": 4607.328,
    "text": "I think social sciences generally tend to push back against a carving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4608.491,
    "end": 4628.6,
    "text": " um they will prefer something that resembles more a manifold like it's like it ebbs and flows and it's like there's some prototypical stuff but mostly it's there's stuff that could come in and out and stuff and that's fine you can be accounted for so um if you if if you look at",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4629.5,
    "end": 4652.686,
    "text": " uh different carvings you can say we can work them through on our own sort of probability and say well this is much less likely it's possible it fits within the carving but it's much less likely what about this well this is really really really really like let's let's put a probability on this and maybe to you the probability is zero zero zero zero zero zero one that's right it's in there um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4653.567,
    "end": 4663.974,
    "text": " I think they'd be more comfortable with something that's less binary and something that's more curved and allows for new things to be added were we to disagree on inclusions, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4666.752,
    "end": 4690.147,
    "text": " that's a great point on kind of a narrow note but to what you just said there let's just say that there's four options if our prior is one zero zero zero then the any number of evidence times zero stays zero so that's like essentially fixed and that's when the hyper parameter is fixed and then if you not enable even a tiny amount of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4691.63,
    "end": 4714.901,
    "text": " non-zero value and so it's like 0.99999 and then a bunch of zeros then that can still rise off the baseline and then that's the whole question of attention and cognition is how do you stay aware of relevant salient information relevance realization and all that um another point was about um the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.161,
    "end": 4744.671,
    "text": " causal model from the outside the part that the person doesn't directly control there's no direct control in the active generative models of action observations it has to go through the niche that's how the thing is defined and so only indirectly can observations be changed and so that's the kind of part that you don't have agency over literally although the other glass half full side is that is to the extent that you do have agency over that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.785,
    "end": 4758.682,
    "text": " and then where that glass is and what narrative actually puts water into the glass or not and then what is the glass half full glass half empty part",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4760.316,
    "end": 4787.786,
    "text": " it brings so much and just so much like on the personal thought side but also it's just really interesting to see how this line of research which was more qualitative several years ago like in the 2016 to 18 time and just to see how different motifs have come into play with the generative models and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.577,
    "end": 4796.541,
    "text": " So it's a pretty cool lecture, and many people appreciated your work in the chat, so that's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4796.621,
    "end": 4799.023,
    "text": "Do you have any other comments or anything you want to talk about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.463,
    "end": 4813.831,
    "text": "No, but I'm going to have to go in about two minutes, but I would like to encourage people to really participate in the next one, to read some texts, and to express their ideas because this is how we...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.872,
    "end": 4818.072,
    "text": " Percolates, percolates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4818.172,
    "end": 4821.233,
    "text": "This is how we percolate good ideas and future research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4821.453,
    "end": 4826.014,
    "text": "And the field of social sciences is ripe for this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4826.074,
    "end": 4827.875,
    "text": "There's so much that could be done right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4828.295,
    "end": 4835.457,
    "text": "Translated, connected, like we can get towards a confluent time in research and science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4837.377,
    "end": 4837.617,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.257,
    "end": 4845.539,
    "text": "Really looking forward to the discussion and hoping that people engage in this affordance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4847.987,
    "end": 4848.348,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.412,
    "end": 4849.733,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.793,
    "end": 4850.074,
    "text": "See you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.214,
    "end": 4850.375,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]