[
  {
    "start": 6.747,
    "end": 22.107,
    "text": " hello and welcome it is April 26th 2024 and we're in active inference art stream 001.1 starting a new art related series very appropriately with some great",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 22.087,
    "end": 41.563,
    "text": " art discussions and presentations this is going to be order and change in art with jacopo frascaroli presenting and also with sander van der kruijs and axel constant here for discussion so thank you all for joining looking forward to the presentation and discussion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 43.889,
    "end": 44.652,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.672,
    "end": 46.782,
    "text": "Thank you everyone for being here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.822,
    "end": 53.511,
    "text": "It's great to be able to present to such a knowledgeable audience of active inference aficionados",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.132,
    "end": 62.119,
    "text": " And the work that we'll be presenting today is a work that Sander van der Kruijs, Carl Friston and myself did a few months ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.139,
    "end": 70.147,
    "text": "And it is a work on a topic which I would say is rather neglected or marginal so far in the active inference literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.607,
    "end": 75.511,
    "text": "But as I will try to show, it is a topic that is very promising.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.672,
    "end": 82.738,
    "text": "It has a lot of interesting implications and indeed in recent years has been gathering a lot of attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.731,
    "end": 89.151,
    "text": " So let's jump straight into the topic and our starting point is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.502,
    "end": 114.345,
    "text": " the remarkable convergence of interest and results that has been emerging in the last few years between scholars interested in the in mind and brain from a predictive processing or active inference perspective and scholars interested in studying the arts and aesthetics from a variety of perspectives philosophy psychology and neuroscience but also increasingly the history of art and artistic practice as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.73,
    "end": 136.03,
    "text": " so this convergence of interests and results is fostering an ambitious research program that is proving beneficial for both sides because on the one hand predictive processing and active inferences are increasingly seen as frameworks that can illuminate important aspects of our aesthetic encounters and our aesthetic experiences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.465,
    "end": 153.31,
    "text": " while on the other hand the arts and aesthetics seen from these predictive processing or active inference perspectives are increasingly seen as potential windows into important aspects of our mental functioning so the talk will be exploring these two directions of research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.066,
    "end": 181.204,
    "text": " and most of what i will say uh is taken from these two papers uh one that uh sander van de kruis uh car freestone and myself wrote and that gives the title to this presentation and the other that uh i brought together with santa helmut and elvira and both papers can be found in this uh recently published uh theme issue of philosophical transactions of the royal society b",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.184,
    "end": 189.473,
    "text": " which is devoted entirely to these intersections between predictive processing and active inference on the one hand and the arts and aesthetics on the other hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.893,
    "end": 197.601,
    "text": "So if you want a sort of overview of the state of the art on the topic, I definitely recommend checking out this theme issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.723,
    "end": 203.087,
    "text": "The plan for the talk will be pretty straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.107,
    "end": 208.052,
    "text": "As I said, we will be exploring these two main directions of current research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.657,
    "end": 216.654,
    "text": " The first pertains to the ways in which we can illuminate aspects of aesthetic experience using the active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.375,
    "end": 222.446,
    "text": "And in this context, we will be seeing what we mean by aesthetic experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.408,
    "end": 227.256,
    "text": "We'll be introducing the notion of sense-making and epistemic arcs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 227.54,
    "end": 238.773,
    "text": " from an active inference perspective, and we will be talking about how these notions can clarify certain aspects of our engagement with the arts and our aesthetic experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 239.794,
    "end": 254.29,
    "text": "In the second part of the talk, we'll be talking about ways in which, on the other hand, our mental functioning can be illuminated by the arts and aesthetics considered from this active inference or predictive processing perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.725,
    "end": 262.396,
    "text": " And we will be examining a sort of analogy between what artists do and what cognitive scientists do when they study the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 263.137,
    "end": 277.197,
    "text": "And we will be clarifying how an examination of the arts and aesthetics can throw light on, among other things, the dynamics of inference, the dynamics of affect and certain aspects of well-being and psychopathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.301,
    "end": 283.787,
    "text": "And in the end, I will be presenting some conclusions and some directions for future research as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.459,
    "end": 291.096,
    "text": " So let's start by saying something on how we can illuminate aesthetic experience from an active inference perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.602,
    "end": 302.063,
    "text": "Now, we should probably start by clarifying what is our explanatory target here, that is aesthetic experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.262,
    "end": 315.7,
    "text": " Aesthetic experiences have been characterized by the philosophical and the psychological literature as experiences traditionally associated with the notion of beauty, the perception of beauty in some sensory array.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.401,
    "end": 323.009,
    "text": "And these are experiences that we undergo with varying degrees of intensity in the most varied circumstances of our life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.57,
    "end": 329.738,
    "text": "It could be that we are looking at the wonderful vista, that we are examining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.14,
    "end": 353.873,
    "text": " and finding pleasure in the arrangement of furniture in a living room, but most characteristically, aesthetic experiences are experiences that we undergo while engaging with art, while listening to great pieces of music, while confronted with great work of visual art, while reading great novels, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.134,
    "end": 359.961,
    "text": "Now, there is a set of features that are recurrently attributed to aesthetic experiences,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.38,
    "end": 366.869,
    "text": " And these are the features that we are trying to explain from this active inference perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.251,
    "end": 373.238,
    "text": "First of all, aesthetic experiences are considered to be pleasurable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.12,
    "end": 379.247,
    "text": "These are experiences that are accompanied by the pleasant affective response normally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.327,
    "end": 389.121,
    "text": "This doesn't mean that they are not uncomfortable or riddled with difficulty, but in the end, overall, they tend to be pleasurable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.265,
    "end": 415.648,
    "text": " They are also self-sustaining, and by this I mean that they are experiences in which we seem to engage without any further purpose, and in which we seem to engage in a continuous manner, finding in this particular sensory array that we are examining, novel things to examine and to be interested in and to care about as we go along.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.118,
    "end": 420.989,
    "text": " And so they sustain our serious attention throughout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.651,
    "end": 429.79,
    "text": "And we seem to care about them without any further utilitarian purpose in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.057,
    "end": 452.385,
    "text": " Aesthetic experiences are often said to be transformative in the sense that when the painting is behind us, the music is over, when we put down the book or leave the theater, we feel that we are not the same as before, that we can't change it and usually change it for the better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.973,
    "end": 464.311,
    "text": " This is a particularly strong trait associated with aesthetic experience that many refer to, and it can happen, of course, with various degrees of intensity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.331,
    "end": 474.306,
    "text": "It could be that you just felt like your worldview has changed slightly, or it could lead to massive revelations about anything, basically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.877,
    "end": 487.076,
    "text": " Aesthetic experiences are also said to be subjective in the sense that what is aesthetically appealing or pleasurable to me may not be aesthetically appealing or pleasurable to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.797,
    "end": 495.248,
    "text": "They are also said to be transient and evolving in the sense that they are characterized by an evolving",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.228,
    "end": 503.395,
    "text": " affective and cognitive profile that culminates normally with a pleasurable response, but it's not that pleasurable response or judgment alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.056,
    "end": 514.385,
    "text": "And they're also evolving in the sense that what I tend to prefer could change for me in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.405,
    "end": 524.914,
    "text": "It's not just that what you prefer and what I prefer are different, but also what I prefer in this moment in time can be different from what I prefer in another moment in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.839,
    "end": 545.15,
    "text": " And also, aesthetic experiences tend to be seen as related in some way with a feeling of freedom from existing constraints in our perceptual, cognitive or motor processes and a feeling of enhanced perception of our possibilities for action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.19,
    "end": 549.417,
    "text": "We will say more about that, but these are more or less the features",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 549.768,
    "end": 555.736,
    "text": " that we choose to concentrate on, and they are more characteristic of aesthetic experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.198,
    "end": 574.56,
    "text": "Now, the way in which we go about trying to explain these characteristics is by introducing these two notions, the notion of sense-making and epistemic arts, and trying to characterize them from an active influence perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.54,
    "end": 577.364,
    "text": " So to understand them, let's start with an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.965,
    "end": 580.328,
    "text": "You've probably seen pictures like these before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.769,
    "end": 583.953,
    "text": "They are quite common in the psychological literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.574,
    "end": 587.859,
    "text": "But perhaps you haven't seen this particular picture before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.959,
    "end": 594.608,
    "text": "If you haven't, it will probably look like a random array of white and black patches at the beginning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 594.588,
    "end": 621.388,
    "text": " but if you concentrate enough on it after a while you may start to notice that there is an animal in the picture more specifically a cow if you can see the cow here are some cues in the picture you just see the face of the cow these are the nostrils of the cow these are the eyes these are the ears of the cow now if you see the cow now you did something pretty remarkable already in the sense that you have arranged",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.942,
    "end": 626.568,
    "text": " what seemed to be like a random array of sensory stimulations into something meaningful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.608,
    "end": 628.67,
    "text": "And that's what we mean by sense making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.551,
    "end": 642.127,
    "text": "And we can sort of break down this process from an active inference perspective by thinking about a sort of epistemic arc involved in the discovery of structure in our sensory stimulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 642.788,
    "end": 651.679,
    "text": "We start with uncertainty, uncertainty about the potential causes of our sensory stimulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.823,
    "end": 682.662,
    "text": " this uncertainty in some cases in this case for example um triggers an expectation of the possibility to reduce such uncertainty and that's what curiosity looks like from an active inference perspective according to an increasing literature there is curiosity the feeling that that we can find structure in our sensorium that if we look uh for enough time we will be able to understand something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.844,
    "end": 710.522,
    "text": " is characterized from an active inference perspective as expected uncertainty reduction or expected information gain um which means the extent to which we uh we predict that we will be able to reduce uncertainty about the sensory the cause the causes of our sensory stimulations if we are curious that is indeed in the cases in which uncertainty is such that we seem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.958,
    "end": 735.463,
    "text": " the stimulus sort of yields a promise of making sense, if we concentrate on it enough, we will probably try to put in place epistemic actions, that is, actions that we perform in order to reduce uncertainty, and this could go from saccades, as we examine the picture,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.882,
    "end": 745.2,
    "text": " up to internet searches, and every sort of action aimed at reducing the ambiguity or the uncertainty of our sensory stimulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.737,
    "end": 750.804,
    "text": " And if we are lucky enough, these epistemic actions leads us to uncertainty reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.585,
    "end": 753.988,
    "text": "And in the end, we experience pleasure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.789,
    "end": 771.171,
    "text": "You may have noticed, you will have noticed that when you found the cow in the picture, as with many of these Mooney images, you probably felt a positive, affective reactions that psychologists normally call an aha moment or an aha experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.151,
    "end": 783.507,
    "text": " that has both cognitive and affective components and that accompanies the increase, the sudden clarity about the causes of your sensory stimulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.533,
    "end": 803.773,
    "text": " so overall this experience generates a sort of arc as we as we said that goes from uncertainty uh to pleasure and uh it is an arc this is a it is important it is important to stress that this is an idealized experience because things could go wrong in many ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 804.125,
    "end": 813.464,
    "text": " For example, uncertainty in your sensory stimulation could be so high that you are not quite sure that you can reduce it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.825,
    "end": 822.623,
    "text": "And so you don't experience curiosity in the first place because you are not confident in the possibilities of reducing uncertainty in your stimulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.058,
    "end": 829.93,
    "text": " But it could also be the case that your epistemic actions do not lead to uncertainty reduction, but to an increase in uncertainty instead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.01,
    "end": 831.834,
    "text": "After all, it's a changeable world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.775,
    "end": 841.531,
    "text": "And even if we put in place actions to reduce uncertainty, it could well be that uncertainty stays the same or increase even.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.513,
    "end": 846.72,
    "text": "And things could also go wrong because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.021,
    "end": 873.585,
    "text": " uncertainty in some cases is not reduced to an appreciable extent or is not reduced fast enough for us to experience this pleasurable effective response so as i said these epistemic arc is an idealized experience a way of capturing successful sense making we will say uh says making that absence in an optimal way but things could go wrong in many in many possible ways",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.51,
    "end": 887.085,
    "text": " Now, if we think about why we experience pleasure while guessing the structure of our sensorium, while settling on a specific hypothesis about the hidden causes of our sensory data,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.588,
    "end": 900.793,
    "text": " Well, that has a pretty straightforward explanation from an active inference perspective, because in this perspective, as we know, reducing uncertainty is pleasurable because it means maximizing model evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.813,
    "end": 907.926,
    "text": "That is maximizing the evidence for your own existence, something which Howe and others have called self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.918,
    "end": 924.413,
    "text": " But it's important to stress and we stress in the paper that self-evidencing is not to be seeing a sort of passive process of confirming already pre-existing belief, but it's more like an active process that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.393,
    "end": 947.43,
    "text": " um it's a process of self-transformation as well because in finding the structure of our sensorium in defining it in determining it we are also determining the structure of yourself as a model of that sensorium and so finding structure is always restructuring yourself in this way which is a very active process and that will be relevant in the in the in the rest of our discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.49,
    "end": 958.558,
    "text": " So reducing uncertainty is pleasurable, and these grounds several theories of affect and well-being from a predictive processing or active inference perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.959,
    "end": 961.841,
    "text": "I put some of the papers, the relevant papers there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.262,
    "end": 978.295,
    "text": "They all more or less stress that increasing prediction error or are normally effectively negatively balanced, whereas decreasing prediction error are normally seen as positive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.304,
    "end": 991.727,
    "text": " And these links well with certain assumptions and certain empirical results in the psychological literature and in literature in developmental robotics, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.011,
    "end": 1008.992,
    "text": " It is known, for example, that infants tend to concentrate on stimulations that are neither too unpredictable nor too predictable because these are the stimulations that maximize their learning and the refining of their model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.012,
    "end": 1011.015,
    "text": "This is known as the Goldilocks effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1012.036,
    "end": 1020.246,
    "text": "And this sort of environment, these regions of the input space that afford optimal uncertainty minimization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1020.513,
    "end": 1042.707,
    "text": " are said are sometimes called progress niches and we'll see the relevance for that for art in in a minute also overall there is a view that affects several aspects of our effective responses are related to the dynamics of uncertainty minimizations and that we experience positive aspects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.923,
    "end": 1061.251,
    "text": " in relation to our successful attempts at uncertainty minimization, and that this thing makes us concentrate towards regions of the input space that afford such an optimal reduction in prediction error minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1063.534,
    "end": 1068.762,
    "text": "Now, let's try to apply all this to the case of art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.458,
    "end": 1082.629,
    "text": " Our contention in the paper that Sander has been developing for some years now is that art provides us with good epistemic arts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.229,
    "end": 1099.525,
    "text": "That is, art provides us with these idealized experiences of uncertainty minimization, whereby we start with something which is ambiguous or not immediately responding to our predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.825,
    "end": 1104.79,
    "text": " then this thing asks us to perform epistemic actions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.04,
    "end": 1108.885,
    "text": " that are in the end successful and that leads to a pleasurable response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.945,
    "end": 1130.271,
    "text": "If we, for example, take this painting by Monet, we see this process going on at sort of a low level, a perceptual level, which is that the shapes and the water here appear so vividly because we probably put in place the same thing, the same process that we put in place in the case of the cow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.691,
    "end": 1134.456,
    "text": "That is, we have some ambiguous simulation, something which not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.672,
    "end": 1163.38,
    "text": " conform to the way in which normally water or or ships look to us but if we guess hard enough we are able to see water and ships and then we get this aha moment uh this pleasurable effective response so what monet is doing here at a low perceptual level is building such an idealized form of epistemic arc but of course that's an another important point is that these epistemic arcs can go on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.765,
    "end": 1172.382,
    "text": " at different levels of abstractions, and here we can exploit the sort of hierarchical structure that active inference and predictive processing insist on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1172.402,
    "end": 1178.955,
    "text": "For example, in certain paintings, like this Jan van Eyck painting here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.712,
    "end": 1201.618,
    "text": " The matter is not guessing what figures are in the painting, because these are represented realistically, but the point is to guess the meaning of the various attitudes, the various characters in the picture, or the various elements that the painter represents, and their specific",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.223,
    "end": 1204.146,
    "text": " position in the painting as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.848,
    "end": 1216.688,
    "text": "So these are higher level guesses which, if successful, lead to the same circle from uncertainty to pleasure that we saw on a perceptual level in the Monet painting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.14,
    "end": 1225.092,
    "text": " And of course, these guesses are not just happening at different levels, but they are also different kinds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.192,
    "end": 1244.38,
    "text": "For example, in the case of expressionist art, the matter is not just to guess the meaning of the painting or the objects represented in it, but to a larger extent to guess the intentions, the state of minds,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.562,
    "end": 1255.478,
    "text": " that the painter was experiencing or had while depicting himself in this case or any subjects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.639,
    "end": 1272.342,
    "text": "And this is a form of guessing of other mental states that is, of course, very important in the predictive processing literature and which expressionist art in particular leveraged a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.878,
    "end": 1282.378,
    "text": " But other guesses can have to do, for example, with the sort of movements that are implied or were put in place by the painter in order to produce the painting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.458,
    "end": 1292.659,
    "text": "We have an example of the famous cuts by Lucio Fontana here, but you can also think about the thick brush strokes by Van Gogh, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.639,
    "end": 1312.842,
    "text": " these allow these sorts of artworks allow the viewer the viewers to make guesses about the actions that went into the production of the artwork itself so as you see the predictive processing active inference apparatus if leveraged",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.99,
    "end": 1323.46,
    "text": " to the full extent of its possibility, can account for the pleasure that we get from different artworks in different styles in different moments in time as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.522,
    "end": 1334.992,
    "text": "Now, it's also important to understand that these guesses at various levels inform the guesses at the others level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.072,
    "end": 1341.158,
    "text": "For example, if you have understood more or less what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1341.762,
    "end": 1359.349,
    "text": " figures are in the painting, and you're making high level hypotheses about their meaning, and you make a high level hypothesis about something in particular, you might be pushed towards reexamining certain portions of the painting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.329,
    "end": 1363.175,
    "text": " and noticing something on a perceptual level that you didn't notice before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.615,
    "end": 1375.632,
    "text": "So often in art, solving ambiguities or uncertainties at a lower level opens up problems on a higher level, and solving problems on a higher level reopens problems on a perceptual level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.113,
    "end": 1383.444,
    "text": "And this, in successful art, goes on and on and on and prolongs our engagement with the artwork itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.846,
    "end": 1389.252,
    "text": "Importantly also, great artworks in particular",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.62,
    "end": 1391.723,
    "text": " are such that they keep us guessing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.824,
    "end": 1398.311,
    "text": "They have a good supply of structural indeterminacy, as Yuri Lachman puts it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.292,
    "end": 1415.492,
    "text": "That is, they are ambiguous in many ways and such that if you solve the ambiguities the first time that you see it and you experience certain epistemic acts, if you revisit it, you might experience others epistemic acts that you hadn't considered before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.624,
    "end": 1420.209,
    "text": " and you can even experience more pleasure as a result.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.471,
    "end": 1435.286,
    "text": "But indeed, great hardcores are seen as those sorts of inexhaustible stimulations that keep providing us with important insights, and that might be a way of characterizing how they do so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1436.387,
    "end": 1442.374,
    "text": "In sum, if we take into account all these ways in which art keep us guessing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.759,
    "end": 1460.498,
    "text": " we will see that artworks are conceivable, are interpretable as hyper-structurable sensory streams, progress niches in their own right, that allow us to keep improving our models of the world in a very refined way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.102,
    "end": 1474.262,
    "text": " And perhaps then the attraction that we have towards these stimulations is just part of a broader attraction that we talked before for regions of our input space that allows our optimal cognitive functioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.745,
    "end": 1490.586,
    "text": "Now, in this picture, it is important to stress that aesthetic experiences are subjective in the sense that whether a specific sensory array will afford a pleasurable experience for a specific agent will depend on the generative model that it commands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.971,
    "end": 1512.996,
    "text": " what is unpredictable or ambiguous or uncertain for me can be perfectly predictable for you and so if that's the case it doesn't prompt the same epistemic arc that it prompts for me and we see these constantly in the development of individual and collective taste that often demands",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.28,
    "end": 1530.597,
    "text": " that we search for more ambiguous, more unpredictable simulations as we learn more about a specific art form in order for us to recover the sense of wonder and insight that a certain particular simulation with the right kind of ambiguity gives us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.302,
    "end": 1541.977,
    "text": " In this picture, aesthetic experiences are also transient and evolving in the sense that they depend on the specific dynamics of uncertainty reduction and epistemic arcs involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.482,
    "end": 1557.9,
    "text": "For example, for me, this Monet painting, if seen many, many times, won't probably cause the same feeling of insight and pleasure that it caused the first time when I",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.37,
    "end": 1576.935,
    "text": " when I guessed the presence of the ships and the water in the painting, much like seeing the cow for the second time, the cow that you saw before, doesn't prompt the same aha experience to the same extent because now you are more likely to directly interpret it as a cow in an automatic way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1577.556,
    "end": 1585.447,
    "text": "And so you see that aesthetic experiences are, even with the same stimulus, can be very transient and evolving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.068,
    "end": 1587.87,
    "text": "And in a sense,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1588.525,
    "end": 1610.955,
    "text": " we are always trying with aesthetic stimulations to recover the sort of ingenuity that we had while seeing the picture or the stimulation for the first time and art is often characterized as providing us occasions to see things as for the first time and that could be a way in which it does so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1612.623,
    "end": 1642.157,
    "text": " now the last thing i i will say about um aesthetic experience and from this um active inference perspective is uh that as we saw aesthetic experiences are often characterized as having something to do with freedom of enhanced or enhanced uh sense of agency for example kant talks about the free play of cognitive faculties that will be involved in the perception of a beautiful object",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.559,
    "end": 1670.085,
    "text": " uh schiller even goes as far as saying that it is only through beauty that man makes his way to freedom so there is an ancient philosophical view that links aesthetic appreciation aesthetic experiences to freedom from existing constraints and announced perception of our possibilities for action how do we explain that from an active inference perspectives well there are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1670.487,
    "end": 1673.871,
    "text": " several ways of accounting for that aspect of our aesthetic experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.592,
    "end": 1692.816,
    "text": "One is that if the picture that we gave so far is right, aesthetic experience are occasion of enhanced self structuring in the sense that they are moment where we determine the structure of our sensorium at a faster rate than usual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.387,
    "end": 1698.573,
    "text": " And in doing so, we determine our own structure in a faster rate than usual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.114,
    "end": 1713.952,
    "text": "In a sense, we keep building ourselves, we keep changing, we free ourselves from existing ways of perceiving things, and we turn our minds into moving targets while we engage with these stimulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.152,
    "end": 1723.123,
    "text": "So these probably capture something about the notion of autonomy that Kant had in mind also when speaking about art,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.559,
    "end": 1750.41,
    "text": " and that is intriguingly finding new application in cognitive science as well and activists for example insist on this notion of autonomy as well which is giving yourself your own rule and perhaps in aesthetic experiences we are doing that to an enhanced degree because we are determining the structure of the sensorium and the structure of ourselves as models of that sensorium in a faster rate at a faster rate than usual but another way of thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.93,
    "end": 1764.552,
    "text": " how aesthetic experiences can boost our sense of freedom and agency is that these experiences are normally conducted or encountered in the absence of pressing needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.24,
    "end": 1778.394,
    "text": " That is, we have no pressing needs that push us to organize our sensorium in precise ways, and we are free to explore many hypotheses about the underlying structure of our simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.955,
    "end": 1785.722,
    "text": "And this is probably what people in aesthetics talk about when they talk about the aesthetic disinterestedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.263,
    "end": 1789.206,
    "text": "There is that specific state of mind that one has to have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.54,
    "end": 1798.409,
    "text": " when approaching something aesthetically, which is a state of mind of disconnect with practical interest or interest of other kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.049,
    "end": 1805.195,
    "text": "And this frees up space to explore other possibilities of perceptual and cognitive organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.957,
    "end": 1817.387,
    "text": "Another thing that one can take from the active inference framework in order to explain this relationship between aesthetic experience and freedom",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.941,
    "end": 1837.451,
    "text": " is that perhaps, as we speculate in the paper, when we experience a sudden reduction in prediction error, in uncertainty, these, in a certain sense, boost our confidence in the ability to reduce uncertainty in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.872,
    "end": 1843.24,
    "text": "There are interesting studies by you and colleagues, for example, our Barmbierian colleagues,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.675,
    "end": 1860.574,
    "text": " that show in this case, for example, that even an aha experience of the kind that you experience with a cow can encourage risky decision making in a subsequent task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.375,
    "end": 1867.742,
    "text": "And this study by Barbieri and colleagues shows that the stimuli that we tend to like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1867.84,
    "end": 1872.31,
    "text": " are also accompanied or foster more curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.852,
    "end": 1882.153,
    "text": "So in a sense, one can see successful aesthetic experiences as something that allows us to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.792,
    "end": 1898.495,
    "text": " broaden that epistemic arc that we examined before, because we have more confidence that we will be able, if we engage with epistemic actions for the necessary time, to reduce uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.076,
    "end": 1903.923,
    "text": "And we all face experiences in which these epistemic arcs are very short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.345,
    "end": 1912.596,
    "text": "In the paper, we make the example of internet memes, which are for these very short epistemic arcs of uncertainty and discovery,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.998,
    "end": 1926.019,
    "text": " But art is normally seen as boosting our confidence in our ability to endurance and uncertainty, something which is sometimes referred to as negative capability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.861,
    "end": 1934.874,
    "text": "And so that's perhaps an interesting effect that art could have if examined from this active inference perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1936.777,
    "end": 1939.461,
    "text": "Now, summing up this part of the talk,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.352,
    "end": 1962.361,
    "text": " We have seen that the active inference of predictive processing apparatus helps us explain why aesthetic experiences are pleasurable, namely because they are instances of successful self-evidencing, why they are self-sustaining, because they are made possible by sensory streams that fuel our curiosity and keep us guessing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.242,
    "end": 1967.187,
    "text": "They are transformative because they are instances of enhanced self-structuring,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.723,
    "end": 1971.389,
    "text": " They are subjective because they depend on the agent-specific generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.93,
    "end": 1976.277,
    "text": "They are transient and evolving because they depend on the specific dynamics of uncertainty reduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.898,
    "end": 1989.478,
    "text": "And they are linked to freedom and enhanced agency because they are instances of enhanced self-structuring again, conducted in the absence of pressing needs, and that boosts our confidence as uncertainty minimizes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.319,
    "end": 2003.738,
    "text": " now for the second part of the talk which is slightly shorter we will examine ways in which our mental functioning can be illuminated by the arts and aesthetics if we consider them from this particular processing perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.017,
    "end": 2027.38,
    "text": " now it's important to see that in this framework artists are seen as experts in cognition and in inference in particular in the sense that they know what cues ought to be presenting to our sensory organs for us to formulate certain evolving hypotheses about what we are sensing um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.22,
    "end": 2041.183,
    "text": " A painter, for example, knows what sensory array to produce in order for you to guess that there is a certain object in the painting, but not just that, in order for you to guess it with a certain profile of uncertainty minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.568,
    "end": 2047.579,
    "text": " And artists have sort of implicit, largely implicit knowledge of these dynamics of uncertainty minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.599,
    "end": 2053.03,
    "text": "For example, they can feel the tensions, the visual tensions of an unbalanced picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.471,
    "end": 2061.045,
    "text": "They can tell what note or what word we expect in a sentence or in a melody.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.025,
    "end": 2070.121,
    "text": " And they can craft cinematic flows with the right kind of abruptness or invisibility in the editing, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.221,
    "end": 2078.376,
    "text": "So every artist has in this framework sort of a large body of implicit knowledge about the dynamics of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.33,
    "end": 2099.248,
    "text": " And indeed, art is probably a place where these dynamics of influence and their cognitive and affective correlates become particularly visible in the sense that all what artists are doing is to manipulate these dynamics in order to produce on us cognitive and affective reactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.67,
    "end": 2109.578,
    "text": "So therefore, the thesis is that artists and aestheticians, to the extent that they have access to this large body of implicit knowledge,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.013,
    "end": 2120.354,
    "text": " might therefore contribute to our understanding of modern things, the dynamics of inference, the dynamics of affect, and certain aspects of well-being and psychopathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.434,
    "end": 2123.24,
    "text": "So let's examine these three things in turn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.384,
    "end": 2128.41,
    "text": "Well, as we said, probably artists possess",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.61,
    "end": 2131.154,
    "text": " this implicit understanding of our inferential dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.194,
    "end": 2146.477,
    "text": "For example, if Mozart here crafts a melody, he knows whether a certain note is to be expected given the preceding context or whether to introduce another note which is not expected given the predicted context in order to generate certain effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.258,
    "end": 2156.372,
    "text": "In fact, some people characterize music theory as the most developed folk psychology currently extant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2157.01,
    "end": 2168.682,
    "text": " exactly to capture this fact that within artistic practice, there is embedded a large body of knowledge about the dynamics of our inferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2170.304,
    "end": 2172.667,
    "text": "And the same goes for a poet, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.687,
    "end": 2183.558,
    "text": "This is not a particularly poetic example, but for a poet that chooses carefully the words of his poem in order to generate certain profiles of uncertainty minimization,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.162,
    "end": 2191.877,
    "text": " So one can say that artists are astute manipulations of the inference we make and the timing with which we make them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.532,
    "end": 2200.484,
    "text": " And this knowledge can indeed be exploited to link the personal and the supersonal level when we examine experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2200.784,
    "end": 2217.088,
    "text": "For example, and this is an interesting point, many of these violations of our melodic or semantic expectations have neural markers that can be registered with electroencephalography, as you see here in the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.76,
    "end": 2238.874,
    "text": " And so by linking these neural correlates with the phenomenological variations that they are accompanied by, which artists and aestheticians examine, perhaps we can have a means to contribute the literature on the neural correlates of consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2239.259,
    "end": 2251.117,
    "text": " or to that scientific enterprise that goes by the name of neurophenomenology that does exactly this operation of connecting subpersonal and person-level experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.578,
    "end": 2255.504,
    "text": "So art could give us access to ways of doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.547,
    "end": 2267.983,
    "text": "Now, as we said, from a predictive processing or active inference perspective, cognition and perception are always accompanied by affect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.385,
    "end": 2291.355,
    "text": " because they are about our existence as viable models of the world so in mastering the dynamics of inference artists are probably also mastering the dynamics of affect and particularly the dynamics of those emotions or those affective states that are sometimes called epistemic or metacognitive emotions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.74,
    "end": 2297.386,
    "text": " things like surprise, confusion, curiosity, uncertainty, boredom, insight, disfluency, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.047,
    "end": 2304.514,
    "text": "Many of these things, interestingly, are starting to be examined from a predictive processing perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.395,
    "end": 2321.393,
    "text": "And again, art could be a way in which we bring the expertise of artists and aestheticians about these states and the way they are produced to bear on research in cognitive science that examine the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.031,
    "end": 2332.38,
    "text": " And this could also inform debates in philosophy and cognitive science about things like affective engineering, affective scaffolding, and extended affectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.861,
    "end": 2349.456,
    "text": "There is ways of conceptualizing the many ways in which we modify our affective states by modifying things in the environment, and we manage our affective states by managing the sort of stimulation that we encounter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.74,
    "end": 2362.715,
    "text": " Art seems to be a particularly interesting case of affective scaffolding or extended affectivity, and it is interesting to see that indeed art is starting to be examined from that perspective in some recent work as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.781,
    "end": 2365.723,
    "text": "And finally,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2366.041,
    "end": 2383.819,
    "text": " as for wellbeing and psychopathology, well, we saw that aesthetic experiences, if we are right, have a lot to do with optimal cognitive functioning in the sense that they afford those optimal experiences that we characterise as epistemic arts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2385.48,
    "end": 2391.306,
    "text": "They are about optimal information seeking, about optimal development of our mental models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.893,
    "end": 2405.073,
    "text": " And so to the extent that artists and aestheticians have access to these dynamics, perhaps we can gather for them indication on how to design experiences that favor involvement, motivation, learning, and discovery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.094,
    "end": 2412.884,
    "text": "And this is indeed an increasing stream of research that goes sometimes under the name of art therapy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.705,
    "end": 2416.77,
    "text": "And there are many studies examining the effects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.122,
    "end": 2438.087,
    "text": " of the exposure to artistic stimuli on several cognitive faculties and abilities that seems to go in that direction, in the direction of suggesting that artists have some sort of knowledge on how to arrange sensory streams that boost these things, involvement, motivation, learning, and discovery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2439.328,
    "end": 2441.931,
    "text": "And finally, perhaps,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2442.738,
    "end": 2456.244,
    "text": " if aesthetic experiences have a lot to do with optimal cognitive functioning, they can perhaps shed light on forms of pathological cognitive functioning or epistemic behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.869,
    "end": 2465.522,
    "text": "Because indeed, one thing that active inference allows us to do is to conceptualize many",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.873,
    "end": 2488.135,
    "text": " pathologies of our information seeking collective information seeking like echo chambers conspiracy theories and so on and many psychopathologies like schizophrenia delusion autism anxiety and mood disorders like anxiety and depression is having to do something with sub optimal ways of engaging with environmental uncertainty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.334,
    "end": 2502.896,
    "text": " So if art can tell us something about optimal cognitive functioning, perhaps it can tell us something about deviations from this optimal cognitive functioning, which it is important to stress, are often put in place in order to recover that viability in the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.857,
    "end": 2518.138,
    "text": "And on the other hand, studies about these pathological conditions could also inform the production, the study of the production of art and aesthetic experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.03,
    "end": 2530.545,
    "text": " Because, as you know, there is a long tradition of studies linking creativity in art with psychopathological conditions, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.565,
    "end": 2542.0,
    "text": "OK, so let's draw some conclusion now and some direction for future research by just rehearsing what we said so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.368,
    "end": 2563.515,
    "text": " uh so we have seen that there is a remarkable convergence of interest and results between scholars working within the predictive processing or active inference framework and scholars studying the arts and aesthetics this convergence is proving beneficial for both sides because on the one hand predictive processing and active inference are illuminating aspects of our aesthetic experiences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.934,
    "end": 2573.029,
    "text": " Things like why they are pleasurable, why they are self-sustaining, transformative, subjective, transient, linked to freedom and us, the agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.95,
    "end": 2577.396,
    "text": "Apologies for the misspellment there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.039,
    "end": 2590.077,
    "text": "And on the other hand, art and aesthetics are beginning to be seen as windows into mental functioning and revealing something about the dynamics of inference, the dynamics of affect and well-being in psychopathology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.086,
    "end": 2618.832,
    "text": " now to point out directions for future research uh in aesthetics in particular which is a big field that has uh contributors from philosophy psychology uh neuroscience and so on uh the next thing to to study probably from this predictive processing or active influence perspective or the next thing that are needed are a more empirical testing of the predictive processing hypothesis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.166,
    "end": 2621.389,
    "text": " which are sometimes very difficult to test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.609,
    "end": 2635.806,
    "text": "In the introduction to the theme issue, we examine some of these difficulties, which have to do mainly with the way of gathering measures of uncertainty and uncertainty minimization, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.027,
    "end": 2647.62,
    "text": "So more empirical testing is needed, but also more insights into the neural underpinnings of these dynamics, which are quite often linked to the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.275,
    "end": 2674.367,
    "text": " limbic systems and and the relationship between uh the way in which we conceptualize dopamine and other hormones from a predictive processing perspective but the neural underpinnings of these epistemic cars these aha moments are still all to be clarified uh also it is important to understand how these predictive processing perspective that we are advancing connects with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.718,
    "end": 2701.3,
    "text": " uh links to other frameworks in empirical aesthetics which is a big field with a long history and this is particularly important if you want to to discern uh the specific predictions that have to do with the predictive processing framework from predictions uh that are made in other frameworks as well and an important also expansion expansion of the story would be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.432,
    "end": 2724.572,
    "text": " its extension to not just exteroceptive stimulation, which have been the subject of our attention in the presentation and in our papers mostly, that is stimulation that we get from the environment, but also proprioceptive and interoceptive stimulations that have also their own inferential dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.173,
    "end": 2730.898,
    "text": "And they could open possibilities, for example, to conceptualize also things like sports,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.368,
    "end": 2743.583,
    "text": " performative arts, the playing of instruments, for example, or skillful motor behaviour as a form of aesthetic experience itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.225,
    "end": 2761.105,
    "text": "And another relevant expansion of the story, which hasn't been covered so far a lot, is taking the artist's perspective, because we talked a lot about aesthetic experience, that is, experience of subjects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.338,
    "end": 2769.31,
    "text": " exposed to aesthetic stimulations, but we haven't talked much about the way in which these stimulations are produced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.39,
    "end": 2778.543,
    "text": "That is the creative process that is put in place by artists in order to generate these carefully curated sensory streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.984,
    "end": 2783.43,
    "text": "And there is a very interesting beginning of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.136,
    "end": 2797.199,
    "text": " exploration in the paper by Axel Constant and colleagues in the theme issue, which I refer you for more on creativity and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.762,
    "end": 2801.487,
    "text": "More broadly,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.057,
    "end": 2817.248,
    "text": " The expansions of the view that I am presenting for cognitive science have to do, as we said already, with studying the dynamics of inference after the well-being of psychopathology, which are all directions that are very much still to be explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.869,
    "end": 2844.315,
    "text": " but also there are many other phenomena that are normally examined under an aesthetic perspective, but that have also been given accounts from a predictive processing perspective, things like learning, attention, motivation, and conscious experience that are very much still to be examined from this perspective, and that would probably profit from the encounter between aesthetics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.751,
    "end": 2848.214,
    "text": " and art on the one hand and active inference on the other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.695,
    "end": 2858.823,
    "text": "Okay, I conclude by just reminding you again of the theme issue on these topics and thanking once more my collaborators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2859.324,
    "end": 2870.814,
    "text": "First of all, Sander van der Kurs, which is also here, will be able to stay for the Q&A and answer your concerns as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.675,
    "end": 2874.437,
    "text": "Carl Friston, Helmut Leder and Elvira Bratico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.94,
    "end": 2876.342,
    "text": " Thank you very much for your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.362,
    "end": 2878.264,
    "text": "I look forward to an interesting discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.928,
    "end": 2881.328,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2881.368,
    "end": 2882.81,
    "text": "Thanks for the presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2883.751,
    "end": 2885.994,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2886.014,
    "end": 2886.355,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.977,
    "end": 2888.317,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2889.819,
    "end": 2893.704,
    "text": "Well, lots of places to jump in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2894.024,
    "end": 2899.952,
    "text": "Perhaps Sander first, and then Axel, if you would like to make any",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.017,
    "end": 2926.665,
    "text": " initial remarks or just give any context or what you are left with from the presentation uh well it was a great overview of uh of the work we've done together and um i have little to add immediately um but but yeah i need i'm i'm interested in like how can we uh empirically test this and how can we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2926.645,
    "end": 2933.536,
    "text": " quantify uncertainty in a way that we can link it to people's experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2934.037,
    "end": 2950.965,
    "text": "And in music this is happening a bit, like people are using models that output measures of uncertainty while processing progressions of chords, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.945,
    "end": 2954.31,
    "text": " This is the work of Cheng.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2955.732,
    "end": 2972.515,
    "text": "And there it's found that these models, the surprise measures and the uncertainty measures that are derived from these models, they predict the emotions that individuals are experiencing when listening to this music.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.495,
    "end": 2979.084,
    "text": " So that's an interesting step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.304,
    "end": 2991.6,
    "text": "And the next step, I guess, would be to look at it at a more personalized way in which we, for example, have jazz lovers and we train this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.58,
    "end": 3020.473,
    "text": " it is a computational model on jazz music and and we see whether the surprise and the uncertainty that that kind of model output that that it it links better to the emotions of the jazz lovers than to general listeners so and it's really tuning the uncertainty to to the to the individual or the group in this in this case so that that's for me a very promising and interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.453,
    "end": 3023.917,
    "text": " route to take next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.658,
    "end": 3034.13,
    "text": "But in general, I think I'm happy with the story that Jacopo told, so I want to hear your reactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.276,
    "end": 3038.576,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3039.177,
    "end": 3040.859,
    "text": "Axel?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3040.879,
    "end": 3043.102,
    "text": "Yeah, well, thanks, Jacopo, for your talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3043.122,
    "end": 3046.326,
    "text": "It was really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.048,
    "end": 3056.384,
    "text": " So, yeah, I guess I have two large sets of questions, one of which you already sort of highlighted, which is about creativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.664,
    "end": 3056.864,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.965,
    "end": 3067.943,
    "text": "Relation between the creativity as the creativity, as that which as an attribute of the artist,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.176,
    "end": 3097.17,
    "text": " product or process and that's how you sort of operationalize it in psychology sometimes you will have the creativity of the thing that you sort of produce that is a creative product or a creative process and that is my experience as someone who produced that thing that is creative you know that can also be creative in a sense right and the first or the set of questions that have to do with creativity for me it's especially this interesting observation that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3097.505,
    "end": 3103.817,
    "text": " the creativity of the process doesn't seem to be predictive of the creativity of the product, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.799,
    "end": 3109.769,
    "text": "Because product creativity have two criteria, the aptness and the novelty, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.889,
    "end": 3113.556,
    "text": "And the aptness has to do with, let's say, I want to create a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3114.211,
    "end": 3135.831,
    "text": " a stand for a laptop it can be a creative laptop stand but for that stand to be a creative as a product quote unquote it also has to work it also has to hold my laptop right so that's the app nest criteria it has to be useful and has to work for what it designed it's designed to to do right so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3136.165,
    "end": 3152.297,
    "text": " And then you have the novelty, which is a statistical criterion, which is from the point of view of all the kind of laptop stands that have been produced, which of those are considered most original, if you will, from the point of view of the people who would assess all the population of laptop stands, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3153.76,
    "end": 3157.347,
    "text": "And again, that doesn't seem to track with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3157.816,
    "end": 3181.461,
    "text": " my creativity the creativity of the process of me producing laptop stands right so i can i can i think or feel like i'm producing a pretty boring laptop stand and it turns out to be a very creative product creative laptop stands right so i would be interested in uh hearing you on the this sort of um you know not a contradiction but something that is slightly unexpected right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3181.913,
    "end": 3184.598,
    "text": " So that's the first set of questions concerning creativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3184.658,
    "end": 3187.744,
    "text": "It revolves around this interesting finding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3188.626,
    "end": 3199.146,
    "text": "And then the other set of questions has to do with... I think this is a more general problem in the predictive processing literature and aesthetic experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3199.413,
    "end": 3204.023,
    "text": " We often say that for you it's the concept of the aesthetic arc, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3204.043,
    "end": 3217.573,
    "text": "And hearing you, it sounds as though traveling on the arc, if you will, so reducing my uncertainty, would in and of itself be pleasurable, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3217.84,
    "end": 3220.604,
    "text": " I'm not very clear on why that would be the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.704,
    "end": 3224.59,
    "text": "I would like that to be the case because it sounds very intuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3224.65,
    "end": 3228.215,
    "text": "When I reduce my uncertainty, it's good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3228.355,
    "end": 3229.216,
    "text": "I like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3229.296,
    "end": 3229.877,
    "text": "It works well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3230.658,
    "end": 3244.017,
    "text": "But really, for that to be the case, we would need a story about how the computational physiology, according to active inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3243.997,
    "end": 3269.987,
    "text": " right maximum to the actual physiology neurophysiology of pleasure right so i'm not sure we have that story well maybe we do but i haven't seen it right or the the alternative would be something like um once i'm at the end of that sort of travel on that arc right i arrive at an outcome which will be pleasurable or rewarding and that works for me right but the art in and of itself",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3270.44,
    "end": 3274.666,
    "text": " because it's a process of minimizing uncertainty, it would be, therefore, pleasurable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3275.447,
    "end": 3279.131,
    "text": "I would need more explanation of why that would be the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3279.712,
    "end": 3282.476,
    "text": "So I guess, yeah, those are the two sets of questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3284.298,
    "end": 3284.679,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3284.719,
    "end": 3286.401,
    "text": "Excellent questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.623,
    "end": 3295.413,
    "text": "I'll start, if you don't mind, Assan, and then you'll probably add more, especially perhaps about the second question as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.914,
    "end": 3299.198,
    "text": "But in any case, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.887,
    "end": 3304.154,
    "text": " Creativity, process creativity versus product creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.557,
    "end": 3327.43,
    "text": "I think the discrepancy that you point out could be characterized as thinking, again, about the fact that people command different generative models and have, for example, this could lead to different views about what's a great way of arranging a sensory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3327.967,
    "end": 3331.191,
    "text": " array in order to produce certain results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.232,
    "end": 3348.451,
    "text": "An artist could feel that, especially if he has practiced similar procedures very frequently, that the solution at which he or she arrives at is boring or uninteresting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3348.531,
    "end": 3354.598,
    "text": "And the audience may feel very different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.186,
    "end": 3363.205,
    "text": " for the fact that the generative model is different, they don't expect a particular solution, perhaps even",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.978,
    "end": 3380.032,
    "text": " It's often the case that this solution has been arrived at serendipitously, that the designer hasn't accounted for certain uses or certain way of reading the stimulation that people find in the stimulation themselves because they command different generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.873,
    "end": 3388.24,
    "text": "And so perhaps there are ways of accounting for this discrepancy between product creativity and process creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3388.64,
    "end": 3389.641,
    "text": "But it's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.741,
    "end": 3393.124,
    "text": "I've always found interesting the way in which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.543,
    "end": 3407.223,
    "text": " Product creativity is described, as you said, as having to do with both aptness and novelty, because it seems that these two things captured two aspects of the story that we have been telling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.263,
    "end": 3418.42,
    "text": "Novelty, of course, captured the sort of uncertainty, unpredictability of a certain sensory array and the way in which you should interact with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3419.024,
    "end": 3430.536,
    "text": " whereas aptness captured sort of the end of the parable, when you get the insight and you get how all the pieces should fit together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.576,
    "end": 3437.183,
    "text": "And you need to have both in order to have an aesthetic experience in our account and in order to be creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.243,
    "end": 3447.934,
    "text": "So perhaps there is the nice link here between the aesthetic experience of the viewer and the creative process that generated that experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.572,
    "end": 3449.093,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.253,
    "end": 3454.138,
    "text": "So it would be like I had this laptop stand that I look at it and I'm like, what's that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3454.158,
    "end": 3455.96,
    "text": "And I try to use that thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3456.24,
    "end": 3458.762,
    "text": "And then I figure out that it is a laptop stand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3459.123,
    "end": 3468.392,
    "text": "And that whole process, once I figured out that it is a laptop stand and it works well as a laptop stand, the aptness criterion is met.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3469.333,
    "end": 3475.98,
    "text": "But to get to that point, I had to go through a process of uncertainty minimization because it was such an original and novel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3475.96,
    "end": 3484.17,
    "text": " Exactly, because you notice aptness more in a sense if it comes into a context in which you need to discover it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.253,
    "end": 3490.839,
    "text": "Otherwise you are just acting automatically on an object that you already know how to use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.239,
    "end": 3504.516,
    "text": "You can perceive the creativity of the object, even a mug is creative in a sense because it affords a certain way of using it, but you need to recover in a sense that creativity that past generations of makers have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3504.8,
    "end": 3508.964,
    "text": " put into that object, which is not visible to you anymore, in a sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3509.645,
    "end": 3533.929,
    "text": "So again, you have a sort of a relationship between creative processes which do not look creative according to how habituated we are to them and the aesthetic experience as we conceptualize it, which has to do with stimuli that are novel enough for us to notice them, but not so novel that we are not able to use them anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.09,
    "end": 3551.715,
    "text": " I would just add to that, because that's very important to see the aesthetic experience also as a creative act in a sense, that this blurring of the line between the creator and the perceiver",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3551.695,
    "end": 3564.176,
    "text": " It is important in this view that every aesthetic experience is, in a sense, because of this discovery aspect and a creative act as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.298,
    "end": 3576.117,
    "text": "And so the aptness is very much dependent on the models of the viewer or the models of the creator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.097,
    "end": 3584.676,
    "text": " I mean, that there is discrepancy outside and inside, that's like a logical thing to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.377,
    "end": 3591.591,
    "text": "And of course, as much as the models overlap between the audience and the artist,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.28,
    "end": 3608.694,
    "text": " uh, then there will be agreed upon creativity, um, strength as it were of, of the, the object, but, but it might come across as very creative for one person, but not, not at all for another person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3608.714,
    "end": 3609.095,
    "text": "So, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.875,
    "end": 3610.176,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3610.196,
    "end": 3616.861,
    "text": "And it, it, you know, you often hear stuff like, especially for things like contemporary art, right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3616.881,
    "end": 3619.183,
    "text": "Uh, where people will say, you know, I don't see the point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3619.343,
    "end": 3620.665,
    "text": "I don't see why that's interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3620.985,
    "end": 3621.105,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3621.406,
    "end": 3645.422,
    "text": " whereas for another person who might be some somewhat of an expert in contemporary art that person would see how interesting and novel you know as a product that piece of work is right so it sounds like um even though you can explain why a creative process does not necessarily lead to a creative product right but there must be some kind of you know there has to be some kind of um you know",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3645.976,
    "end": 3659.565,
    "text": " you know, tracking or correlation between the two models, the model of the perceiver and the model of the artist that has produced the product or a piece of work, because otherwise you fall into those situations where people, they just don't understand what's going on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3659.625,
    "end": 3660.147,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3660.167,
    "end": 3663.053,
    "text": "And then there's no aesthetic pleasure or aesthetic experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3663.674,
    "end": 3664.997,
    "text": "So then the question is, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3665.416,
    "end": 3675.486,
    "text": " Is there a sweet spot of kind of mismatch between, because that would be exactly what accounts for the possibility of an aesthetic art, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3675.626,
    "end": 3684.015,
    "text": "There must be some kind of mismatch between the model, the artist that produced the product and the model, the perceiver, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3684.375,
    "end": 3687.358,
    "text": "That, you know, perceives the product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3687.799,
    "end": 3691.963,
    "text": "And because if there is no mismatch, it would just be like a clear communication, like a stop sign.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3692.348,
    "end": 3692.648,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3693.149,
    "end": 3700.999,
    "text": "The model of the government that produced the stop sign matches perfectly your model of what a stop sign is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3701.179,
    "end": 3706.566,
    "text": "And so there isn't really a sort of an aesthetic arc to go through to understand the meaning of the stop sign.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3706.667,
    "end": 3706.987,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3707.007,
    "end": 3715.538,
    "text": "So the question becomes, what is the sweet spot basically in terms of mismatch between the model of the artist and the model of the perceiver?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3715.518,
    "end": 3736.142,
    "text": " And then maybe you can look at art history and what typically is the sort of educational background of great artists, what kind of typical experience they had in their life, and what kind of model that could have led to and how mismatched that type of model is with the model of the population at a certain time in history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3736.122,
    "end": 3753.321,
    "text": " right so uh yeah yeah and and it's i mean that it's also like the culturally dominant model that is important there and and you see that artists will play around and will hit and miss and these kind of things i mean they will experiment a lot",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3753.487,
    "end": 3761.578,
    "text": " and be early on their own times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.199,
    "end": 3772.153,
    "text": "They might propose some forms of uncertainty that culture cannot deal with at that time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.133,
    "end": 3778.722,
    "text": " A lot of those things we just don't know about, of course, because they're not filtered by history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.762,
    "end": 3787.795,
    "text": "It's only afterwards that we realize these dynamics were playing, and he found the sweet spot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3787.955,
    "end": 3796.827,
    "text": "But yeah, it's not in advance, I guess, or very hard in advance to predict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3799.651,
    "end": 3800.132,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3800.315,
    "end": 3816.957,
    "text": " I would add that there is a whole field like in aesthetic theory or in the theory of art, which is called like the aesthetics of reception, whose role is exactly to study the sort of system of expectations that a certain audience has at a certain moment in time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.426,
    "end": 3828.925,
    "text": " and the way in which the new artistic product interacts with these expectations by violating them to a larger or lesser extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3829.606,
    "end": 3837.139,
    "text": "And so there is already a tradition of studies that understood that if you violate things too much,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.676,
    "end": 3857.102,
    "text": " reception is not going to be good if you violate them uh too little it's not going to be interesting so this this sort of sweet spot talk that you that you adopted is very much used uh in that literature as well and of course this active inference story has the merits of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.251,
    "end": 3881.875,
    "text": " uh connecting those early intuitions with this neurocomputational language and and all the literature on all the other cognitive phenomena that i explained within the same framework i'd say and as for the second also very interesting uh um question uh if i understood you well you gave two alternatives either you have pleasure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.479,
    "end": 3890.151,
    "text": " along the whole arc that we have described, or you have pleasure in the end, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.876,
    "end": 3899.747,
    "text": "To explain the relation between pleasure and the epistemic arc, it would be to say, well, there's a process theory of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3899.767,
    "end": 3902.091,
    "text": "So it speaks also to actual neurophysiology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3902.611,
    "end": 3905.636,
    "text": "Whether that theory holds, that's an open question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3905.957,
    "end": 3909.803,
    "text": "But for the claim to work, that computational",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3909.783,
    "end": 3915.514,
    "text": " neurophysiology would have to match the neurophysiology of pleasure, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3916.316,
    "end": 3916.837,
    "text": "That's the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3917.558,
    "end": 3919.803,
    "text": "Or the alternative is, well, it's not about the arc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3920.063,
    "end": 3921.205,
    "text": "It's about the end product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3921.346,
    "end": 3924.051,
    "text": "And the arc is what you need to get to the end product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3924.913,
    "end": 3925.033,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3925.053,
    "end": 3926.155,
    "text": "So, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3926.894,
    "end": 3946.438,
    "text": " it's very interesting i agree uh and that's one of the problems that i was hinting at and in the end that there is no clear story to my knowledge but my knowledge is very limited because i have a philosophical philosopher by training um about how to map these things into the what is known about the neurophysiology of pleasure the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3946.418,
    "end": 3972.072,
    "text": " um the limbic system there is some some work in that direction uh we we mentioned some of it in in the in the paper that has to do with dopamine dopaminergic discharge during the arm moment i guess so in the end that will be in the end of the process uh um but conceptually at least what sustains the attention of the viewer throughout the process is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.592,
    "end": 3984.728,
    "text": " First of all, curiosity is not pleasure or not pleasure in a traditional sense, but the expectation that things are going to make sense in the end if we take enough effort to observe them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.629,
    "end": 3994.66,
    "text": "And the other half is the pleasure half, I would say, in which uncertainty, if you are lucky, gets reduced and gives you this output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.141,
    "end": 4000.708,
    "text": "But yeah, I'm curious to see what Sander thinks about the question as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4002.14,
    "end": 4022.173,
    "text": " yeah i'm not i think if you talk about neurophysiology of course active inference has a whole other take on the dopaminergic system and and all these reward systems but but but um in a sense i i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.153,
    "end": 4031.166,
    "text": " The positive effect is just like you talked about this confidence boost after restructuring, after sudden restructuring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4031.847,
    "end": 4041.681,
    "text": "I think that the positive effect is just this feeling of the confidence and opening up of alternatives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.032,
    "end": 4063.703,
    "text": " Which probably has to do with a precision that is, in a diffuse way, projecting back to all the things that you are doing, but in what way specifically, that's very unclear to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4063.683,
    "end": 4090.129,
    "text": " but it seems to be that dopamine dopamine might be well placed or these systems might be well placed to have a diffuse effect on further processing in a kind of uh yeah uh energizing sense but but but i'm not thinking about pleasure as the traditional reward sense uh i don't i don't think that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4090.109,
    "end": 4118.31,
    "text": " very useful in in a in an active inference uh framing um yeah because yeah it doesn't really explain much if you yeah if if you just point to a reward Center that is then activated and so so so I I try to see it as more as as a kind of network effect and as a kind of um yes as you discuss this subsequent effects of of an aha that then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.712,
    "end": 4126.126,
    "text": " boost your autonomy by having these effects on precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4127.269,
    "end": 4131.297,
    "text": "But yeah, that's all very speculative still, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4132.719,
    "end": 4135.244,
    "text": "Yeah, so two points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4135.745,
    "end": 4139.252,
    "text": "Jacopo, you said having a sustained attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4139.468,
    "end": 4153.286,
    "text": " So maybe in what we call aesthetic experience, there needs to be sufficiently sustained attention for long enough to get to that sort of rewarding, not rewarding point, but that endpoint center that you're talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4153.506,
    "end": 4159.935,
    "text": "So maybe that's the epistemic aspect of that arc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4160.856,
    "end": 4165.142,
    "text": "Its function would be to maintain, let's say, attention for long enough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4165.723,
    "end": 4169.087,
    "text": "And now the question is, what does that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4169.405,
    "end": 4184.612,
    "text": " afford to to that experience is and then an answer could be something like uh there's research on how in those models the volatility in your beliefs about the structure of the world that is your transition matrix that relate to stuff like anxiety",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4184.592,
    "end": 4187.237,
    "text": " from the point of view of neurophysiology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4187.398,
    "end": 4196.836,
    "text": "So maybe that what we call aesthetic pleasure is just the release or the reduction of a feeling of anxiety and uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4196.856,
    "end": 4202.568,
    "text": "And the aha moment is not like an aha of knowledge, it's an aha of relief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4203.089,
    "end": 4206.195,
    "text": "So I don't know, maybe that's how you can conciliate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4206.58,
    "end": 4215.574,
    "text": " But at any rate, you would have to make or people who make that claim that the art is pleasurable because reducing uncertainty is pleasurable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4216.595,
    "end": 4225.87,
    "text": "Again, I'm not saying I know, Senator, that's not that's not your claim, but I feel like that in the literature, we sometimes read that minimizing the uncertainty per se is pleasurable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4226.47,
    "end": 4227.192,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4228.113,
    "end": 4229.155,
    "text": "I doubt that that's the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4229.315,
    "end": 4234.663,
    "text": "Maybe it has to be said that is, you know, reduce anxiety makes you, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4235.082,
    "end": 4241.171,
    "text": " in a state that you're poised to having this sort of pleasurable endpoint or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4242.373,
    "end": 4247.019,
    "text": "Yeah, that's an important point that maybe wasn't emphasized enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4247.059,
    "end": 4255.952,
    "text": "But indeed, if active inference is true, then we're constantly reducing uncertainty by actions, by walking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4256.093,
    "end": 4259.858,
    "text": "And so it cannot be merely that, it has to do with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.838,
    "end": 4265.345,
    "text": " some kind of unexpected rate of uncertainty reduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4265.706,
    "end": 4282.487,
    "text": "That's why artists work with obstacles and creating uncertainty to try to have this experience, but always in a fallible way, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.467,
    "end": 4294.485,
    "text": " to try to give us the experience that that we suddenly resolve the uncertainty in a way that is faster than than we expected maybe when engaging with it first and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.921,
    "end": 4298.806,
    "text": " Yeah, but that just sort of pushes the problem upward, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4298.826,
    "end": 4302.532,
    "text": "It's not the first level of uncertainty, it's the uncertainty over the uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4302.732,
    "end": 4309.802,
    "text": "But if you say, well, the pleasure comes from reducing the uncertainty over the uncertainty, you haven't solved the problem, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4309.822,
    "end": 4313.347,
    "text": "You just sort of further push it upward in the hierarchy, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4313.868,
    "end": 4322.7,
    "text": "I guess the problem is that we don't have a good story of why reducing uncertainty per se would be tied to pleasurable experience, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4324.452,
    "end": 4350.966,
    "text": " um and and what what what would what would you find like a a kind of satisfying explanation because for me it's not so much that like it it it seems like um just it is more puzzling to me to start from a rewards perspective where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4350.946,
    "end": 4358.558,
    "text": " People get rewarded by some things suddenly by having some activity and reward structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.102,
    "end": 4368.955,
    "text": "The advantage of this story is that it's not about the reward, but it's about this engagement",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4368.935,
    "end": 4379.169,
    "text": " with the environment that is positively or negatively balanced, depending on how well we are doing in this structuring or predicting it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4380.771,
    "end": 4389.643,
    "text": "I guess maybe your question is then, what is still the function of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4389.623,
    "end": 4404.072,
    "text": " the positive experience uh do we need it at all if it's um can it be just an epiphenomenon or something uh and that's a fair questions question but but but uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.727,
    "end": 4424.085,
    "text": " yeah I think that we have to look at the the consequences of the positive effective experience and and and not so much yeah at I don't know um I I does that does that make sense to you to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4425.112,
    "end": 4447.086,
    "text": " that kind of uh or what's your question about the the the phenomenology of of effect or right I mean I I would have I could respond something but I maybe then there are people that have uh questions in the chat or do you want to you know I think there's like 14 minutes left so so if you want",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4448.922,
    "end": 4476.786,
    "text": " think this points to some of the the very complex and interwoven aspects of the art viewing experience and separating out like primary sensory reductions of uncertainty then there's art pieces that leave us with questions so then okay well then that is increasing our precision on us being the kind of cultural thing that's left with a question after the shakespeare play",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4477.087,
    "end": 4494.353,
    "text": " those start getting into very stacked and socially enacted kinds of uncertainties and actions and pleasures that may be very distal from the laptop stand",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4494.333,
    "end": 4518.366,
    "text": " it could be like oh it's it's giving me a feeling like there was care in the production of the artifact or i know the person who made it so then the eye that the parent brings to the child's art piece is different than the art reviewer for an art show and so it's um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4518.65,
    "end": 4543.965,
    "text": " almost like an invitation to explore those alternative hypotheses now within a space where we can at least juxtapose them and recombine them because there's so many media specific and experiential elements that can't necessarily be separated out very cleanly",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4544.165,
    "end": 4572.805,
    "text": " because we're talking about the human reception of art not an insect's reception of two solid colors or something that might be more isolatable to elements like ambiguity or luminance or more basic properties of the stimuli and then I think the example you showed with the torn canvas",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4573.426,
    "end": 4576.27,
    "text": " how that's a trace left by a process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4577.431,
    "end": 4580.475,
    "text": "And then the stop sign too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4580.495,
    "end": 4599.56,
    "text": "I mean, in a way, modern art has kind of broken that fourth wall with the urinal and with the blank squares and all these kinds of things that complexify just the day-to-day engagement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4599.58,
    "end": 4603.045,
    "text": "And for some people, it's a bizarre thing",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4603.919,
    "end": 4631.445,
    "text": " um unnecessary complexification for other people it's kind of a re-enchantment with regular objects and it just shows how even an object that somebody did not intend to produce as art could still trigger a deeply aesthetic experience and so it's almost like more questions than answers perhaps",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4633.214,
    "end": 4662.124,
    "text": " nice yeah i mean yes one of the advantages of the story we have been presenting i think is that active inference offers is this possibility to exploit the hierarchical organization of our predictions uh of course as predictions becomes more abstract and are also more difficult to to test and to to verify",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4662.492,
    "end": 4681.377,
    "text": " and we enter into a whole lot of very difficult to pinpoint predictions which are cultural in nature, that have enough effect of our appreciation of a particular artwork, but we are not quite able to pinpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4681.417,
    "end": 4684.821,
    "text": "But the idea is that, for example, with abstract art,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.392,
    "end": 4703.621,
    "text": " a lot of the way in which they function as aesthetic stimulations is by playing with our very higher level expectations about, for example, how an artwork would look like according to a specific art world, according to a specific community of art consumers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.562,
    "end": 4710.572,
    "text": "And if Duchamp, for example, could make art by signing an urinal,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4710.974,
    "end": 4717.104,
    "text": " It is because he was playing with these very high level expectations about what art is supposed to look like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4717.625,
    "end": 4718.847,
    "text": "It's like a challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4719.248,
    "end": 4730.867,
    "text": "It could be conceptualized, among other things, as a challenge to see that specific object as an artwork in the same way in which I suggested that a particular sensory array could be seen as a cow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.428,
    "end": 4735.615,
    "text": "So if you manage to do so, to see that specific object as an artwork,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4736.287,
    "end": 4743.815,
    "text": " you get that insight, which is similar to that sort of low level insight that you got with the cow, but on a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4744.615,
    "end": 4754.846,
    "text": "And yes, so one could exploit this hierarchical story in order to account for different things among them, abstract art as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.126,
    "end": 4760.751,
    "text": "There is a very interesting piece on abstract art in the theme issue by a heart historian, Ladislav Kessner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4761.813,
    "end": 4765.356,
    "text": "So that will be another thing to look into, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.177,
    "end": 4766.277,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4770.374,
    "end": 4795.285,
    "text": " yeah one one comment from the live chat holly wrote when thinking about abstract painting the viewer might find pleasure in compositional elements like variety contrast repetition unity and balance in addition to the interpretation and gesture yeah sure i mean uh of course there are also these uh these uh things about the arrangement of of of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4796.125,
    "end": 4811.695,
    "text": " elements in the Canva, the way in which they create a balanced or unbalanced design, how we explain the intentions of the painter to position these elements in this particular way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4812.236,
    "end": 4817.205,
    "text": "Of course, if we know more about this particular poetic of that artist,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.438,
    "end": 4830.177,
    "text": " For example, it becomes vital with certain artists like Mondrian or Kandinsky to know also about their theoretical writings in order to make sense of why they are using certain colors and certain shapes in certain forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.778,
    "end": 4845.741,
    "text": "So it's also a case that with abstract art, what is sometimes called the broader context, the epitext, all the things, the information around the artwork gain more importance because there are ways in which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4846.278,
    "end": 4870.075,
    "text": " artists set expectations on us not by things that they put in the artwork themselves but by presenting them within a certain context of theories and so on so the more a lot of predictions are installed by artists in in abstract art in this epitaphs more than in in the work itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.692,
    "end": 4872.353,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4872.995,
    "end": 4879.289,
    "text": "If I can quickly add on, because this is a point I wanted to raise, is that now we're talking about aesthetic experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4880.091,
    "end": 4884.781,
    "text": "I think you can appreciate art outside of aesthetic experience, as you said, Jacopo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4884.801,
    "end": 4887.507,
    "text": "So you can appreciate, let's say, an artwork",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4887.74,
    "end": 4893.328,
    "text": " as a art historical object, and then you have this sort of intellectual pleasure with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4894.169,
    "end": 4904.764,
    "text": "And even when you look at, let's say, conceptual art, there is this, well, what will happen oftentimes is that they will use this device called a citation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4905.545,
    "end": 4913.096,
    "text": "Whereas in the piece of the artwork, there will be a citation to an earlier work, and you can appreciate the citation if you know the art history.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4914.338,
    "end": 4917.342,
    "text": "But in that case, you're kind of outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4917.592,
    "end": 4918.974,
    "text": " And that's the beauty of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4919.014,
    "end": 4921.496,
    "text": "Are you really outside of the domain of aesthetic experience?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4921.556,
    "end": 4927.543,
    "text": "Maybe you can make a claim that you're within the same sort of regime of computational processes and concrete processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4927.983,
    "end": 4928.264,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4928.604,
    "end": 4946.063,
    "text": "But let's say in the common sense of aesthetic experience, then your experience relies much less on the sort of rolling sensory processing dynamics that you would have in something like, I don't know, you were mentioning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4946.296,
    "end": 4954.305,
    "text": " abstract and Kandinsky and where you have a lot of colors, you have difficulties interpreting the figure and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4954.385,
    "end": 4961.493,
    "text": "So maybe it would be useful to talk of different aesthetic experience for different objects and different ways of appreciating those objects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4961.553,
    "end": 4969.802,
    "text": "And that might help clarifying maybe different trajectories on the epistemic arc and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4969.822,
    "end": 4975.729,
    "text": "So all the kind of problems that we discussed today, maybe that would be a good starting point with a taxonomy like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4976.738,
    "end": 4980.741,
    "text": " Yeah, I mean, I don't know whether Sander agrees, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.143,
    "end": 4985.088,
    "text": " I think we are always in the same sort of aesthetic domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.108,
    "end": 5009.698,
    "text": "There are no differences, if not in these sort of abstractions in the nature of predictions that you put into play in the different cases between appreciating something for its low-level features and the way in which they are combinable and having this very abstract, high-level knowledge of the art scene that informs your guesses",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5009.678,
    "end": 5036.901,
    "text": " and your appreciation of artworks also because these processes and these guesses inform one another so you need to have a sort of plastic view of where the boundary is or or not having boundaries at all between these two things uh because for example if you know for example the title of uh picasso bull's head the thing this is a sculpture formed by pieces of a bicycle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5037.185,
    "end": 5064.002,
    "text": " if you know the site or this is sort of a high level information about the the artwork uh we are also inclined to concentrate on certain sensory features of the objects instead of others and to make some low level inferences instead of others and if you make those inference perhaps you formulate new high level hypotheses and these two things continuously inform one another uh and that's the same process to me as long as you have these epistemic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.455,
    "end": 5093.601,
    "text": " arcs that leads you towards some sort of discovery which could be high very high level or low level i mean it's to me it's one of the advantages of the framework i don't know whether sander agrees or not yeah completely yeah i would even yeah make it more broadly i mean the even in games uh you have these epistemic arcs and and just in everyday life they they might",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5094.087,
    "end": 5117.412,
    "text": " i mean we we call them the like a minimal unit of sense making and and it is it is kind of that so it it it's not really necessarily attached to art um but it is a kind of uh pleasure that is not derived from like uh food or or uh sex or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.392,
    "end": 5122.738,
    "text": " the kind of typical rewards that people use in psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5126.783,
    "end": 5142.42,
    "text": "And that's the advantage, of course, of active inference, that it makes room for this kind of, like, I would call it a pleasure of obstacle clearing in a general sense towards what you want.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5142.704,
    "end": 5172.711,
    "text": " instead of getting what you want it's it's like we want to problem solve in order to to get where we want and i think it makes sense for revolution to reward like this this obstacle clearing and this this overcoming challenges which is of course uncertainty so of overcoming uncertainty is is the reward as such um and it makes sense i think for evolution to to to organize us as as such and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5172.691,
    "end": 5196.69,
    "text": " maybe as humans more than other animals, but you see them also, like I give the example of my dog that often picks the largest kind of unwieldy stick to play with and I see that happen and I think it's probably because it gives him the most challenge and it gives him an obstacle to overcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5197.143,
    "end": 5225.597,
    "text": " and if i don't want to play with him he has to find his own obstacles and he has to find ways to reduce uncertainty in his play uh that that that he generates himself and and that's art as well of course um so so yeah that's for me the the strength of the the approach uh enacted inference yeah if i can add a very brief remark um that that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5226.016,
    "end": 5238.593,
    "text": " To some extent, that's going back to the sort of modern origin of aesthetics, to Baumgart, who used to think of aesthetics as the science of sensuous cognition, he said, in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.475,
    "end": 5253.913,
    "text": "So, of course, the difference between everyday experience and aesthetic experience will be that aesthetic experiences or aesthetic objects present ourselves with these more idealized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5254.467,
    "end": 5259.347,
    "text": " form of uncertainty minimization that we tended to characterize with the epistemic arc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5260.002,
    "end": 5263.407,
    "text": " and I showed how things could go wrong in many ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5264.028,
    "end": 5276.488,
    "text": "Ideally, in art, when art works, we get these epistemic arts in a very purified and idealized form, and that's why these experiences are more pleasurable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.548,
    "end": 5287.545,
    "text": "But indeed, the components, the inferential component of that experience is something that we find in experience more broadly, because as all experiences,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5287.897,
    "end": 5296.605,
    "text": " finding structure in our sensorium, but not all experience is as successful in finding structure in our sensorium as aesthetic experiences are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5299.727,
    "end": 5300.068,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5300.388,
    "end": 5316.182,
    "text": "Well, in closing, if you have any last thoughts or any short ideas or visions for how the ArtStream series might continue on its own epistemic path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5318.137,
    "end": 5321.861,
    "text": " So let's do Jacobo first and Sander and Axel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5321.881,
    "end": 5323.363,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5323.803,
    "end": 5329.53,
    "text": "Yes, I just hope that this was a very non-technical overview of the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.61,
    "end": 5342.544,
    "text": "I just hope that it got people interested in active inference, interested in this work on art and aesthetics in particular, because I think that it holds lots of promises and interesting applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5343.405,
    "end": 5348.11,
    "text": "And I look forward to the rest of this art stream that is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5348.697,
    "end": 5378.215,
    "text": " first encounter inaugurates and an obvious solution for me would be to contact the authors of the theme issue that i talked about uh but there are also several people that are trying to test this thing experimentally as well in psychological or neuroscientific labs and and if you need any help in contacting them or in uh finding out people uh for for the upstream i'm here of course",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.933,
    "end": 5402.937,
    "text": " thank you sender yeah I second that I I think it would be nice to uh to try to work towards um more empirical ideas and to see what people have have done and how we can build on that um because yeah that in in the end that that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5403.743,
    "end": 5418.934,
    "text": " that's the promise of active inference if it if it doesn't allow us to get a better handle on like uncertainty and quantifying uncertainty relating it to the phenomenology during our perception then there is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5419.758,
    "end": 5426.709,
    "text": " I mean, then people might say it's just a rehearsal of some classical ideas about expectation violation in art.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5426.749,
    "end": 5436.265,
    "text": "And so it's really like the kind of and also, of course, the kind of models that we now have to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5436.245,
    "end": 5448.216,
    "text": " to use as a proxy for uncertainty and surprise and to see whether that captures something in human experience if we start to use text or music, as I said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5449.157,
    "end": 5461.868,
    "text": "So yeah, that's really the advantage of the approach and the promise that we have to show to the field in general of aesthetics and neuroesthetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5463.99,
    "end": 5464.351,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5464.531,
    "end": 5464.851,
    "text": "Axel?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5465.624,
    "end": 5468.529,
    "text": " Yeah, and I fully agree with all that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5468.97,
    "end": 5478.966,
    "text": "And maybe having some artists invited, that would be very interesting because there's a lot of applied active inference theory, if you will.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5479.467,
    "end": 5482.372,
    "text": "But most of the time it's applied to experts that are like us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5482.973,
    "end": 5486.98,
    "text": "If you have cognition and think in a normal way, active inference applies to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5487.361,
    "end": 5490.045,
    "text": "It applies also to people who are experts in certain domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5490.025,
    "end": 5494.61,
    "text": " But for the art, it would be interesting to have expert artists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5494.67,
    "end": 5497.953,
    "text": "And I think in the special issue, there's Robert Pepperell, is that right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5498.674,
    "end": 5498.994,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5499.014,
    "end": 5500.856,
    "text": "Which what he does is super interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5500.876,
    "end": 5510.725,
    "text": "And in a couple of seconds, the short story is that's one artist that I discussed in my mastery thesis that I did under supervision of Sander, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5511.066,
    "end": 5515.29,
    "text": "So it's interesting for me to this whole art stream because it goes full circle for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5515.27,
    "end": 5525.689,
    "text": " It started with the aesthetic experience of all life experience and transformative experience in predictive processing, then moved to evolution biology and psychiatry and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5526.491,
    "end": 5528.855,
    "text": "But yeah, so having invited artists, that would be cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5529.376,
    "end": 5536.769,
    "text": "And maybe pursuing those other topics that in the end all relate to aesthetic experience in biology and so on and so forth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5538.292,
    "end": 5539.354,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5539.807,
    "end": 5552.314,
    "text": " hope we can do it if someone's listened this far and they want to jump on for an art stream or suggest something that would be great so thank you fellows great to hear this and until next time",
    "speaker": "SPEAKER_02"
  }
]