[
  {
    "start": 0.349,
    "end": 3.47,
    "text": " Moving on to chapter three, the high road to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4.151,
    "end": 7.192,
    "text": "And so recall that the high road is like the why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 8.272,
    "end": 12.994,
    "text": "So Ali, please begin, just go as long as you want on through the high road to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.315,
    "end": 18.276,
    "text": "Okay, so the high road to active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.12,
    "end": 31.383,
    "text": " begin with the question about the conditions for the persistence of quote-unquote things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.623,
    "end": 38.685,
    "text": "I mean, what would we expect for a thing to behave if it persists through time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.465,
    "end": 45.647,
    "text": "And that's why sometimes FAP is referred to as the theory of every thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.227,
    "end": 57.328,
    "text": " space thing and it's not absolutely everything but think just in this sense of uh i mean persisting through time and uh the notion that allows for this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.379,
    "end": 81.146,
    "text": " thing to act as it as it persists through time is markup blanket so markup blanket is one of the most essential ingredients of the high road approach to active inference and that's why this section opens up with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.055,
    "end": 93.928,
    "text": " describing how Markup Blanket allows to describe the situation of interest through this conceptual and mathematical tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.428,
    "end": 101.717,
    "text": "But one thing that I always point out in almost all our textbook cohorts is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.425,
    "end": 121.992,
    "text": " In this section, it doesn't exactly describe markup blankets rigorously enough in terms of its carving up the state space and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.052,
    "end": 131.436,
    "text": "So one thing I think can be clarifying in following",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.697,
    "end": 151.685,
    "text": " the discussions around Markov blanket is to keep in mind that it's just a boundary in the state space so it's not a necessarily spatiotemporal boundary although in many cases it manifests itself as spatiotemporal boundaries such as the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.225,
    "end": 156.287,
    "text": " I don't know, cell membranes or organelle membranes and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.787,
    "end": 158.568,
    "text": "But it's not necessarily the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.648,
    "end": 166.412,
    "text": "So I think it can be helpful to keep that in mind everywhere we see markup blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.353,
    "end": 172.956,
    "text": "But in a very simply markup blanket,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.77,
    "end": 185.179,
    "text": " is what allows for the agent or the system to be statistically separated from its environment as is shown here in figure 3.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 186.12,
    "end": 189.964,
    "text": "So basically Markov Blanket mathematically is just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.064,
    "end": 207.849,
    "text": " the sensory and active states together, it consists of both of those states, and it statistically separates what happened externally or internally from each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.909,
    "end": 215.271,
    "text": "So, in other words, internal states cannot observe or infer anything about the external states directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 215.891,
    "end": 219.093,
    "text": " but only through the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.233,
    "end": 241.565,
    "text": "And that's why it's essential to describe the systems in this way, because obviously, in any sparse coupled systems, there isn't the possibility to observe the external states directly, but only",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.196,
    "end": 243.896,
    "text": " through those sensory and active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.597,
    "end": 267.782,
    "text": "And one other thing that I also believe can be a bit confusing in this picture is that, yes, typo in the active states and sensory states, because it's important to observe that active state only, or the flow in the active states more precisely, only depends on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 268.682,
    "end": 272.343,
    "text": " internal n-Markov states or blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.163,
    "end": 280.965,
    "text": "And on the other hand, sensory states only depend on the external n-blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.365,
    "end": 285.526,
    "text": "So mu and x in those two equations should be exchanged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.746,
    "end": 287.007,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.447,
    "end": 288.167,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.127,
    "end": 290.827,
    "text": "Let me just unpack this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.907,
    "end": 292.928,
    "text": "Anything to add before we continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.82,
    "end": 313.116,
    "text": " yes so this is what's known as the particular partition and that terminology was brought to the fore by carl friston's famous monograph in 2019 and it's a little bit of a pun it's a particular partition because this is just one way to partition agent from environment figure from ground",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.918,
    "end": 321.26,
    "text": " And we call what it partitions out, the blankets and internal states, as the particle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.94,
    "end": 329.842,
    "text": "So we can think about the most inert, least cognitive particle is like a speck of dust doing Brownian diffusion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.362,
    "end": 335.944,
    "text": "But also, there are more sophisticated kinds of cognitive particles that can include...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 336.784,
    "end": 356.341,
    "text": " world models counterfactuals what would happen if i did this all of those kinds of sophisticated cognitive operations that we can explore in active inference so note the small typo that ali mentioned internal states and also these edges reflect causal possibilities",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 357.483,
    "end": 372.023,
    "text": " amongst internal external and blanket states blanket constituting the active u and sensory y states so these are map not territory this is not a spatio-temporal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.99,
    "end": 393.677,
    "text": " articulation these are like causal maps of the world that may have to do with spatial temporal boundaries but are not simply that and sensory data or sensory states flow on to internal states internal states are involved in action selection resulting in active states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.457,
    "end": 403.203,
    "text": " which have some causal consequence in the world, the generative process, the external states, which results in different sensory states coming in again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.964,
    "end": 409.148,
    "text": "And so the Markov blanket is what makes the internal and the external states conditionally independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.908,
    "end": 414.712,
    "text": "And that can be thought of as just a no telekinesis, no telepathy clause.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.472,
    "end": 422.338,
    "text": "The only way the information comes across internal and external states, which are symmetrical with each other,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 423.118,
    "end": 427.402,
    "text": " is through the boundary or the holographic screen or the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.265,
    "end": 432.346,
    "text": "You can continue on, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.57,
    "end": 439.373,
    "text": "Okay, so the next section is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.892,
    "end": 444.793,
    "text": " about surprise minimization and self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.213,
    "end": 454.695,
    "text": "So again, this term self-evidencing is a common term in active inference literature first proposed by Jacob Howey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.195,
    "end": 464.397,
    "text": "So basically it refers to how a system or agent, or in other words, a particular state can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.457,
    "end": 472.0,
    "text": " gather the evidence for its self-persistence or self-existence through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.52,
    "end": 493.528,
    "text": "In other words, by inferring the state of the environment and comparing that inference with its internal states, or in other words, with its generative model, it's basically an interpretation of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.424,
    "end": 512.669,
    "text": " that kind of inference is on the one hand there is this dynamical interaction between the internal and external state but we can somehow interpret that physical dynamics as engaging in the active inference or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.27,
    "end": 521.755,
    "text": " as a model for the persistence of the agent through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.215,
    "end": 525.437,
    "text": "So that's basically what refers to as self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.698,
    "end": 543.989,
    "text": "And then we go through the subsection 3.3.1, which sets the stage for the recent formulation of active inference as in mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.87,
    "end": 562.904,
    "text": " which is to somehow to interpret the act of surprise minimization as minimizing the action through the Hamiltonian principle of least action, which is a variational principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.864,
    "end": 572.331,
    "text": "And by variational principle is what is meant here is just a computational or mathematical tool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.927,
    "end": 581.193,
    "text": " that allows for the computation or the specific derivations to happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 585.814,
    "end": 602.657,
    "text": " identical to scientific theories or scientific i don't know facts or observations it's just a tool a principle mathematical uh tool uh so again one of the main um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.877,
    "end": 609.099,
    "text": " misconceptions about free energy principle is that it is unfalsifiable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.299,
    "end": 620.122,
    "text": "Obviously, if we see it in this way, it doesn't make sense to say that a mathematical tool or principle is unfalsifiable because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.583,
    "end": 627.288,
    "text": " it doesn't say anything about the empirical evidence of the phenomena we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.868,
    "end": 638.196,
    "text": "So that's why here it's important to understand how the surprise minimization can be seen as this kind of variational principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.257,
    "end": 644.34,
    "text": "And then equation 3.1 draws the parallel between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.653,
    "end": 655.657,
    "text": " the surprisal as defined in section in chapter two, sorry, and this chapter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.157,
    "end": 670.427,
    "text": "So it kind of ties up all the arguments provided in the previous chapter with this one and how everything comes together in a single formulation of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.487,
    "end": 676.952,
    "text": "But they're just the two distinct approaches to arrive at same destination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.773,
    "end": 703.306,
    "text": " then we go also sorry the other important equation and again another key equation here is equation 3.2 which is a kind of ex sorry yes equation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.252,
    "end": 706.833,
    "text": " I meant to say equation 3.2, not equation 3.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.113,
    "end": 707.973,
    "text": "Sorry, my bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.874,
    "end": 718.678,
    "text": "So yes, the other section is about the relations between inference, cognition, and stochastic dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.698,
    "end": 731.783,
    "text": "I mean, all the previous discussions around how the act of inference can be seen as a kind of self-evidencing through the variational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.883,
    "end": 759.32,
    "text": " principles such as FEP comes together to reframe the previous discussions we saw in chapter two about perception as inference and action as inference and to see the concepts of variational free energy and expected free energy through the lens of variational free energy variational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.211,
    "end": 762.612,
    "text": " principle of least action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 763.252,
    "end": 783.54,
    "text": "So it unifies nicely all the material from chapters two and three into something that, I mean, not necessarily distinct from each other, but just two sides of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.949,
    "end": 787.269,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.509,
    "end": 791.011,
    "text": "Yeah, I find Table 3.1 to be very exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.971,
    "end": 799.135,
    "text": "It draws together statistical physics, Bayesian information, information theory, and cognitive interpretations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.575,
    "end": 802.477,
    "text": "So it's kind of like learn one thing, learn many things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.357,
    "end": 824.465,
    "text": " statistical physics has been talking about minimization of variational free energy for a long time and such methods are absolutely every day and professionalized in bayesian statistics active inference is using exactly just that to describe perception and action and so on so that's very um exciting box 3.2 describes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.196,
    "end": 830.137,
    "text": " free energy in statistical physics and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.857,
    "end": 833.999,
    "text": "I sometimes joke that we have a few kinds of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 834.399,
    "end": 839.661,
    "text": "We have Tesla, like electrical power should be available to everybody for no cost.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.861,
    "end": 841.281,
    "text": "We're not talking about that right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.922,
    "end": 850.045,
    "text": "There's Gibbs free energy, which is the quantity that makes chemical or thermochemical reactions irreversible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.825,
    "end": 852.647,
    "text": " like the hydrolysis of ATP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.447,
    "end": 873.423,
    "text": "And when we're talking about variational free energy, we're talking about an information geometric space with similar dynamics, similar kinetics and thermodynamics, but rather than describing the reaction coordinates of a chemical reaction, we're thinking about it in terms of Bayesian updating, and this is all called the Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.1,
    "end": 883.521,
    "text": " 3.41 continues on with variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.382,
    "end": 889.142,
    "text": "3.42 goes into expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.222,
    "end": 890.103,
    "text": "So we see this a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.883,
    "end": 893.043,
    "text": "F, variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.364,
    "end": 895.724,
    "text": "That's the real-time unfolding sensory flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.484,
    "end": 902.106,
    "text": "And then G, expected free energy and the policy planning as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.925,
    "end": 910.61,
    "text": " Section 3.5 concludes with a novel foundation, active inference, to understand behavior and cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 911.391,
    "end": 921.238,
    "text": "And it describes a few features of active inference, including its distinguishing features from a few other ways that people have looked at behavior and cybernetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 923.62,
    "end": 931.705,
    "text": "Section 3.6 goes into a bit more detail on models, policies, and trajectories having to do with agency and policy selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.409,
    "end": 939.114,
    "text": " 3.7, reconciliation of inactive, cybernetic, and predictive theories under active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 939.815,
    "end": 947.382,
    "text": "Again, the exact kind of thing that there's a whole literature on and it's always amazing to hear everybody's perspective on in the textbook groups.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.063,
    "end": 952.426,
    "text": "3.8, active inference from the emergence of life to agency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.207,
    "end": 954.929,
    "text": "And 3.9, summary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.649,
    "end": 958.592,
    "text": "You want to just give any other thoughts that you have on chapter three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.368,
    "end": 969.715,
    "text": " Again, it's one of the probably most fundamental chapters and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.306,
    "end": 998.859,
    "text": " I mean, the topics covered in this chapter is essential or absolutely essential to understand everything active inference related, but specifically the discussions in section 3.6 onward, again, I believe is really important to understand the broader context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.759,
    "end": 1014.264,
    "text": " of active inference and how it relates to all the other theories, but specifically section 3.8 provides a nice view of how we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.73,
    "end": 1029.383,
    "text": " use the same modeling to the same theoretical tools to model both non-living dynamical systems or sparse coupled dynamical stochastic systems and also to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.328,
    "end": 1056.185,
    "text": " the systems that has agency or sentience so it's a much broader theoretical framework that doesn't restrict itself to only particular kinds of systems or agents and we'll see much more elaboration on that in the later wonderful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.289,
    "end": 1062.005,
    "text": " right that concludes our overview on chapter three",
    "speaker": "SPEAKER_01"
  }
]