[
  {
    "start": 0.309,
    "end": 18.961,
    "text": " all right so now we are in chapter six a recipe for designing active inference models abraham lincoln give me six hours to chop down a tree and i will spend the first four sharpening the axe all right ali what does the quote mean and please lead us in to this discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.037,
    "end": 46.593,
    "text": " Okay, so as the opening quotation suggests, it's about honing the skill set for applying Active Inference Framework to model the actual empirical situations that we may use Active Inference for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.153,
    "end": 51.056,
    "text": "And it frames it as a four-step recipe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 53.757,
    "end": 56.318,
    "text": " actually do this kind of model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.058,
    "end": 72.501,
    "text": "Uh, although it's termed as recipe, but, uh, I believe it's more like a guideline and it's not like, uh, I don't know, cooking recipe that needs to be, uh, needs to be observed, uh, strictly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.521,
    "end": 78.483,
    "text": "Uh, so it's more like suggestions or guidelines to, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.241,
    "end": 87.686,
    "text": " to begin to apply active inference framework in any kind of situation we'd like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.327,
    "end": 94.23,
    "text": "So section 6.2 outlines those four steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 95.151,
    "end": 97.993,
    "text": "So the first step is, which system are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.178,
    "end": 127.175,
    "text": " in terms of how we can define the markup blanket that most effectively and efficiently the problem or question we want to explore through that modeling through the modeling of that situation so first step is about defining those boundaries of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.635,
    "end": 129.696,
    "text": " through Markup Blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.317,
    "end": 143.655,
    "text": "And the second step is about what's the most appropriate form for the generative model, because obviously we can have many different types of generative models depending on, again, what phenomena or what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 144.396,
    "end": 146.578,
    "text": " questions we're trying to address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 147.699,
    "end": 151.342,
    "text": "The third stage is how to set up the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.642,
    "end": 164.473,
    "text": "So after settling upon the type of the generative model we want to use, we can talk about the details of the generative model and how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 165.037,
    "end": 174.441,
    "text": " It can be efficiently modeled to be both tractable and also useful to address the situation of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 174.842,
    "end": 177.743,
    "text": "And finally, how to set up the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.063,
    "end": 188.088,
    "text": "So as we saw in chapter two, there's an important but slight distinction between generative process and generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.588,
    "end": 195.994,
    "text": " So they're not always the same, but they're closely related to each other, generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.596,
    "end": 209.406,
    "text": "The hidden states of the external world and generative model is how the agent infer about those hidden states provided by generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 212.348,
    "end": 234.28,
    "text": " considering that the environment is always very complex to be modeled precisely and exactly with every parameter accounted for, we need to have a restricted set of parameters to account for in the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 234.72,
    "end": 237.282,
    "text": "So that's what stage four",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.063,
    "end": 241.064,
    "text": " deals about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 241.124,
    "end": 262.314,
    "text": "So all of these steps, even if not observed or followed sequentially, are really, I mean, essential to setting up, I mean, or the initial setup of the situation we're trying to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.074,
    "end": 266.776,
    "text": "And I cannot imagine how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 268.058,
    "end": 285.122,
    "text": " Any scenario can progress without observing any of these steps, at least, I mean, just by thinking about how to set up the situation or scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.442,
    "end": 286.842,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.342,
    "end": 289.783,
    "text": "And in the rest of the chapter, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 292.742,
    "end": 297.183,
    "text": " Just wanted to highlight again, these steps don't have to be followed in order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.743,
    "end": 301.924,
    "text": "They really are like a summary as Mark has just written in the live chat here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.484,
    "end": 309.326,
    "text": "It really is like a summary of the earlier parts of the book in terms of things that you want to capture in your consideration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.046,
    "end": 319.829,
    "text": "And also it's a great way to connect a lot of the technical ideas that are brought up about generative model, generative process, and so on with some bigger questions like, who are we?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.149,
    "end": 321.269,
    "text": "Why are we making this model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 322.009,
    "end": 349.457,
    "text": " is the model going to be used so we take that in a lot of different ways in the textbook groups but which system are we modeling what is the most appropriate form for the generative model how should we set up the generative model and how to set up the generative process are all questions that must be addressed at least when actually coming through with carrying out a theoretical or empirical active inference modeling task",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.609,
    "end": 356.854,
    "text": " And the following sections are going to go into more detail on each of those four questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.614,
    "end": 361.137,
    "text": "So Ali, do you want to go for this 6.3 and carry on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.959,
    "end": 373.847,
    "text": "Okay, so section 6.3 is the elaboration of the first step that we just saw, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.611,
    "end": 376.593,
    "text": " I mean, what systems are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.694,
    "end": 399.432,
    "text": "And by this question, we mean how, I mean, what kind of system, I mean, how the system carves up the state space using the markup blanket or more precisely the active states and sensory states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.073,
    "end": 402.274,
    "text": "And I believe it is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.977,
    "end": 414.185,
    "text": " both one of the most fundamental and also probably one of the most challenging steps to be carried out because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.99,
    "end": 426.702,
    "text": " Well, markup blanket is just a conceptual tool we use to frame the natural phenomena or any other scenario we want to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.142,
    "end": 436.172,
    "text": "So that scenario or that model obviously doesn't care about how we set up our markup blanket or how we knit our markup blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.069,
    "end": 464.732,
    "text": " deciding on a proper set of active states and sensory states that would allow us to address the problems we need to explore or the questions we need to answer is not a trivial task and it needs lots of lots of consideration and even creativity on part of the researcher or anyone who wants to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.876,
    "end": 470.621,
    "text": " design an active inference based model for the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.141,
    "end": 484.433,
    "text": "So that's where the, I mean, the significance of doing these kinds of modeling with the insights and creativity of a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.09,
    "end": 500.431,
    "text": " researcher uh is i mean it will be obvious because it's not just something mechanical or despite the fact that uh the word recipe uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.595,
    "end": 506.779,
    "text": " can somehow make us believe that it's just a recipe to follow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 507.4,
    "end": 511.624,
    "text": "But in actuality, it's not the case at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.744,
    "end": 524.957,
    "text": "So that's the discussion of Markup Blanket and what criteria we need to keep in mind to settle upon a proper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.681,
    "end": 530.243,
    "text": " proper markup blanket around our system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.643,
    "end": 536.186,
    "text": "And the next section, what is the most appropriate form for the generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.627,
    "end": 550.415,
    "text": "So here, again, we can have various ways to set up our generative model in terms of whether it's discrete or continuous variables we want to account for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 551.641,
    "end": 554.684,
    "text": " About the time scale, is it shallow or hierarchical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.425,
    "end": 560.83,
    "text": "About the temporal depth of the inference and planning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 561.17,
    "end": 563.573,
    "text": "So these are all problems we need to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.151,
    "end": 573.195,
    "text": " be precise about or questions we need to precise about whenever we want to set up our generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.136,
    "end": 582.32,
    "text": "And then we go to section 6.5, how to set up the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.94,
    "end": 592.445,
    "text": "So after precisely describing what needs to be accounted or what parameters and the nature of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.315,
    "end": 608.987,
    "text": " generative model needs to be accounted for, then we need to address this question of how can that generative model be actually set up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.567,
    "end": 614.351,
    "text": "So setting up the variables for the generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.46,
    "end": 630.811,
    "text": " will be concerned about how those matrices as A, B, C, and D matrices can be defined as we saw in chapter four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.972,
    "end": 636.355,
    "text": " and then which parts of the generative model are fixed and what is learned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.735,
    "end": 644.979,
    "text": "So again, it's really important to know what are the dynamics of those parameters are in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.25,
    "end": 670.764,
    "text": " the learning process and what needs to be updated consistently or learned as opposed to the variables that either don't require consistent updating or they vary quite slowly as compared to the timescale of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.085,
    "end": 673.366,
    "text": "And then we go",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.319,
    "end": 679.502,
    "text": " through the process of setting up the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.263,
    "end": 702.138,
    "text": "And as I mentioned earlier, it is probably one of the most complicated steps of the recipe because of the enormous complexity of any real-time situation, and particularly the environment that the agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 704.119,
    "end": 705.42,
    "text": " or act and behave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 706.24,
    "end": 714.345,
    "text": "But even if not having, I mean, even if there is not any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 716.736,
    "end": 725.085,
    "text": " strict or, I don't know, obvious way to go through this stage of setting up the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 725.685,
    "end": 733.253,
    "text": "This section provides some helpful criteria or helpful points in order to help us",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 735.188,
    "end": 736.75,
    "text": " in that stage as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 737.51,
    "end": 756.029,
    "text": "So finally, after going through all of these stages, we need to somehow get, I mean, obviously we need results and we need to provide our results in a, we get our results from our active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 756.778,
    "end": 774.505,
    "text": " And section 6.7 addresses that very idea of how to simulate, visualize, analyze, and fit data using active inference, because it's not just enough to set up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 774.946,
    "end": 777.748,
    "text": " the model, we need to get the model to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.128,
    "end": 781.109,
    "text": "So how can we feed the data into the model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.23,
    "end": 784.611,
    "text": "How can we read the data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.872,
    "end": 793.957,
    "text": "And finally, how can we analyze the simulated data through the active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.577,
    "end": 801.501,
    "text": "So this is, in a way, a kind of preliminary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.402,
    "end": 813.249,
    "text": " recipe or preliminary procedure for doing active inference or active inference modeling, or at least suggested way to do those kinds of modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 813.77,
    "end": 830.941,
    "text": "But in the subsequent chapters, in particular chapters seven and eight, we'll go through some helpful case studies for how to actually use these procedures to model some real world situations and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.416,
    "end": 855.526,
    "text": " awesome thanks well there's a lot to say on chapter six one piece that comes up a lot is what is in the active inference kernel the cognitive kernel and what are situations that we can model with active inference there's a huge variety of cognitive phenomena and statistical outcomes that we might be interested to study like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 856.807,
    "end": 882.434,
    "text": " counterfactuals and planning like multi-scale attention and covert action like the complex ways in which memories might influence decision making in the moment based upon associations made between different sensory modalities every amazing real world situation you can imagine and it's really helpful to think about active inference as more like a framework of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.374,
    "end": 900.921,
    "text": " interoperable motifs that we can compose and indeed even be creative with rather than giving us all the answers at the core model because the kind of essential minimal active inference model doesn't necessarily include",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.701,
    "end": 929.287,
    "text": " every single attribute that you might be interested in just like any given linear regression isn't going to include every single feature that you're looking for this is happening in a different type of modeling framework but still there's a lot of customization and development that goes into adapting or elaborating an active inference type model for your given system or scenario of interest chapter six gives us some helpful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.959,
    "end": 954.534,
    "text": " guidelines and things to consider which we've unpacked and expanded on elsewhere and in the textbook group we work together to characterize different systems of interest to map different parts or different observables from that system using the active inference ontology into a unified active inference type model so chapter six starts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.174,
    "end": 970.721,
    "text": " The second half of the book, which is the more practice-oriented part of the book, and the rest of the part two is going to be a lot more about the specific kinds of generative models that you can use, discrete and continuous time, and about using them with empirical data in chapter nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.121,
    "end": 979.084,
    "text": "But chapter six just stands alone as a summary of part one of the book in some ways, and a set of four questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.564,
    "end": 980.685,
    "text": "Which system are we modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.385,
    "end": 983.667,
    "text": " What is the most appropriate form for the generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 984.047,
    "end": 991.352,
    "text": "How to set up the generative model and how to set up the generative process so that we can be active inference modelers ourselves?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.137,
    "end": 997.417,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.197,
    "end": 1003.842,
    "text": "Well, Ali, thanks so much for all of these great conversations and cohorts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.827,
    "end": 1022.729,
    "text": " We will be able to process this video to clip out these first versions of the background and context overviews and we'll distribute them to the cohort so that people can show up with their curiosities and passions and we'll see where that goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.069,
    "end": 1024.211,
    "text": "Any last thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.452,
    "end": 1027.852,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.872,
    "end": 1040.538,
    "text": "It was a pleasure to go through these chapters once again with each time, obviously with a bit more understanding than the previous one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.618,
    "end": 1044.12,
    "text": "So I'm looking forward to the next cohorts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1045.761,
    "end": 1046.081,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.261,
    "end": 1046.501,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.701,
    "end": 1047.142,
    "text": "Thanks, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.302,
    "end": 1047.562,
    "text": "Farewell.",
    "speaker": "SPEAKER_01"
  }
]