[
  {
    "start": 6.209,
    "end": 26.336,
    "text": " all right hello and welcome everyone this is active book stream number 2.0 we are going to be discussing the textbook active inference the free energy principle in mind brain and behavior 2022 textbook by thomas parr giovanni pizzullo and carl friston",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.768,
    "end": 40.832,
    "text": " In this live stream with Ali and I, we're going to be giving some overviews and some kind of points that you'll want to have in mind, a little bit of background and context, specifically on chapters 1, 2, 3, and 6.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.113,
    "end": 48.594,
    "text": " We're going to do more live streams in the future that will cover the other chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.634,
    "end": 50.195,
    "text": "There's 10 chapters overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.055,
    "end": 64.82,
    "text": "And the goal of this live stream is to use the live stream format to produce materials that we can then clip out so that the textbook groups, which we have multiple ongoing cohorts,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.64,
    "end": 92.417,
    "text": " at the institute so that those textbook groups can be really engaging and discussion oriented because after several cohorts of going through this ali and i and others have started to kind of hone our understanding of the textbook and so we are starting to feel ready to put down some background and context dot zero videos and then ideally people who are participating in the textbook group cohorts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.797,
    "end": 116.757,
    "text": " we'll be able to view and think about those videos leading up to a discussion so that when we do have the discussions in the textbook group that those can be maximally interactive and engaging so before we jump into chapter one Ali do you want to just add anything about uh the textbook or anything else hello I'm Ali I'm very happy and excited to be here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.855,
    "end": 122.677,
    "text": " to discuss the book that we've fallen in love for the last year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.857,
    "end": 132.4,
    "text": "And despite the fact that we've been studying and discussing this book for more than a year, there's still a lot to learn and unpack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 132.44,
    "end": 133.58,
    "text": "So yeah, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 135.761,
    "end": 136.021,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.441,
    "end": 143.503,
    "text": "So then we will begin in just a few seconds, the chapter one and overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 146.86,
    "end": 170.457,
    "text": " all right this section is going to be the chapter one and overview of the active inference textbook so shown here are the table of contents there are 10 chapters and three appendices in this book and they're separated into part one with chapters one through five and part two chapter six through ten Ali do you want to give any overview thoughts on the organization or structure of the book",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.757,
    "end": 180.041,
    "text": " Okay, so can you hear me now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.221,
    "end": 180.441,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 180.501,
    "end": 180.722,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.542,
    "end": 201.841,
    "text": "Okay, so part one is basically more aligned in terms of the theoretical construction of the active inference, and it provides some conceptual and theoretical tools to be utilized in the second part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.798,
    "end": 217.383,
    "text": " Because for the second part, we mostly deal with the practical side of active inference, how to actually implement active inference to model some of the systems of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 218.264,
    "end": 224.226,
    "text": "So that's basically the main justification behind dividing up these chapters into two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 225.987,
    "end": 248.669,
    "text": " great all right we're going to pass over the short preface written by Carl Friston but it's worth a read it's only several pages long so let's go to chapter one overview so do you have any opening thoughts on chapter one or where does one even begin with such a book sure uh yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.341,
    "end": 263.753,
    "text": " For chapter one, I think probably the most central theme of chapter one is about the two different approaches to active inference, namely the high road and the low road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.854,
    "end": 274.843,
    "text": "And I think it provides a really nice perspective to view a kind of a whole picture and how the different components of active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.487,
    "end": 276.148,
    "text": " fit together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.068,
    "end": 301.805,
    "text": "So, but also, I highly recommend chapter 13 from this book, Andy Clark, and it's and Andy Clark and his critics, written by chapter 13, I think is entitled beyond the desert landscape written by Carl Friston, in which he provides more elaborate and a bit philosophical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.669,
    "end": 313.944,
    "text": " reasoning behind what exactly are low road and high road and what are the aims of each approach and the distinction between those two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 314.324,
    "end": 318.75,
    "text": "So for chapter one, we begin",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 319.748,
    "end": 332.22,
    "text": " obviously with an introductory paragraph, which sets the stage for all the components that would be discussed in this chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.94,
    "end": 343.81,
    "text": "But a very important section, I believe, is section two here, which is how do living organisms persist and act adaptively, which is basically the main...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.531,
    "end": 347.712,
    "text": " question active inference is trying to address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.793,
    "end": 369.86,
    "text": "So if we want to describe active inference in, I mean, minimalistically with only one sentence or two, probably we can say something to the effect that it's a theory that addressed this very question here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.74,
    "end": 376.922,
    "text": " So that's why they've opened up this chapter with the important question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.522,
    "end": 393.247,
    "text": "And then section three, which is again a continuation of section one, but a bit more specifically about active inference and how active inference is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.542,
    "end": 423.277,
    "text": " addressing the question provided in the section two so basically again active inference is a modeling framework for modeling the behaviors from first principles and what is meant by first principles will be elaborated upon in the following chapters the following sections and also obviously in the following chapters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 424.655,
    "end": 449.441,
    "text": " But very briefly, it's a kind of modeling framework that tries to somehow use variational principles such as free energy principle to construct modeling and mathematical tools that will enable us to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.121,
    "end": 468.01,
    "text": " to describe the dynamical systems of living and even non-living agents in terms of those variational principles and how those agents or those systems are coupled with their environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.19,
    "end": 479.755,
    "text": "So that's basically the unificatory principle that is at the heart of this active inference approach because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.896,
    "end": 482.057,
    "text": " Yes, exactly here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.257,
    "end": 494.464,
    "text": "It's a kind of description of this action perception loop that is at the heart of active inference or FEP framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.905,
    "end": 503.39,
    "text": "And then we go to section 1.4, which is, again, a description of the structure of the book and why",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.614,
    "end": 511.576,
    "text": " Those two parts are divided as such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 512.777,
    "end": 521.064,
    "text": "So as I said earlier, first part is more concerned with the theoretical underpinnings of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.144,
    "end": 527.61,
    "text": "And the second part is more about the practical side of it, as we see in the subsection headings here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 528.931,
    "end": 532.274,
    "text": "So that's, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 532.834,
    "end": 537.218,
    "text": "And then a very important diagram",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.864,
    "end": 559.685,
    "text": " which will provide very helpful as we whole book is provided in figure 1.2, which kind of ties all the different strands of various related theories, such as predictive coding, predictive processing, Bayesian brain hypothesis, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.565,
    "end": 574.348,
    "text": " into a kind of unified and integrated framework by using those two trajectories of constructing active inference, namely the high road and the low road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.148,
    "end": 582.809,
    "text": "So it literally here is represented as the high road and the low road in this diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.489,
    "end": 586.09,
    "text": "So very briefly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.055,
    "end": 592.457,
    "text": " High Road is a kind of top-down approach to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.037,
    "end": 604.403,
    "text": "It begins with the question, how things should act if they exist, in other words, if they persist through time, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.743,
    "end": 613.747,
    "text": "In other words, it kind of sets the stage for developing the concept of markup blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.145,
    "end": 637.164,
    "text": " and then obviously with by setting that also surprise minimization it attempts to elaborate that road by adding other aspects of modeling other aspects of theory such as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 639.808,
    "end": 653.576,
    "text": " predictive processing, self-evidencing, autopoiesis, and so on, and then reach an integrated version of active inference, which is basically an integration between perception and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.636,
    "end": 665.382,
    "text": "So I believe the main thing that sets active inference apart from all the other related theories, such as predictive processing and predictive coding,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.612,
    "end": 671.976,
    "text": " is the very deep integration of action and perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 672.036,
    "end": 681.523,
    "text": "So action is not just some afterthought or some additional component that needs to be accounted for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 682.124,
    "end": 687.047,
    "text": "It is deeply woven into the fabric of the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.587,
    "end": 692.271,
    "text": "So as we'll see, especially in chapters two and three,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.803,
    "end": 703.166,
    "text": " Even the mathematical formalism for perception and action are interestingly similar to each other and even symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 703.946,
    "end": 716.991,
    "text": "And it shows that perception and action are actually not separate and distinct, totally distinct entities and concepts and active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 718.24,
    "end": 726.305,
    "text": " definitely provides a very promising framework to integrate them into a holistic framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 727.325,
    "end": 744.235,
    "text": "And another approach to construct that same theory is to begin with the probabilistic description of Bayes' theory and try to build up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.376,
    "end": 755.891,
    "text": " the formalism of active inference using Bayes' Inference Theorem, Bayes' Theorem and Bayesian Statistical Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 755.911,
    "end": 761.018,
    "text": "So again, we here see some very...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 763.041,
    "end": 770.324,
    "text": " I mean, apparently different and distinct strands, such as predictive coding, Bayesian brain hypothesis, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 770.805,
    "end": 780.809,
    "text": "But as we see, all of those different strands can be united and tied together within this low-road approach to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.65,
    "end": 787.712,
    "text": "So I guess that's... I'll just give one short thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.752,
    "end": 787.973,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.013,
    "end": 788.453,
    "text": "These are great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.045,
    "end": 820.016,
    "text": " just one short thought thank you ollie for these great summaries the low road and the high road are going to be explored in a lot more detail in the coming chapters two and three we can think of the high road as being a y because it describes how persistent or remeasurable systems exist now they might be using bayes theorem or they might be using any other kind of mechanism internally but the high road is describing the y of existence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.223,
    "end": 825.171,
    "text": " From the low road, the bottom-up approach is kind of like a how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.752,
    "end": 830.201,
    "text": "You could use Bayes' theorem to describe persistent autopoetic entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.158,
    "end": 833.659,
    "text": " Or you could use Bayes' theorem for other purposes too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.999,
    "end": 836.981,
    "text": "So where these two roads intersect is active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.421,
    "end": 849.806,
    "text": "And we have a lot more discussion coming and of course unpacked in the textbook groups about how these really map on to bottom-up and top-down causation and the plurality of whys that we approach in different settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.647,
    "end": 851.467,
    "text": "Good to continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.014,
    "end": 871.811,
    "text": " yes sure some of the coming sections uh of this chapter continuing from page eight are going to describe what are happening in the next chapters so chapter two is going to set out the low road perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.642,
    "end": 875.464,
    "text": " Chapter three is going to describe the high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.525,
    "end": 880.368,
    "text": "Chapter four, we will unpack active inference more formally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.668,
    "end": 882.49,
    "text": "That's one of the math heavy chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.471,
    "end": 892.518,
    "text": "Chapter five, we'll move from formal treatments to biological implications of active inference with a special focus on mammalian neurophysiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.605,
    "end": 920.663,
    "text": " chapter five sets out the process theory associated with active inference and gives a lot of hands-on and empirical examples and that's a lot of the first part of the book they're then going to summarize some of the key points and distillations from that theory heavy first section one of them is that as ali mentioned perception and action are complementary processes and ways that fulfill the same imperative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.243,
    "end": 922.403,
    "text": " free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.984,
    "end": 931.506,
    "text": "We sometimes summarize that by saying that in the pursuit of the minimization of free energy, agents can either change their mind or change the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 931.986,
    "end": 937.968,
    "text": "Change your mind is associated with perception and learning, and those are distinguished later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.968,
    "end": 941.249,
    "text": "And changing the world is associated with action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.45,
    "end": 947.851,
    "text": "There's some discussion about action selection and optimal policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 949.261,
    "end": 956.527,
    "text": " And all cognitive operations in active inference are conceptualized as inference over generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.168,
    "end": 963.373,
    "text": "So the true kernel, the cognitive kernel of active inference is going to be the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.014,
    "end": 968.657,
    "text": "Want to pick up from here or give any thoughts on generative models and then carry on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.718,
    "end": 969.078,
    "text": "Thanks, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.28,
    "end": 987.446,
    "text": " Just one point is there is a common misconception about generative models, which is that generative models only refers to the inner states of the system and also its markup blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.046,
    "end": 997.109,
    "text": "But actually generative model kind of encompass all the states of interest of the situation we're trying to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 997.189,
    "end": 998.65,
    "text": "So it also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.57,
    "end": 1027.645,
    "text": " encodes the probabilistic information about the external states as well so generative model can be thought of as kind of the whole state of the system and by system here I mean the coupled dynamics between the internal and external states so that might be helpful to keep in mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1029.909,
    "end": 1030.169,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.59,
    "end": 1041.018,
    "text": "One other distinction that comes up and is used a lot nowadays, although it's not always used in prior literature, is the distinction between the generative model and the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.699,
    "end": 1043.881,
    "text": "We're going to come back to it, but usually...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.319,
    "end": 1060.834,
    "text": " The generative model is being used to describe our statistical model of the agent of interest, and the generative process is the process that generates observations that are then passed to the generative model as observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.394,
    "end": 1069.001,
    "text": "However, because generative models can be generative processes for each other, these two are not necessarily distinct in principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1069.702,
    "end": 1076.906,
    "text": " So in different simulations and in different specific cases, generative models can also be generative processes for each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.367,
    "end": 1083.57,
    "text": "That leads us towards talking about ecosystems of shared intelligence and interactions amongst generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.05,
    "end": 1089.874,
    "text": "But when we're talking about generative model, it's like the organism or the system of interest that we're focused on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.151,
    "end": 1121.893,
    "text": " there are some more uh themes that arise from the first half of the book now we're on page 11. action is quintessentially goal directed and purpose of we talk a lot about how preference plays a role in shaping action selection in active inference and the goal directed nature of active inference will be unpacked in chapters two and three they discuss how various constructs of active inference have plausible biological analogs in the brain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.504,
    "end": 1135.026,
    "text": " Once one has defined a specific generative model for a problem at hand, one can move from active inference as a normative theory to active inference as a process theory, which makes specific empirical predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.747,
    "end": 1143.088,
    "text": "And there's many, many interesting philosophy of science type discussions that we have about explain, predict, design, control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.968,
    "end": 1151.53,
    "text": "And then we get to section 1.4.2, giving overview on part two, active inference in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.526,
    "end": 1154.047,
    "text": " So I'll just continue on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.787,
    "end": 1159.528,
    "text": "Chapter six is going to introduce a recipe for building active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.209,
    "end": 1163.61,
    "text": "So this is where the step-by-step comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.45,
    "end": 1169.752,
    "text": "It's gonna give a sequence of steps and approaches that you can take to go from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.712,
    "end": 1195.765,
    "text": " understanding the structural aspects of a system or phenomena of interest and build your way towards having an active inference model that can then be implemented in code and we have various examples and we're there in the textbook group to work with everyone who wants to take this journey but chapter six is going to describe that process of building the active inference generative model so that's a recipe chapter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.425,
    "end": 1224.325,
    "text": " there's a lot more that goes into the restaurant also as we kind of have fun exploring chapter 7 and 8 are like a pair and they describe two different broad families of generative models now these two families of generative models they work well they play well with each other but they are very educationally relevant to also consider separately chapter 7 is going to focus on the discrete time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.126,
    "end": 1251.299,
    "text": " generative model and chapter eight is going to focus on the continuous time generative models and again these discrete and continuous time models can be nested and interoperable however they do describe some very important different situations and so chapter seven and eight have a lot of technical information on the discrete and continuous time formulations of active inference and also about how they integrate together",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.318,
    "end": 1279.152,
    "text": " chapter nine is illustrations of how active inference models can be used to analyze data from behavioral experiments and so this kind of goes beyond chapter six's recipe and it talks about some of the process of making a behavioral experiment and then using the outcomes of that behavioral experiment the data from that experiment and using that to parameterize and do statistics with the active inference generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.072,
    "end": 1309.147,
    "text": " chapter 10 brings it all together chapter 10 is a lot like chapter one and we've even joked of reading the book backwards that's how great chapter 10 is so for those who are reading chapter one consider reading chapter 10 next and then picking back up with chapter two because chapter 10 is going to give some judgments and also sketch some exciting future directions for where active inference is in relationship to other fields and where it's going",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.14,
    "end": 1312.041,
    "text": " So I also second that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.821,
    "end": 1314.742,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.862,
    "end": 1320.663,
    "text": "The second part of the book illustrates a broad variety of models of biological and cognitive phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.024,
    "end": 1323.765,
    "text": "So it's an application oriented second half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.665,
    "end": 1327.966,
    "text": "And we have a lot of accessory code and approaches and notebooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1328.026,
    "end": 1331.647,
    "text": "So one may not find that this is the one stop shop that they were looking for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.107,
    "end": 1337.229,
    "text": "However, for those who dive in, there's absolutely more than enough to scaffold their learning journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.707,
    "end": 1341.709,
    "text": " And then section 1.5 is the summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.41,
    "end": 1353.078,
    "text": "The chapter introduces the active inference approach to explain biological problems from a normative perspective and preview some implications of this perspective that will be unpacked in later chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.998,
    "end": 1360.563,
    "text": "It describes the structural outline of the book, chapters one through five being theory, chapter six through 10 being practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.544,
    "end": 1366.968,
    "text": "And then it signals that the next two chapters are going to develop the low and the high road perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.929,
    "end": 1368.81,
    "text": "And all together,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.407,
    "end": 1371.588,
    "text": " That is chapter one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.888,
    "end": 1373.189,
    "text": "Any other thoughts on chapter one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.233,
    "end": 1392.627,
    "text": "Not as specifically, but I think it provides a really good context to the rest of the book in terms of how all the different elements of active inference comes into play in addressing different problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1393.107,
    "end": 1393.347,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.793,
    "end": 1425.366,
    "text": " on to chapter two the low road to active inference so all chapters begin with a short quotation and the quotation here reads my thinking is first and last and always for the sake of my doing William James so even before reading the chapter these quotations are often great places to jump off and have a discussion so Ali please begin and go as long as you want on the low road to active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.126,
    "end": 1444.396,
    "text": " Okay, so I guess chapter two, as the title suggests, it's the construction of active inference theory from the viewpoint of the low road of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.958,
    "end": 1450.964,
    "text": " So it begins by providing this notion of perception as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1451.044,
    "end": 1457.971,
    "text": "Because more often than not, we usually think of perception as something just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.411,
    "end": 1468.537,
    "text": " in a computational sense, is a processing of the inputs, or rather, it's a raw processing of the inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.937,
    "end": 1478.923,
    "text": "But here it shows that it can also be described as, or even more accurately described, as a kind of inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.303,
    "end": 1487.548,
    "text": "So it's not just a simple and raw processing of the inputs, as my computational model...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.558,
    "end": 1491.64,
    "text": " or a computer analogy might suggest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.261,
    "end": 1503.791,
    "text": "It's more like something that we predict and then we compare our inputs or the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.446,
    "end": 1515.168,
    "text": " inputs we get from the stimuli with our prediction and then try to somehow minimize that prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1515.509,
    "end": 1525.931,
    "text": "So I believe that this notion of perception as inference is the most central notion of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.611,
    "end": 1532.676,
    "text": " all the related theories of predictive coding, predictive processing, Bayesian brain hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1533.256,
    "end": 1541.242,
    "text": "So up to now, active inference is not very different from all the other theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.463,
    "end": 1546.987,
    "text": "It's basically a subset or a variant of those theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.707,
    "end": 1552.411,
    "text": "But then it progresses into distinguishing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.522,
    "end": 1557.24,
    "text": " distinguishing the active inference from all the other theories and how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1558.282,
    "end": 1563.006,
    "text": " it stands apart from the other ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.026,
    "end": 1584.282,
    "text": "So in section 2.1, we began with some of the basics of probability theory, namely the Bayes theorem in box 2.1, and some simple examples about how Bayes theorem can be applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.708,
    "end": 1590.017,
    "text": " And again, a very important",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.749,
    "end": 1610.265,
    "text": " page or important part of this section will be page 20, which describes the concept of surprisal and specifically the statistical surprisal and how it differs from the phenomenological surprise or psychological surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1612.888,
    "end": 1617.231,
    "text": "And how we can formulate the statistical surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.311,
    "end": 1617.452,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.132,
    "end": 1641.162,
    "text": " yes just just to catch up here this example that's going to come back again and again is a person who's guessing the object that's in their hand and it could be a frog or an apple and the object is going to jump or not and so that's used as a way to talk about the bayesian updating that forms the kernel of a variety of bayesian brain like models including active inference and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.542,
    "end": 1660.072,
    "text": " and then um there are the presentation of the exact base so in simple cases you can compute exactly what you want with bayes theorem however it's a lot more effective on large data sets to use certain approximations and heuristics that we're going to be discussing and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.093,
    "end": 1668.742,
    "text": " Ali has highlighted that there are two concepts that are very closely related to each other regarding surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.283,
    "end": 1673.809,
    "text": "There's surprise by itself and then there's Bayesian surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.109,
    "end": 1678.555,
    "text": "So please pick up there what are surprise and Bayesian surprise and why do they matter here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.274,
    "end": 1683.454,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.514,
    "end": 1697.456,
    "text": "So, well, surprise, I mean, the regular surprise, as we're all familiar with, is something more related to our sense of surprise or psychological sense of surprise of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.198,
    "end": 1703.6,
    "text": " observing some unexpected phenomena or unexpected behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1704.1,
    "end": 1726.569,
    "text": "But Bayesian surprise or statistical surprise is, of course, closely related with the psychological sense of surprise, but a bit more rigorous in which it's a way to compare two probabilistic information using callback-Leibler divergence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.814,
    "end": 1740.892,
    "text": " and somehow getting the, I mean, how unexpected that information emerging from callback divergence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1742.32,
    "end": 1744.701,
    "text": " And they call it the surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1744.781,
    "end": 1754.545,
    "text": "So surprisal is, in other words, is a way to formulating those unexpected probabilistic information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.225,
    "end": 1764.729,
    "text": "And it doesn't necessarily align or maps onto perfectly our psychological sense of surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.809,
    "end": 1767.55,
    "text": "But as I said, it's closely related with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1768.618,
    "end": 1768.878,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.498,
    "end": 1774.08,
    "text": "By surprise, I mean for almost... Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.661,
    "end": 1775.781,
    "text": "No, you take it, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.921,
    "end": 1793.869,
    "text": "I was just going to say that by surprise, almost in the rest, all the other sections and chapters of the book, we basically mean this Bayesian surprise sense of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.449,
    "end": 1796.53,
    "text": "And in order to distinguish that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.397,
    "end": 1806.045,
    "text": " With the regular sense of surprise, sometimes in the literature, surprisal is used to refer to Bayesian surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1807.401,
    "end": 1831.331,
    "text": " yes so they're both measured in information theoretic units this is all happening in information geometric spaces the first concept of surprise is applied to a given single observations how surprising is that one observation and so in that sense it's a lot like the z-score of a data point coming in with respect to a statistical distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.071,
    "end": 1840.054,
    "text": " So it's like you have a height distribution in a classroom and you measure one person, and then you can say, what is the z-score of that measurement?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.395,
    "end": 1847.758,
    "text": "Was it right at the center of the distribution with a z-score of zero, or were they two standard deviations higher with a z-score of two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1847.898,
    "end": 1848.818,
    "text": "So it's kind of like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.358,
    "end": 1859.883,
    "text": "And that's why there's a discussion of probability distributions and their support, which is the x values for which they're defined, and surprise function with the fancy i.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.683,
    "end": 1868.745,
    "text": " And that's going to be a function that helps you compute how surprising each observation is given a parameterization of that distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.565,
    "end": 1874.267,
    "text": "Whereas this Bayesian surprise is more related to learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.887,
    "end": 1884.009,
    "text": "It has to do with how much updating happens between the prior and the posterior, and that's before and after the observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.61,
    "end": 1888.671,
    "text": "So one could imagine a surprising observation, surprise concept one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.511,
    "end": 1904.393,
    "text": " that either does or doesn't update the prior into a very different posterior so as ali mentioned they are not exactly the same but it's going to be important to understand how they're different and that's worked out again in the case of the apple jumping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1905.646,
    "end": 1934.739,
    "text": " box 2.2 continues with a discussion of expectations now expectation in everyday parlance might be specifically referring to something in the future like i expect it to rain tomorrow and in statistics when we talk about the expectation we're talking about the weighted average or the center of gravity of a distribution and that can be in both a discrete distribution at which point you have a weighted sum",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.559,
    "end": 1956.438,
    "text": " or a continuous distribution in which case it's an integral so you can have an expectation for the humidity tomorrow and so that might refer to the center of gravity at a t equals plus one but just taken alone expectation means center of gravity of a statistical distribution not anticipation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1958.191,
    "end": 1968.349,
    "text": " Section 2.3 is going to describe how some of this, how this low road that we're on is going to connect to biological inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.567,
    "end": 1991.774,
    "text": " There's more discussion of the generative model and the generative process, and a little bit of a hint that the generative model captures aspects of the generative process, which is where we see a lot of the classical cybernetic theorems and concepts like requisite diversity, good regulator theorem, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1992.194,
    "end": 1998.336,
    "text": "However, the generative model does not have to be exactly isomorphic with the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.956,
    "end": 2014.622,
    "text": " For example, the generative process, the temperature in the room might be a continuous variable, but then the generative model might be discrete, only modeling integer-based temperatures, or might be categorical, like too hot, just right, and too cold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2015.202,
    "end": 2023.345,
    "text": "So there's a lot of articulations that can be done because of how flexible and interoperable generative models are with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.738,
    "end": 2033.782,
    "text": " Figure 2.2 is going to expand upon that chapter one representation of the cybernetic action perception loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2034.322,
    "end": 2040.684,
    "text": "And we're going to see this more in terms of a generative model and generative process articulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.385,
    "end": 2048.728,
    "text": "And there are incoming, speaking from the perspective of the generative model, the agent, there are incoming and outgoing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.648,
    "end": 2065.138,
    "text": " dependencies in this graph and this is a little bit like a schema more so than a formal graph but also it is like a bayesian graph where nodes are variables and edges are causal relationships and so we have the internal states of the model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.547,
    "end": 2075.272,
    "text": " the external states of the generative process, and then the blanket states that make internal and external states conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.412,
    "end": 2082.076,
    "text": "And again, speaking from the perspective of the agent, although there is a symmetry, we can talk about the incoming",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.916,
    "end": 2111.153,
    "text": " sensory signals happening from the observations handed from the process passed on to the internal states of the generative model and then the outgoing actions that are selected that then can influence the hidden state of the world for example going and turning on the heater to increase the temperature in the room and so this action perception loop or particular partition is going to get explored in a lot more detail in the coming sections",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.51,
    "end": 2142.559,
    "text": " previous section 2.3 was on perception as inference and now action as inference is going to be discussed and that is where they say the discussion to this point is common to all Bayesian brain theories we now introduce the simple but fundamental Advance offered by active inference which is the extension of this inferential perspective to consideration of action as inference perception and action cooperate to realize a single objective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.702,
    "end": 2173.682,
    "text": " section 2.5 is about minimizing the discrepancy between the model and the world we already described that there's two ways for this to happen change your mind and change the world that's how the discrepancy can be reduced or managed we see a variant of the action perception loop where the agent is making perceptions predictive models of the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.597,
    "end": 2184.527,
    "text": " that through perception are being juxtaposed with observations handed from the generative process, the world, and a discrepancy is realized, some non-zero discrepancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.448,
    "end": 2193.637,
    "text": "And then here are those two paths to minimize free energy, change beliefs by perception and learning, or change the world through action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.539,
    "end": 2207.322,
    "text": " Section 2.6 is going to discuss how the exact Bayesian approach described earlier is absolutely spot on if you have infinite computing resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2207.782,
    "end": 2222.926,
    "text": "However, we're often interested in rapid or large data sets where we want to be able to get approximate Bayesian computation or probably approximately correct computation in a vastly accelerated fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.786,
    "end": 2242.242,
    "text": " so that is going to be approached using what's called variational bayesian inference that's unpacked in chapter four but it suffices to say that variational bayesian inference implies substituting two intractable quantities the posterior probability and log model evidence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.183,
    "end": 2246.826,
    "text": " with two quantities that approximate them but can be computed efficiently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.486,
    "end": 2250.628,
    "text": "The approximate posterior Q and a variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.269,
    "end": 2258.654,
    "text": "So it transforms an intractable estimation problem into a highly tractable optimization problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.134,
    "end": 2260.075,
    "text": "Pick up from there, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.057,
    "end": 2267.32,
    "text": "Yes, sorry, I just wanted to point out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2268.16,
    "end": 2294.058,
    "text": " out a couple of things especially about section 2.3 because I believe it is one of the crucial sections of this chapter and in fact the whole book because it provides some of the justifications of using Bayesian inference as opposed to some other mathematical techniques such as maximum likelihood estimation but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.086,
    "end": 2302.886,
    "text": " More important than that, I think it's this concept of optimality, which comes into play in almost",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2303.745,
    "end": 2307.827,
    "text": " everywhere in the literature and, of course, in this book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2308.647,
    "end": 2318.471,
    "text": "So there are actually two notions of optimality, which is not discussed in detail here, namely Bayesian optimality and Jayne's optimality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.011,
    "end": 2330.636,
    "text": "But in some of the recent papers on Bayesian mechanics, Dalton, Sack, DiValle, Maxwell, Ramstein, and others have shown that those two concepts of optimality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.089,
    "end": 2332.77,
    "text": " are actually congruent with each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2333.23,
    "end": 2344.776,
    "text": "So that's one of the reasons that the duality between FEP, free energy principle, and constrained maximum entropy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.556,
    "end": 2356.761,
    "text": " I mean, it's one of the justifications for providing that dual formalism between those two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2358.182,
    "end": 2366.167,
    "text": "But another point I wanted to mention here is because I've seen that using the word hidden state,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.848,
    "end": 2379.273,
    "text": " can be a bit confusing for some people because when we observe something as an observation, obviously it is not quote-unquote hidden, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.693,
    "end": 2385.816,
    "text": "So what a hidden state here refers to is actually the hidden cause of that observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2385.876,
    "end": 2392.199,
    "text": "So it's not that the observation itself is hidden from the observational or it's unobserved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.699,
    "end": 2395.661,
    "text": "So that might be a bit confusing if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2396.821,
    "end": 2404.927,
    "text": " if we don't take into consideration the exact meaning of the hidden state or latent state here and in the rest of the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.048,
    "end": 2423.14,
    "text": "So continuing from section 2.6, here we see one of the two central equations of active inference, which is equation 2.5 for variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.715,
    "end": 2448.977,
    "text": " So it's, as I said, I mean, understanding this equation and how each line of its formulation represents in terms of the, I mean, trade-off between energy entropy or complexity and accuracy or divergence and evidence is key to understanding almost everything in the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.43,
    "end": 2454.157,
    "text": " rest of the book and in many other literature on active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2455.058,
    "end": 2459.506,
    "text": "So this is the perceptual part of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.526,
    "end": 2461.389,
    "text": "So variation-free energy is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.194,
    "end": 2476.617,
    "text": " a parameter that is a notion that parameterizes the surprisal of our perceptual information we have about the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.038,
    "end": 2491.181,
    "text": "And then we'll see in the next section the related and almost symmetrical formulation to variational free energy, namely expected free energy,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2491.981,
    "end": 2496.205,
    "text": " which is basically the action part of the active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.526,
    "end": 2509.158,
    "text": "So we can see how those two can somehow be seen as a kind of unified formalism but described in alternate expressions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.902,
    "end": 2528.293,
    "text": " But another thing about equation 2.5 is it may be a bit, I don't know, daunting to see all the relations between those three lines of equation and how we can get from one to the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.313,
    "end": 2539.621,
    "text": "So there are some supplementary materials that we have developed in the past weeks, which I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.322,
    "end": 2548.211,
    "text": " can help in clarifying how the derivations of these three lines of equation be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.271,
    "end": 2559.524,
    "text": "So I hope they would be clarifying, I mean, and help to understand how those three lines relate to each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.529,
    "end": 2576.736,
    "text": " But the key point here is to understand that variation of free energy is not something absolute, but it's just an upper bound for the minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2577.177,
    "end": 2589.343,
    "text": "So as Daniel just mentioned, it's untractable to have an absolute amount for the surprisal to be minimized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.763,
    "end": 2590.984,
    "text": "So we need to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.451,
    "end": 2596.035,
    "text": " an upper bound in order to make that more tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2596.796,
    "end": 2613.031,
    "text": "Because by Jane's inequality, as we saw in chapter four, I think, we can see that how the upper bound of a surprisal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.191,
    "end": 2624.696,
    "text": " necessarily provides a condition for minimizing the precise or the exact free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.196,
    "end": 2639.763,
    "text": "And that's the key insight of equation 2.5, or the notion of variation of free energy, which is to provide this upper bound instead of the exact amount of surprisal to be minimized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2641.035,
    "end": 2656.521,
    "text": " yeah what i'll what i'll add there is if you knew exactly how well you should be surprised by a given data point y then you would have had the optimal model however that is not tractable and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2657.341,
    "end": 2677.693,
    "text": " by making a quantity that's always higher or an upper bound, the variational free energy F, which is a function of broadly Q, our beliefs, our variational beliefs, which are built in a way that makes them very compositional, very optimizable, very interpretable, and data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.693,
    "end": 2704.678,
    "text": " and we can reduce the divergence here the kl divergence with a double line between q our beliefs and p the kind of actuality of it and if we can reduce this divergence in other words minimize the free energy then we will come closer and closer to the true surprise function and do that in a tractable incrementally optimizable way so equation 2.5",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.138,
    "end": 2727.721,
    "text": " is going to be the variational free energy different ways that it can be represented as it takes in data and beliefs about the world q and then this is going to be expanded into the future to include action with g the expected free energy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2728.584,
    "end": 2730.825,
    "text": " Now, there's a lot more that we can say about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.865,
    "end": 2732.586,
    "text": "There's a lot of technicalities to go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.146,
    "end": 2746.353,
    "text": "But broadly, notice that G, the expected free energy, is a functional of policy, pi, because it's only being evaluated to select amongst different action outcomes, pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.413,
    "end": 2774.305,
    "text": " and another important difference is that it's going to be describing sensory outcomes that haven't yet happened a sort of what would i perceive if i did a or what if i did b and it's that kind of comparison that allows the expected free energy functional here to be used in action selection or policy selection as inference planning as inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.185,
    "end": 2779.527,
    "text": " That section is expanded upon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.527,
    "end": 2795.837,
    "text": "And in figure 2.6, we see a very nice representation of the expected free energy equation, and then how when certain aspects of this equation or situation are zeroed out, we get certain other familiar cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.477,
    "end": 2797.037,
    "text": "For example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.978,
    "end": 2822.031,
    "text": " where there's no epistemic value there's no information to learn then you get ruthless expected utility theory and conversely where there is no pragmatic value to extract so all outcomes are equally valid or preferable then you get things like infomax principle and optimal bayesian design",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.771,
    "end": 2825.552,
    "text": " And then everything in between is the space that we're interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.792,
    "end": 2841.08,
    "text": "And so this figure 2.6 shows that the expected free energy functional can be seen as like a generalization of a lot of other settings related to perception and action and planning amidst uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.375,
    "end": 2863.504,
    "text": " and section 2.9 closes the low road they took us all the way to active inference from bayes theorem through the generative model on to active inference and clarifies these two notions of variational free energy that's the real-time perceptual unfolding evidence lower bound on surprisal tractable optimizable and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.424,
    "end": 2880.976,
    "text": " and f and g the expected free energy which is able to do planning as inference or policy selection as inference expected free energy is fundamentally prospective and that enables counterfactual cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.614,
    "end": 2905.258,
    "text": " section 2.10 summarizes active inference is the theory of how living artifacts underwrite their existence by minimizing surprise or attractable proxy to surprise variational free energy via perception and action and they motivate that from a first principles base theorem starting place any closing thoughts on chapter 2 ali",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.157,
    "end": 2925.029,
    "text": " I would just humbly suggest for the people who want to go through this chapter to try their best to really understand specifically what equation 2.5 and 2.6 represents and how to use those equations to describe different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.163,
    "end": 2959.2,
    "text": " situations with uh some uh missing elements as well uh because uh i believe those sections and uh particularly those equations are absolutely essential uh to for understanding uh everything active inference related both in this the rest of this book and uh in rest of the and in almost all",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2960.694,
    "end": 2960.974,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.134,
    "end": 2966.759,
    "text": "And just the last thought I'll give on chapter two is this is exactly the work that we do in the Active Inference textbook group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2967.159,
    "end": 2968.9,
    "text": "We really welcome all backgrounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.14,
    "end": 2972.663,
    "text": "Every single question and uncertainty you have is beautiful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.143,
    "end": 2978.607,
    "text": "We have a lot of resources that Ali and others make to make the math approachable and rigorous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.708,
    "end": 2997.033,
    "text": " and natural language descriptions of the equations and so on so yes it's really important to understand the equations because after all that's like the skeleton that gives meaning to our usage and fluency of the active inference ontology which ali and i are speaking right now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.208,
    "end": 3024.588,
    "text": " we're not just saying surprise is related to this because we felt it that way it there is an underpinning and it is a really interesting life's work to explore it but we're finding ways to communicate it and learn and teach it better and better every time so that's chapter two that's the low road moving on to chapter three the high road to active inference and so recall that the high road is like the why",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.751,
    "end": 3027.056,
    "text": " So Ali, please begin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.156,
    "end": 3030.487,
    "text": "Just go as long as you want on through the high road to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.789,
    "end": 3048.875,
    "text": " Okay, so the high road to active inference begins with the question about the conditions for the persistence of quote-unquote things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.115,
    "end": 3056.178,
    "text": "I mean, what would we expect for a thing to behave if it persists through time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.958,
    "end": 3063.141,
    "text": "And that's why sometimes FVP is referred to as the theory of every thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3063.701,
    "end": 3074.819,
    "text": " space thing and it's not absolutely everything but thing just in this sense of I mean persisting through time and the notion that allows for this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3076.857,
    "end": 3104.341,
    "text": " thing to act as it as it persists through time is markup blanket so markup blanket is one of the most essential ingredients of the high road approach to active inference and that's why this section opens up with describing how markup blanket allows to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3105.206,
    "end": 3111.388,
    "text": " describe the situation of interest through this conceptual and mathematical tool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.908,
    "end": 3119.191,
    "text": "But one thing that I always point out in almost all our textbook cohorts is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3121.899,
    "end": 3139.485,
    "text": " In this section, it doesn't exactly describe markup blankets rigorously enough in terms of its carving up the state space and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.545,
    "end": 3148.928,
    "text": "So one thing I think can be clarifying in following",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.029,
    "end": 3156.933,
    "text": " all the discussions around Markov blanket, is to keep in mind that it's just a boundary in the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3157.013,
    "end": 3161.755,
    "text": "So it's not a necessarily spatiotemporal boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3163.399,
    "end": 3176.049,
    "text": " Although in many cases, it manifests itself as spatio-temporal boundaries, such as the, I don't know, cell membranes or organelle membranes and so on, but it's not necessarily the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.149,
    "end": 3183.916,
    "text": "So I think it can be helpful to keep that in mind everywhere we see markup blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.857,
    "end": 3190.441,
    "text": "But in a very simply markup blanket,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.265,
    "end": 3202.659,
    "text": " is what allows for the agent or the system to be statistically separated from its environment as is shown here in figure 3.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.62,
    "end": 3208.326,
    "text": "So basically Markov Blanket mathematically is just the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.589,
    "end": 3225.337,
    "text": " I mean, the sensory and active states together, it consists of both of those states, and it statistically separates what happened externally or internally from each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.397,
    "end": 3232.782,
    "text": "So, in other words, internal states cannot observe or infer anything about the external states directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3233.362,
    "end": 3236.584,
    "text": " but only through the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3237.724,
    "end": 3259.036,
    "text": "And that's why it's essential to describe the systems in this way, because obviously, in any sparse coupled systems, there isn't the possibility to observe the external states directly, but only",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.696,
    "end": 3261.378,
    "text": " through those sensory and active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3262.098,
    "end": 3285.298,
    "text": "And one other thing that I also believe can be a bit confusing in this picture is that, yes, typo in the active states and sensory states, because it's important to observe that active state only, or the flow in the active states more precisely, only depends on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3286.179,
    "end": 3289.843,
    "text": " internal n-Markov states or blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.644,
    "end": 3298.471,
    "text": "And on the other hand, sensory states only depend on the external n-blanket states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.852,
    "end": 3304.157,
    "text": "So mu and x in those two equations should be exchanged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.257,
    "end": 3304.497,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3304.937,
    "end": 3305.678,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.619,
    "end": 3308.341,
    "text": "Let me just unpack this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.421,
    "end": 3310.423,
    "text": "Anything to add before we continue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.311,
    "end": 3330.61,
    "text": " yes so this is what's known as the particular partition and that terminology was brought to the fore by Carl Friston's famous monograph in 2019 and it's a little bit of a pun it's a particular partition because this is just one way to partition agent from environment figure from ground",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.393,
    "end": 3338.76,
    "text": " And we call what it partitions out, the blankets and internal states, as the particle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3339.44,
    "end": 3347.348,
    "text": "So we can think about the most inert, least cognitive particle is like a speck of dust doing brownian diffusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3347.869,
    "end": 3353.454,
    "text": "But also, there are more sophisticated kinds of cognitive particles that can include...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3354.275,
    "end": 3373.833,
    "text": " world models counterfactuals what would happen if i did this all of those kinds of sophisticated cognitive operations that we can explore in active inference so note the small typo that ali mentioned internal states and also these edges reflect causal possibilities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.975,
    "end": 3377.818,
    "text": " amongst internal, external, and blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.958,
    "end": 3383.564,
    "text": "Blanket constituting the active U and sensory Y states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3384.485,
    "end": 3387.208,
    "text": "So these are map, not territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.788,
    "end": 3391.252,
    "text": "This is not a spatio-temporal articulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3391.833,
    "end": 3394.435,
    "text": "These are like causal maps of the world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.327,
    "end": 3400.874,
    "text": " that may have to do with spatial temporal boundaries, but are not simply that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.956,
    "end": 3406.602,
    "text": "And sensory data or sensory states flow on to internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3406.802,
    "end": 3411.168,
    "text": "Internal states are involved in action selection, resulting in active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.949,
    "end": 3420.695,
    "text": " which have some causal consequence in the world, the generative process, the external states, which results in different sensory states coming in again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.436,
    "end": 3426.619,
    "text": "And so the Markov blanket is what makes the internal and the external states conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.4,
    "end": 3432.183,
    "text": "And that can be thought of as just a no telekinesis, no telepathy clause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.964,
    "end": 3439.829,
    "text": "The only way that information comes across internal and external states, which are symmetrical with each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.609,
    "end": 3444.894,
    "text": " is through the boundary or the holographic screen or the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3448.759,
    "end": 3449.84,
    "text": "You can continue on, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.065,
    "end": 3456.868,
    "text": "Okay, so the next section is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3459.389,
    "end": 3462.271,
    "text": " about surprise minimization and self-evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3462.691,
    "end": 3472.178,
    "text": "So again, this term self-evidencing is a common term in active inference literature, first proposed by Jacob Howey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3472.698,
    "end": 3481.905,
    "text": "So basically, it refers to how a system or agent, or in other words, a particular state can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.945,
    "end": 3489.489,
    "text": " gather the evidence for its self-persistence or self-existence through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3490.009,
    "end": 3511.021,
    "text": "In other words, by inferring the state of the environment and comparing that inference with its internal states, or in other words with its generative model, it's basically a way, I mean, an interpretation of that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.918,
    "end": 3530.688,
    "text": " that kind of inference is, on the one hand, there is this dynamical interaction between the internal and external state, but we can somehow interpret that physical dynamics as engaging in the active inference or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.77,
    "end": 3539.233,
    "text": " as a model for the persistence of the agent through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3539.693,
    "end": 3542.935,
    "text": "So that's basically what refers to as self-evidencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3544.195,
    "end": 3561.463,
    "text": "And then we go through the subsection 3.3.1, which sets the stage for the recent formulation of active inference as in mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3562.365,
    "end": 3580.378,
    "text": " which is to somehow interpret the act of surprise minimization as minimizing the action through the Hamiltonian principle of least action, which is a variational principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.359,
    "end": 3584.341,
    "text": "And by variational principle, what is meant here is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.284,
    "end": 3595.849,
    "text": " just a computational or mathematical tool that allows for the computation or the derivative,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3596.562,
    "end": 3620.142,
    "text": " mean specific derivations to happen so it's not uh identical to scientific theories or scientific i don't know facts or observations it's just a tool a principle mathematical uh tool uh so again one of the main um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.363,
    "end": 3626.606,
    "text": " misconceptions about free energy principle is that it is unfalsifiable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3627.787,
    "end": 3644.736,
    "text": "Obviously if we see it in this way it doesn't make sense to say that a mathematical tool or principle is unfalsifiable because it doesn't say anything about the empirical evidence of the phenomena we're talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3645.356,
    "end": 3655.681,
    "text": " So that's why here it's important to understand how the surprise minimization can be seen as this kind of variational principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.742,
    "end": 3661.824,
    "text": "And then equation 3.1 draws the parallel between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.144,
    "end": 3694.443,
    "text": " the surprisal as defined in section in chapter two sorry and this chapter so it kind of ties up all the arguments provided in the previous chapter with this one and how everything comes together in a single formulation of active inference that but they're just the two distinct approaches to arrive at same destination",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3699.144,
    "end": 3705.767,
    "text": " And then we go also, sorry, the other important equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3706.187,
    "end": 3711.369,
    "text": "And again, another key equation here is equation 3.2, which is a kind of, sorry,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.014,
    "end": 3724.576,
    "text": " Yes, I meant to say equation 3.2, not equation 3.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3724.616,
    "end": 3725.476,
    "text": "Sorry, my bad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.356,
    "end": 3736.179,
    "text": "So yes, the other section is about the relations between inference, cognition, and stochastic dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.24,
    "end": 3749.264,
    "text": "I mean, all the previous discussions around how the act of inference can be seen as a kind of self-evidencing through the variational",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3751.371,
    "end": 3774.121,
    "text": " principles such as FEP comes together to reframe the previous discussions we saw in chapter two about perception as inference and action as inference and to see the concepts of variational free energy and expected free energy through the lens of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3774.588,
    "end": 3780.112,
    "text": " variational principle of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.753,
    "end": 3801.029,
    "text": "So it unifies nicely all the material from chapters two and three into something that, I mean, not necessarily distinct from each other, but just two sides of the coin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.44,
    "end": 3804.76,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3805.0,
    "end": 3808.503,
    "text": "Yeah, I find Table 3.1 to be very exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.463,
    "end": 3816.628,
    "text": "It draws together statistical physics, Bayesian information, information theory, and cognitive interpretations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.049,
    "end": 3819.971,
    "text": "So it's kind of like learn one thing, learn many things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.851,
    "end": 3841.962,
    "text": " statistical physics has been talking about minimization of variational free energy for a long time and such methods are absolutely every day and professionalized in bayesian statistics active inference is using exactly just that to describe perception and action and so on so that's very um exciting box 3.2 describes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.69,
    "end": 3847.631,
    "text": " free energy in statistical physics and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.352,
    "end": 3851.493,
    "text": "I sometimes joke that we have a few kinds of free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3851.893,
    "end": 3857.155,
    "text": "We have Tesla, like electrical power should be available to everybody for no cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.355,
    "end": 3858.756,
    "text": "We're not talking about that right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3859.416,
    "end": 3867.54,
    "text": "There's Gibbs free energy, which is the quantity that makes chemical or thermochemical reactions irreversible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3868.3,
    "end": 3890.915,
    "text": " like the hydrolysis of atp and when we're talking about variational free energy we're talking about an information geometric space with similar dynamics similar kinetics and thermodynamics but rather than describing the reaction coordinates of a chemical reaction we're thinking about it in terms of bayesian updating and this is all called the bayesian mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.592,
    "end": 3901.013,
    "text": " 3.41 continues on with variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.874,
    "end": 3906.635,
    "text": "3.42 goes into expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.715,
    "end": 3907.596,
    "text": "So we see this a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.376,
    "end": 3910.517,
    "text": "F, variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.857,
    "end": 3913.218,
    "text": "That's the real-time unfolding sensory flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.978,
    "end": 3919.6,
    "text": "And then G, expected free energy and the policy planning as inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3921.417,
    "end": 3928.099,
    "text": " Section 3.5 concludes with a novel foundation, active inference, to understand behavior and cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.879,
    "end": 3938.722,
    "text": "And it describes a few features of active inference, including its distinguishing features from a few other ways that people have looked at behavior and cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.103,
    "end": 3949.166,
    "text": "Section 3.6 goes into a bit more detail on models, policies, and trajectories having to do with agency and policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.88,
    "end": 3956.605,
    "text": " 3.7, reconciliation of inactive, cybernetic, and predictive theories under active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.306,
    "end": 3964.873,
    "text": "Again, the exact kind of thing that there's a whole literature on, and it's always amazing to hear everybody's perspective on in the textbook groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.554,
    "end": 3969.917,
    "text": "3.8, active inference from the emergence of life to agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.698,
    "end": 3972.42,
    "text": "And 3.9, summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.12,
    "end": 3976.023,
    "text": "You want to just give any other thoughts that you have on chapter three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.86,
    "end": 3994.313,
    "text": " Again, it's one of the probably most fundamental chapters, and the topics covered in this chapter is essential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.047,
    "end": 3999.989,
    "text": " are absolutely essential to understand everything active inference related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4000.049,
    "end": 4021.798,
    "text": "But specifically, the discussions in section 3.6 onward, again, I believe is really important to understand the broader context of active inference and how it relates to all the other theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4021.858,
    "end": 4024.099,
    "text": "But specifically, section 3.8",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.55,
    "end": 4045.969,
    "text": " provides a nice view of how we can use the same modeling, the same theoretical tools to model both non-living dynamical systems or sparse coupled dynamical stochastic systems and also to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4048.895,
    "end": 4072.752,
    "text": " the systems that has agency or sentience so it's a much broader theoretical framework that doesn't restrict itself to only particular kinds of systems or agents and we'll see much more elaboration on that in the later wonderful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.855,
    "end": 4082.169,
    "text": " right that concludes our overview on chapter three now we're gonna skip to chapter six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4087.188,
    "end": 4115.027,
    "text": " so again this live stream is just providing some materials on chapters one two three and six eventually we're going to get to all chapters and version them and have as many of you as want join into the process of constructing these but this is also that our textbook groups can be really interactive and people can show up having listened to these background and context videos all right so now we are in chapter six a recipe for designing active inference models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.135,
    "end": 4122.459,
    "text": " Abraham Lincoln, give me six hours to chop down a tree and I will spend the first four sharpening the ax.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4123.3,
    "end": 4125.461,
    "text": "All right, Ali, what does the quote mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.981,
    "end": 4128.463,
    "text": "And please lead us in to this discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.542,
    "end": 4156.098,
    "text": " Okay, so as the opening quotation suggests, it's about honing the skill set for applying Active Inference Framework to model the actual empirical situations that we may use Active Inference for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.658,
    "end": 4160.561,
    "text": "And it frames it as a four-step recipe",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4163.283,
    "end": 4165.844,
    "text": " actually do this kind of model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.884,
    "end": 4172.487,
    "text": "Although it's termed as recipe, but I believe it's more like a guideline.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.408,
    "end": 4182.052,
    "text": "It's not like, I don't know, cooking recipe that needs to be observed strictly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4182.773,
    "end": 4187.835,
    "text": "So it's more like suggestions or guidelines to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4189.746,
    "end": 4197.189,
    "text": " to begin to apply Active Inference Framework in any kind of situation we'd like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.829,
    "end": 4203.671,
    "text": "So section 6.2 outlines those four steps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4204.671,
    "end": 4207.492,
    "text": "So the first step is which system are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4209.682,
    "end": 4230.95,
    "text": " in terms of how we can define the markup blanket that most effectively and efficiently the problem or question we want to explore through that modeling, through the modeling of that situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.01,
    "end": 4236.552,
    "text": "So first step is about defining those boundaries",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.137,
    "end": 4239.218,
    "text": " through Markup Blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4239.838,
    "end": 4256.091,
    "text": "And the second step is about what's the most appropriate form for the generative model, because obviously we can have many different types of generative models, depending on, again, what phenomena or what questions we're trying to address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.232,
    "end": 4258.413,
    "text": "The third stage is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4259.261,
    "end": 4260.842,
    "text": " how to set up the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4261.142,
    "end": 4279.11,
    "text": "So after settling upon the type of the generative model we want to use, we can talk about the details of the generative model and how it can be efficiently modeled to be both tractable and also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4280.285,
    "end": 4283.947,
    "text": " useful to address the situation of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4284.347,
    "end": 4287.249,
    "text": "And finally, how to set up the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4287.569,
    "end": 4297.675,
    "text": "So as we saw in chapter two, there's an important but slight distinction between generative process and generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4298.116,
    "end": 4305.42,
    "text": "So they're not always the same, but they're closely related to each other, generative process,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4307.108,
    "end": 4318.819,
    "text": " the hidden states of the external world and generative model is how the agent infer about those hidden states provided by generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4319.379,
    "end": 4323.984,
    "text": "So considering that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4324.824,
    "end": 4334.791,
    "text": " Environment is always very complex to be modeled precisely and exactly with every parameter accounted for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4335.371,
    "end": 4343.637,
    "text": "We need to have a restricted set of parameters to account for in the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4344.098,
    "end": 4348.981,
    "text": "So that's what stage four deals about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.001,
    "end": 4350.142,
    "text": "So all of these steps",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.631,
    "end": 4371.656,
    "text": " even if not observed or followed sequentially, are really essential to setting up or the initial setup of the situation we're trying to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4372.436,
    "end": 4376.137,
    "text": "And I cannot imagine how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4377.426,
    "end": 4394.477,
    "text": " Any scenario can progress without observing any of these steps, at least, I mean, just by thinking about how to set up the situation or scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4395.818,
    "end": 4396.218,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4396.738,
    "end": 4399.16,
    "text": "And in the rest of the chapter, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.11,
    "end": 4406.571,
    "text": " Just wanted to highlight again, these steps don't have to be followed in order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4407.111,
    "end": 4411.293,
    "text": "They really are like a summary as Mark has just written in the live chat here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4411.853,
    "end": 4418.695,
    "text": "It really is like a summary of the earlier parts of the book in terms of things that you want to capture in your consideration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.415,
    "end": 4429.217,
    "text": "And also it's a great way to connect a lot of the technical ideas that are brought up about generative model, generative process, and so on with some bigger questions like, who are we?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.518,
    "end": 4430.638,
    "text": "Why are we making this model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.378,
    "end": 4458.84,
    "text": " is the model going to be used so we take that in a lot of different ways in the textbook groups but which system are we modeling what is the most appropriate form for the generative model how should we set up the generative model and how to set up the generative process are all questions that must be addressed at least when actually coming through with carrying out a theoretical or empirical active inference modeling task",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.978,
    "end": 4466.229,
    "text": " And the following sections are going to go into more detail on each of those four questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.991,
    "end": 4470.477,
    "text": "So, Ali, do you want to go for this 6-3 and carry on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.314,
    "end": 4485.957,
    "text": " OK, so section 6.3 is the elaboration of the first step that we just saw, which, I mean, what systems are we modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4487.058,
    "end": 4492.139,
    "text": "And by this question, we mean what kind of system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.98,
    "end": 4523.556,
    "text": " I mean how the system carves up the state space using the markup blanket or more precisely the active states and sensory states and I believe it is both one of the most fundamental and also one of the probably one of the most challenging steps to be carried out because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4525.362,
    "end": 4536.071,
    "text": " Well, markup blanket is just a conceptual tool we use to frame the natural phenomena or any other scenario we want to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.511,
    "end": 4545.539,
    "text": "So that scenario or that model obviously doesn't care about how we set up our markup blanket or how we knit our markup blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4548.433,
    "end": 4564.527,
    "text": " Deciding on a proper set of active states and sensory states that would allow us to address the problems we need to explore or the questions we need to answer is not a trivial task.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.257,
    "end": 4580.003,
    "text": " and it needs lots and lots of consideration and even creativity on part of the researcher or anyone who wants to design an active inference-based model for the problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4580.503,
    "end": 4593.308,
    "text": "So that's where the significance of doing these kinds of modeling with the insights and creativity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.459,
    "end": 4624.501,
    "text": " researcher uh is i mean it will be obvious because it's not just something mechanical or despite the fact that uh the word recipe uh can somehow make us believe that it's just a recipe to follow but uh in actuality it's not uh the case at all so uh that's uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.016,
    "end": 4639.624,
    "text": " the discussion of a markup blanket and what criteria we need to keep in mind to settle upon a proper markup blanket around our system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.024,
    "end": 4645.567,
    "text": "And the next section, what is the most appropriate form for the generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.008,
    "end": 4650.07,
    "text": "So here, again, we can have various",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.141,
    "end": 4670.21,
    "text": " way to set up our generative model in terms of whether it's discrete or continuous variables we want to account for, about the time scale, is it shallow or hierarchical, about the temporal depth of the inference and planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4670.53,
    "end": 4672.951,
    "text": "So these are all problems we need to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.517,
    "end": 4682.561,
    "text": " be precise about or questions we need to precise about whenever we want to set up our generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4683.501,
    "end": 4691.705,
    "text": "And then we go to section 6.5, how to set up the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4692.305,
    "end": 4701.81,
    "text": "So after precisely describing what needs to be accounted or what parameters and the nature of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4702.51,
    "end": 4726.068,
    "text": " uh generative model uh needs to be accounted for uh then we will obviously need to uh address this question of how can that generative model be actually set up so setting up the variables for the generative model uh will uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4727.58,
    "end": 4745.726,
    "text": " I mean, we'll be concerned about how those matrices as A, B, C, and D matrices can be defined as we saw in chapter four, and then which parts of the generative model are fixed and what is learned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.106,
    "end": 4754.349,
    "text": "So again, it's really important to know what are the dynamics of those parameters are in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4756.618,
    "end": 4780.146,
    "text": " the learning process and what needs to be updated consistently or learned as opposed to the variables that either don't require consistent updating or they vary quite slowly as compared to the timescale of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.446,
    "end": 4782.727,
    "text": "And then we go",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.707,
    "end": 4788.868,
    "text": " through the process of setting up the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.628,
    "end": 4811.495,
    "text": "And as I mentioned earlier, it is probably one of the most complicated steps of the recipe because of the enormous complexity of any real-time situation, and particularly the environment that the agent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4813.427,
    "end": 4837.71,
    "text": " will act and behave, but even if not having, I mean, even if there is not any strict or, I don't know, obvious way to go through this stage of setting up the generative process, this section provides some helpful",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4838.847,
    "end": 4846.111,
    "text": " criteria or helpful points in order to help us in that stage as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4846.872,
    "end": 4866.283,
    "text": "So finally, after going through all of these stages, we need to somehow get, I mean, obviously we need results and we need to provide our results in a, we get our results from our active inference model and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4867.996,
    "end": 4869.12,
    "text": " section 6.7 addresses that, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4872.901,
    "end": 4881.546,
    "text": " I mean, that very idea of how to simulate, visualize, analyze, and fit data using active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4881.826,
    "end": 4884.827,
    "text": "Because it's not just enough to set up the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4885.308,
    "end": 4887.128,
    "text": "We need to get the model to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4887.509,
    "end": 4890.49,
    "text": "So how can we feed the data into the model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4890.61,
    "end": 4893.992,
    "text": "How can we read the data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.252,
    "end": 4901.256,
    "text": "And finally, how can we analyze the simulated data through the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4902.661,
    "end": 4929.5,
    "text": " active inference so this is in a way a kind of preliminary recipe or preliminary procedure for doing active inference or active inference modeling or at least suggested way to do those kinds of modeling but in the subsequent chapters in particular chapters seven and eight we'll go through some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.757,
    "end": 4940.162,
    "text": " helpful case studies for how to actually use these procedures to model some real world situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.804,
    "end": 4943.144,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4943.864,
    "end": 4944.105,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.145,
    "end": 4945.906,
    "text": "Well, there's a lot to say on chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.151,
    "end": 4957.957,
    "text": " One piece that comes up a lot is what is in the active inference kernel, the cognitive kernel, and what are situations that we can model with active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.478,
    "end": 4964.501,
    "text": "There's a huge variety of cognitive phenomena and statistical outcomes that we might be interested to study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.181,
    "end": 4991.821,
    "text": " counterfactuals and planning like multi-scale attention and covert action like the complex ways in which memories might um influence decision making in the moment based upon associations made between different sensory modalities every amazing real world situation you can imagine and it's really helpful to think about active inference as more like a framework of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4992.742,
    "end": 5010.29,
    "text": " interoperable motifs that we can compose and indeed even be creative with rather than giving us all the answers at the core model because the kind of essential minimal active inference model doesn't necessarily include",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.07,
    "end": 5038.673,
    "text": " every single attribute that you might be interested in just like any given linear regression isn't going to include every single feature that you're looking for this is happening in a different type of modeling framework but still there's a lot of customization and development that goes into adapting or elaborating an active inference type model for your given system or scenario of interest chapter six gives us some helpful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5040.327,
    "end": 5063.902,
    "text": " guidelines and things to consider which we've unpacked and expanded on elsewhere and in the textbook group we work together to characterize different systems of interest to map different parts or different observables from that system using the active inference ontology into a unified active inference type model so chapter six starts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5064.542,
    "end": 5080.089,
    "text": " The second half of the book, which is the more practice-oriented part of the book, and the rest of the part two is going to be a lot more about the specific kinds of generative models that you can use, discrete and continuous time, and about using them with empirical data in chapter nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.509,
    "end": 5088.453,
    "text": "But chapter six just stands alone as a summary of part one of the book in some ways, and a set of four questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.933,
    "end": 5090.074,
    "text": "Which system are we modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5090.754,
    "end": 5113.211,
    "text": " what is the most appropriate form for the generative model how to set up the generative model and how to set up the generative process so that we can be active inference modelers ourselves all right well Ali thanks so much for all of these great uh conversations and cohorts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.192,
    "end": 5132.079,
    "text": " We will be able to process this video to clip out these first versions of the background and context overviews and we'll distribute them to the cohort so that people can show up with their curiosities and passions and we'll see where that goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5132.419,
    "end": 5133.58,
    "text": "Any last thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.82,
    "end": 5137.22,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5137.24,
    "end": 5149.908,
    "text": "It was a pleasure to go through these chapters once again with each time, obviously with a bit more understanding than the previous one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5149.988,
    "end": 5153.491,
    "text": "So I'm looking forward to the next cohorts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.132,
    "end": 5155.452,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.632,
    "end": 5155.872,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5156.072,
    "end": 5156.513,
    "text": "Thanks, Ali.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5156.673,
    "end": 5156.933,
    "text": "Farewell.",
    "speaker": "SPEAKER_01"
  }
]