[
  {
    "start": 0.469,
    "end": 23.389,
    "text": " this section is going to be the chapter one and overview of the active inference textbook so shown here are the table of contents there are 10 chapters and three appendices in this book and they're separated into part one with chapters one through five and part two chapter six through ten ali do you want to give any overview thoughts on the organization or structure of the book",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.692,
    "end": 32.973,
    "text": " Okay, so can you hear me now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.173,
    "end": 33.393,
    "text": "Sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.453,
    "end": 33.673,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.493,
    "end": 57.599,
    "text": "Okay, so part one is basically more aligned in terms of the theoretical construction of the active inference and it provides some conceptual and theoretical tools to be utilized in the second part because for the second part,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.021,
    "end": 70.356,
    "text": " where we mostly deal with the practical side of active inference, how to actually implement active inference to model some of the systems of interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.217,
    "end": 77.184,
    "text": "So that's basically the main justification behind dividing up these chapters into two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 78.922,
    "end": 101.612,
    "text": " great all right we're going to pass over the short preface written by carl friston but it's worth a read it's only several pages long so let's go to chapter one overview so do you have any opening thoughts on chapter one or where does one even begin with such a book sure uh yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.299,
    "end": 116.711,
    "text": " For chapter one, I think probably the most central theme of chapter one is about the two different approaches to active inference, namely the high road and the low road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 117.812,
    "end": 129.041,
    "text": "And I think it provides a really nice perspective to view a kind of a whole picture and how the different components of active inference fit together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.791,
    "end": 158.56,
    "text": " Uh, so, but, um, also I, I, uh, highly recommend, uh, chapter 13 from this book, Andy Clark and it's, uh, and, uh, Andy Clark and his critics, uh, written by, um, chapter 13, I think is entitled beyond the desert landscape written by Carl Friston in which he provides more elaborate and a bit philosophical, uh, reasoning behind, uh, what exactly are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 159.145,
    "end": 167.394,
    "text": " low road and high road and what are the aims of each approach and the distinction between those two so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 169.51,
    "end": 184.883,
    "text": " For chapter one, we begin obviously with an introductory paragraph, which sets the stage for all the components that would be discussed in this chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 185.884,
    "end": 196.753,
    "text": "But a very important section, I believe, is section two here, which is how do living organisms persist and act adaptively, which is basically the main",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.478,
    "end": 200.633,
    "text": " question Active Inference is trying to address.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.814,
    "end": 222.842,
    "text": " If we want to describe active inference in, I mean, minimalistically with only one sentence or two, probably we can say something to the effect that it's a theory that addressed this very question here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 223.702,
    "end": 228.244,
    "text": "So I opened up this chapter with the importance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.352,
    "end": 252.402,
    "text": " question and then action three which is again a continuation of section one but a bit more specifically about active inference and how active inference is addressing the question provided in the section two so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.168,
    "end": 263.334,
    "text": " Basically, again, active inference is a modeling framework for modeling the behaviors from first principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 264.074,
    "end": 276.183,
    "text": "And what is meant by first principles will be elaborated upon in the following chapters, following sections, and also, obviously, in the following chapters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.183,
    "end": 314.487,
    "text": " somehow use variational principles such as free energy principle to construct modeling and mathematical tools that will enable us to describe dynamical systems of living and even non-living agents in terms of those variational principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.237,
    "end": 320.919,
    "text": " and how those agents or those systems are coupled with their environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.099,
    "end": 343.606,
    "text": "So that's basically the unificatory principle that is at the heart of this active inference approach because, yes, exactly here, it's a kind of description of this action perception loop that is at the heart of active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.022,
    "end": 347.384,
    "text": " FEP framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.805,
    "end": 364.516,
    "text": "And then we go to chapter, sorry, section 1.4, which is, again, a description of the structure of the book and why those two parts are divided as such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 365.717,
    "end": 369.32,
    "text": "So as I said earlier, first part is more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.666,
    "end": 373.989,
    "text": " concerned with the theoretical underpinnings of active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.069,
    "end": 380.533,
    "text": "And the second part is more about the practical side of it, as we see in the subsection headings here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 381.834,
    "end": 385.196,
    "text": "So that's, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 385.756,
    "end": 397.643,
    "text": "And then a very important diagram, which will provide very helpful as we whole book is provided in figure 1.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 399.721,
    "end": 412.605,
    "text": " which kind of ties all the different strands of various related theories, such as predictive coding, predictive processing, Bayesian brain hypothesis, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 413.5,
    "end": 427.283,
    "text": " into a kind of unified and integrated framework by using those two trajectories of constructing active inference, namely the high road and the low road.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.063,
    "end": 435.724,
    "text": "So it literally here is represented as the high road and the low road in this diagram.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.424,
    "end": 439.025,
    "text": "So very briefly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 440.956,
    "end": 445.38,
    "text": " High Road is a kind of top-down approach to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 445.961,
    "end": 457.331,
    "text": "It begins with the question, how things should act if they exist, in other words, if they persist through time, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.671,
    "end": 466.68,
    "text": "In other words, it kind of sets the stage for developing the concept of markup blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.058,
    "end": 490.079,
    "text": " and then obviously with by setting that also surprise minimization it attempts to elaborate that road by adding other aspects of modeling other aspects of theory such as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.749,
    "end": 506.495,
    "text": " predictive processing, self-evidencing, autopoiesis, and so on, and then reach an integrated version of active inference, which is basically an integration between perception and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 506.555,
    "end": 518.301,
    "text": "So I believe the main thing that sets active inference apart from all the other related theories, such as predictive processing and predictive coding,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.531,
    "end": 524.895,
    "text": " is the very deep integration of action and perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.975,
    "end": 534.441,
    "text": "So action is not just some afterthought or some additional component that needs to be accounted for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.042,
    "end": 539.965,
    "text": "It is deeply woven into the fabric of the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 540.526,
    "end": 545.189,
    "text": "So as we'll see, especially in chapters two and three,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.721,
    "end": 556.084,
    "text": " Even the mathematical formalism for perception and action are interestingly similar to each other and even symmetric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.864,
    "end": 569.929,
    "text": "And it shows that perception and action are actually not separate and distinct, totally distinct entities and concepts and active inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.175,
    "end": 579.219,
    "text": " definitely provides a very promising framework to integrate them into a holistic framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.24,
    "end": 597.169,
    "text": "And another approach to construct that same theory is to begin with the probabilistic description of Bayes' theorem and try to build up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.311,
    "end": 608.796,
    "text": " the formalism of active inference using Bayes' inference theorem, Bayes' theorem and Bayesian statistical inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.836,
    "end": 613.918,
    "text": "So again, we here see some very,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.959,
    "end": 623.243,
    "text": " I mean, apparently different and distinct strands, such as predictive coding, Bayesian brain hypothesis, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.723,
    "end": 633.728,
    "text": "But as we see, all of those different strands can be united and tied together within this low-road approach to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 634.568,
    "end": 640.631,
    "text": "So I guess that's... I'll just give one short thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.671,
    "end": 640.892,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 640.932,
    "end": 641.372,
    "text": "These are great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.803,
    "end": 672.931,
    "text": " yeah just one short thought thank you ollie for these great summaries the low road and the high road are going to be explored in a lot more detail in the coming chapters two and three we can think of the high road as being a y because it describes how persistent or remeasurable systems exist now they might be using bayes theorem or they might be using any other kind of mechanism internally but the high road is describing the y of existence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.138,
    "end": 678.107,
    "text": " From the low road, the bottom-up approach is kind of like a how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.668,
    "end": 683.118,
    "text": "You could use Bayes' theorem to describe persistent autopoetic entities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.076,
    "end": 704.385,
    "text": " or you could use bayes theorem for other purposes too so where these two roads intersect is active inference and we have a lot more discussion coming and of course unpacked in the textbook groups about how these really map on to bottom up and top down causation and the plurality of y's that we approach in different settings good to continue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.932,
    "end": 724.749,
    "text": " yes sure some of the coming sections uh of this chapter continuing from page eight are going to describe what are happening in the next chapters so chapter two is going to set out the low road perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.56,
    "end": 728.382,
    "text": " Chapter three is going to describe the high road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.443,
    "end": 733.286,
    "text": "Chapter four, we will unpack active inference more formally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 733.606,
    "end": 735.408,
    "text": "That's one of the math heavy chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.389,
    "end": 745.436,
    "text": "Chapter five, we'll move from formal treatments to biological implications of active inference with a special focus on mammalian neurophysiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 747.523,
    "end": 773.601,
    "text": " chapter five sets out the process theory associated with active inference and gives a lot of hands-on and empirical examples and that's a lot of the first part of the book they're then going to summarize some of the key points and distillations from that theory heavy first section one of them is that as ali mentioned perception and action are complementary processes and ways that fulfill the same imperative",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.181,
    "end": 775.321,
    "text": " Free energy minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.901,
    "end": 784.443,
    "text": "We sometimes summarize that by saying that in the pursuit of the minimization of free energy, agents can either change their mind or change the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.903,
    "end": 788.024,
    "text": "Change your mind is associated with perception and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.964,
    "end": 790.885,
    "text": "And those are distinguished later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.885,
    "end": 794.185,
    "text": "And changing the world is associated with action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.366,
    "end": 800.787,
    "text": "There's some discussion about action selection and optimal policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.176,
    "end": 809.442,
    "text": " And all cognitive operations in active inference are conceptualized as inference over generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.103,
    "end": 816.308,
    "text": "So the true kernel, the cognitive kernel of active inference is going to be the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.949,
    "end": 821.572,
    "text": "Want to pick up from here or give any thoughts on generative models and then carry on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.633,
    "end": 821.993,
    "text": "Thanks, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.198,
    "end": 845.03,
    "text": " Just one point is there is a common misconception about generative models, which is that generative models only refers to the inner states of the system and also its markup blanket, but actually generative model kind of encompass all the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.575,
    "end": 850.019,
    "text": " states of interest of the situation we're trying to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.119,
    "end": 857.525,
    "text": "So it also encodes the probabilistic information about the external states as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 857.605,
    "end": 864.611,
    "text": "So generative model can be thought of as kind of the whole state of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.691,
    "end": 868.434,
    "text": "And by system here, I mean the coupled",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.452,
    "end": 875.895,
    "text": " couple dynamics between the internal and external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.436,
    "end": 881.621,
    "text": "So that might be helpful to keep in mind in the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.842,
    "end": 883.122,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.523,
    "end": 893.953,
    "text": "One other distinction that comes up and is used a lot nowadays, although it's not always used in prior literature, is the distinction between the generative model and the generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.634,
    "end": 896.816,
    "text": "We're going to come back to it, but usually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 898.237,
    "end": 913.75,
    "text": " The generative model is being used to describe our statistical model of the agent of interest, and the generative process is the process that generates observations that are then passed to the generative model as observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.33,
    "end": 921.917,
    "text": "However, because generative models can be generative processes for each other, these two are not necessarily distinct in principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.617,
    "end": 929.84,
    "text": " So in different simulations and in different specific cases, generative models can also be generative processes for each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.28,
    "end": 936.483,
    "text": "That leads us towards talking about ecosystems of shared intelligence and interactions amongst generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.963,
    "end": 942.786,
    "text": "But when we're talking about generative model, it's like the organism or the system of interest that we're focused on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.087,
    "end": 974.811,
    "text": " are some more uh themes that arise from the first half of the book now we're on page 11 action is quintessentially goal directed and purpose of we talk a lot about how preference plays a role in shaping action selection in active inference and the goal directed nature of active inference will be unpacked in chapters two and three they discuss how various constructs of active inference have plausible biological analogs in the brain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.42,
    "end": 987.968,
    "text": " Once one has defined a specific generative model for a problem at hand, one can move from active inference as a normative theory to active inference as a process theory, which makes specific empirical predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.688,
    "end": 996.013,
    "text": "And there's many, many interesting philosophy of science type discussions that we have about explain, predict, design, control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.894,
    "end": 1004.479,
    "text": "And then we get to section 1.4.2, giving overview on part two, active inference in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.444,
    "end": 1006.985,
    "text": " So I'll just continue on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.705,
    "end": 1012.446,
    "text": "Chapter six is going to introduce a recipe for building active inference models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.127,
    "end": 1016.528,
    "text": "So this is where the step-by-step comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.368,
    "end": 1022.67,
    "text": "It's gonna give a sequence of steps and approaches that you can take to go from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.63,
    "end": 1048.684,
    "text": " understanding the structural aspects of a system or phenomena of interest and build your way towards having an active inference model that can then be implemented in code and we have various examples and we're there in the textbook group to work with everyone who wants to take this journey but chapter six is going to describe that process of building the active inference generative model so that's a recipe chapter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.344,
    "end": 1077.244,
    "text": " there's a lot more that goes into the restaurant also as we kind of have fun exploring chapter 7 and 8 are like a pair and they describe two different broad families of generative models now these two families of generative models they work well they play well with each other but they are very educationally relevant to also consider separately chapter 7 is going to focus on the discrete time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1078.044,
    "end": 1104.227,
    "text": " generative model and chapter eight is going to focus on the continuous time generative models and again these discrete and continuous time models can be nested and interoperable however they do describe some very important different situations and so chapter seven and eight have a lot of technical information on the discrete and continuous time formulations of active inference and also about how they integrate together",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.248,
    "end": 1132.069,
    "text": " chapter nine is illustrations of how active inference models can be used to analyze data from behavioral experiments and so this kind of goes beyond chapter six's recipe and it talks about some of the process of making a behavioral experiment and then using the outcomes of that behavioral experiment the data from that experiment and using that to parameterize and do statistics with the active inference generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1132.89,
    "end": 1162.072,
    "text": " and chapter 10 brings it all together chapter 10 is a lot like chapter one and we've even joked of reading the book backwards that's how great chapter 10 is so for those who are reading chapter one consider reading chapter 10 next and then picking back up with chapter two because chapter 10 is going to give some judgments and also sketch some exciting future directions for where active inference is in relationship to other fields and where it's going",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.075,
    "end": 1164.956,
    "text": " So I also second that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1165.737,
    "end": 1167.658,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1167.798,
    "end": 1173.581,
    "text": "The second part of the book illustrates a broad variety of models of biological and cognitive phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1173.961,
    "end": 1176.703,
    "text": "So it's an application oriented second half of the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.603,
    "end": 1180.885,
    "text": "And we have a lot of accessory code and approaches and notebooks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.945,
    "end": 1184.547,
    "text": "So one may not find that this is the one stop shop that they were looking for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.027,
    "end": 1190.15,
    "text": "However, for those who dive in, there's absolutely more than enough to scaffold their learning journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.642,
    "end": 1194.644,
    "text": " And then section 1.5 is the summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1195.325,
    "end": 1206.013,
    "text": "The chapter introduces the active inference approach to explain biological problems from a normative perspective and preview some implications of this perspective that will be unpacked in later chapters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.913,
    "end": 1213.478,
    "text": "It describes the structural outline of the book, chapters one through five being theory, chapter six through 10 being practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1214.459,
    "end": 1219.883,
    "text": "And then it signals that the next two chapters are going to develop the low and the high road perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.844,
    "end": 1221.745,
    "text": "And all together,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.342,
    "end": 1224.503,
    "text": " That is chapter one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1224.803,
    "end": 1226.104,
    "text": "Any other thoughts on chapter one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.148,
    "end": 1245.541,
    "text": "Not specifically, but I think it provides a really good context to the rest of the book in terms of how all the different elements of Active Inference comes into play in addressing different problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1246.022,
    "end": 1246.282,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  }
]