[
  {
    "start": 6.428,
    "end": 31.157,
    "text": " hello and welcome it's february 20th 7th 2023 we're here in active inference book stream number 2.1 with thomas parr as well as terry and ali so thank you all for joining this should be a very fun discussion and let's go first by way of introduction and beginning to thomas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.137,
    "end": 41.12,
    "text": " Welcome, and please, how did you come to write this textbook in collaboration with Pizzulo and Friston?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.6,
    "end": 46.381,
    "text": "Well, again, thank you very much for having me here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 47.902,
    "end": 49.182,
    "text": "How did we come to write the textbook?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 49.202,
    "end": 50.462,
    "text": "That's a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 51.043,
    "end": 59.125,
    "text": "I think Giovanni was the person who really had the idea and pushed for this, but I think Carl had already",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 59.904,
    "end": 66.851,
    "text": " previously been approached by the editor who ended up managing the publication of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 69.013,
    "end": 79.303,
    "text": "And when Giovanni had the idea that this would be a really useful contribution, he and I had a number of discussions about it, both in London and in Rome where he's based.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 80.831,
    "end": 86.374,
    "text": " and sort of put out a plan and sort of came up with something that we hoped would be useful for the community.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 87.195,
    "end": 96.94,
    "text": "I suppose part of the reason why we thought it'd be a useful thing to do is that active inference is a very multidisciplinary type field that draws a lot from lots of different domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 97.92,
    "end": 99.301,
    "text": "And I think one of the struggles",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.109,
    "end": 127.482,
    "text": " know we all had when we started out in it and i think certainly what students and people who are interested in the topics say to us is that it's often quite difficult trying to find all of these different topics trying to find the right background when they don't all come from one field so putting it all together in one book with a consistent notation consistent language and trying to make it complete we hoped would uh just make the field a little bit more accessible um to others who wanted to get involved",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 132.062,
    "end": 138.925,
    "text": " How did this dovetail or integrate with your own education and research directions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.205,
    "end": 143.387,
    "text": "What phases or stages were you moving through while this discussion was happening?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.728,
    "end": 151.831,
    "text": "When we initially started discussing it, it must have been probably the last year of my PhD.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 152.811,
    "end": 153.772,
    "text": "By that stage, I'd spent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 155.503,
    "end": 172.26,
    "text": " three or four sorry two to three years sort of getting to grips with active inference having spent you know being relatively recent in terms of learning some of the key material myself I think it was quite a good stage to be at in terms of thinking about what I would have wanted to know a few years previously",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 174.468,
    "end": 178.651,
    "text": " The actual writing of the book then carried on over the next year or two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 180.212,
    "end": 197.104,
    "text": "So by that stage, I was back in clinical training as well, which I think is also a useful perspective in terms of some of the later chapters and thinking about application of active inference type models in the context of clinical conditions and psychiatry and neurology and those sorts of areas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 200.438,
    "end": 202.28,
    "text": " That's actually a really interesting note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.58,
    "end": 219.655,
    "text": "How did the clinical experiences give a perspective on the book or how did the book or your learning in these abstract and theoretical domains give a different insight in the clinical setting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.563,
    "end": 229.669,
    "text": " It's a good question, and I think you're right to highlight the bidirectionality of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 229.709,
    "end": 231.871,
    "text": "Both are useful in different ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 233.592,
    "end": 238.897,
    "text": "I think, for me, the clinical setting is quite useful in terms of thinking, first of all,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.337,
    "end": 244.079,
    "text": " interacting with different sort of audience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 244.299,
    "end": 253.362,
    "text": "So people who may be much more skilled on the clinical side of things, maybe had less experience on the mathematical computational side of things, but may still find the concepts very useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 254.102,
    "end": 258.684,
    "text": "So from that side of things, it's quite a useful exercise in being able to communicate these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 260.704,
    "end": 267.187,
    "text": "And then there's sort of the interaction on the patient side of things and trying to, you know, I think it makes a big difference, first of all, in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 268.877,
    "end": 293.846,
    "text": " interacting with patients has an impact on how you might think about the interesting questions and the things you might want to use that to inference for but also having an understanding of principles behind it helps you I think formulate your questions about how individual patients might present or the reasons for that I think is a useful way of thinking about I mean I suppose on two levels so one in terms of understanding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 295.894,
    "end": 313.304,
    "text": " understanding particular sorts of pathology in terms of the inferences that might have gone wrong, but also in terms of understanding your own active inferential processes when you're trying to work out what's going on yourself, asking the right sort of questions to gather the right sort of information and test those internal hypotheses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 313.384,
    "end": 317.126,
    "text": "I think that's a very useful way of thinking about being a doctor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 322.893,
    "end": 337.755,
    "text": " awesome yeah a lot to say about that the bayesian optimal differential diagnosis ali or terry on any of these thoughts do you have any questions or comments you want to raise there or any follow-ups",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.326,
    "end": 346.829,
    "text": " Well, yeah, actually, I just wanted to ask, what are the intended audience of the book?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 347.55,
    "end": 352.592,
    "text": "And what do you think are the minimum prerequisites for going through the whole book?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.173,
    "end": 367.84,
    "text": "Because I'm sure you'll agree that even today, the intersection between the people who are well-versed in mathematics and the people who have a solid background in, say, neurobiology are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 368.44,
    "end": 386.398,
    "text": " uh quite narrow so um so what's the solution here and what did you think about about the organizational structure of the book that could accommodate various audiences so um yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.643,
    "end": 414.119,
    "text": " Again, another really good question and I think you're right to highlight that that intersection is relatively narrow and there are lots and lots of people who I think struggle to feel involved in those kinds of discussions and you're absolutely right to say that and I think one of the solutions is the sorts of things that you guys are doing in terms of setting up these reading groups, trying to open that up, trying to provide educational resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 414.179,
    "end": 415.98,
    "text": "I think that's really very important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 417.823,
    "end": 421.345,
    "text": " In terms of the specific questions about the book itself, who's the audience?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.286,
    "end": 424.947,
    "text": "And what are the prerequisites?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.007,
    "end": 431.212,
    "text": "I think it sort of depends what you want to get out of it and what your purpose is in reading it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 431.652,
    "end": 437.316,
    "text": "So some aspects of the book I suppose will appeal more to some audiences and others to other kinds of audience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 439.36,
    "end": 464.055,
    "text": " I would hope that the readership or the audience is relatively broad because we've tried to provide as much background as we can on sort of the mathematical and the neurobiological side of things to try and complement the skill set of whoever's not in that intersection who comes to it, who may need a bit more sort of neurobiological grounding or who may need a bit more mathematical and technical grounding.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 466.096,
    "end": 466.956,
    "text": "But I think ultimately,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 468.704,
    "end": 474.546,
    "text": " Like with most textbooks, you don't necessarily need to come to it thinking, I'm going to understand everything in this book when I come away from it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 475.086,
    "end": 488.03,
    "text": "Some people may want to, but other people, depending upon what they want to get out of it, they might say, actually, what I really want to get out of this is an understanding of some of the kind of message passing as it manifests in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 488.29,
    "end": 492.532,
    "text": "Whereas other people might come to it and say, actually, I already understand a bit about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 492.592,
    "end": 495.693,
    "text": "And what I want to get out of this is to understand a bit more of the technical detail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 497.558,
    "end": 502.626,
    "text": " If you're a roboticist coming to this, it probably doesn't matter too much about how things are implemented in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 502.646,
    "end": 505.13,
    "text": "If you're a neurobiologist coming to this,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 505.782,
    "end": 510.944,
    "text": " you may not need to know the details of the implementation as long as you can understand it conceptually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 510.984,
    "end": 528.19,
    "text": "And I hope the organisation, particularly putting things like the appendices with the detailed information at the back, tries to keep most of the text a bit more accessible, the early chapters being relatively light on the technical material and building up the concepts before then moving into the more technical aspects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 531.32,
    "end": 558.315,
    "text": " about the uh chapters let's actually just take a quick look at the chapters um we're in the uh coda document that we use so perhaps you could just say one or a few sentences on each chapter what's the short of each chapter what is it doing in this 10 chapter work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.367,
    "end": 561.548,
    "text": " You're testing my memory now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 562.529,
    "end": 563.25,
    "text": "The titles are there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.49,
    "end": 564.692,
    "text": "The cues are there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.012,
    "end": 565.913,
    "text": "Epistemic cues are there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.994,
    "end": 568.156,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 568.496,
    "end": 570.919,
    "text": "Well, the overview is what it says on the tin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.179,
    "end": 576.565,
    "text": "It's a description of what's to come in the subsequent chapters to try and orientate people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 578.544,
    "end": 600.044,
    "text": " And the low road and high road, I think, again, Giovanni has to take credit for this idea of saying, actually, there's quite a, it's often difficult to know where to begin when you're trying to understand active interference and the free energy principle and the Bayesian brain and all those sorts of things, because it seems like there are so many potential starting points, all of which ultimately, I think, get at the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 600.244,
    "end": 603.227,
    "text": "But knowing where you begin is often really quite difficult.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 604.928,
    "end": 610.213,
    "text": " And so these two chapters were designed to explicitly acknowledge that difficulty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 611.615,
    "end": 627.97,
    "text": "So the idea of the low road is to say, well, let's take a pragmatic perspective where we take ideas that have developed in neuroscience based upon our understanding of the brain and of psychology and models that have been developed to explain those things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 628.87,
    "end": 643.341,
    "text": " And let's take those to their conclusion, which is, in a sense, the free energy principle, which is active inference, the idea of using our internal models both to drive behavior and to understand what's going on in the world around us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 645.501,
    "end": 649.105,
    "text": " The High Road perspective was designed to take a different approach to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 649.145,
    "end": 661.961,
    "text": "And instead of starting from what's already been developed in the sort of natural trajectory in the neurosciences, the High Road chapter was more saying, let's start from first principles as much as we can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 663.402,
    "end": 674.909,
    "text": " And here was a tricky balance to try and make sure that we didn't go too far in depth, that we put people off by the third chapter, but enough that people might get a bit of a conceptual sense of where you might go with this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 676.313,
    "end": 693.469,
    "text": " And here we sort of started from the kind of physics of self-organisation, the ideas that come underneath that, and how those ideas can then feed back into this same idea of active influence that the neuroscientists and psychology seem to have arrived at relatively naturally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 693.489,
    "end": 698.734,
    "text": "I suppose chapter four is when things start getting a bit more technical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 699.872,
    "end": 706.957,
    "text": " and starts dealing with the specifics that I think most people would want to know if they were implementing these models themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 709.259,
    "end": 721.447,
    "text": "So trying to understand exactly how you construct an internal model, how you specify it, write it down mathematically, how you perform inference with those, how you understand the message passing schemes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 723.734,
    "end": 730.858,
    "text": " chapter five then takes a step back and thinks, well, in the context of the brain, in the context of neurobiology, what do those things actually look like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 730.959,
    "end": 739.404,
    "text": "How do we understand those inferential processes with different kinds of generative models in terms of what we know about message passing and synaptic communication?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 742.085,
    "end": 746.608,
    "text": "And those five chapters together really are the first part of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 746.828,
    "end": 750.01,
    "text": "And the subsequent five chapters really then take you through",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 750.629,
    "end": 754.205,
    "text": " the idea of actually applying those ideas in particular domains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 755.285,
    "end": 759.607,
    "text": " And so chapter six is sort of the overview chapter looking at the rest of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 759.827,
    "end": 768.77,
    "text": "And it's really setting out if you wanted to sit down and design a model, either conceptually or computationally, these are the steps you would have to go through to construct that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 769.831,
    "end": 779.815,
    "text": "And then chapters seven and eight take you through that sort of recipe for several examples, building up different concepts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.235,
    "end": 793.21,
    "text": " both for models designed in discrete time, where you're formulating things as a sequence of events, and models formulated in continuous time, where we work with continuous dynamical systems and differential equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.495,
    "end": 805.444,
    "text": " Chapter 9, as I mentioned before, one of my interests is in the clinical domain and trying to understand what sort of models people use to perform inference, how those can go wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.345,
    "end": 816.955,
    "text": "And part of the research on that is thinking, well, how do we then fit these models and use them to actually draw inferences about what's going on with particular individuals or groups of individuals?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 818.657,
    "end": 829.003,
    "text": " And then chapter 10 takes the broadest perspective and looks at how that relates to a range of other theories and ideas, both in the neurosciences and beyond.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 830.484,
    "end": 832.886,
    "text": "And then I'm sure the appendices speak for themselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 835.64,
    "end": 837.862,
    "text": " Awesome, great overview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.582,
    "end": 840.864,
    "text": "Let's come back to our questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.944,
    "end": 850.671,
    "text": "So you laid out that the first half of the book is about learning and the second half of the book is about applying and it begins with that recipe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.912,
    "end": 870.909,
    "text": " so if chapter six is the recipe as a chef and sous chef yourself what else have you found was important in the restaurant what is your full stack active inference modeling look like and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.145,
    "end": 889.014,
    "text": " Maybe summarizing in six or going beyond what was in six, like what have you found to be important as part of the modeling journey, especially with teams where people might have like different levels of domain specific knowledge or active knowledge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.355,
    "end": 893.957,
    "text": " I like the restaurant analogy, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 894.297,
    "end": 902.925,
    "text": "And I was thinking, I suppose the first thing that anybody needs to do if they're setting up a restaurant or a model is thinking about who their customers are and what they might want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 903.986,
    "end": 910.552,
    "text": "And so in the scientific domain, you're thinking, well, what sort of journal am I planning on submitting this to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 910.632,
    "end": 916.358,
    "text": "What sort of questions are the communities who read those journal articles interested in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 918.707,
    "end": 923.451,
    "text": " And I think that's a really important first step so that you know what I'm actually trying to do with this model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 924.571,
    "end": 931.717,
    "text": "What's not such a good idea often, although you can find interesting things by doing it, is to say, well, I'm going to develop a model and work out what it's for later on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 931.737,
    "end": 935.56,
    "text": "You can end up sort of tying yourself up a little bit by doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 936.481,
    "end": 940.864,
    "text": "Although there is value in exploring as I think we would all agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 940.884,
    "end": 942.205,
    "text": "Then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.434,
    "end": 952.716,
    "text": " I suppose in terms of ingredients, it's relatively straightforward and deliberately so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 954.137,
    "end": 965.901,
    "text": "The idea of these sorts of models is that they should be relatively accessible, relatively easy to construct without having to make use of large supercomputers or anything like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 966.161,
    "end": 971.263,
    "text": "A lot of the models that I develop can be run on a laptop fairly straightforwardly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 973.104,
    "end": 980.428,
    "text": " So, you know, obviously just picking your computing language and how you're going to construct that, there are now a couple of different options out there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 981.689,
    "end": 995.117,
    "text": "MATLAB being the one that I think is most well developed, but now lots of people developing Python-based implementations of active inference schemes, and particularly in the Markov decision process realm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 997.359,
    "end": 1008.246,
    "text": " So that gives you, I suppose, some of the key ingredients, but then it's really sitting down and thinking, well, how would I now actually construct this model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.366,
    "end": 1024.917,
    "text": "And the key question I think often is, if you have a particular phenomena or a particular task in mind that you want the model to perform, it's thinking, well, how would I go about actually constructing the data that's presented to a participant performing that task or presented to an agent that's trying to perform this task?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1025.902,
    "end": 1037.889,
    "text": " And if you can explain how those data are generated, then you effectively have the generative model that implicitly your agent or your participant or whoever else should be using to be able to perform that task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1039.39,
    "end": 1044.533,
    "text": "So really, all you need to be able to do is to work out how to create the experimental stimuli.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.093,
    "end": 1048.115,
    "text": "And once you've done that, you've almost already created your model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1049.13,
    "end": 1056.772,
    "text": " And the rest comes from predefined, preexisting inversion schemes that actually minimize the free energy for that model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1058.913,
    "end": 1061.414,
    "text": "So at that stage, it becomes relatively straightforward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1061.674,
    "end": 1074.278,
    "text": "I say relatively because as anybody who has experience in coding knows, a lot of time is spent debugging and throwing up errors and spending a while trying to work out why, a little bit of Googling to work out a solution around that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1074.298,
    "end": 1078.239,
    "text": "I think those are all important parts of the process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1081.457,
    "end": 1081.797,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.118,
    "end": 1088.563,
    "text": "Ali or Terry, on that recipe and modeling question, any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1097.15,
    "end": 1107.498,
    "text": "Actually, I also wanted to ask if you have a plan for extending the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1109.4,
    "end": 1124.169,
    "text": " codes or supplementary materials to include other languages such as IMDP packages or any other packages that might come up later and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1125.449,
    "end": 1128.37,
    "text": " would be widely used in Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.951,
    "end": 1139.275,
    "text": "Because as far as I know, there isn't any specific GitHub repo or something dedicated for this book so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.915,
    "end": 1146.678,
    "text": "So do you have any plans in developing such a supplementary material for the book?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.198,
    "end": 1149.519,
    "text": "We don't at the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1151.098,
    "end": 1152.46,
    "text": " It might be an interesting thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1152.48,
    "end": 1159.567,
    "text": "I mean, it might be a useful thing to be done by the active influence community as well as a way of sort of being engaged and involved in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1160.448,
    "end": 1169.538,
    "text": "I suppose one of the difficulties of doing that for a book is that often these things move on so quickly by the time it comes out in a book that those packages have moved on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1170.78,
    "end": 1181.484,
    "text": " So I think it was useful for us to give a simple example of MATLAB implementation to demonstrate the principles in one of the packages that we've been involved in developing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1182.784,
    "end": 1188.447,
    "text": "So as part of the SPM package where we've been involved in developing the active instance routines as part of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1191.451,
    "end": 1201.78,
    "text": " And I think it's certainly a good idea thinking about having other repositories out there with all sorts of demonstrations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1202.32,
    "end": 1206.624,
    "text": "So the SPM package does have a range of different demonstrations for different sorts of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.986,
    "end": 1213.112,
    "text": " of implementations as well for different kinds of models, which is a really helpful resource.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1213.733,
    "end": 1224.328,
    "text": "And I often suggest to people that one of the first ways of getting a sense of how to build these models is to look at one that's already been built and do their best to break it and change things and make it behave in different ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.625,
    "end": 1233.473,
    "text": " And so I think you're absolutely right to say examples of the code and how it's implemented are vital in bringing people into this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1235.875,
    "end": 1247.367,
    "text": "But yes, I think you're absolutely right to say that it would be really helpful to have both Python and Julia implementations and all sorts of different ways of doing it and examples so that people can pick those up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1248.007,
    "end": 1248.648,
    "text": "I agree completely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1250.131,
    "end": 1259.763,
    "text": " And of course, one of the advantages of Python and Julia is that they're open source and you don't necessarily need an academic license to use it, which again, I think increases the number of people who can access it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1264.09,
    "end": 1280.559,
    "text": " Giving an overview to someone who might not have been following in the blow by blow of our little literature corner over the last few years, how would you say active inference modeling has evolved during your time in the space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.039,
    "end": 1281.96,
    "text": "Where are we at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.6,
    "end": 1285.321,
    "text": " just generally speaking, with applications?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.541,
    "end": 1294.344,
    "text": "What applications are developed or possible today that when you were starting your PhD seemed like they were just implausible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.585,
    "end": 1306.908,
    "text": "So I think if we go back a bit, I suppose some of the earlier implementations were almost all in the continuous domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1308.749,
    "end": 1309.769,
    "text": "So they were all based upon...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1312.071,
    "end": 1324.515,
    "text": " things like the generalized filtering type algorithms that were initially developed as sort of filtering methods to perform time series inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1325.056,
    "end": 1325.916,
    "text": "Those things then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1327.179,
    "end": 1344.711,
    "text": " equipped with an active component then became some of the earlier active inference type simulations, and a lot of that focused on things in the movement domain, whether that be eye movements or control of limbs to the extent that you can develop handwriting and those sorts of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1346.692,
    "end": 1356.139,
    "text": "One of the interesting things that started to happen based upon that was to think about how you then get something that looks more sequential emerge from those continuous dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1357.738,
    "end": 1363.424,
    "text": " And handwriting was actually a really good example of that, where there were some simulations developed in which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1366.164,
    "end": 1375.566,
    "text": " in which the continuous model effectively had something a bit like a Lotka-Volterra dynamic in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1377.006,
    "end": 1388.869,
    "text": "So Lotka-Volterra dynamics are a kind of dynamical system often used for modeling things like predator-prey interactions, and the idea is that you get a peak in terms of a predator population",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1389.509,
    "end": 1396.133,
    "text": " Sorry, prey population followed by a peak in the predators as they eat the prey, causing drop in the prey population.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1396.213,
    "end": 1401.876,
    "text": "But then as the predators die out, the prey come back and you get this sort of sequence of peaks from predator, prey, predator, prey.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.437,
    "end": 1407.3,
    "text": "And you can generalize that to then have multiple different populations, each preying on one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1407.34,
    "end": 1409.221,
    "text": "So you get this sequence of peaks over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1410.161,
    "end": 1425.403,
    "text": " And that sort of emergence of sequences from continuous dynamics, I think, was one of the key moves early on in terms of thinking about things through a bit more cognitive in terms of how do I do this and then this and this and start to plan and generate much more purposeful type of behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1426.974,
    "end": 1438.419,
    "text": " So that went so far until things moved much more to an explicitly discrete or sequential style of modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1439.019,
    "end": 1448.363,
    "text": "That's when things like Markov decision processes started to be employed in the active inference domain or partially observed Markov decision processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1448.543,
    "end": 1453.365,
    "text": "So those are models that say, I assume my world is a sequence of states over time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1454.425,
    "end": 1457.306,
    "text": " one after another, each of which generates some observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.606,
    "end": 1460.646,
    "text": "And from those observations, I can make inferences about the states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1462.387,
    "end": 1468.328,
    "text": "You can then say, well, if I can act upon the world, I can change the sequence of states as they evolve over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1469.828,
    "end": 1477.41,
    "text": "And by selecting different actions or different ways I can change that sequence, I'm effectively planning and making decisions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1478.03,
    "end": 1481.751,
    "text": "So that's, again, where you get into a much more cognitive sort of domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1484.56,
    "end": 1495.531,
    "text": " Some of the key advances sort of early on while I was doing my PhD were the emergence of things like deep hierarchical models of things like Markov decision processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1496.151,
    "end": 1501.957,
    "text": "So here the idea was that in the world around us, there are lots of things that evolve over different sorts of timescales.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1503.258,
    "end": 1518.363,
    "text": " And so one of the early examples of this was reading, the idea that when you move your eyes around the page, you're sort of looking at an individual word or the letters within that word, but that word is itself part of a sentence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1518.963,
    "end": 1526.005,
    "text": "And the time it takes you to infer what the word is, is going to be much shorter than the time it takes you to work out what's going on in terms of the sentence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1526.621,
    "end": 1530.924,
    "text": " and the sentence and the paragraph and the paragraph and the page and the page and the book and etc.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1531.644,
    "end": 1535.307,
    "text": "So there's a whole hierarchy of different time scales in the world around us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1536.427,
    "end": 1541.911,
    "text": "And one way of accounting for that relatively simply in these sorts of models is to simply stack them on top of one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1542.551,
    "end": 1549.576,
    "text": "So the outcomes you're now predicting from one of the Markov decision process type models I was describing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1551.2,
    "end": 1553.622,
    "text": " now reflects a sequence of very fast states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1554.422,
    "end": 1557.503,
    "text": "And each of those states, yes, exactly, is the graphic of this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.524,
    "end": 1561.806,
    "text": "And then each of those outcomes predicts another sequence of very fast states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1562.386,
    "end": 1568.189,
    "text": "So what you're left with is, at the very top level, a very slow progression of state after state after state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1569.189,
    "end": 1576.293,
    "text": "For each of those states, which might be the sentence, you then have the words in that sentence beneath it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1577.006,
    "end": 1580.148,
    "text": " And then for each of those words, you might have each of the letters in that sentence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1580.388,
    "end": 1581.908,
    "text": "Sorry, each of the letters in that word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1585.07,
    "end": 1595.935,
    "text": "And so that then sort of expanded the range of things that we can do in terms of how we give some sort of deep temporal structure to the kinds of models we develop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.481,
    "end": 1601.023,
    "text": " Sometimes people refer to that as kind of breaking the Markov property.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1601.443,
    "end": 1612.57,
    "text": "So for those who aren't familiar with this, the Markov property is the idea that each step in time depends only upon the step immediately previous to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1612.71,
    "end": 1618.473,
    "text": "That all you need to know about the next time step is what's happening at the current time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1618.693,
    "end": 1621.655,
    "text": "Nothing else in the past is useful once you know that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1623.395,
    "end": 1630.238,
    "text": " And people often suggest that means that these processes are effectively memoryless because it's only where I am now that matters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1630.298,
    "end": 1633.019,
    "text": "It's not what was happening well into the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1633.699,
    "end": 1635.38,
    "text": "By having a hierarchical structure,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1635.953,
    "end": 1649.679,
    "text": " where you have a higher level state that is more slowly changing, that's contextualizing what's going on at the lower level, it means that the fast sequence of changes is actually dependent upon something much slower that's happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1650.1,
    "end": 1652.421,
    "text": "And that in itself is dependent upon something much slower.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1652.861,
    "end": 1654.882,
    "text": "And that gives you a sort of memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1654.942,
    "end": 1657.183,
    "text": "It allows for the Markov property to be broken.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.511,
    "end": 1677.219,
    "text": " So like I said, we're sort of starting off with continuous, the emergence of discrete from continuous, the explicit modeling of continuous models, decision-making, and the sort of exploration, exploitation type trade-offs that you get once you treat planning as being an inference process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1678.2,
    "end": 1687.764,
    "text": "The idea that you can then stack these things hierarchically and have a range of different timescales that break the Markov process, allow us to think about things like memory and working memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1689.534,
    "end": 1696.851,
    "text": " And then I suppose one of the next stages was the combination or the reintroduction of the continuous models as the lowest level of one of these hierarchies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1697.452,
    "end": 1698.114,
    "text": "The idea that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1699.403,
    "end": 1710.151,
    "text": " Actually, it's all very well being able to make decisions, but at some stage you need to implement those decisions in a world that's made up of physics and muscle lengths and continuous sensory inputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1710.992,
    "end": 1719.879,
    "text": "And so putting these sort of hybrid models together where you can use your decisions to then predict short sequences and trajectories defined in a continuous domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1721.704,
    "end": 1735.981,
    "text": " And I suppose since then, there have been a range of further developments in active inference in that setting and a range of developments in a number of other directions and sort of in parallel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1737.463,
    "end": 1741.564,
    "text": " So some of those developments have been thinking about implementation in other languages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1741.904,
    "end": 1756.389,
    "text": "Some of those developments have been thinking about combination with methods from deep learning and the introduction of variational autoencoders and function approximators and amortized inference, which a lot of people in the robotics community have been pioneering particularly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1761.334,
    "end": 1764.216,
    "text": " So that would be one direction that things have been developed in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1765.497,
    "end": 1787.071,
    "text": "And I suppose the other direction that's seen a lot of development recently has been the sort of underlying principles, the physics that underwrites active inference, the principles and how you justify the sort of dynamics and where free energy comes from as a concept and why it's useful in understanding how systems behave.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1788.792,
    "end": 1789.993,
    "text": "So that...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1790.834,
    "end": 1798.279,
    "text": " I hope that wasn't too much all at once, but there was a sort of run-through of some of the developments that spring to mind over the last few years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1800.661,
    "end": 1801.021,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.942,
    "end": 1808.506,
    "text": "Perry or Ali, any comments on that quick historical review?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1813.45,
    "end": 1821.132,
    "text": " Again, I had another question regarding... Actually, it's a question out of mere curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1822.753,
    "end": 1830.875,
    "text": "Did you have any specific reason for adopting this particular mathematical notation throughout the book?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1830.915,
    "end": 1834.076,
    "text": "Because it seems like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.456,
    "end": 1843.444,
    "text": " somewhat diverges from the notations used in some of the well-known papers in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1843.984,
    "end": 1847.948,
    "text": "And I know active inference notation is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.39,
    "end": 1867.262,
    "text": " consistently used across the literature, but even in the papers that came out after the publication of this book, written by Professor Friston or others, I don't see this specific notation used a lot in those papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1867.362,
    "end": 1871.925,
    "text": "So I just wanted to ask about the reasons behind this choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.136,
    "end": 1874.377,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1874.477,
    "end": 1879.205,
    "text": "I mean, I think you're absolutely right to say that it's not always been used consistently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1879.225,
    "end": 1883.291,
    "text": "And it's worth saying that in some cases,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1886.574,
    "end": 1890.115,
    "text": " There are a couple of different tensions that affect this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1890.355,
    "end": 1915.002,
    "text": "So one is the idea that in a lot of papers that are published, because it's only dealing with an aspect of active inference and not trying to put it all together, they can sort of use a notation that may be the same as notation you might use in another field without worry that people will get conflicted and misinterpret one variable for another because everything's just defined within that one domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1917.433,
    "end": 1937.283,
    "text": " Another aspect to it is that, depending upon the paper in question and the audience it's aimed at, sometimes the notation is designed to match what might be used in that broader field, whereas we've tried to make it as consistent as possible across different fields.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1938.124,
    "end": 1944.587,
    "text": "Were there any particular notations that you were thinking of or that I can help clarify?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1946.873,
    "end": 1972.89,
    "text": " Yes, so for example, as just a very simple example, using eta for external states instead of x that's been used, or s and a for active states and sensory states, or other kinds of uses of lowercase matrices and uppercase matrices, which is used differently in a paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.49,
    "end": 1981.18,
    "text": " such as a step-by-step tutorial on active inference and these kinds of notational divergences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.024,
    "end": 1986.425,
    "text": " Okay, so yes, I mean, those are some quite nice illustrations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1986.505,
    "end": 1992.828,
    "text": "So things like A and S, which, as you say, are often used in some of the more physics-orientated papers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1995.149,
    "end": 2004.873,
    "text": "Unfortunately, if you use those in a Markov decision process paper, people will interpret those as being states and parameters of a likelihood matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2005.133,
    "end": 2009.155,
    "text": "So unfortunately, we couldn't use those same letters without causing more confusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2010.006,
    "end": 2022.73,
    "text": " So what we try to do there is to focus more on the sort of practical inference side of things, of the actual implementations we tend to use of active inference in particular problem settings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.43,
    "end": 2025.551,
    "text": "And there, when you're constructing a generative model,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2027.493,
    "end": 2040.59,
    "text": " particularly if it's in the continuous domain, will often use x as being the states that I have to infer, which from the perspective of the physics type papers are the external states, the things that are having an effect on my sensory states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2040.61,
    "end": 2041.812,
    "text": "We've",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2044.435,
    "end": 2051.798,
    "text": " I can't remember whether we used Y or O for the sensory states or the data in the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2052.519,
    "end": 2054.88,
    "text": "I think it's Y. I think it's Y, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2055.48,
    "end": 2068.906,
    "text": "And that sort of fits with the idea of using it in the continuous domain, where in a lot of settings when you're trying to predict sensory data, often Y will end up being the variable that we end up using.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2071.068,
    "end": 2075.554,
    "text": " So I appreciate that it can be confusing, sort of jumping between different resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2076.896,
    "end": 2084.946,
    "text": "But what we strove for in this one was internal consistency as much as we could and trying not to overload specific variables or symbols.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2085.988,
    "end": 2086.368,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.289,
    "end": 2087.55,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.649,
    "end": 2117.879,
    "text": " figure 4.3 we bound ourselves coming back to again and again it four sages chapters seven and eight and it lays out discrete time on top and continuous time on the bottom in terms of their structural similarities but also they have some really important differences so could you just as you see it how do the discrete time and the continuous time models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.093,
    "end": 2131.103,
    "text": " have similarities and differences such that you can lay them out in a graphically or visually similar way, yet there's also some key differences, for example, in what each of the nodes mean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.123,
    "end": 2132.524,
    "text": "So how are they similar and different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.664,
    "end": 2136.987,
    "text": "And what did you hope to illustrate by laying out figure 4.3 this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.289,
    "end": 2149.695,
    "text": " So I suppose the reason that they can be seen as similar is that effectively what you're trying to do in both cases is to represent a trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2150.555,
    "end": 2153.237,
    "text": "We're trying to represent how something evolves in time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2154.238,
    "end": 2163.925,
    "text": "And that something may be the states S in the discrete time, or they may be the trajectory of some hidden states X in the continuous domain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.886,
    "end": 2168.808,
    "text": "And when you're trying to say, how do I actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2169.687,
    "end": 2173.929,
    "text": " put together a set of numbers that tell me how something's evolved or evolving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2175.11,
    "end": 2176.831,
    "text": "There are a couple of different ways you can do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2177.572,
    "end": 2184.215,
    "text": "One is to say, I'm going to tell you where it is at time one, and then I'm going to tell you where it is at time two, and then at time three, et cetera, et cetera.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2185.596,
    "end": 2189.779,
    "text": "And that's a perfectly legitimate and perfectly reasonable way of writing down a trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2190.785,
    "end": 2198.812,
    "text": " It obviously misses out all the times between time one and time two, which may or may not be significant depending upon what the problem is you're dealing with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2204.096,
    "end": 2214.825,
    "text": "The second way that we would approach it is to say, well, you can use what's known as a Taylor series approximation or a Taylor series or a polynomial expression for that trajectory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2216.555,
    "end": 2227.942,
    "text": " So essentially what we're saying there is that you just construct a function that follows the shape of that trajectory over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2228.863,
    "end": 2236.007,
    "text": "And you can construct that function by saying, well, let's look at where I am now at this point in time and my position.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2236.828,
    "end": 2238.048,
    "text": "How am I changing over time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.389,
    "end": 2243.052,
    "text": "If you just took those two variables together, you'd just have a straight line telling you where you are and where you're going to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2244.249,
    "end": 2249.549,
    "text": " If you then take account of your acceleration, you may even have a curved line which says, if I'm here now, I'm going to be there then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2250.892,
    "end": 2268.682,
    "text": " And as you add in more and more elements to this, so the rate of change of the velocity and the rate of change of the rate of change of the velocity, et cetera, and just add in more and more rates of change, you effectively get a more and more precise function telling you, at least locally around where you are now, where you're going to be at various other times.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2270.723,
    "end": 2277.847,
    "text": "So that difference, either using Taylor series coefficients, which are just successive rates of change,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2279.233,
    "end": 2287.095,
    "text": " or by using a sequence of states over time are what's illustrated in the lower and upper graphics here, respectively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2288.695,
    "end": 2298.718,
    "text": "Each of those things has, as you said, they have a lot in common in terms of their structure, in terms of the number of numbers you need to be able to describe them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2300.278,
    "end": 2304.559,
    "text": " but each has their advantages and disadvantages depending upon what you're trying to actually model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2305.92,
    "end": 2324.365,
    "text": "And I think for me, I tend to think of the sequence of categorical states over time as being quite useful in thinking about anything to do with decision-making, deciding between alternatives, thinking about sequences like language and words and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2325.424,
    "end": 2334.248,
    "text": " or even sequences in terms of the eye movements you make, looking in one place, then the next, then the next, rather than continuously moving your eyes around space in a smooth fashion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2335.648,
    "end": 2349.194,
    "text": "Whereas the process of interpreting sensory data that's coming in from your retina or from your stretch receptors or whatever else, or in terms of actually driving action that changes continuous variables in the world,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2350.12,
    "end": 2364.913,
    "text": " There I think it's much more useful to be able to describe things in terms of a continuous number and those sorts of continuous trajectories that you can get through using these Taylor series type approximations, which are often referred to in this context as generalized coordinates of motion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2367.875,
    "end": 2368.195,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.144,
    "end": 2369.384,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.404,
    "end": 2381.899,
    "text": "Well, another figure that we come back to again and again, tucked away in chapter 9, but giving a lot of context, is figure 9.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.994,
    "end": 2407.057,
    "text": " on what is termed meta bayesian inference so could you describe what is happening in this figure and is this exactly as every empirical ethologist is going to agree with is this controversial is this novel so what is it doing for active inference when we conceptualize our",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.178,
    "end": 2419.578,
    "text": " empirical task structurally like this and do you think that that is exactly how ethologists have long seen this topic or is this something contentious",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.171,
    "end": 2432.897,
    "text": " I think, so I'll talk through the figure, but then you can tell me if that's how ethologists traditionally look at it and whether it's contentious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2432.917,
    "end": 2434.078,
    "text": "I'll be interested to hear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2436.04,
    "end": 2451.872,
    "text": "So the idea behind this figure is to highlight that when dealing in psychology or neuroscience or fields where you're trying to understand how a particular system is behaving or how it's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2454.769,
    "end": 2464.954,
    "text": " essentially what's going on in the mind or the brain or the nervous system of some creature that is behaving in some way, there are two levels at which you can look at it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2465.535,
    "end": 2469.437,
    "text": "One is saying, well, from my perspective as the experimenter,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2470.287,
    "end": 2471.609,
    "text": " What are the data I'm measuring?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2471.909,
    "end": 2474.532,
    "text": "And that may be behavioral measurements from that creature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2474.552,
    "end": 2477.656,
    "text": "It may be taking electrophysiological measurements.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2477.976,
    "end": 2483.022,
    "text": "It may be asking it a question if it's a patient in a clinical setting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2484.083,
    "end": 2490.531,
    "text": "And I'm essentially now trying to optimize my model of this system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2491.852,
    "end": 2503.995,
    "text": " Now, in the neurosciences and in the settings outlined above, the kind of system we're interested in is the sort of system that has its own model of other sorts of system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2505.176,
    "end": 2516.939,
    "text": "And so the kinds of questions we're interested in, the kind of parameters we're interested in, are things like the prior belief that this creature has about this thing, or how precise it thinks its data are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.46,
    "end": 2523.961,
    "text": " And so the parameters I'm now asking a question about are the parameters of the beliefs of another system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.662,
    "end": 2542.966,
    "text": "So the outside box here, the one that the parameters are going into, the experimental stimuli are going into, and the observed behavior are coming out of, is essentially my model of how this other system behaves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2544.5,
    "end": 2554.665,
    "text": " Now the inside box here, the one in the dotted line or the dashed line, that now represents the model that that system has to understand the world around it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2556.446,
    "end": 2560.508,
    "text": "And so when we construct our model, that contains another model inside it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2562.149,
    "end": 2568.873,
    "text": "And by saying, if this creature believed this, this is how they would make inferences about their environment and generate behavior,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.46,
    "end": 2574.504,
    "text": " I can now predict the behaviour I would observe if this creature believed this thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.946,
    "end": 2591.917,
    "text": "So the subjective-objective idea is that the objective model is the experimenter and the experimenter's beliefs and the observations they make by measuring what the participant or experimental subject does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2593.055,
    "end": 2599.679,
    "text": " And the subjective model is the participant's model of the world around them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2601.321,
    "end": 2607.445,
    "text": "So that, I think, would be my summary of how this figure works and the idea it's trying to get across.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2608.145,
    "end": 2614.71,
    "text": "Now, you can tell me how ethologists may disagree with that or agree with it or what they'd find controversial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2617.271,
    "end": 2621.134,
    "text": "I'll give a thought, and Ali or Terry, feel free to give a follow-up or a thought about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.617,
    "end": 2628.388,
    "text": " I don't think in principle it's contentious or dissentious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.468,
    "end": 2652.366,
    "text": " However, there might be an explicit or an implicit belief, of course, ironically, that we can simply take some of these parameters coming into our experimental setup and even the selection of experimental stimuli, we can take those as simply given, which is a very frequentist perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2653.067,
    "end": 2657.711,
    "text": "And then on the observed behavior, we can simply use descriptive statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2658.715,
    "end": 2663.598,
    "text": " We'll characterize the predefined groups according to the one experiment we ran.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.998,
    "end": 2664.939,
    "text": "We'll do the t-test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.999,
    "end": 2665.96,
    "text": "We'll do the ANOVA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.52,
    "end": 2667.861,
    "text": "We'll come up with a p-value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.361,
    "end": 2670.282,
    "text": "It's going to be frequentism all the way forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.643,
    "end": 2687.874,
    "text": "So even if we're doing frequentism about a generative model, there's a sense that if we just clamp down on our experiment and treat it as handed down without error, instead of being actually drawn from distributions of possible experiments we could have done,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.326,
    "end": 2700.151,
    "text": " if we clamp down upstream of the experiment, we'll just be able to describe and ultimately publish without needing to look at what else could have happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.311,
    "end": 2709.435,
    "text": "And I think this diagram and also the very subtle dashed line around even the bigger box",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.672,
    "end": 2733.097,
    "text": " suggests that just like the active clinician engaging with a conversation or the active experimenter also engaging iteratively over their system of interest that itself is an adaptive epistemic process where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.144,
    "end": 2750.147,
    "text": " Yes, you could simplify it by treating the parameters and the stimuli sequences as simply given, but then you don't have access to the generative model that actually is the generative process for the subjective model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.727,
    "end": 2764.797,
    "text": " So summarize in principle, uncontentious, however, sometimes discordant with the ways that behavioral experiments are conceptualized, planned, and analyzed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.6,
    "end": 2776.866,
    "text": "One reason why it's helpful because during the book, we try to stay on the road, on the high road and the low road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.326,
    "end": 2780.689,
    "text": "But when we're in discussions,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.219,
    "end": 2802.618,
    "text": " it's almost like there's a whole roadmap and people have their own backgrounds and questions and it kind of comes together with all these different um topics that people are curious about ultimately that bring them to active inference so going to this meta Bayesian figure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.113,
    "end": 2815.715,
    "text": " helps in some ways situate how the authors are seeing this entire process of experimental design, observation, and cognitive modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.395,
    "end": 2822.716,
    "text": "And that was unpacked also in the recent map territory, fallacy, fallacy work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.317,
    "end": 2832.138,
    "text": "Ali or Terry, any thoughts or questions in our last 10 minutes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.893,
    "end": 2857.638,
    "text": " there a figure you want to look at or we can go to some other places uh maybe we can ask uh the missing figure in uh it was in i think it was in figure seven point yes yes or something 7.2 in the lower left",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.892,
    "end": 2868.555,
    "text": " So this was actually corrected by, I don't know quite how it ended up vanishing, but it was corrected in one of the later print versions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2868.595,
    "end": 2872.456,
    "text": "I'll see if it's in the version I've got in front of me now, and I can show you what it would have looked like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2873.537,
    "end": 2874.457,
    "text": "But apologies for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2875.257,
    "end": 2877.738,
    "text": "Which figure is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.758,
    "end": 2878.559,
    "text": "7.2 on page 128.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.599,
    "end": 2884.761,
    "text": "Unfortunately, I picked up a copy of the book that doesn't have it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2886.262,
    "end": 2889.943,
    "text": "So there have already been one and a half fractal dimensions of printing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.048,
    "end": 2893.568,
    "text": " Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2894.229,
    "end": 2900.391,
    "text": "Yeah, I think, unfortunately, I don't think that one's corrected yet in the online copy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2902.111,
    "end": 2913.335,
    "text": "Essentially, what would have appeared in that figure or what did in some of the later printing versions is the errors that are driving the updates of the states in the plot above.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2915.135,
    "end": 2921.077,
    "text": "Now, because the... So the errors here are effectively the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2923.845,
    "end": 2928.387,
    "text": " are the free energy gradients, or the negative free energy gradients.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2929.027,
    "end": 2936.91,
    "text": "So essentially, as you go down the free energy gradient, you're effectively minimizing your error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.317,
    "end": 2947.06,
    "text": " So what that means in practice is that the errors would effectively be the rates of change of the states in the plot above.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2947.7,
    "end": 2955.303,
    "text": "So if you take the states in the plot above and you imagine what the rates of change of each of those lines are, that's what you would get in the plot below.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2956.543,
    "end": 2963.365,
    "text": "Well, on this same kind of topic, in Chapter 7 we're in the discrete time generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2964.266,
    "end": 2964.526,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2965.74,
    "end": 2984.547,
    "text": " little bit less so here but in the uh ladder models here in 7.13 and in what we just looked at in 7.2 where are these continuous interpolations coming from if it's a discrete time model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.049,
    "end": 2986.729,
    "text": " That's a good point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2986.769,
    "end": 2990.512,
    "text": "So I suppose there's an important distinction to be made here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2991.032,
    "end": 2999.057,
    "text": "There's the distinction between the things that are being inferred, which are happening over discrete steps in time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2999.418,
    "end": 3006.082,
    "text": "And then there's the inference process itself, which deals in probabilities, which are themselves continuous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3006.222,
    "end": 3008.784,
    "text": "They can vary, in this case, anywhere between zero and one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3010.405,
    "end": 3014.187,
    "text": "And the time over which that inference happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3015.448,
    "end": 3015.608,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3017.483,
    "end": 3030.966,
    "text": " To give you an example, if you imagine that the way you're analyzing this figure at the moment is by making a series of saccadic eye movements, you're not sort of continuously moving your eyes from one plot to the next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3031.006,
    "end": 3037.927,
    "text": "You're making a series of rapid ballistic movements that take you from one to the next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3039.568,
    "end": 3045.909,
    "text": "And effectively, every time your eyes stand still, you have a new data point that you're now trying to analyze.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.987,
    "end": 3053.829,
    "text": " You can imagine that between that, every time your eyes stay still, everything else in your brain doesn't just stop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.969,
    "end": 3061.291,
    "text": "So once you've got that new data point, your brain now has some time to assimilate that data point, to draw inferences about what it's seeing there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.792,
    "end": 3068.634,
    "text": "And those inferences happen through the continuous dynamics of what's happening in your neurons and various networks across your brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.283,
    "end": 3086.071,
    "text": " So you can think of the continuous changes that are happening for each state as not being changes in the world that we're trying to infer, not being changes in the data point I'm currently looking at, but the changes in my beliefs about it before I then sample the next data point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.575,
    "end": 3092.175,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.457,
    "end": 3102.613,
    "text": " I have a few more figure-based quick questions, but Terry, do you want to bring up anything or just give any remarks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.834,
    "end": 3103.455,
    "text": "No worries if not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.459,
    "end": 3119.366,
    "text": " Well, I am very much just trying to understand these concepts, so I don't make any pretence of having any deep understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3119.766,
    "end": 3134.054,
    "text": "But the key thing that interests me is how you jump from this sense of how we update our predictions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3136.132,
    "end": 3138.053,
    "text": " into the clinical realm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3139.173,
    "end": 3160.519,
    "text": "I'm interested in pain medicine and I see neuroplastic pain as very much a mistaken prediction based on often misinterpretation by medical professionals and the information that they give to patients.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3161.38,
    "end": 3185.036,
    "text": " And I'm really intrigued by the potential for using these concepts to give patients an architecture in which they can start to understand that they have some agency in altering their future predictions and really changing their experience of their pain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3185.896,
    "end": 3189.959,
    "text": "And as your clinician, I'd be really intrigued to see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3190.976,
    "end": 3197.446,
    "text": " get your sense of where this is going in that type of clinical realm?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3200.29,
    "end": 3221.982,
    "text": " I think that's a really nice example as well, thinking about attitudes towards pain and particular kinds of pain, particularly when there isn't a sort of obvious tissue damage that can be identified that's causing that pain, but that still is obviously a very real sensation to the people who are experiencing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3223.709,
    "end": 3227.012,
    "text": " And I think it generalizes to a number of other conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3227.892,
    "end": 3246.244,
    "text": "And probably there's an overlap with things like functional neurological disorders, probably a number of medically unexplained symptoms and things where there is a huge amount of overlap in these sorts of processes where you can't necessarily directly identify a big structural lesion of any sort.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3246.924,
    "end": 3251.387,
    "text": "But clearly the way the nervous system is working, something isn't quite right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3254.623,
    "end": 3260.625,
    "text": " Pain, I think, is an interesting example, particularly because pain is never a real thing out there in the world, is it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3260.665,
    "end": 3262.366,
    "text": "I mean, it's always an inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3263.026,
    "end": 3275.571,
    "text": "And so I think that's one of the first things to say to anybody, you know, regardless of whether you've got pain because you've lost a leg or whatever else, there's no such thing as pain as an external state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3275.831,
    "end": 3278.132,
    "text": "It is just your inference, your explanation for pain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3279.093,
    "end": 3281.495,
    "text": " the signals that are coming in from your body.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3284.279,
    "end": 3291.206,
    "text": "Now, one of the important concepts that I think comes into all of these sorts of syndromes and probably many others as well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3292.219,
    "end": 3312.683,
    "text": " is the idea of precision, the idea that the data I predict, sensory data coming in, I can, in addition to estimating what those data are going to look like, I also have to estimate how confident I am in what they're going to look like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3313.663,
    "end": 3319.104,
    "text": "If I'm not very confident or I think I'm dealing in something that's very noisy, then I can actually discount a lot of that signal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3320.111,
    "end": 3327.393,
    "text": " Whereas if I believe that it's all extremely reliable, very clean data that's coming in, then I want to put a lot of weight on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3328.373,
    "end": 3332.454,
    "text": "And another way of saying that is that there are some things I pay attention to and some things I don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3334.974,
    "end": 3340.275,
    "text": "And just saying it's reliable data is just a matter of saying I'm going to attend to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3341.375,
    "end": 3343.816,
    "text": "Now, it might be that in a number of these different syndromes,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3345.306,
    "end": 3353.768,
    "text": " What's going on is that our bodies have overestimated the precision, overestimated how clean the data are coming in from a particular body part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3355.069,
    "end": 3360.29,
    "text": "And that's why we then over-interpret any signals that are coming in as if they are painful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3361.05,
    "end": 3367.272,
    "text": "And the inferences we draw from those signals are just too confident and too driven by something that they shouldn't be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3369.642,
    "end": 3384.093,
    "text": " An example I often like to use in clinical discussions is that if I told you to pay attention now to the feeling that your left sock is having on your left big toe, you can probably feel it, but you were completely unaware of it before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3384.633,
    "end": 3392.499,
    "text": "But now if I say continue to pay attention to that and carry on paying attention to that and you're unable to pay attention away from it anymore,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.188,
    "end": 3396.329,
    "text": " If you felt that all the time, it would feel unusual, it would feel wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3397.27,
    "end": 3403.232,
    "text": "And maybe a misestimation of precision in that way may be what's going on in a lot of these sorts of conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3405.473,
    "end": 3415.757,
    "text": "Partly, I think it's often interesting that in some of these people, there was at some stage an injury or something that affected that body part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3416.621,
    "end": 3436.058,
    "text": " And you can imagine that if you went through a period of illness where you did have tissue damage and were in pain for that reason, it might direct your attention to that and you may have a learned deployment of attention towards that area that might persist even after the insult and the damage has resolved.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3437.223,
    "end": 3450.793,
    "text": " And again, maybe it's that sort of persistent mislearning of how precise things are that leads to the continued experience of pain even when there's nothing sort of externally causing it anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3451.513,
    "end": 3463.502,
    "text": "So I think just having a sense of inference and the idea that all our perceptions of the world around us are ultimately inferences",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.84,
    "end": 3484.447,
    "text": " says that if we change our model in some way, if we're able to adapt and change and if plasticity in our brains and spinal cords can be exploited, then we can also correct those mislearned models and hopefully resolve those sorts of symptoms and syndromes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3487.728,
    "end": 3488.048,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.864,
    "end": 3513.21,
    "text": " thank you well we are at the very close really appreciative thomas of how much we were able to cover what are your closing words or thoughts potentially to someone who has listened to this one hour discussion as their appetizer before joining the par at all restaurant service",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.626,
    "end": 3519.528,
    "text": " Well, no, I've enjoyed the discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3519.588,
    "end": 3520.549,
    "text": "Thank you for having me here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3524.694,
    "end": 3534.705,
    "text": "I'll reiterate what I said earlier, that I think one of the key things in making this field more accessible to more people are these sort of reading groups, the ideas of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3535.746,
    "end": 3560.067,
    "text": " trying to create these educational resources and to unpack and discuss these things um and you know i'm impressed by all the infrastructure you've put together and um and by everything you've managed to achieve by doing this um so i'd certainly encourage anyone who's interested to join up to your reading groups um and i hope they they get something out of it and out of the book thanks ali",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3562.998,
    "end": 3564.339,
    "text": " Well, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.619,
    "end": 3573.742,
    "text": "Actually, since the beginning of the first cohort, this book has practically become a part of our life that we love and cherish.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3574.422,
    "end": 3583.006,
    "text": "And it's amazing to see how with each iteration of our reading group, it gives rise to a whole different set of questions and discussions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.453,
    "end": 3598.859,
    "text": " Actually, I'm a firm believer in this famous quote, I don't know by whom, which says that the sign of a great book is not how many answers it provides, but rather how many thought-provoking questions it engenders.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.68,
    "end": 3606.723,
    "text": "So based on that criterion and judging by the variety of questions brought up during our live discussions,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3607.202,
    "end": 3614.146,
    "text": " as a kind of empirical evidence for that, I think it's probably safe to say that this is truly a great book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.226,
    "end": 3616.607,
    "text": "So congratulations on that, and thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3617.527,
    "end": 3618.208,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3619.528,
    "end": 3620.589,
    "text": "Great closing thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.649,
    "end": 3622.53,
    "text": "So Thomas, thank you again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.91,
    "end": 3623.991,
    "text": "You're welcome back anytime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.111,
    "end": 3626.972,
    "text": "Thanks, Ali and Terry, for all the great participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.733,
    "end": 3630.594,
    "text": "And until next time, bye.",
    "speaker": "SPEAKER_00"
  }
]