[
  {
    "start": 5.467,
    "end": 15.297,
    "text": " all right hello and welcome everyone this is the active inference live stream i am daniel friedman and this is the active inference live stream 007.0",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.376,
    "end": 20.138,
    "text": " Welcome to Team Calm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.699,
    "end": 27.107,
    "text": "Team Calm is an experiment in online team communication learning and practice related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.768,
    "end": 30.591,
    "text": "You can find us on Twitter at Inference Active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.052,
    "end": 37.2,
    "text": "You can find us at ActiveInference at gmail.com, via our public Keybase team, or on YouTube.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.407,
    "end": 41.348,
    "text": " This is a recorded and archived live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.548,
    "end": 43.949,
    "text": "Please provide us feedback so that we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.45,
    "end": 46.851,
    "text": "All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.511,
    "end": 51.093,
    "text": "Video etiquette for live streams is that you want to mute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 51.473,
    "end": 56.095,
    "text": "If there's any sound in your background, raise your hand if you want to speak so you can be added to the stack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.555,
    "end": 58.036,
    "text": "Use respectful speech, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.336,
    "end": 61.537,
    "text": "Today in Act ImpStream 7.0,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.372,
    "end": 77.799,
    "text": " I am going to try to set the context for 7.1 and 7.2, which is going to be a discussion of the paper Variational Ecology and the Physics of Sentient Systems by Ramsted et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.319,
    "end": 79.66,
    "text": "in Physics of Life Reviews.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.141,
    "end": 88.405,
    "text": "This video, as the other .0s are, is just an introduction to some context, it's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 89.437,
    "end": 96.744,
    "text": " The goal is to provide context for the ideas, philosophical threads, and vocabulary of that Ramsted et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.844,
    "end": 98.585,
    "text": "paper, go through some of their points as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.406,
    "end": 106.352,
    "text": "And the punchline is that ecosystems are multi-scale systems with implications for how we study ecological organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 107.653,
    "end": 112.598,
    "text": "And the sections of 7.0 will be as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.786,
    "end": 138.588,
    "text": " First, we'll go through the keywords and talk about some of the publication context, go through the goals of the paper, the abstract of the paper, and a roadmap of the sections, go through some key quotations, and then talk a little bit about ergodic systems, some critiques of the free energy principle, the simulations and historiosity and how that influences how we think about ecosystems, and also the cog ergo sum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.1,
    "end": 147.288,
    "text": " Then in 7.1 and 7.2, we're going to discuss this paper with whoever wants to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.369,
    "end": 152.535,
    "text": "So you can also save and submit your questions or get in touch with us if you want to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.979,
    "end": 172.165,
    "text": " also and thanks for the suggestion to uh feedback was to how to relate this to previous discussions so if you want previous discussions to listen to that relate to this conversation one would be active in stream two is the free energy principle a formal theory of semantics because this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.765,
    "end": 177.99,
    "text": " discussion and paper was asking, can we use the FEP to study meaningful systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.03,
    "end": 183.935,
    "text": "So both the ones that matter for us, the meaningful systems for us, but then also the meaning making the auto poetic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.14,
    "end": 198.387,
    "text": " Another discussion was 5.0 and the 5.1 and 2 discussions, which are the context for this question about internalism and externalism, which is a question about how and where action and perception occur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 198.487,
    "end": 206.532,
    "text": "Are they internal to an organism or do they occur in this space that's mediated between the external environment and the internal environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.396,
    "end": 224.285,
    "text": " And then also this most recent 6.0 and following discussions where we talked about tail of two densities, active inferences and active inference, because there we talked about how inactive or ecological approaches are broadly linked with computational approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.325,
    "end": 226.326,
    "text": "Like does one have precedence over the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.346,
    "end": 232.689,
    "text": "All right, so there's a lot going on in this variational ecology paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.17,
    "end": 236.572,
    "text": "So we're gonna start here with the keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.481,
    "end": 242.747,
    "text": " So there'll be pages for each of these, but here's the keywords that were on the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.947,
    "end": 243.808,
    "text": "Niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.868,
    "end": 254.76,
    "text": "So niche construction is when some system of interest, like an organism, over developmental or ecological or evolutionary timescales, modifies its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.261,
    "end": 257.683,
    "text": "It's pretty broad and we'll talk more about it in a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.524,
    "end": 259.764,
    "text": " variational ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.424,
    "end": 274.107,
    "text": "They're using variational in a sense here to mean just broadly multi-scale and then akin to the processes of variational Bayesian methods, which are kind of like general multi-scale methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.048,
    "end": 284.77,
    "text": "So they're thinking about ecology from a multi-scale perspective with a sort of flexible computationalist aspect as we've seen from those previous discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.856,
    "end": 291.04,
    "text": " Evolutionary systems theory is basically just evolutionary biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.502,
    "end": 296.885,
    "text": "Probably some people prefer evolutionary biology or evolutionary systems theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.406,
    "end": 300.468,
    "text": "Not exactly sure they're pretty equivalent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.629,
    "end": 308.175,
    "text": "Physics of the mind, we'll have a slide to discuss because there's a few different senses of what physics of the mind entails.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.298,
    "end": 319.985,
    "text": " Free energy principle, of course, one of the keywords here, because that's sort of the big framework or the paradigm that everything is being worked on or responded to under.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.006,
    "end": 327.831,
    "text": "And then variational neuroethology, which we'll talk about more soon, but variational again here is just meaning multi-scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 328.651,
    "end": 331.934,
    "text": "Ethology, no, it's not Ethereum, it's actually behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.754,
    "end": 358.259,
    "text": " and neuro just meaning the neurophysiological component so this is kind of like neuro behavior and thinking about the the cause and effect between the neurophysiological parameters whether they're neural or hormonal and the behavioral outcomes and the collective behavioral outcomes multi-scale all right so let's turn to ecology first here's a quote from the paper they wrote",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.594,
    "end": 363.138,
    "text": " In summary, the niche transcribes regularities that pertain to group behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.339,
    "end": 371.989,
    "text": "They are transcribed in the physical layout of the niche through the active and perceptual dynamics of the agent, which coincides with perceptual and active dynamics of the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.67,
    "end": 376.614,
    "text": "The same dynamics entail the landscape of action possibilities, which are affordances,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.375,
    "end": 380.177,
    "text": " which maintain the structural integrity of the agent needs system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.678,
    "end": 389.605,
    "text": "These dynamics resolve the free energy gradients that are induced by the physical structures of organisms in their niche and their history of dense interaction and dynamic coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.225,
    "end": 397.491,
    "text": "In this sense, the robustness of patterns of shared intentionality and an action of shared meaning is inherited from the robustness of niche and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 398.352,
    "end": 401.634,
    "text": "So to kind of ground this in some other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.737,
    "end": 424.471,
    "text": " more non-fep ecology here's a 2014 paper by deborah gordon and here's two figures that illustrate this point that i'll make which is that there's going to be sort of this hand in glove relationship between the dynamics of the ecosystem and the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 425.831,
    "end": 453.337,
    "text": " resulting collective behavioral and quote individual behavioral algorithms that exist and first off the variational approach or just the multi-scale approach means that it's kind of collective behavior all the way down like inside of that ant on the bottom right there's also a collective of neurons or you know it's just going to be that type of a interactions of different scales all the way down that's sort of the variational realization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.937,
    "end": 462.471,
    "text": " is that it's all going to have to be at least coarse grained at the high and the low end, if not tried to be modeled explicitly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.192,
    "end": 464.194,
    "text": "But we can at least...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.339,
    "end": 474.561,
    "text": " draw a border of analysis around an ant and track it as something that we can identify as a functional component of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.121,
    "end": 481.803,
    "text": "And so in the two figures, there's two examples of axes of ecosystem variability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.163,
    "end": 485.124,
    "text": "So on the right side, figure one, it's patchiness in space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.644,
    "end": 498.292,
    "text": " So in A, where the resource is distributed really evenly across space, then there wouldn't be any type of mass recruitment pheromone because there'd be no reason to bring an ant to where you just got that one little blip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.652,
    "end": 508.217,
    "text": "Whereas under ecological regime B, it would make sense to have something like a recruitment regime because it could be an exploitable resource that might be patchy in space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.498,
    "end": 536.227,
    "text": " uh and you might see ants that could switch different strategies however one ant species may specialize on one or the other in figure two it's an example of a high versus low operating cost environment so when operating costs are high things are tending to be off until they're stimulated on like a fever because operating costs of a fever are high whereas when operating costs are low like for example the maintenance of uh leaf cutter ants under certain conditions in the rainforest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.747,
    "end": 559.195,
    "text": " to maintain territory versus the bioenergetics of moving let's just say under one example that is often brought up here until there's a disruption there's a continuation of function so this is sort of a similar realization to what is described in the paper that there's this statistical co-variation between the collective behavioral algorithms and the niche regularity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.322,
    "end": 570.028,
    "text": " Here is another paper by Professor Gordon in 2011 called The Fusion of Behavioral Ecology and Ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 571.469,
    "end": 575.672,
    "text": "So on the left are just a bunch of animals, a bunch of things that people have studied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.032,
    "end": 582.196,
    "text": "And then ethology, again, is just kind of a funny word that is used by some behavioral biologists, but not all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.316,
    "end": 588.22,
    "text": "But this is kind of an example of the different range of things that people have worked on in that area specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.33,
    "end": 600.853,
    "text": " One cool quote from this paper was, until someone discovers a fossil record for behavior, we can in practice only investigate what are the ecological consequences of a trait now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.294,
    "end": 604.055,
    "text": "That is the evolutionary ecology of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.635,
    "end": 613.238,
    "text": "So we can sometimes see, for example, this, you know, an amber that traps one insect capturing another one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.278,
    "end": 617.459,
    "text": "We can say, okay, this pickup move may have happened one time or it may have been frequent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.139,
    "end": 624.965,
    "text": " but all we have from a behavioral observational perspective are actually the live realizations of today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.346,
    "end": 634.55,
    "text": " And so the implications are that because the local rules of engagement in ecology can change, it appears that selection shifts in space and time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.65,
    "end": 642.893,
    "text": "So we know that selection pressures can go in one direction or have a certain intensity on one trait and then change in a different year or in different time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.493,
    "end": 649.656,
    "text": "This is why a behavioral ecologist who studies the ecology of a trait in one time and place will find the outcomes different than another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.076,
    "end": 654.078,
    "text": "The main project of evolutionary ecology is to understand when and why that happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.265,
    "end": 659.927,
    "text": " The effects of local conditions on species interactions create different ecological pressures in different places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.307,
    "end": 662.428,
    "text": "This produces the spatial mosaic of diversity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.288,
    "end": 669.451,
    "text": "And then another quote there was, context dependence requires us to redefine the project of relating behavior and fitness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.851,
    "end": 674.173,
    "text": "It is not realistic to hope to find any reason why any trait would always be adaptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.753,
    "end": 679.575,
    "text": "Any trait, behavioral or otherwise, is deeply linked to others genetically, developmentally, and functionally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.115,
    "end": 684.477,
    "text": "And if so, if no trait, so no trait has ecological impact independently of all others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.117,
    "end": 695.164,
    "text": " Moreover, even if we can ascertain what variation in certain behavior is associated with variation in reproductive success, changing conditions will still shift around that relation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 695.244,
    "end": 699.567,
    "text": "So that's non-stable or non-stationary fitness landscapes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 700.308,
    "end": 704.551,
    "text": "Adaptive landscapes are full of small bumps, and the behavior itself modifies the landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.598,
    "end": 710.421,
    "text": " If we watch long and carefully enough, we will see different consequences for reproductive success of the same behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.881,
    "end": 718.686,
    "text": "The project then is to learn how conditions determine the ways that behavior contributes to variation in reproductive success.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.706,
    "end": 733.955,
    "text": "So behavioral ecology, already there's the realization that it's important to think about this interplay between features of the organism as a ethological unit, neurobehavioral unit, but also at the ecological and the population scale and the evolutionary scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.555,
    "end": 742.02,
    "text": " A little bit more specific about niche construction, drawing a figure from this paper by Kendall et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.881,
    "end": 751.127,
    "text": "Niche construction is a pretty broad term, and a lot of outcomes and processes can be placed under this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 752.048,
    "end": 759.433,
    "text": "It has to do with the way that organisms modify their niche, and this is almost a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.109,
    "end": 776.723,
    "text": " always going to be the case when you have conspecifics in individuals of the same species, because almost by definition, they're going to be taking up an overlapping set of the canopy elevation in a rainforest or foraging preference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.383,
    "end": 778.704,
    "text": "And so this diagram",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 779.986,
    "end": 802.809,
    "text": " shows how you can have natural selection operating to shape based on instantaneous relative fitness the distribution of the strategies or genotypes and phenotypes on the right this great line coming down here that's genetic inheritance but then also you have the outcomes of collective behavior which are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.47,
    "end": 823.751,
    "text": " influenced by the changes in the genomic and epigenomic and niche and developmental factors and cultural factors then influencing the way that natural selection shapes that and that can be through semantic information or through physical resources like uh you social insect colony so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.941,
    "end": 828.144,
    "text": " One example here of a cool niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 828.284,
    "end": 831.447,
    "text": "This is a clearing in a rainforest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.188,
    "end": 841.596,
    "text": "And the clearing comes from these ants that trim, that live within a specific plant and trim the ground around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.616,
    "end": 844.639,
    "text": "So here's the paper, The Devil to Pay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.659,
    "end": 846.601,
    "text": "A Cost of Mutualism with...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.845,
    "end": 864.174,
    "text": " So, like, this paper is saying there's ecological trade-offs, so it's just, it's representing a different strategy, and there's obviously a reason why these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.109,
    "end": 869.492,
    "text": " Devil's gardens don't just proliferate and sweep across the whole area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.573,
    "end": 872.074,
    "text": "They clearly have limiting factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.154,
    "end": 881.342,
    "text": "So it makes sense to study the bigger context and understand what these limiting factors are and where they break down rather than just say, well, it's just simply a good strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.522,
    "end": 885.245,
    "text": "So it's always going to be about kind of the bigger level of analysis as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.087,
    "end": 890.97,
    "text": " All right, kind of broadening from ecology to ecological psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.87,
    "end": 901.916,
    "text": "This is related to some often human centric, obviously, as psychology might tend to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.018,
    "end": 923.663,
    "text": " modeling of systems around people and we were all children and so there's a developmental aspect there's also these immediate to indirect aspects of our system so there's a multi-scale and a multi-time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.941,
    "end": 953.644,
    "text": " aspect to ecological systems theory and also on the more direct psychological side there's this three-way diagram that comes from a 1976 paper and there's it's sort of like a cycle you have the on starting on the bottom left the schema is what directs action and what action accomplishes exploration what exploration does is it samples what does it sample it samples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.284,
    "end": 981.417,
    "text": " percepts like ocular motor um sampling and stimuli what does that do it modifies your schema what would be identified in the free energy as the internal model and ecological psychology also is where we get the development of ideas like affordances and the fields of affordances the skilled intentionality framework what the organism or system can do and that can reflect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.557,
    "end": 983.357,
    "text": " technology as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.497,
    "end": 986.559,
    "text": "So in our constructed niche, that can be technological embedding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 987.079,
    "end": 996.103,
    "text": "And this image is nice, because it shows the clarity of the phone, the hyper reality of the phone, in relationship to the blurriness of the embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.883,
    "end": 1008.008,
    "text": "And so it captures that what's at hand, what we can act on what we're using for information that can overwhelm our field of performances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.049,
    "end": 1018.111,
    "text": " One term that I definitely had to look up and think about a few ways that it applied was this physics of the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.331,
    "end": 1021.092,
    "text": "I was just like, okay, what is that going to mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.832,
    "end": 1023.833,
    "text": "And I think that there's a few different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.213,
    "end": 1029.294,
    "text": "I'm happy if someone has another way to add or if there's a more specific way to state it, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.427,
    "end": 1041.532,
    "text": " One sense of physics of the mind is that there's a search for lawful rules and simple equations for the mind to make neuroscience in some sense more like some people's conception of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.192,
    "end": 1055.698,
    "text": "So that there'd be laws of motion or an invariance principle or symmetry principle or a relationship with some other physics equation for the mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.955,
    "end": 1077.26,
    "text": " Another branch of physics for the mind is that whether or not it is what the brain really does, that this branch of engineering-oriented analysis of neuro systems would facilitate the development of systems engineering and complex systems and control systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.54,
    "end": 1084.582,
    "text": "So kind of like applied physics being engineering, that's sort of where these micro sensors and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.222,
    "end": 1087.248,
    "text": " brain computing interfaces are at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.448,
    "end": 1089.354,
    "text": "It's at the implied physics level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.219,
    "end": 1092.362,
    "text": "And then another sense of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.51,
    "end": 1102.538,
    "text": " physics of the mind is that there might be some understanding of the physical basis slash substrate of the mind, which is kind of the hard question of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.239,
    "end": 1114.809,
    "text": "And it also relates to questions like soft matter physics and crystals, quantum, microtubules, what kind of, quote, computation is being done in the brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.909,
    "end": 1116.03,
    "text": "What is the brain doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.551,
    "end": 1118.272,
    "text": "These are all kinds of questions that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.233,
    "end": 1146.594,
    "text": " uh is you know is it an antenna or a processor is there is it which metaphors and which aspects of them are instructive in that regard and the big question oh sorry that all of these senses of physics the mind are getting at is can because the mind is explicitly a metaphysical thing as opposed to the brain is can metaphysics join with multi-scale systems neuroscience physics molecular genetics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.16,
    "end": 1149.621,
    "text": " evolutionary ecology, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.423,
    "end": 1159.809,
    "text": "Then they mention in the title that it's a variational ecology physics of sentient systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.41,
    "end": 1161.951,
    "text": "So what are sentient systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.051,
    "end": 1163.992,
    "text": "Because initially I think I had the wrong...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.938,
    "end": 1165.478,
    "text": " reading here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.279,
    "end": 1174.805,
    "text": "So VNE and the VANC, which we're going to get to in a second, are about enabling the application of the FEP to phenomena within and beyond the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.086,
    "end": 1181.611,
    "text": "These approaches hold the promise of extending the variational free energy approach to the dynamics of sentient systems, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.171,
    "end": 1185.233,
    "text": "systems with sensory states across spatial and temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.694,
    "end": 1191.098,
    "text": "So this is not a paper or a discussion on consciousness or awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.678,
    "end": 1203.963,
    "text": " this is going to be about emergence in multi-scale biosystems, which is pretty compatibilist with either interpretation, but this sentient, that doesn't mean awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.083,
    "end": 1205.564,
    "text": "It's not about tearing tests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.184,
    "end": 1207.805,
    "text": "It's about sense systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.905,
    "end": 1218.389,
    "text": "So this is about being able to model simpler sensing systems, you know, thermometers and that type of control system in a very simple way, but also more nuanced systems like sensors,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.889,
    "end": 1231.655,
    "text": " other organisms in a more uh rich way all right so how do we get here what is the literature context for this variational ecology paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.56,
    "end": 1244.01,
    "text": " The FEP has recently been leveraged to furnish a fully generalizable meta-theory for adaptive behavior in sentient systems across spatial and temporal scales called Variational Neuro-Othology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.791,
    "end": 1250.315,
    "text": "So let's talk about what is VNE because this paper is going to reference it a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1250.796,
    "end": 1255.039,
    "text": "What is VNE and what scales or types of phenomena does it model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.74,
    "end": 1265.69,
    "text": " So we're going to get to VE, variational ecology, via VNE, variational neuroethology, by contextualizing within a critique that leads to this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.651,
    "end": 1272.096,
    "text": "So, in PhysLifeReview 2018, there's a paper by Ramstead et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.237,
    "end": 1274.599,
    "text": "answering Schrodinger's question, which is, what is life?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.619,
    "end": 1274.599,
    "text": "1944."
  },
  {
    "start": 1274.839,
    "end": 1275.5,
    "text": "A free life formulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.803,
    "end": 1294.525,
    "text": " Now that paper led to a bunch of responses, which led to the clarification on some of these responses and sort of the drawing out of this variational neuroethological approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.986,
    "end": 1314.014,
    "text": " And one quote that arises from the paper, the Schrodinger's paper, was, given the success of this explanatory framework in biology, we suggest that Tinbergen's levels of inquiry might be apt to elucidate structural laws that supplement the general principles provided by the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.074,
    "end": 1328.76,
    "text": " The FEP describes a general biological modeling imperative, while Tinbergen has offered a distinctive but complementary framework that allows us to develop substantive explanations for the phenotypic traits and behaviors of any given species or organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.46,
    "end": 1335.822,
    "text": "And so here is the 1963 paper by Tinbergen and then a 50 years update by Bateson and Lalonde.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.683,
    "end": 1344.186,
    "text": "And we talked about this in one of the previous discussions, but this is a two by two grid that represents Tinbergen's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.046,
    "end": 1361.856,
    "text": " for quote wise it's kind of like aristotle's four wise it's about having multiple different kinds of explanation that are at different types and different scales of analysis so the historical how is how did this organism get here is development",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.476,
    "end": 1365.017,
    "text": " And how did it get here in the very short term?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.077,
    "end": 1367.378,
    "text": "The contemporary how is like the ultimate mechanism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.439,
    "end": 1368.179,
    "text": "How did my arm get here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.219,
    "end": 1369.54,
    "text": "Because it moved from this other place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.06,
    "end": 1374.782,
    "text": "Ultimately, or a little bit more historically, but approximately, it got here because it was an arm bud.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.422,
    "end": 1377.743,
    "text": "And then the contemporary why is the function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.044,
    "end": 1379.624,
    "text": "Like what does the thing do right now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.684,
    "end": 1382.386,
    "text": "Just at this moment, like why is there a mouse on my desk so I can use it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.166,
    "end": 1386.088,
    "text": " And then historically, why is there a mouse on my desk?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.428,
    "end": 1389.71,
    "text": "Why is it as opposed to not using a desk or not using a mouse?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.11,
    "end": 1391.611,
    "text": "Because of evolutionary processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.691,
    "end": 1393.853,
    "text": "So that's a little bit of a broader level question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.353,
    "end": 1408.041,
    "text": "So that kind of compatibilism amongst answers is going to be complemented by a way to specifically connect multiple levels through potentially even more formal or...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.202,
    "end": 1428.756,
    "text": " uh modeled or testable ways of thinking about the relationship between these four categories thus constituting you know a complete answer at least within this fourfold framework that's been very helpful so that is where variational ecology comes in and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.986,
    "end": 1446.764,
    "text": " we're going to talk about it in the context of building on vne and what that is too so the paper is variational ecology and the physics of sentient systems in physics of life review 2019. ramsted constant badcock and friston so the goal of the paper and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.822,
    "end": 1450.764,
    "text": " Again, we're going to return back to these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.304,
    "end": 1467.595,
    "text": "Specifically, we review a framework for modeling complex adaptive systems for multi-scale free energy bounding organism niche dynamics, thereby integrating the modeling strategies and heuristics of variational neuroethology, VNE, with a broader perspective on the ecological nestedness of biotic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.256,
    "end": 1472.659,
    "text": "We extend VNE beyond the action perception loops of individual organisms, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.799,
    "end": 1477.022,
    "text": "active inference, by appealing to the variational approach to niche construction, VANC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1478.042,
    "end": 1482.443,
    "text": " to explain the dynamics of coupled systems constituted by organisms and their ecological niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.144,
    "end": 1494.507,
    "text": "So the big question is how can we make a multi-scale ecology framework that builds upon eco evo devo and also adds insights from physics and mathematics and complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.215,
    "end": 1497.495,
    "text": " So first part of the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.716,
    "end": 1506.438,
    "text": "This paper addresses the challenges faced by multi-scale formulations of the variational or free energy approach to dynamics that obtain for large scale ensembles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.139,
    "end": 1522.744,
    "text": "We review a framework for modeling complex adaptive control systems for multi-scale free energy bounding organism niche dynamics, thereby integrating the modeling strategies and heuristics of variational neuroethology with a broader perspective on the ecological nestedness of biotic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.544,
    "end": 1532.073,
    "text": " So as stated in the second part here, it's going to be a framework, which is theory plus tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.734,
    "end": 1537.96,
    "text": "That's going to be about modeling complex adaptive systems as control systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.62,
    "end": 1539.842,
    "text": "What are they going to be controlling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.242,
    "end": 1543.245,
    "text": "Something about the free energy boundedness of their systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.946,
    "end": 1567.411,
    "text": " own interactions with their niche so rather than just thinking about how the physiological or the neuro aspects are related to constraints on behavior it's now also about behavior looking up we extend the multi-scale variational formulation beyond the action perception loop of individual organisms by appealing to the variational approach to niche construction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.413,
    "end": 1572.776,
    "text": " to explain the dynamics of coupled systems constituted by organisms and their ecological niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.617,
    "end": 1582.564,
    "text": "We suggest that the statistical robustness of living systems is inherited in part from their eco-niche as niches help coordinate dynamical patterns across larger spatial temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.184,
    "end": 1585.887,
    "text": "We call this approach Variational Neurothology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.647,
    "end": 1602.003,
    "text": " We argue that when applied to cultural animals such as humans, variational ecology enables us to formulate not just a physics of individual minds, but also a physics of interacting minds across spatial temporal scales, a physics of sentient systems that range from cells to society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.804,
    "end": 1604.585,
    "text": "So briefly, here's the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.046,
    "end": 1606.507,
    "text": "Section zero is the introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.639,
    "end": 1617.065,
    "text": " They first talk about the variational or free energy formulation and specifically about how active inference models and generative models are related to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.105,
    "end": 1621.347,
    "text": "We're not gonna go through the figures in this discussion though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.427,
    "end": 1634.415,
    "text": "The second part of the paper is about variational neuro-orthology, which is about how ensembles of Markov blankets underlying the organismal level facilitate the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.147,
    "end": 1652.971,
    "text": " organism niche environment that was sort of the neuroethology level of analysis then they take that sort of organism upwards view of niche construction with variational approach to niche construction in the ontology of affordances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.758,
    "end": 1667.106,
    "text": " and reach the variational ecology, which is really just connecting these two at the organism and just making it a multi-scale ecology and then subsuming the behavioral component within it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.189,
    "end": 1671.449,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.01,
    "end": 1679.975,
    "text": "So to get to variational neuroethology, especially if this is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.33,
    "end": 1705.809,
    "text": " new learning about active inference and how it relates to other areas in neurobiology some of the comments about variational neurothology from other um authors in response to the articles and just points and comments that are really sometimes uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.792,
    "end": 1710.615,
    "text": " parent, other times not in the literature, but areas for improvement in theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.195,
    "end": 1722.924,
    "text": "One thing that's cool about the active inference area is it really draws people back to these fundamental questions that really were long-term about top-down or bottom-up forces, for example, in ecology or behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1723.445,
    "end": 1723.765,
    "text": "Different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.667,
    "end": 1748.756,
    "text": " you know role of condition of historicity ergodicity these are long time debates but now coming into this new area where we can at least address them head-on so let's think about that perspective and i'm trying to uh think about how coming from a regular behavioral sciences perspective this might play so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.117,
    "end": 1765.29,
    "text": " Could this reflect a fundamental distinction between the free energy principle as an explanatory principle for the clearly bounded ergodic biological systems and the greater complementary forces at play that constrain complex adaptive systems in general, including groups of organisms in their ecological niche?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.691,
    "end": 1774.598,
    "text": "Should we restrict the FEP to level the organism and explore how the model connects meaningfully to other key concepts in evolutionary systems theory about the agent-need relation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.279,
    "end": 1784.566,
    "text": " So that's restating the question whether the FEP for some reason would stop applying at the level of the organism and then it would break down at higher levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.267,
    "end": 1798.697,
    "text": "The aim of this paper is that they're going to address the challenges, these comments that people brought up about the VNE by addressing how it sits within broader level questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.317,
    "end": 1800.698,
    "text": "And so there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.636,
    "end": 1807.563,
    "text": " things that the field of behavioral sciences has also been thinking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1807.843,
    "end": 1814.31,
    "text": "For example, you can watch one bird's behavior, it's what you're gonna be tracking, but then it's gonna be related to everyone's behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.35,
    "end": 1817.374,
    "text": "So at some point it's gonna be like studying collective behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1818.826,
    "end": 1834.14,
    "text": " So what they're going to do is add the variational neuroethology, which is the multi-scale plus the neuro plus the behavior plus this niche instruction just to additively create this variational ecology, new acronym, new PAPE, why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.711,
    "end": 1850.985,
    "text": " by putting together ensemble dynamics or collective behavior, eco, evo, devo and niche construction, complex systems, free energy principle, multi-scale systems and active inference and nestedness and embeddedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.866,
    "end": 1856.89,
    "text": "And then kind of just think about how it could apply to systems that persist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.802,
    "end": 1870.095,
    "text": " Far from equilibrium within this flow state valley of things that are small and fast on the bottom left to big and broad geospatially on the top right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.016,
    "end": 1873.979,
    "text": "But we won't go through the figures in this talk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1875.961,
    "end": 1876.342,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1878.581,
    "end": 1882.965,
    "text": " To date, VNE has, this is before this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.445,
    "end": 1892.393,
    "text": "To date, VNE has only provided a principled method of analyzing nested and mutually constraining biological systems and their complex adaptive dynamics across spatial temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.194,
    "end": 1903.443,
    "text": "It has yet to offer a way to individuate systems at scales beyond that of the organism acting in its environment, large scale ensembles such as societies or ecosystems that realize free energy bounding dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1903.963,
    "end": 1905.505,
    "text": "But of course, part of the question is, do they?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1906.789,
    "end": 1916.714,
    "text": " And so VNE was really a theory that was about the organism and the ecosystem from the perspective and the focus of the organism's dynamics in the immediate environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.855,
    "end": 1931.523,
    "text": "For example, affordances, even if those affordances were subtle or relied upon this skilled intentionality or like, you know, learned behavior or sophisticated counterfactuals, all these things that especially more recently have been receiving focus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.483,
    "end": 1943.295,
    "text": " This did not articulate clearly or at least had not been specified specifically that it was linked with a collective behavioral or ecological or cultural phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.508,
    "end": 1965.481,
    "text": " which is as much a phenotype it's as much biological as an organism level trait like arm length or genome composition there just isn't a difference between a bio cultural versus bio in this variational framework it's just different scales different mechanisms but it's not even about categorizing different things it's about how you model them and what they are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.883,
    "end": 1988.011,
    "text": " So the variational neuroethology was a more clearer downwards projection about how things like behavioral and hormonal and neural timescales, developmental timescales, were related to organism behavior, which is physiology, neuroethology, but the eco, evo, devo was less clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.718,
    "end": 1997.381,
    "text": " The issue was cogently articulated by Breuenberg and Hess and Kiermaier in their critique of variational neurothrology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.761,
    "end": 2006.964,
    "text": "They asked also whether the Markov blanket and B-formalism leveraged by the VNE to individuate systems is adequate for modeling phenomena at the scales beyond that of a single organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.564,
    "end": 2023.499,
    "text": " like sociocultural dynamics, since phenomena at these scales may be too transient or not sufficiently robust to license the MB, markup blanket, formalism, which is defined in terms of conditional independencies in weakly mixing random dynamical systems, which we'll also get back to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.459,
    "end": 2030.144,
    "text": "But BHK catalyzed this perspective, and this is going to be broken up into a few different sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2031.013,
    "end": 2044.083,
    "text": " Markov blankets, so open parentheses, Markov blankets are the statistical, using their words, conditional independencies, which is kind of like saying that it's the opposite of the causal relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.783,
    "end": 2050.888,
    "text": "And so it's equivalent to finding the causal relationships through their violation of the independence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.108,
    "end": 2054.35,
    "text": "So finding which variables are insolatable from each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.555,
    "end": 2071.959,
    "text": " In a sense, if you think about what kind of information from a generative model you need to understand which variables are conditionally independent or just sort of straightforwardly correlated, that's often related to causal state estimation about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.68,
    "end": 2093.295,
    "text": " that Markov blankets are unable to explain slash predict slash control ecosystems and other collective behaviors, quote, quote, even though it's collective behavior all the way down at scale, because the Markov blankets are not robust enough to capture transient or historical phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.191,
    "end": 2111.556,
    "text": " So to go to the paper, they only worked through one example in the paper, which was how this hierarchically mechanistic mind evolutionary systems theory can be used within that VNE framework to study the scales of human sociobiocultural evolution in humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2112.136,
    "end": 2117.678,
    "text": "And there was this table provided with some pretty simple slash just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2119.186,
    "end": 2126.766,
    "text": " one-line equations about how different levels of analysis would be modeled, but there was a critique, which was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.799,
    "end": 2149.911,
    "text": " This downplays a lot of features of ecology, and the formalisms that apply to strongly sensorily or strategically bounded systems or certain spatial or temporal timescales may only be weakly explanatory or valid at different timescales for a number of reasons, which is something that we're going to return to when we talk about the ergodic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.324,
    "end": 2154.764,
    "text": " So here's kind of a theory tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.465,
    "end": 2158.285,
    "text": "The FEP is on the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.445,
    "end": 2167.767,
    "text": "It's sort of the paradigm level foundation because that's where we're going to try to make things emanate from and to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.267,
    "end": 2172.307,
    "text": "But again, we could just think about what would be the effect of switching that out too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.527,
    "end": 2172.807,
    "text": "Why not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.828,
    "end": 2181.509,
    "text": "From left to right, we have active inference, Tinbergen's four questions, evolutionary systems theory, and then eco, evo, devo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.012,
    "end": 2201.115,
    "text": " So variational neuroethology is like Tinbergen's four questions, which was what we heard the quote about, with an evolutionary perspective, but a simple, at least a sketch of one, and then more of an emphasis on active inference and on smaller scales of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2202.196,
    "end": 2218.98,
    "text": " The variational approach to niche construction, VANC, was also drawing on the evolutionary and the pluralist Tinbergen framework, but drew a little bit more from the eco, evo, devo, and active inference side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2220.461,
    "end": 2221.481,
    "text": "It has that orange one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.92,
    "end": 2237.171,
    "text": " And where VE comes into play is with bringing in this synergetics idea from the variational approach and also the collective behavioral approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.311,
    "end": 2246.298,
    "text": "And then just, again, making a new acronym kind of more specifically combining previous acronyms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.191,
    "end": 2268.878,
    "text": " I think it's worth unpacking, it's worth tracing out some of these relationships and just seeing what parts get subsumed into what, but VE is just, it's just a more high resolution area where mapping can now be performed across these different domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.239,
    "end": 2270.659,
    "text": "So it's kind of like a mapping domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.32,
    "end": 2275.781,
    "text": "So here's some of the specific parts where they talk about that kind of a mapping domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.353,
    "end": 2299.442,
    "text": " this multi-scale framework active inference is inherently a group activity that is the entire ensemble of nested markov blankets are bound enslaved and constrained by dynamics at higher scales while the lower microscopic scales furnish the macroscopic states at any given level this construction evinces exactly the same circular causality that underlies synergetics hakan not fuller",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.262,
    "end": 2305.511,
    "text": " However, here it is generalized to a recursive hierarchy of scales, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.551,
    "end": 2308.035,
    "text": "the hierarchical composition of blankets of blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2308.888,
    "end": 2311.289,
    "text": " Intuitively, the dynamics at one scale provide constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.369,
    "end": 2315.07,
    "text": "Technically, they establish probability gradients on dynamics at other scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.67,
    "end": 2322.311,
    "text": "Active inference destroys free energy gradients at each scale under the guidance or control of a generative model at the scale above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.051,
    "end": 2337.375,
    "text": "This guidance is exerted through influences on sensory states where circular causality means that the action of any Markov blanket in an ensemble of Markov blankets could be involved in sensing, action, or perception depending upon its role at the superordinate scale",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.055,
    "end": 2338.215,
    "text": " i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2338.315,
    "end": 2341.656,
    "text": "it has a sensory active or internal state at the level above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.736,
    "end": 2363.702,
    "text": "So it's this kind of Bayes all the way up and down approach that they're proposing that from the level of the organism can go downwards into the cellular, the neuro, and all this level, and through time, through the evolutionary, through the Tinbergen quadrants, and then also outwards through niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.939,
    "end": 2379.291,
    "text": " In the multi-scale setting, an effective state at any scale, like let's just think of our temperature, becomes the expression of an eigenmode of blanket states, namely the principal eigenvectors of the Jacobian, the rate of change of flow with respect to state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.506,
    "end": 2387.612,
    "text": " These mixtures are formally identical to order parameters and synergetics that reflect the amplitude of slow or unstable eigenmodes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.172,
    "end": 2393.297,
    "text": "In terms of center manifold theory, they correspond to solutions on the slow, unstable, or center manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2394.017,
    "end": 2402.344,
    "text": "In short, the Markov blanket of a system or particle at any scale constitutes an ensemble whose order parameters subtend blanket or internal states the scale above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.825,
    "end": 2403.245,
    "text": "So that's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.544,
    "end": 2419.891,
    "text": " The temperature being above equilibrium with the room is because it's part of a sort of closed or semi-closed regulatory system that's keeping molecules that are in one part of the room, constituting my body, a different temperature than the rest of the room.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.131,
    "end": 2430.475,
    "text": "Note that the constituent microscopic states of an ensemble are always blanket states, although their order parameters could be blanket states or internal states at the microscopic scale above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.474,
    "end": 2443.184,
    "text": " So a neuron could be sheathing something from a temperature perspective from one side, but receiving information in a different conceptualization of the blanket network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.145,
    "end": 2450.65,
    "text": "This follows from the fact that the only states that matter are those that influence other blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.35,
    "end": 2457.235,
    "text": "Effectively, all we are doing here is applying the enslaving principle or center manifold theorem recursively to Markov blankets of Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.562,
    "end": 2467.347,
    "text": " Imagine you are an employee at an institution where you transact your microscopic affairs with other personnel to self-evidence your prior belief that you are good at your job.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.788,
    "end": 2471.57,
    "text": "This would entail responding to corporate or institutional goals that emerge collectively, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2472.01,
    "end": 2474.292,
    "text": "an implicit generative model at the macroscopic level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.253,
    "end": 2481.076,
    "text": "Note that your job may be homologous to an internal state at the institutional macroscopic level relating only to other employees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.577,
    "end": 2484.599,
    "text": "Alternatively, you could be working on reception, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2484.659,
    "end": 2487.221,
    "text": "a sensory state, or issuing press releases, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.301,
    "end": 2487.861,
    "text": "an active state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.739,
    "end": 2512.758,
    "text": " And this is actually an image from a paper that TeamCom wrote on 992020 and one of the figures, and it was about how remote teams and a lot of other kinds of groups that might not be traditionally considered remote teams can be explicitly mapped and from systems engineering perspective modeled",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.459,
    "end": 2516.122,
    "text": " as this nested Markov blanket framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.602,
    "end": 2522.589,
    "text": "And so you have, for example, the team members who have their own digital interfaces, their own sensory and active states digitally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.51,
    "end": 2526.854,
    "text": "Some of these team members can be augmented or can be bots themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.294,
    "end": 2532.761,
    "text": "And they're interacting with certain databases and then they're able to also undertake team operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.844,
    "end": 2539.227,
    "text": " This is where the variational approach to niche construction comes in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.908,
    "end": 2551.437,
    "text": "VANC exploits the expression of expected free energy as expected cost plus ambiguity to propose that agents upload, as it were, much of the legwork in computing expected free energy to their self-tailored constructed environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.037,
    "end": 2566.067,
    "text": " More precisely, it argues that niche construction can be cast as the collective activity by which organisms act on their material environment to create unambiguous structure, which can then be leveraged via active inference, like creating books so then people can scan their eyes over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.887,
    "end": 2573.852,
    "text": "Lasting changes to the niche capture the fact that environmental cues function as an unambiguous indicator of the affordance of action possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.392,
    "end": 2588.68,
    "text": " Like, if you're culturally sensitized, you know what a book looks like, you know what it's for, you know that if you scan through the first three pages with your eyes and it's culturally specific, whether the first pages are going to be on this side of the book or on this side of the book or whether the text will read this way or this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.34,
    "end": 2602.446,
    "text": " This structure can be cast in terms of epistemic resources that flag the actions that resolve the ambiguity associated with future observations while conforming to the prior preferences of the organism entailed by its generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2602.966,
    "end": 2616.612,
    "text": "So you're in the library, you're doing some optimal foraging for a book about a certain topic, and you expect that there's a certain structural organization to the books, and that if you find something where it's written on the back of the book that you think it's the book it is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.992,
    "end": 2637.666,
    "text": " you expect that the title page is going to conform with that so these are like epistemic resources that are more visible more scannable that's what allows that information to be found and therefore leveraged so that's niche construction in terms of direct epistemic resources but you can also think about in cases like social insects where they're extended niche their nest",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.406,
    "end": 2667.111,
    "text": " is something that they pass on potentially even intergenerationally and that the structure and the form of the function are all linked through their collective behavioral algorithms with the architecture influencing their behavioral uh proclivities and there's some interesting work by professor pincer woman on that in the harvester ants um then that physical structure becomes a epistemic resource as well in that it becomes part of their extended cognition all right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2668.203,
    "end": 2684.839,
    "text": " so for this last section of section 007 of the live stream my friend sean had a great question and so for this last section it will be a little bit about ergodic systems and as with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.155,
    "end": 2689.496,
    "text": " You know, all other areas of this sort of discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.296,
    "end": 2693.918,
    "text": "It's it's a playful and it's a partial recap of the idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.018,
    "end": 2698.8,
    "text": "So if someone knows more, I would love to go deeper into some of these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.86,
    "end": 2702.261,
    "text": "I just kind of laid it out in a way that hopefully might",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.941,
    "end": 2709.385,
    "text": " relate to an informative way to onboard onto thinking about things from an active inference perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.745,
    "end": 2715.828,
    "text": "And there's definitely perspectives on YouTube and elsewhere that are a lot more rigorous and comprehensive than what I'm about to go through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.288,
    "end": 2722.592,
    "text": "But this is gonna be a couple minutes on linking ecology, which is what we're trying to explain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.012,
    "end": 2748.207,
    "text": " we're not just trying to make theory after theory we really want to return to the ecology and make variational ecology a theory about ecology that allows us to do the things that we want to do in ecology whether that's conservation or just understanding so many other things that ecology can teach us but we're also going to talk about ergodicity about cog ergo sum and of course active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.375,
    "end": 2758.606,
    "text": " All right, so what Sean asked was, are thinking beings or their environments weakly mixing ergodic systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.067,
    "end": 2763.593,
    "text": "If not, do they fulfill some of the assumptions or axioms of the mathematics underlying the FEP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.434,
    "end": 2767.658,
    "text": "So this was kind of a great question by Sean because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.133,
    "end": 2772.814,
    "text": " It really came at a perfect time when I was preparing these slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.554,
    "end": 2795.741,
    "text": "And if we go back to the critique slide where the variational neurothology was being presented, remember it was that there was the critique of the VNE that got us to the V, the response to that, that got us to the VE, as far as connecting the organism down with the VNE, with the organism up with the niche construction, just,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.661,
    "end": 2801.106,
    "text": " connecting the two points into a line and calling that variational oncology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.987,
    "end": 2810.956,
    "text": "And the critique was that there was gonna be some violation of some of the lower level sensory coherence of say an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.066,
    "end": 2828.751,
    "text": " that because of that it wouldn't that the same formalisms wouldn't apply and so this is someone coming from a more like thermostatistics um background and seeing a very similar phrasing a different way and just asking a really interesting related question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.691,
    "end": 2833.673,
    "text": " And as he put it, the argument of the free energy principle is two parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.093,
    "end": 2842.777,
    "text": "The first calls on the lawful dynamics of any weakly mixing, aka orgotic system that persists in a changing environment from a single cell organism to a human brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.093,
    "end": 2851.638,
    "text": " These lawful dynamics suggest that internal states can be interpreted as modeling or predicting external causes of sensory perturbations, a.k.a.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.738,
    "end": 2855.401,
    "text": "embodying and acting a generative model of adaptive policies and phenotypes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.621,
    "end": 2861.705,
    "text": "In other words, if a system exists, its internal states encode probabilistic beliefs about external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.186,
    "end": 2864.187,
    "text": "And so when I read that, you know, I didn't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.227,
    "end": 2867.87,
    "text": "It's like, is he summing that up as like the insight, as like the final...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.51,
    "end": 2890.918,
    "text": " the distillation of something that he finds deeply true or is he bringing this up as sort of a well that's a tautology that's a circular logic or that's an argument that holds nowhere so i i didn't know but uh it turns out that there is a paper from 2015 called i am therefore i think so um this last little part is going to be about that paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.658,
    "end": 2910.553,
    "text": " which I hope will be interesting whether you're familiar with these ideas or not, but also with some of the mathematics behind the ergodicity and about why there's still significant reason to understand how ergodic systems and non-ergodic systems are related to the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.621,
    "end": 2915.984,
    "text": " So I am therefore I think is kind of related to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.004,
    "end": 2919.607,
    "text": "I think therefore I am call Gary go some but of course it's just a meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.747,
    "end": 2921.548,
    "text": "So here's a few other versions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.149,
    "end": 2930.355,
    "text": "I think therefore I am not here or a comic where it says I think therefore I am and then the other person is I don't therefore I'm not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.117,
    "end": 2935.381,
    "text": " And also the cogito ergo sum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.302,
    "end": 2937.284,
    "text": "I think therefore I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2937.304,
    "end": 2939.306,
    "text": "I think therefore I overthink.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.547,
    "end": 2941.189,
    "text": "I think therefore I regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.209,
    "end": 2943.071,
    "text": "I think therefore someday I won't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.812,
    "end": 2945.594,
    "text": "So all these different implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.654,
    "end": 2947.436,
    "text": "What are the real implications?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.476,
    "end": 2949.799,
    "text": "What logic can we make claims about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.181,
    "end": 2952.743,
    "text": " That's not exactly what this is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.223,
    "end": 2960.871,
    "text": "This is going to be about two kinds of systems, which are ergodic systems or ergodic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.551,
    "end": 2971.481,
    "text": "And this isn't something that's a hyper abstract, but it definitely does recall a lot of generalizable principles in math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.981,
    "end": 2975.064,
    "text": "So to make it very specific and empirical,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.825,
    "end": 2978.928,
    "text": " we're going to discuss it in terms of the ergodic hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2979.529,
    "end": 2982.311,
    "text": "So it's a specific hypothesis that we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.712,
    "end": 2984.313,
    "text": "That means it's something we're going to test with data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.894,
    "end": 2990.94,
    "text": "And the hypothesis is we hypothesize that mixing through space is like mixing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.76,
    "end": 2997.126,
    "text": "And let's talk a little bit more about that because it's kind of a wild and interesting idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.697,
    "end": 3002.9,
    "text": " So the first thing to know is that it's a hypothesis, this ergodic hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.4,
    "end": 3008.123,
    "text": "It's not the ergodic law or the ergodic pattern or anything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.744,
    "end": 3023.193,
    "text": "It's a hypothesis that can be tested using data and statistical models that are transparent and reproducible and just open to understanding how changes in their parameters influence the kind of conclusions that are reached.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.494,
    "end": 3027.957,
    "text": "So that's something about what we're discussing here with the ergodic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.298,
    "end": 3035.122,
    "text": " Also, the ergodic hypothesis depends on the spatial and temporal scale, and then also the measurement or the analysis space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.463,
    "end": 3042.789,
    "text": "And potentially this comes into play a lot more when you're really getting down into the weeds of the math or the application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.209,
    "end": 3052.237,
    "text": "But often the way that you measure something or which sections of the time series you allow for burn-in, for example, or mixing, these things are all really critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.297,
    "end": 3056.12,
    "text": "And what scale, whether you're looking at a tiny, tiny, tiny",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.58,
    "end": 3066.94,
    "text": " cube and seeing if there's random association between chemical particles for example versus looking at a one meter cubed uh blocking of the world so the coarse graining matters a lot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.861,
    "end": 3079.129,
    "text": " Now, ecology and history are often strongly critical of applications of ergodic methods or the methods that often are used to model ergodic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.689,
    "end": 3090.937,
    "text": "So first let's talk about the ergodic hypothesis and what it actually says and does, and then talk about some ecological critique of it, and then see how the cog ergo sum comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.878,
    "end": 3097.122,
    "text": "All right, so the ergodic hypothesis is defined by the time average",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.337,
    "end": 3101.659,
    "text": " being equal to the space average.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.4,
    "end": 3107.664,
    "text": "So that is, again, this sort of mixing through space is like mixing through time idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3107.684,
    "end": 3118.591,
    "text": "And one way to think about it is like, if you have a box with a gas in it, and you're gonna trace one molecule and take snapshots of it at 100 times,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.225,
    "end": 3149.617,
    "text": " would its trajectory in some statistical way be similar to if you just selected 100 particles in the box at the same time or if you let loose one molecule bounce 100 times by itself all these different ways of asking it but it kind of relates like is it basically fair to sample you know one roulette table through time or 100 roulette tables at the same time every roulette spin is like the same so in in it's very different than um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.798,
    "end": 3158.303,
    "text": " something where the strategies evolve through time, for example, you might already even be seeing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.804,
    "end": 3168.03,
    "text": "And one more slide of just the definition is that there's this generation of an ensemble.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.07,
    "end": 3176.576,
    "text": "So that's sort of already for saging this ensemble group selection dynamic versus the time elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.607,
    "end": 3182.926,
    "text": " And this paper was very interesting that I found while preparing for this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.833,
    "end": 3212.648,
    "text": " stream and i'll just go through it because i think it's also a really cool story about philosophy of science and about how the way that we think about different hypotheses and axioms and principles really influences the kind of science that we do so it's called from the ergodic hypothesis in physics to the ergodic axiom in economics by kirsten 2015. so the the work is summarized as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.663,
    "end": 3223.452,
    "text": " This contribution seeks to clarify the specific relation between the idea of non-ergodicity, which is drawn from statistical mechanics, and its role in and for economics and finance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.073,
    "end": 3229.839,
    "text": "The identified change of status is how the ergodic hypothesis in physics became the ergodic axiom in economics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3230.419,
    "end": 3237.906,
    "text": "Therefore, we follow the idea from rational mechanics of Gibbs to Samuelson and eventually from the latter into rational economics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.627,
    "end": 3248.114,
    "text": " The methodological spillover from the natural sciences to economics and the assumption of ergodicity in particular enabled and shaped the mathematicization of economics seen since the 1940s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.975,
    "end": 3257.841,
    "text": "So, it shapes the field's direction depending on how people use methods from ergodic assumptions or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3259.315,
    "end": 3270.699,
    "text": " And this was a nice diagram where Boltzmann and Poincaré and Gibbs and how it transduces through different generations and it's kind of like a citation network here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.032,
    "end": 3277.514,
    "text": " And I think a great example which was used in the paper is this St.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.574,
    "end": 3278.814,
    "text": "Petersburg paradox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.854,
    "end": 3287.057,
    "text": "And this is a really fun kind of game theory and thought experiment complexity classic that's related to economics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.437,
    "end": 3289.758,
    "text": "So I'll just read it as it is from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.718,
    "end": 3315.764,
    "text": " in seven it's called the saint petersburg paradox in 1713 swift mathematician nicolas a bernoulli posed in an exchange of letters with a french mathematician pierre remote de montmore the following problem what is the reasonable price p for a ticket for the following lottery so on the first flip it's going to be a fair coin and if you win",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.744,
    "end": 3338.997,
    "text": " you can either take one dollar and then uh game's over or you can play again and then on uh uh the second flip if you keep playing so there's there's multiple versions in this version in here it either gives you a dollar or you keep playing and so you get a payoff at each time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.229,
    "end": 3353.476,
    "text": " if another version is where you can decide to keep playing and then you can imagine that getting a 50% chance of that first one is kind of like now the games are very similar because you can either",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.436,
    "end": 3357.097,
    "text": " either by force or by not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.558,
    "end": 3364.383,
    "text": "So in either case, you can ask yourself, how much would you pay to play either of those two little variants of the game?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.384,
    "end": 3369.327,
    "text": "And it turns out that people don't wanna pay infinite money to buy in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.788,
    "end": 3381.237,
    "text": "So especially the one where you either continue or get the payout, the expected value of all the ensemble of trajectories, one in a million is gonna make two to the n money.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.857,
    "end": 3384.46,
    "text": "And so one in a million is gonna make so much money",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3385.721,
    "end": 3393.272,
    "text": " So the expected value across the ensemble with the geometric mean or the arithmetic mean would be like very high, but it still wouldn't be worth that much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.632,
    "end": 3393.853,
    "text": "Why?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3394.293,
    "end": 3395.054,
    "text": "So let's go into that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.595,
    "end": 3396.517,
    "text": "Why does that St.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.557,
    "end": 3400.062,
    "text": "Petersburg paradox challenge ergodicity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3401.864,
    "end": 3424.298,
    "text": " one answer is it's about pragmatics your life is not ergodic you're not well mixing across um you know different places to eat across different places to sleep there's a regularity to your life and so especially considering it in the sort of niche construction for your own uh uncertainty reduction slash precision maximization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.359,
    "end": 3440.684,
    "text": " even putting that all aside it's just your own singular trajectory from a strategic perspective doesn't resemble the assumptions that are under the distribution conforming norms of well mixing gas molecules that's for sure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.844,
    "end": 3446.847,
    "text": " And another way to say that is that the realized risk profile through time is not the same as through space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.588,
    "end": 3453.531,
    "text": "So if you're playing that game, who wants to be a millionaire and it's going up, okay, I've got 12 coin flips in a row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.032,
    "end": 3456.053,
    "text": "I'm at $1,000 or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.593,
    "end": 3459.015,
    "text": "I could take the $1,000 or I can go home with nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3460.972,
    "end": 3470.098,
    "text": " At some point, it's just not going to make sense to go double or nothing on some insane value because there's this realized trade-off between risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.599,
    "end": 3476.643,
    "text": "So that's part of this historiosity and non-ergodicity of your own trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.331,
    "end": 3479.771,
    "text": " ecosystems may not be ergodic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.172,
    "end": 3497.197,
    "text": "So that would be like because of succession dynamics or nonlinear perturbations or resilience properties, ecosystems may or may not have this sort of roulette wheel property or other nice aspects of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.324,
    "end": 3511.972,
    "text": " high or low dimensional systems that physics prefers so there's interesting theoretical work oh well imagine if every patch of the ecosystem was like a spin glass that would be a phase transition but in the real world it's always a little bit messier than that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.305,
    "end": 3515.145,
    "text": " So then just take that sort of St.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.185,
    "end": 3519.887,
    "text": "Petersburg paradox and literally the money one, now adding niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.247,
    "end": 3533.39,
    "text": "And so I was just thinking, well, yeah, what if every city in the country gets to play this paradox and then one city or one individual wins just a ridiculous amount and a few people win a small amount and most people win nothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.41,
    "end": 3536.171,
    "text": "And then that city does infrastructure investment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.471,
    "end": 3540.832,
    "text": "So how does that change the way that future people would be able to, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3541.332,
    "end": 3565.823,
    "text": " play the paradox later so that's niche construction so now think about the historiosity and the niche construction whether that's social insects or humans and you can see how some of these ergodic assumptions as they apply to cultural behavioral systems may be like a little bit tenuous or metaphorical at best here's a few nice figures from this paper though too",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.17,
    "end": 3571.573,
    "text": " So on the bottom right, there's this ergodic case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3571.773,
    "end": 3575.255,
    "text": "And so one of the features of ergodicity is this time reversal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.796,
    "end": 3583.0,
    "text": "Like the molecule bouncing around the room, it's kind of this general time reversible family of models that allows extremely...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.02,
    "end": 3588.881,
    "text": " interesting bidirectional computation in a way that historical systems don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3589.801,
    "end": 3593.263,
    "text": "And so timelessness exists in a current t equals zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.503,
    "end": 3594.363,
    "text": "That's the present moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3594.443,
    "end": 3599.705,
    "text": "And then there's like this analytical time, like reaction coordinate for a chemical reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.125,
    "end": 3606.587,
    "text": "When the two molecules come together, it's not graphed in terms of time, but reactions do have time distributions that they occur on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3607.067,
    "end": 3613.769,
    "text": "But the way that that is represented is on actually a free energy landscape, Gibbs free energy, with a reaction coordinate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3614.249,
    "end": 3619.681,
    "text": " because that's like this ergodic hypothesis about the way that these reactions are reversible through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.615,
    "end": 3648.13,
    "text": " contrast there's the non-ergotic case on the top and in the top there's a symmetry break in the present moment so that means that there's events in the present moment that change the distribution going forward in a way that doesn't make time reversibility a tenable proposition and that's because they happen in historical time so that's kind of a cool idea and then there was yet another great figure from this paper where with kind of a lot going on but i think it's worth looking at because it was so cool so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.861,
    "end": 3651.142,
    "text": " First, there's the not analyzed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.342,
    "end": 3653.784,
    "text": "Not analyzed is just before your data window is available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.604,
    "end": 3658.227,
    "text": "Then there's this realm where you use the ergodic methods, ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.287,
    "end": 3659.488,
    "text": "It's almost like the name of a city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.429,
    "end": 3665.192,
    "text": "And what you see in this window is a spurious, quote, causal relationship in your observation window.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3665.252,
    "end": 3670.196,
    "text": "So let's just say like, you know, between Bitcoin and exports of some other resource or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3671.136,
    "end": 3682.019,
    "text": " And even if everyone knows correlation isn't causation, but then there's methods like dynamic causal modeling, Granger causality and machine learning methods that try to quote learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.419,
    "end": 3696.043,
    "text": "So there's so much in the way that people use methods, whether or not they think they're they at the very least will say they're using data from the past to reduce their uncertainty about the future, which is what led to financial collapse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.203,
    "end": 3696.603,
    "text": "It's what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.643,
    "end": 3701.99,
    "text": " It's what leads to a lot of strategic strengths and weaknesses in a lot of different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.551,
    "end": 3705.676,
    "text": "So that's the ergodic fallacy, valley.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.798,
    "end": 3722.411,
    "text": " Now, the non-causal window is like, let's just say, where there's a different window of time, whether it's window two or window four, and under either of those time intervals, under consideration, the same factors that were at play in one may not matter that much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.511,
    "end": 3728.375,
    "text": "Like, if you observe the first post-forest fire three weeks, the rules that dictate that regime...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3729.116,
    "end": 3735.821,
    "text": " let's just say the spurious causal relationship, oh, nitrogen is a limiting factor or, oh, insects don't play a major role in this process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.302,
    "end": 3741.385,
    "text": "That may or may not be true in a future time window that's not overlapping or partially overlapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3742.026,
    "end": 3743.647,
    "text": "Seems pretty fair, pretty valid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3743.687,
    "end": 3744.748,
    "text": "I think it's a great figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.629,
    "end": 3749.652,
    "text": "And then also there's like second and future symmetry breakings as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.212,
    "end": 3757.017,
    "text": "So even if you go, well, there was a major systems change in the present moment or at X time, but, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3759.013,
    "end": 3773.316,
    "text": " things are still the same in this regard, or this invariance still holds, or this measure is still valid, but then they can't guarantee that there's gonna be this invariance in a future arbitrary symmetry break.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3774.156,
    "end": 3784.638,
    "text": "So what are the frameworks that will carry us through these symmetry breaks and not just have very weak underbellies with respect to things that we don't even perceive on the horizon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3785.998,
    "end": 3786.878,
    "text": "So let's return to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.479,
    "end": 3806.867,
    "text": " Debra's paper about fusion of behavioral ecology and ecology, and talk about whether simulations, variability, historicity, and other sort of not quantitative questions, but qualitative ideas, it challenged this ergodic hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3807.848,
    "end": 3813.87,
    "text": "So she wrote in Behavior and the Illusion of Ergodicity in Ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.89,
    "end": 3815.171,
    "text": "It's a section in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.951,
    "end": 3821.056,
    "text": " Ecology often represents ecological processes in terms of the functional relation among average values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.416,
    "end": 3830.925,
    "text": "For example, to ask whether an invasion will be more successful when there are many species in the community, to ask how an average crop yield will fare when the average population size of many local species are high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.761,
    "end": 3839.745,
    "text": " Methods for evaluating ecological outcomes often assume ergodicity, that all samples are homogenous and that populations being sampled are invariant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.225,
    "end": 3841.086,
    "text": "This can be misleading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.466,
    "end": 3845.988,
    "text": "Behavior is a response to conditions, but individuals vary in response and conditions change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.588,
    "end": 3849.11,
    "text": "The result is that ecological processes are not ergodic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.53,
    "end": 3853.012,
    "text": "Samples are not homogenous and processes can change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3853.712,
    "end": 3867.119,
    "text": " very nice and a well titled section and to kind of add on to this perspective and return to this question about non-ergodicity in historical processes like ecology here's a paper in 2016",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.608,
    "end": 3874.149,
    "text": " replaying life's tape simulation metaphors and historicity in Stephen Jay Gould's via life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.449,
    "end": 3883.272,
    "text": "So not a endorsement or critique of Stephen Jay Gould, it's to bring it up as a philosophy of science point, just as any other paper I would address.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3884.272,
    "end": 3888.333,
    "text": "So this is from the paper and it is a 1974 paper of Raup and Gould.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.914,
    "end": 3921.704,
    "text": " and what they did is they did simulations with where branches node branching rates were a parameter and then also there was like mutational changes and they're like wow the extinction distribution looks like we see in the fossil record and the morpho distribution looks like we see in the fossil record maybe selection doesn't matter or maybe it's just random stuff and to kind of build on that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3922.597,
    "end": 3927.862,
    "text": " in another figure in the paper, this is two outcomes of the simulation that they later ran.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.882,
    "end": 3935.648,
    "text": "See, this is probably a later paper from them or from colleagues that use again, kind of like a birth death process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.688,
    "end": 3946.318,
    "text": "So like the lateral line is a birth of like a new clade speciation event of some type, maybe with niche displacement, maybe not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.136,
    "end": 3953.357,
    "text": " And then there's also the population size growing or shrinking by a small amount, but when it reaches zero, it kind of goes extinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.058,
    "end": 3965.98,
    "text": "And so they were seeing, wow, we're seeing big variation between quote clades or different levels of organization in terms of their biodiversity or in terms of their species number or their morphological diversity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3966.4,
    "end": 3973.382,
    "text": "So again, maybe it's just the random punctuated equilibrium events that end up driving the ship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.082,
    "end": 3974.182,
    "text": "Now,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.618,
    "end": 3991.068,
    "text": " This comes down, and you can come down on the Stephen Jay Gould side or not, on this question whether the historiosity of the past, the uniqueness of the trajectory or the, I guess, the timeline that we appear to be in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.806,
    "end": 4008.052,
    "text": " Whatever your feelings on the historicity of that, the question is really from an instrumentalist point of view, from a functional point of view, can you use these methods that may have statistical assumptions underlying them that assume ergodic processes?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4008.472,
    "end": 4014.995,
    "text": "So for example, when you do a t-test, it's like making the assumption that with respect to other variables, all else is equal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4016.176,
    "end": 4023.362,
    "text": " And everyone says, oh, well, of course, if you sample group A in country one, group B in country two, it's conflated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4023.802,
    "end": 4025.644,
    "text": "But the t-test doesn't know that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.465,
    "end": 4029.327,
    "text": " And so where we don't know that, the t-test doesn't know that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4030.007,
    "end": 4040.014,
    "text": "And more complicated machine learning methods are only able to do this in a really more nuanced way in certain situations, especially with large data sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.735,
    "end": 4051.242,
    "text": "So for the Stephen Jay Gould camp, it was the incidental long-term deep time events, black swan events that drove the ship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4051.762,
    "end": 4056.285,
    "text": "Whereas another way to think about it and the one that I personally would probably end up,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.825,
    "end": 4084.516,
    "text": " emphasizing at the end of the day is that it's actually selection on the morphology locally over that deep ecological time there's also the day-to-day of those little trilobite creatures having to live in their niche and so selection is continually on their morphology and behavior and then yes events happen over longer time periods and the whole question about multi-scale biology is how to integrate those two rather than saying well oh well clade formation is random versus oh it's really strongly driven by niche partitioning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4085.356,
    "end": 4098.23,
    "text": " so to kind of actually close this with a with a cogito ergo sum uh part here's some figures from the i think or i am therefore i think paper with friston and matthias so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.605,
    "end": 4104.226,
    "text": " This left side is I am ergodic, therefore I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4104.266,
    "end": 4115.649,
    "text": "Let's just see what the authors say, because with all these critiques from ecology and from cultural biologists on ergodicity and on the brain, the mind, and everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.249,
    "end": 4126.732,
    "text": "So here is sort of a two-stroke engine, and it goes from resus extensa, which is sort of the behavioral action policy selection flowing out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.819,
    "end": 4133.1,
    "text": " And then the res cognitive is like the belief partition of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.74,
    "end": 4136.641,
    "text": "So the belief could be, I believe that the train is going to come in five minutes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.441,
    "end": 4144.462,
    "text": "And that would be like corresponding to a detachable thought or debate, whether it's a representation or whether it's a metaphysic component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.942,
    "end": 4148.803,
    "text": "And then this is just one partitioning they're throwing out there and we'll see another one in a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.523,
    "end": 4154.544,
    "text": "And then this free energy functional is being used to select the maximum likelihood policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4155.393,
    "end": 4164.783,
    "text": " And so that's why it's doing this pursuit of the minimally surprising across the variational scales of analysis of surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.803,
    "end": 4171.45,
    "text": "It's trying to select the control policy that's going to bring sensory observations into alignment with a deep generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.935,
    "end": 4177.48,
    "text": " So the belief I am ergodic could lead to behavior that at least pursues ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4177.68,
    "end": 4178.241,
    "text": "Is that enough?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4179.662,
    "end": 4189.233,
    "text": "And then they kind of build it out one another level, which is I think I am ergodic, therefore I am.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4189.933,
    "end": 4193.678,
    "text": "So that kind of is an inversion of I am, therefore I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.915,
    "end": 4196.996,
    "text": " I don't know how you get from here to there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4197.056,
    "end": 4205.242,
    "text": "Maybe there's other figures to make or other arrows to draw, but it is interesting to think about how basically it's a little bit unpacking the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4208.596,
    "end": 4215.92,
    "text": " res cognitans beliefs from a Bayesian perspective into the posterior belief and then the likelihood and prior belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4215.94,
    "end": 4228.606,
    "text": "So that's like the, now there's like a Bayesian two-stroke engine up there and then out of the free energy functional reflecting the likelihood and Bayesian beliefs is also the policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.986,
    "end": 4233.649,
    "text": "That sort of relates to our discussions on the generative model being a policy model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4234.673,
    "end": 4252.228,
    "text": " All right, here's kind of a funny figure with focusing on the ear of this statue and just, it has equations on the ocular motor being linked through the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4252.268,
    "end": 4258.554,
    "text": "So action causes the ocular motor to move and the eye sends back visual sensations and proprioception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.034,
    "end": 4260.195,
    "text": "So that's SQ and SP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.976,
    "end": 4263.157,
    "text": " And it's like, that's the interface for the eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.277,
    "end": 4264.918,
    "text": "That's the API for the eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.358,
    "end": 4266.959,
    "text": "That's what we have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.479,
    "end": 4268.4,
    "text": "And that's what we can model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4268.64,
    "end": 4269.861,
    "text": "And it's that dual instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.881,
    "end": 4275.423,
    "text": "The one layer is like, yeah, these are the areas of signal that the eye gets and receives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.944,
    "end": 4286.569,
    "text": "So from an engineering perspective, the scientists instrumentalism is like, yeah, it's good enough for us just to model the system that way, because there's basically nothing that goes outside of that flow state, even though each one is complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.035,
    "end": 4290.658,
    "text": " But then the second one would be, this is actually how the eye works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.698,
    "end": 4302.208,
    "text": "And it turns out that some of these hypotheses about how the actual streams of information or communication should be in the brain, that they are concurrent with some of these inference schemes, which is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.551,
    "end": 4311.838,
    "text": "And this figure was about how like looking at the same statue, there's the stimulus, which is the actual image itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4312.87,
    "end": 4318.715,
    "text": " And what the visual input is is the retinal cells which are activated, let's say, by edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.696,
    "end": 4327.243,
    "text": "And then the salience could be in terms of a deep generative model as far as what area of the sample",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.064,
    "end": 4335.427,
    "text": " or what area of the visual field would be most optimal to sample, ergo which action policy would be optimal to undertake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.967,
    "end": 4349.793,
    "text": "And we see this sampling, which is a little bit outlining the face if you kind of look at it and overlay it, because these are the optimal places to forage, so to speak, for information to resolve what it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.294,
    "end": 4359.302,
    "text": " I'm just gonna go through this last figure from I Am Therefore I Think, because I think it's kind of interesting and funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4359.923,
    "end": 4362.507,
    "text": "So here's how we can walk through this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4364.255,
    "end": 4365.997,
    "text": " a behavioral sequence is embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4366.077,
    "end": 4369.461,
    "text": "So that's the oculomotor red dots moving around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.481,
    "end": 4369.681,
    "text": "It's like .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4371.584,
    "end": 4377.23,
    "text": "So the behavioral sequence is embodied or enacted and also encultured and embedded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4377.29,
    "end": 4379.353,
    "text": "That's the whole variational approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4379.533,
    "end": 4384.199,
    "text": "So right now we're focused on the oculomotor dimension to really unpack it, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.019,
    "end": 4386.959,
    "text": " it's something that we could have moving up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.179,
    "end": 4397.761,
    "text": "Like in one culture, they learned that avoiding eye contact is, you know, or people's status is signaled on this part of their body, or nope, it's in the eyes where you determine something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.362,
    "end": 4404.223,
    "text": "So this is not just a one size fits all solution for human vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.343,
    "end": 4408.523,
    "text": "This is about a model framework that we could use to model what we want to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4409.044,
    "end": 4411.104,
    "text": "But a behavioral sequence is embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4412.398,
    "end": 4416.221,
    "text": " by acting to converge towards beliefs about hidden ocular motor states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4416.341,
    "end": 4421.866,
    "text": "So right there on the y-axis is this hidden ocular motor state, and then there's the proprioceptive expectations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.466,
    "end": 4428.692,
    "text": "So that's like if your muscle with one side, like if your bicep contracts, your tricep will relax.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.232,
    "end": 4452.449,
    "text": " And if that breaks down, if that communication of expectations of, oh, hey, I'm contracting or I'm contracted, if that breaks down, you get a lot of different types of muscle phenomena, ranging from pulled muscles and strains to post-injury or even without injury, changes in the muscles perceived healthy range of motion or limit or minimum or maximum force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.049,
    "end": 4458.133,
    "text": "And that has to do with a lot of the proprioceptive information being integrated with the beliefs about the hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.444,
    "end": 4468.167,
    "text": " What that results in is that observed sensory states, which these are the visual samples.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.387,
    "end": 4474.169,
    "text": "So that's, we're taking one, the hidden ocular motor states, we converge towards belief on those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.749,
    "end": 4477.07,
    "text": "What that results in is the observed sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.09,
    "end": 4481.612,
    "text": "So here's like an eye, an eye, an eye, and you know, there's five dots here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.292,
    "end": 4486.294,
    "text": "And so you're going to get more sampling on the eye, but that's kind of what the camera sees.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.364,
    "end": 4496.307,
    "text": " And then it says absolute data or surprise or prediction error, because this here is like showing the visual samples as kind of camera snapshots of what is being seen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.887,
    "end": 4509.011,
    "text": "But in the predictive processing framework, you could imagine that actually what's coming back is like a parameter update message passing thing that's actually about deep expectations about what to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.171,
    "end": 4511.672,
    "text": "So that's not even included in this model, but that's part of other models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4514.076,
    "end": 4518.598,
    "text": " And what that does when the sampling is like, oh, I expected an eye there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.778,
    "end": 4522.899,
    "text": "I looked at her third eye and I didn't see it visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.96,
    "end": 4525.1,
    "text": "Hypothesis confirmed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4525.74,
    "end": 4529.501,
    "text": "So that type of sampling is also informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.062,
    "end": 4542.126,
    "text": "And so what we see on this graph is that the expectations about hidden perceptual states, so our sort of fuzziness on the whole map, decreases through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4543.354,
    "end": 4552.602,
    "text": " And what that results in is that the corresponding percept remains sharp and concurrent with a coherent generative model through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.022,
    "end": 4563.65,
    "text": "So I always just think about vision in this case, like your whole visual field, unless there's other secondary issues, is clear and has color vision across the entire field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.571,
    "end": 4591.88,
    "text": " and so this is maintained even though there's a large blind spot your resolution is lower outside of your central area and also there's not as much color perception outside there's a bunch of other visual illusions too so it's clearly we're perceiving our generative model visually and why not in other areas too when it's as clear or clearer so we have this face just coming into clarity based upon a deep generative prior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4592.455,
    "end": 4600.037,
    "text": " which is why when there's things that you don't know how to extract the information from, it's hard to know how to do ocular motor scanning, let alone to how to do the semantic mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.997,
    "end": 4618.941,
    "text": "Now, isn't that the big question, is will this kind of static face, fixed image scanning to resolve uncertainty, will that level of functional closure relate into EcoEvo scales of analysis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4619.847,
    "end": 4627.593,
    "text": " So you can imagine this is just a static face doing classification, but would this extend into adversarial relationships with one person?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.094,
    "end": 4643.006,
    "text": "Would this extend into deep counterfactuals with valence and skills and team reformation, hypotheses, all these things playing out that are happening in social scenarios, would that be able to play out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.026,
    "end": 4644.267,
    "text": "This is just eye scanning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.367,
    "end": 4647.629,
    "text": "So will that level of analysis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.63,
    "end": 4663.389,
    "text": " of the group or the community, the evolutionary trajectory, the cultural unit, the ecosystem, any ecosystem, will that level of analysis lend itself to this multilevel framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.33,
    "end": 4687.152,
    "text": " and isn't that the question so that is all i thought i would close with it as an opening to whether people thought yes or no or i think i'd like to know this piece of information before we made a decision i'm i'm open you know i want to learn more i want to figure out what that actual answer is is it going to be that we'll have some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4687.833,
    "end": 4698.426,
    "text": " very tight and coherent Markov blankets that we can just do simulations and understand the interactions between, and then let that higher level parameter just move freely?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4698.446,
    "end": 4704.854,
    "text": "Or will it really be the case that there are order parameters that are just beyond what we can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.021,
    "end": 4711.144,
    "text": " currently understand as mapping onto this framework or some other framework, who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4712.564,
    "end": 4715.446,
    "text": "Anyways, that was kind of a interesting discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4715.466,
    "end": 4716.887,
    "text": "So I hope you liked it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4717.227,
    "end": 4719.828,
    "text": "And I just say thanks for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4720.529,
    "end": 4723.49,
    "text": "We will provide a follow-up form to live participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.391,
    "end": 4728.333,
    "text": "Feedback, suggestions, and questions, always welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4729.173,
    "end": 4746.621,
    "text": " and yeah just stay in communication we're gonna have number 7.1 and 7.2 in the coming two weeks and uh if you want to participate in your listening before them then get in touch also we'll hopefully still be uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.777,
    "end": 4775.441,
    "text": " looking for papers to read and for people to have on discussions as long as you're listening to this so just give us a comment or a message and it'd be good to get in touch so any thoughts especially on this video on where does the fep fit into all this where does active inference fit into all this what are we looking to understand with variational ecology how are we going to use variational ecology how is it going to map on to classical ecology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4776.235,
    "end": 4798.457,
    "text": " what ecological questions are we going to be able to address first how is this going to relate to the kinds of explanations and design solutions that ecologists have worked with before versus proposed deeply uh hypothetical systems a lot of interesting questions plus of course hearing from everyone else on their perspective on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4799.238,
    "end": 4812.627,
    "text": " the implications or strengths or weaknesses so anyways cool thanks for listening i hope that you had a good time and found some parts of it interesting and i will talk to you later",
    "speaker": "SPEAKER_00"
  }
]