[
  {
    "start": 2.83,
    "end": 7.656,
    "text": " All right, hello and welcome everyone to the Active Inference Livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.257,
    "end": 11.301,
    "text": "This is Active Inference Livestream 7.1 and it is October 27th, 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.731,
    "end": 17.493,
    "text": " Welcome to Team Calm, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.053,
    "end": 23.679,
    "text": "We are an experiment in online team communication, learning, and practice related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.979,
    "end": 28.583,
    "text": "You can find us on Twitter, at Inference Active, at our Gmail.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.883,
    "end": 31.646,
    "text": "You can find us on Keybase or YouTube as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.367,
    "end": 38.312,
    "text": "This is a recorded and an archived livestream, so please provide us feedback so that we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.093,
    "end": 41.335,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.355,
    "end": 47.28,
    "text": "And as far as video etiquette for live streams, mute, raise your hand so that we can get to everyone in the queue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.6,
    "end": 51.384,
    "text": "Use respectful speech and try not to use the chitzy chat if possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.622,
    "end": 64.147,
    "text": " Today in ACT-INF 7.1, we're going to start with a warm-up, just briefly introducing ourselves and checking in, and then we'll work through some of the sections of 7.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.288,
    "end": 71.29,
    "text": "The paper we're going to be discussing is Variational Ecology and the Physics of Sentient Systems by Ramstad et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.33,
    "end": 71.37,
    "text": "in 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.651,
    "end": 84.82,
    "text": " And today we'll talk about the goals, the abstract, the roadmap, potentially move through a few key quotations, and then preview the figures, mainly with a focus on seeing what each figure represents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.501,
    "end": 93.026,
    "text": "And today in 7.1 and next week in 7.2, where we may or may not be in costume, we will discuss this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.367,
    "end": 101.833,
    "text": "So please save and submit your questions, whether you're on the panel now or whether you're watching in replay and get in touch if you'd like to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.123,
    "end": 113.686,
    "text": " So for the intros and check-ins, it'd be great if everyone could just introduce themselves and their location, say hello in a short intro, and then pass it to somebody who hasn't spoken.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 113.926,
    "end": 119.687,
    "text": "So I'm Daniel, I'm in California, and I'll pass it to a first-time discussant, Cameron.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.987,
    "end": 123.548,
    "text": "Hi, yeah, I'm Cameron.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 124.988,
    "end": 126.789,
    "text": "I'm here in Zurich, in Switzerland.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 127.689,
    "end": 132.19,
    "text": "I've just started a PhD in philosophy of mind at the University of Zurich.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 133.41,
    "end": 135.151,
    "text": " First time at this group.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 138.072,
    "end": 138.472,
    "text": "Shannon.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 143.333,
    "end": 143.834,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 144.114,
    "end": 144.714,
    "text": "I'm Shannon.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 145.014,
    "end": 148.535,
    "text": "I'm a PhD student at the University of California in Merced.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 150.476,
    "end": 152.176,
    "text": "I'll pass it to Lee.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 154.717,
    "end": 155.257,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 155.938,
    "end": 159.459,
    "text": "I'm in London, a PhD student at the University of York.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 161.021,
    "end": 165.782,
    "text": " bit of an active inference beginner and I will pass it to Alex.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 169.143,
    "end": 169.503,
    "text": "Hello.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 171.203,
    "end": 172.843,
    "text": "I'm in Moscow, Russia.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 173.143,
    "end": 176.284,
    "text": "I'm a researcher at systems management school.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 177.924,
    "end": 179.345,
    "text": "And I pass it to Sasha.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 183.546,
    "end": 183.886,
    "text": "Hello.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 184.626,
    "end": 186.166,
    "text": "My name is Sasha.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 186.466,
    "end": 190.887,
    "text": "I'm in California and I'm a neuroscience graduate student.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 192.78,
    "end": 196.081,
    "text": " And I will pass it to Muddy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 196.101,
    "end": 198.902,
    "text": "Hi, I'm Muddy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.862,
    "end": 204.524,
    "text": "I'm the director of AI at Versus Labs and the Spatial Web Foundation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 205.524,
    "end": 211.206,
    "text": "My link to Active Inference is I did my PhD with Carl Friston four or five years ago, still very much a beginner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 211.806,
    "end": 214.267,
    "text": "And I'm currently in rainy Liverpool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 214.967,
    "end": 221.129,
    "text": "And so I will pass it to anybody who would like to volunteer because I can't see the screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.511,
    "end": 246.333,
    "text": " apologies um hello it's steven here i'm in toronto i'm doing a practice-based phd at canterbury christ church university in the uk and i'll pass it over to maxwell hey everyone i'm maxwell ramstad i'm a postdoctoral fellow at mcgill university in montreal i'm skyping to you from the montreal suburbs",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 248.279,
    "end": 251.822,
    "text": " And yeah, I work on multi-scale extensions of Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 251.942,
    "end": 257.887,
    "text": "I'm the first author on this paper that we'll be discussing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.347,
    "end": 262.471,
    "text": "Very grateful to have such a great group of people as discussants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.292,
    "end": 267.335,
    "text": "And I will pass it to, I believe Lee is the only one who hasn't spoken yet, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 270.325,
    "end": 270.625,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.846,
    "end": 272.666,
    "text": "Yeah, I think that gets through it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.786,
    "end": 275.007,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.307,
    "end": 277.487,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.527,
    "end": 279.208,
    "text": "Thanks everyone for the intros.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.668,
    "end": 290.411,
    "text": "So in these two warm up questions, any thoughts related or unrelated, anything that kind of gets you excited and helps on ramp to the discussion we'll be having.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.391,
    "end": 296.552,
    "text": " What is a physical or informational ecosystem that you care about or have studied?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.332,
    "end": 319.938,
    "text": "And while people are raising their hand, the first ecosystem that came to mind for me was in Southeast Arizona, where there's a grassland ecosystem, where there's a lot of cool ants and also the grazing agricultural use by cows had a big effect on the ecosystem, kind of pushing it from a grassland regime into a very different sort of pebbly regime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.638,
    "end": 327.344,
    "text": " So when I was thinking about this variational ecology, I was kind of thinking about the desert ecosystem and the Southwest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.386,
    "end": 331.787,
    "text": "And go ahead, Muddy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.189,
    "end": 342.777,
    "text": "So I'm interested in slightly different non-biological ecosystems, but still ecosystems where we have agents that make decisions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 343.822,
    "end": 353.57,
    "text": " We build our microservice meshes by having multiple agents that can make decisions and can decide for themselves whether they are appropriate to a given computation or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 354.091,
    "end": 361.416,
    "text": "So we treat them as ecosystems and we are using active inference very much to model the life cycles of these various microservices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 363.878,
    "end": 364.139,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 364.199,
    "end": 368.442,
    "text": "And if anyone else wants to raise their hand, Muddy, I'm actually just kind of curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 368.462,
    "end": 370.764,
    "text": "Let's go to Stephen first and then I'll follow up if possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.489,
    "end": 378.69,
    "text": " Yeah, I'm interested in kind of intentional spaces, but learning spaces or workspaces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 378.97,
    "end": 394.294,
    "text": "And one thing that really came up for me was when I was in a place called Ingwavuma at Mponchini School back in 2004, when I visited there to do a project, or just at that time, just to engage the community.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 394.794,
    "end": 398.935,
    "text": "It was at a school there, Mponchini School, in a rural area where they'd only just",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 399.757,
    "end": 423.41,
    "text": " built the school 10 years before so they didn't actually have schools there before that and um in in and you know around the outside you've got the fence with the barbed wire on the top in the middle of this area with no electricity and it was and i i i sense at that time there was this kind of disconnect between the students understanding what this niche was that they were",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 423.996,
    "end": 453.491,
    "text": " immersed in and an area where um you know while they're learning stuff there's also 35 hiv and the big challenges and and this kind of learning environment which was kind of coming from a colonial background so i this this kind of difference between the world which i was seeing in that community in the world in this this school kind of you know as i've seen in certain workplaces you see this kind of disconnect this kind of like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 454.366,
    "end": 457.767,
    "text": " learning isn't just the knowledge, it's something about how to fit it together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 458.287,
    "end": 464.428,
    "text": "And that's when I sort of later became this idea of a social topography, where there's somehow, what's that kind of landscape of meaning?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 465.188,
    "end": 467.869,
    "text": "When is it more than just knowing the facts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 467.889,
    "end": 471.25,
    "text": "And I think that's where that ecosystem sort of comes together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 472.29,
    "end": 472.57,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.83,
    "end": 481.412,
    "text": "I like how we're exploring a lot of these types of ecosystems, and those are definitely what we want to encompass in the variational ecology discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.612,
    "end": 481.872,
    "text": "Sasha?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.72,
    "end": 497.704,
    "text": " Yeah, so I'm interested in the microenvironment that neurons grow up in and how that affects their activity levels and how they make connections with others.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 498.564,
    "end": 509.627,
    "text": "So one of the things that I'm studying for that is how different immune molecules and turning on immune genes affects this process and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 510.444,
    "end": 515.308,
    "text": " This is something that I wanna learn from this paper, how to apply that to my own system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 516.93,
    "end": 534.646,
    "text": "But one parallel I'm also thinking about is the immune landscape, when people are isolated and aren't exposed to as many people, what their kind of immunity is like, especially in a time when we're really thinking about our own health and immunity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 536.518,
    "end": 540.503,
    "text": " Just from writing down some of these little notes, there's ecosystems across scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.643,
    "end": 541.924,
    "text": "That's definitely going to come back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.084,
    "end": 548.171,
    "text": "And then there's this idea of community ecology, which in the bio sense is usually about different species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.511,
    "end": 557.14,
    "text": "But then there's, of course, as Stephen was talking about, this group and historical dynamics to our community ecology and then ecosystems that are of different technologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 557.961,
    "end": 574.877,
    "text": " so the second warm-up question is what is something that you're curious about or want to explore in today's discussion and while people are raising their hand i think the question that almost motivated or seems to motivate this paper is the one i'm curious about which is about applying the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.997,
    "end": 592.06,
    "text": " the free energy principles, formalisms to larger scale systems where potentially the stability of the Markov blanket or some of the other dynamics of the system are so rapidly changing that it really questions how we're going to study it from this framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.54,
    "end": 594.96,
    "text": "And I know that's something that we'll return to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.661,
    "end": 595.881,
    "text": "Muddy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.301,
    "end": 604.382,
    "text": "Yeah, I think what's fascinating from from this work that Maxwell has been doing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.197,
    "end": 618.847,
    "text": " is helping us actually get really fine-grained detail onto the computational currents of certain problems, such as, you know, when do I stop modeling my subsystem, and when do I start representing my subsystem as a parameter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 619.527,
    "end": 629.414,
    "text": "So when, you know, this transition between a parametric approach and a modeling approach to then feed into a hierarchical model, that is quite an art, and it's an ill-posed approach.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 631.533,
    "end": 632.094,
    "text": " sort of problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 632.114,
    "end": 636.038,
    "text": "So I think this work is really, really fascinating from that perspective from me personally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 637.64,
    "end": 637.961,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.161,
    "end": 644.048,
    "text": "Maybe Maxwell, I'd be curious, what is that relationship with the parametric and the modeling approaches?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.128,
    "end": 648.954,
    "text": "Like how do we go about exploring that or what does that mean from a modeler's perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.694,
    "end": 651.417,
    "text": "I'm not sure I understand your question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.202,
    "end": 666.254,
    "text": " I'm like muddy was talking about how this, uh, question of modeling, like when to stop and when to include a parameter at one level versus another what's an introductory thought or what's the rationale or the motivation behind doing that kind of a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.435,
    "end": 671.538,
    "text": "I mean, so Mel Andrews has thought about this a lot more than I have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.638,
    "end": 677.383,
    "text": "I mean, uh, I wish they were here, um, but they're sick today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.443,
    "end": 678.064,
    "text": "So, I mean,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 679.088,
    "end": 689.01,
    "text": " Roughly speaking, the generative models that we employ under Active Inference, they harness what Mel has been calling the existential variables of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 690.21,
    "end": 695.851,
    "text": "So, you know, the variables that actually make a difference to survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 695.871,
    "end": 700.652,
    "text": "So, you know, you can think of stuff like a core body temperature and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.672,
    "end": 708.614,
    "text": "I mean, ultimately, there is always going to be an arbitrariness involved in the modeling effort because we have to make",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 709.201,
    "end": 715.058,
    "text": " kind of science side decisions about what are the relevant things that we're going to model or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.078,
    "end": 715.138,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.779,
    "end": 726.142,
    "text": " That said, there do seem to be some variables that are more critical to the continued existence of the systems that we're interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.242,
    "end": 728.783,
    "text": "So I don't know if that addresses the point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 729.363,
    "end": 729.663,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 729.763,
    "end": 739.627,
    "text": "I think we'll return to it, especially as we think about what are the vital signatures or the vital variables for ecosystems, because we want to be thinking about them in this similar framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.987,
    "end": 740.167,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.047,
    "end": 741.467,
    "text": " Here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.148,
    "end": 759.158,
    "text": "So the paper that we're going to be discussing in 7.1 today and in 7.2 last week, as well as in 7.0 last week, yeah, people can figure that one out, is Variational Ecology and the Physics of Sentient Systems by Ramstad, Constant, Badcock, and Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.058,
    "end": 779.867,
    "text": " And the goal of the paper was stated as reviewing a framework for modeling complex adaptive systems for multi-scale free energy bounding organism niche dynamics, thereby integrating the modeling strategies and heuristics of variational neuroethology or VNE with a broader perspective on the ecological nestedness of biotic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.688,
    "end": 786.63,
    "text": "We extend variational neuroethology beyond the action perception loops of individual organisms, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.73,
    "end": 787.311,
    "text": "active inference,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.311,
    "end": 797.236,
    "text": " by appealing to the variational approach to niche construction to explain the dynamics of coupled systems constituted by organisms and their ecological niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.756,
    "end": 814.025,
    "text": "And so I quoted that directly from the paper because I think it's a really direct representation and foreshadows the fusion of the VNE and the VANC, which we can talk about, but to kind of rephrase that in non-FEP language, it's a question about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.625,
    "end": 837.452,
    "text": " how can we make a multi-level or multi-scale ecology framework that builds upon eco evo devo that's ecology evolution and development but also adding in insights from physics mathematics and complexity or complex adaptive systems so it certainly is an ambitious scope and it's kind of linking together this organism and downward",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.132,
    "end": 842.176,
    "text": " story of the variational neuro ethology with a niche construction aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.396,
    "end": 846.559,
    "text": "So kind of we have the organism looking downwards, that's the neuro molecular components of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.94,
    "end": 850.042,
    "text": "And then we have the organism looking upwards and outwards with ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.743,
    "end": 853.005,
    "text": "Yeah, if I could comment on that briefly, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 853.962,
    "end": 872.963,
    "text": " Yeah, so basically, if you're looking at the history of how this came about, so I was working, I mean, between 2000, I guess, 16 and 18, I was mostly focused on developing this multi-scale active inference story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.726,
    "end": 889.417,
    "text": " in large part with Carl Friston, and that resulted in a framework that we call the variational ethology or variational neuroethology in our 2018 Physics of Life Reviews paper, Answering Schrodinger's Question of Free Energy Formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.058,
    "end": 901.566,
    "text": "And so the variational neuroethology is essentially a theory about the kind of, if you want to think about it like visually, a kind of vertical stack",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.418,
    "end": 902.938,
    "text": " of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.978,
    "end": 921.726,
    "text": "We've discussed this on this podcast before, but like this idea that systems are made of nested systems of systems so that essentially, if you look at the ontology of a system, what you have is a stack of segregated systems at different spatial, spatial and temporal scales that effectively compose each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.786,
    "end": 929.609,
    "text": "So cells composing tissues, composing organs, composing organisms, composing social groups and composing species and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.115,
    "end": 946.148,
    "text": " And so following the publication of that paper, I started working closely with Axel Constant, who was riffing off work that Jelle Breenenburg had been doing in Amsterdam with his group over there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.168,
    "end": 954.396,
    "text": "And Axel and I developed basically a niche construction account of Active Inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 954.856,
    "end": 978.808,
    "text": " What we highlighted was the fact that active inference is a symmetric formulation in the sense that it tells a story about how internal and external states attune to each other, internal states attuning to external ones through things like perception and learning and phenotypic accommodation and development, and external states tuning to internal states through action notably, making the world more like the way that we expect it to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 980.246,
    "end": 997.267,
    "text": " So that gave us a kind of horizontal dimension where basically at every kind of level of this vertical stack, which you have is effectively a relationship between an ecological niche and the denizens or inhabitants of that ecological niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 998.155,
    "end": 1002.698,
    "text": " So this paper aimed to combine both frameworks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1003.299,
    "end": 1011.804,
    "text": "So the niche construction stuff and the nested systems of systems stuff into a kind of principled approach to biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1013.105,
    "end": 1018.228,
    "text": "And so, you know, moving from an ethology and a theory of niche construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.369,
    "end": 1021.311,
    "text": "So ethology being the study of animal behavior, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.791,
    "end": 1027.875,
    "text": "So combining these two things into a bona fide theory of ecology using the variational free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.716,
    "end": 1039.411,
    "text": " I'm sure you're going to mention this after, but the last ingredient that we added to this mix is the skilled intentionality framework from the Amsterdam group, Eric Goodveld, Julian Kiverstein.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.209,
    "end": 1053.601,
    "text": " Yella Breenenberg, what they add to the mix with the skilled intentionality stuff is connecting this predictive processing framework to the ecological psychology notion of affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.621,
    "end": 1061.808,
    "text": "Yeah, so this paper essentially takes the ecological psychology stuff on affordances, the so-called skilled intentionality framework,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1062.208,
    "end": 1067.77,
    "text": " the variational ethology and the variational niche construction stuff and proposes this integrative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1067.79,
    "end": 1069.09,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.35,
    "end": 1070.83,
    "text": "So that's the kind of history.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1071.331,
    "end": 1071.671,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.991,
    "end": 1072.831,
    "text": "Great summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.871,
    "end": 1074.311,
    "text": "Thanks so much, Maxwell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.792,
    "end": 1079.373,
    "text": "And just to kind of restate that in this nested framework, you have the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1080.293,
    "end": 1100.374,
    "text": " bottom up or emergence features of the system you have the top down features of the system and then the lateral are kind of like the collective behavior so we're thinking about all these ingredients that maxwell just mentioned especially coming from the skilled intention intentionality framework and a few other areas bringing them all together so let's check out the abstract",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.434,
    "end": 1111.927,
    "text": " This paper addresses the challenges faced by multiscale formulations of the variational or free energy approach to dynamics that obtain for large scale ensembles, such as ecosystems or groups of organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.881,
    "end": 1133.855,
    "text": " We review a framework for modeling complex adaptive control systems for multi-scale free energy bounding organism niche dynamics, thereby integrating the modeling strategies and heuristics of variational neuroethology, which remember was really focused on the organism's feedback with its local affordances, with a broader perspective on the ecological nestedness of biotic systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.776,
    "end": 1143.049,
    "text": " So like a lot of times in this podcast, we've talked about the affordance of getting a jacket or of changing the thermostat, but that's actually part of the constructed niche of humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1143.509,
    "end": 1150.34,
    "text": "It's not just a human in a box doesn't find himself without affordance, unlike some of the biomechanical affordances, perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1151.84,
    "end": 1165.749,
    "text": " We extend the multi-scale variational formulation beyond the action perception loops of individual organisms by appealing to the variational approach to niche construction to explain the dynamics of coupled systems constituted by organisms and their ecological niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.229,
    "end": 1169.611,
    "text": "And that relates to this symmetry that was being discussed a few minutes ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.572,
    "end": 1181.062,
    "text": " We suggest that the statistical robustness of living systems is inherited in part from their eco-niches as niches help coordinate dynamical patterns across larger spatio-temporal scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.503,
    "end": 1183.685,
    "text": "We call this approach variational ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.245,
    "end": 1191.933,
    "text": "So it's kind of like the affordance of driving in a car is part of the constructed niche of the highway network, and then that shapes the movement patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.083,
    "end": 1208.554,
    "text": " We argue that when applied to cultural animals such as humans, variational ecology enables us to formulate not just a physics of individual minds, but also a physics of interacting minds across spatial and temporal scales, a physics of sentient systems that range from cells to society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.055,
    "end": 1219.322,
    "text": "And this should sort of invoke that warmup discussion about the different kinds of ecosystems, especially when talking about humans and our technologically enabled extended niches,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1220.123,
    "end": 1239.942,
    "text": " part of the ecosystem is informational it's symbolic and so we also want to be thinking about information ecologies in the way that these dynamics apply not just to the ants on the pebbles but also to humans and the the paths through the parks that are discussed in the paper and also ways that long-range technological communication might come into play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1241.169,
    "end": 1246.213,
    "text": " So just to briefly run through the roadmap, this paper is zero indexed, which I found very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.873,
    "end": 1255.14,
    "text": "And it starts with the discussion of the variational or free energy formulation and just briefly reviews active inference and generative models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.24,
    "end": 1262.965,
    "text": "It's really great that every paper sort of starts with this section on just what it is that we're talking about with Act-Inf and FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.886,
    "end": 1265.687,
    "text": "They're so annoying to write though, honestly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.012,
    "end": 1268.414,
    "text": " You don't want to plagiarize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.434,
    "end": 1270.477,
    "text": "You don't want to just copy the paragraphs you've written.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.497,
    "end": 1274.081,
    "text": "It's like how many ways can you explain the same thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.101,
    "end": 1282.752,
    "text": "And it's like if there really is a smooth energy landscape underlying these explanations, we're treading many, many paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.232,
    "end": 1288.354,
    "text": " and exploring many on-ramps, turning these ideas around through discussion and through more papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.794,
    "end": 1299.259,
    "text": "So yeah, there's a repetition element, and there's also potentially a way that we make bigger and more accessible explanations by rephrasing it again and again for different journals or different specialties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.059,
    "end": 1312.064,
    "text": "So then the second section is on variational neuroethology, and that brings into question multi-scale levels of analysis, as well as ensembles of Markov blankets, as well as a few figures that we'll scan through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.944,
    "end": 1327.519,
    "text": " The third section introduces the sort of organism and upwards perspective that is given by the niche construction, the variational approach to niche construction, and relates that to ontologies of affordances, some of which we've talked about in previous discussions as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.465,
    "end": 1332.287,
    "text": " Another figure on the Bayesian mechanics and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1332.887,
    "end": 1342.152,
    "text": "And then as usual with these papers, they're sort of the foundation, then idea A and idea B, and then A and B are linked together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.332,
    "end": 1346.415,
    "text": "And so we get to section four, variational ecology, the physics of shared minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.779,
    "end": 1352.324,
    "text": " And this also relates to discussions we've had about what it is that's modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1352.465,
    "end": 1354.627,
    "text": "Is the organism a model of its environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1354.647,
    "end": 1355.688,
    "text": "Does it have a model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.129,
    "end": 1358.832,
    "text": "And agreed that Mao's thoughts on this are super helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1359.353,
    "end": 1361.135,
    "text": "And then there's some concluding remarks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.956,
    "end": 1364.799,
    "text": "And just to really quickly visually outline this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.66,
    "end": 1368.881,
    "text": " theory by addition approach that's being enacted here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.802,
    "end": 1377.865,
    "text": "On the very bottom, we have the FEP, which is that paradigmatic ground rock that a lot of these other theories are going to be built on top of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.405,
    "end": 1387.989,
    "text": "Then from left to right, we have active inference, Tinbergen's four questions, which are explored a little bit in number 7.0, as well as some previous discussions we've had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.829,
    "end": 1394.393,
    "text": " EST is evolutionary systems theory, which is basically evolutionary biology with a systems perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.013,
    "end": 1407.021,
    "text": "And eco-evo-devo, which is also a very interesting and rich area that emphasizes that the way that evolution occurs is not just ecologically embedded and enacted, but it occurs through changes in development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.321,
    "end": 1408.963,
    "text": "So you don't just get a longer femur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.403,
    "end": 1417.288,
    "text": "You get the developmental proclivity to have your growth plate be open for a longer or shorter time, resulting in a phenotype that is changing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.712,
    "end": 1418.774,
    "text": " it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.245,
    "end": 1425.449,
    "text": " Active inference and Tinbergen's four questions and evolutionary systems theory were basically summated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.549,
    "end": 1427.051,
    "text": "This is not a perfect summation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.111,
    "end": 1436.798,
    "text": "It just sort of building it up a little bit to VNE, which was a very organism and biobehavioral centric approach to explaining action perception loops of organisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.779,
    "end": 1448.368,
    "text": "On the other hand, also drawing from ACT-INF was the variational approach to niche construction, which drew a little bit more extensively from the eco-evo-devo motivating questions and literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.505,
    "end": 1462.564,
    "text": " And then to bring in synergetics, which is this relationship between the higher order parameters, the bigger, slower things, and then the lower level parameters, the faster and smaller things of Hakan 1983 on the left side,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.827,
    "end": 1468.988,
    "text": " And then the collective behavioral approach, these lateral relationships between nested systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.448,
    "end": 1493.274,
    "text": "It all kind of comes together to get to variational ecology, which hopefully builds upon the strengths of all of these different antecedent theories and gives us something that is going to allow us to dip back into, for example, behavioral explanations of organisms or dip into the niche construction approach or the collective behavior across different levels of analysis, as well as providing a helpful path back",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.854,
    "end": 1510.945,
    "text": " to understanding how previous formulations, for example, a modern synthesis type evolutionary biological explanation or a non-FEP eco evo devo explanation, it gives us an interpretation path that we can walk to understand a lot of the previous literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.286,
    "end": 1512.927,
    "text": "So just pause here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.087,
    "end": 1520.952,
    "text": "Does anyone have any thoughts on this theory summation or is there any other areas that we think might be relevant to draw in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.678,
    "end": 1528.721,
    "text": " One that I was wondering about is this introduction of the minds and the sentient systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.262,
    "end": 1541.41,
    "text": "And so there was a sentence in the paper about the sentient systems being sensory systems, though often when people talk about the search for sentient life and things like that, they're talking about the experiential dynamics as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.05,
    "end": 1545.333,
    "text": "And so the idea of getting the interacting minds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1546.033,
    "end": 1548.898,
    "text": " from the interacting evolutionary systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1549.118,
    "end": 1555.349,
    "text": "I just thought that was kind of a curious thing, maybe foreshadowing in integration with psychology or with phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.659,
    "end": 1566.102,
    "text": " Well, so the sentience aspect is really, I think, just to highlight what the free energy principle stuff does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1566.222,
    "end": 1578.586,
    "text": "I mean, at the end of the day, the free energy principle shares with perceptual control theory the idea that action is about the control of perceptual input, namely keeping it within certain bounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1580.927,
    "end": 1582.828,
    "text": "So that might be relevant to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1584.324,
    "end": 1585.805,
    "text": " I mean, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.945,
    "end": 1599.853,
    "text": "So from that point of view, sentience is the capacity to be affected by the world in a way that allows us to control how the way the world affects us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.773,
    "end": 1600.933,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.113,
    "end": 1612.98,
    "text": "Like something hitting a rock still could be felt or is still as influential on the state of the rock, but it doesn't necessarily have the ability to then act, especially in a proactive way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.588,
    "end": 1615.388,
    "text": " to get around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.869,
    "end": 1621.811,
    "text": "And also just one other note is actually the Schrodinger's question paper from 1944.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1622.371,
    "end": 1637.077,
    "text": "And then the answering Schrodinger's question paper from 2018, I think are also great places for people who are kind of coming at this from a first principles of biology perspective, because Schrodinger's question was about how organisms are organized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.817,
    "end": 1654.374,
    "text": " And very interestingly, and nine years before the discovery of the structure of DNA and many years before a lot of the other approaches that would come on the scene with the molecular revolution in the second half of the 1900s, Schrodinger said there has to be something like a quasi-periodic crystal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.975,
    "end": 1658.137,
    "text": " And organisms have to organize at least locally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.417,
    "end": 1660.018,
    "text": "They're not gonna violate the laws of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.058,
    "end": 1669.865,
    "text": "This isn't vitalism, but at least locally, you have to be able to take the bag of sugar and then organize it into biomolecules that constitute an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.905,
    "end": 1671.506,
    "text": "That's a increase in order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1671.926,
    "end": 1672.586,
    "text": "How does that happen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.967,
    "end": 1674.488,
    "text": "Is that the defining principle of life?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.228,
    "end": 1684.091,
    "text": " And in some ways, as we look on Earth and elsewhere for life, these two ideas of Schrodinger really remain as prescient as ever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.171,
    "end": 1685.891,
    "text": "So I find that just really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.271,
    "end": 1686.531,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.392,
    "end": 1699.255,
    "text": "I know you're probably going to mention this, but I suppose the idea of ergodicity sort of comes in through the active inference piece more than it normally is thought of in the other areas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1699.955,
    "end": 1704.837,
    "text": "But that maybe synergetics is another way that these kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1706.36,
    "end": 1733.386,
    "text": " ergodic ways to extract information are present and I suppose the question is is that non-ergodic processes the ways to tap into things which are non-ergodic and sort of causal is that something which is when you then step outside of normal active inference and you have this extra structure on top which is our cognition which allows us to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1734.679,
    "end": 1756.988,
    "text": " sort of process things that are kind of non-ergotic so i think that might be interesting like in terms of how we construct things as humans as opposed to that kind of more organic niche construction but that not that that's really touched on here but i suppose it's just just the idea of how patterns are extracted and what levels of meaning or what processes of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1758.007,
    "end": 1779.187,
    "text": " like attuning or constructing or relating what what's that kind of dynamic at play thanks for that comment i think the word ergodic is really what a lot of that idea hinges on so if anyone wants to have a take at what the word ergodic means i tried to go through it a little bit in 7.0 but um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.068,
    "end": 1785.709,
    "text": " if anyone wants to explain what an ergodic system is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.31,
    "end": 1800.915,
    "text": "And Stephen, what your question gets at is really whether the models of ergodic systems, of systems where the time average is equivalent to the ensemble or the spatial averaging, though there's also other ways to phrase that or perspectives on that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.875,
    "end": 1806.338,
    "text": " in systems with extreme historiosity, like niche construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.398,
    "end": 1809.961,
    "text": "If you build a road in one place, the whole society kind of leverages around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.361,
    "end": 1818.447,
    "text": "Or if there's an introduction of a new species into an area, that can irreversibly and extremely historically change the trajectory of that ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1818.768,
    "end": 1822.47,
    "text": "So how are we to model these systems using ergodic frameworks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.67,
    "end": 1827.314,
    "text": "Stephen, and then anyone else who wants to step in on the ergodic question, because it's kind of a key term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1829.076,
    "end": 1837.273,
    "text": " Yeah, I think this is a really interesting, I thought, relevant point because the thing with the godicity is I sort of was –",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1837.955,
    "end": 1855.301,
    "text": " looking at the video for this session that you made and sort of comparing it to what I've been thinking is, it could be that there's lots of small patches or periods or blocks where there's kind of enough ergodicity due to mixing to extract information or to find patterns.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1855.901,
    "end": 1860.683,
    "text": "So it could be that there's not this idea that the system is ergodic,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1861.463,
    "end": 1886.676,
    "text": " but there might be lots of times where there's moments of mixing that ergodicity is present and you can extract or make inferences from that so i think that's quite um that changes things a little bit in terms of how you know makes it more plausible maybe for how ergodicity can creep in um and it also i think then starts to give you a rationale for how you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1887.495,
    "end": 1890.338,
    "text": " can engage with the whole entropy question as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1890.958,
    "end": 1892.98,
    "text": "Because normally entropy is brought into the equation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1893.0,
    "end": 1907.894,
    "text": "So it could be that talking about multiple levels and things dissipating and suddenly it's like, well, if you've got periods of ergodicity, then you've got a way to extract or...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1909.974,
    "end": 1913.855,
    "text": " get a grip on the noise that's going on out there over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1913.875,
    "end": 1917.656,
    "text": "And I think that that's important.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1917.696,
    "end": 1934.6,
    "text": "I think that's also important in terms of trying to explain it to other people, because most people, when they think about the world and systems, and actually there's a whole debate on the Viable Systems group about this, is that they just take a snapshot, a perspective on a system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1935.56,
    "end": 1943.438,
    "text": " and they say this is what the system does, but that's not the same as something which is happening over time and there's a pattern over time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1943.518,
    "end": 1945.583,
    "text": "It's like it's a different way of thinking about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1946.516,
    "end": 1950.078,
    "text": " the world and even think about systems in general.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1950.158,
    "end": 1955.262,
    "text": "So that piece is really important about how does it happen over time?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1955.282,
    "end": 1964.848,
    "text": "And is it lots of bits of ergodicity that add together or is it like we have to have ergodicity over a hundred years, over 10 years, over five years?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1965.188,
    "end": 1965.448,
    "text": "Nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.649,
    "end": 1969.091,
    "text": "Let's go Shannon and then Muddy and then Maxwell, if you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.281,
    "end": 1975.887,
    "text": " I would just like to jump in quickly just to clarify a few things about ergodicity, if that was okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.108,
    "end": 1977.729,
    "text": "Let's go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.749,
    "end": 1980.852,
    "text": "Yeah, you might actually answer my questions before I ask them.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1981.032,
    "end": 1981.412,
    "text": "Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.452,
    "end": 1983.034,
    "text": "Maxwell, Shannon, Muddy, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.154,
    "end": 1985.016,
    "text": "Okay, so ergodicity...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1986.348,
    "end": 2004.302,
    "text": " from a mathematical point of view, you can understand it heuristically as the, you know, so a system is ergodic if the average of our measures of the system converges to a measure of the average of our, the value of whatever we're measuring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.382,
    "end": 2009.106,
    "text": "So another way of thinking about it is that like wherever your system starts in its state space,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.91,
    "end": 2015.332,
    "text": " With an ergodic system, it will end up in a regime of characteristic states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.913,
    "end": 2022.435,
    "text": "So no matter where you start, you end up in these states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.475,
    "end": 2032.339,
    "text": "So I mean, you can think of my body temperature, for example, would be describable in this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.38,
    "end": 2039.302,
    "text": "It varies a bit, but it ends up continuously converging to 36 and 1 half degrees Celsius",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2040.091,
    "end": 2045.615,
    "text": " So there's a lot of confusion in the literature and in discussion about this ergodicity thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.875,
    "end": 2058.903,
    "text": "One thing to point out is that so to the extent that it is implied in the framework, the notion that we're considering is only local ergodicity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2058.943,
    "end": 2064.307,
    "text": "So we're not saying that, you know, because the maximal version of like an ergodic system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.594,
    "end": 2071.959,
    "text": " like a system that's globally ergodic is a system that doesn't really have a history in the sense that it doesn't really matter where you start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.379,
    "end": 2074.02,
    "text": "You always end up in the same place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.541,
    "end": 2087.289,
    "text": "The notion of ergodicity that we're employing in the free energy framework to the extent that it's employed at all is a notion of local ergodicity, which means that on some appropriate scale,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.19,
    "end": 2100.8,
    "text": " temporal and spatial scale, it's useful to think about the system as being ergodic, as in that it will regularly converge to the same set of states or values of those states, rather.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2101.941,
    "end": 2104.663,
    "text": "So I guess there's a lot to say here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.684,
    "end": 2111.008,
    "text": "On the one hand, you know, this local ergodicity thing is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2111.229,
    "end": 2113.951,
    "text": "So when we say that the Earth is round,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2115.97,
    "end": 2123.795,
    "text": " You know, we're not saying that it's not flat enough locally for us to build buildings on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.095,
    "end": 2133.08,
    "text": "So like locally, the earth is flat enough, has a negligible enough curvature that we can build, for example, a building on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2133.58,
    "end": 2134.921,
    "text": "And this is the same kind of idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.981,
    "end": 2144.467,
    "text": "So the ergodicity at play is that, you know, on some appreciable time scale, systems converge to the same set of values effectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2145.563,
    "end": 2149.085,
    "text": " And, uh, yeah, so I guess that's one point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.105,
    "end": 2154.208,
    "text": "Uh, another related point is that our ergodicity actually isn't, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.552,
    "end": 2159.513,
    "text": " they, well, it's not really baked into the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2159.773,
    "end": 2170.457,
    "text": "All you really need to get the free energy principle running is a Markov blanket and a non-equilibrium steady state or generative model, which we've been discussing over the last few weeks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.957,
    "end": 2176.859,
    "text": "So generally notions like ergodicity and weakly mixing also appears in some of these discussions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2177.439,
    "end": 2181.341,
    "text": "It only applies to certain kinds of systems with multiple particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.975,
    "end": 2188.477,
    "text": " under special assumptions, namely the assumption that all the particles are exchangeable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2190.858,
    "end": 2196.0,
    "text": "So if we're dealing with a single particle, this kind of probability distribution in general doesn't exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.18,
    "end": 2203.243,
    "text": "The only probability distribution to which we have access is when we sample the state of a single particle over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.848,
    "end": 2213.432,
    "text": " Yeah, the real assumptions on which the free energy stuff is built is this non-equilibrium steady state assumption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2214.273,
    "end": 2219.055,
    "text": "And it's related to the ergodicity thing in a certain sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.956,
    "end": 2230.582,
    "text": "So non-equilibrium steady state, we're saying that the system has a set of characteristic states to which it tends over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.029,
    "end": 2244.861,
    "text": " And so if a system has a non-equilibrium steady state, then under the conditions that we just described, where there are particles that are exchangeable, then you can treat the system as ergodic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.141,
    "end": 2250.206,
    "text": "But it's not as crucial to the framework as some would suggest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2250.226,
    "end": 2252.768,
    "text": "So I've heard in the bushes that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2254.635,
    "end": 2261.817,
    "text": " Some people are mounting a critique of the free energy principle based on the idea that living systems aren't actually ergodic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.517,
    "end": 2275.041,
    "text": "I think that's a bit of a waste of time because we're not claiming that biological systems are globally ergodic, just that it's useful to treat them as ergodic at certain scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.401,
    "end": 2278.022,
    "text": "And, you know, the way that we get out of this kind of weird",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.709,
    "end": 2303.341,
    "text": " place formally speaking is by pointing to this nested systems of systems thing so the idea is that from the perspective of any layer of the system the layer above it might as well be stationary so from the point of view of my bot of my cells for example my body is essentially stationary you know so their entire life cycle you know from birth to uh cell division uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.895,
    "end": 2312.378,
    "text": " will occur without any major structural change happening to the non-equilibrium steady state of my whole body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.838,
    "end": 2325.062,
    "text": "So you get around the implausibility of the strong interpretation of these assumptions by pointing out that, well, what's actually at play is a nested series of systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.882,
    "end": 2333.765,
    "text": "And you only need things to look ergodic locally relative to other layers of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.927,
    "end": 2350.996,
    "text": " I think that's really helpful for what my question would have been, which would be like, how would, if you're talking about the behavior of a crowd and if there's a certain Markov blanket that can extend over this, this group of individuals, the thing about a crowd is it's not a cell.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2351.076,
    "end": 2353.598,
    "text": "It's not bounded by being stuck inside of a body.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2353.698,
    "end": 2356.84,
    "text": "They could leave, like they could leave the stadium or leave the protest.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2357.48,
    "end": 2363.884,
    "text": "But if we're talking about ergodic or like interacting just enough at just the",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2364.594,
    "end": 2370.651,
    "text": " right spatial temporal scale, then we can talk about some Markov blanket over some",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2371.223,
    "end": 2397.823,
    "text": " whole crowd or subset of a crowd at some event at some time exactly yeah that's precisely what's going on here so it's all about defining the relevant spatial and temporal scales i mean if your relevant spatial and temporal scale is like you know the whole city over several weeks then obviously the the protesters that gather you know and spontaneously form a social group wouldn't count as you know even having a non-equilibrium steady state i mean it just kind of forms and dissipates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2398.263,
    "end": 2406.43,
    "text": " But if you're looking over the scale of, you know, minutes to maybe hours, then it does make sense to say, well, locally, you know, there's something robust here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2406.45,
    "end": 2409.713,
    "text": "It has a statistical independence from its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2409.813,
    "end": 2414.116,
    "text": "It seems to be, you know, attracted to the same set of states, and then it dissipates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.637,
    "end": 2420.302,
    "text": "So it's the same story over and over again, just a different kind of spatial and temporal scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2420.322,
    "end": 2422.003,
    "text": "So you're totally right, I think, Shannon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.323,
    "end": 2423.664,
    "text": "That's right on point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.145,
    "end": 2424.405,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.465,
    "end": 2426.487,
    "text": "Let's do Muddy and then Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.707,
    "end": 2432.256,
    "text": " Yeah, I just wanted to speak to some of the, like just to give a little bit of intuition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2432.276,
    "end": 2432.858,
    "text": "So I'm kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2433.832,
    "end": 2436.434,
    "text": " not super in active research right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2436.534,
    "end": 2444.319,
    "text": "So these terms, I like sharing kind of the way I think about them for people who might be listening who might not be familiar with ergodicity in general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.859,
    "end": 2458.148,
    "text": "So just generally, and please correct me if I'm wrong about this because I'm looking to have my understanding probed, but I view ergodicity or a system that's ergodic, my intuition is that if I take a sample of a system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2458.988,
    "end": 2463.509,
    "text": " that system is ergodic if that sample is representative of the greater dynamics of that system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.53,
    "end": 2476.934,
    "text": "So that's what Maxwell was saying about tending to the mean, so it doesn't really matter if I take my data from here, here, here, or here, as long as the sample I'm taking is representative, that is another kind of worms, it should tend to the same mean or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2477.674,
    "end": 2500.879,
    "text": " know basically represent the same dynamics of the underlying model and underneath but the way in which you define ergodicity is actually defined by your measurement your sample space it's necessarily defined by your sample space so you have all of these emergence properties which are hard to pin down so you have like dynamic ergodicity which are you know partials with respect to time which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2501.559,
    "end": 2517.686,
    "text": " tend towards some stable value for the local and then the actual mean, versus static ergodicity, which is if I take a snapshot of my system at any one given time, so like a cloud of gas, it kind of looks the same, but without any knowledge of my attractor systems, I can't say that my system is ergodic dynamically over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.847,
    "end": 2522.111,
    "text": " And then you can think about continual ergodicity at different levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2522.671,
    "end": 2531.882,
    "text": "So I think the example Maxwell gave of the flat earth is a really, really beautiful one because if you take a local representative sample, say 100 meters by 100 meters,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2533.644,
    "end": 2548.902,
    "text": " um you you could define every single sample by a single function a stable function which either has either a stability maximum point or is linear in its nature so at that level i have a continuous function which defines i've got to see across all scales",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2549.302,
    "end": 2554.363,
    "text": " but it's nested within a larger system which might have chaotic dynamics actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2554.863,
    "end": 2557.864,
    "text": "And so it's actually ergodicity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2557.884,
    "end": 2563.445,
    "text": "I think the ambiguity comes in when you're actually trying to define the problem space itself as a concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.905,
    "end": 2567.426,
    "text": "It's just basically saying this sample represents the model I'm trying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2567.806,
    "end": 2577.308,
    "text": "This sample of a larger system represents the larger system at whatever mathematical perspective I happen to be looking at it from, whether it's with respect to time or some other variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.929,
    "end": 2579.435,
    "text": " So I just wanted to add that in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2580.239,
    "end": 2583.36,
    "text": " I mean, just to play devil's advocate, thank you, Buddy, for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.46,
    "end": 2584.62,
    "text": "I agree with everything you said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2585.381,
    "end": 2601.906,
    "text": "Just to make the, you know, put some meat on the bones of criticism in the interest of fairness, one of the reasons that you might resist the idea that biological systems is ergodic is, for example, the pretty plain fact that evolution isn't going anywhere, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2602.806,
    "end": 2607.808,
    "text": "There doesn't seem to be some kind of evolutionary kind of attractor basin towards which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.688,
    "end": 2618.058,
    "text": " all of evolution, you know, contra this kind of anthropocentric, you know, religious view of, you know, man's place in nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.078,
    "end": 2621.081,
    "text": "Well, humans aren't all that special.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.042,
    "end": 2628.569,
    "text": "And we're just like one among, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2629.899,
    "end": 2632.2,
    "text": " a series of other, uh, animals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.1,
    "end": 2633.7,
    "text": "Um, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.76,
    "end": 2636.641,
    "text": "So that one, wait one quick before we go to Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.001,
    "end": 2642.582,
    "text": "Also, if your body temperature hits a certain very low or very high value, it's not returning to a steady state either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.942,
    "end": 2648.944,
    "text": "And so that's like, there's a lot of reasons to think at a certain scale of analysis that there's violations of this kind of behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2649.404,
    "end": 2651.608,
    "text": " Oh, I mean, very clearly we all die, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.849,
    "end": 2652.69,
    "text": "We all dissipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2652.83,
    "end": 2661.366,
    "text": "And so at long enough timescales, nothing has this non-equilibrium steady state or is ergodic in that sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.526,
    "end": 2662.428,
    "text": "We all just dissipate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.03,
    "end": 2671.173,
    "text": " In some sense, the only real ultimate ergodic endpoint is the heat death of the universe, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2671.193,
    "end": 2674.435,
    "text": "Yeah, it's uncanny valley because at a short timescale, you're stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.675,
    "end": 2676.676,
    "text": "Then at the lifelong timescale, you dissipate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.776,
    "end": 2678.796,
    "text": "And then again, you're just a flash in the pan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.997,
    "end": 2683.358,
    "text": "So very cool and highlights that it's important what scale we're talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.658,
    "end": 2685.039,
    "text": "Stephen, before we close out the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.758,
    "end": 2689.58,
    "text": " Yeah, I also think that, you know, we talk about the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2689.64,
    "end": 2692.383,
    "text": "Is the system ergodic internally, externally?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2692.663,
    "end": 2704.432,
    "text": "But I don't know whether this is right, but I kind of am more from a practice perspective trying to do the sense-making of active inference and that kind of the dynamics of things going backwards and forwards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2704.532,
    "end": 2712.098,
    "text": "So I'm trying to think of the ergodicity as maybe being more about the process of this noisy process",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2713.557,
    "end": 2720.042,
    "text": " chaotic, like Muddy was saying, data going backwards and forwards or across the Markov blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2720.663,
    "end": 2725.747,
    "text": "And within there, there's ergodicity in that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2726.047,
    "end": 2740.038,
    "text": "And that, even if the systems, I don't know whether they are or not ergodic of the organism, but there's something in the data stream that allows you to extract information from the entropy, sort of the noise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2740.619,
    "end": 2741.799,
    "text": "So I was trying to work out if",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2742.827,
    "end": 2745.169,
    "text": " You know, that might be two questions here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2745.209,
    "end": 2755.916,
    "text": "I think it ends up going to this bigger question about whether the systems are ergodic, but I'm not sure whether it's about the dynamics, the nonlinear dynamics have ergodicity sort of tucked away in there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2756.377,
    "end": 2765.343,
    "text": "Yeah, just to give an ecological example, let's think about a predator-prey relationship, like a Lotka-Volterra model, you know, the cougars and the rabbits or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.803,
    "end": 2767.044,
    "text": " So it's always changing through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.364,
    "end": 2770.346,
    "text": "And there's a winnerless competition where they're always oscillating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.706,
    "end": 2774.869,
    "text": "And so from the first pass, the first moment, it's not ergodic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.929,
    "end": 2776.53,
    "text": "It's changing at certain timescales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2776.95,
    "end": 2782.353,
    "text": "But it has what Muddy was referring to as this dynamical stationarity or the dynamical ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.734,
    "end": 2785.135,
    "text": "It's kind of like the more things change, the more they stay the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.715,
    "end": 2789.398,
    "text": "Sometimes when we're talking about these higher order relational dynamics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.958,
    "end": 2801.502,
    "text": " or rates of change, the partial derivatives that Muddy mentioned, then it's actually through time at the correct timescale of analysis that you see that the predator-prey relationship is in like this higher order ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2802.222,
    "end": 2805.923,
    "text": "And then at another timescale above that, the predator and the prey species don't even exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.423,
    "end": 2808.464,
    "text": " So of course it can't be an ergodic system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.584,
    "end": 2819.73,
    "text": "So again, we see that there's timescales where systems display ergodicity and timescales and spatial scales where they don't, as well as relying on questions about exchangeability and other attributes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2820.07,
    "end": 2825.032,
    "text": "But just in the last couple minutes, this is really awesome discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.612,
    "end": 2833.476,
    "text": "I want to just run through the figures, give people a little peek into some of the formalisms and the ideas that we'll be talking about further in 7.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.397,
    "end": 2849.234,
    "text": " And this is a quotation about how exactly niche construction enters the picture, and especially in terms of epistemic resources, which relates to the technological niche of humans, as well as the skilled intentionality framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.492,
    "end": 2856.617,
    "text": " here's a good quotation about how in the multi-scale framework, active inference is a group behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.238,
    "end": 2858.078,
    "text": "That's a group activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.298,
    "end": 2874.872,
    "text": "And so this sort of connects the dots between active inference and collective behavior, because even when we draw the organismal loop with active inference, we're talking about collectives of neurons or of different cell types, and also ties it back to closed causality, circular causality, and synergetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.152,
    "end": 2875.753,
    "text": "This idea of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.933,
    "end": 2881.659,
    "text": " coordinating slower order parameters, and then rapidly oscillating higher order parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2881.739,
    "end": 2888.946,
    "text": "And that's kind of like the dynamics of the gas cloud looks stationary visibly, but if you went down there, it'd be the seething mess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.986,
    "end": 2892.81,
    "text": "And you'd say, there's no way this is a stationary state, but it is at a little bit of a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.651,
    "end": 2898.856,
    "text": "And then this last quote was just about how at work,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.134,
    "end": 2927.954,
    "text": " one's behavior acts to justify their sensory states and their prior beliefs about them and then that kind of reminded me of a figure from the paper written with alex and sasha and others where we talked about that a little bit more specifically from a technological level um and just to quickly walk through the figures before we return figure one markov blanket it's got to be figure one it's not it's not a ramstead paper if it isn't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.795,
    "end": 2958.156,
    "text": " figure two is also unpacked a little bit in the answering schrodinger's question paper and this one there's what you see and there's what you don't see what you see is the potential explanatory scope across spatial and temporal scales that range over many orders of magnitude but what you don't see is that there's nothing that's at the for example one millisecond and one kilometer scale maybe a lightning strike is able to dissipate energy rapidly at that scale but it doesn't coordinate effectively it doesn't have that closed causality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.676,
    "end": 2963.077,
    "text": " I should say, I no longer agree with this figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.158,
    "end": 2968.379,
    "text": "Kasper Hesp and I, starting May 2018, I guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.279,
    "end": 2974.381,
    "text": "Kasper was quick to point out that you don't need a separate set of time scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.601,
    "end": 2980.023,
    "text": "The spatial scales that we pointed out are really ontological scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.063,
    "end": 2985.745,
    "text": "The subcellular scale is a spatial scale and a temporal scale simultaneously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2987.686,
    "end": 2992.551,
    "text": " the cellular processes occur over a few milliseconds and they have their specific size.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.951,
    "end": 3004.722,
    "text": "And these scales, the concomitant associated spatial and temporal scales really increase along this diagonal kind of together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3006.203,
    "end": 3011.428,
    "text": "So, I mean, another thing that kind of breaks this apart is where is culture here, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3011.448,
    "end": 3012.769,
    "text": "So culture is very fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3013.901,
    "end": 3016.583,
    "text": " But it's also a very large-scale process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3016.623,
    "end": 3021.987,
    "text": "So this is not a figure that I would recommend learning by heart or anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3022.007,
    "end": 3024.148,
    "text": "I think it turns out to be wrong now, but...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3025.362,
    "end": 3026.683,
    "text": " Science progresses, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.244,
    "end": 3028.084,
    "text": "So we were wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.805,
    "end": 3034.99,
    "text": "I still find it interesting, especially with that caveat that it's not like there's small things happening at the tiny scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.01,
    "end": 3042.976,
    "text": "And then there's no relationship with the niche construction, like niche construction for the cultural niche and the communication niche is related to cellular processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.357,
    "end": 3044.458,
    "text": "So there's just what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.758,
    "end": 3050.603,
    "text": "But then it's interesting to think about how the functional levels of organization do align along this scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3051.383,
    "end": 3056.446,
    "text": " Very vague, qualitative diagonal, but not a formal approach for sure here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.247,
    "end": 3063.83,
    "text": "Figure three is another recap figure having to do with, I think, something about broccoli and how it's a fractal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.191,
    "end": 3072.496,
    "text": "It's about Markov blankets and about nested systems and how Markov blankets at one level can be thought of as engaging in collective behavior at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.436,
    "end": 3091.928,
    "text": " Figure four, again, an example that we've seen before with looking at how morphology can arise as a function of initially equivalent cells acting morphologically to reduce their surprise about their expectations, about the extracellular gradients and where they are and what that means for what the organism is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.309,
    "end": 3103.176,
    "text": "And then how development and the evolution of development could reflect beliefs and action generative sequences that allow the organism to fulfill functional morphologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.096,
    "end": 3113.12,
    "text": " Figure five, I don't think is one that we've seen yet, but it connects the active inference and affordance side with a free energy minimization side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.84,
    "end": 3122.423,
    "text": "And there's some mathematics there that I hope to be actually going into in the coming weeks as we've chosen the paper for eight, which is gonna be scaling active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.963,
    "end": 3130.586,
    "text": "And we'll be looking to have a lot of discussion on the mathematics because it's definitely one of the areas we wanna dive deeper into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.246,
    "end": 3140.515,
    "text": " And then the last figure is a partition of vector states into particles, which are the sets of balls here and the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.035,
    "end": 3143.277,
    "text": "So I'll go into that a lot next week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.477,
    "end": 3146.66,
    "text": "This is probably the key figure for the whole thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.02,
    "end": 3147.801,
    "text": "Thanks for noting that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3147.921,
    "end": 3152.586,
    "text": "We'll definitely go into this in the last minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3153.663,
    "end": 3157.244,
    "text": " Thanks for participating in this short and exciting 7.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.244,
    "end": 3166.786,
    "text": "Next time in 7.2, we're gonna have more time to talk about some of the specific questions that have been arising as well as figure six, as Maxwell pointed out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.727,
    "end": 3174.208,
    "text": "Everyone live or in replay is welcome to send us comments or questions that would be cool to unpack live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.568,
    "end": 3181.11,
    "text": "Today, I really appreciated just hearing about how these different ecosystem conceptualizations and ways of thinking about the same ecosystem",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.69,
    "end": 3202.793,
    "text": " same way of thinking across different ecosystems how do they all combine and we provide follow-up forms to all live participants so it's in the calendar invite and it'd be great if you could fill it out we also solicit feedback suggestions and questions from our audience and from our other participants who aren't live here and uh all we can say to that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.974,
    "end": 3205.274,
    "text": " Thanks for the participation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.414,
    "end": 3206.175,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.315,
    "end": 3208.796,
    "text": "Really an awesome discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.956,
    "end": 3215.358,
    "text": "And just as always, it's another level of understanding, another coat of paint on the mural to hear from everyone's perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.378,
    "end": 3216.738,
    "text": "So I deeply appreciate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.498,
    "end": 3219.159,
    "text": "And great times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.579,
    "end": 3223.54,
    "text": "Anyone want to give a singular closing thought to cap out the stream?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.021,
    "end": 3228.002,
    "text": "Long live ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.482,
    "end": 3229.222,
    "text": "Muddy, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.394,
    "end": 3233.677,
    "text": " Oh, I was just going to say, no.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3234.578,
    "end": 3234.998,
    "text": "Exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3235.278,
    "end": 3236.119,
    "text": "Can I ask a question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.68,
    "end": 3238.101,
    "text": "That nobody wants to share a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.602,
    "end": 3239.523,
    "text": "That's my observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.984,
    "end": 3240.324,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3240.444,
    "end": 3241.245,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.385,
    "end": 3244.929,
    "text": "Thanks again for listening, for participating, and we will see you next time.",
    "speaker": "SPEAKER_00"
  }
]