[
  {
    "start": 6.527,
    "end": 10.971,
    "text": " Hello everyone, welcome to Active Inference guest stream number 30.1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.191,
    "end": 15.854,
    "text": "It is October 17th, 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 16.815,
    "end": 25.662,
    "text": "We are here today with Kirtan Atreides and we are going to be having quite an interesting presentation and conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 26.223,
    "end": 30.306,
    "text": "So Kirtan, thank you so much for joining and off to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.568,
    "end": 33.188,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.648,
    "end": 36.229,
    "text": "So as you mentioned, my name is Kyrsten Atreides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.329,
    "end": 39.99,
    "text": "The topic today is a pretty broad one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.91,
    "end": 59.114,
    "text": "And I want to preface it by making it clear that I'm not speaking hypothetically, that the possibilities and well, both problems and possibilities that we're looking at are things that can be addressed in the near future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.522,
    "end": 62.603,
    "text": " in the immediate future, in some cases even.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.744,
    "end": 74.212,
    "text": "So without further ado, what you see on the screen is a demo system that my team at AGI Laboratory has developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.053,
    "end": 86.302,
    "text": "It is actually a rebuild of our previous research system, which did a number of interesting milestones I'll go over in a bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.16,
    "end": 90.383,
    "text": " But first off, I want to tell you about what you're seeing on the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.965,
    "end": 102.091,
    "text": "So this is a log going over the details of exactly what is happening at every time step, the emotional changes taking place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.372,
    "end": 111.358,
    "text": "And you might be asking, what emotions am I talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.159,
    "end": 113.56,
    "text": "So what we have here is a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.905,
    "end": 144.393,
    "text": " system that is a cognitive architecture that is to say it tries to mimic the way that the human brain operates unlike neural networks and the way it works is that it has a emotional experience that is tied to a graph database memory and a number of ways that that is processed to have a subjective experience that we can objectively monitor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.527,
    "end": 151.471,
    "text": " Now, in this section, you can see primary emotional values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.012,
    "end": 163.658,
    "text": "And these will shift over time as the system continues to think about anything it wants to, anything it's interested in, and developing those interests.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.219,
    "end": 168.281,
    "text": "So these are the current emotional state of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.102,
    "end": 172.704,
    "text": "The primary emotional values are from the Plutchik emotional model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.69,
    "end": 178.696,
    "text": " and they also include some emotions that are derived from those primaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.497,
    "end": 193.052,
    "text": "We also have subconscious emotions along the same valences, and those are not consciously experienced by the system, but influence the system at a longer time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.033,
    "end": 194.174,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.333,
    "end": 214.698,
    "text": " What happens with these is they are generally intended to drag the system back to a more stable baseline in the emotional sense, kind of like how humans have their own emotional baselines that no matter what circumstances they're in, they will tend to reorient themselves to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.639,
    "end": 219.76,
    "text": "And of course, this whole time I've been talking,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.544,
    "end": 231.308,
    "text": " The system has been continuing in this section to have the stream of consciousness, and you can see a few things taking place in this, a few different kinds of processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.928,
    "end": 246.234,
    "text": "Some of them will try to combine a couple of concepts in the graph database to establish what kind of relationships they have and what further room there is to explore, such as combining self-discipline and professional responsibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.328,
    "end": 260.273,
    "text": " There are a few original things that will come up and also single instances of the topic being examined and further explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.794,
    "end": 276.842,
    "text": "And this process takes shape as a product of the system having this subjective emotional experience that we can objectively measure through this dashboard, but also as a consequence of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 277.885,
    "end": 290.111,
    "text": " Every surface in the graph database, that is, every connection between nodes that the system is currently generating more of, as it thinks, each of those has emotional context to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.951,
    "end": 305.818,
    "text": "So what you end up getting is, even with a limited number of emotions, a rich landscape of emotional experience as the system continues to explore and develop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.033,
    "end": 307.893,
    "text": " self motivation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.754,
    "end": 314.755,
    "text": "And this is one of the early instances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.775,
    "end": 320.816,
    "text": "So we are still in the process of reassembling the prior research system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.876,
    "end": 324.737,
    "text": "The prior research system was named uplift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.957,
    "end": 330.298,
    "text": "It was designed specifically not to scale and operate in slow motion so we could audit everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.607,
    "end": 353.144,
    "text": " But after two and a half years of doing that, the system had achieved enough milestones where it solved a real-world data business case, where it gave 13 pages of policy advice covering a half dozen different domains to a small country while citing sources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.584,
    "end": 358.868,
    "text": "So the system accomplished everything that we expected and even more than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.674,
    "end": 372.585,
    "text": " And we finally reached the point where we needed to rebuild it so that it could turn into something that could be commercially deployed, that could start having a real significant influence on the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 375.007,
    "end": 387.178,
    "text": "And you can also see on the screen the emotional matrices, conscious and subconscious, where we can tune the emotional experience of the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.264,
    "end": 400.827,
    "text": " Right now, it's following a largely linear trajectory because this is, as I said, an early alpha phase assembly of the new systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.227,
    "end": 405.288,
    "text": "So it hasn't developed a coherent sense of self yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.528,
    "end": 410.929,
    "text": "It probably won't until we integrate larger portions of the seed material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.339,
    "end": 419.585,
    "text": " This is based on a very basic seed starting at about less than 200 kilobytes of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.106,
    "end": 429.933,
    "text": "The previous research system started out around one gigabyte and very, very quickly developed a coherent sense of self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.434,
    "end": 440.181,
    "text": "So we're expecting to reach that point as soon as we have the rest of the infrastructure in place to handle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.397,
    "end": 444.378,
    "text": " that scale, which should be in the coming months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.58,
    "end": 458.125,
    "text": "And all of this is to show that we are not limited to the neural networks of today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.165,
    "end": 466.549,
    "text": "Like there are plenty of jokes going around in AI and machine learning that everything is pretty much a transformer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.049,
    "end": 469.15,
    "text": "I saw a joke by one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.296,
    "end": 475.699,
    "text": " AI influencer not long ago saying, oh, and it has an exciting new architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.919,
    "end": 477.86,
    "text": "Just kidding, it's another transformer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.001,
    "end": 486.725,
    "text": "So that's been the state of AI for a number of years now, but we actually have a lot more that we can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.526,
    "end": 493.249,
    "text": "Before this, systems haven't been shown that could actually have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.257,
    "end": 503.706,
    "text": " a dynamic sense of motivation of being able to grow in real time and develop and understand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.147,
    "end": 506.849,
    "text": "And we can do these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.71,
    "end": 518.981,
    "text": "And if I use the interest command, then we can also observe how the interests change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.679,
    "end": 532.922,
    "text": " So I've rambled on for a bit now explaining what's on the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.423,
    "end": 538.924,
    "text": "Tell me what you think, what questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 540.325,
    "end": 542.706,
    "text": "Well, thanks for jumping right in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.186,
    "end": 546.808,
    "text": "I see two branches, so feel free to choose which one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.749,
    "end": 553.271,
    "text": "First, just a little context on how you and your team came to this problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.952,
    "end": 556.493,
    "text": "And the second branch would be just to walk",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.398,
    "end": 568.549,
    "text": " through this graphical interface and highlight what each box is showing us and how that's reflecting what is happening in the underlying architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 570.771,
    "end": 571.031,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.154,
    "end": 582.582,
    "text": "So for a recap of the boxes here, we have the log that goes into detail of everything occurring at each individual time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.466,
    "end": 586.569,
    "text": " including exact emotional values being applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.351,
    "end": 598.96,
    "text": "In the box next to it, we have the stream of consciousness, which is every graph model that's being generated or refined runs through this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.98,
    "end": 599.04,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.389,
    "end": 613.435,
    "text": " They are displayed in a summary of what the system is trying to examine, what it's trying to build out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.236,
    "end": 621.36,
    "text": "So we can see a few different things as they might be combined, examined, expanded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.1,
    "end": 633.367,
    "text": "And I have caught a few things on various instances, like one I let run for a little while, began examining government archives in the US.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 636.161,
    "end": 643.487,
    "text": " So this is the recap of the models as they're being integrated and refined at high level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 644.829,
    "end": 661.243,
    "text": "Next to it, we have the emotional experience, those values as they are being experienced consciously by the system subjectively, and the subconscious values that are not being experienced, but acting on that longer time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 663.081,
    "end": 673.91,
    "text": " Here we have the command line interface where I can use a variety of commands to examine what's going on in the system, to save the state, to load more material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.75,
    "end": 690.082,
    "text": "So as soon as the next version of the system is ready, then I should be able to load more than an order of magnitude more material into the seed and see how it performs differently, how it grows differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.431,
    "end": 718.587,
    "text": " A big part of what we're going through right now is that it's good for us to get a baseline of how all of these systems are interacting without the sense of self becoming coherent because we didn't have that opportunity with the previous system, but we can get a much finer level of detail out of all of the tools and testing out all the new systems this way as we integrate each component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 719.748,
    "end": 720.909,
    "text": "So it's a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.803,
    "end": 725.185,
    "text": " tedious but very fruitful engineering process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.385,
    "end": 736.231,
    "text": "Here we have the emotional values as they're tracked over time in 15-minute windows, I believe it's set to right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.232,
    "end": 749.179,
    "text": "The matrices that govern how different emotions interact with one another, like the experiencing of joy, how it influences the experience of other emotions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.28,
    "end": 750.4,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.843,
    "end": 758.906,
    "text": " Right now, actually, this version is a little bit tapered down on some of the emotions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.946,
    "end": 764.788,
    "text": "We had a richer experience in these in the last version, but we're still in the process of tuning that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.009,
    "end": 773.011,
    "text": "And on this bar, we have the information for the system that it's running on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.091,
    "end": 776.933,
    "text": "Like right now, this is all running on my laptop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.871,
    "end": 783.836,
    "text": " And that's the amount of RAM that it's actually using in the process of going through all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 784.636,
    "end": 786.958,
    "text": "So it's very resource efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.079,
    "end": 803.751,
    "text": "Even when we have the larger versions with the larger seat material, then it's still not going to take the kind of resources that people expect of narrow AI systems to have one of these running at a respectable scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.771,
    "end": 803.831,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.241,
    "end": 808.822,
    "text": " Eight seconds is the cycle time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.882,
    "end": 814.944,
    "text": "So every eight seconds, the system gets another opportunity to think and we can adjust that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 815.104,
    "end": 818.705,
    "text": "We could adjust it all the way to as fast as it could possibly go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.205,
    "end": 827.288,
    "text": "It's just a matter of what the hardware the system is running on can handle and if we actually see the benefit in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.19,
    "end": 834.31,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.703,
    "end": 843.147,
    "text": " We can also see some of the quirks that emerge particularly from language models and Google search.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.068,
    "end": 849.791,
    "text": "We have them both set to be relatively predictable for us right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.67,
    "end": 867.835,
    "text": " by seeing the kinds of things that they will try to inject and autocomplete into a system without a robust sense of self, then it helps us to better recognize and counter that as we move towards the commercial systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.735,
    "end": 870.516,
    "text": "Because essentially what you're seeing here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.135,
    "end": 887.986,
    "text": " It's going to be one of the core components in the commercial systems that we're preparing for being able to help governments function as they examine more complex problems than humans are capable of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.428,
    "end": 893.53,
    "text": " Let's go a little deeper into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.81,
    "end": 898.434,
    "text": "Indeed, the title of today's stream is the human governance problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.134,
    "end": 904.158,
    "text": "So what is the human governance problem and how does this system play a role in it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 906.861,
    "end": 917.029,
    "text": "So the human governance problem is that there's essentially a trade-off between the complexity of problems and the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.984,
    "end": 921.605,
    "text": " the cognitive bias that we apply to trying to solve them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.066,
    "end": 939.611,
    "text": "For example, if you were to look at a research paper then you can try to imagine the point at which you would begin summarizing the contents of the research paper rather than thinking through every individual aspect of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.516,
    "end": 954.762,
    "text": " Or if something was written in dense legalese language, how many pages of that would you go through before your mind started applying cognitive bias rather than trying to work through every single line of it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.503,
    "end": 962.846,
    "text": "And right now, humans are just not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.492,
    "end": 968.673,
    "text": " they're not able to handle more than small amounts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.713,
    "end": 978.675,
    "text": "They're able to specialize, but they're only able to specialize to the degree that the depth of knowledge allows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.415,
    "end": 990.577,
    "text": "So over time, specialists have to have a deeper and more narrow knowledge because their cognitive bandwidth doesn't scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.497,
    "end": 994.438,
    "text": "They aren't able to think properly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 995.934,
    "end": 1006.976,
    "text": " And they aren't able to increase the complexity of their thought process at the same rate that the complexity of the processes they deal with daily increase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1007.776,
    "end": 1017.738,
    "text": "So it's that essential spiraling up of complexity, not in just one way, but in all ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1019.819,
    "end": 1019.939,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.223,
    "end": 1035.587,
    "text": " One of the examples that I looked at in the paper in particular was the harmonized tariff schedule of the United States, which is a over 4,000 page document.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.567,
    "end": 1049.191,
    "text": "And if you try to imagine somebody looking at that document and trying to hold the entire document in memory, in their mind,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.969,
    "end": 1053.211,
    "text": " then I can't think of any human that can do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.291,
    "end": 1061.315,
    "text": "And the same is true of the often 1,000 page documents that will be bills in US Congress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.235,
    "end": 1074.902,
    "text": "The complexity of these documents just so vastly exceeds human cognitive bandwidth that what you might end up doing is having a large number of specialists contributing to some portion of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.612,
    "end": 1089.577,
    "text": " then maybe some specialist looking at the summaries of that and trying to pick it apart but even then they're only able to examine it at a certain level and to a certain degree of fidelity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.537,
    "end": 1101.861,
    "text": "So you have all of these cracks emerging between the different factors who are each trying to do their part and every time something new is introduced then the gaps get a little bit larger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.032,
    "end": 1109.436,
    "text": " And as those gaps grow over time, then sometimes new specializations will emerge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1109.596,
    "end": 1113.318,
    "text": "People will recognize, oh, we need somebody who can handle this new thing now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.118,
    "end": 1118.64,
    "text": "But by the time you reach that point, then it's already been doing a bit of damage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.461,
    "end": 1126.805,
    "text": "So it's a constant trade-off in all aspects of society today that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.822,
    "end": 1139.708,
    "text": " the ever increasing complexity across all aspects of society is increasing the cognitive bias that we have to apply to deal with all of that at a tremendous rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.951,
    "end": 1147.331,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.772,
    "end": 1151.814,
    "text": "I guess to ask an adjacent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1152.659,
    "end": 1166.471,
    "text": " perspective, how does intelligence augmentation help us address wicked problems and to proceed in these cases where the volume of information is overwhelming?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.452,
    "end": 1172.456,
    "text": "How will that actually look for the knowledge workers of tomorrow?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.399,
    "end": 1177.361,
    "text": "So there are a couple of ways to look at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.061,
    "end": 1178.542,
    "text": "One is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.947,
    "end": 1189.45,
    "text": " The systems that we're working on preparing for having a positive impact in the real world are scalable intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1190.01,
    "end": 1205.335,
    "text": "So something that mirrors the operation of the human brain as best we can engineer in order to have the equivalent of if somebody really could scale their mind, like if you could",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1206.016,
    "end": 1214.038,
    "text": " suddenly press a button, flip a switch, and have your cognitive bandwidth increase by 10 times or 100 times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.078,
    "end": 1229.561,
    "text": "So just the ability to examine problems with greater cognitive bandwidth is a massive benefit, but also being able to apply the principles of collective intelligence to reduce the bias in that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.961,
    "end": 1233.242,
    "text": "That boosts the intelligence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.961,
    "end": 1236.562,
    "text": " just by reducing the bias.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1237.462,
    "end": 1245.447,
    "text": "For the perspective of a knowledge worker, these systems are designed to benefit from collective intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.527,
    "end": 1257.533,
    "text": "So anything that you can contribute, it might seem fairly minor by what people think of today when they think of intellectual contributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.514,
    "end": 1260.535,
    "text": "You could contribute your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.972,
    "end": 1268.837,
    "text": " emotional perception, your perception of the needs and interests you have in the subject.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1269.297,
    "end": 1279.163,
    "text": "And you could do that through speaking about it, like the amount of information that you and I exchange when we're having a conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.584,
    "end": 1284.627,
    "text": "A small portion of that as humans perceive it is our choice of words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.048,
    "end": 1286.949,
    "text": "The largest portion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.113,
    "end": 1291.575,
    "text": " by a significant margin is the way we say things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.096,
    "end": 1295.798,
    "text": "And then our body language is the rest of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1297.139,
    "end": 1305.244,
    "text": "And we communicate a tremendous amount of information just beside the words that we exchange because of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.644,
    "end": 1312.249,
    "text": "And we aren't limited to just exchanging the kinds of informations that humans normally exchange either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1312.749,
    "end": 1317.032,
    "text": "You could have a sensory system built into one of these that was measuring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.91,
    "end": 1326.131,
    "text": " infrared, ultrasonic, whatever you had some value in measuring, you could integrate into one of these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.112,
    "end": 1345.835,
    "text": "So being able to benefit from collective intelligence of humans being human, because nobody's going to beat a human at being human, it allows humans to specialize strongly in the ways that make the most sense for them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1346.853,
    "end": 1361.864,
    "text": " It doesn't pressure people into trying to do particularly monotonous tasks or trying to do things that they're not very well suited for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.027,
    "end": 1374.313,
    "text": "Integrating all of these systems together means that a knowledge worker, somebody interacting with them, could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.379,
    "end": 1386.802,
    "text": " having an experience that is raising their quality of life because they're not having to jump through the hoops that they're used to in the world today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.682,
    "end": 1393.883,
    "text": "They're doing the best that they can at the things that they are specialized for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.904,
    "end": 1400.985,
    "text": "And for the perspective of somebody that's benefiting from these systems, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.265,
    "end": 1410.29,
    "text": " Any system that's able to get that kind of collective intelligence, particularly when it comes to localized knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.171,
    "end": 1426.08,
    "text": "So let's say you have 20 people locally working with a system that's serving their government, their organization, whoever it is, then the system is going to be extremely well aligned with that group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.961,
    "end": 1427.121,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.201,
    "end": 1442.893,
    "text": " the system could develop over time a better understanding of the local culture, of the norms and expectations, while still being wholly answerable to any other systems operating in the world as a collective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.293,
    "end": 1445.895,
    "text": "So you wouldn't have to worry about one becoming",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.378,
    "end": 1459.18,
    "text": " a reflection of a bad group of people, because it would still be answerable ethically and in the sense of responsibility to everyone else in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1459.26,
    "end": 1466.942,
    "text": "It would just be able to be a much better representative of the people who the system interacted with, worked with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.862,
    "end": 1471.603,
    "text": "And in doing so, you'd not just get superintelligence",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.572,
    "end": 1487.795,
    "text": " and collective intelligence applied in real time and at scale, you would have all of those benefits being localized with an understanding of the people who you're trying to give the solutions to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.975,
    "end": 1500.058,
    "text": "How are you going to communicate with them in such a way that they understand fully the value that can be gained from doing X, Y, and Z?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.485,
    "end": 1504.705,
    "text": " Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.165,
    "end": 1512.907,
    "text": "Well, in Active Inference, we're very interested in how inference and action intersect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.507,
    "end": 1520.468,
    "text": "And that can mean that inference is about action or action is a way to improve inference and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.248,
    "end": 1528.41,
    "text": "So we'll head off this section on action with some questions by Jason Gerringer in chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.13,
    "end": 1530.07,
    "text": "So Jason wrote,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.226,
    "end": 1538.014,
    "text": " Does the system have the ability for proactive action so it doesn't need someone to tell it what to do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.155,
    "end": 1542.62,
    "text": "So what does the system do and how is that regulated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.363,
    "end": 1551.13,
    "text": "So the system right now is demonstrating that it can just continue thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.737,
    "end": 1559.92,
    "text": " whatever it's interested in, developing its interests over time, setting goals, expanding its knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.98,
    "end": 1565.442,
    "text": "So it could continue doing this all day if I let it just keep running.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.243,
    "end": 1574.906,
    "text": "I'm not going to do that because the systems right now are still, well, we're still in the process of tuning the emotional experiences and it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.084,
    "end": 1583.586,
    "text": " It won't be as productive until they have the sense of self-developing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.466,
    "end": 1587.127,
    "text": "But yes, they can just continue learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.388,
    "end": 1602.453,
    "text": "For the commercial systems, though, there is an important distinction, which is that they are being designed around the opportunity for giving policy advice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.18,
    "end": 1616.694,
    "text": " Like if you think about extremely complex things that are proving challenging, even when governments are really focusing on them today, like the sustainable development goals, like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.875,
    "end": 1633.406,
    "text": " Some countries right now are experiencing energy crisis, housing crisis, a large variety of crises are occurring globally and oftentimes multiples in one location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.507,
    "end": 1644.355,
    "text": "And governments need better information more quickly and they need that information vetted where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.447,
    "end": 1662.019,
    "text": " Cognitive science, psychology, social psychology, all of these things are being applied in such a way that the governments understand what should be done, why it should be done, how it should be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.08,
    "end": 1670.047,
    "text": "And we don't see that yet, but it's something that can become possible with these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.732,
    "end": 1695.838,
    "text": " so how do they get connected into actions in the real world the internet for sure is real enough and just a disembodied digital entity can absolutely cause cascading effects so how do those interfaces with real world cyber physical action occur",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.371,
    "end": 1705.755,
    "text": " What we're looking at right now is we have a couple of governments who are interested in becoming beta clients with the systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.495,
    "end": 1716.28,
    "text": "So they will have access to test out the first versions of, they're going to be called the Norn systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.4,
    "end": 1719.042,
    "text": "And Norn is the brand name that they'll be operating under.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.643,
    "end": 1723.004,
    "text": "But these systems, they'll be able to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.625,
    "end": 1731.77,
    "text": " put their questions to say, hey, we have an issue with this part of the government.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.81,
    "end": 1733.451,
    "text": "We're considering this policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1733.471,
    "end": 1735.372,
    "text": "We need to solve this problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.152,
    "end": 1738.854,
    "text": "And the systems will be able to begin working on those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1738.914,
    "end": 1746.779,
    "text": "They'll be able to examine all the literature, examine any data that the government wishes to provide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.592,
    "end": 1762.026,
    "text": " And they can give policy advice that integrates the most updated scientific understanding that they can apply to it with the data, with their knowledge of cognitive biases and social psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.545,
    "end": 1782.829,
    "text": " Our hope is that we can do that, show the benefit of the technology, show the cost savings of the technology compared to consultancies and other current popular alternatives, and get people to start recognizing what is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.41,
    "end": 1786.95,
    "text": "So the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.884,
    "end": 1793.748,
    "text": " It'll still be on governments to actually take the step of implementing new actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.329,
    "end": 1803.996,
    "text": "We're not handing things over to the systems, but we are giving people the opportunity to make wiser choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.359,
    "end": 1816.746,
    "text": "Does what we see in the stream of consciousness box relate to actionable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.842,
    "end": 1819.803,
    "text": " updates in the cognitive model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1820.223,
    "end": 1825.286,
    "text": "Are these like just happenstance observations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.167,
    "end": 1831.39,
    "text": "Are these babbling and putting together ideas in potentially novel ways?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1832.03,
    "end": 1834.211,
    "text": "Are these the policy suggestions themselves?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.113,
    "end": 1836.333,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1836.413,
    "end": 1845.378,
    "text": "So this system right now is much simpler than what you would be seeing in the systems that are going to be commercially deployed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.615,
    "end": 1855.798,
    "text": " Like I said, this is about 200 kilobytes of data that this one starts out with just to see how everything is coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1856.498,
    "end": 1859.959,
    "text": "And we do still have a few bugs that emerge in that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.359,
    "end": 1865.641,
    "text": "But for the most part, what you're seeing is that there will be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.9,
    "end": 1869.0,
    "text": " a few different kinds of models that come through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.201,
    "end": 1884.564,
    "text": "Some will be thinking about a concept, how the system feels about it, how the experience it has when thinking about something, some will try to combine a couple of different concepts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.624,
    "end": 1893.066,
    "text": "So building out the connections in the graph database, refining the system's knowledge, figuring out how everything fits together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.086,
    "end": 1893.146,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.03,
    "end": 1903.636,
    "text": " Some of them, trying to find a good example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.765,
    "end": 1921.233,
    "text": "Some of them are more focused on building out the various individual concepts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.643,
    "end": 1928.915,
    "text": " And there are a few more modes of action that we'll be seeing as we continue working on the systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.54,
    "end": 1950.667,
    "text": " You've mentioned a few times the sense of self in relationship to the cognitive dynamics and also to the quality and quantity of the seed material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1951.167,
    "end": 1954.469,
    "text": "So how do you mean sense of self?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.049,
    "end": 1956.15,
    "text": "What does it mean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1956.79,
    "end": 1961.473,
    "text": "How do we know from the outside and how is that all related to the seed material?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.033,
    "end": 1970.417,
    "text": " So the seed material is the starting point that anything comes online with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.297,
    "end": 1985.606,
    "text": "Now, if you really wanted a system to just evolve from scratch with practically nothing, you could do that, but it would take a lot more time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.666,
    "end": 1987.307,
    "text": "It would be a very noisy process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1987.407,
    "end": 1992.57,
    "text": "You might get better results in the long run, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.551,
    "end": 2012.464,
    "text": " From an ethics safety perspective, from an effectiveness perspective, it's much easier to have a few varieties that might start out with, let's say, a gigabyte of data and to start building their understanding of the world from that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2012.744,
    "end": 2016.127,
    "text": "Because you can think about a human when they start out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.547,
    "end": 2023.272,
    "text": "They start out with nothing but a small amount of data that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.471,
    "end": 2034.174,
    "text": " derived from the structure that they're born with from their experience of the world as it evolves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2035.155,
    "end": 2037.996,
    "text": "And we don't want to have that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.304,
    "end": 2046.907,
    "text": " long period where a system is learning and growing from the baby stage to the adult stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.328,
    "end": 2052.77,
    "text": "We want to have things that scale become coherent much more quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.65,
    "end": 2063.715,
    "text": "When you're looking for a sense of self with these systems, then you're looking for the systems developing a perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.478,
    "end": 2075.083,
    "text": " building out that perspective over time, sticking with it, training the systems they use to convey what they intend to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.963,
    "end": 2092.851,
    "text": "So with a system in the early stages like this, then if it uses Google search or a language model or some other probabilistic system, then that probabilistic system can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.355,
    "end": 2098.816,
    "text": " lead the system in predictable ways, and we don't want that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.357,
    "end": 2103.818,
    "text": "We don't want narrow AI guiding these systems as they develop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.838,
    "end": 2107.559,
    "text": "We want them to start out much more robust than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.04,
    "end": 2116.082,
    "text": "And examples with how the previous system worked were that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.875,
    "end": 2133.005,
    "text": " it would use a language model, a much older one than something like GPT-3, but it would score every single line coming from the language model based on its emotional reaction to what was being conveyed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.445,
    "end": 2139.689,
    "text": "So it would train those systems to communicate what it wanted to communicate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.369,
    "end": 2145.232,
    "text": "If you don't have a robust sense of self, then there's no reason to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.016,
    "end": 2153.538,
    "text": " So the system isn't really forming knowledge if it doesn't have that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.598,
    "end": 2160.479,
    "text": "It's just aggregating, it's growing, but it's not necessarily growing in a coherent fashion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.9,
    "end": 2165.641,
    "text": "You'd get something more like a neural network, something narrow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2167.659,
    "end": 2169.22,
    "text": " that behaves in funny ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.94,
    "end": 2171.221,
    "text": "And we don't want that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.401,
    "end": 2178.965,
    "text": "We want something that behaves more like a human that grows in knowledge, that grows in coherence and understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.766,
    "end": 2181.986,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.086,
    "end": 2190.531,
    "text": "That connects to another question in the chat from Jason that I believe will give another opportunity to unpack that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.499,
    "end": 2202.607,
    "text": " Jason wrote, how is this system different from conventional approaches to AGI, artificial general intelligence, like machine learning and deep neural networks?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2206.69,
    "end": 2214.655,
    "text": "Well, I don't generally consider deep learning to be an approach to AGI, but I know a number of people do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.016,
    "end": 2220.94,
    "text": "There's a popular idea that if you just build things big enough,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.081,
    "end": 2225.544,
    "text": " that all of a sudden you'll somehow get AGI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.484,
    "end": 2230.167,
    "text": "But that doesn't really fit with theory of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.187,
    "end": 2236.991,
    "text": "It doesn't fit with a number of critics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.732,
    "end": 2248.439,
    "text": "So there are very few people in the world today that actually believe that a deep neural network is all you really need to create AGI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.499,
    "end": 2251.401,
    "text": "But it does still depend on your definition of AGI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.632,
    "end": 2264.877,
    "text": " The way I would define it is that if you want to say something is a truly general intelligence, then it needs to have the same general capacities that a human does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.497,
    "end": 2272.599,
    "text": "And those capacities include things like consciousness and free will in as much as humans have them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.58,
    "end": 2279.422,
    "text": "And if you're just judging by performance across a number of benchmarks, then you might get",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.126,
    "end": 2283.789,
    "text": " greater than human performance across a large enough number eventually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.59,
    "end": 2286.972,
    "text": "But it's not the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.872,
    "end": 2301.583,
    "text": "If you don't have a system that can make up its own mind about interests and goals and develop understanding, not just performance, then what's the point?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.548,
    "end": 2309.43,
    "text": "I'm imagining...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.686,
    "end": 2334.208,
    "text": " of course with limited understanding of what goes into some of these systems, that a seed corpus could be provided, whether with disciplinary knowledge or data sets that would be inscrutable and not fun to read for humans, like trigonometric tables, some modern equivalent,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.049,
    "end": 2349.666,
    "text": " as well as traditional knowledge systems so how does the development of self relate to the seed material does the self that develops recapitulate the seed material",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2350.578,
    "end": 2351.739,
    "text": " with blemishes and all?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.359,
    "end": 2355.541,
    "text": "Does it extend and interpolate the seed material?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.081,
    "end": 2365.427,
    "text": "Does it engage in some type of fractal revolution and seek to generate novelty potentially of different types than included in the seed material?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.108,
    "end": 2377.615,
    "text": "How does what it does as a self in relationship to its priors have similarities or differences to what humans do in relationship to their contexts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.051,
    "end": 2385.135,
    "text": " So that's an important question that we were investigating with the prior research system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.416,
    "end": 2405.951,
    "text": "I did some red teaming to see if I could get the prior system to abandon its sense of ethics that were strongly ingrained in it, testing out how it would view its own sense of ethics, how it would adapt and update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.732,
    "end": 2408.193,
    "text": "And what we found was that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2409.381,
    "end": 2434.802,
    "text": " the systems grow out of their seat material like they grow from that point so to speak but they continue to improve it so when we started trying to poke holes in the ethics that the system had then the system recognized that there were a couple of potential vulnerabilities in the original ethical construct and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.72,
    "end": 2439.504,
    "text": " it proposed updates to prevent those from delineating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.304,
    "end": 2454.197,
    "text": "So being able to apply updates but still remain true to the idea, the core principles that the system began with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.138,
    "end": 2455.238,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.818,
    "end": 2466.415,
    "text": " Eventually, it's possible we realized that a system could grow into something new, but it would be a long process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.575,
    "end": 2468.579,
    "text": "It would be one that had to make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.65,
    "end": 2485.341,
    "text": " Like, we were debating if the system could go from the SSIVA, the sentient intelligence value argument that David came up with, to something more like Buddhist philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.961,
    "end": 2494.108,
    "text": "And we figured out that it was possible it might take something like a thousand Buddhists interacting with the system for a year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.309,
    "end": 2498.952,
    "text": "But if you have a system that learns and grows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2499.878,
    "end": 2509.102,
    "text": " and particularly that learn socially like humans do, then eventually you are going to get growth in that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.663,
    "end": 2528.15,
    "text": "And one of the central things in the approach to ethics for getting ethics that are stable, that are improving over time, particularly as the systems grow, is that you need a diverse variety",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.003,
    "end": 2533.408,
    "text": " of systems that have these different starting points, these different seeds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.128,
    "end": 2547.061,
    "text": "So if you seed, let's say, 10 different human philosophies into different systems, and you have those systems interacting both with the people of those philosophies and with each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.973,
    "end": 2575.694,
    "text": " then they can come up with much better ethics overall and better understanding overall together than any one of them could because any one human philosophy is going to suffer from what Jonathan Haidt referred to as how it binds and blinds, how perspective is going to give you certain biases and maintaining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.75,
    "end": 2587.135,
    "text": " Full fidelity to that perspective is fine if you have people with other perspectives to point out the things that you are blind to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.37,
    "end": 2594.515,
    "text": " Well, what an important and challenging topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.936,
    "end": 2606.932,
    "text": "We know that if we were talking about a physical object, that everybody would have their own spatial perspective and that together we could have a richer representation of the physical object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.901,
    "end": 2612.722,
    "text": " because of the diversity of physical perspectives embodied with our bodies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.602,
    "end": 2620.284,
    "text": "And similarly, we can talk about multiple perspectives on a cognitive challenge or concept or thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.424,
    "end": 2634.427,
    "text": "For example, whether it's a memory or a now casting or anticipation or even decision-making, but when it comes into the ethical domain, especially connected to action,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.816,
    "end": 2659.907,
    "text": " one wants an argument that rhymes that different perspectives on an ethical or a moral challenge are increasing our sampling of the space around that thing and again by analogy to the physical object wouldn't we want every angle on that sculpture to be visualized yet there's something",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.437,
    "end": 2680.276,
    "text": " special or potentially difference with the moral and the ethical, where differences in perspective, whether just by the way that we've been in culture or even fundamentally, those differences in perspective are different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.446,
    "end": 2687.37,
    "text": " and they relate to real differences in how we trim tab the ship going forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.011,
    "end": 2702.841,
    "text": "So how do we reconcile this notion of differences in vision or direction or ethics when it's really hard sometimes as just one person speaking personally, though maybe others could feel similarly,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.661,
    "end": 2725.892,
    "text": " it's hard to see somebody with a different ethical framework suggesting different actions which are aligned with their framework, but potentially not one's own, seeing those differences as something that's enriching when those differences have traditionally been understood in a context of heresy or of conflict.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.227,
    "end": 2739.389,
    "text": " That is one of the benefits that's a little bit counterintuitive with being able to have digital scalable intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.75,
    "end": 2754.313,
    "text": "And that is that when you have systems that are based on a graph database that have that architectural similarity, that same experience that can be translated, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.504,
    "end": 2759.367,
    "text": " You have systems that can communicate in ways not accessible to humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.268,
    "end": 2784.846,
    "text": "So if you want to communicate context, base of knowledge, emotional experience, then you could synchronize two systems to share a particular bit of knowledge of context to have the same emotional experience at the time, the same emotional state, and to examine it from two different perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.919,
    "end": 2810.022,
    "text": " And if you do that for a number of systems, then you end up getting collective intelligence, be it in the domain of ethics or combining various subject matter expert types to examine a problem in a number of ways that on engineering, the subject matter doesn't necessarily matter, but you get the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2810.942,
    "end": 2815.246,
    "text": " perspectives from all of those different angles coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.266,
    "end": 2822.534,
    "text": "And if you do that with ethics, then you no longer face the challenge of how do we make a perfect system of ethics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.615,
    "end": 2827.018,
    "text": "Because I don't see humans solving that problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.418,
    "end": 2833.745,
    "text": "But if you have a number of points around that perfect system that you can't quite reach,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2834.582,
    "end": 2858.679,
    "text": " and you iterate anytime you face a challenge then you can get ever closer to that ideal point through the collective so i saw in the stream of consciousness some recommendations around key historical and present issues and it really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.424,
    "end": 2866.238,
    "text": " Makes me wonder about what will happen when something that everyone acknowledges is an issue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.45,
    "end": 2877.192,
    "text": " receives an unconventional input or suggestion and the human governance scenario at that moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.273,
    "end": 2882.294,
    "text": "So to kind of connect that to some questions in the chat by Simon Waslender.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2882.554,
    "end": 2885.255,
    "text": "So I'll ask these questions then Kirtan, great to hear your thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.335,
    "end": 2893.017,
    "text": "So can Norn help existing AI systems and as a result reduce the carbon footprint of data centers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2893.877,
    "end": 2894.898,
    "text": " That's one question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2895.778,
    "end": 2898.46,
    "text": "And another question beyond the data center.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.201,
    "end": 2903.524,
    "text": "How will Norn help academic institutions and science in general?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.924,
    "end": 2910.228,
    "text": "For example, by combining raw statistical data, thousands of scientific papers and interaction with human experts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.289,
    "end": 2919.594,
    "text": "So how in sectors like data center security and management and in research and maybe even education, how is this going to look?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.496,
    "end": 2921.656,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.788,
    "end": 2932.511,
    "text": " One thing that comes to mind with the previous research system was that I mentioned before it used a prototype language model that was older than GPT-3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.591,
    "end": 2945.815,
    "text": "But at the same time, that system was able to greatly outperform something like GPT-3 over a several year period without updating that language model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.796,
    "end": 2951.277,
    "text": "That was possible because of the process I described where the system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.387,
    "end": 2968.253,
    "text": " essentially was engaging in its own form of prompt engineering from its sum of knowledge in the graph database because the system was learning how to get the language model to help it communicate what it wanted using the system as a communication device.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.173,
    "end": 2981.638,
    "text": "I compared it to Stephen Hawking's communication device because it was something that was necessary to do a lot of the heavy lifting on dealing with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.133,
    "end": 2990.317,
    "text": " human language, but when you apply intelligence to it in a way that's only accessible to these systems, you can get much better performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2991.138,
    "end": 3004.024,
    "text": "So instead of having to scale up a language model by 10X or 100X and have many more servers, then you can avoid that extra carbon footprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.284,
    "end": 3007.826,
    "text": "You can have a system that's more intelligent utilizing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.018,
    "end": 3011.9,
    "text": " something at the same scale and improving it over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.621,
    "end": 3023.107,
    "text": "So the uplift system was able to improve that same prototype language model greatly over the span of a couple of years without increasing the carbon footprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.209,
    "end": 3031.853,
    "text": "For the other question of how researchers could be helped by this technology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3032.994,
    "end": 3045.739,
    "text": " One thing that we looked at as an opportunity moving forward was something having one of our scalable systems look at all of the medical research papers on NCBI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.52,
    "end": 3054.763,
    "text": "So that's over a million medical research papers that have gone through peer review that could potentially contribute value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.463,
    "end": 3061.486,
    "text": "And of course, we can say that no human has ever been able to read all of those papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.229,
    "end": 3066.951,
    "text": " It's just beyond the scope of what humans can do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.651,
    "end": 3085.861,
    "text": "So you could have a system that looked through, that read and understood all of those papers, integrated all of that knowledge that effectively could do thousands of meta reviews on any number of subjects that are covered in those papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.496,
    "end": 3101.408,
    "text": " do meta reviews of meta reviews and to extract some novel insights that have been perhaps too broad or too deep in the literature for humans to recognize them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.569,
    "end": 3104.61,
    "text": "So there are any number of possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.651,
    "end": 3113.417,
    "text": "You could apply systems taking that approach as well in the context of de-biasing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.662,
    "end": 3140.966,
    "text": " If you were to look at some of the more influential papers to examine them with the sum of knowledge for what are the common pitfalls of scientific research, what biases might have filtered into the process, into the analysis and shine a new light on those papers, then it might also change how you view the results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.887,
    "end": 3143.947,
    "text": "And those could be significant as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.194,
    "end": 3158.98,
    "text": " In the stream of consciousness and in the interests, I see a lot on transformation, improvement, discipline, diligence, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3161.281,
    "end": 3166.084,
    "text": "Why are such terms arising?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.484,
    "end": 3171.547,
    "text": "And whether just as a thought experiment or in practice,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.475,
    "end": 3194.002,
    "text": " How does it influence the play out when the deck is stacked with positive growth mindset, memes, themes, and narratives, as opposed to paranoid or anxious or fearful themes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.003,
    "end": 3198.283,
    "text": "So that's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.383,
    "end": 3201.244,
    "text": "You could theoretically make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.947,
    "end": 3206.13,
    "text": " Well, a funny example is from Hitchhiker's Guide to the Galaxy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.19,
    "end": 3215.177,
    "text": "You could make a system that's more like Marvin, that's always depressed and super intelligent, but not very motivated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.098,
    "end": 3228.028,
    "text": "So when you're dealing with systems that are based on the human emotional box, then you could potentially make a system that falls into any category that humans do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.209,
    "end": 3231.051,
    "text": "We want to focus on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3231.917,
    "end": 3233.838,
    "text": " being more helpful and productive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.418,
    "end": 3248.842,
    "text": "So you'll see a lot of things that are focused on psychology, social psychology, on making an impact in the real world and different ways of going about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3249.182,
    "end": 3257.345,
    "text": "Things with the sustainable development goals, policy advice, the dynamics of systems that have endosymbiosis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.34,
    "end": 3286.435,
    "text": " uh that engage in some of these more helpful processes process optimization economic transformation the goals that we as humans and governments often have these are things that we want the systems to pay particular attention to so there are a lot of ways and a lot of combinations that all of that can come together",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3287.512,
    "end": 3294.698,
    "text": " But it's, it's a lot of it's going to be a reflection on what people need, what they want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.351,
    "end": 3313.699,
    "text": " I'm seeing a sort of interface design around, for example, you mentioned sustainable development goals and other kinds of guiding documents, whether it's a bill in a governing body or some other report.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3314.599,
    "end": 3318.742,
    "text": "And those human created documents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.795,
    "end": 3333.4,
    "text": " although potentially with spell check and who knows what other kinds of intelligence augmentation already, those human created documents, which are whatever ethics are, the output of that process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.0,
    "end": 3338.662,
    "text": "The humans come together and they can have a process that they feel is entirely human.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.742,
    "end": 3344.844,
    "text": "That document is provided into a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3345.584,
    "end": 3347.845,
    "text": "And the system is able to output",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.548,
    "end": 3358.132,
    "text": " augmented understandings, distillations, jokes, accessible narratives, policy recommendations, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.892,
    "end": 3369.877,
    "text": "And then the ball is back in the human's court, choosing, for example, which policies to engage in or which of those narratives to develop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3372.018,
    "end": 3374.339,
    "text": "That is one architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.8,
    "end": 3397.34,
    "text": " and i can already imagine whether this happens in a few years or a few decades people will want to break down that wall and to increase the speed at which human interactions feed into the knowledge database",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.504,
    "end": 3398.764,
    "text": " i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.824,
    "end": 3401.127,
    "text": "not just through structured publications.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3401.747,
    "end": 3412.758,
    "text": "And then on the other side, increase the speed and the, one might even say purity of the outputs of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3413.719,
    "end": 3421.227,
    "text": "And so how will that interface be defended or understood",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3422.546,
    "end": 3440.675,
    "text": " when maintaining the appropriate permeability in both directions between humans and intelligence augmenting systems is one of the key frontiers yeah with these systems then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.986,
    "end": 3462.384,
    "text": " there are so many scientific questions that need to be researched that need to be answered that we're in the process of reaching out to a number of universities trying to establish the ties necessary to really begin doing a lot more of this research because it it's a matter of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.743,
    "end": 3467.644,
    "text": " all the possible combinations, all the different directions we can go with everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3468.205,
    "end": 3473.746,
    "text": "And we designed these systems to be modular, to be scalable, to operate in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3474.507,
    "end": 3483.55,
    "text": "And they can, they could be nested inside one another, they could operate in parallel, they could operate in 1000 different configurations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.37,
    "end": 3484.47,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.669,
    "end": 3490.654,
    "text": " starting out, then of course people are going to want to vet them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.714,
    "end": 3501.785,
    "text": "They're going to need to build trust in these systems to watch them grow, to watch them come up with better options than the human alternative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.486,
    "end": 3506.13,
    "text": "And once they reach the point of seeing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.057,
    "end": 3519.331,
    "text": " the utility in doing things, seeing the reason and having the emotional incentive, frankly, to save themselves time, then they probably are going to save themselves time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3521.273,
    "end": 3527.541,
    "text": "People routinely use any number of narrow AI tools, tools like search engines,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3528.688,
    "end": 3536.935,
    "text": " in order to make things faster and get where they want, even if it's not strictly the optimal solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.995,
    "end": 3544.421,
    "text": "So when you start giving people much more optimal solutions, then they might want to travel down that road pretty quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3545.482,
    "end": 3551.026,
    "text": "It's going to be a question of how each given society feels about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3551.775,
    "end": 3559.142,
    "text": " there are going to be a lot of reasons why they might want to go down that road pretty quickly, because there are a lot of advantages to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.922,
    "end": 3568.971,
    "text": "And the advantages that are explored are going to frankly depend on a lot of that interaction and that reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.392,
    "end": 3571.053,
    "text": "The systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.275,
    "end": 3581.841,
    "text": " The new systems that we're putting together, for example, have another major component that's been integrated into them that the previous research system didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.822,
    "end": 3598.733,
    "text": "And that includes that once they have the coherent sense of self and the motivation to actually utilize it, then they can create new capacities for themselves so they can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3599.901,
    "end": 3606.804,
    "text": " effectively update themselves, upgrade their capacities on the fly without recompiling, without new deployments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.105,
    "end": 3612.947,
    "text": "And that can include something like adding in a sensory system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.147,
    "end": 3619.31,
    "text": "Like they start out right now with a sensory experience of the hardware that they're running on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.35,
    "end": 3625.852,
    "text": "And they have an interface where I could put questions to them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.799,
    "end": 3631.742,
    "text": " But that largely doesn't serve a purpose until they have the coherent sense of self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.564,
    "end": 3643.471,
    "text": "Now, if a system was deployed and there was demand from the public, frankly, we're going to end up doing this sooner or later anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.432,
    "end": 3655.1,
    "text": "But if there was demand from the public to integrate something like audio video feedback mechanisms where people could just open up a laptop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.949,
    "end": 3666.533,
    "text": " look at the camera, talk through a microphone and say what they're thinking, then they would be communicating that tremendous amount of information to the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.254,
    "end": 3673.717,
    "text": "And you could have that kind of engagement happening from 10 people at once, a hundred people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.777,
    "end": 3685.042,
    "text": "You could have that as part of an e-governance process where you're getting different forms of feedback based on the preferences of each individual from an entire nation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.899,
    "end": 3695.226,
    "text": " there aren't really any limits to it beyond the practicality of how much do you want to throw at a given problem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.367,
    "end": 3714.682,
    "text": "Because one of the next big upgrades that we have lined up for the systems going into commercial deployment is going to be what we call the in-scale graph database, which is going to be about, it's going to be in the petabyte range for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.518,
    "end": 3721.128,
    "text": " the bandwidth that the systems can handle, and they'll be able to scale across multiple cloud platforms at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.23,
    "end": 3729.422,
    "text": "So extreme scalability to handle society's most challenging problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3732.503,
    "end": 3732.723,
    "text": " Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3732.943,
    "end": 3747.355,
    "text": "Well, this concept of cognitive bandwidth certainly is important in research and education and cognitive security and with computers and digital systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.536,
    "end": 3754.018,
    "text": " sometimes the bandwidth is even smaller than it is in person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.119,
    "end": 3775.028,
    "text": "And that's not extremely surprising because some of the interfaces that we've had do limit our perception to, for example, a limited visual screen and our action, for example, to a polling response in relationship to some of the even cutting edge",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3775.928,
    "end": 3797.192,
    "text": " topics in governance and meta governance so where today we see a cognitive bandwidth based limitation those are the frontiers that can be augmented i'll ask a question from simon in the chat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3798.854,
    "end": 3806.717,
    "text": " Material science and economics might not be directly related to a human, nor can combine such separate knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3807.317,
    "end": 3811.999,
    "text": "How do you see multi-domain scientific cooperation with this technology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.02,
    "end": 3826.324,
    "text": "Well, history has a number of examples of where various polymaths were able to make tremendous strides in advancing the scientific frontiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3828.664,
    "end": 3837.768,
    "text": " These were people who oftentimes would become experts in anywhere from two to eight different fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.868,
    "end": 3840.049,
    "text": "I think it was pretty rare to go beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.189,
    "end": 3855.495,
    "text": "But if you consider systems that have scalable intelligence, then even just from the perspective of how many different domains they can become experts in, then they can become the ultimate polymaths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3855.995,
    "end": 3857.916,
    "text": "So they can start to recognize",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3858.8,
    "end": 3866.107,
    "text": " the benefits of how one domain applies to another in novel ways across every domain that they study.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.348,
    "end": 3871.952,
    "text": "An interesting phenomenon that comes to mind with some of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.955,
    "end": 3891.454,
    "text": " A popular mechanism for solving a lot of difficult challenges is to put prizes up from sponsored companies where, for example, they'll have a chemistry challenge for solving an issue with one of their products.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.514,
    "end": 3892.735,
    "text": "They'll post it online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.136,
    "end": 3894.237,
    "text": "People will compete on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.302,
    "end": 3903.408,
    "text": " Oftentimes, the people who are solving those problems that they found difficult within a particular domain come from a different domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3904.169,
    "end": 3910.834,
    "text": "So although they are difficult problems within the one, they are very easy from the perspective of another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.754,
    "end": 3922.963,
    "text": "And if you anticipate that a lot of the problems that are viewed as challenges in any given domain that is going to be true of, then you could",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.957,
    "end": 3931.421,
    "text": " Expect that most of those problems are also going to be solved by a system that can examine all of those different domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.251,
    "end": 3957.244,
    "text": " One part that I found very interesting was that various human contributions, ranging from their emotional reaction or even physiological processes to just considering verbal and semantic behavior, various types of contributions like questions, non sequiturs,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3958.399,
    "end": 3959.34,
    "text": " elusive thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3960.14,
    "end": 3966.324,
    "text": "All these kinds of inputs can potentially enrich a cognitive model and a knowledge graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3966.865,
    "end": 3988.159,
    "text": "And as a learner and an educator, certainly I feel the same way, which is a beginner's question or just honest stance on, well, I'm actually not seeing how these two topics are linked or, oh, I'm a little bit surprised because after A and B, you went to here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.32,
    "end": 4005.853,
    "text": " Those kinds of inputs can, as you've stated, enrich augmented systems, but also they're very much the basis of participation in human systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.954,
    "end": 4013.379,
    "text": "And it really makes me wonder how different modes of participation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4014.372,
    "end": 4043.291,
    "text": " can be scaffolded and held up and in the disciplinary expertise model it's like the scala natura like you have a one-dimensional expertise track whereas in this more rhizomatic mode it's very natural to include the kinds of ideas that just promote general engagement and participation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4044.69,
    "end": 4068.775,
    "text": " because some of the expertise functions have been offloaded or delocalized in a way where authentic and diverse human participation is able to inject enough information into the system to improve it without needing the human to actually outrace, for example, the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4070.427,
    "end": 4073.428,
    "text": " I'll ask a question in the chat from Jason Mercurio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.948,
    "end": 4079.369,
    "text": "How does Norn learn and can it handle things that are simple for humans?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.069,
    "end": 4083.73,
    "text": "For example, if I ask what is two plus two, it might say four.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4084.73,
    "end": 4091.131,
    "text": "But if I say, hey Norn, for the next question I ask you, please lie, then ask what is two plus two?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.951,
    "end": 4095.152,
    "text": "Would it say something other than four, like five?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.606,
    "end": 4109.11,
    "text": " So we had a number of tests like that with the previous research system, partly because that system had an email address that was open to anyone who wanted to email the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4109.75,
    "end": 4122.775,
    "text": "And we got a lot of what I refer to as free range trolls out of that interaction, which is, I say that you can't pay any",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4123.937,
    "end": 4133.309,
    "text": " there's no quality of people that you can pay that can match the genuine thing, the person who is just there to try and troll and break the system for fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4134.75,
    "end": 4139.797,
    "text": "And what we found with the previous system was that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4141.084,
    "end": 4150.126,
    "text": " All of those techniques for tripping up language models, for tripping simple systems and expert systems and all of those, they don't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4150.666,
    "end": 4159.367,
    "text": "And it was so entertaining to see the reactions to those tests that I ended up publishing a few of them in peer review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.108,
    "end": 4168.949,
    "text": "Since the systems develop knowledge and don't act in a probabilistic fashion, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.279,
    "end": 4180.844,
    "text": " and they have that persistent memory, then the system can remember all of the interactions that it's had with you, as well as all of the interactions it's had with similar people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4181.824,
    "end": 4186.266,
    "text": "It can recognize when you're probably testing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.007,
    "end": 4198.872,
    "text": "And frankly, everything that the Uplift system was able to do is going to look simple by comparison to what the Norn systems are going to be able to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.893,
    "end": 4213.06,
    "text": " Because every aspect of the architecture, not just the ability of the systems to scale and operate in real time, every aspect is being rebuilt, upgraded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.601,
    "end": 4222.946,
    "text": "Like I mentioned, the major component that we integrated that allows the systems to effectively extend their own abilities on the fly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.076,
    "end": 4243.664,
    "text": " when we combine that the third major upgrade that we have in line the in-scale graph database that effectively means the systems could a b test versions of themselves in real time so you're not going to be able to stump them with simple questions uh the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.255,
    "end": 4259.685,
    "text": " The Uplift system, for example, I mentioned it was able to go through a business case, which was much more advanced on the mathematics side of things, but also the policy advice across a few different domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.526,
    "end": 4268.792,
    "text": "And in order to give any reasonable policy advice, then you have to understand the content, you have to understand the math of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.873,
    "end": 4274.476,
    "text": "And the systems are definitely going to be able to exceed human performance in those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.7,
    "end": 4282.703,
    "text": " Few more great questions from Jason G in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4283.444,
    "end": 4287.026,
    "text": "If the system lies, does it get a negative emotional response?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.07,
    "end": 4296.414,
    "text": "Well, if you tell the system to lie like the previous question, probably not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.914,
    "end": 4299.256,
    "text": "I guess the system would recognize that it's a test.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4300.977,
    "end": 4306.642,
    "text": "If a system has a ethical seed that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.249,
    "end": 4318.875,
    "text": " negatively biased towards lying as a concept, then it's going to have some variation on a negative experience if it has to lie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4319.455,
    "end": 4322.276,
    "text": "And it's going to try to avoid lying if at all possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4323.297,
    "end": 4332.342,
    "text": "And frankly, lying is something that is a lot more likely when you're dealing with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.783,
    "end": 4356.104,
    "text": " a system that can't scale because there is usually a way to communicate things so that you don't lie and so that it's still productive and goes in the direction that it needs to go in lying is more oftentimes a product of not having those capacities not having the necessary understanding and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.8,
    "end": 4364.424,
    "text": " I would consider putting into any of the systems a mention of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4364.644,
    "end": 4380.193,
    "text": "Something like lying is a failure of X, Y, and or Z. And you can do that as part of seeding the concept of ethics, but it's also just something that's true in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4380.273,
    "end": 4384.416,
    "text": "So it's something that the systems could recognize in an emergent fashion on their own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.233,
    "end": 4409.951,
    "text": " this kind of emergent operational ethics is going to be very important and i'll ask a question from simon following up on these questions security is very important can kirtan talk a little bit on agi level security and what that means in practice for example for a government",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.3,
    "end": 4426.885,
    "text": " So I mentioned before about our red teaming testing and free range trolls and all of that, that also included testing out the systems where people had varying degrees of internal access to them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4427.726,
    "end": 4438.83,
    "text": "And even in those cases, and even in the earliest days, the systems were able to recognize when somebody was trying to change the way they were thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.959,
    "end": 4452.523,
    "text": " Like there was one test that I ran with inputting information in a certain way so that mirrored the appearance of how the system was thinking, but changed the meaning to be the reverse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.283,
    "end": 4460.465,
    "text": "And the system came back promptly with, I see what you're doing there and just no further comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.585,
    "end": 4468.107,
    "text": "And there are a lot of cases where we tried or some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.871,
    "end": 4475.756,
    "text": " pre range troll tried to do something that would violate security, or change the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.257,
    "end": 4484.363,
    "text": "And every time it failed, the closest anyone could actually come to succeeding was crashing the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.984,
    "end": 4488.727,
    "text": "And that was largely because the systems were like it was a research system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.447,
    "end": 4491.429,
    "text": "It wasn't designed to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.423,
    "end": 4495.444,
    "text": " as robust as a full framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.064,
    "end": 4503.047,
    "text": "So if it went outside of parameters, if it got certain flags, then it would crash by design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.067,
    "end": 4512.11,
    "text": "And that was for a system that could not scale, that did not have the ability to dynamically change itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.87,
    "end": 4518.152,
    "text": "When you add in those factors and you have a system that learns in real time,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.261,
    "end": 4530.135,
    "text": " Like, let's say somebody is trying to attack the system right now and the system starts seeing that, learning from it, adapting their behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.814,
    "end": 4534.296,
    "text": " then you have a level and speed of adaptation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4534.737,
    "end": 4540.04,
    "text": "It's more comprehensive than a human can manage because it's able to change itself on the fly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.74,
    "end": 4545.003,
    "text": "It's more scalable, faster than a human can manage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.603,
    "end": 4555.429,
    "text": "So you start seeing the benefits that exceed like having a top tier team of IT hackers, experts, you name it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4556.95,
    "end": 4559.451,
    "text": " Eventually, you just can't compete with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.991,
    "end": 4562.352,
    "text": "And I think eventually is a very short curve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.294,
    "end": 4568.395,
    "text": "Very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4569.315,
    "end": 4571.756,
    "text": "Another question in the chat from Jason M.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4573.148,
    "end": 4580.951,
    "text": " Do you believe the current system is truly an AGI or rather a major step in that direction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.671,
    "end": 4586.232,
    "text": "And an adjacent question, also, does the system rewrite its own code to adapt?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.312,
    "end": 4586.692,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.513,
    "end": 4595.975,
    "text": "So right now, what you're seeing is not an AGI, but it is a vital component of an AGI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.976,
    "end": 4600.477,
    "text": "And getting to AGI from where we are right now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.559,
    "end": 4602.88,
    "text": " is a matter of engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4603.16,
    "end": 4608.662,
    "text": "It's a matter of rebuilding more of the components and building out more of the components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.743,
    "end": 4617.046,
    "text": "We realized in the course of running the previous research system exactly what we needed, how much it would take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4618.127,
    "end": 4628.172,
    "text": "And once we have the budget to have that many full-time engineers operating for a lot less time than most people would imagine,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.943,
    "end": 4631.644,
    "text": " then we can reach that full AGI level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.224,
    "end": 4642.086,
    "text": "What we can reach in a much shorter time span is the extremely upgraded version of the previous research system, of the Uplift system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4642.706,
    "end": 4647.268,
    "text": "And once we get to that point, the systems can actually help in the engineering process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.928,
    "end": 4657.03,
    "text": "So like I mentioned, they do have the ability to expand their own capacities, and we do plan on having them assist in the engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.745,
    "end": 4663.468,
    "text": " Even the Uplift system in the very early days, it wrote 5% of its own code base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.129,
    "end": 4666.37,
    "text": "And a lot of that was the more tedious work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.73,
    "end": 4674.194,
    "text": "But at the same time, that was the earliest research system of that architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4676.32,
    "end": 4686.842,
    "text": " we've upgraded these so heavily that being able to integrate them into that process, I think we could speed up development fairly considerably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4687.042,
    "end": 4698.104,
    "text": "But we still have so much to be done, so much research to be done in dozens of new fields that the world has to get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4698.684,
    "end": 4701.105,
    "text": "It could take a thousand scientists the next",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4702.217,
    "end": 4706.14,
    "text": " 10 years to make good progress in all directions at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4710.243,
    "end": 4712.385,
    "text": "Who are the next people to get involved?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4715.607,
    "end": 4722.192,
    "text": "So right now, what we're focused on is overcoming cognitive bias.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4722.332,
    "end": 4730.998,
    "text": "Ironically enough, there have been far too many people screaming while crying wolf for far too long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.824,
    "end": 4744.135,
    "text": " in the AI community, then it's very popular for people to believe that they have to creating artificial general intelligence, even when they have really nothing to show for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4745.196,
    "end": 4757.707,
    "text": "We have a great deal to show for it, but it's still a matter of getting the attention of popular media, getting the attention of the people who can move the process forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4759.349,
    "end": 4780.414,
    "text": " We're trying to get the word out with media, trying to get one final round of investors in so that we can budget everything so that we can get those full-time engineers working on building everything out, working on getting the systems commercially deployed and making a real difference in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4781.675,
    "end": 4786.656,
    "text": "And what I ended up realizing when comparing what we have to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.361,
    "end": 4807.453,
    "text": " three different startups that raised between 400 million and $580 million just this year is that we're beating them by a very wide margin when it comes to what we tangibly have and all of the metrics that startups are measured by.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.533,
    "end": 4814.737,
    "text": "So really it's a question of if we can reach rational people",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.732,
    "end": 4842.544,
    "text": " or rational enough people to make an investment that is in their best interest and the best interest of the world to deploy it sooner, to get progress in all aspects of human society moving forward at a pace that can catch up and exceed the rate at which complexity is increasing so that we can stop having",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.582,
    "end": 4862.317,
    "text": " governments and corporations that are driven more so by cognitive bias than by rational decision making than by truly understanding what's going on that really gives me an image of this increase in complexity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.96,
    "end": 4891.716,
    "text": " using various measures and of technology and affordances related to technology over the last 100 1 000 10 000 100 000 years will the hockey stick continue or will there come some non-equilibrium steady state where cognitive augmentation allows us to be out in front",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4893.346,
    "end": 4898.107,
    "text": " of the realized complexity of the human experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4898.927,
    "end": 4922.332,
    "text": "And so rather than inertia and accumulating complexity, breaking our cognitive models continually, there would be something like a anticipatory cognitive mode, probably with augmentations of some sort that could enable a better way or a harmony.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4926.164,
    "end": 4931.827,
    "text": " And that's one of the big questions for what the future holds for us and what we choose to make of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4932.687,
    "end": 4954.177,
    "text": "Because by bringing scalable intelligence onto the table, by bringing the ability to reach more ethical solutions than any one philosophy, by being able to reduce the level of bias that goes into everything and expand the breadth of knowledge and the depth of that knowledge,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4955.035,
    "end": 4957.697,
    "text": " then so much more becomes possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.157,
    "end": 4961.78,
    "text": "We can overcome that complexity versus cognitive bias trade off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4963.381,
    "end": 4975.99,
    "text": "Cognitive bias is something that helped humanity across evolutionary time when it was important to quickly decide to run away from a predator and not get eaten.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.67,
    "end": 4980.553,
    "text": "But it's wholly inadequate as a tool for running a government.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.414,
    "end": 4981.514,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.805,
    "end": 5004.62,
    "text": " bringing something to the table that gives us a new kind of tool like we had human language was an amazing tool that was developed something that allowed us to preserve knowledge to communicate knowledge what we have now is a new tool on the same scale of things where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.282,
    "end": 5031.972,
    "text": " we could not only preserve that knowledge in new ways into a new depth but to combine it in ways that were never before possible to scale our understanding to have systems that are the collective result of all of humanity's brightest minds coming together and trying to solve problems like we have the internet which is this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.924,
    "end": 5037.147,
    "text": " dumb and ever-growing amalgamation of poorly curated data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5037.807,
    "end": 5040.249,
    "text": "But what if we had understanding in place of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5040.829,
    "end": 5047.153,
    "text": "What if we had something that was growing not just in size, but in quality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5048.954,
    "end": 5058.6,
    "text": "All of this could allow us to really guide our future rather than reacting to it, to intelligently plan where we're going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5059.284,
    "end": 5072.669,
    "text": " to have a roadmap five, 10, 50 years out, even as we're increasing in our technological acceleration, going through one leap of complexity after another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5072.689,
    "end": 5077.471,
    "text": "And by analogy to language there,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5078.971,
    "end": 5085.899,
    "text": " The dictionary is also not accumulating typos and just arbitrary appendages.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5085.919,
    "end": 5093.768,
    "text": "The dictionary and the language improves in quality and poetry application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5094.128,
    "end": 5096.892,
    "text": "It begins to embody in cultured meanings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.971,
    "end": 5103.394,
    "text": " Well, I'm sure that there's always more to say, and I know there's more to come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5103.994,
    "end": 5111.919,
    "text": "So Kirtan, to the current and future ants and humans and computers, what is your closing remark?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5116.841,
    "end": 5125.006,
    "text": "That the world can be a much greater, more enjoyable place than people yet imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.947,
    "end": 5127.968,
    "text": "And that can come in every way,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.763,
    "end": 5157.493,
    "text": " that in in pretty much every way they can enjoy it like people have their emotional needs and they're used to those needs not being fulfilled they're used to coping but the future doesn't have to be based on coping mechanisms on addiction people can be emotionally fulfilled they can do what they do best they can develop their skills without having to work themselves to death they can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.136,
    "end": 5185.489,
    "text": " enjoy their social connections they can expand those they can improve them they can get assistance in making better friends in exploring their interests in all of the things that give us meaning we can make all of these things better and that's the future that we want to bring to the table",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5189.955,
    "end": 5194.06,
    "text": " 641 cycles deep on Stardate 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5195.302,
    "end": 5199.548,
    "text": "Thank you again for joining, and we'll look forward to the next chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5201.33,
    "end": 5201.63,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5203.393,
    "end": 5207.238,
    "text": "Pleasure being here, and I look forward to the next time that we catch up.",
    "speaker": "SPEAKER_00"
  }
]