[
  {
    "start": 8.35,
    "end": 9.932,
    "text": " Hello and welcome, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.913,
    "end": 19.063,
    "text": "It is September 19th, 2023, and we are in ACTIV MathStream number 7.1 at the ACTIV Inference Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.684,
    "end": 23.769,
    "text": "We're here with Vincent Wang Maschinitza and guests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.831,
    "end": 29.717,
    "text": "It should be quite a discussion, certainly a unique one by what we can already see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 30.238,
    "end": 32.22,
    "text": "So thank you all for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.821,
    "end": 37.767,
    "text": "We'll be looking forward to this presentation and interleaving discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 39.923,
    "end": 65.475,
    "text": " thanks dan um so hi my name is vincent and uh with me today also is hamza in the audience uh we're both authors on this paper that we'll be talking today constructor theory as process theory um so uh what should the format of this discussion be so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 66.738,
    "end": 80.967,
    "text": " I'd like to tell you a bit about constructor theory and process theory, and then sort of have a discussion about the sort of diagrammatics of process theory, how that might fit with active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 81.52,
    "end": 111.527,
    "text": " um and all whiskey you know you can view it as an exercise and sort of seeing things in a diagrammatic way um so i'll get started and the structure will be roughly i'll talk about what constructor theory is first just from a conceptual level because i'm the only non-physicist among the authors of this paper um hans is a physicist so any questions about specific examples is there to be directed to hansa and then you know after that i'm going to do just a sort of lightning fast introduction to what a process theory is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 111.507,
    "end": 138.527,
    "text": " and then we'll put the two together and then we'll have a discussion and throughout I will be making pauses to sort of invite questions and make sure everyone is on the same page conceptually but everything should be super super easy uh because I think all the ideas really are you know fundamentally they're quite simple okay so without further ado what is constructor theory constructor that's a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 140.127,
    "end": 161.41,
    "text": " so you may have heard of this already because there's quite a lot of hype they have a they have a very good pr machine if nothing else so among other things it's been described as and i think this is from quanta article a master theory the set of ideas so fundamental that all other theories would spring from it and in fact if you go to deutsche's original paper",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 161.862,
    "end": 162.703,
    "text": " on constructive theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 162.743,
    "end": 171.196,
    "text": "He goes so far to say that all other theories of physics, you know, we'll call them, you know, it doesn't matter if it's thermodynamics or quantum or relativity, gravity, whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 171.356,
    "end": 176.444,
    "text": "We'll just call them subsidiary theories because that's how big and important constructive theory is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 177.546,
    "end": 182.553,
    "text": "And, you know, there's this eponymous book by Chiara Moleto, The Science of Canon Cat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 183.675,
    "end": 190.806,
    "text": "I want to say that, oh, well, you know, constructive theory is about counterfactuals and what is and isn't possible in the domain of physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 191.883,
    "end": 198.8,
    "text": " And all this sounds really impressive, but the question is, what do you mean by this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 198.86,
    "end": 208.103,
    "text": "So how this all started is some of Chiara's students, Anicet and Ria Valiaris, they came over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.707,
    "end": 227.678,
    "text": " to the wolfson quantum foundations discussion and they were nice enough to sit down and tell us about what constructive theory really is because you know historically it's been really difficult to sort of pin down you know to pin down like what is the math uh what do you really mean here by all these words",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 227.658,
    "end": 257.395,
    "text": " and uh well these you know they're happy to say look you know it's a meta theory you can sort of bring your own mathematics you know what we really there's a sort of methodological approach of uh constructor theory that's more important than the specific mathematics that you want to use to instantiate all these words like what is a constructor what is possible what is impossible but okay i'll tell you conceptually what constructor theory is so first i want i want you to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 258.691,
    "end": 263.877,
    "text": " Let's talk about a space of conceivable processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 264.818,
    "end": 266.219,
    "text": "Conceivable is the word here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 268.822,
    "end": 277.011,
    "text": "The use of the word conceivable will become clear soon because we're going to cut this space shortly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 278.132,
    "end": 281.236,
    "text": "And what are the sorts of conceivable processes that we might have?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 281.256,
    "end": 282.878,
    "text": "Well, let's look at a limited subset.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 282.898,
    "end": 283.979,
    "text": "Let's talk about ice cream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 285.28,
    "end": 287.803,
    "text": "This is a sort of simple process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.1,
    "end": 314.027,
    "text": " that can always happen which is you might have some ice cream you leave it out for too long and the ice cream melts comes a puddle this is you know we want to say this is obviously a conceivable process there's another conceivable process where the opposite thing happens you have the ice cream that's melted and then it spontaneously unmelt and becomes an ice cream again this is a conceivable process as well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 314.817,
    "end": 320.929,
    "text": " And then there's the straight up ridiculous stuff that we know for sure is not going to happen in the domain of physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 320.989,
    "end": 337.5,
    "text": "Like, for example, you have an ice cream and then you've got some machine such that you can take it and you put in anything and it performs this process or task of taking your input and copying it, everything perfectly down to the quantum states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 337.919,
    "end": 363.859,
    "text": " you know you're you're cloning the ice cream you may be aware there's this quantum no cloning so we know that this this sort of thing is you know not going to happen nevertheless all of these are conceivable processes um of relationships between possible inputs and possible outputs i should stop using the word possible just inputs and outputs right so what is the aim of constructor theory really",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.683,
    "end": 373.982,
    "text": " Well, it stems from this desire to classify the space of conceivable processes into that which is possible and that which is impossible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 375.606,
    "end": 378.692,
    "text": "Well, what might we say intuitively?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.448,
    "end": 390.066,
    "text": " We might say that, well, we're pretty sure that this ice cream melting stuff, that's possible in terms of some theory of physics that explains everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 390.086,
    "end": 391.007,
    "text": "And I go, okay, fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 391.568,
    "end": 396.276,
    "text": "Some theory of physics that explains what happens to ice cream, definitely want to say that ice cream melting is possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 397.133,
    "end": 404.863,
    "text": " And we definitely, you know, that theory of physics also has got to say that this sort of cloning situation here, that's got to be no good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 405.264,
    "end": 406.245,
    "text": "That's impossible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 407.667,
    "end": 420.504,
    "text": "And then the difficulty comes when you've got the cases in the middle where, okay, well, technically, if we're just using English, I mean, it is conceivable, it is possible that an ice cream can spontaneously reform itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 420.624,
    "end": 421.405,
    "text": "I mean, it can happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 421.445,
    "end": 422.767,
    "text": "The laws of physics don't forbid it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 422.787,
    "end": 424.93,
    "text": "It is simply very, very unlikely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 425.652,
    "end": 435.443,
    "text": " What is Deutsch's idea that we should say, no, no, no, you know, let's do away with the complexities of statistics and just say that that's straight up impossible, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 435.463,
    "end": 442.571,
    "text": "So then the goal of constructive theory is to take the space of conceivable processes and cut it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 443.993,
    "end": 454.545,
    "text": "Just one cut corresponding to on one side, what is impossible and on the other,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 456.297,
    "end": 456.958,
    "text": " What is possible?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 460.422,
    "end": 460.603,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 461.804,
    "end": 471.177,
    "text": "So just using this one sort of concept or duality, what is possible and impossible, it is like you take your space of conceivable processes and you just determine what's possible and impossible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.857,
    "end": 473.86,
    "text": "And here's the subtle part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 474.481,
    "end": 481.11,
    "text": "Then you claim that any theory of physics corresponds precisely to the content of one of these cuts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 483.192,
    "end": 484.414,
    "text": "And what do I mean by that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 486.065,
    "end": 493.263,
    "text": " I mean is that this is one space of conceivable processes that happens to talk about, for example, the dynamics of ice cream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 494.706,
    "end": 497.914,
    "text": "But there are all kinds of conceivable",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.367,
    "end": 526.213,
    "text": " spaces of processes that might govern you know different sort of domain or domains or magisteria or whatever you want to call them of phenomena and the idea is that well you know anytime you have a theory of physics what do you really have you really have just the domain of phenomena that you care about and constructor theory says and in addition to that a cut that tells you whether you know what things are possible in that domain and what things are not possible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 526.936,
    "end": 536.946,
    "text": " And so then every pair of domain plus one of these cuts that tells you what is possible and impossible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 537.584,
    "end": 543.031,
    "text": " is going to kind of encode or summarize, just be a particular theory of physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 544.353,
    "end": 544.553,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 546.576,
    "end": 548.479,
    "text": "And so we can be very empathetic to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 549.881,
    "end": 552.023,
    "text": "We can be very empathetic to this kind of formulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 552.083,
    "end": 565.161,
    "text": "It's a nice thing to try to do to sort of to summarize or have a sort of bird's eye view of all these different theories of physics to try to boil it down to something that's conceptually a bit simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 565.141,
    "end": 567.985,
    "text": " But of course there are problems too, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 568.606,
    "end": 576.537,
    "text": "So one problem is, well, you know, why didn't you call it a possibility theory rather than constructor theory?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 576.597,
    "end": 577.759,
    "text": "I don't know the answer to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 578.279,
    "end": 583.266,
    "text": "But possibility theory sounds a bit too much like a mathematical theory and it doesn't sound as sexy as constructor theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.306,
    "end": 585.209,
    "text": "So that's one reason you might want to call it constructor theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 586.451,
    "end": 587.432,
    "text": "But then what is a constructor?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 587.472,
    "end": 591.638,
    "text": "What do constructors have to do with all of this, this idea of possibility and impossibility?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 592.765,
    "end": 604.883,
    "text": " Well, you see, the difficulty was if you go back and you think about the case of the ice cream melting, that's something that is possible by our usage of the word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 606.885,
    "end": 612.073,
    "text": "But you'd want to be able to stick it on one side of the cut and call that impossible, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.505,
    "end": 616.836,
    "text": " The solution, unfortunately, is verbicide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 617.036,
    "end": 621.25,
    "text": "What you do is you simply make up a technical concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 621.611,
    "end": 625.624,
    "text": "You call this concept possibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 626.212,
    "end": 627.874,
    "text": " of a task, let's say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 627.894,
    "end": 631.618,
    "text": "And then you, well, what do you mean by possibility or task?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 631.638,
    "end": 635.383,
    "text": "Well, that relies on defining what these constructors are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 635.403,
    "end": 639.127,
    "text": "Possibility depends on defining what constructors are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 639.167,
    "end": 642.411,
    "text": "And constructors, in turn, depend on the definition of tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 642.471,
    "end": 646.055,
    "text": "And then tasks, finally, are something that you can cash out in terms of processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.856,
    "end": 650.06,
    "text": "So this is the idea of where constructor theory wants to go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 650.1,
    "end": 655.847,
    "text": "And now I'm going to tell you how it is that constructor theorists get there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 657.835,
    "end": 687.724,
    "text": " uh let's see do we have um do we have any questions at this point any sort of conceptual questions or clarifications that anyone wants to because otherwise i'm gonna move on where does likely or unlikely fit that's all on one side of the line what if something's vanishingly unlikely but possible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 688.379,
    "end": 691.082,
    "text": " That is an absolutely brilliant question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 692.163,
    "end": 705.718,
    "text": "And the answer is you get to choose as long as you make a cut, because so the dogma of constructive theory goes, you only get possible and impossible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 706.078,
    "end": 709.922,
    "text": "I don't care how you pick how to distinguish the likely and vanishing unlikely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 709.962,
    "end": 711.844,
    "text": "And I didn't make up the rules.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 712.084,
    "end": 716.129,
    "text": "I'm merely telling you that everything has to be either possible or impossible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 716.569,
    "end": 717.39,
    "text": "Good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 717.893,
    "end": 747.124,
    "text": " sorry that's the best that's the best i can do um okay three so right what is constructor theory all right it's a of course it's a meta theory bring your own math the metaphor what does that what does that mean that means bring your own math",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 749.18,
    "end": 749.601,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 751.787,
    "end": 754.834,
    "text": "Let's start from what is a constructor?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 763.215,
    "end": 763.476,
    "text": "Well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 766.257,
    "end": 769.824,
    "text": " you know what, this might be better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 770.285,
    "end": 775.214,
    "text": "I'm looking at these notes now, and I'm going, nope, I'm going to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 775.234,
    "end": 777.078,
    "text": "It wouldn't make sense if I started from there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 777.498,
    "end": 780.905,
    "text": "I'm going to have to put that as the bottom thing, and then we'll get there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.726,
    "end": 785.734,
    "text": "What is constructor?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.743,
    "end": 789.99,
    "text": " Okay, let me start with defining what a task is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 790.23,
    "end": 793.577,
    "text": "So all of this so far is going to be in English, and then we're going to translate to math in a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 794.338,
    "end": 794.639,
    "text": "Hold on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 795.1,
    "end": 796.903,
    "text": "Let's talk about what a task is first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 798.887,
    "end": 802.334,
    "text": "From a task, you get on to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 802.635,
    "end": 805.14,
    "text": "Remember, we said that something was conceivable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.116,
    "end": 833.389,
    "text": " we have to break down that initial diagram that we drew this initial informal thing we had the sort of the space of all conceivable tasks so first we have to define what do we mean by tasks what do we mean by conceivable tasks and then some conceivable let's just talk about what do we mean by a possible task right and then it will turn out that a constructor is a the constructor is uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 833.892,
    "end": 856.508,
    "text": " is something that's associated with a possible task so you see that there's a difficulty here of getting from constructors to the you know where ultimately you want to go there's there's a sort of yeah right logic of justification logic of discovery and they gotta go differently okay fine so what is a task well remember we're allowed to we're allowed to bring our own mathematics here so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 857.045,
    "end": 884.335,
    "text": " we we asked them we we took a lot of care to ask them you know what what sort of math do you want you know what do you need here and there and then finally you know it came down to look look really what we care about as constructor theorists is just defining these things once you pick some sort of sensible interpretation of these things in mathematics then you can go ahead and play the game of constructor theory so okay that's fantastic you know so so here we have a here in Oxford we have a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 885.142,
    "end": 893.094,
    "text": " We have a nice sort of homebrew math, but we call them process theories, but otherwise they're known as symmetric monoidal categories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 895.177,
    "end": 899.003,
    "text": "We say, okay, well, let's call a task a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 901.687,
    "end": 905.573,
    "text": "A process in a symmetric monoidal category.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 905.593,
    "end": 908.938,
    "text": "Okay, well, we'll get to what that means in a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 909.728,
    "end": 911.17,
    "text": " So what is a conceivable task?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 911.29,
    "end": 913.774,
    "text": "Well, that becomes mathematically trivial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 913.794,
    "end": 916.479,
    "text": "It just becomes a process inside a process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 921.667,
    "end": 923.009,
    "text": "What is a possible task?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 923.77,
    "end": 931.262,
    "text": "Well, possible task is going to be, and then here's where we have to get technical again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 931.322,
    "end": 932.604,
    "text": "What is a possible task?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 933.385,
    "end": 936.63,
    "text": "Well, it's defined as an infinitely iterable task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 943.495,
    "end": 944.997,
    "text": " infinitely iterable, yada, yada.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 946.318,
    "end": 946.558,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 947.78,
    "end": 955.108,
    "text": "And then if a task turns out to be one of these infinitely, if a task turns out to be infinitely iterable, we call it possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 955.729,
    "end": 959.373,
    "text": "And a task always is doing something, and then there's something in the environment that's helping it do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 959.974,
    "end": 965.74,
    "text": "That's something in the environment, the super ancillary thing at the end of these definitions is going to be what a constructor is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 966.057,
    "end": 970.241,
    "text": " And at this point, it will be very helpful to actually go through an example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 970.742,
    "end": 977.628,
    "text": "And it so happens that by going through this example just in the diagrammatic form, you will understand process theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 977.688,
    "end": 984.255,
    "text": "Because the whole point of process theories and symmetric monodal categories is that you have this formal diagrammatic syntax that's extremely intuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 984.575,
    "end": 986.457,
    "text": "You don't have to know anything about the category theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 986.497,
    "end": 987.738,
    "text": "You can just use the diagrams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 988.078,
    "end": 994.765,
    "text": "And it's a formal syntax where you can't go wrong as long as you're just composing the boxes and the wires.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 994.745,
    "end": 1002.576,
    "text": " I'm going to now give an example of, I'm going to make an example of a constructor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1005.339,
    "end": 1006.621,
    "text": "And this is also a good time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1006.661,
    "end": 1010.586,
    "text": "So now that I'm erasing, anytime I'm erasing, it's a good time to chime in with questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1013.911,
    "end": 1014.151,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.191,
    "end": 1015.253,
    "text": "One question from the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.074,
    "end": 1023.604,
    "text": "Upcycle Club wrote, does this mean that constructor theory as a process theory indeed takes into account the no deleting theorem?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.263,
    "end": 1055.785,
    "text": " um no no deleting what do you what do you mean i'm not familiar with not sure that's what was written or maybe you referenced no cloning earlier i referenced no cloning ah so here's the yeah so here's the nice bit so earlier i drew a diagram where there are all these different blobs of different colors and each one was a different uh domain of physics or whatever right so it turns out that you know part of the content of a process theory or of a symmetric model category is that you have to pick",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1055.933,
    "end": 1073.487,
    "text": " a category an ambient category in which you're interpreting and that choice of ambient category uh tells you about the sorts that that is the choice of the conceivable processes so if you choose the category of quantum processes and quantum maps it will turn out that in that setting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.99,
    "end": 1102.36,
    "text": " you have no cloning but if you pick a different setting like for example maybe you want just sets and functions you know mathematical sets and functions in which case of course you can copy you can always you know copy down any information that you have you know as long as it's all on paper and you're just using sets and functions right but in physics fine you want to model it with the process theory of uh of quantum maps then you don't get you know it so it depends on it depends on the choice of uh choice of interpreting category but that's that's a very good conceptual question thank you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1104.871,
    "end": 1105.192,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1106.274,
    "end": 1108.638,
    "text": "So talk about a task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.34,
    "end": 1111.845,
    "text": "I'm going to make a task here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1111.865,
    "end": 1115.191,
    "text": "I draw these tasks as directed boxes with wires.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.137,
    "end": 1119.64,
    "text": "So this is just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1121.425,
    "end": 1146.336,
    "text": " am i drawing here okay i've drawn these directed so because i want everything to be read from left to right okay now in a process theory every process is drawn as a box a process is something that takes as input over here some systems and does something to it whatever then it outputs some systems and then processes can be composed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1147.7,
    "end": 1151.425,
    "text": " in the kind of usual way that one expects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1152.145,
    "end": 1153.968,
    "text": "This is a composite process, for example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1158.673,
    "end": 1161.757,
    "text": "So what is the process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.198,
    "end": 1163.059,
    "text": "So what is the process here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1163.079,
    "end": 1166.683,
    "text": "Well, OK, let's talk about these systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1166.723,
    "end": 1168.105,
    "text": "What do I mean by these systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1168.422,
    "end": 1189.3,
    "text": " they can be just about anything subject to a couple of rules the rules are anytime you have a system you just need some way to talk about what it means to have two of these systems side by side so let's say that the green system is uh see the green system here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1189.516,
    "end": 1203.998,
    "text": " but now this is something that takes in a green system and a orange system and gives back the green system of the orange system so it's something that's acting on these systems it returns them what do I mean by a system a system can be it will",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1204.349,
    "end": 1212.889,
    "text": " Mathematically, we would call them a type, like a system can be like the Booleans, or they can be a set, or they can even have the vector spaces as systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1214.613,
    "end": 1220.367,
    "text": "And if you have vector spaces as systems, there are lots of different ways that you can interpret this idea of sticking two systems side by side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1220.988,
    "end": 1226.717,
    "text": " You can have the direct sum of vector spaces, you can have the tensor product of vector spaces, and all of them would give you valid process theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1227.298,
    "end": 1237.393,
    "text": "So you have linear maps with direct sum or linear maps with tensor products, and that would all give you a process theory or a symmetric nodal category in which you can interpret the diagrams you're drawing here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1239.027,
    "end": 1240.849,
    "text": " So let's come up with a simple one, though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1240.869,
    "end": 1244.913,
    "text": "A simple one is, let's say that this green system is going to be, oh, this is terribly drawn out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1244.933,
    "end": 1245.995,
    "text": "That's slightly better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1246.015,
    "end": 1246.535,
    "text": "It's shoes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1247.837,
    "end": 1249.398,
    "text": "It's a shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1250.039,
    "end": 1251.44,
    "text": "Let's say it's a particular shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.461,
    "end": 1252.221,
    "text": "That helps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1254.684,
    "end": 1257.968,
    "text": "And what is this other system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1257.988,
    "end": 1262.372,
    "text": "I'm going to call this other system the system of a bucket with a paintbrush.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1264.555,
    "end": 1264.815,
    "text": "Bucket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1266.685,
    "end": 1267.526,
    "text": " And here's a paintbrush.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1270.35,
    "end": 1272.894,
    "text": "These are perfectly fine systems to talk about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.914,
    "end": 1274.697,
    "text": "These systems can be in different states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1275.738,
    "end": 1282.588,
    "text": "For example, a shoe can be clean, or it can be dirty, or it can have all these different colors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1283.089,
    "end": 1286.894,
    "text": "With the bucket, well, let's talk about buckets having paint inside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.355,
    "end": 1288.477,
    "text": "Maybe the bucket has some paint in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1288.517,
    "end": 1289.037,
    "text": "Maybe it doesn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.658,
    "end": 1290.98,
    "text": "That's a good example of a system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1293.163,
    "end": 1296.388,
    "text": "And I want to model a particular task here, which is paint the shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1301.11,
    "end": 1301.33,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.031,
    "end": 1302.672,
    "text": "It's a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.973,
    "end": 1304.636,
    "text": "Well, why do I call it a task?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1304.656,
    "end": 1312.208,
    "text": "Well, to view a process as a task, I have to look at it in the right way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1312.248,
    "end": 1319.519,
    "text": "I have to say, OK, well, there's got to be one sort of system that's input and output.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1319.539,
    "end": 1321.903,
    "text": "I want to call that system the substrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.162,
    "end": 1324.803,
    "text": " Well, why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1324.843,
    "end": 1327.926,
    "text": "Because a task has to know that that's the substrate there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1328.787,
    "end": 1330.088,
    "text": "Painting has to happen to something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1330.128,
    "end": 1333.152,
    "text": "If you want to view painting as a task, then the substrate of the painting is going to be the shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.493,
    "end": 1335.214,
    "text": "And what about this other?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1335.274,
    "end": 1336.716,
    "text": "What about the paint?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1337.616,
    "end": 1340.82,
    "text": "Well, the paint part, OK, well, that's going to be part of what we call just here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1340.88,
    "end": 1343.803,
    "text": "Everything else, that's going to be the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.389,
    "end": 1349.549,
    "text": "OK?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1350.751,
    "end": 1352.953,
    "text": "There's going to be a substrate and an environment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.57,
    "end": 1357.675,
    "text": " But then what do we mean by successfully painting a shoe?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1358.377,
    "end": 1360.28,
    "text": "Well, OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1360.961,
    "end": 1367.272,
    "text": "So here, I'm going to need to introduce a concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1367.372,
    "end": 1370.237,
    "text": "So a green wire is the shoe system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1372.962,
    "end": 1375.567,
    "text": "And this orange wire is the bucket and paint system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1375.587,
    "end": 1376.308,
    "text": "Let's remember that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1381.267,
    "end": 1384.512,
    "text": " So now here's the new kind of process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1386.055,
    "end": 1387.557,
    "text": "Maybe, yeah, I can draw this like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1387.657,
    "end": 1389.42,
    "text": "This is fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1389.44,
    "end": 1390.702,
    "text": "Here's a new kind of process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1392.545,
    "end": 1397.233,
    "text": "So I'm drawing processes, and you've seen the process at this point that takes inputs and has outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1397.939,
    "end": 1400.763,
    "text": " What about a process that doesn't take any inputs and just gives you an output?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1401.084,
    "end": 1402.186,
    "text": "Well, those we call states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.266,
    "end": 1403.468,
    "text": "They're a special kind of process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.369,
    "end": 1412.743,
    "text": "In the process theory of sets and functions, or the symmetric model category, I should say, of sets and functions with Cartesian products, states are elements of sets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.664,
    "end": 1421.837,
    "text": "In the process theory of relations, states are subsets of sets, and systems are sets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1423.555,
    "end": 1429.971,
    "text": " In, I think, any vect, whether it's the direct sum or the tensor product, the state is a vector.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1431.183,
    "end": 1442.555,
    "text": " So states really are just sort of like some, you're really, we really call it, you know, it's a sort of a play on words because I was saying like, oh, well, you know, the system can have states, their systems can be in different states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1443.175,
    "end": 1449.742,
    "text": "The idea is that, well, actually the name is well chosen so that a state really is picking out, you know, one of the states of the system that you're interested in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1450.843,
    "end": 1455.908,
    "text": "Let's say that we'll call, there's a sort of state of the shoe, which is that it's unpainted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.643,
    "end": 1464.751,
    "text": " And there's a state of the bucket and paint system such that you've got a bucket that's full of blue paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1468.955,
    "end": 1473.84,
    "text": "And what do I mean by the task of painting the shoe?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1475.002,
    "end": 1475.362,
    "text": "Let's see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1475.602,
    "end": 1476.403,
    "text": "How much is visible?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1476.443,
    "end": 1478.566,
    "text": "I've got all of that, all of the side over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1482.43,
    "end": 1485.473,
    "text": "Now you will see your first process theoretic equation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1488.71,
    "end": 1490.753,
    "text": " So here's a shoe that's now blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1493.277,
    "end": 1494.498,
    "text": "And here's a bucket of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1496.101,
    "end": 1498.043,
    "text": "That's now, it's got no more blue paint in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1499.906,
    "end": 1502.47,
    "text": "So what we got here, let's say here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.132,
    "end": 1504.793,
    "text": "So here's full.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1507.297,
    "end": 1510.301,
    "text": "And here, let's say it's white, starts off a white shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1512.664,
    "end": 1515.308,
    "text": "At the end, we got painted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1518.157,
    "end": 1540.536,
    "text": " have here empty and this is a process theoretic equation i hope you can see all the data that's happening here what we're saying is that okay look if i've got as initial states i've got like a i've got an unpainted shoe and i've got a full bucket of paint",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1541.596,
    "end": 1548.026,
    "text": " What this process does is it takes the two systems, it just keeps track.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1548.046,
    "end": 1550.23,
    "text": "It says, okay, well, this one's a substrate and this one's the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.052,
    "end": 1557.241,
    "text": "And what is the result of applying that process to my two states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.261,
    "end": 1559.604,
    "text": "Well, then I have to end up with two new states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.265,
    "end": 1564.432,
    "text": "And those states are saying, well, okay, now I end up with a painted shoe and I use up all my paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1564.492,
    "end": 1568.278,
    "text": "So now I have an empty can of paint as another state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1568.714,
    "end": 1569.375,
    "text": " Is that clear?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1569.555,
    "end": 1574.022,
    "text": "Because if you understand this, then you'll understand everything else I'm about to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1574.082,
    "end": 1579.449,
    "text": "This is maybe the only conceptually difficult part of unconstructive theory as process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1580.551,
    "end": 1581.232,
    "text": "Are we happy with this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1582.394,
    "end": 1586.339,
    "text": "If anyone's unhappy or has any conceptual questions, then now's the right time to ask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1594.271,
    "end": 1597.135,
    "text": "It seems like we kind of put a box around",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.418,
    "end": 1619.865,
    "text": " entire crux of the issue but at this level of abstraction indeed right indeed right i mean like yeah of course you uh there's a lot of there's a lot of boxing away the crux of the issue but in fact we haven't even gotten to rather we haven't even gotten to the the crux of what a constructor is yet i'm merely defining what it is for something to be a task",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1620.25,
    "end": 1622.073,
    "text": " I mean, you can then pick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1622.093,
    "end": 1627.863,
    "text": "So the point also of a process theory is that you can work at the level of abstraction you so choose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1628.404,
    "end": 1635.196,
    "text": "Think of this, if you code, this is basically you're declaring what the types of the method or the function are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1635.236,
    "end": 1638.822,
    "text": "It's still on you to go fill in the implementation details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1639.123,
    "end": 1643.49,
    "text": "But here, we're just dealing with the level of, this is the level of abstraction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1643.588,
    "end": 1650.218,
    "text": " where it's perfectly OK to start working to just define what we mean by a constructor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1650.238,
    "end": 1652.762,
    "text": "And remember that this is still just an example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1653.062,
    "end": 1656.667,
    "text": "At some point, you can just erase all the labels and just keep the coloring that indicates the types.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1657.368,
    "end": 1662.156,
    "text": "And then this would be the abstract specification of what a task and a constructor is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1663.197,
    "end": 1663.758,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1663.778,
    "end": 1664.98,
    "text": "So you're right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1665.08,
    "end": 1670.608,
    "text": "We are hiding away the crux of the difficulty or the meat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1670.977,
    "end": 1694.183,
    "text": " but we're doing so in service of sort of getting at a formal incarnation of what constructive theory is so yeah um okay so kind of happy with this now i'm going to redo some of this let's see",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1696.711,
    "end": 1700.235,
    "text": " So now, well, let's suppose that maybe it's a small bucket of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1700.355,
    "end": 1702.558,
    "text": "It's a fairly big shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1703.379,
    "end": 1710.066,
    "text": "Well, either case, the content of the equation was that you stick in this full bucket of paint, and then at the end of it, you run out of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1710.086,
    "end": 1713.25,
    "text": "You finish painting the shoe, but you run out of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1713.27,
    "end": 1719.417,
    "text": "And what that means as a sort of diagrammatic consequence, what happens if we want to paint a shoe twice?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1721.359,
    "end": 1722.28,
    "text": "Well, I mean by that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1723.205,
    "end": 1726.51,
    "text": " OK, well, here's two shoes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1726.87,
    "end": 1736.103,
    "text": "And just to distinguish them, let's say that this one starts off like a nice yellow shoe, and this one's a nice orange shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1737.685,
    "end": 1744.555,
    "text": "And then in the end, we still have this, again, this bucket of paint that is full.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1748.399,
    "end": 1750.942,
    "text": " What do I mean by painting two shoes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1750.982,
    "end": 1754.667,
    "text": "Well, OK, let's paint them in the order that they're closest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1754.687,
    "end": 1759.312,
    "text": "So first, we want to apply the paint shoe task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1759.332,
    "end": 1761.135,
    "text": "We end up with some shoe system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1761.215,
    "end": 1762.837,
    "text": "We end up with some bucket of paint system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1762.877,
    "end": 1765.62,
    "text": "We want to say, OK, send that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1765.8,
    "end": 1767.222,
    "text": "That first system, we send it away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1767.262,
    "end": 1768.844,
    "text": "That second system, we bring it in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.884,
    "end": 1771.487,
    "text": "Now let's line things up again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1773.93,
    "end": 1775.352,
    "text": "And let's apply this again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1778.251,
    "end": 1783.118,
    "text": " All right, here's a paint shoe, and here's, you know, let's try it again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1783.158,
    "end": 1785.861,
    "text": "Let's try to paint the shoe, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1787.744,
    "end": 1795.354,
    "text": "And now we're seeing a new diagrammatic component, which corresponds to the word symmetric in a symmetric monodal category.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1796.756,
    "end": 1805.929,
    "text": "The idea is that, well, in a symmetric monodal category, yes, you can put systems side by side, but in a sense, you don't care about the spatial configuration of how you do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1805.909,
    "end": 1829.706,
    "text": " you're always free to you sort of have a bag of systems you're not to pick them out and geometrically what this amounts to in the diagrammatic syntax is saying that well look if you have a system side by side you can always you can always swap the two systems and you can depict the swaps as uh as wires twisting over each other and the sort of the the difficulty of uh or the only difficult content of the symmetric monoidal category is showing that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1829.686,
    "end": 1852.875,
    "text": " the way that the diagrams behave topologically correspond precisely to the algebraic content of the morphisms that are the semantics of the processes, which is to say that as long as you're tracking the connectivity and the connectivity matches between two different diagrams,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1853.75,
    "end": 1856.056,
    "text": " they're going to refer to the same formal entity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1857.36,
    "end": 1860.91,
    "text": "So it's really like a safe syntax to use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1862.654,
    "end": 1864.098,
    "text": "But we can follow this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1864.159,
    "end": 1866.385,
    "text": "This is what I said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1866.405,
    "end": 1869.413,
    "text": "I'm trying to paint the two shoes with one bucket of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.017,
    "end": 1870.738,
    "text": " That should be clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.798,
    "end": 1874.604,
    "text": "I'm trying to arrange to paint the first shoe, the orange shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.545,
    "end": 1881.894,
    "text": "And then I twist in the second yellow shoe and try to apply that process again to do the painting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1883.516,
    "end": 1885.86,
    "text": "And then remember the diagrammatic equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1885.92,
    "end": 1888.463,
    "text": "The diagrammatic equations let us reason directly with this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1889.745,
    "end": 1892.629,
    "text": "We never have to leave the diagrams once we've defined everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.39,
    "end": 1894.152,
    "text": "So what do we have?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1894.252,
    "end": 1896.615,
    "text": "Well, OK, the diagrammatic equation tells us",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1898.232,
    "end": 1912.208,
    "text": " uh of what painting shoes does is okay well this is going to be then the same as oh i empty the bucket of paint i paint this blue right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1914.28,
    "end": 1918.847,
    "text": " And you'll note that it doesn't matter whether I stretch things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1918.927,
    "end": 1921.471,
    "text": "It doesn't matter if I stretch things or I twist the wires around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1921.491,
    "end": 1926.98,
    "text": "In a symmetric monoidal category, everything up to stretching doesn't matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1927.14,
    "end": 1932.048,
    "text": "All refers to the same configuration of states and applied processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1934.552,
    "end": 1937.436,
    "text": "But then I run into a problem here because, OK, well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1939.188,
    "end": 1943.253,
    "text": " So in a symmetric normal category, everything is OK up to twist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1943.273,
    "end": 1947.779,
    "text": "So this thing over here that crosses over, I can pull it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1947.799,
    "end": 1952.264,
    "text": "I can yank it all the way to here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1961.836,
    "end": 1964.419,
    "text": "And then what do I have?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.378,
    "end": 1966.12,
    "text": " What is this saying?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.16,
    "end": 1973.418,
    "text": "I've just done these diagrammatic derivations to show that, well, I applied the equation that tells me that I can use a full can of paint to paint a shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1973.458,
    "end": 1976.947,
    "text": "And then I run out of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1977.569,
    "end": 1982.02,
    "text": "And now I'm trying to apply an empty can of paint to a shoe that needs to be painted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1982.81,
    "end": 1983.671,
    "text": " At this point, I'm stuck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1983.791,
    "end": 2000.734,
    "text": "I have no more diagrammatic equations to help me get this into a simplified state from here because, well, we might want to define the painting shoe process to be one such that nothing happens if you put in the empty bucket of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2000.774,
    "end": 2001.715,
    "text": "You don't end up painting the shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2002.756,
    "end": 2003.517,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2004.038,
    "end": 2007.703,
    "text": "For this reason,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2009.641,
    "end": 2011.243,
    "text": " not constructors yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2012.245,
    "end": 2016.711,
    "text": "Let us imagine then that we had this magic bucket of paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2017.933,
    "end": 2021.298,
    "text": "Now this is, I've cast a spell on it, this is a magic bucket of infinite paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2023.802,
    "end": 2026.806,
    "text": "And the nature of this infinite paint is that it's always going to be full.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2026.887,
    "end": 2029.03,
    "text": "It's always going to have enough paint to paint another shoe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2029.991,
    "end": 2034.758,
    "text": "Of course, such a bucket of paint cannot exist in our physical reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2034.778,
    "end": 2036.661,
    "text": "You always have to use up some paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2036.978,
    "end": 2043.727,
    "text": " But if you had this sort of mathematically ideal infinite bucket of paint, then it doesn't matter how many shoes you try to paint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2043.787,
    "end": 2050.155,
    "text": "You could always then sort of apply another equation, and then you go like, well, the infinite bucket of paint is not going to run out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2050.816,
    "end": 2054.681,
    "text": "So I can apply the equation again, and I can paint another shoe, and I can keep painting shoes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2055.002,
    "end": 2058.887,
    "text": "And every time I apply the equation, well, it never goes from a full state to an empty state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2058.927,
    "end": 2065.956,
    "text": "It just stays in the same infinite state and allows me to perform this task again and again and again, however many times I want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2068.315,
    "end": 2096.888,
    "text": " rather counter-intuitively this is what is meant by possible so painting a shoe as i've described it using just a regular bucket of paint that empties is actually not a possible task in the framework of constructive theory right this is what i mean by verbicide you know you'd want to say of course you can paint a shoe no no no no possibility is a completely technical term that refers to the ability of a task to be iterated infinitely",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.045,
    "end": 2127.988,
    "text": " and then this thing this infinite bucket of paint here this state that enables the task the environmental state that enables the task to be repeated infinitely which is to say after you apply the task once the resulting transformation on the environment leaves it in such a state that it can do the task again that thing is a constructor okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2130.55,
    "end": 2136.876,
    "text": " So I'm going to move on to what's next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2138.218,
    "end": 2138.878,
    "text": "What is next?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2138.898,
    "end": 2139.959,
    "text": "What is next?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.979,
    "end": 2141.521,
    "text": "But this is a good time to ask questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2141.561,
    "end": 2142.722,
    "text": "This is a very good time to ask questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2147.247,
    "end": 2149.008,
    "text": "Mohamed, do you want to ask a question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.614,
    "end": 2157.857,
    "text": "No, I don't have any questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2161.972,
    "end": 2162.955,
    "text": " OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2164.46,
    "end": 2165.062,
    "text": "Well, why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.122,
    "end": 2168.994,
    "text": "I suppose, what else can I say about constructors here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2169.054,
    "end": 2171.442,
    "text": "Well, conceptually, where do the constructors come from?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.793,
    "end": 2188.192,
    "text": " If you think about catalysts for some biological reactions, the notion of a catalyst in chemistry and biochemistry, this is one of the intellectual sources of this idea of a constructor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2188.212,
    "end": 2193.058,
    "text": "If you replace constructor with catalyst, it doesn't really change much about how you should intuit the thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2193.646,
    "end": 2215.789,
    "text": " it's this idea that well you know you need it in order to help this help this uh transformation occur but then at the end you just get the catalyst back and then the catalyst is unchanged and you can go and participate in another uh participate in another reaction right so so that's this is the sort of idea of like what uh constructor is um okay so y again is uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2217.001,
    "end": 2218.063,
    "text": " What should I talk about here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2219.165,
    "end": 2222.149,
    "text": "We can talk about, OK, we still have to get to this idea of the cut.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2222.43,
    "end": 2230.924,
    "text": "So how is it that having this notion now of a constructor helps us define what we mean by a cut?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2231.325,
    "end": 2233.388,
    "text": "Yeah, that's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2233.408,
    "end": 2234.77,
    "text": "Cut of possible and not possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2235.411,
    "end": 2235.652,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.416,
    "end": 2241.121,
    "text": "So what is a constructor?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2242.142,
    "end": 2242.603,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.705,
    "end": 2272.354,
    "text": " let's i'm going to rehearse one more time this uh but i'm going to simplify it what i want to do here yeah okay and i have now this this infinite bucket of paint right and i have all the shoes i'll get to in a second okay so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2274.359,
    "end": 2283.018,
    "text": " For whatever reason, constructive theorists really like to use the category of sets and relations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2283.038,
    "end": 2286.225,
    "text": "They really like to think of things in terms of sets and relations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2286.661,
    "end": 2289.243,
    "text": " which is a problem when you're trying to model quantum things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2289.283,
    "end": 2290.444,
    "text": "And we can get into that in a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2292.386,
    "end": 2293.147,
    "text": "How did this come about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2293.227,
    "end": 2304.477,
    "text": "Well, the usual way, which is to say when David Deutsch wrote his first paper, he said, well, let's take sets and relations as this sort of setting where we can start doing some calculations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2304.497,
    "end": 2306.319,
    "text": "And we'll use it as a placeholder setting for now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2306.379,
    "end": 2310.903,
    "text": "And of course, no one bothers to ever go back and change the placeholder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2311.123,
    "end": 2313.225,
    "text": "Then the placeholder becomes a standard.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2313.245,
    "end": 2313.905,
    "text": "So OK, fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2313.925,
    "end": 2315.807,
    "text": "They use sets and relations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2317.441,
    "end": 2323.351,
    "text": " And then so the systems in the process theory, we'd call them systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.412,
    "end": 2328.501,
    "text": "But in the constructor theory, we would call them substrates or the environments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2328.521,
    "end": 2329.482,
    "text": "They're all just going to be sets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2330.043,
    "end": 2338.318,
    "text": "They're going to be sets of, and again, we're dying under the terminology here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2338.687,
    "end": 2360.695,
    "text": " sets of macro states why do we want let's let's talk about macro states well okay i mean like this is a this is a deep constructor theory lore thing because they need to just they need to talk about like thermodynamics in a second um so why macro states because there's lots of different ways a shoe can be blue you know if you're really looking at it at the molecular level",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2361.046,
    "end": 2364.349,
    "text": " There's all these different configurations, and you kind of don't care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2364.409,
    "end": 2367.933,
    "text": "And you want to say, well, look, all of them just count as blue as far as I'm concerned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2369.735,
    "end": 2375.821,
    "text": "We'll call all of that the macro state of the shoe being blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2378.984,
    "end": 2381.726,
    "text": "And then there's shoe being whatever other color, and you don't really care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2381.767,
    "end": 2388.353,
    "text": "And then the job of this task here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.105,
    "end": 2398.41,
    "text": " is just to take the macro states that are not blue and to turn them into macro states that are blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.878,
    "end": 2402.663,
    "text": "And it must be so for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.853,
    "end": 2407.477,
    "text": " Well, it doesn't matter if this is a set.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2407.517,
    "end": 2412.084,
    "text": "That's going to be a set of microstates, macrostates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2412.325,
    "end": 2413.266,
    "text": "Turns out it doesn't matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2413.767,
    "end": 2431.755,
    "text": "When you're working process theoretically, we show in the paper that, look, there is this distinction at the mathematical level when constructors theorists talk about this between a particular molecular configuration and the macrostates of a collection, a subcollection of configurations that are blue or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2431.735,
    "end": 2435.439,
    "text": " But what we show is that, look, in this system, it doesn't matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2435.459,
    "end": 2438.903,
    "text": "You can just work directly with the macro states, because that's what you really want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2438.963,
    "end": 2440.604,
    "text": "And it turns out, mathematically, it doesn't make a difference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2442.607,
    "end": 2445.009,
    "text": "So what are we saying a constructor is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.029,
    "end": 2446.631,
    "text": "So here's the definition of a constructor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2448.112,
    "end": 2453.818,
    "text": "We're saying that this equation ought to hold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2458.503,
    "end": 2460.966,
    "text": "What do I mean by this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2462.414,
    "end": 2473.428,
    "text": " So in the language of, in the diagrammatic language for sets and relations, you've got a special state and you've got a special something that's the co-state, or in effect, something that only takes inputs and doesn't give you any outputs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2474.75,
    "end": 2475.912,
    "text": "What's this special state?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2477.053,
    "end": 2483.882,
    "text": "Remember, states in the symmetric modal category of relations, sets and relations, are subsets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2483.862,
    "end": 2508.958,
    "text": " and this special state is the special subset of everything in the so what this part the diagram says here just up to here saying okay well look here's my constructor that's in my environment and my substrate is well okay I don't care what you put in here it could be any macro state but you perform this task",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2510.828,
    "end": 2513.392,
    "text": " And then the opposite of giving everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2513.412,
    "end": 2514.714,
    "text": "Well, here is the effect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2514.974,
    "end": 2525.189,
    "text": "The relation that is the converse of this is, well, something that takes every element of the set to the singleton.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.269,
    "end": 2529.175,
    "text": "So it's the equivalent of deleting or forgetting about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2530.336,
    "end": 2543.593,
    "text": " And in total, what this is saying here, look, if you apply this process, view it as a task, it takes this constructor in the environment acting on a substrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2543.613,
    "end": 2558.672,
    "text": "Now look, if you forget about it, marginalize over, or you just trace out, or whatever words you want to use to say just forget about it, it doesn't matter what you put in the substrate, you're going to get back",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.981,
    "end": 2589.79,
    "text": " something that is good to go again as a constructor and now rather than equality because of working in sets and relations and recall that these states are now subsets you can say well look if i if i give you if i give you a constructor what i what i mean to give you here is a subs i'm going to give you a a set or a collection of macro states that all work as constructors",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2591.795,
    "end": 2595.219,
    "text": " because, of course, the infinite bucket of paint might also have microstates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.819,
    "end": 2600.544,
    "text": "The paint could be in different configurations, but they might all be equally infinite and good for this task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2601.665,
    "end": 2616.421,
    "text": "But I give you all of these, and if you apply the process to it and you do the task, you get back a set of states that is good to go again to run this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2616.761,
    "end": 2620.165,
    "text": "You can just plug that into another copy of this equation, and you can just get it again and again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2620.752,
    "end": 2631.765,
    "text": " This is now minus the, now we can just take away all of the sort of stuff that's still tethering us to intuition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.986,
    "end": 2637.451,
    "text": "And at that point, that is just the definition of a constructor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.554,
    "end": 2640.135,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2640.635,
    "end": 2642.698,
    "text": "That's a constructor here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2642.718,
    "end": 2643.098,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2644.58,
    "end": 2672.781,
    "text": " so what can we do uh what can we do with uh constructors so recall now this is this is going to be the constructor and this is by virtue a task which by virtue of having a constructor that's going to be a possible task right possible task and now",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2673.942,
    "end": 2702.532,
    "text": " final bit that we need to get to to end the this conceptual story of what's going on in the paper we move on to a discussion is uh well what did what do we mean by this cut remember there was this cut between you know so there's all these conceivable tasks and then there was a cut then you had all these possible tasks and then all these impossible tasks how do you get that cut again well you know you have a sub-process theory so process theory",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2703.608,
    "end": 2706.935,
    "text": " Process theory is closed under composition in two ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2707.136,
    "end": 2710.924,
    "text": "You can compose processes in sequence, and you can compose processes in parallel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2711.906,
    "end": 2716.116,
    "text": "A process theory says, well, you give me a bunch of processes, and a process theory says, well, I'll give you the closure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2716.176,
    "end": 2720.706,
    "text": "All conceivability is the closure of these processes under sequential and parallel composition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2723.369,
    "end": 2751.182,
    "text": " And just what I mean by subprocess theory, well, in the same way that you can have a subgroup, or you can have a vector space that embeds into another, a sub something of some other mathematical construct, we're saying, well, you can also have another process theory where you start off with a subset of processes, and then you take the closure of that under sequential and parallel composition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.276,
    "end": 2754.798,
    "text": " and twists in the case of a symmetric model category.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2754.818,
    "end": 2758.882,
    "text": "And then you end up with, well, that's also a process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2758.922,
    "end": 2763.066,
    "text": "And it can be a process theory that's a subset of a larger process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2764.628,
    "end": 2780.663,
    "text": "And so translating all of that into some, so translating the mathematics there into touching the constructor theory, we'd be saying that, look, what we would have to show in order to claim that this definition is somehow good for where constructor theorists want to go,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2780.963,
    "end": 2800.272,
    "text": " is we want to say that the possible tasks themselves form a process theory the possible tasks you know what do i mean by that well that means just that you know if i give you or identify where the possible tasks are which tasks are possible in an ambient process theory",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2800.657,
    "end": 2823.947,
    "text": " then these possible tasks with constructors form a sub-symmetric monodal category which is to say the sequential or parallel composition of possible tasks again yields a possible task right and that is not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2824.298,
    "end": 2839.388,
    "text": " too difficult to show that is not too difficult to show and perhaps like you can you know this is the sort of thing that you can this is the sort of thing that you can try at home if you have if you have the pen and paper to follow along",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2840.498,
    "end": 2860.161,
    "text": " all i have to do well once you have this equation i mean all you have to do is check you know because this is this sorry this in equation this subset hood relation must be verified to define uh whether a task is possible this this inequality simultaneously defines possible tasks and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2860.141,
    "end": 2860.842,
    "text": " constructors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2861.503,
    "end": 2868.713,
    "text": "So that has to be verified for every sequential composite that you can come up with, and every parallel composite that you can come up with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2868.833,
    "end": 2869.534,
    "text": "And that's not so bad.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2869.955,
    "end": 2874.1,
    "text": "I'll show you show you show you one movie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2874.12,
    "end": 2875.422,
    "text": "Again, questions welcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2877.845,
    "end": 2879.247,
    "text": "Is the mind a constructor?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.611,
    "end": 2883.353,
    "text": "Is the mind constructed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2883.373,
    "end": 2884.815,
    "text": "Yeah, well, that depends on your",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2886.719,
    "end": 2887.62,
    "text": " Depends on what you mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.762,
    "end": 2896.612,
    "text": "It depends on the process theory or whatever other mathematical incarnation you pick for the constructive theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.653,
    "end": 2897.734,
    "text": "Remember, it's a meta theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2897.774,
    "end": 2898.775,
    "text": "You bring your own mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2899.556,
    "end": 2905.945,
    "text": "So I can't answer that question until the mathematics is brought and all the English has been turned into math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2905.985,
    "end": 2908.549,
    "text": "And then I can say, oh, yes, that's a sure or no.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2909.65,
    "end": 2910.131,
    "text": "So it depends.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2911.793,
    "end": 2912.354,
    "text": "That's pretty good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2914.116,
    "end": 2914.617,
    "text": "I like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2917.533,
    "end": 2925.46,
    "text": " Okay, what is the... Okay, let's say I have two tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2926.0,
    "end": 2927.461,
    "text": "I'm not a fan of using letters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2927.562,
    "end": 2929.703,
    "text": "I'm more of a fan of using colors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2929.864,
    "end": 2938.07,
    "text": "But if anyone is colorblind or if anything's not clear, then just let me know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2945.997,
    "end": 2946.898,
    "text": "Maybe there's a different...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.57,
    "end": 2955.902,
    "text": " Then just to make sure everything matches up to this end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2963.133,
    "end": 2967.258,
    "text": "So here is how we're going to sequentially compose tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2968.4,
    "end": 2973.848,
    "text": "This here is a task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2978.182,
    "end": 3004.138,
    "text": " uh task one task two both tasks they work on the same substrate so for example paint a shoe and then unpaint a shoe sequential composition of tasks well if you're going to sequentially compose it needs to be on the same substrate otherwise sequential composition that's meaningless and you might want something like parallel composition instead so for example you can compose the tasks which may not be possible tasks so paint the shoe and then strip the shoe of paint i don't like it you know do something else with it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3006.194,
    "end": 3009.66,
    "text": " And here's how we will sequentially compose just conceivable tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.76,
    "end": 3016.472,
    "text": "If you have a conceivable task that's operating on this orange substrate, you need to compose something else that takes orange as that substrate again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3017.934,
    "end": 3018.816,
    "text": "But what about the environment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3018.836,
    "end": 3019.697,
    "text": "The environment can differ.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.298,
    "end": 3030.075,
    "text": "For example, if I'm going to paint a shoe with paints versus if I'm going to, I don't know, do one of those electrolysis chrome dipping of a shoe to get it covered in chrome, the environment is going to be different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3030.562,
    "end": 3037.03,
    "text": " So for the first task, I have this particular environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3037.931,
    "end": 3040.194,
    "text": "The second task, that has its own particular environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3041.416,
    "end": 3042.638,
    "text": "Those environments are just systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3042.818,
    "end": 3047.784,
    "text": "I say that, well, OK, if I'm going to sequentially compose, I feed in the requisite environment to do task number one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.804,
    "end": 3052.59,
    "text": "And then I twist in and feed in the requisite environment to do task number two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3053.692,
    "end": 3056.215,
    "text": "And then just to make sure that everything type checks at the end.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.304,
    "end": 3084.126,
    "text": " this entire thing here right this entire thing here now maybe it's better if i like gather these guys here to make it clear right that's sequential composition what does it say right you can always gather",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3084.443,
    "end": 3088.569,
    "text": " Systems can also be composite systems that are placed next to each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3089.47,
    "end": 3093.796,
    "text": "This entire thing says, well, you've got to give me the environments for the two different tasks and the substrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3095.258,
    "end": 3098.904,
    "text": "Then I'll give you back the environments again for the two different tasks and the substrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.785,
    "end": 3102.028,
    "text": "That's how we achieve the sequential composition of tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3102.148,
    "end": 3107.816,
    "text": "So these two small tasks, put them together just like this, and then you get this one big task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3112.783,
    "end": 3114.045,
    "text": "What about parallel composition?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3115.578,
    "end": 3119.723,
    "text": " Parallel composition looks fairly similar.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3120.764,
    "end": 3122.626,
    "text": "With parallel composition, you can compose whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.666,
    "end": 3129.053,
    "text": "Parallel composition doesn't particularly matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.155,
    "end": 3132.297,
    "text": "Let's see if I get this right here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.018,
    "end": 3137.923,
    "text": "So you've got substrate one, or an orange.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3139.608,
    "end": 3142.672,
    "text": " We got substrate two over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3143.934,
    "end": 3145.717,
    "text": "I'm going to do it like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.737,
    "end": 3146.698,
    "text": "That makes sense here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3149.062,
    "end": 3156.753,
    "text": "I got environment one and then environment two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3156.773,
    "end": 3161.72,
    "text": "And then those are your two tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3165.886,
    "end": 3167.488,
    "text": "And this is your composite task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.481,
    "end": 3169.868,
    "text": " Is that all visible from there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3169.888,
    "end": 3171.033,
    "text": "I wonder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3172.54,
    "end": 3174.188,
    "text": "Hopefully, that's kind of visible from here for this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3176.699,
    "end": 3177.52,
    "text": " Yeah, fantastic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3180.345,
    "end": 3181.366,
    "text": "So again, what are we saying?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3181.446,
    "end": 3186.314,
    "text": "Well, if you want to parallel compose, parallel composition of tasks is fantastic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3186.334,
    "end": 3187.836,
    "text": "You don't need to match up with a substrate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3187.876,
    "end": 3194.386,
    "text": "You can simultaneously on one side paint shoes and the other one go do your taxes or whatever it is, is another task, whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3194.426,
    "end": 3199.093,
    "text": "So you can have two completely different substrates, doesn't particularly matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3199.133,
    "end": 3203.5,
    "text": "You have two different environments for those substrates in that particular task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3203.986,
    "end": 3207.19,
    "text": " And here is the parallel composition of conceivable tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3207.25,
    "end": 3207.671,
    "text": "Same principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3207.691,
    "end": 3215.02,
    "text": "If you understand sequential composition and you're happy with just intuiting the twisting wires, then you're good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3216.742,
    "end": 3228.677,
    "text": "And now to verify that the composition of possible tasks is, again, a possible task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3229.771,
    "end": 3232.094,
    "text": " So now let's say that these guys are possible tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3232.295,
    "end": 3247.015,
    "text": "In other words, that there is a particular constructor for green, and there's a particular constructor for yellow over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3251.321,
    "end": 3254.085,
    "text": "And remember to check the condition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3256.408,
    "end": 3258.411,
    "text": "Just delete those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3262.492,
    "end": 3277.328,
    "text": " So how do we go about verifying this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3281.898,
    "end": 3286.065,
    "text": " What we want to do is we want to apply the screen one here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3286.125,
    "end": 3303.012,
    "text": "First, we probably want some kind of formal condition on our tasks, on our possible tasks to tell us that this goes through to then get us that we have this series.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3304.409,
    "end": 3306.051,
    "text": " of inequalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3306.351,
    "end": 3312.819,
    "text": "I'm winging it here, but there is going to be a proper worked out version in the longer version of this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3316.543,
    "end": 3327.396,
    "text": "I'm happy to take questions while I'm just over here messing around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3339.34,
    "end": 3341.164,
    "text": " And then apply it again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3349.262,
    "end": 3349.482,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.304,
    "end": 3353.451,
    "text": "I think in the paper, we do one of these variations as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3354.443,
    "end": 3383.91,
    "text": " principle is kind of simple you apply the equation that sorry the in the the containment relationship that defines possibility on uh on both of these one by one and you also make use of the fact that well there's a special state and that one that corresponds to everything and delete you can pull those through as well for tasks then you end up with this and then you go okay fine i verified that this is uh i'm verified that this is a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3385.207,
    "end": 3389.454,
    "text": " possible task, and then you do the same for parallel composition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.936,
    "end": 3391.497,
    "text": "And then you're done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3391.537,
    "end": 3405.4,
    "text": "Then you say, OK, well, I know that if I have sequential and parallel composition plus checking the twists, OK, then I have another process theory, which means that my possible tasks form a process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3405.46,
    "end": 3406.321,
    "text": "So what do I have?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3406.341,
    "end": 3410.067,
    "text": "I get to say, I get to finally give",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.599,
    "end": 3417.468,
    "text": " mathematically formal voice to what a constructive theorist might want to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3417.488,
    "end": 3427.142,
    "text": "So again, I have this first domain here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3427.222,
    "end": 3427.683,
    "text": "What is that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3427.703,
    "end": 3432.79,
    "text": "That is going to be this space of conceivable tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3433.832,
    "end": 3440.982,
    "text": "That's going to be some symmetric monoidal category, which is telling me this is the domain in which I'm interpreting a particular process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3441.704,
    "end": 3446.896,
    "text": " And in this symmetric nodal category, well, my conceivable tasks, they can compose in sequence and in parallel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.52,
    "end": 3449.503,
    "text": "And what do I mean by the cut?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3449.783,
    "end": 3455.477,
    "text": "Well, the cut that distinguishes what is possible from impossible, well, it turns out that the possible stuff",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3456.655,
    "end": 3465.492,
    "text": " That is also a symmetric monoidal category, and that's a symmetric monoidal category that embeds into a larger one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3465.532,
    "end": 3467.556,
    "text": "It embeds in the same way that a subgroup embeds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3467.677,
    "end": 3473.989,
    "text": "It embeds in the same way that a vector subspace or linear subspace is going to embed into a larger one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3475.117,
    "end": 3478.68,
    "text": " And then everything else, well, then everything else is going to be, well, no promises.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3478.74,
    "end": 3479.721,
    "text": "This is not the sort of stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3480.482,
    "end": 3484.706,
    "text": "Impossible stuff is the stuff that doesn't necessarily iterate instantly because they don't have constructors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3486.588,
    "end": 3503.824,
    "text": "And if you followed along so far, and there's more details in the paper, if you want to look up the formal details, you understand now constructor theory minus principle of locality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3504.8,
    "end": 3512.731,
    "text": " which is perhaps not interesting enough to merit further comment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3512.991,
    "end": 3516.196,
    "text": "But if someone's curious about it, we can talk about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3517.538,
    "end": 3526.991,
    "text": "But, you know, so what I presented so far is, you know, a constructive theorist would also be happy to say, yes, this is constructive theory minus principle of locality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3527.451,
    "end": 3533.76,
    "text": "So you don't go around saying that this thing is just constructive theory to a constructive theorist because they'll get mad at you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3534.23,
    "end": 3537.137,
    "text": " And they'll say, no, no, no, it's missing the principal locality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3537.437,
    "end": 3539.602,
    "text": "But that's a dogma, and you don't particularly need it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3539.743,
    "end": 3541.787,
    "text": "It messes a lot of things up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3543.15,
    "end": 3547.44,
    "text": "OK, so that's all I have to say for now, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3547.961,
    "end": 3552.171,
    "text": "And yeah, happy to take it to a discussion now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3559.103,
    "end": 3559.544,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.146,
    "end": 3560.386,
    "text": "Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.689,
    "end": 3570.531,
    "text": "Muhammad, would you like to give a first comment or reflection or just share what angle you participated in the work from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3573.92,
    "end": 3582.332,
    "text": " Yeah, I am interested in applying this formalism to the various examples that Constructed Theory has been applied to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3582.432,
    "end": 3589.442,
    "text": "So you might have seen papers by Chiara Maletto and David on Constructed Theory of Information and Constructed Theory of Life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3590.764,
    "end": 3603.522,
    "text": "And I'm also interested in seeing how it applies to Quantum Theory and if the process view can be shown to be superior to the Constructed Theoretic view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3609.34,
    "end": 3610.442,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.462,
    "end": 3626.305,
    "text": "So if you have a given system of interest, like let's just say a cognitive system, like a person or an ant or something like that, like how do you go about demarcating what tasks are in play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.345,
    "end": 3635.078,
    "text": "Are these cognitive tasks or are these the tasks that the body performs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.868,
    "end": 3660.357,
    "text": " do we begin to to analyze the situation in a way that's amenable to to being framed like this um so but like this could you could you refine the uh the discourse reference what do you mean by this yeah if if we want to understand if we want to understand a given informal actual embodied system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3661.805,
    "end": 3669.195,
    "text": " in a way that's amenable to all of the compositional, bountiful benefits?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.456,
    "end": 3674.702,
    "text": "What are we actually looking to break down about that system of interest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3676.624,
    "end": 3676.844,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3683.613,
    "end": 3690.462,
    "text": "So when we talked about... So tasks are kind of this ad hoc thing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3691.758,
    "end": 3714.711,
    "text": " remember that when we do tasks so we drew them like directed in this way because we had to say something about projection and then we distinguished between their substrates and their environments and then we said that uh systems are always these things which sort of have their you know sorry that task is something that takes in the system and the environment and returns to the same system and environment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3715.4,
    "end": 3718.904,
    "text": " which is something that you can just accept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3719.044,
    "end": 3725.732,
    "text": "But also, in general, a process doesn't need to have the same inputs and output types.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3726.233,
    "end": 3729.377,
    "text": "So this is perfectly fine as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3729.437,
    "end": 3731.039,
    "text": "You can have a process that's shaped like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3731.599,
    "end": 3745.356,
    "text": "And maybe for some sorts of, at whatever level of abstraction you care about, it might be more, well, maybe there's a level of abstraction where you don't care about the actual physics of what's going on, where everything is sort of like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3745.775,
    "end": 3762.617,
    "text": " conservative on some level, you might just care about a view of the system where you have inputs and output types, in which case, the language of or the framework of thinking about tasks is perhaps less fundamental.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3763.398,
    "end": 3772.93,
    "text": "I mean, one of the points that we're making here is like the framework of thinking and tasks is a task is a constructed concept on top of the more fundamental and primitive notion of just being able to construct processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3772.91,
    "end": 3777.276,
    "text": " or just being able to compose processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3777.976,
    "end": 3784.905,
    "text": "So then it would depend now on what you want from your notion of task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3785.926,
    "end": 3796.74,
    "text": "So what we were able to show is that, look, just using the language of process theory, we were able to code and formalize this particular notion of what we want tasks to behave like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3796.72,
    "end": 3812.674,
    "text": " But then depending on what you would consider a task to be, maybe the same, maybe different, you can encode it in this mathematical language and then start reasoning about it in a diagrammatic way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3814.257,
    "end": 3816.923,
    "text": "And there's a lot of things you can reason about in process theoretic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3817.139,
    "end": 3826.975,
    "text": " There's a laundry list of them in the paper, like electrical circuit theory, quantum theory, most notably, linear algebra, first order logic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3827.476,
    "end": 3828.358,
    "text": "Yeah, it's all good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3830.001,
    "end": 3838.675,
    "text": "Maybe that's not quite a satisfactory direct answer, but perhaps we can refine the question and the target.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3840.578,
    "end": 3849.992,
    "text": " So to add to it, it's up to the modular or the user to decide which processes are to be modeled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3850.012,
    "end": 3860.328,
    "text": "So if you want to think about cognitive processes, then you can create a sub-symmetric model category to work with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3860.949,
    "end": 3866.637,
    "text": "But you can also have more mechanical process theories, or you can even have one",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3867.258,
    "end": 3872.186,
    "text": " where both mechanical and cognitive processes interact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3872.306,
    "end": 3873.889,
    "text": "So it's up to the model, I would say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3874.33,
    "end": 3877.134,
    "text": "There's no hard and fast rule in the formalism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3879.658,
    "end": 3881.241,
    "text": "It's the shoe painting factory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3886.59,
    "end": 3886.87,
    "text": "But",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.284,
    "end": 3907.423,
    "text": " lot a lot to say on that um in active inference we're often interested in a general cybernetic entity or thing something that's engaging in sense making on the inbound and on action selection decision making on the outbound and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3907.403,
    "end": 3930.087,
    "text": " another important idea from ecological psychology is this notion of like extended cognition and the environment and the interactions of the agent in the environment so I wondered is the substrate uh you were twisting different environments in and keeping the spotlight on the thing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3933.56,
    "end": 3948.75,
    "text": " is that how you track an entity as things change around it is by twisting in and out different contexts or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.502,
    "end": 3951.203,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3952.745,
    "end": 3971.835,
    "text": "So that is just a way to define the sequential composition or the parallel composition of tasks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3973.334,
    "end": 3979.847,
    "text": " in a way that relies upon a more primitive notion of the sequential and parallel composition of processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3981.27,
    "end": 3985.599,
    "text": "So the twisting in and keeping a spotlight on a particular context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3986.019,
    "end": 3993.334,
    "text": "So one of the things that we've all seen in these examples",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3993.314,
    "end": 4009.855,
    "text": " is that you can start with a process theory of basic processes that just compose in sequence and in parallel, and then you can define a new way to compose in sequence and in parallel on top of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4011.623,
    "end": 4014.989,
    "text": " And that would give you a new symmetric monodal category.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4015.009,
    "end": 4018.135,
    "text": "That would give you a new process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4019.297,
    "end": 4023.746,
    "text": "So this is process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4024.227,
    "end": 4027.914,
    "text": "There's a dog food thing here somewhere where you're eating your own dog food.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4029.597,
    "end": 4033.885,
    "text": "In the case of the twisting, which was, what was the twisting again?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4035.873,
    "end": 4036.694,
    "text": " Here's the twisting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4036.714,
    "end": 4056.073,
    "text": "We were saying that, OK, well, look, we're going to define, instead of just plugging things together, we're going to define a new kind of sequential composition that looks like this, where instead of just taking two boxes and joining them together, we do all this other business over here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4056.113,
    "end": 4062.64,
    "text": "This is this other business over here, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4064.78,
    "end": 4093.892,
    "text": " that's allowed and good and expressive but that's also something that the mathematics has no stance on like if you so you you brought in these concepts like this is how you're spotlighting a particular substrate and keep and switching out the context right and if you look at the diagram it's perfectly okay to start pointing at these things saying well of course you're spotlighting the substrate and you're switching out the context but that's on you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4095.087,
    "end": 4123.66,
    "text": " that's on you the mathematics just just tells you like this is a way to compose and sequence um but it does so nicely enough in a way that's you know where this sorts of uh the sort of we can we can bring our linguistic intuitions to bear on the situation in a much more direct way because we have the the visuality of it available to us yeah that's very deep the necessary and sufficient",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4125.293,
    "end": 4127.456,
    "text": " conveyance is on the blackboard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.197,
    "end": 4145.978,
    "text": "And then that enables us to take perspectives and direct attention and have procedural flows with our attention and tell narratives and again, have interpretations, but the interpretation isn't what's written on the screen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.44,
    "end": 4150.624,
    "text": "Yes, yes, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4150.644,
    "end": 4152.246,
    "text": "All right, a question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.289,
    "end": 4167.354,
    "text": " Can you please explain in what way does that cut, I believe between the possible and impossible, allow the modeler to express emergent phenomena or laws that arise from the underlying processes in constructor theory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4170.36,
    "end": 4174.487,
    "text": "Emergent processes or laws that arise from the underlying...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4177.167,
    "end": 4184.45,
    "text": " In what ways does the cut allow the modeler to express emergent phenomena or laws that arise from the underlying processes?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.74,
    "end": 4189.405,
    "text": "Yeah, well...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4191.055,
    "end": 4214.481,
    "text": " um if i could just ask for clarification from live chat here uh and maybe hans i can weigh in as well like what's your well what's uh what's your favorite toy example of the emergence i'm not a constructive theorist but you know we can play with the system and we can play with the system live and see what we we get at but first we're gonna you know what are you thinking in terms of emergence people mean different things sometimes when they say that right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4215.322,
    "end": 4220.909,
    "text": " How about the arising directionality of a flock of birds?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4225.894,
    "end": 4231.161,
    "text": "The arising directionality of a flock of birds?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4234.384,
    "end": 4244.316,
    "text": "Oh, as in there's a dynamic system that's evolving over time, which is you've got these birds that are interacting with each other locally, and then they end up... Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4254.202,
    "end": 4279.348,
    "text": " with these so i think the safe answer or my intuition would say that the vast majority of things you would consider to be possible are not actually technically possible in constructive theory right so right off the bat you can say look you've got this intuition so so if you thought painting shoes was a fine sensible thing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4279.868,
    "end": 4285.593,
    "text": " and you think that birds flying around and interacting with each other is a fine, sensible thing, that's possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4286.054,
    "end": 4288.956,
    "text": "That probably isn't what is meant by possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4289.377,
    "end": 4294.802,
    "text": "So in the case of a bird system, you've got this massive interacting system, fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4294.822,
    "end": 4305.271,
    "text": "A constructor, you probably could have a sort of infinite shotgun constructor that just stops all the birds dead in their tracks again and again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4305.311,
    "end": 4307.513,
    "text": "And you can kill as many birds as you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4308.438,
    "end": 4310.46,
    "text": " What would a constructor for this sort of system be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4311.301,
    "end": 4327.678,
    "text": "Well, if you can set up an environment that sort of steers the birds, a possible task, maybe for a chaotic system, the only possible task is the trivial one where you don't expect anything to be done and you accept any sort of outcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4329.7,
    "end": 4334.125,
    "text": "But if you want a particular possible task, that's tantamount to programming like a flock of birds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4334.105,
    "end": 4336.008,
    "text": " or finding some way to program a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4336.028,
    "end": 4339.813,
    "text": "Pluck a bird's like in a deterministic and set way that you can keep doing it again and again, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4341.676,
    "end": 4341.776,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4343.579,
    "end": 4347.965,
    "text": "So what is the relationship between constructor theory and programming?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.33,
    "end": 4353.874,
    "text": "That's a pretty good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4354.315,
    "end": 4358.661,
    "text": "I'm going to try my best to answer on behalf of constructor theorists here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4359.35,
    "end": 4371.526,
    "text": " But there's an information theory or perspective on information theory that also comes about from constructor theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4371.546,
    "end": 4386.927,
    "text": "So as a math and computer scientist myself, I'd say that perhaps the most fundamental point of contact between constructor theory and programming is in a notion of information and what in particular you're allowed to do with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4387.75,
    "end": 4416.137,
    "text": " so in a quantum setting you cannot clone information i mean your information is carried in your qubits and you have no cloning so you can't you can't clone information um whereas and everything's not everything that's not classical you know the technical terms say well everything's not quantum you call it classical in the classical setting you can copy information you can write down a one or a zero on a piece of paper and you can get someone to copy down the one and zero as many times as you want you can stick the ones and zeros into filing cabinets and so and by so doing perform computation with copying",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4417.113,
    "end": 4439.353,
    "text": " So the difference there is, well, OK, if you've got different sort of underlying capacities for copying things and not being able to copy things in your underlying process theory, there's questions to ask about the sorts of programs you can write.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4439.693,
    "end": 4444.918,
    "text": "But that's kind of at a much more fundamental level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4445.118,
    "end": 4446.9,
    "text": "I mean, constructor theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4447.758,
    "end": 4476.988,
    "text": " if you gave me a if you gave a particular process theory of programs then we can start talking constructive theory um constructive theorists so i think by and large are more interested in the physics which is at a much lower and more basic level of abstraction so i i don't know when you're so when you're asking about like is this you know is this a get rich quick scheme when it comes to emergence is this a get rich quick scheme when it comes to you know programming and understanding chaotic behavior etc etc",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4476.968,
    "end": 4494.319,
    "text": " you know sorry but the answer is no like there's there's nothing the extent i mean if you can under you understood the content of constructive theory in about like an hour and it was all pictures like there's nothing more complicated than that everything else beyond that is you hallucinating interpretations onto the pictures",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4494.299,
    "end": 4497.583,
    "text": " It's a get epistemically rich quick scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.624,
    "end": 4501.508,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.329,
    "end": 4503.69,
    "text": "Get epistemically rich quick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4503.83,
    "end": 4505.372,
    "text": "You've got the pictures and they're very suggestive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4505.913,
    "end": 4510.138,
    "text": "But in principle, it's no different from like a tarot reading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4510.398,
    "end": 4515.584,
    "text": "You've got just a very suggestive mathematics and you can read whatever meanings in you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4516.045,
    "end": 4518.388,
    "text": "And if you play with the mathematics, you can also get some meanings out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4518.468,
    "end": 4522.112,
    "text": "But you only get it out as much as you put in in terms of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4522.092,
    "end": 4525.856,
    "text": " epistemically weight-bearing interpretations of hallucinations in the first place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4525.977,
    "end": 4545.94,
    "text": "Well, it's an interesting date with constructor theory and process theory and active inference, none of which are opinionated in the last mile about any given system, but all of which are providing us higher levels of expressivity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4546.628,
    "end": 4555.862,
    "text": " And increasingly in active inference, category theory is being used to represent the kinds of generative models that are used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.162,
    "end": 4565.316,
    "text": "And so there's the math and the analytical equations, and then there's the kinds of Bayesian graphs that we've traditionally looked at, the partially observable Markov decision processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4565.817,
    "end": 4574.931,
    "text": "And then in the last years, there's some string diagrams and all these other features coming in that are helping like expand the scope",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.029,
    "end": 4585.798,
    "text": " of what kinds of cognitive models and the relationships between substrates and cognitive processes that we want to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.964,
    "end": 4592.034,
    "text": " Indeed, I'm familiar with friends with Toby, Toby Sinclair Smyth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4592.915,
    "end": 4596.862,
    "text": "And yeah, that's my only contact to active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4596.882,
    "end": 4608.04,
    "text": "But I can definitely see the appeal of having non-opinionated mathematics for",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4608.02,
    "end": 4611.747,
    "text": " for things that in the last mile, as you say, don't have an opinion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4613.169,
    "end": 4615.133,
    "text": "I'm butchering it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4615.153,
    "end": 4616.495,
    "text": "I'm tired and I'm saying it all wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4616.555,
    "end": 4622.867,
    "text": "But I'm saying that, look, I think it's a good idea to have a map of composition to deal with a complex system that's fundamentally compositional.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4624.149,
    "end": 4625.151,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4625.131,
    "end": 4638.149,
    "text": " So what modules do we load in or what do we bring in in our environment to be able to load up and actually use?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4639.351,
    "end": 4640.692,
    "text": "So we said bring your own math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.732,
    "end": 4642.575,
    "text": "That was right at the beginning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4642.635,
    "end": 4644.017,
    "text": "So it's like, okay, what do I bring?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4644.117,
    "end": 4645.419,
    "text": "Piano's axioms?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4645.619,
    "end": 4646.54,
    "text": "Or what do I bring?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4646.58,
    "end": 4648.543,
    "text": "Like my f of x?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4649.304,
    "end": 4652.809,
    "text": "Or what do I mean by the mathematics that has to be brought?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.527,
    "end": 4680.163,
    "text": " Okay, so the sort of basic, the core module that you sort of get with process theories is a theory of composition that works for anything that you can name processes that act on systems, and these processes can compose in sequence and in parallel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4680.852,
    "end": 4691.394,
    "text": " This is the sort of basic conceptual map that you get and becomes gun to head formal when you load it into a process theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4691.414,
    "end": 4692.717,
    "text": "That's what you get that's core.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4693.96,
    "end": 4697.848,
    "text": "And then everything else",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4700.123,
    "end": 4706.775,
    "text": " is actually expressed in terms of the diagram.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4706.795,
    "end": 4708.638,
    "text": "So for example, this piano's axioms, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4711.063,
    "end": 4713.828,
    "text": "Let's talk about the, what is it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4713.908,
    "end": 4714.148,
    "text": "Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4716.292,
    "end": 4718.396,
    "text": "I forget what the axioms are, but I know that there are two generators.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4718.416,
    "end": 4723.245,
    "text": "You've got a zero state, and then you've got a successor box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4725.368,
    "end": 4725.649,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4726.45,
    "end": 4740.998,
    "text": "And maybe the first thing that you want to do if you want to actually, well, you want to load in anything that you can express at the end of the day in terms of algebra and symbols and equations is also doable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4742.21,
    "end": 4744.412,
    "text": " with also doable diagrammatically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4745.654,
    "end": 4761.891,
    "text": "For example, I believe that in the piano formulation, the addition operation is something that behaves like a homomorphism with respect to, or like a module with respect to the successor box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4761.931,
    "end": 4768.318,
    "text": "So something like this is right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4771.302,
    "end": 4781.091,
    "text": " Yeah, it's almost like the axioms are proto-procedural in that they define exactly what can and can't be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4782.793,
    "end": 4784.014,
    "text": "Indeed, indeed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4784.815,
    "end": 4799.689,
    "text": "So the sort of benefits of thinking or let's say depicting in a process theoretic way is that, well, look, if you're more used to talking about processes and how they interact and you don't really care, you don't want to spell out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4800.074,
    "end": 4825.66,
    "text": " from the bottom up how they're implemented and do a sort of calculation with like the specifics what you really just care about are the operational constraints of how they compose and behave when you compose them together and you can express them in terms of equations or containment relations or whatever else then the process theory is much better as opposed to for example just dealing with the sets you know especially if you've got like a very complex system then you know no hope",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4827.378,
    "end": 4843.245,
    "text": " Again, to these two key features of cognitive systems, like the sensemaking on the inbound and the associated world model, and then the action selection, I thought about the first blob you drew with the conceivable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4843.746,
    "end": 4847.032,
    "text": "That's like, well, you drew the lines and we have the rest of the blackboard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.072,
    "end": 4852.221,
    "text": "So it's like, we know that there's unconceivable, but that's the scope of the sensemaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4852.201,
    "end": 4863.983,
    "text": " for a given setting and then the line between what is possible and what isn't possible is what is actionable and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.629,
    "end": 4879.905,
    "text": " I guess you can develop thought settings where, okay, well, I'm going to speculate what could happen if I could lift up 10,000 pounds and then you could do tasks related to moving cargo containers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4880.726,
    "end": 4891.759,
    "text": "Whereas if you were using tweezers and you defined what was possible with a different threshold, then there'd be different kinds of plausible tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4892.819,
    "end": 4902.965,
    "text": " And yeah, so yeah, so for sort of what might interest you is I'm going to show it now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4903.005,
    "end": 4903.426,
    "text": "Why not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4903.807,
    "end": 4904.449,
    "text": "I've got some time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4905.543,
    "end": 4935.415,
    "text": " my interest for this sort of reading is that well for the constructor theory you know it really just wants to force you on one side of a binary and this may be too restrictive you know in terms of expressive capacity when you're trying to especially map it on to something that involves anything as complex as a distinction between cognitive and physical tasks and processes right and and we had questions to this uh to this effect earlier as well like what do we do with the likely what do we do with the vanishingly unlikely what do we do with the plausible right how do we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4935.665,
    "end": 4950.299,
    "text": " So I want to point out that, and this is something that's coming in the longer version of the paper, is a relationship between constructor theory as a special case of resource theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4951.36,
    "end": 4962.01,
    "text": "So this idea that you have to, with the constructor theory, you have to either go infinitely many times or infinite or bust.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4962.648,
    "end": 4984.487,
    "text": " a resource theory is sort of going like yeah but you know we'd be happy also if we can do it a couple of times you know tell me how many times you can do it you know that's pretty good and so you know resource theory and principle give you this idea of like well you know here's the sort of things that you can do once you can do twice that you can do three times you can do and finally",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4984.467,
    "end": 4994.308,
    "text": " in the very, very core over here, that's the sort of stuff that's picked out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4994.693,
    "end": 4998.318,
    "text": " that's the sort of stuff that can be picked out by a constructive theoretic cut in the limit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4999.179,
    "end": 5001.982,
    "text": "Whereas a resource theoretic point of view is saying, well, of course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5003.144,
    "end": 5011.234,
    "text": "If you want to make more distinction from that, then an easy generalization that's also quite simple to think about is, let's talk about the stuff that we can do for free all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5011.274,
    "end": 5013.997,
    "text": "Let's talk about the things that we only get to do once.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5015.339,
    "end": 5023.89,
    "text": "And it turns out that resource theories are particularly, resource theories are actually a practical bit of mathematics when it comes to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5024.528,
    "end": 5040.494,
    "text": " quantum circuit optimization, because there are certain components that are very expensive and you want to be able to work out what sort of quantum maps you can implement only using this particular, say, T gate, let's say like three times, or maybe you get like one extra one or maybe you get like two less.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5040.594,
    "end": 5050.35,
    "text": "And then the resource theory is going to tell you precisely what your gain and loss in expressive capacity is when you have more or fewer or more resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5050.33,
    "end": 5060.925,
    "text": " which is something that is a very computer science-y, down-to-earth, practical thing, as opposed to just the distinction between infinity and everything else that constructive theory gives you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5061.726,
    "end": 5070.298,
    "text": "But sneak peek for some of those coming the next installment, the extended version of this paper that's going on archive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5070.318,
    "end": 5073.823,
    "text": "That is super exciting and relevant, certainly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.407,
    "end": 5101.043,
    "text": " organizations or any other kind of system that's being designed and having an ability to handle the finite um very relevant here's one other kind of speculative question so of course we had the ice cream melting and unmelting yeah yeah yeah yeah you had the ice cream um unmelting as impossible yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5101.327,
    "end": 5110.991,
    "text": " But of course, in a freezer, it does happen and or at room temperature with a reversed time arrow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5111.914,
    "end": 5116.365,
    "text": "And so within this notion of the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5117.408,
    "end": 5138.927,
    "text": " gibbs free energy we have catalysts like protein enzymes which are not able to enable what isn't possible but rather they can accelerate by reducing the activation energy and they can accelerate a negative delta g and they can accelerate something that is possible catalytically hence catalyst and be regenerated right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5138.907,
    "end": 5157.844,
    "text": " And it made me think about the change in variational free energy as the ball rolling downhill cognitively and about how the channels and the landscapes of the mind or of the cognitive system sometimes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.123,
    "end": 5189.113,
    "text": " the landscape is changed and what is possible becomes different but just because something's possible doesn't mean it's ever reached and then we still need this question of the catalyst to actually implement and get it to where it can be right right and and i i think that perhaps one of the one of the sort of intuitive appeals of constructive theory is that you know at first glance and with an intuitive mapping of concepts",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5189.566,
    "end": 5201.226,
    "text": " This constructor theory sounds like the right kind of mathematics to talk about, you know, these interactive concepts that you're talking about, the free energy and catalysis as enabling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5202.488,
    "end": 5207.777,
    "text": "But the caveat with constructor theory, remember, is infinite or bust, hard binaries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5209.883,
    "end": 5232.178,
    "text": " which means that if you want to do so like i'm sorry to say but if you want to do anything that's remotely nuanced more nuanced than like a pair of qubits interacting which already because of principal locality gives constructive theorists a lot of pain constructive theory is probably not the right system for you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5233.492,
    "end": 5236.743,
    "text": " Process theories, though, if you want to deal with composition, not bad.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5236.763,
    "end": 5239.793,
    "text": "And especially, you get diagrams for free.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5239.813,
    "end": 5244.649,
    "text": "And also, you get other add-ons that are very good at doing the sort of things that you want to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5245.338,
    "end": 5248.943,
    "text": " that have the right expressivity and shape, like resource theories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5249.164,
    "end": 5274.501,
    "text": "Constructive theory, one should think of as a particular way or methodology that's designed for a particular problem, to be a meta theory of physics in whatever David Deutsch considers to be like a sort of conceptually clean setting of just being able to make a single cut to tell you about, like to distinguish in a black and white way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5274.481,
    "end": 5304.471,
    "text": " all of all the physics interesting and in the bayesian mechanics which is some of the recent developments in active inference and free energy principle area that yeah grounding of physics to i guess what we want to call physical even though we know that so many asterisks have to be added when we knock on the wood and everything like that but if the physics of cognitive systems can be described purely informationally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5304.451,
    "end": 5329.395,
    "text": " then we can have a procedural compositional cognitive physics that would enable us to do anything from the mind conceptualizing that the shoe could be a different color to the multi-agent setting and composed across individuals and there's just there's there's more walls to paint on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5332.919,
    "end": 5335.486,
    "text": " Well, there are many possible walls to paint on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5337.571,
    "end": 5340.659,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5345.051,
    "end": 5346.153,
    "text": "What are you curious about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.234,
    "end": 5348.7,
    "text": "I mean, what's an exciting direction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5351.684,
    "end": 5355.25,
    "text": " In terms of what exactly?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5355.29,
    "end": 5361.3,
    "text": "Because in terms of this whole business with constructive theory, this is kind of a side project for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5364.184,
    "end": 5369.533,
    "text": "A fun one, but just a side interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5369.974,
    "end": 5378.147,
    "text": "What's your main interest or what motivates or what excites the context such that this could be a side interest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.367,
    "end": 5403.966,
    "text": " um well uh you know my main interest is more uh i suppose it's more aligned with this notion of sense making um my my interest is sort of using diagrams not only for sense making but as a formal uh platform to you know articulate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5404.368,
    "end": 5428.013,
    "text": " theories of what sense making might be so i played around with so these diagrams that you know they're good for quantum for example but the same kind of mathematics is quite good for other sorts of composite you know there are other domains not just for example psychology that are you know dearly in need of some sort of compositionally native approach like diagrams like linguistics for example",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5427.993,
    "end": 5439.551,
    "text": " So I like to draw language, because language is a particular tool of sensemaking, and then to formalize the kind of sensemaking that we make.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5440.332,
    "end": 5447.503,
    "text": "For example, when we use metaphor to get the point across relies on a complex metaphor where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5447.483,
    "end": 5452.829,
    "text": " Information is stuck into words as a box, and then the box is moved across a conduit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5453.169,
    "end": 5473.71,
    "text": "And this sort of sensemaking is beyond the merely, let's say, truth theoretic, yet nevertheless is systematic in a way such that the compositional aspects of the language precisely map onto the compositional aspects of the domain of sensemaking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5474.264,
    "end": 5494.99,
    "text": " um and i suspect that's where uh we might have more to talk about um because you know sense making is i consider sense making it's a you know capital s very it's a it's a very big thing and perhaps like the important activity to understand um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5496.168,
    "end": 5503.156,
    "text": " And I'm interested in the systematicity of it, and in particular, trying to depict that systematicity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5503.516,
    "end": 5513.427,
    "text": "There's something that's direct about string diagrams in the same way that perfume or music is sort of directed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5513.447,
    "end": 5518.633,
    "text": "It's not mediated by the rows of Greek and the symbols, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5519.374,
    "end": 5520.635,
    "text": "So I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5520.915,
    "end": 5524.099,
    "text": "Maybe that's, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5525.885,
    "end": 5526.166,
    "text": " Wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5526.386,
    "end": 5527.288,
    "text": "There's a lot there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5527.549,
    "end": 5545.648,
    "text": "Can we say that the screen is the substrate that we're writing language on if we're going by hand with pen and then we have an infinite pen and this is the inexhaustible pen and then...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5548.868,
    "end": 5578.369,
    "text": " that certainly does seem to be one thing at which the yeah yeah yeah i mean you mean to refer to in the context of the mind we have a i mean as long as we're not aphantasic we have a sort of theater of mind that sort of infinitely refreshable paper or infinitely refreshable uh stage for us to arrange things on and and and sort of replenish the representation that's that does sound kind of like a constructor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5580.509,
    "end": 5589.59,
    "text": " If we're happy also to rule out Heraclitus or Heraclitus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5589.65,
    "end": 5591.675,
    "text": "You mentioned Heraclitus earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5591.695,
    "end": 5594.822,
    "text": "A man never steps in the same river twice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5595.207,
    "end": 5603.039,
    "text": " Are we, insofar as we are the same entity that is perhaps observing the theater of mind as we're infinitely refreshing it, then fine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5603.059,
    "end": 5603.88,
    "text": "Yeah, it's a constructor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5603.94,
    "end": 5610.31,
    "text": "But is it the same if 10 years on, you're a functionally different person?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5610.41,
    "end": 5614.616,
    "text": "Is it still the same task?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5615.557,
    "end": 5620.625,
    "text": "Is it still the same task, refreshing or looking at a memory 10 years on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5621.526,
    "end": 5624.05,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5624.755,
    "end": 5650.071,
    "text": " the eye is able to to nest subtasks however it may not have the awareness to know what it is embedded within but at least within this internal theater it can make a sub representation that it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5650.54,
    "end": 5669.798,
    "text": " believes could be wrong but that it believes would have continuity also beyond itself but also not saying what is beyond itself beyond itself in in what sense um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5671.651,
    "end": 5697.827,
    "text": " like there's the environments that um one is confronted with and then one could at least suspect that there are other environments that one is not being confronted with but also know that they can't say anything more than that about environments that they aren't being confronted with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5698.617,
    "end": 5710.905,
    "text": " yes i i i'm not sure what to say to that but i'll have to think about that mohammed any last difficulties yeah comments before we have to go",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5712.64,
    "end": 5715.925,
    "text": " Well, I'm pretty good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5716.225,
    "end": 5734.834,
    "text": "I'd like everyone to know that the longer version of this very paper is going to come out soon-ish on Archive, where we work out some more examples, we relate constructor theory to resource theories,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5734.814,
    "end": 5760.687,
    "text": " and everything is going to be very readable so if this condensed journal version is a bit technical and difficult to follow watch the space and there's going to be a longer more pedestrian version that hopefully everyone can follow yeah great thank you both for joining hope to um see you again it's a very exciting and evocative line of work",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5762.725,
    "end": 5763.068,
    "text": " Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5763.472,
    "end": 5763.957,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5764.321,
    "end": 5765.028,
    "text": "I will see you again soon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5765.715,
    "end": 5766.038,
    "text": "Very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.24,
    "end": 5766.422,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5766.725,
    "end": 5766.846,
    "text": "Bye."
  }
]