[
  {
    "start": 6.292,
    "end": 6.657,
    "text": " Hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6.718,
    "end": 7.63,
    "text": "Welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.197,
    "end": 9.535,
    "text": "It's December 19th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 12.333,
    "end": 17.298,
    "text": " We're in our fourth quarterly roundtable for the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.379,
    "end": 21.341,
    "text": "So welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.022,
    "end": 27.647,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.388,
    "end": 30.47,
    "text": "This is recorded in an archive live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.97,
    "end": 36.436,
    "text": "So please provide feedback and super chats, live chats, so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.456,
    "end": 41.26,
    "text": "All backgrounds and perspectives are welcome and we'll be following video etiquette for live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.653,
    "end": 54.124,
    "text": " Everything at the Institute is participatory, so head over to activeinference.institute to get involved and check out our updated site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 54.144,
    "end": 71.382,
    "text": "This slide has a lot of stable links, which you can go to as an entry point, and we'll always keep these stable links updated even as their underlying targets evolve so that you can have some stable reference and entry points into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.218,
    "end": 102.145,
    "text": " okay this is our fourth quarterly roundtable of the year it is close to the end of the year we've done a quarterly roundtable every quarter since the beginning of 2021 so we're approaching 16 a tet of tets Alex and Blue co-officers of the year would you like to say hello and anything else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.664,
    "end": 107.765,
    "text": " Hi, happy 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.346,
    "end": 109.988,
    "text": "Happy end of 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.609,
    "end": 121.042,
    "text": "I'm excited about all the things that the Institute has done this year and about all the changes that are happening and transitions that we're looking forward to next year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 121.102,
    "end": 127.71,
    "text": "Yeah, hi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.808,
    "end": 156.685,
    "text": " uh and this remind me how it started now we are institute but i remember how it was a comms group in just online format without even possibly knowing names or faces but from the beginning understand that active inference approach and principles could",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 157.897,
    "end": 161.612,
    "text": " help us to grow into something great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 164.832,
    "end": 194.839,
    "text": " thank you yes team calm 2020 active lab 21 institute 22. all right let's continue on first at the institute scale all right one of the major highlights of this year being the second version snapshot release of the sort of keystone publication active inference ecosystem and institute one way or the other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.819,
    "end": 217.3,
    "text": " and the first version of this publication we did also in a great collaborative team in 2023 this year we dipped back in we started with where we left off as any updater would and took it in a ton of different directions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.056,
    "end": 242.072,
    "text": " ecosystem.activeinference.institute is the entry point and just to give a bit of the anatomy of the document and show a few of the pages some of the nested memes for nested themes at the top level this living document or production has an abstract a list of authors a single page on active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.453,
    "end": 272.515,
    "text": " closing discussion and two main body sections one on the institute and one on the ecosystem about the institute the subsections include history mission vision values and principles our focus areas some of our directions strategy the organization of the institute communications and other topics about the organization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.756,
    "end": 294.688,
    "text": " under that if you unfold that tick mark you'll see the formal morphology for example the scientific advisory board board of directors officers members the organizational units administrative functions the eduactive education functions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.158,
    "end": 312.087,
    "text": " re-inference research functions and then a variety of programs that we have at the institute such as volunteer internship mentorship so on and some having begun in the beginning others being incipient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 312.809,
    "end": 334.176,
    "text": " in the institute projects section there's a roster of projects different types different stages all entry points so what what is happening what what has happened these are some of the things that have happened right very here on the ecosystem side",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.514,
    "end": 349.55,
    "text": " The sections include the priorities and the challenge areas for the broader space, the fields where people are really out there applying active inference and adjacent techniques.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.851,
    "end": 360.484,
    "text": "We're starting to explore how we think about the development of the ecosystem, about how to curate and stay on top of the different projects that are out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.54,
    "end": 385.763,
    "text": " past present and future likely overwhelmingly not at the institute however we see a lot of value and meaning in having domain experts and domain curious contributors who contribute in a really nuanced way for example to a certain field or subfield",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.283,
    "end": 408.122,
    "text": " having something like an ongoing research report or meta analysis of different approaches for example in robotics and those sorts of sector reports can be great links to share for onboarding for starting with somebody who wants to enter into active inference and their",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.115,
    "end": 434.717,
    "text": " field of reference also it could support research students people who are applying or thinking about entrepreneurship or startups in different areas so those are some of the pages and one of the big jumps this year compared to last year last year we wrote it linearly in a google doc this year we went full nested collaborative style",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.697,
    "end": 448.373,
    "text": " And while it takes some time to get your fractal legs running, it's going to enable a lot of very expressive ways for us to collaborate and compose and translate and generate documents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.435,
    "end": 461.329,
    "text": "So overall, it's awesome to have a team have a lot of eyes on different parts of the documents, and for the process and the product to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.077,
    "end": 476.601,
    "text": " made for people to use it so we hope that you enjoy diving around that document alex or blue any comments on that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.808,
    "end": 485.6,
    "text": " Yeah, I think this is a really, you know, neat transition from the linear Google doc to the interactive coda.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.141,
    "end": 489.207,
    "text": "And it reminds me like of like a wiki, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.227,
    "end": 492.493,
    "text": "Like a working wiki, a living, breathing wiki document.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.533,
    "end": 494.877,
    "text": "Like when we were at SFI,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.857,
    "end": 498.062,
    "text": " project wiki that everyone had and everyone could contribute to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.082,
    "end": 502.589,
    "text": "I think that putting the Institute projects there is really, you know, nice and helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.669,
    "end": 504.291,
    "text": "So you can kind of see what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.351,
    "end": 509.519,
    "text": "And when was this page last updated and and all of those, all those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.539,
    "end": 514.907,
    "text": "So I think that as a living document, this is a good place for it a nice a nice home.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 518.347,
    "end": 529.902,
    "text": " And even though it's only our second versioned snapshot, first off, now we can make many more micro edits along the year and then making the snapshotting a lot more simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 530.843,
    "end": 543.038,
    "text": "And it's already become something I'd look forward to in terms of our nested time scales and the annual and slower, maybe we'll have a decade scale snapshots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.414,
    "end": 557.112,
    "text": " okay another major highlight from the end of this year on November 13th 14th and 15th was the fourth applied active inference symposium",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.121,
    "end": 560.445,
    "text": " This was quite an event.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.905,
    "end": 563.75,
    "text": "There were three days of activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 564.491,
    "end": 567.355,
    "text": "The first two days had two megastreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.357,
    "end": 580.315,
    "text": "The third day with John Clippinger and the BioFirm project leading a workshop on bioregional active inference and AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.915,
    "end": 603.147,
    "text": " was a team of co-organizers so it was great to work with people on on different fronts including people who were co-organizers as well as presenters there was 30 plus hours of people sharing what was happening this year in applied active inference which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.397,
    "end": 623.16,
    "text": " coming truer and truer to what this symposium has always been about not that application is the only thing out there but people are always asking and wanting to know how and where and why and what about doing active inference and this brought together",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.389,
    "end": 634.517,
    "text": " a lot of presenters from around the world who are sharing where they're at on those journeys and the tools and the approaches and everything along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 635.611,
    "end": 638.154,
    "text": " I look forward to the symposium for 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.595,
    "end": 641.819,
    "text": "It's never too early to begin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.839,
    "end": 649.889,
    "text": "If someone's interested in joining, we can begin with a template and some of the notes that we used this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.949,
    "end": 659.762,
    "text": "We can work with a local partner possibly to explore some kind of in-person activities regionally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.742,
    "end": 687.1,
    "text": " we'd be very interested in some sponsors or other partners who might like to support the open science publishing element or any other number of things so it's not too early if you're interested in the symposium or you thought it was cool or you thought there was something that could be updated or improved or that it's its reach or impact could be magnified let's do that next year",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.08,
    "end": 713.813,
    "text": " any comments on the symposium all right now into some updates about different programs and different personnel about the research fellows program research fellows are individuals affiliated with the institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.434,
    "end": 718.299,
    "text": " reflecting the alignment of their research and our open science approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.78,
    "end": 725.689,
    "text": "This was a new program we began this year, so still counts to include it in our year end review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.17,
    "end": 732.739,
    "text": "And also in the fourth quarter, we added two new research fellows, David Blumen and Robert Warden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.922,
    "end": 742.332,
    "text": "We will be in contact with all the fellows, hearing about how we can support them best for the coming year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 742.7,
    "end": 759.865,
    "text": " one exciting avenue is that the donate link supports the project restricted donations and so fellows we hope will be in a position to receive donations to their project and then have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.431,
    "end": 769.626,
    "text": " the ability to decide how those are used in service of the project with the oversight and streamlined overhead from the Institute side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.427,
    "end": 781.026,
    "text": "So we hope that we can provide that kind of formal financial organizational support to research fellows, possibly eventually much more than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.006,
    "end": 788.959,
    "text": " and also work more closely next year with the Scientific Advisory Board and with interns to really accelerate their projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.1,
    "end": 795.209,
    "text": "The next round of review of fellows will be sometime in 2025.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.471,
    "end": 798.053,
    "text": "We will continue to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.653,
    "end": 816.717,
    "text": " entertain research fellow applications different areas of active inference research all welcome and also explore what other kinds of fellows might be apt like in education or otherwise",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.697,
    "end": 830.672,
    "text": " so welcome to david and robert and thanks again to jf anna and john for pioneering this program and for their very unique agendas any comments on this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 833.572,
    "end": 836.876,
    "text": " It's just been awesome to participate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 836.956,
    "end": 843.864,
    "text": "Really, Anna has led some interactive sessions, and that has been awesome to participate in over the last year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 844.164,
    "end": 848.369,
    "text": "And also, it was great to meet David in IRL.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.589,
    "end": 849.891,
    "text": "IRL, that was really nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 850.191,
    "end": 857.279,
    "text": "So I'm looking forward to what these guys are going to turn out and who comes on board next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.08,
    "end": 859.782,
    "text": "What's the next cohort look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.773,
    "end": 865.074,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.765,
    "end": 875.256,
    "text": "To our scientific advisory board, we had our largest SAB yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.4,
    "end": 897.177,
    "text": " sab was introduced in 2022 as a way to get scientific guidance not just you know pouring colored liquids into beakers and all of that but thinking more broadly about education research and ways that science is being done in the modern context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.157,
    "end": 919.317,
    "text": " so it's an awesome set of individuals and we thank them all in their various levels of contribution from little to major in 2025 we'll be focusing the SAB coordinating it with the nested temporal rhythms at the Institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.073,
    "end": 926.54,
    "text": " providing clearer opportunities for feedback with the fellows and the interns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.441,
    "end": 930.264,
    "text": "People on the SAB have a lot of insight to give.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.304,
    "end": 935.269,
    "text": "Fellows and interns could use that, so we hope that there'll be synergy amongst those programs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.35,
    "end": 947.582,
    "text": "We'll also be looking to the SAB members for their evaluation of project proposals and measurements, understanding what kinds of projects and which directions to engage in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.912,
    "end": 975.173,
    "text": " be looking for guidance around the institute's scientific and educational strategy overall and their collaboration on specific components of our development related to open science dsi and more so go to sab.activeinference.institute if you're interested it's not required to be a published expert in active inference specifically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.71,
    "end": 1002.223,
    "text": " sap includes science more generally so for those who feel like they could be that curious and brave contributor in the room if they feel like they could help make proposals and projects more legible by asking basic questions if they feel like they could contribute a scientific domain expertise then we would welcome your application",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1002.608,
    "end": 1025.325,
    "text": " and we'll look to have that in by january 15th any comments alex or blue okay thank you to our officers all present here and to our board of directors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.419,
    "end": 1052.376,
    "text": " officers are at the more tactical and the faster scale while we look to continue to learn organizational formal procedures and work with the board of directors to have that level of formal oversight and governance in the beginning of next year we'll be electing the next cohort of the board of directors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.609,
    "end": 1060.644,
    "text": " So do consider applying, especially if you have experience in any of these areas like nonprofits or below.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.471,
    "end": 1066.855,
    "text": "About partnerships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.054,
    "end": 1089.116,
    "text": " Partnerships are structured relationships between the Institute and other organizations who are aligned and are looking to make meaningful, visible, impactful contributions to the Active Inference open source ecosystem, who are looking to upskill and accelerate their own processes of learning and application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.398,
    "end": 1095.542,
    "text": "Organizations who are looking to connect with our community and the growing field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1096.872,
    "end": 1112.721,
    "text": " possibly partners who are looking to form a regional or language or sector or domain level collaboration, and also provide critical input to the Institute and question mark and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1114.523,
    "end": 1128.786,
    "text": " second half of this year was marked by the addition of well first this program arising in 2024 which is cool and a seconds partner joining newman games thinking a lot about active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.576,
    "end": 1155.06,
    "text": " in and for games and also some discord fun with our partner first principles first we've coordinated on aspects of organizing the symposium and some other activities as well so there's a lot of ways that we look to develop this out if you're",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.698,
    "end": 1179.073,
    "text": " applying active inference in a company or you're thinking about doing so or not this could be a very interesting opportunity and we we will as with all things continue to update it based on how our niche responds and reflects back these affordances Alex or blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1186.462,
    "end": 1199.273,
    "text": " okay also in big 2024 news was the recognition of our 501c3 tax exempt status as a non-profit in the US",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.181,
    "end": 1222.324,
    "text": " We aim to develop our philanthropy program and endowment over the years as we develop from our current all volunteer status on through something that's larger and more sustainable for people's time and reflects the relevance of what they're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1223.84,
    "end": 1244.042,
    "text": " please head over to donate.activeinference.institute if you feel like making such a donation or get in touch if you have any other custom considerations uh if you if you'd like a uh conversation about where that could go we would look forward to it as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.093,
    "end": 1261.875,
    "text": " We deeply respect the priceless ways that people attend to the work and think it could go much, much, much bigger and faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.915,
    "end": 1266.242,
    "text": "Not that size and speed are everything, but with financial support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.544,
    "end": 1269.967,
    "text": "Alex or Blue, do you have any comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.291,
    "end": 1273.152,
    "text": "It was beautifully put.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.603,
    "end": 1285.21,
    "text": " Truly, I do not like to dilute our act-inf semantics with financialization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1285.47,
    "end": 1307.61,
    "text": "So I hope that we can find the right kinds of supports through grant and philanthropy and so on that allow us to just pitch that fastball and call those shots and have the opportunity for people to provide crowdsourced support of many kinds, but really hold up the priceless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.59,
    "end": 1336.264,
    "text": " meaning of attention while also keeping it compliant and sustainable and reasonable organizationally and again as alluded to in the fellows page you can go to that link and drop down to make a project restricted donation which we can now account for so those donations will have a reasonable institute level overhead percentage taken",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.7,
    "end": 1364.091,
    "text": " the rest will be available to the project for whatever they feel like is going to facilitate the work and it's a cool way to support specific projects or let us know if you want to support a specific project that's not here right now okay okay some quick updates from the organizational units first on eduactive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.758,
    "end": 1373.534,
    "text": " So we had four main projects this year, all of which will submit in due time their measurements and re-prepare for next year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.554,
    "end": 1381.27,
    "text": "Active inference ontology, audiovisual production, textbook group activities, and the active inference journal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1383.106,
    "end": 1398.128,
    "text": " just briefly on the textbook group this is working through and sharing an epistemic niche around the 2022 active inference textbook still the only textbook out there but likely not for long",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.137,
    "end": 1427.878,
    "text": " cohort six finished earlier this year cohort seven will continue from the midpoint on in 2025 and as with all things this is a volunteer activity so if somebody wants to see a time zone an open discussion application oriented sessions if somebody wants to scribe or facilitate in live sessions if somebody wants to make asynchronous contributions like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.858,
    "end": 1441.378,
    "text": " augmenting or cleaning up questions the hundreds of questions that are written in the document if somebody wants to explore translating parts of this open source textbook or our open source materials around it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1441.763,
    "end": 1444.569,
    "text": " There's a ton of ways to get involved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.73,
    "end": 1454.732,
    "text": "So if you're listening, just jump in and let's do it because there's a lot of people reading the book and there'll be more learners in the time to come.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.792,
    "end": 1458.22,
    "text": "So there's never been a better time to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.52,
    "end": 1485.692,
    "text": " increase the opportunities for others in terms of synchronous and asynchronous active education and also we will continue to template other reading groups and other educational material because as the years pass by now it'll be almost three years since this textbook coming out in march 22",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.432,
    "end": 1505.267,
    "text": " that has opened up so many other avenues for learning so we will continue to hold the space for this 2022 textbook while also seeing it as kind of like an attractor or a nexus where a lot of other resources get brought in a lot of other things can happen there too",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.453,
    "end": 1520.245,
    "text": " Just on the textbook group, I think that the math learning group this year that was done by Octopus was such a big augmentation for the textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1520.305,
    "end": 1523.568,
    "text": "So shout out to Octopus for facilitating that for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1523.588,
    "end": 1524.509,
    "text": "That was super helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.23,
    "end": 1529.914,
    "text": "And just I want to comment on the amount of annotation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.074,
    "end": 1533.718,
    "text": "I remember the first cohort of the textbook group,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.34,
    "end": 1562.44,
    "text": " um like being you know before the formulas were there before i mean you know being among the first to to do any kind of annotation for the textbook um versus the amount of annotation that's there now is like seriously seriously impressive and it's um amazing and awesome to see like the result of so much collaborative co-learning um in like a tangible form so the coda page is really quite awesome and deep and has evolved a lot over these years",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.377,
    "end": 1580.297,
    "text": " How many people currently, including Cohort 7, was involved, at least a bit, into learning Active Inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1581.72,
    "end": 1582.982,
    "text": "That's a great question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.102,
    "end": 1592.899,
    "text": "The number of registrations summed over all the cohorts is in the low hundreds, like probably between three and five hundred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.048,
    "end": 1605.167,
    "text": " and the number of people joining one to many meetings is probably in the few to several dozens that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.24,
    "end": 1628.37,
    "text": " it's dozens of people who have come through all the videos are available um of the recordings and and the subsets of those people and also people who probably never joined a synchronous activity maybe even people who didn't register and still made use of the resources the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.35,
    "end": 1655.978,
    "text": " youtube views and comments and discussions and all this other work so it's just so interesting with this sort of open science and reading group where it's like both being in the spotlight in terms of it being recorded and disseminated as well as not knowing what's out there nevertheless though",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.261,
    "end": 1687.163,
    "text": " in audio visual production where we coordinate the live streams and podcasts we had a great year tomorrow dean and i are going to do the 2024 review stream so we'll go over at least in a cursory quick gloss the 137 videos that were happening this year 2024",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.143,
    "end": 1713.522,
    "text": " um to to recap some of the the hits these are the most popular uploaded videos on our page commonality being darius's insight series being immensely popular with the exception of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.337,
    "end": 1735.645,
    "text": " other videos with carl friston and the course overview for the physics of information processing with chris fields insights took took the leaderboard so epic work darius this was an amazing series for the most popular live streams",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.113,
    "end": 1756.317,
    "text": " chris fields course lecture one two three four five and six in that order interestingly so it's like there's the attrition rate right there as well as the model stream with ryan smith",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.87,
    "end": 1768.53,
    "text": " live stream with Jonathan Gord, which is presaging some of the connections between the Wolfram area and active inference and other cool work like the Symposio.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.491,
    "end": 1772.837,
    "text": "So for people who are skilled or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.049,
    "end": 1789.071,
    "text": " not yet but might like to be with any number of ways to help like suggesting and curating and inviting guests facilitating streams and videos in english and other languages",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.051,
    "end": 1816.594,
    "text": " improving social media posting and other ways to communicate before during and after videos these are all places where somebody doesn't need to know how to derive variational free energy to make truly unique impact on the availability of these materials all right to re inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.823,
    "end": 1821.747,
    "text": " So from the Institute side, we had several projects in re-inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.949,
    "end": 1833.1,
    "text": "The most active was our rxinfer.jl learning and development group around the Julia package for statistics and active inference, rxinfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.442,
    "end": 1845.855,
    "text": "We continued to explore a few avenues around knowledge engineering and on the software development side in active block inference and active inference had a lot of fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.704,
    "end": 1870.678,
    "text": " just about the rx and fur project we had many people join those enjoyable discord times including this morning but thursdays this year and the the the meetings notes tell tales",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.658,
    "end": 1880.493,
    "text": " We applied for two grants as a team to support and catalyze the work that a bunch of people are involved in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.534,
    "end": 1883.438,
    "text": "We have one grant still pending.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1883.458,
    "end": 1891.03,
    "text": "It's published, though, as a preprint on Farmworks, Decentralized AI Agents for Personalized Solutions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.01,
    "end": 1902.15,
    "text": " working with vladimir bowlin and collaborators so this is going to be an uncertainty to be resolved in early 2025 something that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.248,
    "end": 1925.792,
    "text": " ties in well with a lot of other projects though so we look to continue this and just a few days ago we learned that we did not receive a ai safety grants village validating inference for large-scale agent governance ecosystems so if you're a grant officer or philanthropist you're interested in ai safety if you want to contribute if you want to support",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.042,
    "end": 1929.486,
    "text": " We have a lot of people interested in those topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.147,
    "end": 1936.314,
    "text": "We and others believe that active inference has a unique role to play in the AI safety and alignment space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.175,
    "end": 1939.298,
    "text": "So maybe get in touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.704,
    "end": 1948.869,
    "text": "A little bit more generally about projects at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.551,
    "end": 1954.716,
    "text": "I'm going to take two passes at the prepare measure cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.653,
    "end": 1962.961,
    "text": " Here in the center, we have a holographic screen, Markov blanket, boundary, interface, all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.762,
    "end": 1974.154,
    "text": "And there's a cycle of preparation and measurements interfacing with that screen by Alice and Bob on both sides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.675,
    "end": 1982.104,
    "text": "And in the context of projects at the Institute, that's reflected by a prepare form and a measure form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1982.084,
    "end": 2010.673,
    "text": " measure form has a short version that basically just says what was it what happens can we share it and there's a longer version so now zooming out a little bit preparation lets us know that you're about to start something it might be something that doesn't ask anything of the institute it's just like hey list this publicly or don't but i'm about to go out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2011.463,
    "end": 2017.069,
    "text": " Or maybe there's something small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.167,
    "end": 2043.293,
    "text": " or even something very large that the institute could do to support what you're proposing to do or if there's something that's blocking your fulfillment of that but you'd like to propose it pending possibly a future moment when we have an internal grants program so that applies to every measurement from the iCICADE on up to the multi-center collaboration",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.442,
    "end": 2056.506,
    "text": " and on the measurement side it is about what happened it could be i saw a bird it could be i saw two birds it could be i saw this paper i didn't write it but i came across this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.891,
    "end": 2085.278,
    "text": " it could be here's what we did in our project and here's what we learned and these preparation and measurement forms are some of the primary interfaces amongst everyone all those listening and attending and the institute it's a standard that we hold institute internal projects to as well that they engage in this alternating two-stroke engine of reporting back even if it's just one sentence but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2085.258,
    "end": 2097.597,
    "text": " it's truly amazing how much challenge and friction and inertia there can be around reporting even when people have done truly incredible things so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.678,
    "end": 2124.124,
    "text": " gently and kindly to myself and others i encourage that people fill out that measurement form when they've done stuff so that we can share it if you say yes in the newsletter and through other channels and so that it can be broader understood what you're doing so that you can demonstrate when you did certain things and it's an important channel of communication with the institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.268,
    "end": 2131.775,
    "text": " There was a bunch of projects that fulfilled the proposed and some measurements this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.815,
    "end": 2136.741,
    "text": "They're all available at activities.activeinference.institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2137.762,
    "end": 2142.427,
    "text": "And all of those projects will go inactive at the end of this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.049,
    "end": 2151.597,
    "text": "They will be required to fill out a measurement form and a proposal to come back online in 24.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.538,
    "end": 2178.732,
    "text": " That will support the flow of energy and attention and activity to live projects so that we can have healthy portfolio scale updating and continue to re-center the Institute as a place where people can find out what's going on, find out what has been, find out what could be, get visibility for their work, meet others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.167,
    "end": 2183.601,
    "text": " So again, measure for providing any updates or observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.665,
    "end": 2185.809,
    "text": "It could just be one off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2185.909,
    "end": 2186.672,
    "text": "It could be anonymous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2187.715,
    "end": 2192.35,
    "text": "Also for projects, it's required for internships and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.865,
    "end": 2223.231,
    "text": " and prepare so if you're proposing a new endeavor or a new project whether you would like it listed at our activities page for visibility or whether you're seeking some further kind of support and ask big we would be honored and excited to curate those requests and dream of a future day when we could share that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.223,
    "end": 2246.518,
    "text": " with sab or with funders or with other groups and say here's what people are proposing here's the kind of support that we would want to provide to support these people to do this work this way and here's how we'll have accountability and follow-up with the measurements too so just some thoughts of course open for everyone's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.916,
    "end": 2251.925,
    "text": " co-creating and feedback and joining from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2251.965,
    "end": 2264.794,
    "text": "But those are just some of the ways that we've seen how this prepare and measure two-stroke engine can help us do more together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.462,
    "end": 2270.848,
    "text": " Alex or Blue, any thoughts on projects or just anything else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.248,
    "end": 2279.178,
    "text": "Also 2024 being the year that we introduced this two-stroke cycle of prepare and measure following from the 2023 course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2279.318,
    "end": 2284.465,
    "text": "But do you have any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.545,
    "end": 2285.086,
    "text": "Yeah, I like it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2285.126,
    "end": 2290.132,
    "text": "The prepare and measure way of just reporting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2290.933,
    "end": 2295.699,
    "text": "I think it's really hard for a lot of people to toot their own horn, you know, especially in science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.719,
    "end": 2296.3,
    "text": "I think like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.022,
    "end": 2323.131,
    "text": " it's hard for people to like self-promote or it's not not something scientists are necessarily like naturally inclined to do um but i think having this reporting mechanism helps us like to track what's actually happening so like if you didn't document it you didn't do it essentially um so it is a good way to kind of look back and and you know see your own achievements not just not just for us but but for yourself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.368,
    "end": 2329.435,
    "text": " Yeah, and I think that's a great example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2329.475,
    "end": 2339.82,
    "text": "What I usually try to do is to apply new theoretical developments",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2341.1,
    "end": 2371.107,
    "text": " some specific ways of doing so we are taking it serious and trying to implement in some aspects of what we are doing and yeah it's really great right it's like from heavy heavy scientific quantum course goes into some actually possibly counterintuitive but actually small steps for project to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2371.087,
    "end": 2391.272,
    "text": " to prepare and to measure and it gives effects brings effects not only for project itself but the whole nested structure of our organization and even for ecosystem as we understand it currently",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2393.885,
    "end": 2420.027,
    "text": " thank you yeah i blow to your point about tooting horns i think a great role informally or possibly for an intern or for a project scale is like an internal reporter role or a documentarian or agnographer role someone who's just like that was an awesome meeting i'm gonna spend a few minutes summarizing that authentically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.007,
    "end": 2449.272,
    "text": " just by hand or i'm going to use llms to summarize that and distill that into a report and and there's so many ways in which like the people who are still accelerating up their learning curve in a given meeting can be making those reports and asking those questions and not just be included in the culture but actually creating it so that's cool okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.783,
    "end": 2457.93,
    "text": " A closing section towards the stack for applying active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.331,
    "end": 2463.876,
    "text": "Just some quick notes and thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.896,
    "end": 2477.25,
    "text": "A lot more will unfold in the coming year, but I just wanted to footnote it in 24 and point a little bit towards some of the ways that this may be going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.952,
    "end": 2485.522,
    "text": " During this section, anyone, please feel free to write comments or questions in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2486.023,
    "end": 2495.938,
    "text": "And then after this section, we'll have any final thoughts or comments from Alex and Blue, and then look at any questions in the live chat and address them from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2495.958,
    "end": 2496.218,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.241,
    "end": 2501.386,
    "text": "Whether, when, what, how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2502.528,
    "end": 2505.212,
    "text": "For the Institute, for Active Inference overall,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.15,
    "end": 2511.577,
    "text": " Whether to actively infer or not, that is the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.618,
    "end": 2527.04,
    "text": "Whether tis nobler in the mind to suffer the slings and arrows of subject matter expertise or take math our arms against a sea of uncertainties and by expertly predicting bound and live with them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.344,
    "end": 2531.947,
    "text": "When are we going to be doing that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2531.967,
    "end": 2535.452,
    "text": "Well, always already sure and still.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.563,
    "end": 2565.27,
    "text": " we're going to be doing it next year in 2025 and we hope much beyond that too and as all I think therefore I am I am therefore I think type systems which we study as long as it's actively inferred to be so what really is it what is happening at the institute we want to support host convene resource provision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.385,
    "end": 2594.869,
    "text": " active inference research education and service forms and functions for modeling ecosystems of shared intelligence across many domains those projects will always be scattered and volatile across different developmental stages we will aim to stay relevantly updated with developments from outside the institute about research companies tools and other happenings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.933,
    "end": 2606.947,
    "text": " and we'll look to curate and analyze those reports of measurements into sector reports, language reports, all different ways to make the information more accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.15,
    "end": 2609.213,
    "text": "But what is it really?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.8,
    "end": 2636.382,
    "text": " well beyond our core educational and open science infrastructural work like the ontology journal textbook groups and so on there is a growing cadre of projects that are developing different applications of active inference so these are like domain or system of interest scale or user space applications for different aspects of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.362,
    "end": 2664.242,
    "text": " systems where ai has or hasn't been applied but people are thinking about it differently with active inference and that includes projects and call signs like the bio firm for regenerative finance bioregionalism like farmworks for agriculture and iot village for ai safety and a variety of other projects from the legal domain the myrmecological domain",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.442,
    "end": 2689.639,
    "text": " in the area of cognitive security scientific ecosystem modeling regional modeling and all these other kinds of projects that research fellows bring to the table so there's all these projects when people think well what would it really look like would it be a car is it a drone is it precision psychiatry is it resource allocation and servers what are those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.851,
    "end": 2693.255,
    "text": " frontline applications of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.077,
    "end": 2705.097,
    "text": "And so these projects can be nurtured on top of a robust, applicable, accessible how.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.157,
    "end": 2734.425,
    "text": " that's what people asked in the active inference symposium was okay applied how and how is a key part of getting these projects to where they can be and where people prefer them to be getting to that how and building the documentation and education everything around it and before it is going to continue to be a mission for us in the years to come",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.097,
    "end": 2741.925,
    "text": " In this fractal journey with the Institute as vehicle, we see collaborators, contributors, co-explorers, and partners.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2742.746,
    "end": 2752.136,
    "text": "And we look towards the development of open source tools, which span the continuum from here on the left, let's just call it the light stack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.237,
    "end": 2758.303,
    "text": "So this would be multimedia and interactive experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2759.38,
    "end": 2771.138,
    "text": " in the no code on through low code level of technical detail, all running in a browser or something that doesn't require installation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.759,
    "end": 2781.574,
    "text": "So these might be variously deployed products or websites that make graphical accessible interfaces for active inference possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.735,
    "end": 2786.266,
    "text": " And on the right side is the heavy stack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.286,
    "end": 2792.745,
    "text": "So this is the sort of full fledged enterprise grade research integrity, custom modular stack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.075,
    "end": 2822.243,
    "text": " starting at a place that's relevant for the project so just because i'm laying it out this way tentatively doesn't mean that this is the entry point for every project but digging down down down to the bottom to the basement of the bottom bunker we have the possibility of running active inference algorithms on bare metal silicon and also other substrates already people are working and have presented on neural substrates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.223,
    "end": 2849.31,
    "text": " and physical substrates like thermocomputing and we can look forward to a variety of other unconventional post-Turing, post von Neumann architectures so it's important to leave the bottom floor open because we don't know the physical embodiment of what computing and cognition will look like in the future working just temporarily within a computational von Neumann paradigm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.729,
    "end": 2867.923,
    "text": " We have a lot to learn from the neuroimaging community, and I'm really thankful for Bradley Alicia and colleagues in Open Science for their contributions to the SAB and to this symposium, and for highlighting some of the ways in which the neuroimaging community",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2868.443,
    "end": 2895.868,
    "text": " which is also trace it back to Carl Friston's lab the genesis of active inference community in certain ways the ways that they deal with reproducibility and research integrity for example having neurodebian which is a variant of the debian linux distribution maybe we could have an active debian they have neurodesk which is a containerization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.034,
    "end": 2918.92,
    "text": " environment flexible and scalable data analysis environment for reproducible neuroimaging we could have active desk a walking desk exercise desk something like that for containerization so that open source containers and images as well as proprietary or encrypted blobs could be provided and we would know that it would come to work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.305,
    "end": 2938.123,
    "text": " alex arorbia in his lab has uh through the ngc package neural uh generative coding has a ngc museum which reflects all the different models that people have coded up in ngc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.475,
    "end": 2946.385,
    "text": " so that each paper can have its own repo, and then also those repos get compiled into this museum for NGC.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2947.366,
    "end": 2954.695,
    "text": "And while we have our curated tables, Morgan highlights NeuroFedora, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.716,
    "end": 2965.849,
    "text": "While we have our curated tables of Active Inference implementations, which people can look at and see the dozens of open source repos,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.647,
    "end": 2969.613,
    "text": " that take time to load.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.343,
    "end": 2987.018,
    "text": " and see these repositories, some of these links might go offline or it's hard to tell where exactly the status is or what attributes these different models have, what kinds of inputs or outputs are they providing and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.679,
    "end": 2998.89,
    "text": "And so with something like whether museum sounds a little bit static or whether we wanna have some other way to think about it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.87,
    "end": 3027.291,
    "text": " figuring out how to make generative models and ecosystem cognitive simulations reproducible is vital i mean it's essential for even getting the script to run 15 minutes later on the same machine let alone a different operating system or a different containerization environment so i look forward to seeing the repositories of specifications",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.473,
    "end": 3056.839,
    "text": " and the rendering tools like GNN, AgentMaker, GRT, P3IF come into play to finally, after all of that, bring it to the terminal inference algorithms, whether those are implemented in RxInfer, in PyMDP, whatever programming language, whatever way those inference algorithms are implemented, we could have a more total understanding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.241,
    "end": 3073.106,
    "text": " and customizability around going from whatever processing substrate we're working on through the operating system and containerization environment, understand what version of what generative model specification we're working off of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.147,
    "end": 3084.784,
    "text": "Have reliable, if not deterministic, rendering of those generative models and strong execution of the rendered form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.456,
    "end": 3097.35,
    "text": " This would provide the most level of customizability and the heavy stack would underlie the graphical experiences that are hopefully enjoyed by so many on the light stack.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.831,
    "end": 3113.168,
    "text": "Back to the educational side, whether leaning more on one or more on the other of these two stacks, we could have examples, guidebooks, applications, all these kinds of interfaces available",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.873,
    "end": 3135.898,
    "text": " There could be educational simulations, we could reproduce the textbook examples, other textbooks, we could reproduce papers and support templates for people who are doing research, different kinds of simulations, math, getting into the analytical details, visualizations, games, workspaces, all these kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3137.617,
    "end": 3162.662,
    "text": " at the institute level continued development and clarification of how these core active inference functions can be built what are the shared cognitive computational functions that these different applications need that can be reflected on a shared tech tree connected to the active inference ontology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.794,
    "end": 3186.017,
    "text": " then understanding how that all interfaces with different applications will support collaboration it'll support all these different ways which people are thinking well how is it going to be applied they may want to jump in at the domain level or the system of interest knowing that there's something solid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.267,
    "end": 3215.312,
    "text": " and something that people could also contribute to if they wanted to underneath so it'll be exciting to see this all unfold next year and beyond so thank you all for a great tetrahedral year 2024 until the next one which of course will be 2300 so blue and alex what are your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.524,
    "end": 3220.654,
    "text": " Last thoughts or questions here, and then we'll look in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.12,
    "end": 3225.667,
    "text": "I just wonder where the Institute will be in 2300.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.767,
    "end": 3233.065,
    "text": "It will rule the world, definitely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3235.745,
    "end": 3247.881,
    "text": " And I want to share my thoughts and feelings and especially after the last piece of presentation of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3249.076,
    "end": 3252.222,
    "text": " What project in Institute currently?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.242,
    "end": 3260.359,
    "text": "I have a strong feeling that engineering possibly will be the main world for next year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.361,
    "end": 3265.87,
    "text": "Currently it's only in one of channels in Discord.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.963,
    "end": 3292.178,
    "text": " but possibly by the end of next year or even earlier we will have an organizational unit of engineering because it looks like educational research and not actually development but engineering should be in place and enabled somehow by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3292.158,
    "end": 3305.458,
    "text": " organizational structure because all that genetic models all that application bio firms and others us definitely looks like some kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.94,
    "end": 3323.903,
    "text": " new entities which should burn and grow starting from yeah from someone's knowledge from education from some deep research and then going into life through engineering cycles",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3323.883,
    "end": 3347.646,
    "text": " And possibly currently RxInfo group, which I see is a project which is already grew beyond just RxInfo, but a lot of our initiatives and frameworks that could be in use in place for some project specifics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3347.626,
    "end": 3364.318,
    "text": " That's why engineering is a high-level concept and methods of work which we also understand and put in place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3364.298,
    "end": 3377.987,
    "text": " for now at project scales possibly need to have more attention more more developments in terms how to use engineering methods in works of all our scales",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3382.642,
    "end": 3411.501,
    "text": " thank you that really makes me reflect on how it's obvious and yet still hits like a blast of cold air that we need people with different backgrounds to be involved and to contribute the scientists and researchers and academics have made a lot of contributions to active inference and also will in the time to come and engineers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.987,
    "end": 3440.256,
    "text": " may play increasingly critical roles in supporting those core functionalities that research and application builds and jumps off of and there's all these other elements that that we play with bringing in and work too to bring in like art and cultures and it's not for one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.518,
    "end": 3469.939,
    "text": " person to see every corner of the niche so how we reconcile like that finiteness of our own experiences and affordances and development with the open-endedness of collective systems and the way that we get to assemble around the question and topic of shared intelligences",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.138,
    "end": 3499.032,
    "text": " while manifesting that ourselves hard to put into words sometimes slash parts that can't be put into words but it's all right there and i guess everybody is just playing a different part in it okay morgan thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.323,
    "end": 3527.213,
    "text": " love evolve excellent agnographer role meme lives egg egg egg okay love evolve wrote please share more reflections visions of agnography and especially wise agnography in the next phase and beyond okay if either of you have a comment on that feel free to make so otherwise I'll keep that in mind",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3528.29,
    "end": 3553.386,
    "text": " okay sharif wrote manifest agi well we'll wait another minute and see if anyone else writes any comments or specific questions let's just quickly revisit what we saw while just waiting one minute for if anyone wants to write any specific questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.062,
    "end": 3588.97,
    "text": " There is a question about supporting materials in relation to textbook group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3590.192,
    "end": 3595.621,
    "text": "Okay, Morgan wrote, if we are doing a textbook reading group, do you have recommendations for supporting materials?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.745,
    "end": 3599.708,
    "text": "Do you want to give any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3610.741,
    "end": 3616.911,
    "text": " Possibly one third about... There are a lot and a lot of materials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3617.912,
    "end": 3631.213,
    "text": "The textbook itself contains a lot of references and code document which enables working of this group is also has a lot I believe.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.193,
    "end": 3661.2,
    "text": " but possibly the main thing here is the format of collective learning action so to be with people who also have interest to learn active inference and be in this group and participate of this session and then put your own efforts to support others learning path could be much more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3661.18,
    "end": 3679.594,
    "text": " efficient than any other like just material thank you alex i posted the resources link here there's a table that ali curated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.3,
    "end": 3709.817,
    "text": " that provides one possible path but that's kind of the knowledge engineering side is resources as nodes and paths as walks on the graph and throughout the hundreds of questions there's so many resources and things and somebody who is adding more fastidiously would have probably added another several factor you pointed Alex to the group as resource",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.017,
    "end": 3738.522,
    "text": " that there's adding into resources including with questions and uncertainties and then there's people as the resource in our path to connect and also i think it's all happening so fast so it's even it's even funny to remark on it but like in 2022 when we started the textbook group around this book there was not the generative ai affordance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.7,
    "end": 3769.116,
    "text": " today it's almost i i see places where people are almost people let's just say are almost putting more synthetic content than authentic content and there's more people who are using llms to summarize a paper and then someone else uses an lm you know so it's like of course we can go into that forever but in terms of how that has changed what a resource means",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.72,
    "end": 3777.149,
    "text": " Whereas the static resource concept was like, oh, this is an awesome stream by Ramsdet et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.229,
    "end": 3788.121,
    "text": "Or you should check out the paper or go to the bibliography from there or go to a scholar search and find out what else is happening from that author or keyword.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3788.141,
    "end": 3798.293,
    "text": "That kind of like library science all of a sudden has evolved into the library being like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3798.914,
    "end": 3820.973,
    "text": " the zoo of dreams and nightmares where you walk in with your query and living artifacts come to meet you and so that is just pre-transformed appropriately with Transformers and everything like that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.442,
    "end": 3847.652,
    "text": " the landscape of learning and resources in in ways that that have really complex short and long-term effects because you're only one sentence away from please write me an explanation of variational free energy starting from xyz in the style of abc it's like with that at everybody's fingertips",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3849.387,
    "end": 3873.37,
    "text": " now it is trained on some of those resources and all of that so again not to go too much into it but just there are so many angles of approach that people take into active inference and so many things that people are looking to do with it and that would also on unfold through that person's journey over the years that it's like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.497,
    "end": 3886.755,
    "text": " And there's such a daunting amount now taken to the infinite generative level that it's really like, whoa, what are the right ways to learn?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.935,
    "end": 3896.269,
    "text": "But in that openness around the ways to learn and apply, that's where we have our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3905.092,
    "end": 3926.695,
    "text": " in the uncertainty around it not in the certainty around how to learn and apply okay thank you alex thank you blue thank you to other live chatters and viewers so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.852,
    "end": 3934.523,
    "text": " This video should have the information that you can use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.305,
    "end": 3938.171,
    "text": "And if not, just get in touch, whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3941.297,
    "end": 3941.798,
    "text": "Okay, bye.",
    "speaker": "SPEAKER_00"
  }
]