[
  {
    "start": 0.981,
    "end": 2.263,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2.924,
    "end": 15.701,
    "text": "At the Active Inference Journal, we are eagerly seeking contributors who would like to help improve the transcripts, named entities list, and topics discussed in the ongoing Chris Fields course, Physics as Information Processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.241,
    "end": 16.982,
    "text": "Right now it's May 2023.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.985,
    "end": 47.15,
    "text": " if you're already planning to spend time on this course we hope you'll consider working with the journal as well this is a unique opportunity to build editorial skills and make high leverage open science contributions to the active inference ecosystem specifically this work entails listening carefully to the course lectures and discussions and making corrections to the ai generated transcript for this we use assembly ai for example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.99,
    "end": 51.313,
    "text": " For the transcript of the first lecture, see this link here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.795,
    "end": 55.957,
    "text": "This is what the transcript looks like on the GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.718,
    "end": 71.091,
    "text": "We have a markdown file that allows line-by-line editing, and we use this markdown file as the basis for further rendering and translation into different languages, as well as training on language models and other functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.905,
    "end": 98.555,
    "text": " also building out the list of entities named that is people and topics so here we have people named and already from the background video and first lecture we have dozens of names that have been mentioned and we have topics discussed so this will continue to grow and that will improve the scholarship and the relevance of this work as we know so many of the interesting topics being mentioned",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.174,
    "end": 104.539,
    "text": " All the transcripts and materials related to this course will be published open source.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 105.28,
    "end": 113.409,
    "text": "If you want to see what that looks like or what that can look like, check out the earlier transcript of the Marc Solms live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.312,
    "end": 118.176,
    "text": " where we enrich the transcript with images and tables of content as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.796,
    "end": 127.104,
    "text": "So this is a really important open science way to improve the impact of the live streams and the videos that we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.805,
    "end": 130.207,
    "text": "And it is also really important for accessibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.937,
    "end": 146.646,
    "text": " We have synchronous meetings with the Active Inference Journal in the Active Inference Institute's Discord on Mondays at 13 UTC, although most of the work on this project is done asynchronously, for example, via the GitHub links above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.666,
    "end": 158.293,
    "text": "If you're interested in participating in the journal on this project, please let us know by joining the journal channel on the Discord or by emailing activeinference at gmail.com.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.973,
    "end": 160.454,
    "text": "Dave, what else would you add to this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.597,
    "end": 176.384,
    "text": " Working on detailed editing of a transcript is a great way to learn the material in depth and particularly to spot things that you might have thought you understood that you didn't really understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.065,
    "end": 178.726,
    "text": "So do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.246,
    "end": 180.527,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 180.667,
    "end": 181.247,
    "text": "Great points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.327,
    "end": 182.968,
    "text": "Totally agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.708,
    "end": 183.948,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.008,
    "end": 188.211,
    "text": "So looking forward to people's participation here and till the next update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.431,
    "end": 188.731,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]