[
  {
    "start": 4.128,
    "end": 5.85,
    "text": " All right, I hope we are live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6.431,
    "end": 7.472,
    "text": "Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.572,
    "end": 10.775,
    "text": "This is Active Inference Livestream 6.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.075,
    "end": 13.758,
    "text": "It is October 9th, 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.739,
    "end": 26.131,
    "text": "I am Daniel Friedman, and I'm going to be doing a solo contextualizing episode, I guess, of Active Inference Livestream today on the paper Tale of Two Densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.096,
    "end": 28.376,
    "text": " Welcome to TeamComm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.017,
    "end": 33.358,
    "text": "We are an experiment in online team communication and learning related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.778,
    "end": 43.901,
    "text": "You can find us on Twitter at inferenceactive, at Gmail, via our public Keybase team, or via YouTube, which is where you may be watching us now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.822,
    "end": 51.624,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so we can improve on different aspects of our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.668,
    "end": 54.969,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.79,
    "end": 60.232,
    "text": "And as far as video etiquette goes, mute if there's noise in the background, raise your hand, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.533,
    "end": 63.554,
    "text": "Here we are in ACT-INF stream 6.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.535,
    "end": 70.798,
    "text": "And the goal of this stream is really to set the context for the upcoming discussion next Tuesday on 6.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.021,
    "end": 81.388,
    "text": " That discussion is going to be on the paper, A Tale of Two Densities, Active Inference is Inactive Inference by Ramsted et al., published in 2020, online in 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.125,
    "end": 93.812,
    "text": " And what this video is going to do is provide context for some of the ideas, types of models, philosophical threads, and vocabulary of the Ramstad et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.853,
    "end": 94.153,
    "text": "paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.233,
    "end": 100.938,
    "text": "In other words, it will help contextualize why this topic is being discussed, why there's a regime of attention on this topic, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 101.939,
    "end": 103.34,
    "text": "Here are the sections of this video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.758,
    "end": 113.56,
    "text": " First, I'm going to frame the problem as being about what the free energy principle and active inference say about agents and the world and their relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.801,
    "end": 121.402,
    "text": "And then to contextualize different ways of thinking about that, we'll learn about Bayesian models and inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.702,
    "end": 123.323,
    "text": "Just brief, brief takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.423,
    "end": 126.664,
    "text": "Of course, you could go a lot into depth on different takes here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 126.844,
    "end": 130.565,
    "text": "I'm just trying to really cut in broad strokes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.385,
    "end": 147.058,
    "text": " And then in the last part of the discussion today, we'll talk a little bit about the philosophy of science as far as the difference between a principle, a theory, and a hypothesis within the Fristian sphere using his response to an interview question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.311,
    "end": 154.578,
    "text": " So next time on number 6.1, we're gonna discuss the paper with anyone who wants to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.658,
    "end": 156.981,
    "text": "So please save and submit your questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 157.922,
    "end": 165.15,
    "text": "If you're interested in participating or if you're watching it after, ask your questions then, or if it's before, get in touch with us if you wanna discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.95,
    "end": 167.092,
    "text": "All right, so here it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.646,
    "end": 187.855,
    "text": " The real topic that we're going to be addressing here is what does the free energy principle and active inference say about the relationship between the world and agents and how we think about this formally in terms of how we model it with computers or just cognitively as well as how we experience it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.135,
    "end": 189.376,
    "text": "It's just all important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.416,
    "end": 191.316,
    "text": "So this is a pretty general topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.577,
    "end": 194.698,
    "text": " Here's one example of a world and an agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.199,
    "end": 210.97,
    "text": "But world and agent are not only used interchangeably, as we'll later find out, because one agent's world is another world's agent and so on, but really just because this is a pretty general framework of relational modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.11,
    "end": 218.075,
    "text": "So it doesn't have to be the globe or the world as you exactly think of it and agent as in a robot agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.835,
    "end": 222.637,
    "text": " we're going to be probably thinking broadly about what it means to be connected for two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.898,
    "end": 229.46,
    "text": "And this video certainly is just an introduction to the context of some of these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.821,
    "end": 233.723,
    "text": "It's not a review or meta analysis or final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.843,
    "end": 246.869,
    "text": "It's just as I was reading through the paper, it was how I structured the information and it was how I was thinking it might make sense to read some of the quotes and use those as springboards to talk about the bigger questions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.67,
    "end": 257.709,
    "text": " as usual, trying to start from the active inference perspective and then reach out to the broader questions as well as go the other way, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 258.671,
    "end": 258.791,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.296,
    "end": 266.921,
    "text": " In this video specifically, as it relates to free energy principle, I'll just provide the punchline first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.582,
    "end": 270.844,
    "text": "The punchline is that generative models are not structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 271.385,
    "end": 275.348,
    "text": "They are embodied and enacted regimes of policy, attention, and behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.828,
    "end": 286.177,
    "text": "So if it doesn't make sense to you yet why that's the punchline or why that's one of the conclusions essentially of this paper, then just keep listening and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 286.757,
    "end": 286.937,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.238,
    "end": 292.121,
    "text": " So in this talk specifically, the structure is going to be like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.661,
    "end": 297.824,
    "text": "First, we'll go through the goals of the 2020 Tale of Two Densities paper, read through the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.505,
    "end": 304.068,
    "text": "Then we'll talk about Bayesian inference models, kind of steel manning them, putting them in a strong light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.789,
    "end": 310.632,
    "text": "Then talk about inactive and action models pretty broadly, though there's a lot of nuance in both of these categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.513,
    "end": 316.176,
    "text": "Then talk about agent world modeling in FEP and ACT-INF.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 317.268,
    "end": 334.773,
    "text": " and previewing mainly by reading quotes from the paper and highlighting specific claims, highlighting how active inference and free energy principle build on this map and territory that are in play with Bayesianism and inactivism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 334.893,
    "end": 341.735,
    "text": "And again, the underlying question is, what do we have to say about how the world and agents and agents and agents are related to one another?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.755,
    "end": 342.936,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 345.168,
    "end": 349.01,
    "text": " The paper is called A Tale of Two Densities, a literature reference there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.61,
    "end": 356.253,
    "text": "Active inference is an active inference by Ramstead, Kirchhoff, and Friston in the journal Adaptive Behavior in 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.214,
    "end": 372.801,
    "text": "And the goal of the paper, which I believe is the first sentence of the article is, the aim of this article is to clarify how best to interpret some of the central constructs that underwrite the free energy principle, FEP, and its corollary, which means related theory,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.9,
    "end": 384.568,
    "text": " active inference in theoretical neuroscience and biology, namely the role that generative models and recognition densities play in this theory, aiming to unify life and mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.688,
    "end": 400.36,
    "text": "And there'll be a consistent color scheme for the generative model and the recognition densities, because we're going to be looking to integrate these two different ways of thinking about agent world dynamics in the Bayesian and the inactivist worldviews.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.4,
    "end": 405.962,
    "text": " And so what we're going to talk the most about here are what these two densities are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 406.203,
    "end": 408.864,
    "text": "So you can ask in the book, what were the two cities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 409.324,
    "end": 411.285,
    "text": "Here we're going to ask, what are those two densities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.626,
    "end": 417.249,
    "text": "Then we can ask, what is this tail that integrates these two densities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.429,
    "end": 423.052,
    "text": "What weaves them together into one narrative, which helps us understand and helps us learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.198,
    "end": 426.159,
    "text": " So let's go first to the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.199,
    "end": 430.361,
    "text": "We already read the title, which is the first way that the authors want to represent their work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.561,
    "end": 440.146,
    "text": "Now we're gonna look through the abstract, and then later on we'll end up defining and working through a lot of the words specifically, but starting with the abstract is the first thing that you're gonna read about the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.718,
    "end": 451.06,
    "text": " The aim of this article is to clarify how best to interpret some of the central constructs that underwrite the free energy principle and its corollary active inference in theoretical neuroscience and biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.48,
    "end": 453.08,
    "text": "That may even be what we already read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.28,
    "end": 454.36,
    "text": "So same meaning there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.7,
    "end": 459.821,
    "text": "Namely, the role that generative models and variational densities play in this theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.861,
    "end": 462.482,
    "text": "So those are the two densities that we're going to be talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.502,
    "end": 470.583,
    "text": "We argue that these two constructs, which are the two densities, the generative models and the variational densities, have systematically",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.721,
    "end": 476.683,
    "text": " been misrepresented in the literature because of the conflation between the FEP and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.243,
    "end": 480.645,
    "text": "That's why at the end, we're going to be really specific about the difference between those two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.305,
    "end": 491.869,
    "text": "On one hand, and the distinct, albeit closely related Bayesian formulation centered on the brain, variously known as predictive processing, predictive coding, or the prediction error minimization framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.97,
    "end": 499.853,
    "text": "And we'll return to how the prediction or the predictive brain is related or different as a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.273,
    "end": 505.119,
    "text": " from a philosophy of science perspective and from a computational perspective, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.139,
    "end": 507.482,
    "text": "All right, second part of the abstract.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.383,
    "end": 509.044,
    "text": "More specifically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.313,
    "end": 514.954,
    "text": " We examined two contrasting interpretations of these active inference type models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.374,
    "end": 519.515,
    "text": "A structural, or really these two variational densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.795,
    "end": 522.896,
    "text": "The things that we're eventually going to see brought together in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.916,
    "end": 527.057,
    "text": "I believe, but if it's unclear, I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.577,
    "end": 530.857,
    "text": "A structural representationalist and in an active approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.117,
    "end": 532.998,
    "text": "And that's going to be our whole main discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.638,
    "end": 543.801,
    "text": " We argue that the structural representationalist interpretation of generative and recognition models does not do justice to the role these constructs play in active inference under the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.322,
    "end": 551.344,
    "text": "So the main theme that's going to get returned to is that the computational side is very tractable and stateable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.664,
    "end": 560.087,
    "text": "However, it misses some fundamental components that are going to be really complementary to the insights that are brought from the inactive approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 561.496,
    "end": 568.239,
    "text": " We propose an inactive interpretation of active inference, what might be called an active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.699,
    "end": 575.102,
    "text": "In active inference under the FEP, the generative and recognition models are best cast as realizing inference and control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 575.762,
    "end": 582.625,
    "text": "The self-organizing belief guided selection of action policies and do not have the properties ascribed by structural representationalists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.385,
    "end": 590.008,
    "text": "So that's just saying structural representationalists are wrong about properties in what they think because of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.909,
    "end": 595.845,
    "text": " actually generative models being basically cybernetic policy selectors and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.955,
    "end": 604.622,
    "text": " Their claim is that that makes some of the stances held by structural representationalists untenable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.343,
    "end": 607.925,
    "text": "So let's go to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 608.465,
    "end": 608.886,
    "text": "Here's a quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.526,
    "end": 618.015,
    "text": "The question that shall occupy us is how best to understand the function and properties of the generative and recognition models in active inference under the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.035,
    "end": 620.297,
    "text": "What does it mean for one theory to be under the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.657,
    "end": 622.018,
    "text": "We'll return to that at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.739,
    "end": 628.542,
    "text": " in light of the active processes involved in orchestrating, maintaining, and updating these models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.143,
    "end": 639.409,
    "text": "In particular, we examine two contrasting interpretations of these models, a structural representationalist, that's one of the schools of thought here, and an inactive interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.469,
    "end": 640.97,
    "text": "So two different interpretations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.83,
    "end": 646.674,
    "text": " So we can summarize this up as a structural representationalist versus inactive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.334,
    "end": 649.415,
    "text": "Whose hot take on systems will reign supreme?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.196,
    "end": 658.882,
    "text": "So first, let's just try to understand what each of these groups are really bringing to the table, because that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.129,
    "end": 665.995,
    "text": " hopefully a strong starting point from each of these two sides can lead to a better synthesis in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.397,
    "end": 670.059,
    "text": "In Bayesian inference, it's a big area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.92,
    "end": 672.702,
    "text": "This is just one way of presenting it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.802,
    "end": 680.53,
    "text": "You can definitely watch other lectures or learn from a lot of other more skilled people in this specific area about Bayesian approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.471,
    "end": 683.692,
    "text": " This is just one representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 683.772,
    "end": 691.616,
    "text": "I was trying to make a compromise between things that were implemented, but there's so many flavors and colors of what's implemented in the literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.956,
    "end": 696.379,
    "text": "So I just wanted to start with a really brief overview of the Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 696.919,
    "end": 700.621,
    "text": "This is a two level Bayesian inference scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.101,
    "end": 707.585,
    "text": " So variously, these two elements are known as priors and hyperpriors or priors in the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.925,
    "end": 714.349,
    "text": "But here on the left side, we have data which are reflecting sensory observations like that of a sensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.929,
    "end": 719.932,
    "text": "And then there's a generative model, for example, that generates sensor readings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 720.532,
    "end": 740.401,
    "text": " And so the question that is asked in the transformation from the sensory observational data, the lower level model on the left side to the generative model of the data, which is like often the higher order parameters in the computational model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.061,
    "end": 746.224,
    "text": "The question is, how do these observations influence or update the generative model of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.744,
    "end": 749.265,
    "text": "And so you can think about that as sort of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 750.475,
    "end": 773.626,
    "text": " empirical data coming in altering your parameters that represent deeper stances about the world so you have a sensor that fluctuates more rapidly and then you're doing some sort of stabilization of the overall readings of the sensor and that's like your higher order parameter just to give one of many examples and then the other question that's being asked in the transformation from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.286,
    "end": 787.419,
    "text": " how the parameters of the higher order model influence the data is basically what observations are emitted here given the generative model of the world or the generative parameters of the world, which includes different things like world states, causes, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.345,
    "end": 792.048,
    "text": " So here's some of the features and advantages of Bayesian models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.549,
    "end": 799.274,
    "text": "So first, they can extend to basically arbitrary graphical models, which doesn't just mean models you can draw.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.595,
    "end": 801.556,
    "text": "It means models that you can graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.217,
    "end": 809.643,
    "text": "So it turns out that a lot of classical and non-classical statistical techniques",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.504,
    "end": 816.786,
    "text": " can be reduced down to this type of a scheme at the highest level, statistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.926,
    "end": 827.489,
    "text": "It's discussed in Carl Fristen et al's textbook related to SPM, how these kind of Bayesian inference models relate to various empirical data sets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.509,
    "end": 830.91,
    "text": "So potentially of interest for people who want to learn more about that side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.691,
    "end": 839.053,
    "text": "The next thing that's good about these models is that they can be used to model multi-scale systems, so through space and time of different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 839.813,
    "end": 844.678,
    "text": " They have very tractable computation and implementation on hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.138,
    "end": 852.245,
    "text": "So you can take a data set and basically get useful information out of it using this type of a scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.365,
    "end": 854.628,
    "text": "So it passes the sort of utility check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.448,
    "end": 860.753,
    "text": "It's pretty flexible with having sparse or dense multivariate data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.645,
    "end": 872.951,
    "text": " I'll tie that to the second point here, which is that you can be empirical in the sense that you're learning and updating your position based upon data, but also you're formalizing the use of your prior information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.491,
    "end": 884.797,
    "text": "You're neither just informally combining your prior information with your newer information naively, just saying, oh, well, they're both equivalent because I have one of each, one of the past, one of the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.817,
    "end": 888.339,
    "text": "It provides more formalized ways of dealing with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.019,
    "end": 896.262,
    "text": " with information and depending on how much you rely on your prior information, you may only need very sparse inputs from your sensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 896.642,
    "end": 903.785,
    "text": "For example, you might only need a thermometer in a certain location to know whether it was in one climate regime or another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.706,
    "end": 910.248,
    "text": "These models can also be fit with expectation maximization algorithms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 910.288,
    "end": 918.391,
    "text": "That's also discussed a lot in Fristin's SPM textbook and work just and in the work of people who have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 919.648,
    "end": 932.535,
    "text": " done a lot more on expectation maximization algorithm learning than I'm going to go into detail in here, but it's a good topic to look into and one that I'm still learning about too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.955,
    "end": 937.238,
    "text": "Kind of as stated in a few points, these models are pretty deeply related to statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.138,
    "end": 940.96,
    "text": " of various kinds, as well as other mathematical areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.64,
    "end": 945.683,
    "text": "So let's just go to the structural representationalist interpretation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.043,
    "end": 946.904,
    "text": "First, structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.824,
    "end": 962.153,
    "text": "I think that there's probably wide latitude in what the structures mean, and there were several citations that characterized the structural representationalist viewpoint, so I'll let them speak to what structural representations and structural representationalism is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.194,
    "end": 965.595,
    "text": " I would say structures could represent data structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.815,
    "end": 971.256,
    "text": "It could represent things having structure in the sense that they're distinguishable from something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.576,
    "end": 973.097,
    "text": "So structure could be pretty broad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.717,
    "end": 979.919,
    "text": "Representations, that's a whole topic that I understand there's also a lot of debate over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.179,
    "end": 987.441,
    "text": "And we've read some other ACT-IMP-related papers on representations and their strengths and weaknesses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.082,
    "end": 1014.762,
    "text": " i just think it is what it is and this structural representation is holding the views that the authors have in their citations and that's where we'll sort of end the discussion on the bayesian inference models and think about these are all really good features of the model what is going to be something that's going to complement that from a pragmatic and philosophy of science perspective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.743,
    "end": 1020.846,
    "text": " So the second category of models is this inactive or active models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.746,
    "end": 1029.53,
    "text": "And here it's a lot more focused through a tradition of being action oriented and ecological.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.33,
    "end": 1034.132,
    "text": "It's more oriented about the relation between the world and agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.412,
    "end": 1037.574,
    "text": "So this comes from a lot of areas like systems and ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.614,
    "end": 1044.998,
    "text": "So the two questions that are being asked in the inactivist perspective are first off, how the world is influencing the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1045.738,
    "end": 1070.573,
    "text": " is a question about how perception is influencing or updating the action tendencies of the system and then the way that the agent is influencing the world or that causal arrow is kind of asking what actions are entertained by internal models and entailed through control mechanisms of the agent so both of the questions are about the joint niche between the world and the agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.829,
    "end": 1076.791,
    "text": " which will be formalized later, we'll find, as a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.051,
    "end": 1082.312,
    "text": "But for now, we can just think about the world and the agent being connected through this perception action loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.912,
    "end": 1087.894,
    "text": "So what are the cool parts about the inactive or the active perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.891,
    "end": 1101.435,
    "text": " So it's interdisciplinary, which encompasses a lot of interesting work in areas like art, cybernetics, ecology, psychology, dynamical systems, sociology and tech and evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.495,
    "end": 1107.056,
    "text": "So kind of also things that the Bayesian models have been applied in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.256,
    "end": 1112.858,
    "text": "So it's not unique to this, but some of the work in these areas is very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1113.698,
    "end": 1117.24,
    "text": " there's a qualitative and a relational and experiential aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.1,
    "end": 1129.166,
    "text": "And anything in the computational domain, it's usually a question about efficiency, whereas things that are in the qualitative domain, often it's about concordance with our experience or potentially even other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.426,
    "end": 1136.55,
    "text": "So it's an interesting and different development of theory to go down the route of more in touch with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.628,
    "end": 1145.194,
    "text": " phenomenologist's experience per se, rather than more implementable on modern computational hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.695,
    "end": 1161.486,
    "text": "It naturally relates to things like enculturation, developmental processes, sociality, because one agent, the world could be the body of another agent or it could be a small community or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.473,
    "end": 1177.826,
    "text": " It turns out that this inactivist perspective is more amenable to this externalism, which we discussed in a previous Actim stream, and other kind of radical embodied cognitive theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.347,
    "end": 1181.61,
    "text": "So I'll just leave that there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.65,
    "end": 1183.171,
    "text": "That's kind of more of a connector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.511,
    "end": 1184.652,
    "text": "But again, there's more and more...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.313,
    "end": 1189.135,
    "text": " fusion between these two approaches as evidenced by the discussion that we're having today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1189.575,
    "end": 1200.722,
    "text": "But these inactive approaches have definitely a very different literature base, different citation networks that are linking these ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1200.822,
    "end": 1214.029,
    "text": "So I'm just phrasing them in a way that's not representing priority or importance, just sort of throwing out different features that differentiate it strongly from the Bayesian perspective, computational perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.592,
    "end": 1215.792,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.973,
    "end": 1242.963,
    "text": "Inactive models also, interestingly, and this is one of the reasons why they've recently received a lot of attention, is that they're amenable to different kinds of things that maybe people would call physical computers in 2020, like ant colonies, slime molds, landslides, quantum systems, all these different things that do what can only be described as special types of algorithms or computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.063,
    "end": 1265.756,
    "text": " uh yet they don't do all problems so they're they're uh more like a bitcoin miner than a turing complete processor and computing language so they're specialized computers if they're computers personally i don't think the computational metaphor applies so well because i also think that this is a a perspective that takes us beyond computationalist metaphors of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1266.596,
    "end": 1268.076,
    "text": " the world sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.777,
    "end": 1278.139,
    "text": "But at the very least, the inactive perspective highlighted all these ecological dynamics of intelligence that are only now being appreciated from a more quantitative perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.739,
    "end": 1284.081,
    "text": "And also these active models, as you might guess, are part of a broader tradition of action and pragmatism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.161,
    "end": 1287.282,
    "text": "So it's another interesting area that kind of intersects there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.604,
    "end": 1292.127,
    "text": " So here's the simplification slash side by side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.407,
    "end": 1302.076,
    "text": "First, I'm just going to, again, try to distill it another level down without leaving too many false positives or too many false negatives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.176,
    "end": 1308.461,
    "text": "So if someone knows better about these areas, totally, I'm open to just correcting it and changing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1308.561,
    "end": 1315.227,
    "text": "I'm just, as I read through the paper, I just mocked this up to try to understand how these theories are different and similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.751,
    "end": 1321.093,
    "text": " A sort of quasi-Bayesian structural representationalist view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.714,
    "end": 1323.775,
    "text": "We can distill down to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.895,
    "end": 1330.239,
    "text": "We can say that there's the data parameters and the hyperparameters, or just the parameters of one model and that of another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.52,
    "end": 1334.862,
    "text": "And this can be, again, stacked up, multilevel, all these different things that we discussed earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.703,
    "end": 1347.071,
    "text": "And the way that the data, like coming in from the sensor, update the hyperparameters, like the beliefs about the world, are through what is going to be called the recognition model by that community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1348.151,
    "end": 1373.914,
    "text": " on the other hand the way that the predictions about the world state are used to generate the data parameters is a generative model and that is just like also considered sensory inference now it turns out that there's a lot of model and inference being thrown around and like isn't everything a model and all this sort of stuff yes it does um get a little confusing and so i've tried at a few points to be really clear and specific but sometimes in quotes um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.814,
    "end": 1386.637,
    "text": " They will use model or who's doing inference where, and we're just going to be pretty specific about what all the connections and the pieces are, and then hopefully it'll be clear what's similar and different between these two approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.977,
    "end": 1398.2,
    "text": "So the outcome of the Bayesian model, like a successfully converged model that's running here on a computer, it represents a statistical converged multilevel model that represents the structures of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.82,
    "end": 1427.146,
    "text": " so let's just think about the data parameters like the visual field like the sensor data on the retina so to speak and the hyper parameters being like where objects are and so even though there's no color vision in the periphery and even though there's low resolution vision in the periphery still i'm able to have a consistent uh relationship things look pretty normal because the sensory data are being generated in basic non-surprisal with the recognition model sensory data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.687,
    "end": 1433.364,
    "text": " So that would represent a sort of Bayesian computationalist perspective on vision and error correction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.374,
    "end": 1460.25,
    "text": " and optimization on the other hand we can side by side with the inactive perspective so the inactive perspective again situates the agent in the world as being linked through perception and action and the outcome of the inactive perspective is an embodied and ecological action sequence or like some sort of niche interplay from an embedded agent who makes or is behavior and this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.05,
    "end": 1464.714,
    "text": " a lot of the inspiration for things like plants, intelligence, or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1465.175,
    "end": 1469.38,
    "text": "It's just, oh, well, what time scale and what problems are you asking the system to solve?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.44,
    "end": 1474.265,
    "text": "And all these things that ultimately are the decisions and the classifications of the scientists",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.198,
    "end": 1484.464,
    "text": " or so it's said, are used to talk about the different intelligence or perception or action capabilities of different agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.204,
    "end": 1498.653,
    "text": "So let's try to unite this under what is said by free energy principle and active inference in this gap, explanatorily and causally, between the world and the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.094,
    "end": 1502.076,
    "text": "So on the top of this slide, there is a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.236,
    "end": 1507.559,
    "text": " figure one from the previous paper we discussed in five, I believe, and several other papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.22,
    "end": 1512.783,
    "text": "And it describes this minimal loop between the organism and the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.223,
    "end": 1516.526,
    "text": "So this is the first bridge connector point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1516.666,
    "end": 1524.532,
    "text": "So if you were on board with just the questions about the world and the agent, then we're still talking about just exactly that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.993,
    "end": 1526.113,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.843,
    "end": 1532.204,
    "text": " We want to build on the work and the perspective of the different insights from a few different areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.444,
    "end": 1550.289,
    "text": "First, from the schools of action, learning about things like inactive, embodied, ecological, pragmatic, practice, socio-technical, and experiential aspects of the inactive view that we discussed a few of earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1551.681,
    "end": 1561.286,
    "text": " From the more inference side, again, there's a lot of directions which inference is being used in, but it's one of the words in active inference, and so that's why I'm using them here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.046,
    "end": 1574.173,
    "text": "And on the more inference side, we can think about drawing the insights from Bayesian and computational approaches, statistical approaches, modeling, deep learning, robots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1574.673,
    "end": 1579.836,
    "text": "So all these kind of interesting things that think of the world, whether",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.396,
    "end": 1585.277,
    "text": " conceptually or just from a scientific modeling perspective, from a computational perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1585.858,
    "end": 1594.02,
    "text": "And then also there's another level that, as we'll see, is related to the roots of active inference in the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.44,
    "end": 1603.203,
    "text": "But there's this whole root layer of physics and specifically here, things like invariant sets and manifolds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.403,
    "end": 1615.311,
    "text": " patterns, multi-scale dynamics, collective behavior, phase transitions, as well as potentially a bridge to things like unconventional computing or more advanced or more tractable world modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.163,
    "end": 1623.567,
    "text": " Here we've gone one level deeper into that world agent mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.027,
    "end": 1635.135,
    "text": "So we still have world on the left side in the teal and then agent on the right side in the darker blue, except they're labeled now as internal and external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.656,
    "end": 1641.059,
    "text": "And they're linked through these two specific types of states called sensory and action states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.88,
    "end": 1656.615,
    "text": " So I'm going to go through a list of just features about the FEP and ACT-INF sort of skeleton of how the agent and the world are related to, and then see if that covers this diagram on the bottom left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1656.795,
    "end": 1657.075,
    "text": "We'll see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.896,
    "end": 1667.878,
    "text": " So internal and external states, so that's respectively agent and the world states, are linked through situation and model dependent blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.338,
    "end": 1672.139,
    "text": "So it's not like there's just one simple barrier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.419,
    "end": 1682.101,
    "text": "There is something that is contextualized that's a functionalized barrier in the context of the organism or in the context of the scientist modeling it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.761,
    "end": 1685.022,
    "text": "And so the states can be coarse or fine grain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.102,
    "end": 1688.948,
    "text": " And that's really a map territory situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.968,
    "end": 1689.008,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.374,
    "end": 1703.039,
    "text": " depending on how coarsely grained success in a situation can be basically achieved, then even very coarse grainings of certain strategies will work, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1703.68,
    "end": 1714.765,
    "text": "And one thing that we'll return to again and again is that active inference is about this relationship between the sensory input and the action selection, not necessarily just the convergence on the hypothetical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.785,
    "end": 1715.525,
    "text": "It's about the action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.925,
    "end": 1716.065,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.407,
    "end": 1730.036,
    "text": " There's this dual instrumentalism, and I think it was a really nice sequence of points brought up by Maxwell and others in one of the five discussions about this dual instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.156,
    "end": 1734.98,
    "text": "And so to kind of rehearse what those two instrumentalisms are, so the first,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.014,
    "end": 1740.776,
    "text": " usage of these types of partitioning models is as a scientific framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.836,
    "end": 1747.82,
    "text": "Because any system of interest that you can identify, you can identify its inputs and its outputs and its internal states and its external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.4,
    "end": 1752.782,
    "text": "And you can almost think, well, what would make this false?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.962,
    "end": 1758.545,
    "text": "How could I be outside of the system and model it in a way where there was internal states that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1759.545,
    "end": 1785.245,
    "text": " influenced external states without action or vice versa so that might be something that we don't know how to measure or it could happen but if it's a part of your model you could specify it with a different topology we'll return to the question of whether you could specify different partitioning and have it all work out but i'd suffice to say that for now we're just thinking about the skeleton of this relationship between the different states and as far as modeling from a scientific framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.205,
    "end": 1792.067,
    "text": " perspective goes, you can basically partition any measurable system into this kind of a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.627,
    "end": 1800.89,
    "text": "Now, the part that was referred to as speculative in the previous paper was as to whether this is actually what organisms do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1801.37,
    "end": 1813.333,
    "text": "And that's sort of a philosophical area that let's touch on later on and in ongoing discussions, because I think that's sort of one of the areas that we return to almost every week in ACT-Infostream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.074,
    "end": 1814.714,
    "text": "So just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.99,
    "end": 1825.853,
    "text": " Look at this diagram, think about whether you agree with the way that states are partitioned and keeping in mind the multi-scale insights from some of the previous discussions as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.353,
    "end": 1828.234,
    "text": "And could there be other ways that these are connected?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1828.974,
    "end": 1835.276,
    "text": "And then we're going to want to specifically draw together the Bayesian and inactivist ways of thinking about action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.996,
    "end": 1848.381,
    "text": " Okay, so here we go to the section where I'll read some more quotations from the paper and just highlight, draw out their exact argument about what the different schools of thought bring into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.382,
    "end": 1864.768,
    "text": "So, first they characterize the structural representationalists as having a good take on their own models, but missing action as a fundamental consequence of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.198,
    "end": 1869.159,
    "text": " a real far from equilibrium agent existing in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.819,
    "end": 1892.424,
    "text": "So the primacy of action means that, reading from the second paragraph, we argue that the structural representationalist interpretation of generative and recognition models, these two bidirectional arrows, while providing an accurate description of these constructs as they figure in some version of Bayesian cognitive science, so in other words, being a disciplinary tool,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.914,
    "end": 1899.817,
    "text": " does not do justice to the generative models and recognition densities that figure in active inference under the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.518,
    "end": 1907.421,
    "text": "So in other words, the interpretation of how those two types of models, agents and world,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.624,
    "end": 1921.515,
    "text": " models and hypermodels, how those two things are related, the computationalist perspective or the so-called structural representationalist perspective, it's missing some aspect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1922.356,
    "end": 1928.862,
    "text": "And then contrasting with the second red underlined part here, in contrast to these other Bayesian, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.962,
    "end": 1929.983,
    "text": "purely Bayesian theories,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1930.663,
    "end": 1934.226,
    "text": " which are in effect theories of the structure, function, and dynamics of the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.767,
    "end": 1945.135,
    "text": "Active inference is a much broader theory of adaptive phenotypes that centers on the control of adaptive behavior and that emphasizes the tight coupling and circular causality between perception and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.516,
    "end": 1950.26,
    "text": "So that's the part that draws it more naturally to systems thinking and to cybernetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.965,
    "end": 1963.648,
    "text": " All right, so structural representationalists argue that generative models function as structural representations, so no surprises there, with representational content.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.408,
    "end": 1979.733,
    "text": "Okay, a great summary of this view, which is a nice thing to say by the authors, reads that predictive coding theory, and this is being provided as a specific kind of sub-model within this Bayesian brain, structural representationalist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.913,
    "end": 1983.495,
    "text": " which we'll return to at the end as far as their formal relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1984.456,
    "end": 1993.242,
    "text": "Predictive coding postulates internal structures, so that's where you get the structure part, whose functioning inside of a cognitive system closely resembles the functioning of cartographic maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.602,
    "end": 1993.882,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1994.743,
    "end": 2006.951,
    "text": "It might be said that on the proposed interpretation of the theory, cognitive systems navigate their actions, so is it not action-oriented, through the use of a sort of causal probabilistic maps of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.131,
    "end": 2008.792,
    "text": "So there is a possible...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.973,
    "end": 2025.401,
    "text": " uh place for a structure so it's the maps are the representations that are in the neural system these maps play the role of representations within the theory okay believe it or not i guess so specifically this map-like role is played by the generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.281,
    "end": 2052.583,
    "text": " it is the generative models that similar to maps constitute action guiding detachable structural representations that afford representational error detection so here's what they're proposing they're saying that generated maps from some sort of map generator function are used to then do policy and agenda setting so action gets separated from second layer estimation in this way that's characterized as detachable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.604,
    "end": 2056.327,
    "text": " in that right side of the third line from the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.028,
    "end": 2065.217,
    "text": "So that's the perspective of the authors of this paper characterizing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.215,
    "end": 2069.137,
    "text": " hopefully in a positive light, the structural representationalists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.677,
    "end": 2077.921,
    "text": "So those are all interesting things I think that are cool, as well as all the aspects of these models that are beneficial discussed earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.701,
    "end": 2082.203,
    "text": "So on the other hand, let's look at what inactivism brings to the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.904,
    "end": 2089.047,
    "text": "In this section, we unpack the implications of the pragmatist view for understanding the relations between the generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.847,
    "end": 2091.628,
    "text": " the generative process and the recognition model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.089,
    "end": 2099.315,
    "text": "According to our pragmatist interpretation, the organism embodies the recognition density and entails the generative model as a control system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.035,
    "end": 2105.52,
    "text": "We then formulate a direct critique of the claim that generative models are structural representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.0,
    "end": 2111.244,
    "text": "So they're going to say because of embodied, enacted, whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.464,
    "end": 2115.105,
    "text": " the generative model is a control system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.765,
    "end": 2122.107,
    "text": "And then because it's a control system and not a map of the world, where are the structures, not where are the processes of the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.167,
    "end": 2124.808,
    "text": "There's no Google Maps for processes yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.308,
    "end": 2135.051,
    "text": "But they're going to formulate a critique in the end that generative models are not structural representations because they are control systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2135.191,
    "end": 2137.632,
    "text": "And control systems are not structural representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.052,
    "end": 2141.113,
    "text": "They're something else, process realizations or something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2142.631,
    "end": 2144.972,
    "text": " So here's what inactivism ends up adding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.652,
    "end": 2152.436,
    "text": "It ends up providing a pretty natural, pragmatic, and action-oriented perspective on active inference modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.236,
    "end": 2159.659,
    "text": "It brings all of these 4E, 5E cognitive perspectives in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.819,
    "end": 2162.54,
    "text": "This is really an interesting area of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.861,
    "end": 2167.403,
    "text": "Maybe there's other adjectives I can add here, but it just usually is a bunch of Es.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.576,
    "end": 2179.42,
    "text": " Inactivism is something that natural systems can carry out and it's something that we can grasp, at least at the atomic level, even simulate sometimes computationally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2180.68,
    "end": 2182.201,
    "text": "And what is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.276,
    "end": 2205.967,
    "text": " being gained by phrasing the entire system as a control system for action rather than having a so-called detachable interface like we were seeing in the previous approach, by framing it explicitly about action, you end up training on small or large data sets and evolving iterations of systems with an eye towards function rather than with an eye towards structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.867,
    "end": 2235.658,
    "text": " um and that can look like a lot of different things in different areas so a few other examples of previous work in the control systems area are like cybernetics also control systems can include elements that are game players they can include uh elements of control that have to do with swarm control as well this was an interesting paragraph from a technical point of view active inference and perceptual inference are not merely two sides of the same coin",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.86,
    "end": 2240.604,
    "text": " Instead, active inference is the name of the formulation for policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.445,
    "end": 2252.116,
    "text": "What advocates of the Bayesian brain call perceptual inference is just one moment of the policy selection process in active inference under the FEP, namely state estimation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2252.956,
    "end": 2257.061,
    "text": "So your big deal is just a parameter in our model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.436,
    "end": 2265.901,
    "text": " The issue we want to press here, repeat, is that the active inference framework implies that perception is a form of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2266.021,
    "end": 2270.904,
    "text": "That is, action and perception cannot be pulled apart as they sometimes are in the Bayesian brain framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.384,
    "end": 2275.947,
    "text": "So that's that detachable critique from the inactivist to the structuralism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.707,
    "end": 2282.828,
    "text": " They say, because you're thinking structurally, whatever that means, you have some detachability between form and function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.349,
    "end": 2289.53,
    "text": "We have a non-distinction between form and function because there's all these different inactive things happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.07,
    "end": 2295.592,
    "text": "So we're going to have a better perspective because we can already computationally model our perspective too, just like you could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2296.932,
    "end": 2305.274,
    "text": "So closer to the end of the paper, they write, in summary, the role of a generative model is subtle in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.363,
    "end": 2310.284,
    "text": " The generative model itself never actually exists outside the dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.864,
    "end": 2315.485,
    "text": "That is, outside the adaptive actions and policy selection of the organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.225,
    "end": 2324.826,
    "text": "Well, and so I'll just note there that adaptive means that there's a striving for success, but just because something is adaptive doesn't mean everyone adapts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2325.546,
    "end": 2335.768,
    "text": "Within the dynamics, it provides a point of reference or definition of variational free energy, or more precisely, a definition of the gradients with respect to internal and active states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.501,
    "end": 2351.731,
    "text": " Given that the vicarious realization of the generative model through a minimization of the variational free energy can only be through action and changes in internal state, we can think of the generative model as being enacted and of the recognition density as being embodied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.232,
    "end": 2366.281,
    "text": "So what is being said here is because there's sort of this thermodynamic forwardness that drives the active inference process as far from equilibrium systems doing what they do,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.102,
    "end": 2381.41,
    "text": " because those two things are enacted and embodied, and because it maps onto some of these previous distinctions that were raised and at least computationally resolved in the computationalist paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.43,
    "end": 2392.477,
    "text": "So we want to draw those mappings about data and about higher order perceptions of data, map that onto our understanding of the world, but not end up computationalizing the world per se.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2392.597,
    "end": 2393.417,
    "text": "That's one implication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.557,
    "end": 2394.218,
    "text": "There's probably others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.672,
    "end": 2406.602,
    "text": " And then they say, this speaks directly to embodied and inactive approaches in cognitive neuroscience and provides a computationally tractable framework for the metaphors mobilized by these paradigms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.863,
    "end": 2416.652,
    "text": "So they're saying like, we'll be able to computationally, so more tractably, do some of the stuff that people thought philosophically or ecologically would be cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.028,
    "end": 2425.172,
    "text": " Representationalists argue that generative models encode exploitable structural information about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.852,
    "end": 2427.473,
    "text": "Our analysis suggests that this is false.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.113,
    "end": 2435.238,
    "text": " Indeed, in this article, we sought to underpin the claim that generative models do not encode anything directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.698,
    "end": 2445.386,
    "text": "They are rather expressed in embodied activity and leverage information encoded in the recognition density, which is an approximate posterior belief or best guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.167,
    "end": 2448.508,
    "text": "Assuming our conclusion is correct, and why wouldn't you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.529,
    "end": 2459.916,
    "text": " Our inactive inference proposal serves to free us from a standard but flawed philosophical assumption about the nature and explanatory basis of cognition and adaptive behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.677,
    "end": 2465.08,
    "text": "So that's the closing words of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.821,
    "end": 2466.541,
    "text": "And they",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2467.822,
    "end": 2474.046,
    "text": " come out hard with the implications of action on the Bayesian computationalist worldview.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.626,
    "end": 2487.214,
    "text": "Let's look a little bit about how active inference steps into that gap between the agent world gap and then also between the Bayesian computationalist and then the more inactive and embedded approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.392,
    "end": 2490.973,
    "text": " So here's another quote from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.533,
    "end": 2504.619,
    "text": "They write, in active inference under the FEP, which again we'll return to, the generative and recognition models are best cast as realizing inference and control, the belief-guided selection of action policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.019,
    "end": 2508.561,
    "text": "So again, more like cybernetics, less like image classifiers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2509.321,
    "end": 2512.723,
    "text": "And do not have the properties ascribed by structural representationalists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.083,
    "end": 2516.885,
    "text": "Again, read them if you want to figure out exactly what you think they actually are talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.137,
    "end": 2525.741,
    "text": " We thus provide a philosophical and information-theoretic justification for an inactive view of generative models under the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.361,
    "end": 2535.967,
    "text": "So if you read the paper, you might learn some more details about why they argue that the generative model is inactivist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.907,
    "end": 2539.989,
    "text": " in active inference under the auspices of the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.77,
    "end": 2542.311,
    "text": "But here's what they end up coming to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.832,
    "end": 2544.453,
    "text": "They end up linking these two states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.533,
    "end": 2554.68,
    "text": "Now, I've actually not put any labels on either of these two nodes to emphasize that there's a wide range of relationships that the nodes can have because it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.541,
    "end": 2557.642,
    "text": " Again, a general graphical model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.442,
    "end": 2565.684,
    "text": "And also it's just going to depend on the scientist and how it's being modeled from a scientific instrumentation list point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.324,
    "end": 2574.366,
    "text": "And then if you're talking about organism, a niche or organism, an organism like improvisation, then again, it depends on the situation and how you're going to be measuring it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.486,
    "end": 2576.206,
    "text": "So we'll just leave the labels off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.666,
    "end": 2582.108,
    "text": "But the model that is like the one that goes from the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.388,
    "end": 2587.552,
    "text": " data, like the retinal data, to the higher order model of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2587.573,
    "end": 2589.114,
    "text": "It's still in orange on the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.615,
    "end": 2592.438,
    "text": "And that's the generative model or the inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.218,
    "end": 2598.364,
    "text": "And then the recognition models are actually, this one might be flipped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.464,
    "end": 2599.905,
    "text": "I'm not exactly sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.686,
    "end": 2603.408,
    "text": " But so sorry if the colors are messed up on this one slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.788,
    "end": 2614.876,
    "text": "But the key aspect is that inference is what's happening from the data to the higher order priors of the world on the top in orange.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.476,
    "end": 2623.001,
    "text": "And so that's like a signal processing perspective, which lends itself naturally to predictive processing and all these other things we'll get to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.022,
    "end": 2629.866,
    "text": " And then on the bottom you have on the recognition models side, you have control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.407,
    "end": 2644.257,
    "text": "So these models are not just being used to recognize stimuli in terms of making structural representations of the world or updating them, but rather in terms of their embodied and inactive control policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.777,
    "end": 2651.382,
    "text": "So because of this inactive insight or interface and the pragmatic term, the FEP",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.583,
    "end": 2678.537,
    "text": " frames itself especially in this multi-level embedded way as being something that integrates the two models by allowing for hopefully the mathematics to be partitioned the way that we expect and would hope that these kind of well behaved bayesian models sometimes can behave but also have all the richness of the inactivist perspective and be able to integrate these multi-scale models so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.178,
    "end": 2690.52,
    "text": " We can think of kind of a few generations of the active inference development and just think what are the commonalities here in the different waves of the development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.64,
    "end": 2695.601,
    "text": "And this is as per a recent discussion that was really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.641,
    "end": 2700.983,
    "text": "Hopefully I'm representing it roughly accurately with Maxwell and Axel and Alec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.913,
    "end": 2711.841,
    "text": " And in the early phrasings of active inference, there was a local one-step, you can think, expectation maximization algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2712.141,
    "end": 2718.406,
    "text": "So only looking one step ahead in time led to relatively local alignment of the model with the sensory data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.608,
    "end": 2737.753,
    "text": " A second iteration or increase in the nuance of active inference came with this paper on inactive inference and others, which introduced temporal depth and niche into the equations, as well as things like planning and agent embeddedness and the beginnings of valence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.953,
    "end": 2754.824,
    "text": " And then in some of the more recent work, like a 2019 and 2020, there's work related to agent learning and affect and these sophisticated or counterfactual aspects of action and cognition and counterfactuals about belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2755.845,
    "end": 2760.268,
    "text": "All the stuff that I really would love to learn more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.368,
    "end": 2765.891,
    "text": "So in the next and last slide,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.113,
    "end": 2768.874,
    "text": " part of this stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.755,
    "end": 2778.321,
    "text": "We're going to talk just first coat of paint about the connection between a few different topics and a few different philosophy of science topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.941,
    "end": 2787.086,
    "text": "So the first set of topics, the scientific topics, are the Bayesian brain, predictive coding, active inference, and the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2787.727,
    "end": 2794.591,
    "text": "And then we're going to see how these different frameworks or theories or principles or whatever they are, we'll define them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.832,
    "end": 2804.154,
    "text": " How are they all linked specifically as theories, frameworks, hypotheses, and connected by falsification or other mechanisms of comparison?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2804.895,
    "end": 2807.155,
    "text": "And then on the right side is this meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.235,
    "end": 2813.357,
    "text": "And so on the top right, this is sort of reflected to get the punchline first here, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.517,
    "end": 2824.22,
    "text": "On the bottom is a 2018 Alias Bulletin interview with Carl Fristen and our departed dearly colleague Martin Forger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.32,
    "end": 2840.875,
    "text": " And in this interview, there's sort of a philosophy of science progression that I'm going to walk through a little bit of today and lay out, hopefully to clarify the differences between some of these different theories or what level of science are they really striking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.336,
    "end": 2846.561,
    "text": "And in this meme on the top is the essentialist and the positivist perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.681,
    "end": 2848.903,
    "text": "So the essentialist being the idea that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2849.964,
    "end": 2855.289,
    "text": " Objects or things have meaning in themselves, not just as in relation with other objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.669,
    "end": 2861.975,
    "text": "And positivist being the idea that positive claims about nature are made through measurement and science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.675,
    "end": 2869.882,
    "text": "Then in the second panel is the utilitarian, so defined based upon what they perceive their value functionally to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.542,
    "end": 2882.073,
    "text": " And then falsificationist, which as we'll return to is about a theory that makes a prediction that would make it incorrect or make it untenable or increasingly untenable to hold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2882.674,
    "end": 2885.556,
    "text": "And then the third panel is the pluralist and the Bayesian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.716,
    "end": 2886.898,
    "text": "And so in this worldview,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.498,
    "end": 2903.156,
    "text": " there's understood to be a balance between novelty and conservation, and that a somewhat optimal balance for certain types of ultimately utilitarian or pluralist views, a certain value of parameters can ultimately be struck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.676,
    "end": 2909.819,
    "text": " But there's never going to be a perfect single value because there's still this question about values to bring to the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.96,
    "end": 2915.502,
    "text": "So not to take it to world modeling, but you're thinking about these issues as Bayesians, pluralists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.983,
    "end": 2917.764,
    "text": "And then in this paper, Friston just sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.604,
    "end": 2934.415,
    "text": " as another level that almost merits this following chart that I'll show that really lays out again what the FEP and the ACT-INF are and how they're related to specific testable hypotheses, because I know that's a common thing that people want to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.995,
    "end": 2939.698,
    "text": "So the green is what Martin and I had asked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2940.019,
    "end": 2940.359,
    "text": "We wrote",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.636,
    "end": 2969.739,
    "text": " in other words what is explained by the entropic reduction within the free energy principle that is not explained by any model parameters any other frameworks so this was in an attempt to understand what a lot of people are trying to understand which is what are we getting above and beyond as a value add or conceptually or utilitarian perspective whatever it is just what are we getting by modeling this quantity as you've laid it out in these certain works",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.7,
    "end": 2972.241,
    "text": " And here's what Fristin responded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.781,
    "end": 2977.702,
    "text": "I think it is useful to make a fundamental distinction at this point that we can appeal to later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.242,
    "end": 2982.143,
    "text": "The distinction is between a state and a process theory, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.284,
    "end": 2989.946,
    "text": "the difference between a normative principle that things may or may not conform to and a process theory or hypothesis about how that principle is realized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.706,
    "end": 2998.169,
    "text": " Under this distinction, the free energy principle stands out in stark distinction to things like predictive coding and the Bayesian brain hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.909,
    "end": 3002.891,
    "text": "This is because the free energy principle is what it is, a principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.551,
    "end": 3007.353,
    "text": "Like Hamilton's principle of stationary action, it cannot be falsified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.733,
    "end": 3012.475,
    "text": "So that was obviously an almost inflammatory stance for many.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.895,
    "end": 3017.377,
    "text": "They fainted when they heard Friston say that FEP cannot be falsified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.217,
    "end": 3019.177,
    "text": " It cannot be disproven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.558,
    "end": 3021.198,
    "text": "In fact, there's not much you can do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.978,
    "end": 3024.039,
    "text": "That's, you know, the other choice soundbite, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.179,
    "end": 3025.24,
    "text": "There's not much you can do with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.36,
    "end": 3027.3,
    "text": "Oh, well, then what are we doing here, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.461,
    "end": 3031.322,
    "text": "Unless you ask whether measurable systems conform to the principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.942,
    "end": 3036.004,
    "text": "On the other hand, hypotheses that the brain performs some sort of Bayesian inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.724,
    "end": 3039.285,
    "text": " or predictive coding are what they are, hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.605,
    "end": 3042.506,
    "text": "These hypotheses may or may not be supported by empirical evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.026,
    "end": 3054.21,
    "text": "So I'm going to just lay out this chart on this continuum to get at the distinction between all these different philosophy of science terms, principle, theory, framework, everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3056.286,
    "end": 3070.751,
    "text": " This is going to be a continuum on the bottom on the X axis from the left side being more theoretical or abstract, moving through the scientific endeavor to the statistical and the applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.311,
    "end": 3084.035,
    "text": "So this isn't a ranking so much as it is a continuum just from abstract to practice based and individual people can can collaborate and exist across multiple layers of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3085.015,
    "end": 3086.495,
    "text": " wanting to understand how this all works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.756,
    "end": 3101.36,
    "text": "And as sort of laid out in what I'll present as a slightly clarified and I believe a little bit interpreted unpacking of what Fristin wrote in that paragraph, I'm going to try to lay it out very clearly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3101.38,
    "end": 3105.241,
    "text": "There's some gray area, but I think this is just one way to lay it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3105.681,
    "end": 3109.442,
    "text": "So towards the most theoretical and abstract side,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.41,
    "end": 3113.913,
    "text": " we have principles, which are axioms and invariances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3114.013,
    "end": 3117.275,
    "text": "So these are some of the things that you can't falsify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3117.935,
    "end": 3123.88,
    "text": "And I thought a lot about that when I was thinking about what to say about this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.46,
    "end": 3137.609,
    "text": "And one thing that it made me think about was Gödel Escher Bach, the 1979 book by Hofstetter, which is a really exciting exploration about a lot of these topics related to axioms and logic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.61,
    "end": 3145.333,
    "text": " And also it reminded me of the law of conservation of stoichiometry in chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.353,
    "end": 3151.575,
    "text": "So not just the law of conservation of mass or mass energy, but of stoichiometry and chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3151.855,
    "end": 3156.437,
    "text": "If you'll remember from taking a course, it's about balancing the equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.957,
    "end": 3162.78,
    "text": "And so it's a rule within a certain framework of problem solving that equations have to be balanced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3163.3,
    "end": 3175.847,
    "text": " Now, there's also a slightly stronger, more general belief that there's a conservation, unless there's a nuclear reaction or an alchemical transformation, that there's a conservation of chemical elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3176.367,
    "end": 3183.27,
    "text": "That because there's such a strong conservation at the nano level, that there's also some sort of generalized conservation at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.311,
    "end": 3189.194,
    "text": "So that's a belief in a principle, and that ends up framing what you see, how you see it, how you measure it, how you compare it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.334,
    "end": 3200.718,
    "text": " It tends to be normative, which means using like a should or an ought, like, oh, well, this motor ought to waste heat relative to an 100% efficient motor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.238,
    "end": 3219.344,
    "text": "So I think we can pretty much detach from some of the emotional, psychological baggage on that and just think about the scientific normativity and then what it actually says and then our response to it, which is absolutely valid and important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.844,
    "end": 3222.628,
    "text": " is something we can work with and grow from.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.649,
    "end": 3225.872,
    "text": "The principle doesn't need to apply to all scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.952,
    "end": 3237.205,
    "text": "So like the laws that say, the patterns that say that the number of molecules in a chemical reaction are conserved, it doesn't need to say everything about social interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.225,
    "end": 3238.267,
    "text": "So they don't need to be at all scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3239.696,
    "end": 3241.557,
    "text": " Sometimes they're sort of incorrectly called laws.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.617,
    "end": 3244.838,
    "text": "I'm just not really into thinking about nature as having laws.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3244.958,
    "end": 3246.498,
    "text": "I think laws are something that people make.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.798,
    "end": 3248.399,
    "text": "And then there's patterns in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.979,
    "end": 3254.981,
    "text": "And whose last name you attach to which law is just Wikipedia URL bragging rights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.061,
    "end": 3258.202,
    "text": "What matters is the patterns that we're discovering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.622,
    "end": 3261.583,
    "text": "So again, the conservation of mass energy pattern law.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.422,
    "end": 3270.424,
    "text": " And this kind of returns us to this dual instrumentalism of principles like the free energy principle, which is that on one hand, it can be about the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.584,
    "end": 3276.627,
    "text": "You can choose to model the system as neither gaining or losing energy, or as always decreasing free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3277.427,
    "end": 3291.932,
    "text": "Or you could make a stronger claim that the principle is actually how the system is, in which case you're saying that it is the system's functional principle, that it is under natural selection, or it does follow the second law of thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3293.012,
    "end": 3296.695,
    "text": " All right, so drilling down a little bit towards the scientific and the statistical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.056,
    "end": 3306.764,
    "text": "A theory is a coherent set of ideas, claims, and logic, and it makes specific testable hypotheses that are drawn from theory that's upstream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.305,
    "end": 3319.715,
    "text": "And so that's sort of the confusing thing is from an abstractness ranking, the principle is the ground, the bedrock of the theory, the water that the theory swims in,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.436,
    "end": 3322.197,
    "text": " But it's more on the theoretical side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.377,
    "end": 3325.459,
    "text": "So theory isn't even the most theoretical thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.079,
    "end": 3328.501,
    "text": "And then people say, oh, yes, I do theory or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3328.601,
    "end": 3333.824,
    "text": "And that can mean a broad range of things from anywhere from the middle to the left side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.49,
    "end": 3339.971,
    "text": " A theory, when it's partnered with tools and approaches, is a framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.311,
    "end": 3343.772,
    "text": "Also, community of practice is important, but frameworks are important too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.812,
    "end": 3351.054,
    "text": "And the way that theories are compared is often through falsification or theory comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.194,
    "end": 3356.215,
    "text": "So falsification is just like the best model in play is the one that we go with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.655,
    "end": 3360.536,
    "text": "If there's some metaphor out there about hunting ducks or something with a shotgun, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.336,
    "end": 3367.482,
    "text": " And there's other mechanisms of theory, comparison, theory, anarchy, all these wild thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3368.043,
    "end": 3376.511,
    "text": "But the falsificationist worldview that like we go with what works and then we end up having a paradigm shift.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3377.031,
    "end": 3385.861,
    "text": " moving into a new set of dorms around a scientific topic like landslide, either in a little micro sense or in a larger macro sense, all this kind of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.342,
    "end": 3387.043,
    "text": "There's a lot of depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.263,
    "end": 3392.309,
    "text": "I am just going to briefly just say people have thought about these kinds of theory comparators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.49,
    "end": 3394.331,
    "text": "Now in the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3395.413,
    "end": 3397.455,
    "text": " Alias interview response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.416,
    "end": 3400.498,
    "text": "Friston mentioned two kinds of theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.859,
    "end": 3406.584,
    "text": "He mentioned state theory, which he used to mean something pretty similar to a normative principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3407.485,
    "end": 3409.888,
    "text": "And those were about system states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.928,
    "end": 3413.231,
    "text": "And then he combined the normativity with it being about the system state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3413.271,
    "end": 3415.753,
    "text": "So it said that there was a normative principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3416.534,
    "end": 3428.46,
    "text": " stance that the system will conform to a certain way of being and it's about the states and that was contrasted with the process theory which is about how systems change which is why it's called a process theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.755,
    "end": 3432.276,
    "text": " All right, now to get to a specific hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3432.936,
    "end": 3441.419,
    "text": "A hypothesis is a specific prediction about the system that's under the auspices of a specific theory, whether it's a state theory or a process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.179,
    "end": 3445.641,
    "text": "And a hypothesis is tested with statistical approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.401,
    "end": 3448.862,
    "text": "It can also be explored with visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3449.941,
    "end": 3456.446,
    "text": " So the hypothesis is tested from a falsificationist paradigm at the quantitative level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.706,
    "end": 3462.471,
    "text": "So at the confidence level of 0.01 or 0.001 or according to this metric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.091,
    "end": 3471.778,
    "text": "Those are quantitative sort of in the trenches falsificationism of null hypothesis, which is that there's no influence of a certain treatment, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.798,
    "end": 3482.723,
    "text": " Whereas the theory falsificationism that's like one layer higher up is a little bit more like logical battles being fought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.803,
    "end": 3487.286,
    "text": "No single t-test brings down a theory but can take down a hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.166,
    "end": 3491.489,
    "text": " And so let's break this down for the free energy principle specifically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.689,
    "end": 3495.912,
    "text": "So as Fristin had mentioned, the free energy principle is this principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.452,
    "end": 3501.376,
    "text": "And I think in future times, it would be cool to talk about what makes it a principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.676,
    "end": 3502.777,
    "text": "What are the assumptions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.837,
    "end": 3503.878,
    "text": "What are the implications?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.938,
    "end": 3505.099,
    "text": "What are related assumptions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.88,
    "end": 3510.963,
    "text": "And for now, we'll just say that downstream of the free energy principle is active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.023,
    "end": 3514.464,
    "text": " Active inference is a process theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.684,
    "end": 3518.745,
    "text": "It's a coherent set of ideas, claims, and logic about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.526,
    "end": 3527.108,
    "text": "It is going to be making specifically testable hypotheses, specifically about the structure of action and about how agents interact with their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.958,
    "end": 3552.769,
    "text": " examples of theories that have overlap with active inference for example licensing the use of the people who are structural representationalists using the bayesian brain metaphor to think about the bayesian brain as a theory we can think about the hypotheses that are specifically made by that theory so for example the claims might be something like at the first level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.149,
    "end": 3555.132,
    "text": " that the brain can be modeled with Bayesian stats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.252,
    "end": 3561.06,
    "text": "And then at the second level, like that the brain implements Bayesian statistical algorithms in what it does in nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.421,
    "end": 3562.883,
    "text": "So that's that dual instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.58,
    "end": 3575.787,
    "text": " And then another area of theories that has overlapped with active inference, as well as the Bayesian brain, just didn't want to clutter it, was predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3576.588,
    "end": 3587.035,
    "text": "And two hypotheses in predictive coding are, one would be sense data can be analyzed relative to now casted predictions, now casting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.996,
    "end": 3592.781,
    "text": " And the second level would be something like organismal sensory relays are predictive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.841,
    "end": 3607.514,
    "text": "So again, it's the dual instrumentalism where there's one level about how the scientist analyzes the world, which is that, yes, we can use this framework to understand data, even data about organisms or data about simulations or other systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3608.215,
    "end": 3611.038,
    "text": "And then at the second level, it's actually the claim about the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.678,
    "end": 3619.744,
    "text": " And so in both of these cases, there are hypotheses because they are under an axiomatic framework reflected by the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.764,
    "end": 3640.38,
    "text": "That's why it keeps on saying inactive inference under the free energy principle and the active inference framework also draws on not just the Bayesian brain predictive coding, but just to label one more up there is there's this inactive area that we talked a lot about today and all the cool insights that the inactive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.301,
    "end": 3643.042,
    "text": " side has to bring to the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3643.862,
    "end": 3650.444,
    "text": "So maybe another time we could think about what the principles underlying in activism are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3651.284,
    "end": 3652.204,
    "text": "Are there fundamentals?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3652.665,
    "end": 3654.565,
    "text": "It's an area I'd love to learn more about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.125,
    "end": 3658.526,
    "text": "Are there frameworks for inactive inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.686,
    "end": 3666.389,
    "text": "I know that we've had some participants on the Act-Imp stream who had a lot more experience and practice with these kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.489,
    "end": 3666.669,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.11,
    "end": 3687.789,
    "text": " We want to see how we can make Active Inference this hub for realizing the ideas and the people and the projects coming together to kind of make it real to show how these ideas are all connected and see where we can kind of take these ideas just conceptually and from an impact perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.17,
    "end": 3690.272,
    "text": "So that's the end of 6.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.506,
    "end": 3693.746,
    "text": " Thanks for participating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.346,
    "end": 3696.607,
    "text": "We provide follow-up forums to live participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3696.767,
    "end": 3697.847,
    "text": "It'll be pretty easy this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.928,
    "end": 3705.729,
    "text": "Any feedback, suggestions, or questions would be totally welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.77,
    "end": 3708.97,
    "text": "Stay in communication with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.77,
    "end": 3714.212,
    "text": "And yeah, the next live stream will be 6.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.652,
    "end": 3720.076,
    "text": " That is going to be on October 13th on the Tuesday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3720.697,
    "end": 3725.141,
    "text": "Then we are going to have 6.2 on the 20th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.241,
    "end": 3727.343,
    "text": "That's going to be a follow-up discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3727.603,
    "end": 3730.226,
    "text": "So if you're interested in 7 a.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3730.626,
    "end": 3734.55,
    "text": "Pacific time for 60 to 90 minutes on October 13th or October 20th,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.977,
    "end": 3740.179,
    "text": " Those are gonna be discussing this paper, A Tale of Two Densities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.02,
    "end": 3749.466,
    "text": "Then on October 27th and November 3rd, both Tuesdays, same time, we're gonna be discussing another paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.606,
    "end": 3752.368,
    "text": "You can check it out on our Twitter if you wanna learn more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3753.208,
    "end": 3757.31,
    "text": " And if you're watching this after those dates, thanks for watching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3757.65,
    "end": 3760.271,
    "text": "Please feel free to still leave a comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.531,
    "end": 3763.572,
    "text": "And yeah, thanks a lot for watching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3763.632,
    "end": 3766.493,
    "text": "Just let us know if you have any thoughts or questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.993,
    "end": 3770.955,
    "text": "But have a good weekend or whenever it is you're listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.455,
    "end": 3771.595,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]