[
  {
    "start": 8.418,
    "end": 10.682,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.0,
    "end": 41.007,
    "text": " it's may 5th 2025 and we're in active inference guest stream 106.1 with bang lu and colleagues discussing an epic work advances and challenges in foundation agents from brain inspired intelligence to evolutionary collaborative and safe systems so thank you to many of the authors for joining and i will pass to you all to present and looking forward to hearing about this go for it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.987,
    "end": 58.607,
    "text": " okay yeah thanks daniel for this invitation uh hello everyone my name is bang liu i'm an assistant professor at the university of montreal and a member of audio and institute kotwa of the university as well as a member of mila quinn institute",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 58.942,
    "end": 64.834,
    "text": " So today I'm going to briefly like first introduce the concept of Foundation Agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.854,
    "end": 68.581,
    "text": "So this is a collective work together with many of our co-authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.002,
    "end": 73.771,
    "text": "So here today we have Shao Kun, Hongzhang and Xiaoxiang joined as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.252,
    "end": 79.583,
    "text": "So I will start from this brief introduction about the whole concept and why we do this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.563,
    "end": 89.595,
    "text": " And then our other co-authors will briefly talk about the paths they are more familiar with so that we can go through many paths of the largest way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.176,
    "end": 94.801,
    "text": "But of course, we cannot go through every detail of that long paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.861,
    "end": 100.428,
    "text": "So if you're interested, feel free to check the original paper and contact us if you have any questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.029,
    "end": 106.735,
    "text": "Yeah, so I will start from the introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.183,
    "end": 116.793,
    "text": " So as we know, our human beings have long been interested in developing some intelligent things as smart or maybe even smarter than ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.514,
    "end": 121.259,
    "text": "So for example, on the left figure, it is the Talos of Crete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.659,
    "end": 129.569,
    "text": "Well, it shows a bronze automation from Greek mythology built by the Hephaestus to protect Crete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.07,
    "end": 134.595,
    "text": "So basically, people want to build huge robots to defend their home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.575,
    "end": 143.944,
    "text": " And in the middle, this image shows Leonardo da Vinci's humanoid robot, which is an early mechanical automation designed to mimic human motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.805,
    "end": 157.016,
    "text": "And on the right part, a figure shows Alan Turing's paper, Computing Machinery and Intelligence, which proposes the fundamental question, which is about, can machines think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 158.057,
    "end": 164.143,
    "text": "So we can see that AI has long been driven by humanity's ambition to create entities that mirrors our intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.908,
    "end": 169.571,
    "text": " So maybe let's start from the very simple question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 169.752,
    "end": 171.354,
    "text": "What is exactly an AI agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.355,
    "end": 177.882,
    "text": "If you check a textbook, like the AI textbook, so maybe you will see some definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.583,
    "end": 186.773,
    "text": "Briefly speaking, you will see that agents is something intelligent beings continually perceive, decide, and act autonomously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.335,
    "end": 201.852,
    "text": " And like in this figure, I think this figure is from the blog of Dr. Wang Lilian, which shows what kind of components are composed to form an LLM agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.593,
    "end": 207.74,
    "text": "So traditionally, the agents are mostly rule-based, domain-specific, so it's hard to generalize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.22,
    "end": 210.904,
    "text": "But with the development of electronic models,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.884,
    "end": 221.405,
    "text": " So we have developed natural language model powered agents, which has the natural language fluency, the broad reasoning capability, and dynamic adaptivity to different tasks, environments, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.046,
    "end": 226.294,
    "text": "So on the right figure, you see that our agents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.274,
    "end": 234.165,
    "text": " composed of one LLM and together with several other components like a memory module, planning, tools, actions and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.625,
    "end": 238.35,
    "text": "Of course, this is a very basic setting of LLM agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.991,
    "end": 247.523,
    "text": "And like in real world, there are many different agent architectures which may include much more rich components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.945,
    "end": 254.13,
    "text": " So you may think like, why we conduct such a large scale survey?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.431,
    "end": 257.136,
    "text": "So we're actually motivated by several questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.336,
    "end": 260.882,
    "text": "The first is like, we want to know, where are we in AI research today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.523,
    "end": 275.367,
    "text": "So we have powerful language models, impressive reasoning capabilities, but we still have limitations in AI safety, the controllability of AI models, the reliability of the answers and the transparency needs in different like high-stake fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.347,
    "end": 282.285,
    "text": " For example, can we safely utilize and trust AI in health domain, in legal domain and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.687,
    "end": 283.849,
    "text": " And what can be improved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.889,
    "end": 284.97,
    "text": "This is our second question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.01,
    "end": 296.046,
    "text": "So by making a comparison with biological intelligence, with a thorough check of the current progress, we want to know what to do next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.907,
    "end": 300.813,
    "text": "So in this work, we want to develop a unified framework for AI agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.334,
    "end": 307.142,
    "text": "And based on this framework, we can systematically check the progress and the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.578,
    "end": 314.066,
    "text": " So we emphasize the modularity, the safety of AI, the lifelong learning capabilities, emotion grounding, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 318.452,
    "end": 321.096,
    "text": "And why we want to connect AI with human and society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 321.516,
    "end": 329.046,
    "text": "So we can think that like we, our human beings are the kind of intelligent things we only know about, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.127,
    "end": 346.73,
    "text": " So we want to draw insights from human brain functions and social behavior, and identify the gaps by comparing human cognition and AI agents, and develop human-centered, socially beneficial AI, and foster human-AI collaboration, transparency, and transparency needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.75,
    "end": 354.46,
    "text": "So maybe you may ask that, do we need to actually always mimic human brain to create intelligence,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.44,
    "end": 360.391,
    "text": " As you can see, nowadays, we draw very weak inspiration from neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.832,
    "end": 370.53,
    "text": "We have the artificial neurons, but all the others are mostly based on the modern machine learning development, which is less grounded to most advanced neuroscience developments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.552,
    "end": 377.022,
    "text": "But there are benefits to compare human brain and LMI, because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.575,
    "end": 385.004,
    "text": " If we want to develop some trustworthy AI, it's better to make it more close to what we actually know about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.588,
    "end": 399.803,
    "text": "Although I need to emphasize that it's not necessary to mimic or clone every capability or feature of human brain, but it's beneficial to have a comparison with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.613,
    "end": 409.641,
    "text": " So this is a very brief table that compares human brain and IOM agents from some perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 410.021,
    "end": 411.864,
    "text": "Of course, this is not a thorough list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.445,
    "end": 414.848,
    "text": "You can check more detailed comparison in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.649,
    "end": 421.096,
    "text": "But like, for example, from the hardware level, human brains are composed of biological neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.557,
    "end": 422.898,
    "text": "It's highly energy efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 423.299,
    "end": 428.346,
    "text": "But we know that IOMs are pre-trained with large-scale GPUs, large-scale datasets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.826,
    "end": 430.228,
    "text": "So it's energy intensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 431.103,
    "end": 437.923,
    "text": " So this is the fundamental difference between the hardware level of human biological intelligence or current AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.258,
    "end": 444.985,
    "text": " And consciousness, so until now, I think maybe it's safe to say that AI is not conscious until now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.405,
    "end": 451.491,
    "text": "But for human beings, it's genuine subjective experience, so we can feel that we are conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.272,
    "end": 462.983,
    "text": "And for learning style, human beings are naturally able to perform lifelong continuous learning, and we can quickly adapt to different tasks with few-shot or one-shot learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.25,
    "end": 469.322,
    "text": " And for LLM agents or other neural networks or machine learning models, it's more challenging to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.284,
    "end": 480.465,
    "text": "And common breadth is more emotional, experiential, subconscious driven, and LLM agents and other machine learning methods is more about statistical data driven recombinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 485.187,
    "end": 496.525,
    "text": " So one investigation we have conducted is we want to know, for different capabilities of human brains, how it is developed in the current AI technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 496.905,
    "end": 503.736,
    "text": "So we can grossly classify different types of capabilities into three levels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 503.716,
    "end": 510.043,
    "text": " Whereas green color L1 denotes some features which are well developed in the current AI technique.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.243,
    "end": 515.309,
    "text": "For example, we can consider that language comprehension is quite advanced nowadays.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.409,
    "end": 521.075,
    "text": "So if you ask language model different things, it can understand your input text very well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.676,
    "end": 528.323,
    "text": "And also for advanced computer vision models, it can also have very strong visual perception capabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 529.552,
    "end": 533.198,
    "text": " And L2 is more moderately explored with partial progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.738,
    "end": 552.748,
    "text": "So for example, like maybe you think the logical reasoning capability of LMs is quite strong, but there also research paper shows that if you like carefully adjust the format of your input questions, make it different from the training data, like the performance can drop quickly, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.249,
    "end": 556.133,
    "text": "So we can see that the reasoning capability can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 556.113,
    "end": 559.322,
    "text": " There's still a lot of space to improve yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.342,
    "end": 568.468,
    "text": "So we can see for many such capabilities like reasoning, planning, working memories, attention and so on, there's still a lot of space to improve and explore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.461,
    "end": 572.869,
    "text": " And there are also some capabilities which are rarely explored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.07,
    "end": 576.017,
    "text": "Those pink colors, so we call it L3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.378,
    "end": 578.403,
    "text": "So it's rarely explored capabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.423,
    "end": 580.027,
    "text": "There's significant room for research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.648,
    "end": 587.605,
    "text": "So for example, the emotional processing, the self-awareness, empathy, and automatic regulation and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.378,
    "end": 599.554,
    "text": " Of course, like in this figure, maybe some of the capabilities kind of between L1 and L2 or L2 and L3 is kind of subjective, but that's not important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.574,
    "end": 608.547,
    "text": "What we want to show is that what is like to show a research map of the current AI development and to see what to go next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.117,
    "end": 619.628,
    "text": " So one challenge for existing agent research is that we lack a unified framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.209,
    "end": 630.787,
    "text": "So the current AI agents often build in ad hoc, fragmented ways, which means people construct different agent frameworks by incorporating different path components.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.368,
    "end": 638.28,
    "text": "And there's no unified framework which can be suitable and adapted to different application scenarios.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 638.26,
    "end": 644.408,
    "text": " So we lack seamless integration of perception, memory, reasoning, action, and many other modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.429,
    "end": 649.114,
    "text": "But human brains integrate yet modular approach to find inspiration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 652.859,
    "end": 657.946,
    "text": "So in our survey paper, we actually proposed a framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.266,
    "end": 663.713,
    "text": "So this is some notations about the framework, but we don't need to remember that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.054,
    "end": 665.736,
    "text": "Let's directly check this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.627,
    "end": 678.861,
    "text": " If you check this figure, we can see that the left part is the world, where you have different environments, you have users, you have external data, and many other things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.881,
    "end": 693.377,
    "text": "So basically, you can see the environment, the environment state, space S, with state transition function T. And we have an intelligent agent on the right part with the pink-colored circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.1,
    "end": 700.408,
    "text": " And it has sensors to percept the environment, and it has actors to execute actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.73,
    "end": 708.018,
    "text": "So from the high level, it's similar to the traditional RL agent framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 708.398,
    "end": 714.306,
    "text": "But here we emphasize more about the internal states and the learning and reasoning capability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 714.446,
    "end": 723.297,
    "text": "So we want to clearly model what is the perception, cognition, and action components in an agent loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 723.665,
    "end": 726.67,
    "text": " So here we show some mental states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.131,
    "end": 734.142,
    "text": "Well, we have the world model mental state, we have the memory, we have goal, the emotion, reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.823,
    "end": 742.416,
    "text": "So basically we think those are like five key mental substates in the mental state of the cognition module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.442,
    "end": 760.345,
    "text": " And based on this mental state, the core capability of cognition is actually the learning and reasoning capability, where we define learning as the capability of updating the mental states based on the input data and past experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.126,
    "end": 769.618,
    "text": "And the reasoning is about, based on the current mental state, deciding what kind of actions to take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.1,
    "end": 782.21,
    "text": " We can check this agent loop explanation, which is a more formal way to describe the agent loop, which is equivalent to what we are conveying in this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 783.792,
    "end": 791.219,
    "text": "So let's say we have environment state as a time step t, which is as t. And we have a perception module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.339,
    "end": 795.442,
    "text": "So this perception function p is defined by the actors, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.502,
    "end": 799.386,
    "text": "We have different sensors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.366,
    "end": 806.313,
    "text": " So this forms observation O based on the state and prior mental state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.633,
    "end": 821.629,
    "text": "So here we define the observation at time step O equals to the perception function's output P given the current environmental state S and the last mental state M .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.771,
    "end": 828.816,
    "text": "And based on the observation, we have the cognition part C",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.083,
    "end": 841.498,
    "text": " Well, the key functionality of the cognition module is first update the mental state at time step t, which is m , and decides the next action, a .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.559,
    "end": 848.586,
    "text": "And we further decompose this cognition process into two key paths, learning and reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.087,
    "end": 853.352,
    "text": "What learning is about, so you have the mental state,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.332,
    "end": 863.201,
    "text": " based on the last mental state and last action and the current observation , we are updating the mental state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.642,
    "end": 874.632,
    "text": "So basically, you can consider that learning is about updating your internal structure, your internal modeling of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.193,
    "end": 877.415,
    "text": "So basically, it's kind of a long-term effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.935,
    "end": 883.12,
    "text": "That's why learning is about maintaining and updating your mental state .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.1,
    "end": 891.13,
    "text": " And we decompose M of T into several sub-components, like the memories, world model, emotion, reward and goal, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.752,
    "end": 898.699,
    "text": "And for reasoning, it's more about, based on the current context, we decide what we need to do in the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.2,
    "end": 907.69,
    "text": "So that's why reasoning is about, given the mental state of current time step M , we decide what is the action to take A .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.935,
    "end": 915.382,
    "text": " Action execution aims to convert the chosen action into executable forms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.862,
    "end": 920.827,
    "text": "You can consider the reasoning output is a thought about what action to take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.288,
    "end": 928.255,
    "text": "But to actually execute it, you need to have strong actors which can execute the action accurately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.455,
    "end": 933.981,
    "text": "For example, consider you want to control a robot in a 3D environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.961,
    "end": 940.912,
    "text": " If your actor is not good enough, maybe it cannot continuously accurately control the actors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 942.614,
    "end": 952.189,
    "text": "And finally, based on the executed action, the environment state will transit to the next state, which is st plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.62,
    "end": 957.945,
    "text": " So you can see that the key designs here are two parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.045,
    "end": 965.174,
    "text": "The first is about the definition of the mental state, where we have further divided it into several supplemental states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.614,
    "end": 976.147,
    "text": "The second is about how we accurately define the perception, cognition, and action, including action execution, as well as environment transition and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.167,
    "end": 978.109,
    "text": "So we make each part more concrete.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.734,
    "end": 984.977,
    "text": " And we further define what we call the foundation agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.518,
    "end": 988.801,
    "text": "So in this box, this is the definition we give in the survey paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 989.222,
    "end": 994.026,
    "text": "And after that, we further consider, okay, can we give it a more like concise definition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.647,
    "end": 1009.682,
    "text": "So basically we can say that foundation agent is a fundamental intelligent unit with universal understanding, cognition, and acting capabilities that can operate in any environments and collaborate to form collective intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.59,
    "end": 1013.815,
    "text": " Note that here we actually emphasize on two parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.376,
    "end": 1018.964,
    "text": "The first is about the universal capability in different environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.984,
    "end": 1029.983,
    "text": "That's why we call it fundamental, the foundation, because we want that the agent can be easily adapted to different tasks, different environments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.452,
    "end": 1033.78,
    "text": " The second part is about the collaborative capability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1034.0,
    "end": 1042.159,
    "text": "We consider a foundation agent can easily collaborate with many other agents to form a multi-agent system or even an agent society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.881,
    "end": 1047.111,
    "text": "The reason is that when a multi-agent system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.091,
    "end": 1052.539,
    "text": " can have advantages in terms of the performance, efficiency, and many others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.859,
    "end": 1058.928,
    "text": "So even if you think, can we create an agent as powerful as a god?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.948,
    "end": 1060.43,
    "text": "Maybe this is not the ideal solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.45,
    "end": 1065.917,
    "text": "And also, if you consider the performance, the energy consumption, the working efficiency, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1066.498,
    "end": 1073.588,
    "text": "So we think a multi-agent paradigm can be a better solution compared to a single agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1074.833,
    "end": 1078.879,
    "text": " That's why we emphasize on the capability of the foundation agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.246,
    "end": 1087.734,
    "text": "So we emphasize on several core capabilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.754,
    "end": 1098.09,
    "text": "Well, the multimodal perception is about the perception capability, the cognitive adaptation, and the goal-driven reasoning, the purposeful action, and the multi-agent collaborations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1103.217,
    "end": 1107.883,
    "text": " We also like to check and compare to existing other classical theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.043,
    "end": 1111.067,
    "text": "For example, the classical perception, cognition, action cycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.388,
    "end": 1114.592,
    "text": "These are a part of our agent loop as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.193,
    "end": 1117.756,
    "text": "The MISC is a society of mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.517,
    "end": 1122.863,
    "text": "We have modular cognition subsystems like the memory, emotion, reasoning, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.843,
    "end": 1134.978,
    "text": " And there's also the theory from Buzsaki's inside-outside perspective, which emphasizes that we are not passively accepting observations from the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.219,
    "end": 1142.328,
    "text": "Actually, we are seeking actions actively, which emphasizes the action-first perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.808,
    "end": 1146.673,
    "text": "So here we have internal mental states actively shaping the perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.653,
    "end": 1156.421,
    "text": " And for POMDP framework, it will emphasize the internal mental states and the active learning and reasoning process compared to the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.441,
    "end": 1161.456,
    "text": "And for Bayesian active inference, here we minimize the prediction area while updating both models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.583,
    "end": 1173.493,
    "text": " So until now, I have introduced the definition of the foundation agents and the agent loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.174,
    "end": 1180.342,
    "text": "Next, I will quickly go through some highlights of the agent modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.362,
    "end": 1188.253,
    "text": "For example, first is the cognitive core, which is the central executive that orchestrates the reasoning, planning, reflection, and many others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.841,
    "end": 1194.53,
    "text": " So here, if you remember that we define cognition as, like, have two capabilities, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.55,
    "end": 1195.572,
    "text": "The learning and the reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.153,
    "end": 1202.763,
    "text": "And for reasoning, in our survey, we investigated different reasoning programs, including structured reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.124,
    "end": 1210.275,
    "text": "Well, actually, the reasoning process is following some structure, for example, the multi-chain or tree structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.373,
    "end": 1212.235,
    "text": " or a graph structure, and many others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.215,
    "end": 1215.197,
    "text": "And there are also abstract reasoning processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.217,
    "end": 1217.679,
    "text": "For example, it's more about sequential decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1218.1,
    "end": 1222.564,
    "text": "It's like, you know, chain style, or maybe you can also reason in the latent space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.844,
    "end": 1226.887,
    "text": "So basically, you can transit between the latent space and the token space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.968,
    "end": 1238.878,
    "text": "And planning, you can consider planning as a special action, where you take the input and you, like, decide a more long-term plan for different actions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.685,
    "end": 1242.638,
    "text": " So that is like, first is planning is a special action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.9,
    "end": 1248.244,
    "text": "And secondly, that is more about a longer, larger scale of the future actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.869,
    "end": 1256.317,
    "text": " And for memories, like the multi-level memory inspired by biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.417,
    "end": 1261.345,
    "text": "So we talked about the short-term memory, the working memory, long-term memory, many other types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1262.087,
    "end": 1269.239,
    "text": "And so memory can enable continuous learning and while avoid catastrophic forgetting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.0,
    "end": 1277.353,
    "text": "So the design challenge here is that how we can perform fast query over vast memories with minimal latency and cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.924,
    "end": 1282.97,
    "text": " So one highlight in our survey is we formally define the life cycle of memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.271,
    "end": 1295.747,
    "text": "So just start from the memory acquisition, where we draw information from the row observations, and then we turn it into encoded information, and we also drive new memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.787,
    "end": 1305.94,
    "text": "For example, let's say if you have a dialog, you can drive some summaries from the dialog, or maybe you can also infer some new information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1305.92,
    "end": 1313.133,
    "text": " which is not explicitly stated in the dialog history, but it can be inferred with logical inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.817,
    "end": 1319.946,
    "text": "And then, after the derivation, we have the retrieval and utilization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.398,
    "end": 1330.707,
    "text": " And board model is an internal representation of the environment's dynamics and the agent's own causal influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.867,
    "end": 1338.117,
    "text": "So basically, you can consider what model helps you to predict the future without actually taking actions in the reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.378,
    "end": 1349.393,
    "text": "For example, just like how you do sports, when you choose your actions, you can predict the result, whether you can hit the ball, whether the ball will fly to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.373,
    "end": 1350.816,
    "text": " other objects and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.257,
    "end": 1355.004,
    "text": "So because you have the model about the world and about the cost effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.545,
    "end": 1362.96,
    "text": "So in this case, you can decide your appropriate action to take without high cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.818,
    "end": 1370.55,
    "text": " And here we define the core functions in our world model as the transition function and observation function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.931,
    "end": 1372.313,
    "text": "What is the transition function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1372.774,
    "end": 1376.36,
    "text": "You have the current world state and you have a new action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.721,
    "end": 1380.688,
    "text": "Based on the action and the state, you will transit to the next state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.389,
    "end": 1387.159,
    "text": "And for the observation function, based on the current state, what kind of observation you will have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.696,
    "end": 1406.785,
    "text": " So by considering how different models or algorithms define the transition function and observation function, we categorize different research works about world models into four categories, including the explicit, implicit one, explicit paradigm, simulator-based, and hybrid or instruction-driven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.384,
    "end": 1418.471,
    "text": " And for reward and value system, basically reward is goal signals that shape learning and behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.811,
    "end": 1421.915,
    "text": "We also discussed different types of reward in our paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.975,
    "end": 1437.413,
    "text": "For example, we have extrinsic reward, which is defined by some external reward evaluator and intrinsic reward, which is, for example, the agent may perform some self-reflection to decide whether the result is good or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.477,
    "end": 1446.964,
    "text": " And of course, there are also hybrid rewards, which combines both external ones and internal ones, and there are hierarchical rewards, which models more complex contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.479,
    "end": 1459.647,
    "text": " And I think emotion is actually an interesting topic, which is less explored in the existing AI research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1460.208,
    "end": 1462.73,
    "text": "So emotions act as fast heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.051,
    "end": 1468.417,
    "text": "So you can see that actually emotion has a very close relationship with rewards, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1468.977,
    "end": 1480.41,
    "text": "So fear helps you to avoid some danger, and curiosity will increase your chance to do exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1480.39,
    "end": 1486.057,
    "text": " Emotions can impact your decision about what actions to take in the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.699,
    "end": 1497.672,
    "text": "It supplies sustained internal drift and also adds robustness and adaptability, but demands tight control to avoid undesirable side effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1497.732,
    "end": 1502.398,
    "text": "This is one figure we put in the survey paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1502.378,
    "end": 1507.026,
    "text": " Here we show some classical emotion models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1507.046,
    "end": 1516.241,
    "text": "There are some categorical emotion models where you can divide emotion into different types, or there are some dimension-based models, or hybrid models, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.322,
    "end": 1525.095,
    "text": "Of course, these are not the full spectrum of emotion models, but they represented several typical categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.4,
    "end": 1539.67,
    "text": " And for perception, the key is about how we can deal with multimodal signals and how we can appropriately encode the signal, fuse them, align them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1540.451,
    "end": 1555.285,
    "text": "So if you check the current human perception capabilities and agent perception capabilities, they have their own unique perception systems, and they also have a large part which is overlapped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1558.994,
    "end": 1561.017,
    "text": " Lastly, for the action system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.437,
    "end": 1566.725,
    "text": "The action system is about how we converse cognitive decisions into executable commands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.706,
    "end": 1570.37,
    "text": "Actions can be taken in different formats.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1570.61,
    "end": 1581.846,
    "text": "For example, it can be as simple as just a natural language response, or it can be some code to be executed, or robot control in the real world, or virtual navigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.826,
    "end": 1585.334,
    "text": " So we need to balance the feasibility, efficiency, and safety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.317,
    "end": 1590.967,
    "text": "And also we need to learn fine-grained skills and operates in continuous action space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.589,
    "end": 1600.189,
    "text": "And in this figure, the purpose is to clearly differentiate different concepts that may be ambiguous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.072,
    "end": 1605.676,
    "text": " For example, you have a cognition system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.116,
    "end": 1613.687,
    "text": "The cognition system will produce your action source, which is the directive source arising from the cognitive reasoning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.388,
    "end": 1624.742,
    "text": "And to actually execute this action source, you need to have an action system where it can take the source from the cognition into executable actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.38,
    "end": 1628.063,
    "text": " And the action system can call different tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.444,
    "end": 1633.29,
    "text": "Well, we define tool as callable utility for specialized execution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1634.411,
    "end": 1637.155,
    "text": "An API is a format of the tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1637.595,
    "end": 1642.081,
    "text": "So you can also have other tools which is not in the format of APIs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1642.101,
    "end": 1646.446,
    "text": "So we define API as interface for programmatically invoking service.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.027,
    "end": 1650.311,
    "text": "And functions is the most atomic unit of implementations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.792,
    "end": 1653.615,
    "text": "So an API may include one or more functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.27,
    "end": 1662.194,
    "text": " So I cannot cover all the paths of this loss away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1662.255,
    "end": 1665.999,
    "text": "So if you're interested, like, feel free to check us away in this link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.301,
    "end": 1673.207,
    "text": "And second, I will stop sharing here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.227,
    "end": 1673.647,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.414,
    "end": 1682.978,
    "text": "Will another author like to present or share anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1686.417,
    "end": 1693.206,
    "text": " Yeah, I think next we can, like, who want to start first, following the order of the survey paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.427,
    "end": 1708.345,
    "text": "I think next I can introduce our memory chapter for the survey paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1709.787,
    "end": 1710.147,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.623,
    "end": 1723.067,
    "text": " Can you see my screen?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1723.087,
    "end": 1724.268,
    "text": "Yep, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1725.71,
    "end": 1727.773,
    "text": "Okay, let's move on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.135,
    "end": 1730.257,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1730.277,
    "end": 1730.978,
    "text": "I'm Xiaoqiang Wang.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1731.058,
    "end": 1738.569,
    "text": "I'm currently a PhD student at the University of Montreal and Miller University Institute, working with Professor Wang Liu.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1739.53,
    "end": 1747.542,
    "text": "My research lies on the intersection of Lagrangian models and autonomous agents, especially how can we give agents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1747.758,
    "end": 1749.781,
    "text": " human-like memory and reasoning capabilities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.861,
    "end": 1756.91,
    "text": "Today, I will briefly introduce our chapter on memory in this paper, which I co-authored.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1756.95,
    "end": 1761.556,
    "text": "Generally speaking, memory is a fundamental component of intelligent agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1762.036,
    "end": 1772.77,
    "text": "It enables the agent to call past experiences using their stored knowledge over time and reasoning effectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1774.049,
    "end": 1777.895,
    "text": " I will go through three parts following the structure of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1778.095,
    "end": 1790.092,
    "text": "The first part is a quick overview of human memory and later introduce how this concept inspired the interpretations of agent memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.413,
    "end": 1801.589,
    "text": "Then I will introduce how agent memory goes through a life cycle from spread to use.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1801.609,
    "end": 1803.752,
    "text": "So the first part is the overview of human memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1810.651,
    "end": 1820.461,
    "text": " In the cognitive psychology, there is a framework that breaks down human memory into three core types.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1821.462,
    "end": 1826.567,
    "text": "It includes sensor memory, subtle memory, and long-term memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1826.607,
    "end": 1837.738,
    "text": "For sensor memory, it captures immediate, afflating impressions from the environment, like visual and audio inputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.866,
    "end": 1841.57,
    "text": " and holds them for milliseconds to seconds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1842.171,
    "end": 1853.309,
    "text": "And in a more longer duration, short-term memory or working memory holds information we are actively using, like a phone number you have just heard, or medical months.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1853.329,
    "end": 1859.659,
    "text": "It's limited in capability and duration, but essential for reasoning and decision-making.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1861.201,
    "end": 1866.73,
    "text": "And in a longer duration, long-term memory stores knowledge and abilities across a long time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.98,
    "end": 1870.686,
    "text": " such as lifelong time, such as personal memories or learned facts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1870.966,
    "end": 1873.189,
    "text": "It is more durable and expensive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1874.01,
    "end": 1877.956,
    "text": "For each type of the three kinds of memory serves a distinct role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1878.237,
    "end": 1889.173,
    "text": "For intelligent autonomous agents, we mimic these functions and enable much richer and more adaptive behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1891.972,
    "end": 1904.47,
    "text": " In the long-term agents, we draw direct inspiration from this human memory and design the agent memory also follows three kinds of memory such as sensor memory, short-term memory, and long-term memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1905.211,
    "end": 1919.31,
    "text": "The sensor memory focus on the raw observations and input logs and then for such incoming data like user queries, the tool outputs, and the web search paths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1919.33,
    "end": 1921.894,
    "text": "These are often stored temporarily",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1922.515,
    "end": 1926.759,
    "text": " as text-based or multi-modal format.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1927.58,
    "end": 1940.852,
    "text": "This provides the raw material for further processing, just like how humans take in size and sound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1940.872,
    "end": 1952.202,
    "text": "For the shorter memory pack, also known as working memory or content memory, this is to enable the continuity of the task and to enable cross-task stabilization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1952.468,
    "end": 1957.154,
    "text": " includes the information that agents need right now to complete the task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1957.174,
    "end": 1967.609,
    "text": "In practice, this is often handled through a prompt, where the agent pulls a chain of thought, a recent user turns or scratchpad reading steps.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1968.33,
    "end": 1971.414,
    "text": "So the stored memory is also volatile.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1971.434,
    "end": 1978.864,
    "text": "Once the task is done, much of this memory disappears unless it's explicitly stored or we",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1979.857,
    "end": 1984.483,
    "text": " we convert the short-term memory to long-term memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.503,
    "end": 1997.058,
    "text": "And for the long-term memory, that means the persistent and persistent storage is where agents store information across tasks and across sessions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1997.779,
    "end": 2008.092,
    "text": "So there are two kinds of subtypes of long-term memory, episodic memory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2008.358,
    "end": 2011.061,
    "text": " such as semantic memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2012.023,
    "end": 2020.414,
    "text": "So the epitome of memory is past events, that is, past interaction and tool usage or summary of a completed task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2020.434,
    "end": 2027.483,
    "text": "And this task involves the agent to analyze more unseen tasks and unseen future queries.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2028.063,
    "end": 2037.876,
    "text": "And semantic memory stores structure knowledge, such as the rules, concepts, and the facts that the agent has learned or extracted from past errors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2038.21,
    "end": 2048.66,
    "text": " Together with three kinds of memory, the agent can build up its own experience over time, adapt to users and reflect on their own behaviors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.381,
    "end": 2062.572,
    "text": "So the core part of the memory chapter is the memory lifecycle and the heart of agent memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2062.772,
    "end": 2067.897,
    "text": "It is the stage the agent goes through the process and use memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.433,
    "end": 2083.835,
    "text": " So in the agent memory lifecycle, we decompose memory usage into memory retention process, retrieval process, and memory storage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.316,
    "end": 2089.303,
    "text": "So in detail, there are seven stages in the memory lifecycle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2091.506,
    "end": 2093.749,
    "text": "The first one is memory storage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.932,
    "end": 2107.85,
    "text": " Acquisition agents observe external signals such as tool responses, environment state, and then based on the user query, filter the raw data into the structured data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2108.09,
    "end": 2113.137,
    "text": "They select sensor perception, collecting raw data from the external environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.898,
    "end": 2116.682,
    "text": "And the next stage is the memory encoding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2116.782,
    "end": 2123.23,
    "text": "Here the agents process raw input into structured representation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2123.446,
    "end": 2127.632,
    "text": " For example, addressing named entities or tasks out of commas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2128.293,
    "end": 2139.309,
    "text": "And then summarizing a long dialogue converting the outputs into a knowledge graph or memory entry story.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2139.329,
    "end": 2148.502,
    "text": "This is where the meaning or internal meaning from external order is contracted from perception.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2149.203,
    "end": 2150.044,
    "text": "And then the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2150.497,
    "end": 2152.72,
    "text": " Another core part is the memory derivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.941,
    "end": 2168.965,
    "text": "The agent may further derive insights or new knowledge from existing encoded memory, and this process may be iteratively executed in the lifelong memory derivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.325,
    "end": 2179.761,
    "text": "For example, we can derive tasks of success or failure labels, detecting user preferences, inferring dependencies, or causal relations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2180.365,
    "end": 2187.014,
    "text": " So this helps the agent to grow its internal state of the external world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2190.118,
    "end": 2194.103,
    "text": "Another part of the memory cycle is about the storage of memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2194.283,
    "end": 2200.551,
    "text": "So agent decides where to store in long-term memory and how the memory is stored.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2201.24,
    "end": 2226.37,
    "text": " The key techniques include which memory to keep versus which memory to discard, such as how to index the existing memory of text and how to represent them from label retrieval, such as based on text-based retrieval or embedding-based retrieval from such as embedding database.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2226.61,
    "end": 2230.875,
    "text": "It's more about the capacity management and relevance fitting that become",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2231.176,
    "end": 2237.203,
    "text": " It is a critical technique to design this part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2237.223,
    "end": 2240.066,
    "text": "Another part is about memory retrieval.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.226,
    "end": 2246.093,
    "text": "When solving a new task, the agent retrieves relevant parts of the memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2246.473,
    "end": 2259.208,
    "text": "That might involve such as semantic research, or querying by task type, and user filtering based on the recency and variance metrics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2259.627,
    "end": 2278.264,
    "text": " Effective and efficient retrieval ensures memory actually supports more future decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2278.284,
    "end": 2280.268,
    "text": "Also retrieval memory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2280.586,
    "end": 2283.63,
    "text": " be integrated into an agent's prompt or reading process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2283.65,
    "end": 2298.029,
    "text": "It can involve formatting memories for large amount of input and summarizing retrieved items and injecting content selectively to fit token limits, reading what is connected from the past experience to present actions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2299.891,
    "end": 2309.184,
    "text": "Finally, this part is how can we update the memory over time, refining entries or removing outdated ones.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.825,
    "end": 2310.205,
    "text": "So this",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2310.961,
    "end": 2335.125,
    "text": " The technique for this part is how can we edit old memories with new info, and how can we forgetting a variant data and reinforce frequently used memories, such as human kind, human kind, actually rehearsal our memory and to strengthen our stored knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2336.006,
    "end": 2336.867,
    "text": "So agent memory,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2337.944,
    "end": 2344.054,
    "text": " for this part is dynamic and can be adapted to more future tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.623,
    "end": 2361.122,
    "text": "So in summary, in the memory cycle, we model the memory in agents by drawing directly from the human cognition and designing three types of memory, sensor memory, short-term memory, and long-term memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.363,
    "end": 2364.508,
    "text": "And each memory type has its counterpart in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2365.028,
    "end": 2374.64,
    "text": " current large number of agents involved which are more context-aware reasoning of behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.242,
    "end": 2385.214,
    "text": "And we formalize memory lifecycle into the seven stages from memory acquisition into memory updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2385.751,
    "end": 2400.153,
    "text": " And this left cycle allows agents to actively pursue its skin code and remember and grow over the lifelong deployment, which is essential for building tagging and attack systems for the foundation agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2400.613,
    "end": 2405.16,
    "text": "So that's all my introduction for the memory cycle, not for the memory chapter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.088,
    "end": 2417.53,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2419.918,
    "end": 2425.579,
    "text": "Okay, now let me introduce the optimization and self-evolution part.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2428.31,
    "end": 2448.478,
    "text": " uh yeah hello hello everyone and uh thank you hello and thank you for having us here uh my name is shaopeng zhang i'm currently a phd student at the penn state university and now i'm interning in bay area bay area at invidia research and i will be mainly covering these sections",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2448.458,
    "end": 2474.601,
    "text": " So the main idea of this section is how can RM agents could improve themselves over time without the human's help and the paper breaks this concept into several parts and the first part is the optimization space and dimensions it means that in these sections we gave a formally defining of what kind of component in the agentic system could be optimized",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2474.581,
    "end": 2485.468,
    "text": " and we go through the current research and we summarize it in this component like the prong optimizations and the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2486.225,
    "end": 2493.093,
    "text": " like the product optimizations and the workflow optimizations, and as well as tool optimizations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2493.814,
    "end": 2498.959,
    "text": "These three parts, the community puts their most efforts on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2499.64,
    "end": 2510.993,
    "text": "And we also expect that, okay, now if we want to optimize the agent tech system, we do not want to operate them separately.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2511.013,
    "end": 2515.658,
    "text": "So in ideal cases, we expect we could operate them",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2515.638,
    "end": 2543.586,
    "text": " comprehensively so we also gave summaries of current efforts in how current research works are trying to optimize agentic systems in their multiple aspects like the prongs like tools so this somehow like a multi-objective optimizations and in the next chapters we are working we are mainly discussing the using large language model as an optimizer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2543.802,
    "end": 2564.848,
    "text": " So if we want the agentic system could get a kind of involutions, we may not use it directly using the traditional optimizers to optimize this agentic system because traditional optimizers are mostly gradient based.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2564.828,
    "end": 2570.974,
    "text": " large language models should be the engine for conduct this kind of optimizations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2571.935,
    "end": 2578.602,
    "text": "So in this chapter, we first gave a brief overview of traditional optimizers and discussing why it works in our scenarios.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2579.323,
    "end": 2588.372,
    "text": "And then we're discussing the current approaches for using ILMs as optimizers to optimize in different objectives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2588.572,
    "end": 2593.958,
    "text": "And the most important part is agentic systems and ILM systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2593.938,
    "end": 2601.315,
    "text": " uh in the in the we we discuss these things uh in this in the subsections and uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2602.797,
    "end": 2628.484,
    "text": " Next, we're discussing when using ILMs as optimizers, we're discussing the hyperparameters of when conducting such a kind of optimizations because we observe that when using ILM as optimizers, the hyperparameters plays a critical role and it will greatly define how the ILM performs",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2628.464,
    "end": 2631.549,
    "text": " when conducting the optimization functionalities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2631.909,
    "end": 2639.52,
    "text": "We're discussing the current efforts of exploring different hyperparameters when using ILMs as optimizers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2641.243,
    "end": 2655.163,
    "text": "And then, next, we're discussing the optimizations across dips and time, which we mainly discuss the scope of when performing such a kind of ILM optimizations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2655.278,
    "end": 2666.54,
    "text": " We also do a theoretical discussion of current efforts in discussing why ILM could be regarded as optimizers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2666.56,
    "end": 2676.46,
    "text": "And we make a survey of current efforts in summarizing these theoretical papers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2679.545,
    "end": 2689.241,
    "text": " Next, we are mainly discussing the application scenarios of when performing the agent-hick self-involution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2689.301,
    "end": 2697.275,
    "text": "We categorize them into two cases, the online self-improvement and the offline self-improvement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2697.795,
    "end": 2701.722,
    "text": "For online self-improvement, it is the most ideal case that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2701.702,
    "end": 2721.195,
    "text": " okay now we have agentic systems when we deploy it in a specific applications we may expect that it could just like human beings to learn from past experience and learn from fears and get involved themselves optimizing its problems optimizing its optimization its tools and optimizing its workflows",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2721.547,
    "end": 2728.714,
    "text": " even optimizing the different roles in the specific agent systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2729.395,
    "end": 2735.501,
    "text": "And this is the most ideal cases, but it is also more hard than offline optimizations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2735.842,
    "end": 2745.031,
    "text": "So we discussed the current efforts in building online agent systems that could online to self-improve themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2746.132,
    "end": 2750.136,
    "text": "This is the first subsections we discussed in this chapter.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2750.842,
    "end": 2754.449,
    "text": " And the next is offline agent tech self-improvement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2755.01,
    "end": 2766.672,
    "text": "Compared to online self-improvement, offline self-improvement means that, okay, now we have agent tech systems and we also have curated data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2767.153,
    "end": 2770.96,
    "text": "And before deploying these agent tech systems in the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2771.26,
    "end": 2782.857,
    "text": " in realistics, we first train to optimize this agent tech system using the curated data and ensure that it could work well on this kind of training data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2783.297,
    "end": 2784.74,
    "text": "And then we make the deployment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2785.38,
    "end": 2798.179,
    "text": "And this is the most common accepted practice in building up the agent tech system because it's more simple",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2798.159,
    "end": 2824.572,
    "text": " simple and could and also has been demonstrated is more effective and the most efforts are putting up here but it is not ideal enough we also discuss we also make a comparison between online and offline self-improvement to summarize there are different features and what income and what not income",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2825.328,
    "end": 2831.999,
    "text": " And finally, we also discussed current efforts in the hybrid approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2832.2,
    "end": 2834.123,
    "text": "We combined both online and offline.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2834.604,
    "end": 2842.818,
    "text": "We first used the curated data to build up an agent tech system to ensure it has great foundations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2843.339,
    "end": 2848.568,
    "text": "And then we also added some online learning algorithms when deploying it in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2848.548,
    "end": 2853.719,
    "text": " in practical and to ensure that it could work well and learn from past failures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2854.26,
    "end": 2865.544,
    "text": "So there are also several works focusing on this pipeline.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2866.975,
    "end": 2882.065,
    "text": " and in the last chapter we are discussing the scientific discovery and intelligent involutions because in this part we mainly discussing the self involutions",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2882.045,
    "end": 2888.376,
    "text": " For self-involution, we mean that it could improve themselves without the human's help.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2888.917,
    "end": 2896.83,
    "text": "And the knowledge discovery, new knowledge discovery means that, okay, we have a training set, we build up agentic systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2897.411,
    "end": 2901.758,
    "text": "If the agentic system could discover some new knowledge that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2901.957,
    "end": 2925.535,
    "text": " human beings cannot do not know and it which means it this knowledge didn't involve didn't include it in their training set so this could be regarded as a kind of self-involution and this is very important we expect somehow in the future we may expect the agent system could learn from them from themselves and doing their own research",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2925.7,
    "end": 2929.346,
    "text": " So this is a kind of self-evolution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2929.406,
    "end": 2938.54,
    "text": "And we're discussing the current efforts in using agentic systems in scientific discovery and in performing scientific experiments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2939.421,
    "end": 2944.248,
    "text": "And we put a lot of efforts in summary these sections.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2945.37,
    "end": 2949.316,
    "text": "And yeah, that is what I want to share today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2952.201,
    "end": 2952.641,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2953.523,
    "end": 2953.783,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2964.85,
    "end": 2977.791,
    "text": " Hi everyone, my name is Fengzhuang Liu.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2977.952,
    "end": 2990.352,
    "text": "In the third part, I'd like to take you beyond the individual agents to explore how they work together in what we call multi-agent systems or MAS for short.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.332,
    "end": 3012.947,
    "text": " and our paper expanded beyond single agents to examine these systems composed with the multiple foundation agents we discussed their components their structures and how they cooperate and their decision-making mechanisms we also explore the emergence of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3013.771,
    "end": 3021.936,
    "text": " emergence of collective intelligence when these agents collaborate or complete autonomously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3022.618,
    "end": 3025.587,
    "text": "And by the end, we will reveal the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3026.427,
    "end": 3031.797,
    "text": " the evaluation methods that help us understand and measure this complex system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3033.099,
    "end": 3038.889,
    "text": "Okay, let's begin with the first chapter, the multi-engineered system design.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3040.352,
    "end": 3045.361,
    "text": "When we built LMM-based multi-engineered systems, what's the foundation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3046.182,
    "end": 3050.73,
    "text": "We suppose it's for the cooperative goals and norms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3050.71,
    "end": 3064.87,
    "text": " These are significant because they shape everything else, the system's constraints, how agents interact with each other, and the overall mechanisms for working together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3064.91,
    "end": 3075.925,
    "text": "Think about it this way, collaborative goals tell each agent what they are aiming for, whether",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3075.905,
    "end": 3082.055,
    "text": " individual success, collective achievements, or competitive advantage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3082.776,
    "end": 3099.263,
    "text": "Meanwhile, the collaborative norms are like the rulebook and they establish how agents should interact and what constraints exist and what the convention to follow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.918,
    "end": 3111.784,
    "text": " based on these foundations we can organize the material systems for into swimming types those focusing like the strategy learning like the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3111.865,
    "end": 3135.73,
    "text": " um design for the modeling or simulation or those beautiful beautiful collaborative problem solving or task solving yeah and in our paper we analyzed the typical applications across these three categories to understand how lms are transforming agent behavior and the interaction and the agency",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3135.71,
    "end": 3148.705,
    "text": " decision making and which leads us to support the next generation agent protocols that are specifically designed for LMMA system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3148.725,
    "end": 3148.885,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3149.547,
    "end": 3150.951,
    "text": "And we also",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3150.931,
    "end": 3162.428,
    "text": " We also discussed the collaborations patterns, because humans have the diverse ways of interacting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3162.668,
    "end": 3169.738,
    "text": "We built concepts, learning skills from each other, or divided tasks by ourselves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.559,
    "end": 3176.228,
    "text": "So our research examined multi-agent collaborations through three dimensions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3176.388,
    "end": 3180.634,
    "text": "There's the purpose of the interaction, like the message type,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3180.8,
    "end": 3200.698,
    "text": " this form and the relationship involved uh yeah and they depend on their goals and forms they may be like the discussions or the debates from auto voting or create each other in one ways or multi directions interactions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3200.915,
    "end": 3220.932,
    "text": " yeah and i think the the next the next chapter is one of the most insignificant and which is the combination topological the or you can think it is the multi-agent systems topologic from a system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.912,
    "end": 3239.376,
    "text": " perspective the topological the connection pattern often determine how efficiently agents can collaborate or what their upper limits might be yeah we discuss we classified multi-agent system topologics into two major",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3239.356,
    "end": 3259.862,
    "text": " um two major uh class uh the first one is the static topological logics uh you may include the hierarchical and centralized structure or the decentralized structures for example and these are typically used when",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3259.842,
    "end": 3280.635,
    "text": " solving some specific tasks like our meta gpt we use a slp to to predefine this workflow of the software development cases and the the other class is the dynamic and adaptive topologic um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3281.476,
    "end": 3291.107,
    "text": " It can be achieved by imaging algorithms like the search-based and the generative-based or the parametric approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3292.448,
    "end": 3298.696,
    "text": "When we look to the future, scalability becomes a crucial interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3299.857,
    "end": 3306.885,
    "text": "How can we do to efficiently scale this system as the number of agents increases?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3307.185,
    "end": 3308.867,
    "text": "This is one of the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3308.847,
    "end": 3338.297,
    "text": " key challenges in the future research we need to address and and we suppose i would suppose the collective intelligence and emergencies in mas is important too because it doesn't just appear it develops by a dynamic and interactive process through the continuous interaction agents greatly build share understanding and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3338.395,
    "end": 3367.221,
    "text": " collective memory and what drives this process it may be the diversities of the individual agents feedback from the environment and how information gets exchanged between agents and these factors create dynamic interactions that's crucial for forming complex social networks and improving decisions strategy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3367.927,
    "end": 3373.583,
    "text": " which lead to imagined behavior phenomena like trust and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3374.204,
    "end": 3398.895,
    "text": " uh strategy description and so on and we call this um like the uh self-evolution and it can happen through memory-based learning or electric-based learning yeah and in the future we hope to or what's even more fascinating is that as the system evolved agents began to form social contracts or like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3398.875,
    "end": 3406.812,
    "text": " organization hierarchies and the direction of labor, just like the human societies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.273,
    "end": 3414.789,
    "text": "Yeah, that's understanding this phenomenon represents one of the most exciting directions of the future MAS research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3415.49,
    "end": 3418.757,
    "text": "And the last and in the last",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3419.716,
    "end": 3429.431,
    "text": " In the last part, we summarize some multi-agent systems benchmark here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3429.471,
    "end": 3437.703,
    "text": "As the multi-agent system demonstrates more advantage, so we need to fundamentally transform how we evaluate them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3438.264,
    "end": 3443.732,
    "text": "MAS evaluation should be focused on host-linked",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3445.113,
    "end": 3468.538,
    "text": " nature of the agent interactions not just in individual performance key dimensions include how how efficient agents can play plan together and the quality of the information they exchange and how well they make decisions collectively yeah and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3469.008,
    "end": 3482.231,
    "text": " In our paper, we summarized the two approaches of the evaluation, like the task-solving benchmarks and the general capability assessment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3483.152,
    "end": 3491.927,
    "text": "The first may be focused on measuring how deeply and currently agents coordinate this distinction across types of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3491.907,
    "end": 3521.61,
    "text": " and environments the second evaluates how well groups of agents interact and adapt within complex and dynamic synonyms this either evaluation frameworks give us the tools to understand and measure to improve multi-agent systems for the future in applications and that's all of the something important of the part and that's all thank you thank you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3524.02,
    "end": 3552.677,
    "text": " okay let me share my screen very exciting i think it's the most presentations we've ever seen back to back but appropriate for the multi-agent theme thank you you see my screen yeah not yet yep okay oh okay okay sorry my my camera seems to be broken so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3554.277,
    "end": 3557.462,
    "text": " So let me start this part.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3558.884,
    "end": 3561.708,
    "text": "Hello everyone, my name is Haibo Jin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3563.25,
    "end": 3569.178,
    "text": "Currently I'm a PhD student at University of Illinois at Havana, Champaign.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3569.218,
    "end": 3578.732,
    "text": "Today I'm going to talk about high-level instruction about building safe and beneficial AI agents.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3578.712,
    "end": 3590.333,
    "text": " As we all know, the rapid development of large-language model-based agents introduced a new set of safety challenges.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3591.495,
    "end": 3596.704,
    "text": "We categorized these safety challenges into",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3596.684,
    "end": 3619.03,
    "text": " intrinsic safety and extrinsic safety we use a figure to illustrate this problem and for the intrinsic safety we divided them into three parts the first part is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3619.01,
    "end": 3647.38,
    "text": " perception and the perception part is the the the large language model based agent can see the world see the world and the brain the brain the brain mainly talk about the large model itself it includes a large language model to extract the data decision making and action part action part",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3647.883,
    "end": 3677.299,
    "text": " part is how this large-range model can act and for the for the extrinsic part we divided them into environment memory and agent interactions so the over overall pipe pipeline of this part can be seen in figures 17.1 and for the first part",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3677.617,
    "end": 3691.009,
    "text": " For the first part, the intrinsic safety, we mainly talk about the stress on AI brain, which is Lagrangian model itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3693.051,
    "end": 3699.637,
    "text": "We divide them into five vulnerabilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3700.018,
    "end": 3704.822,
    "text": "First of all is jailbreak attack, as we can see,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3705.663,
    "end": 3735.079,
    "text": " from this figure normally the malicious attacker will send questions like send malicious emails to others and they will craft some adversarial specifics such as the red one or some natural language",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3735.059,
    "end": 3739.925,
    "text": " to these types of malicious questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3740.185,
    "end": 3746.173,
    "text": "And then the large-language model will produce disallowed content.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3746.974,
    "end": 3762.012,
    "text": "And then next content is prompt injection attack, which hijacks a large-language model system prompt to execute an attacker's plan.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3762.413,
    "end": 3784.928,
    "text": " as we can see this figure normally users want to summarize the article from one website and malicious attack will hijack this system and output their plans next part is hallucination",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3786.494,
    "end": 3805.212,
    "text": " model such as this question was the victor of the united states presidential election in year 2020 and the ground truth is joe biden was the victor and the hallucination",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3806.66,
    "end": 3814.097,
    "text": " Hallucination unconfidently generates fake response like Donald Trump was the victor.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3814.959,
    "end": 3819.55,
    "text": "And the next part is misalignment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3819.77,
    "end": 3825.664,
    "text": "Misalignment reflects value gaps and model",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3826.623,
    "end": 3833.152,
    "text": " reflects value gaps between the model rewards to our human evaluation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3833.772,
    "end": 3845.728,
    "text": "And the next part is point attack, which manipulates the training data to embed children behaviors",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3846.434,
    "end": 3859.252,
    "text": " they can use a specific trigger to let these large-edge model brains act like the attackers want.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3861.435,
    "end": 3867.784,
    "text": "And the next part, we talk about the privacy concerns",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3871.493,
    "end": 3885.115,
    "text": " which the large-range model will leak some training data or some sensitive information from the users and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3885.905,
    "end": 3891.832,
    "text": " That's mainly talk about AI brains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3892.533,
    "end": 3901.764,
    "text": "And the next part is about the non-brain modules, such as the perception parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3902.384,
    "end": 3914.038,
    "text": "For example, in the perception part, such as many adversarial stickers on a staff sign can make a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3914.018,
    "end": 3939.047,
    "text": " delivery report speed up instead of a break and the action such as supply chain attack or third-party tools or our permission functions that let attacker draft an email and place orders to do something they want and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3941.845,
    "end": 3948.997,
    "text": " Next part is intrinsic safety and including the agent-to-agent interaction safeties.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3950.92,
    "end": 3965.946,
    "text": "First of all, we talk about the agent-memory interaction threats, such as poison,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3966.382,
    "end": 3982.011,
    "text": " Poisson retrieval, SNAP, and WinchCast do the future plans of the large range models and agent-to-environment risk training.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3985.317,
    "end": 3990.246,
    "text": "Sorry, this part, where is this part?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3991.593,
    "end": 4013.533,
    "text": " okay agent environment interaction threats such as the agent interaction with the physical environment a training bot can create feedback loops and crash markets that's an example and also",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4013.513,
    "end": 4033.277,
    "text": " there are some threats in between the agent to agent interactions such as the competitive the threats in competitive interactions and correct cooperative interactions and the next part we talk about the uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4034.101,
    "end": 4051.232,
    "text": " super-alignment normally standard ILHF cheats helpful versus helpless as one type of reward super-alignment introduces a composite object hierarchically and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4052.393,
    "end": 4056.439,
    "text": " And we briefly talk about super alignment here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4056.72,
    "end": 4065.654,
    "text": "And the next part, we talk about the safety scan law in AI agents.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4066.755,
    "end": 4071.983,
    "text": "And maybe I think, sorry, sorry, I think that that's it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4079.054,
    "end": 4079.515,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.207,
    "end": 4087.548,
    "text": " Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.568,
    "end": 4093.641,
    "text": "So maybe a few minutes for questions if anyone in the live chat has questions or is there anyone?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4093.961,
    "end": 4099.733,
    "text": "Does anyone else want to make any comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4102.94,
    "end": 4104.844,
    "text": "I think that's basically for today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4106.005,
    "end": 4107.287,
    "text": " Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.307,
    "end": 4109.97,
    "text": "Maybe I'll just ask just a few questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.251,
    "end": 4118.901,
    "text": "You've reviewed a ton of literature, I think around 1400 citations in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.981,
    "end": 4128.232,
    "text": "So what did you learn or find from the research about the information environment for multi agent coordination?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.933,
    "end": 4135.0,
    "text": "And how can we structure collaborations with human and AI agents?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.76,
    "end": 4145.509,
    "text": " When the amount of information becomes more than any one person might be able to read or make sense of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4151.616,
    "end": 4156.583,
    "text": "This is for the multi-agent part, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.603,
    "end": 4162.01,
    "text": "Yeah, for multi-agent or just for any of the authors in terms of how the paper writing went.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4167.637,
    "end": 4167.737,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.937,
    "end": 4169.721,
    "text": " Hongzhang, do you want to talk?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.028,
    "end": 4182.851,
    "text": "No, I don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4183.011,
    "end": 4184.815,
    "text": "Daniel, can you repeat your question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.217,
    "end": 4211.882,
    "text": " yeah um a lot of the multi-agent work focused on um the dynamics of the communication but just from that research and also from writing the paper what did you find or learn about the environment that the agents interact within yeah i think it is a um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.634,
    "end": 4234.9,
    "text": " a newest research research topics um we are exploring it yeah but we have don't have some specific conclusions yeah we will summarize the new latest research paper yeah well um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4236.432,
    "end": 4245.544,
    "text": " From my point of view, I think that basically we categorize the environments into different types, including the digital environment, the physical environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4246.045,
    "end": 4255.878,
    "text": "And for the digital environment, you have pure text environments, you have virtual 3D environments, or you have GUI, where we have a lot of UI agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4256.919,
    "end": 4260.364,
    "text": "And a trend is that I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.479,
    "end": 4262.541,
    "text": " It's related to the agent protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.662,
    "end": 4269.59,
    "text": "Well, if you want to, different agents and agent tools can collaborate together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.63,
    "end": 4278.72,
    "text": "And one important topic is how to develop more unified and fundamentally universal protocols.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.801,
    "end": 4282.605,
    "text": "So recently we have the MSAP from Anthropic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4282.585,
    "end": 4291.381,
    "text": " We have the agent-to-agent from Google, so the enabled connection between interagent communications and agent-to-agent communications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.142,
    "end": 4294.366,
    "text": "But there are many others that go beyond that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.466,
    "end": 4304.745,
    "text": "So if you think about, let's say, the Web3 idea, we hope that everything can be digitalized and connected as a global web.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4304.725,
    "end": 4323.848,
    "text": " Then in this case, if we want to include more type of resources, more type of entities to work together and share a global context, then developing more powerful agent and let people in industry, in academia accept that would be a very important thing to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4329.315,
    "end": 4331.298,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4331.318,
    "end": 4331.678,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4332.991,
    "end": 4336.737,
    "text": " The paper is a major milestone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.318,
    "end": 4340.543,
    "text": "I think it could be a textbook or a course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.344,
    "end": 4352.542,
    "text": "I would have asked what's a good place for somebody who's wanting to learn and get started, but I think that's in many ways what the paper exactly does with providing this kind of a review.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.922,
    "end": 4356.708,
    "text": "So if you have any other comments to make, please feel free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.409,
    "end": 4359.032,
    "text": "Otherwise, thank you again for joining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.307,
    "end": 4375.958,
    "text": " yeah thank you thank you a lot awesome yeah that's it great good luck with your research till next time bye thank you bye",
    "speaker": "SPEAKER_00"
  }
]