[
  {
    "start": 6.545,
    "end": 33.042,
    "text": " hello and welcome it's september 13th 2024 and we're in active inference model stream 14.1 with ranway talking about value of information and reward specification in active inference there will be a presentation then we'll have a discussion and looking forward to people's comments and questions thank you again for joining and looking forward to the presentation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.135,
    "end": 34.876,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 34.976,
    "end": 36.438,
    "text": "So I'll just dive into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.76,
    "end": 38.0,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.02,
    "end": 40.723,
    "text": "So thanks again for the invitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.064,
    "end": 54.04,
    "text": "And so this paper is about the value of information and then some aspects about reward specification in active inference, but it also touches on POMDPs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.642,
    "end": 59.747,
    "text": "And so the motivation is very simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.847,
    "end": 60.328,
    "text": "So I,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.781,
    "end": 67.751,
    "text": " was simply trying to understand the expected free energy objective for action planning in active infants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 69.012,
    "end": 88.199,
    "text": "And the nice thing about the EFE objective, which makes it an appealing objective for a variety of people in a variety of domains, is that it has a very intuitive decomposition as the sum of the expected value term and the epistemic value term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.72,
    "end": 90.282,
    "text": "And then so the expected value term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 90.7,
    "end": 109.992,
    "text": " is this term that encourages the agent to obtain reward or achieve their preferred state of the world because it's simply the cross entropy between the predicted future observations given some actions and the preferred observations p tilde",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.748,
    "end": 118.66,
    "text": " The second term, epistemic value, is what makes active inference or what makes EFE very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 118.801,
    "end": 134.545,
    "text": "So the epistemic value term is defined as the expected KL divergence between future posterior, so belief about future states given future observations, and the predicted",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 135.048,
    "end": 163.3,
    "text": " distribution of future states so what this term does is it quantifies how far is the future posterior from the future prior which essentially quantifies the amount of belief update so if you optimize this term then it essentially encourages the agent to take actions that would lead to a higher amount of belief update so a higher amount of information obtained about the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.09,
    "end": 171.116,
    "text": " So experimentally, people have found that optimizing this objective led to some very interesting behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.817,
    "end": 192.915,
    "text": "So on the left hand side here, we have an example from one of Alex's papers where he compared what we call the state coverage of reward maximizing agents versus active inference agents in this simple environment called the mountain car, where the state of the agent is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.895,
    "end": 195.758,
    "text": " represented by its position and velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.419,
    "end": 202.325,
    "text": "So we see that active inference agents has much larger coverage of the state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.345,
    "end": 207.711,
    "text": "So it spreads more territory of the state space versus the reward maximizing agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.532,
    "end": 221.586,
    "text": "And so this potentially allows the agent to do is to learn a better and more comprehensive model of the environment, which it also turns out that having such a model enables better action selection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 221.853,
    "end": 223.457,
    "text": " and actually achieving higher reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.121,
    "end": 229.23,
    "text": "So on the right hand side, we have an example from one of my papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 229.471,
    "end": 233.279,
    "text": "So I did a lot of study on modeling human driving behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.48,
    "end": 240.115,
    "text": "And this is one of the examples where we have a car called the Eagle vehicle driving down the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.263,
    "end": 250.227,
    "text": " And then on the side of the road, we have a large truck, which potentially obscure the view of a pedestrian, but we don't actually know whether the pedestrian exists or not exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 250.868,
    "end": 257.344,
    "text": "But if the pedestrian does exist, we assume, or rather the ego vehicle believes that it's going to cross the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.645,
    "end": 261.109,
    "text": " So we don't want to cause any conflict with the pedestrian who's trying to cross the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.59,
    "end": 271.582,
    "text": "So what this ego vehicle does as a consequence of optimizing EFE is that it will nudge slightly to the left of the road to gain view of the pedestrian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.022,
    "end": 282.775,
    "text": "And if it sees that the pedestrian doesn't exist, then it will return to the center of the road and carry on with the optimal speed without ever having to stop for the pedestrian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.396,
    "end": 292.911,
    "text": " So these behaviors are very interesting and it highlights the value of encouraging the agent to explore and gain information about the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 293.372,
    "end": 302.547,
    "text": "And this is usually understood as the main differentiator between active inference and some of the other frameworks for decision-making such as reinforcement learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.25,
    "end": 310.72,
    "text": "But one somewhat contradictory fact is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.172,
    "end": 319.181,
    "text": " Actually, Bayesian and meta-reinforced learning are already known to ultimately trade off exploration and exploitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.762,
    "end": 324.147,
    "text": "So here we have an example from one of the more recent meta-RL surveys.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 326.75,
    "end": 338.884,
    "text": "So this is actually a very common benchmark in meta-RL, where we would start an agent in the center of the circle, and then the goal position, which is unknown to the agent, will be somewhere along the circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 339.269,
    "end": 340.971,
    "text": " But again, it's never known to the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 341.391,
    "end": 346.576,
    "text": "So what the agent has to do is to explore along the circle to find the goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.756,
    "end": 355.444,
    "text": "So basically what it does is it'll pick a position along the circle and it'll just trace along the circle until it arrives at the goal position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.724,
    "end": 359.327,
    "text": "So this is the optimal strategy for this setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.647,
    "end": 363.03,
    "text": "And we see that it's already being demonstrated by meta-RL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.631,
    "end": 369.276,
    "text": "So this begs the question even more of what is the relationship between active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.256,
    "end": 371.939,
    "text": " and Bayesian RL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.119,
    "end": 390.898,
    "text": "And the main idea of the paper or rather the main insight that we're trying to offer is that EFE can be understood as an approximation to the Bayesian optimal RL policy and specifically by the information reward shaping of the EFE objective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.379,
    "end": 396.343,
    "text": "So to unpack this, I will do a very brief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.796,
    "end": 403.222,
    "text": " review of some preliminary annotations on MDPs and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.963,
    "end": 418.776,
    "text": "And then we will introduce a few analysis tools from MDP theory, which will allow us to better understand and appreciate the notion of value of information, which then will allow us to derive the main results of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.337,
    "end": 425.402,
    "text": "And then we'll just close up with some discussion and more and some other interactive activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.445,
    "end": 433.792,
    "text": " Yeah, so the preliminaries will be very brief because most people in the Institute, I believe, are the experts in these topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.773,
    "end": 438.697,
    "text": "So this is the regular formalism for MDPs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.097,
    "end": 447.885,
    "text": "And then the objective of an agent in MDP is usually to maximize discounted cumulative rewards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.586,
    "end": 456.233,
    "text": "So I have chosen to use the infinite horizon setting with discounting because it makes the analysis a bit easier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 456.753,
    "end": 474.761,
    "text": " So the only thing I wanted to highlight on this page is that the classic MDP theory says that for a given MDP with known transition probabilities and known reward function, there always exists at least one deterministic stationary Markovian policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.502,
    "end": 484.836,
    "text": "And then the value function of the policy, which is the value accrued by the policy in MDP, can be computed from the Bellman equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.318,
    "end": 507.448,
    "text": " And then so another ingredient that we need is partially observable MDP, which is just an extension of MDPs where the state variable now is no longer directly observable to the agent, but the agent can observe another signal O that's usually correlated with the states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.665,
    "end": 521.241,
    "text": " But because the agent can no longer observe the state, then if you condition your policy only on the most recent observation, you don't really have sufficient information for taking optimal actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 521.761,
    "end": 533.154,
    "text": "So in general, for POMDPs, the optimal policy has to be conditioned on the entire history, which as accumulates, can tend to an infinite length.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 534.576,
    "end": 536.338,
    "text": "So here we need to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.909,
    "end": 557.827,
    "text": " recall another very important result from POMDP theory, which is that the belief state, which can be computed from the Bayesian belief update, is a sufficient statistic of the entire history, which means that if you condition your policy on a belief state, then you don't have to condition your policy on the entire history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.688,
    "end": 559.71,
    "text": "And then once you do that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.994,
    "end": 563.392,
    "text": " you can define the value function also in terms of the belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.613,
    "end": 568.097,
    "text": "So we have what's called a belief action value function, the belief value function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 569.478,
    "end": 592.02,
    "text": " So this belief state view of POMDPs is very interesting because it says that for any given POMDP, you have an equivalent MDP that's defined on the space of beliefs, equivalent in the sense that it would yield the same optimal policy for the belief MDP and the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.861,
    "end": 598.607,
    "text": "And then this belief MDP would have its corresponding belief action reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.925,
    "end": 600.588,
    "text": " and belief transition dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 601.39,
    "end": 608.705,
    "text": "So the belief action reward is defined simply as the weighted average of the state action reward by the beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.647,
    "end": 615.038,
    "text": "And what's interesting about this belief MVP is how the belief transition dynamics is defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 616.16,
    "end": 618.385,
    "text": "So you can understand this by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.702,
    "end": 621.705,
    "text": " looking at these two terms on the right-hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 622.126,
    "end": 644.71,
    "text": "So this basically says that in order to transition the belief from one time step to the next time step to get B prime, the first thing you're going to do is to draw a future observation, or sometimes I call it counterfactual future observation, O prime, from the posterior predictive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 645.331,
    "end": 648.558,
    "text": " of the observation distribution under the current belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.5,
    "end": 661.365,
    "text": "And then you're going to perform Bayesian update on this counterfactual observation to get the next belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.497,
    "end": 671.218,
    "text": " And so because the marginal distribution over the observation is, in general, stochastic, this makes the belief transition dynamics also stochastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.641,
    "end": 679.776,
    "text": "So this is the equivalent belief MDP for the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.975,
    "end": 691.967,
    "text": " And then I will refer to this as the base optimal belief MDP, because the policy computed from such a belief MDP would be the base optimal policy for the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 694.59,
    "end": 703.9,
    "text": "So then we have active inference, which, similar to the canonical POMDP framework, has an inference step and a planning step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 704.54,
    "end": 707.063,
    "text": "And so the difference between active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.482,
    "end": 715.279,
    "text": " And the regular POMDP is instead of performing exact Bayesian update, we'll perform variational updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.942,
    "end": 725.541,
    "text": "But because from the variational inference literature, we know that if the variational distribution QFS is chosen appropriately,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.774,
    "end": 729.82,
    "text": " then it would have to be equal to the exact Bayesian update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.16,
    "end": 737.47,
    "text": "So this doesn't really introduce too much difference from the classic POMDP framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.131,
    "end": 748.986,
    "text": "The main difference between active inference and the classic POMDP is that the agent would, instead of optimizing reward, the agent minimizes expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 749.687,
    "end": 753.452,
    "text": "And I wrote this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 754.006,
    "end": 757.171,
    "text": " form of EFE here, which I believe is more general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.193,
    "end": 763.18,
    "text": "It's sometimes referred to as the energy entropy decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.783,
    "end": 778.444,
    "text": "So something I want to remark on this page is that whenever we talk about EFE, we need to be very precise about the definition of different cues because there are too many cues in active inference and in EFE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.762,
    "end": 787.314,
    "text": " And here I define the Q over future states as the product of future marginal state distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 788.336,
    "end": 790.819,
    "text": "This is not because I invented it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 790.839,
    "end": 807.283,
    "text": "I'm just writing the usual definition of EFE in a more formal way and explicitly called out that this is the product of future marginal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.394,
    "end": 823.453,
    "text": " And then, so one more step to get the pragmatic and epistemic value decomposition of EFE is that we would have to define the energy function or the preference distribution to have preference only on the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.114,
    "end": 830.942,
    "text": "And then we can split up the energy entropy decomposition into the pragmatic and epistemic value decomposition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.884,
    "end": 852.88,
    "text": " So what this characterization allows us to do is that we can now see EFE as a specific type of belief MDP, where it would be different from the base optimal belief MDP, but it would still have its own belief action reward and belief transition dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 853.332,
    "end": 864.844,
    "text": " So if we look at the belief action reward, it's simply the sum of the one-step pragmatic value, which I denote with R tilde, and the one-step epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 865.645,
    "end": 874.054,
    "text": "And if we unpack the one-step pragmatic value, we can actually write it as a linear combination of a state action reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.415,
    "end": 882.023,
    "text": "And this is because of the linearity of the expectation, which is used to define the pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.543,
    "end": 886.148,
    "text": " But the linearity doesn't hold for the epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.628,
    "end": 890.534,
    "text": "And in fact, the epistemic values concave in the beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.955,
    "end": 906.154,
    "text": "Another interesting aspect about the belief transition dynamics for EFE is that it doesn't, so different from the base optimal belief transition dynamics, it doesn't contain the counterfactual observation O'.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.062,
    "end": 922.967,
    "text": " So what it means is that instead of drawing a counterfactual observation from the current posterior predictive marginal and doing a counterfactual update, you would just directly propagate your current belief to the next state marginal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.848,
    "end": 926.893,
    "text": "And so this is sometimes called the open loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.211,
    "end": 942.148,
    "text": " belief updating in the literature in a way that's analogous to open-loop control, so that you would update your belief without taking into account of the next observation, but only during planning, not during execution, which we'll come back to later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.209,
    "end": 956.104,
    "text": "But the belief MDP view of EFE would tell us that there exists an optimal deterministic Markovian policy simply due to the characterization as an MDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 957.4,
    "end": 967.499,
    "text": " So with all of these precise characterizations, we can also make our main question more precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.361,
    "end": 975.595,
    "text": "And so we saw that EFE uses the open-loop belief dynamics with an added information reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.064,
    "end": 988.304,
    "text": " Whereas the base optimal belief MDP uses the regular linear combination of state action rewards and a closed loop belief dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.705,
    "end": 999.082,
    "text": "So can we understand these modifications in EFE as an approximation to the base optimal belief MDP and in turn the base optimal policy?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.363,
    "end": 1002.628,
    "text": "So that's the question we're trying to pursue in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.604,
    "end": 1009.311,
    "text": " So in order to answer that, we need to introduce some tools from MDP theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.553,
    "end": 1016.48,
    "text": "So the first set of concepts we'll introduce are the policy advantage and the model advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1017.381,
    "end": 1024.009,
    "text": "And for the sake of discussion for now, we'll just understand them as some abstract notion of error measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.276,
    "end": 1026.259,
    "text": " of the policy and the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.061,
    "end": 1037.117,
    "text": "And the reason why I say that is that if you look at the definition of the policy advantage, for example, so it's defined as the difference between two value functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.758,
    "end": 1041.745,
    "text": "So for the first value function, the action is taken",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.096,
    "end": 1060.847,
    "text": " from the argument of the advantage function whereas in the second value function the action is taken from this policy pi which is used to define the value function so the reason why i say this can be understood as an error measure is that if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.603,
    "end": 1073.25,
    "text": " the action A is more or less the same as the action drawn from the policy Pi, then the advantage function will be zero, so there will be no difference between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.332,
    "end": 1084.729,
    "text": " So this essentially characterizes how much is action A different from an action that would have been chosen by the policy that's used to define the value function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.23,
    "end": 1101.735,
    "text": "And then basically more or less the same idea holds for model advantage, but instead of measuring the difference in the actions, we're measuring the difference in the two dynamics by saying that if I draw a next state S' from dynamics P',",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.715,
    "end": 1108.429,
    "text": " And another next state, S double prime from dynamics P, how is the value of S prime different from S double prime?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1108.87,
    "end": 1113.62,
    "text": "So if P prime is actually equal to P, then there is no model advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1113.861,
    "end": 1118.29,
    "text": "So this thing measures the difference between the two models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.81,
    "end": 1146.1,
    "text": " two other concepts we need to know one is effective horizon so this is basically introduced as an analog of planning horizon for infinite horizon discounted problem so it's defined as one over one minus the discount uh discount factor gamma so it's basically saying how many time steps do i need to accumulate until the geometric discounting that's usually used in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.08,
    "end": 1149.667,
    "text": " in the RL setting is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.687,
    "end": 1163.533,
    "text": "And then the normalized occupancy measure is essentially the stationary or marginal state action distribution along the Markov chain of rolling out a policy in a dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.553,
    "end": 1169.083,
    "text": "So this kind of essentially characterizes the equilibrium behavior of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1170.143,
    "end": 1179.278,
    "text": " And so with these concepts, we have our first analysis tool, which I call performance difference in mismatched MVPs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.039,
    "end": 1182.843,
    "text": "So what we're trying to do in this lemma is the following.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.044,
    "end": 1187.971,
    "text": "So we say that we're going to look at two policies, pi and pi prime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.813,
    "end": 1196.505,
    "text": "And then both policies are optimal with respect to their own MVPs, which we denote as m and m prime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.873,
    "end": 1211.153,
    "text": " And we're going to say that these two MDPs would share the same state and action space, same initial state distribution, and the same discount factor, but they could potentially have different rewards and different dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.095,
    "end": 1225.198,
    "text": " So this is very similar to the comparison of the EFE policy and the Bayes optimal policy where they share the same spaces, but they have different rewards and different dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.699,
    "end": 1230.087,
    "text": "So this is basically our tool to quantify their difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.067,
    "end": 1258.116,
    "text": " And so what does Lemma move on to say is that we're going to look at the performance difference between these two policies, but both of them will be evaluated in environment M. And because policy pi is, by definition, the optimal policy for MDP or environment M, then there's no way that pi prime is going to do better than pi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.282,
    "end": 1262.67,
    "text": " So that's why this quantity is also called the regret.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1263.651,
    "end": 1268.279,
    "text": "So we're going to interchange with calling it regret or performance difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.981,
    "end": 1274.791,
    "text": "But basically, this relationship here shows that the regret can be decomposed into three terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.352,
    "end": 1281.302,
    "text": "So the first term is the advantage of the actions drawn from...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.67,
    "end": 1288.162,
    "text": " policy pi, which I call it the expert distribution because it's the better policy in this setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.843,
    "end": 1295.195,
    "text": "And then the second and third term are defined in terms of the model advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1295.456,
    "end": 1303.29,
    "text": "And I've used notation or abused labeling to call it also the reward advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.249,
    "end": 1321.378,
    "text": " And then, so you can understand this relationship by saying that if R and R prime are equal and then P and P prime are equal, then there's no reward model advantage or disadvantage between the two policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.32,
    "end": 1328.13,
    "text": "And because of that, then there's also no policy advantage, then the regret would be zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.055,
    "end": 1352.662,
    "text": " And so the nice thing about this relationship is that if we put an absolute value sign over it and then we do some algebra, then we can actually obtain an upper bound on the regret that's defined in terms of the policy advantage, reward advantage, and the difference between the two dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.143,
    "end": 1356.987,
    "text": "So from now on, I will actually call reward and policy advantage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1356.967,
    "end": 1379.127,
    "text": " um reward and policy error because that's to some extent what they represent so what we see here on the right hand side is that the coefficients for these different terms are different so the coefficients for the reward and policy error are linear in the planning horizon one over one minus gamma whereas the coefficient for the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.107,
    "end": 1402.465,
    "text": " uh dynamics difference is quadratic or squared in a planning horizon so it says that if we're making errors or mistakes along all of these dimensions then the rate at which the dynamics model error accumulate is going to be much faster than the rate at which policy and reward error accumulates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.508,
    "end": 1418.715,
    "text": " Another thing to remark about this relationship is that it can be a little bit conservative because sometimes even if you make mistakes with your choice of dynamics, you can actually make it up by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.028,
    "end": 1423.615,
    "text": " choosing the reward function to be different from the optimal reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.695,
    "end": 1433.834,
    "text": "So basically, if you incur some disadvantage in the dynamics, then you can choose to gain some advantage in the reward so that it can still out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1434.535,
    "end": 1443.792,
    "text": "And so basically, I'm going to show that this is what happens with the EFE policy compared to the base optimal policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.594,
    "end": 1451.101,
    "text": " Um, yeah, so let's, with this, let's refine our main question a little bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.121,
    "end": 1472.108,
    "text": "So we're trying to understand EFE as an approximation to the base optimal, uh, belief MDP, and then specifically the way in which, um, it approximates that is via this reward shaping term to cancel out the disadvantage, uh, due to using open loop belief dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.088,
    "end": 1489.033,
    "text": " uh so before we do that we um we should review the notion of value of information which will give us to and also make better connections between these two topics so the value of information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.469,
    "end": 1504.886,
    "text": " The most popular definition was given by Ronald Howard, 1966, where he defines it as the reward that a decision maker is willing to give away if they could have their uncertainty resolved by some magician, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.607,
    "end": 1518.902,
    "text": "And if you commit to this definition, then you can quantify the value of information simply as the difference between the expected value given perfect information and the expected value without perfect information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1519.523,
    "end": 1534.183,
    "text": " And then one very appealing fact about this is that because an optimal decision maker cannot do worse by having more information, then the expected value of perfect information is always non-negative, at least in the single agent setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.146,
    "end": 1543.977,
    "text": "But the thing about PelmDP is that in general, you cannot just provide the agent with perfect information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.598,
    "end": 1547.522,
    "text": "Usually what happens is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.857,
    "end": 1553.562,
    "text": " the environment provides the agent with an observation that provides indirect information about the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.903,
    "end": 1561.93,
    "text": "So we need to essentially make an extension of the expected value of perfect information for the PUMDP setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1562.611,
    "end": 1565.573,
    "text": "And it's basically very straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.314,
    "end": 1575.062,
    "text": "And I would just label it as the expected value of perfect observation because we can make an observation rather than be given perfect information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.329,
    "end": 1582.621,
    "text": " And this is sometimes called the value of imperfect information from the decision theory literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.661,
    "end": 1591.376,
    "text": "And the definition, again, is just the difference between the expected value given the perfect observation versus without the perfect observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.157,
    "end": 1597.506,
    "text": "And the non-negativity results apply, again, in the setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.549,
    "end": 1610.2,
    "text": " And then so to apply the expected value of perfect observation to the POMDP setting, we then have to take into account the sequential nature of decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.641,
    "end": 1625.755,
    "text": "And once we add that, it actually turns out that the definition of EV in the setting is the expected value using the canonical linear combination of rewards plus the open loop belief updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.735,
    "end": 1648.452,
    "text": " whereas the expected value given perfect observation is the same as the base optimal value function so so this is very interesting and um it also so because uh the definition of the expected value uses open loop dynamics they sort of serve as a bridge between the base optimal policy um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.432,
    "end": 1669.191,
    "text": " the active inference well actually maybe i put it here the active inference policy whereas the open loop policy is in the middle because this open loop value function takes one term from the base optimal policy and takes another term the belief transition dynamics term from the active inference policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.171,
    "end": 1686.673,
    "text": " um so again the non-negativity of uh the value of perfect observation applied in a setting because as you increase the planning horizon you're basically accruing the non-negativity of value of information along your planning horizon",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.379,
    "end": 1688.522,
    "text": " So this is great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1689.163,
    "end": 1700.029,
    "text": "But the problem with this proposition is that it doesn't really tell us how much is the closed loop or base optimal policy better than open loop policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.931,
    "end": 1705.843,
    "text": "And it also doesn't take into account of the fact that usually",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.823,
    "end": 1719.481,
    "text": " in applications, even though we would plan a policy in an open loop, when we deploy the policy, we usually still deploy the policy in a closed loop by allowing the agent to observe the environment and update their belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.082,
    "end": 1726.65,
    "text": "And if we considered all of this, then we would actually need to compare",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.63,
    "end": 1740.96,
    "text": " the closed-loop policy and open-loop policy using the performance difference and mismatch MDP where both policies are tested on the ground truth PUMDP which we allow the agent to update their beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.615,
    "end": 1753.814,
    "text": " So if we do that, if we can make comparison that way, then one thing we know is that the main contributor to the performance difference between the two policies is due to model advantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.015,
    "end": 1765.733,
    "text": "And specifically in this case, it's due to the disadvantage of using open loop dynamics and open loop policy planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1766.118,
    "end": 1771.367,
    "text": " So what exactly is the advantage or disadvantage of being open loop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.487,
    "end": 1774.572,
    "text": "So here we have a proposition that quantifies that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.113,
    "end": 1784.008,
    "text": "And it turns out that the advantage of being closed loop is exactly related to the information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.714,
    "end": 1785.976,
    "text": " So how did we get this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.697,
    "end": 1790.943,
    "text": "So basically, we start with a one-step decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.604,
    "end": 1803.721,
    "text": "And in that setting, the advantage of being a closed loop is basically the expected value of perfect observation, which is the difference between the expected value given perfect observation and without.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.302,
    "end": 1811.312,
    "text": "And then we can rewrite this as a linear combination of the difference between the updated belief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.292,
    "end": 1838.16,
    "text": " and the prior belief and if we apply some balance here then we can uh rewrite we can we can upper bound this as the expected information gain and that's how we got this and if we accrue this along the planning horizon then we basically multiply this by the effective planning horizon one over one minus gamma so that's how this is obtained um so this is actually very interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.14,
    "end": 1852.253,
    "text": " Because it gives us a clue that if we want to improve the open loop policy while still committing to open loop dynamics, then one very reasonable thing we can do is to change its reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.053,
    "end": 1868.147,
    "text": "And a very obvious choice for changing its reward is to simply make up for the information gain that it loses by using the open loop dynamics and add that back to the reward function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.127,
    "end": 1875.598,
    "text": " And once you do that, then basically you got the EFE objective function in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.58,
    "end": 1894.084,
    "text": "So to be able to formally show that the EFE policy, which is simply the open loop policy plus an information reward, and show that how much it improves on top of the open loop policy, we need to make a few assumptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.064,
    "end": 1897.831,
    "text": " So the first assumption we make here is on the preference specification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.292,
    "end": 1917.507,
    "text": "So basically, what this assumption says is that we need to make sure that if we still want the EFE agent to be goal-directed, then we need to set the preference in such a way so that the gain in pragmatic value after a belief update",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.487,
    "end": 1923.503,
    "text": " is always greater than the loss in information gain after a belief update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.543,
    "end": 1932.728,
    "text": "This way, we make sure that the agent focuses on a task and doesn't get distracted by collecting information that's potentially not useful for the task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.94,
    "end": 1944.558,
    "text": " And then the second set of assumptions are introduced to make us able to compare the open-loop policy and the EFE policy on more of equal ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1945.078,
    "end": 1960.504,
    "text": "So the first assumption is that we're going to assume that the EFE policy commits no more, or rather it does no worse in terms of policy advantage compared to the open-loop policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.484,
    "end": 1969.158,
    "text": " And the second assumption says that the information gain value along the horizon is always going to be greater than some values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.019,
    "end": 1974.686,
    "text": "So again, these things are introduced just for us to better compare the two policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.628,
    "end": 1988.668,
    "text": "And with all of these assumptions and the previous insights, we have our main result here, which gives the regret bounds for the open loop and the EFE policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.851,
    "end": 2001.966,
    "text": " And so we see here that for both the open loop and EFE policies, we have a term that's linear in the policy error and quadratic in the information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.486,
    "end": 2016.552,
    "text": " But the difference between the EFE policy and the open-loop policy is that the EFE policy has an additional term, which is a minus something that is linear in the information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2016.832,
    "end": 2024.867,
    "text": "So basically, the upper bound is being reduced by this term that's linear in the information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.967,
    "end": 2026.35,
    "text": "So that's how much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.33,
    "end": 2036.18,
    "text": " yet the EFE policy improves upon the open-loop policy, which makes it a better approximation to the base optimal policy than open-loop policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.862,
    "end": 2043.047,
    "text": "Yeah, so that's the main results and the main idea in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.348,
    "end": 2050.515,
    "text": "So we'll just close up with some discussions that might be interesting to people from different communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.035,
    "end": 2068.04,
    "text": " So the first interesting observation is that this view of EFB as an approximation to the base optimal policy actually connects back to a lot of work people have done in POMDP planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.52,
    "end": 2075.811,
    "text": "So the thing about POMDP planning that's very tricky is that even though MDP policies are very easy to compute,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.791,
    "end": 2102.98,
    "text": " as soon as we introduce partial observation it just becomes extremely difficult to compute the optimal optimal policy that would ultimately trade off exploration exploitation so people have explored a bunch of heuristics and one of them is called the dual mode controller where you would design an ad hoc rule to switch between exploration mode and exploitation mode so for the export and and uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2102.96,
    "end": 2119.686,
    "text": " and and that switch is being determined by the entropy of your belief with some um chosen threshold and therefore so for the exploration mode uh um you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.172,
    "end": 2123.196,
    "text": " essentially take the argmax of the current belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.396,
    "end": 2127.722,
    "text": "So that's the state that you believe is most likely to be the current state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2128.083,
    "end": 2133.05,
    "text": "And you would simply choose an action from the MVP policy, which we know is easier to compute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.61,
    "end": 2140.58,
    "text": "But if the belief entropy is higher than your threshold, then you would take an action to minimize entropy of the next belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.961,
    "end": 2147.85,
    "text": "So you can read this as something that's very similar to maximizing the gain of information in the next period.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.197,
    "end": 2165.28,
    "text": " Another interesting framework, again, from the PalmDP literature is that some people have realized that there's certain types of behavior that just cannot be modeled as reward-driven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.101,
    "end": 2173.652,
    "text": "And usually what happens here is that you want these agents to actually minimize the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2173.632,
    "end": 2203.2,
    "text": " entropy of their beliefs or maximize the information gain so this is usually called roll pump dp or active sensing so the objective function in this in this framework usually is just to minimize entropy of belief but not the one-step belief entropy rather the cumulative belief entropy along the entire planning horizon so something very interesting about this is that this term if if we introduce",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.193,
    "end": 2224.783,
    "text": " um a uniform prior belief that doesn't change over time steps then minimizing belief entropy is actually proportional to maximizing the expected kl divergence between the updated belief and a uniform prior belief so this looks really similar to the information gain objective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2224.763,
    "end": 2243.045,
    "text": " in EFE, and usually what people do is that instead of just minimizing belief entropy, depending on whether we have any requirements for getting rewards, we would do a weighted sum of the reward term and the belief entropy term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.365,
    "end": 2252.256,
    "text": "And when you do that, that objective is essentially the belief action reward in the EFE case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.552,
    "end": 2258.941,
    "text": " So the one final thing is that actually goes back to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.961,
    "end": 2274.447,
    "text": "So the formulation of active inference that I have introduced, I call it vanilla active inference, and it's also the active inference, the version of active inference that's currently in the main branch of IMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.562,
    "end": 2282.616,
    "text": " But in 2021, people have proposed a variation of active inference called the sophisticated inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2283.357,
    "end": 2289.668,
    "text": "And basically what it does is that it maintains the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.648,
    "end": 2315.233,
    "text": " reward plus information gain as the belief action reward but it actually uses the closed loop belief dynamics i think there's a sentence somewhere in the paper that says that the difference between sophisticated inference and the vanilla active inference is that agent would plan not for future states of your future beliefs so if that's the case then um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.074,
    "end": 2323.427,
    "text": " It's essentially using the same belief transition dynamics as the base optimal belief MDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.607,
    "end": 2333.425,
    "text": "So for practitioners, then there's a potential problem with sophisticated inference, which is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.641,
    "end": 2354.097,
    "text": " now you're basically being based optimal with your belief dynamics but you're adding an additional um term in your reward which means that if the base if the behavior that's supposed to be produced by the base optimal policy you are now ruining it with the additional information gain term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.077,
    "end": 2372.625,
    "text": " um so basically the concern is that agent uh sophisticated inference agent would try to get too much information at the detriment of uh getting less reward because you would spend more basically you would spend more time uh collecting information than focusing on a task um but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.605,
    "end": 2402.578,
    "text": " um essentially what comes to the rescue is our old friend uh the temperature parameter so depending on how you set the precision of your preference distribution for example using a temperature parameter of a softmax distribution then you essentially construct a weighted essentially a weighting of the reward term versus the information gain term so if your preference is very precise with a very low temperature then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2403.082,
    "end": 2429.106,
    "text": " in this case a very high value of lambda then you're essentially saying that i only care about the reward i don't care about the information gain and in this and and if you do this then sophisticated inference just becomes exactly equivalent to the base optimal policy um so um so essentially the lambda temperature term lambda interpolates base optimal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.086,
    "end": 2440.124,
    "text": " policy for reward-seeking behavior versus information-seeking behavior if you have low lambda.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.144,
    "end": 2449.879,
    "text": "And this essentially makes sophisticated EFE a strict generalization of the Bayes optimal policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.146,
    "end": 2453.19,
    "text": " Uh, so that's everything I wanted to discuss.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.21,
    "end": 2462.863,
    "text": "I think, uh, so the final slide is for people who are interested in, uh, more, uh, the basics of active infants and also the connection between active infants and RL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2463.524,
    "end": 2468.871,
    "text": "I have, uh, two blog posts to offer that some people perhaps find helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.913,
    "end": 2471.074,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.194,
    "end": 2471.654,
    "text": "Thanks again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.398,
    "end": 2474.738,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.419,
    "end": 2475.9,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.247,
    "end": 2488.388,
    "text": " right i'll read a first question from the live chat and then i'll read some questions i wrote and some other questions from the live chat so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.414,
    "end": 2506.961,
    "text": " Andrew wrote, you mentioned that we should set preferences such that the pragmatic value outweighs the information value lost after the agent has already achieved that information value so that the agent does not become too focused on seeking information rather than achieving a goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2507.561,
    "end": 2515.253,
    "text": "Can this strategy risk the agent getting stuck in a local optimum by setting preferences which mitigate information seeking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2517.916,
    "end": 2542.05,
    "text": " okay i think something slipped my mind because because it appears to me that the question is somewhat reversed so if i'm getting the idea right so you're saying that if the agent somehow gets stuck in a local minima along a trajectory ticket reward then one thing you can do is to change for example the weighting between the reward term",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.03,
    "end": 2561.355,
    "text": " and the uh the information gains home so that it um essentially switches the mode to focus on getting information and hopefully balances itself out of the local optima is that right it could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.753,
    "end": 2575.369,
    "text": " And then is the question whether that's a reasonable thing to do, whether there's a way to automatically do it, or is that what you're looking for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2575.389,
    "end": 2576.15,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.21,
    "end": 2582.078,
    "text": "Yeah, where and how does preference learning and scaling come into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2582.497,
    "end": 2603.374,
    "text": " So to keep these kinds of epistemic and pragmatic dualities, if there is going to be a unified imperative for policy selection that's projecting onto a set of EFE values, then how do you weight the epistemic and pragmatic value in training and in deployment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.463,
    "end": 2614.883,
    "text": " yeah i think this is an open question i don't think anyone has done very convincing work on this topic specifically so i know about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.048,
    "end": 2638.255,
    "text": " one thread of work from uh carl's people uh essentially they have a way to define uh an update rule for the pre the temperature parameter or the precision parameter so basically what happens there is that if um you end up in a situation where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.437,
    "end": 2646.889,
    "text": " your variational free energy which quantifies the accuracy and essentially the accuracy of your predictive model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2647.529,
    "end": 2659.686,
    "text": "If variational free energy decreases, which means that you're starting to observe signals that constantly violates your model of the environment,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2659.666,
    "end": 2688.795,
    "text": " then you would choose actions in a way that's more stochastic so there are ways to derive such rules from the view where of this notion of free energy unifies perception and action so people from carl's lab has derived rules like this um and then uh there's also work from noir and uh i think it's called um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.113,
    "end": 2700.774,
    "text": " I can't remember what it's called, but basically what that work does is it's trying to use Bayesian updating to learn the preference as the agent interacts with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.834,
    "end": 2709.349,
    "text": "So basically the agent would start by having some preferences about what states or observations to achieve in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.548,
    "end": 2719.328,
    "text": " And as the agent interacts with the environment, it would actually refine its own model, its own preference model, rather than its model of the dynamics of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2720.23,
    "end": 2724.098,
    "text": "But something very tricky that happens there is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.618,
    "end": 2728.302,
    "text": " So she did the experiment in this environment called frozen lake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.143,
    "end": 2732.566,
    "text": "So basically you're walking on a frozen lake and there are holes on a lake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.047,
    "end": 2737.051,
    "text": "And if you somehow step into that hole, you would fall or die.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.091,
    "end": 2744.859,
    "text": "And then an agent that learns the preference in that environment basically learns that it prefers to fall into holes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.04,
    "end": 2748.183,
    "text": "So that doesn't really make a lot of sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.004,
    "end": 2753.308,
    "text": "If your goal is to maximize reward or stay in the life,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.288,
    "end": 2765.974,
    "text": " But it makes sense in a sense that agent just builds a preference model that is essentially in compliance with what actually happens in the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.375,
    "end": 2769.441,
    "text": "So it's kind of self-evidencing in the wrong way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.775,
    "end": 2784.376,
    "text": " So do either of these two approaches provide a practical way to automatically tune the temperature parameter to balance yourself out of a local optimal like you said?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.517,
    "end": 2786.299,
    "text": "I don't think either of them do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.963,
    "end": 2793.049,
    "text": "So I don't think I have a comment that, like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2793.704,
    "end": 2795.527,
    "text": " firmly addresses this at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.607,
    "end": 2812.313,
    "text": "I do know that people who actually work more on the Bayesian RL side, they have done some work to derive approximations to exact Bayesian RL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.814,
    "end": 2817.822,
    "text": "And in doing so, they were able to derive some automatic temperature tuning rules",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.97,
    "end": 2839.287,
    "text": " um to achieve that so if you're interested i believe the person's is ian osband um but i can't i can't be wrong but just look for phasing rl literature um it's it's a paper that um essentially derives a basing rl version of soft active critic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.102,
    "end": 2842.623,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.104,
    "end": 2843.465,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.605,
    "end": 2859.576,
    "text": "And another way to address that is to avert slash avoid structurally so that like a blood sugar distribution could be loaded with high pragmatic value, an isochate distribution could be driven by high epistemic value in hierarchical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.597,
    "end": 2859.857,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2859.837,
    "end": 2883.617,
    "text": " it isn't that every single model is just loosely describing all of this cluster of undefined processes this is really getting to the distributional level and then if a distribution really does have such a challenging situation that it has to be tight and refined and then make a large jump to an area it's never been i mean those are the challenging situations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2883.597,
    "end": 2907.495,
    "text": " and that's where these other techniques and methods can be brought into play however those are the challenging ones and and that is not even necessarily needed for simpler settings um well thanks again for the really instructive and informative presentation to kind of just restate i saw the big move",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2907.475,
    "end": 2932.605,
    "text": " as grounding in the full observability conditions and the analytic situation for the markov decision process for the mdp so certain kinds of guarantees exist that are um as they should be slightly weakened with the partial observability introduction of observables and latent states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2932.889,
    "end": 2946.542,
    "text": " So how is it possible to use some of the techniques, patterns, guarantees, et cetera, for full observability on a partially observable situation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.602,
    "end": 2962.137,
    "text": "And the move is kind of to consider the parameterization of the generative model as a fully observable setting, which is what it is in like the programming environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2962.218,
    "end": 2969.006,
    "text": " Whereas if even part of it were obscured, then even that would be a partially observable setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2969.727,
    "end": 2991.094,
    "text": "So by treating like the ABCDE partially observable MDP that we see in the textbook and all this work, by treating that as fully observable, essentially to the proof finder, exactly, thank you, by treating the full state updating of the POMDP, now that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.074,
    "end": 2998.502,
    "text": " bottom-up semantics of those variables might be the probability that this happens or the probability that this maps to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2999.182,
    "end": 3016.44,
    "text": "So still it is about partial observability, but then considering that object in its fully observable condition to itself, then you can see that no-regret situation where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3017.011,
    "end": 3042.546,
    "text": " there's no policy advantage and one's own sense making didn't have a disadvantage and an expert evaluating one's sense making didn't have a disadvantage so in those situations the learner's heuristic is zero regret on the policy and on the sense making side",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.779,
    "end": 3068.145,
    "text": " and then there's a kind of imperative which is the distance from the expert sense making and policy selection because it's basically like what would have been the expert policy and sense making if it would have been fully observable and then the POMDP reduces to an MDP",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.403,
    "end": 3073.786,
    "text": " Yeah, that's precisely the strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.306,
    "end": 3083.435,
    "text": "So planning in POMDPs can be turned into planning in MDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.455,
    "end": 3085.817,
    "text": "It's just a much more difficult MDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3086.037,
    "end": 3098.368,
    "text": "You don't get away with any of the difficulty of planning in a belief MDP because now the state space essentially has",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.5,
    "end": 3122.449,
    "text": " countably infinite cardinality which means that there's no way for you to compactly represent your beliefs over multiple steps or your value functions so it doesn't make any of that or any practical applications simpler but it does offer a very nice theoretic technique",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.429,
    "end": 3132.388,
    "text": " to better understand the different kinds of tweaks you can do to the base optimal policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.14,
    "end": 3157.836,
    "text": " cool and and then another connection is with the dual mode switching so in like chapter five of the textbook in their neuroanatomy they show one schema of how dopamine level regulates sort of a system one system two thinking fast thinking slow shift in the thinking fast mode",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3159.2,
    "end": 3187.654,
    "text": " observations expected or otherwise don't even need to be considered you can just sample directly from the policy prior from habit and then even to engage expected free energy use g to update the policy prior into a policy posterior so evening even to consider possible future actions and observations that's a deliberative mode",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.921,
    "end": 3195.012,
    "text": " It's dealing with intangibles and doing computations that where habit will suffice can just be done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.713,
    "end": 3208.073,
    "text": "So then by proxy, you can use the observation entropy and just say, if the observations are within this acceptable threshold, there's no reason to step outside of habit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3208.34,
    "end": 3222.601,
    "text": " And then where observations start to become surprising in this way, then a deliberative execution per policy can happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.621,
    "end": 3234.178,
    "text": "Yeah, so I think this is very interesting, like so mode switching or like self",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.985,
    "end": 3253.382,
    "text": " um essentially self selection of how much compute resources you put into at at test time or at runtime um is a very interesting topic i know alec has done some work on um like once you amortize a pulse you can still choose to refine your policies on on online",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.953,
    "end": 3281.547,
    "text": " uh and so on and so forth and and it also makes a nice connection between what's happening with like large language models nowadays you have like so-called like post training you can do a lot of stuff so for example in what's called best of n sampling where you sample a ton of uh outputs from the policy and then you use a reward function of score which one um is better and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.033,
    "end": 3296.565,
    "text": " choose the output that instead of all the other completions that you have sampled and then basically the more completions you sample the more likely you'll get a completion that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.748,
    "end": 3326.198,
    "text": " going to be scored higher by the test time reward function and then you can basically decide okay what what's the trade-off i'm going to make between my test time compute that's been used to do a ton of sampling which is very expensive versus um versus the the potential improve improvement in reward that i'm going to get so this this is very interesting um but i i don't think um like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.836,
    "end": 3343.636,
    "text": " in the active inference community, people have done enough principled work or come up with a principled framework to allow an agent to dynamically adjust their computational resource and time on the fly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.756,
    "end": 3353.147,
    "text": "So I would actually encourage, and also I don't really understand it myself, so I would encourage people to do more work along this direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3353.127,
    "end": 3362.336,
    "text": " to figure out what is the generative model that allow people to do test time adaptation of compute resources and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.138,
    "end": 3365.559,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3365.999,
    "end": 3369.863,
    "text": "Yeah, that's very interesting and gets into system design.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.063,
    "end": 3378.671,
    "text": "Is it the agent that's estimating how much resources would be useful for it, or is there an estimator that's making a secondary judgment?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.352,
    "end": 3381.514,
    "text": "I'll read a question from the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.152,
    "end": 3384.718,
    "text": " Sriharsha wrote, thanks for the talk, Ran.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3385.299,
    "end": 3395.942,
    "text": "In your expertise from an engineering perspective, what are your comments on building a deep active inference agent versus a deep RL agent like Dreamer?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3398.707,
    "end": 3406.899,
    "text": " Yeah, so I think the word deep sometimes means different things in different communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3408.942,
    "end": 3424.866,
    "text": "So early in the day, deep active inference used to mean using deep networks to approximate certain distributions or amortize certain distributions in active inference agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.605,
    "end": 3430.574,
    "text": " I think over the years, the meaning of deep has shifted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.614,
    "end": 3437.127,
    "text": "So now I think within the active inference community, deep means having multiple levels of hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.149,
    "end": 3441.555,
    "text": "Sometimes it also means planning along",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.312,
    "end": 3445.819,
    "text": " a longer temporal depth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3447.462,
    "end": 3453.874,
    "text": "So I think being hierarchical is actually pretty difficult.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.235,
    "end": 3463.392,
    "text": "Again, I don't know of a very nicely principled and still",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3463.979,
    "end": 3476.524,
    "text": " working way to make agents hierarchically deep and also its first principle in the sense that it can be automatically discovered from data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.724,
    "end": 3481.313,
    "text": "I've tried to do some work, but I haven't found a way in which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.664,
    "end": 3501.445,
    "text": " hierarchy doesn't collapse usually what i found is hierarchies tend to collapse and things actually like anything that you can portray as hierarchical can also be represented in a flat way so i would again encourage people to do more work in that direction",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.425,
    "end": 3514.34,
    "text": " but in terms of just comparing the various tools and also way to hybrid active inference with neural nets that people have done versus agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3514.721,
    "end": 3516.666,
    "text": "So I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3517.557,
    "end": 3538.232,
    "text": " basically a lot of people's view of dreamer versus you know deep active inference that many people have implemented is that dreamer is so similar to active inference especially i i can't remember if which version of dreamer uh and if it does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.212,
    "end": 3560.811,
    "text": " um use an information gain term in a planning objective and if it does then you basically cannot tell whether there's any difference between dreamer and deep active inference um so so in a sense even carl has mentioned sometimes that dreamer is basically like some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.875,
    "end": 3573.94,
    "text": " variations of an active inference agent i would i would point but i would still point out that there's one aspect of dreamer which uh makes it a little bit um uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.122,
    "end": 3592.333,
    "text": " theoretically suboptimal, but it might work well in practice because of that suboptimality, is that Dreamer doesn't perform belief-based planning as most deep RL systems don't perform belief-based planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.313,
    "end": 3612.297,
    "text": " uh they perform state space planning because if you look at the policy architecture of dreamer the policy is not conditioned on a representation of belief is conditioned on a single or multiple particles sample from the posterior so that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.648,
    "end": 3623.424,
    "text": " In theory, it would lead to a slightly different exploration behavior, but I'm not sure how that actually behaves and the difference it makes in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.444,
    "end": 3638.366,
    "text": "So if you're interested in that and if you want to make a deep RL agent, actually do belief-based planning, which I personally have some interest in, I would encourage you to look at some of the work from Shimon Whiteson's lab from Oxford.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.127,
    "end": 3640.309,
    "text": "They have done a lot of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.065,
    "end": 3644.649,
    "text": " belief-based planning of deep RL agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.949,
    "end": 3656.562,
    "text": "So for people who, I think some people in the Institute might know this, there's an algorithm called Very Bad that the active influence folk has cited multiple times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3656.622,
    "end": 3659.746,
    "text": "So that essentially came out of Shimon Whiteson's lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.748,
    "end": 3670.498,
    "text": "And in that architecture, the agent's policy is conditioned on a belief representation as opposed to state representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.162,
    "end": 3683.357,
    "text": " awesome thank you yeah um a kind of short comment and thought on this theory and practice like you mentioned",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.438,
    "end": 3707.387,
    "text": " multiple namespaces that collide with deep active inference sometimes people are using neural network approximators sometimes that's called amortized inference and then there's sort of in terms of model depth people could be talking about hierarchical like hierarchical bayesian models they could also be talking about temporal depth so whether it's more layers of the cake",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3707.367,
    "end": 3731.637,
    "text": " on this time slice or whether it's however many layers the cake with more time slices and then you kind of brought in a twist with like however hierarchies can be flattened we see that all the time in matrix operations where sub matrices are used to flatten all kinds of things and then similarly in planning there can be a thicker presence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3731.617,
    "end": 3751.262,
    "text": " or habit and heuristics can be learned such that planning like behavior can be emulated with less depth so that's just so interesting like the fact that these formalisms can go and deep in space and time is really just like an initial",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.272,
    "end": 3779.14,
    "text": " surveying of spaces and just saying within the infinite policy horizon situation this and this and this will be the case and then it's a purely empirical engineering question whether a time horizon of one two three four five has what computational trade-offs and needs so it's just like so amazing how the math has already sketched out some of the dimensions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3779.474,
    "end": 3786.825,
    "text": " And then within the space of what is sketched out, it's an engineering question almost alone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3786.885,
    "end": 3797.702,
    "text": "And there's still theoretical differences to clarify this entangle, but even those alone don't map obviously to performance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3797.851,
    "end": 3817.632,
    "text": " adequacy or advantage in the real world or for any given data set so it's kind of like fun to research and discuss this underlying layer which gives rise to those engineering results at the same time though imagining that a certain graph or equation has a certain output on a certain data set is is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.303,
    "end": 3833.578,
    "text": " hopeful um and then also i think it connects to the low and the high road like with carl's mention about different architectures that recapitulate and get to their own syntheses and combinations of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3833.558,
    "end": 3861.22,
    "text": " what we call pragmatic and epistemic value or maybe what in the energy-based learning energy-based models that they might use more like you presented with the energy and entropy decomposition it's like those are constructions along the low road they are model architectures that get to this common Nexus of being able to have an imperative which unifies both epistemic and pragmatic value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3862.634,
    "end": 3869.422,
    "text": " The free energy principle coming from the high road, on the other hand, has no architectural suggestion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.323,
    "end": 3874.448,
    "text": "It's a partition in the mathematical physics state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3875.449,
    "end": 3892.388,
    "text": "And so it's unsurprising that there are models that are similar on through further to simplified low road constructions like POMDPs, because we're all talking about the same setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3893.043,
    "end": 3898.41,
    "text": " agent or interface input and output with pragmatic and epistemic component.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3899.371,
    "end": 3919.877,
    "text": "And so just interesting how all of those architectures, even though they might not be able to like make API calls to each other or like hot swap different components, they have comparability against the high road understanding of their belief updating for the next,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3920.65,
    "end": 3947.518,
    "text": " observation coming in and action going out in a fitness context yeah i don't have much comments on like high road stuff i personally um would label myself as a low road person that's that's awesome but both roads must be built",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.275,
    "end": 3964.41,
    "text": " yeah um i'll ask another question in the live chat and then we'll see if there's any final questions upcycle club wrote are there any potential benefits of implementing sparse coding techniques in this framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3966.938,
    "end": 3968.702,
    "text": " So I'm not super familiar with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.802,
    "end": 3974.375,
    "text": "I mean, let me Google that real quick because I do want to see if I can address that question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.575,
    "end": 3983.836,
    "text": "And I know about sparse coding and I know the connection between that and VAE stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.159,
    "end": 3986.702,
    "text": "So let me look that up real quick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.205,
    "end": 3995.111,
    "text": " Okay, so I'm looking at a tutorial on sparse coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.151,
    "end": 4003.244,
    "text": "It says that sparse coding is a class of unsupervised models for learning over complete representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4004.145,
    "end": 4019.389,
    "text": "Yeah, so I'm not sure if there's a way to interact with the viewer, but does that mean that you're trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.095,
    "end": 4041.124,
    "text": " um so basically learn more representations than what's sufficient uh in a way that's kind of similar to how people are training uh sparse auto encoders for interpreting language models nowadays i'm not sure that's uh maybe i should read on a little bit more to see what benefits it offered",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4042.825,
    "end": 4046.07,
    "text": " Yeah, I'll let you know if any other information comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4046.571,
    "end": 4060.532,
    "text": "It's an interesting connection between the matrix flattening and the sparse coding because sometimes when the matrices get flattened and fused together using the submatrix representations, then they have sparsity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4061.313,
    "end": 4069.626,
    "text": "And then that actually just from an engineering perspective enables sparse matrix methods and compression to be used.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4071.428,
    "end": 4091.696,
    "text": " So again, whether the hierarchical representation with a lower density or a sparser flattened representation for a given language, et cetera, has this or that performance, that's just an empirical question, but it's interesting that flattening gives you a constructed sparsity even for non-sparse information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4092.097,
    "end": 4100.288,
    "text": "And then there's the angle you mentioned about the interpretability sparsity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.96,
    "end": 4115.492,
    "text": " and methods to pull out fewer interpretable characteristics like for example um yeah yeah did the viewer respond there no but how about just um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4117.43,
    "end": 4121.456,
    "text": " Upcycle wrote, better handling of missing data would be one benefit I can think of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.777,
    "end": 4124.561,
    "text": "So maybe we'll research and learn 14.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.343,
    "end": 4131.431,
    "text": "What are your current research or development directions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.356,
    "end": 4144.551,
    "text": "So I'm interested in pursuing this view of principled planning and active inference a little more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.885,
    "end": 4164.463,
    "text": " So basically, the reason why I did the study and wrote this is that I was trying to understand if there's a way to develop better planning algorithms for agents and specifically believe space planning for agents in a more principled way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.983,
    "end": 4184.511,
    "text": " and uh and and initially i was doing some experiments um and then it occurred to me that and then doing experiments for uh beliefs-based planning of active inference agents and i realized that if i want to design better algorithms for active inference agents",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4184.677,
    "end": 4203.22,
    "text": " I actually need to have a very precise understanding of what the active inference agent is supposed to do in a way that's not susceptible to all the holes in the active inference theory currently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4203.24,
    "end": 4210.228,
    "text": "So this paper essentially contributes to filling up some of the holes in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4210.968,
    "end": 4219.561,
    "text": " in the theory of active inference agent planning, but just more like planning and approximate belief space planning in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.002,
    "end": 4240.232,
    "text": "So what I want to do as the next step for the stuff presented in this paper is to see if there are better ways to improve planning capabilities of active inference agents and belief space planning for agents in general, that my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.102,
    "end": 4268.059,
    "text": " depends on better you know leveraging tools from from variational inference for planning my leverage tools from temporal abstraction my leverage tool tools from essentially sparsity or sparsification or inducing more structures in a generative model um yeah but what i really want to do is just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4268.444,
    "end": 4284.308,
    "text": " make better planning algorithms for agents, planning algorithms that actually work, that doesn't require a lot of tuning, that you can just grab and run it, or any ideas you have in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4284.388,
    "end": 4294.063,
    "text": "You don't have to look for very specific tools on the internet and try it and realize it doesn't really work that well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.457,
    "end": 4297.218,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.238,
    "end": 4300.184,
    "text": "I'll ask one last question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.667,
    "end": 4313.368,
    "text": "In theory or in practice, how is planning for overt action embodied movement similar and different than planning for covert mental action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4314.833,
    "end": 4331.813,
    "text": " um yeah i don't quite understand this so i i know a recent paper um i think nor is part of the uh is one of the authors um i think it's in europe's where they propose the hierarchical um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4331.793,
    "end": 4353.126,
    "text": " model-based rl agent from uh like that somewhat inspired by active inference and then basically what they do there is to cast um action selection at the higher level of the hierarchy or rather well so basically casting that as covert action selection",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.275,
    "end": 4373.116,
    "text": " So this doesn't really, at least if you approach it from the view of action as interface between the agent and the environment, then in that sense, action always have to exist at the lowest level of the hierarchy, right at interface between the agent and the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.596,
    "end": 4382.826,
    "text": "So it will never be an overt action that exists at inside of the agent at the higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4383.16,
    "end": 4404.797,
    "text": " So that's part of the reason why I say that people should do more work on hierarchical models and hierarchical planning, because even though a lot of the existing techniques work, so for example, in hierarchical planning, we have the options framework from hierarchical RL.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.233,
    "end": 4425.925,
    "text": " so what that does is basically decompose planning at the planning of primitive actions at the lowest level to planning at the higher level over more extended periods of time so basically the higher level will say execute this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.905,
    "end": 4451.473,
    "text": " task which then gets translated to a sequence of lower level actions such as going to the kitchen grab coffee right that's a single movement at the higher level even though it's a bunch of lower level primitive movements so i think these um techniques people have been using in um hierarchical planning are very appealing and they actually work pretty well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.74,
    "end": 4459.049,
    "text": " And now with like using language models to do the option selection, they work very well in practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4459.089,
    "end": 4475.308,
    "text": "But in theory, I feel like there's still a gap of how hierarchical perception model arise automatically from the environment and how planning can just automatically be a part of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.929,
    "end": 4477.731,
    "text": "And then how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4478.335,
    "end": 4490.175,
    "text": " Um, you know, overt mental actions, um, you know, play a role after you have obtained, uh, or learned, uh, hierarchical representation of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.195,
    "end": 4492.72,
    "text": "So all of these, in my opinion, are open questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.88,
    "end": 4497.147,
    "text": "I don't think, I think people need to continue to address them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.227,
    "end": 4501.795,
    "text": "I don't think people have addressed them to a satisfactory extent at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.718,
    "end": 4504.039,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.572,
    "end": 4513.422,
    "text": " right thank you this was a great stream so until next time yeah awesome thanks for yeah",
    "speaker": "SPEAKER_01"
  }
]