[
  {
    "start": 7.102,
    "end": 22.849,
    "text": " all right it's december 26 2024 this is daniel friedman it's active inference stream 009.1 how to accelerate active inference mountain car in rxinfer.jl",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.829,
    "end": 27.397,
    "text": " and hope everyone is having a good end of year season.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.259,
    "end": 33.808,
    "text": "Looking forward to different updates, different live chats, see what happens along the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.828,
    "end": 38.076,
    "text": "I'll start the stream off with making a GitHub push.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.689,
    "end": 47.352,
    "text": "All right, while that's happening,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.77,
    "end": 49.432,
    "text": " I'm going to head over into Cursor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 49.893,
    "end": 73.124,
    "text": "This is what we're going to be exploring, covering today, which is modifying an RxInfer package example made by the developers and moving it from a notebook format into a script format, adding some more visualizations and analyses, and then doing a setup script, hopefully to make it easier to get it going on your computer, and meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.325,
    "end": 75.027,
    "text": "And right now there's a big",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.007,
    "end": 104.288,
    "text": " meta analysis happening but we'll look at some past runs that finished just a few seconds ago okay so check the github this is uh based on the current version 3.8 of reactive base rx inferred.jl and just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.394,
    "end": 117.874,
    "text": " to keep it separate and clear made a fork or a branch from the exact version today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.934,
    "end": 126.529,
    "text": "And then put all of the work that I'm about to go into into this examples folder slash mountain car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.411,
    "end": 128.132,
    "text": "So it's a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.749,
    "end": 159.216,
    "text": " branch on Rx and for jail and in the video description are all the links okay so github push worked now to start another standalone and meta analysis so here's where i've gotten to after many speed bumps and and fun along the way this is in cursor right click open an integrated terminal first if you haven't",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.322,
    "end": 165.105,
    "text": " Run the script, Julia, setup.jl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.828,
    "end": 172.158,
    "text": " Probably also other settings will need to be bumped up against on different settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.219,
    "end": 180.951,
    "text": "Also, I brought it up, synced it to the current version just after building part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.332,
    "end": 182.974,
    "text": "So there's probably a lot of inefficiencies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.635,
    "end": 188.383,
    "text": "It's of course very cursor slash Claude-esque.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.404,
    "end": 193.911,
    "text": "So there could be a lot of redundancy, a lot of ways to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.308,
    "end": 202.394,
    "text": " But I'm going to run the setup script, then we'll look at the standalone and the meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.016,
    "end": 206.638,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.658,
    "end": 216.406,
    "text": "So this is, as mentioned, branches off of the RxInfer example Active Inference Mountain Club.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.169,
    "end": 220.269,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.289,
    "end": 225.113,
    "text": "Let's just briefly look at setup, see what's happening while it's finishing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.122,
    "end": 228.465,
    "text": " There could probably be a lot of sorting of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.268,
    "end": 232.511,
    "text": "Different packages are installed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.653,
    "end": 241.104,
    "text": "The rxinfer keystone package is installed from the local GitHub repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 241.124,
    "end": 246.212,
    "text": "So probably it would take some other different way to export functions in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 248.134,
    "end": 253.362,
    "text": "Calls probably some set of automatic dependency installations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.342,
    "end": 276.143,
    "text": " uh pre-existing explicit calls that I typed in like most recently this stats plots so definitely figure out what else could be changed to get this working on your own computer but at the end I hope it accurately says yes RX infers functional",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.266,
    "end": 280.91,
    "text": " some of the core packages that we need are loaded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.47,
    "end": 287.759,
    "text": "Here's the Julia version, project path, RxInferPath, and then how to run the scripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.481,
    "end": 291.644,
    "text": "And that can be probably developed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.704,
    "end": 293.146,
    "text": "Okay, so that's the setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.248,
    "end": 303.981,
    "text": "Then there's the standalone Julia Mountain Car standalone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.001,
    "end": 306.805,
    "text": "This one has today's date and the file name",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.932,
    "end": 328.489,
    "text": " just to give it a static version as a single file snapshot but the meta analysis is much more scattered across methods scripts so the single mountain car standalone has the date okay so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 331.928,
    "end": 348.992,
    "text": " let's look before we go into the code at how they set up and characterize the mountain car problem okay so it's written in this sort of notebook blog post multimedia style",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 350.626,
    "end": 351.728,
    "text": " Active Inference Mountain Car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.85,
    "end": 355.595,
    "text": "This is from the RxInferJL documentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.155,
    "end": 360.803,
    "text": "A group of friends is going to a camping site that is located on the biggest mountain in the Netherlands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 361.605,
    "end": 363.167,
    "text": "They use an electric car for the trip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 363.288,
    "end": 368.837,
    "text": "When they are almost there, the car's battery is almost empty and is therefore limiting the engine force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.599,
    "end": 374.347,
    "text": "Unfortunately, they are in the middle of a valley and don't have enough power to reach the camping site.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.367,
    "end": 375.148,
    "text": "Night is falling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.495,
    "end": 378.462,
    "text": " and they still need to reach the top of the mountain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.205,
    "end": 385.186,
    "text": "As rescuers, let us develop an active inference AI agent that can get them up the hill with limited engine power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.771,
    "end": 387.012,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.443,
    "end": 411.683,
    "text": " before we go into their technical details here's just a single perplexity prompt give an overview of the mountain car problem from control theory at four level slash types of depth plain archetypal ultra-technical and esoteric and also generated some images so we can generate some more images now or people can suggest other prompts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.502,
    "end": 414.464,
    "text": " So plain understanding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.066,
    "end": 418.995,
    "text": "The problem involves an underpowered car stuck in a valley between two hills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 419.596,
    "end": 424.788,
    "text": "The car's engine is too weak to climb directly up to the right hill to reach a goal flag.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.808,
    "end": 431.443,
    "text": "Instead, it must swing back and forth, building up momentum by driving up the opposite hill first until it gains enough energy to reach the target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.858,
    "end": 433.859,
    "text": " archetypal perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.661,
    "end": 439.648,
    "text": "This scenario exemplifies the fundamental principle that direct paths aren't always optimal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.349,
    "end": 450.143,
    "text": "The car must first move away from its goal, driving left to ultimately reach it on the right, a counterintuitive strategy that demonstrates how complex systems often require indirect approaches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 450.944,
    "end": 461.599,
    "text": "The problem has become a classic test case for reinforcement learning algorithms because it requires learning this non-obvious solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.663,
    "end": 480.803,
    "text": " the active inference approach that rx infer is going to implement doesn't have a trained reward or proposed reward function on some data set of successful or not successful traces it's going to be directly from the distributions okay technical analysis we'll see in more specifics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 483.078,
    "end": 485.781,
    "text": " getting into the scripts, and then I'll be the last one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.282,
    "end": 487.463,
    "text": "Esoteric implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 488.104,
    "end": 494.191,
    "text": "The mountain car problem transcends its mechanical nature to represent a metaphor for optimization in complex landscapes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.752,
    "end": 508.208,
    "text": "The system demonstrates the necessity of building potential energy through oscillatory behavior, the interplay between kinetic and potential energy transformations, the emergence of sophisticated behavior from simple physical rules,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.188,
    "end": 512.577,
    "text": " The relationship between local optima valley and global optima goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.058,
    "end": 522.577,
    "text": "The problems enduring relevance stems from its ability to challenge both traditional control methods and modern machine learning approaches while maintaining mathematical elegance and its simplicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 525.102,
    "end": 525.302,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 528.286,
    "end": 547.126,
    "text": " So the goal for this stream, and then we'll look more at the specifics of the mountain car and the code itself, to learn about RxInfer, hopefully correctly, or at least helpfully implement one useful experiment to learn about Julia and all these different tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.207,
    "end": 553.433,
    "text": "And shout out to Andrew for the early Julia adoption and insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.75,
    "end": 571.05,
    "text": " um here is using cursor 44.8 rx infer 3.8 or two julia 1.1 1.2 and then for the llm in cursor cloud 3.5 sonnet 2024 10 22. all right",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.612,
    "end": 578.717,
    "text": " Here's the finished single standalone that we ran, started during the stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 580.139,
    "end": 589.028,
    "text": "It is gonna implement two different simulations with the same physics and two different approaches to strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 589.428,
    "end": 593.132,
    "text": "First is going to be the naive approach, which always pushes to the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.913,
    "end": 597.997,
    "text": "And then the second is going to be this active inference approach with a given look ahead period.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 599.038,
    "end": 602.522,
    "text": "And this script goes into the outputs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.502,
    "end": 604.144,
    "text": " So here's the new one in green.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.805,
    "end": 613.516,
    "text": "Here are the outputs of the single simulation, and this will give an intuition for what the single standalone does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.776,
    "end": 615.078,
    "text": "First comparison doc if.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.759,
    "end": 623.329,
    "text": "So here the single parameter combination that is used was chosen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.409,
    "end": 629.016,
    "text": "It's, I think, similar or proportional or the same to what was used in the original example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.413,
    "end": 650.7,
    "text": " notebook and there's two different dots representing the car's position simulation on this landscape and we'll look at how physics is given on this landscape so the rules of physics are specified and the elevation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.68,
    "end": 667.525,
    "text": " and the potential and the kinetic energies are calculated in a sort of basic physics simulation style not simply modifying some attribute of the direct landscape function itself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.505,
    "end": 682.611,
    "text": " and they both start at negative 0.5 and they're both trying to get to positive 0.5 the colors will change i think throughout but naive control is red and it drives right and it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.591,
    "end": 708.43,
    "text": " oscillates a little bit but reaches a fixed point where the friction and the gravity are equivalent to the engine's limiting force and that reaches this stable point the blue active inference agent has this anticipatory simulated trace and I think it's definitely worthy of another long investigation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.102,
    "end": 731.194,
    "text": " how does it distributionally fit this policy anticipation and what is the computational complexity as we scale the time horizon and inference but we can see that with this preference for being higher up the active inference agent can see that it can get higher up",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 731.174,
    "end": 734.22,
    "text": " to the left than it is on the right by moving that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.602,
    "end": 742.996,
    "text": "And that from already being up on the right slope and oscillate its way to the goal position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 743.997,
    "end": 753.655,
    "text": "And you can imagine that that there's going to be combinations of physics and engine force and goal position that are easily or impossible to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 753.635,
    "end": 773.027,
    "text": " right going through the rest of the images in this single case output but first going to start the oh let's just go through all these first okay so this is the action distribution the naive control has is always picking that one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.205,
    "end": 795.522,
    "text": " value to go right with one whereas the active inference now it's in tan it or red has at least i don't know if i'm perfectly implementing what the notebook does but at least it does have some policy variance and it one that for this parameter combination does get it up to the goal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 795.502,
    "end": 812.548,
    "text": " action comparison so there's another way to look at that this is the naive control with now in blue with the y equals one policy function output active inference agent having this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.528,
    "end": 830.487,
    "text": " more back and forth control policy swinging between two and negative two i'm not sure what this if this is scaled to a different number but none of this is meant to say that this is the best fit it's really just a first step towards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.467,
    "end": 846.966,
    "text": " figuring out what kinds of tools and interfaces for generative models and for RxInfer can we use to start doing some useful parameter sweeps across different regions of parameter space and structure models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.647,
    "end": 850.11,
    "text": "Okay, these are state action maps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.852,
    "end": 858.6,
    "text": "So here's position on the x axis, velocity on the y axis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.086,
    "end": 887.929,
    "text": " there's another one that makes sense yeah so here's here's the trace of the naive noun blue and active inference showing these different trajectories they start out with zero velocity at negative 0.5 here's a version where the vectors are added the naive control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.816,
    "end": 914.338,
    "text": " follows this blue spiral to its fixed point attractor the active inference agent has this oscillatory behavior reflected with a loop not just a spiral that ends up reaching a higher net position via increased velocity which is what it needs to get up the hill here's the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 914.605,
    "end": 920.785,
    "text": " predictive element of the active inference agent here's velocity distribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.621,
    "end": 932.575,
    "text": " there's a wider range of velocities ranging from the negative to the positive further in the active inference agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.837,
    "end": 935.239,
    "text": "Energy comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.82,
    "end": 938.023,
    "text": "This is not like variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.624,
    "end": 946.175,
    "text": "This is the kinetic minus the potential or kinetic and the potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.195,
    "end": 951.042,
    "text": "So we can look at this calculation though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.022,
    "end": 960.66,
    "text": " And energy efficiency, I think, is the integral or something of this, but I'm not exactly sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.113,
    "end": 990.546,
    "text": " okay so this state action map is showing that trajectory and then mapping overlay with which action was taken so starting here 2.0 was used that's moving to the right and then abruptly the policy switches to negative 2.0 then policy switches here and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.724,
    "end": 1011.572,
    "text": " the position is approached and i i think that's an interesting question like to what extent does it have inertia to meet the goal or does it engage in a sort of xenos paradox slowing down as it converges if it has the engine control",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.552,
    "end": 1041.559,
    "text": " it has to be kind of like a run past the finish line situation at least in terms of the explicit preference distribution otherwise you you get sort of slowing behavior leading up to the goal i don't know that could just be a total artifact of this hill okay that's the that's the uh single",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1042.99,
    "end": 1055.903,
    "text": " standalone output okay now config.toml is going to specify a meta analysis suite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.148,
    "end": 1059.571,
    "text": " So here's what it's going to look like here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.832,
    "end": 1062.515,
    "text": "It was 200 simulations of 200 times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1062.555,
    "end": 1065.579,
    "text": "Definitely interesting to profile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.699,
    "end": 1068.643,
    "text": "How much is the startup time for one app model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.703,
    "end": 1074.091,
    "text": "And then is there any other further caching?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.232,
    "end": 1082.041,
    "text": "Because starting the first one seems to take longer as the sort of RX and firm machinery comes online, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.121,
    "end": 1084.004,
    "text": "But we'll look at the code this too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1084.024,
    "end": 1084.945,
    "text": "It should be interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1085.515,
    "end": 1093.863,
    "text": " And again, it's all just initial takes for hopefully people and others to improve on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.883,
    "end": 1098.487,
    "text": "So here's the config.tala meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1099.108,
    "end": 1104.793,
    "text": "So there's two knobs in this parameter grid sweep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.813,
    "end": 1111.239,
    "text": "The force limit of the engine and the friction coefficient of the landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.7,
    "end": 1114.122,
    "text": "The gravity constant is kept constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1115.975,
    "end": 1122.644,
    "text": " For each of the engine force and the friction coefficient, you give a minimum and a maximum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.285,
    "end": 1127.29,
    "text": "So I think the one that just ran, maybe it was this one, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.654,
    "end": 1132.617,
    "text": "Let's see, 717.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.024,
    "end": 1138.865,
    "text": "We'll just run a clean one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.527,
    "end": 1143.471,
    "text": "So minimum and maximum force and friction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.012,
    "end": 1145.914,
    "text": "Let's do a higher resolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.649,
    "end": 1154.918,
    "text": " 1 to 27.01 to 27.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.619,
    "end": 1164.71,
    "text": "So this is going to do 15 times 15 multiplied by the number of episodes per parameter combination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.79,
    "end": 1167.473,
    "text": "So that can be used for technical replicates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.995,
    "end": 1173.941,
    "text": "So then that parameter combination, we can understand the variance profile of it too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.322,
    "end": 1175.563,
    "text": "I'll set that to two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.742,
    "end": 1178.345,
    "text": " Maximum steps per episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.927,
    "end": 1180.849,
    "text": "Let's leave it at 100.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1181.69,
    "end": 1182.431,
    "text": "Planning horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.633,
    "end": 1184.555,
    "text": "Leave it at 40.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.04,
    "end": 1189.222,
    "text": "Initial position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.446,
    "end": 1193.829,
    "text": "This is also position and velocity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.41,
    "end": 1197.956,
    "text": "Third would be acceleration, etc, etc, etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.996,
    "end": 1199.679,
    "text": "Snap, crackle, pop, all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.882,
    "end": 1202.884,
    "text": "Div, grad, curl.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1204.18,
    "end": 1209.417,
    "text": " Target state is the position and velocity preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1210.259,
    "end": 1215.777,
    "text": "So think again, interesting to see are those convergent or does inertia carry",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.647,
    "end": 1242.709,
    "text": " some plotting here kind of as an experiment kind of as a bit of a local coding optima uh some of the plots are are in ascii plain text and then some output so 1515 so that was just a sort of recap run setup.jl confirm that rx infer works then run",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.313,
    "end": 1273.438,
    "text": " just the standalone mountain car standalone 12.624 and that will do the simulation we did that close that window this is another standalone now clearing now we're going to run the meta analysis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1276.608,
    "end": 1278.149,
    "text": " So hopefully this will work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.795,
    "end": 1290.72,
    "text": "Meanwhile, let us explore the CodeVis briefly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.863,
    "end": 1294.484,
    "text": "Visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.027,
    "end": 1299.468,
    "text": "So not sure if this is accurate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.508,
    "end": 1305.113,
    "text": "This is a TBD with RxInfer experts, but here the prompt for this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.506,
    "end": 1319.344,
    "text": " graphical visualization was... I'll modify the prompt just so we have three free flows left for this out of five.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.524,
    "end": 1320.866,
    "text": "Here's the meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.968,
    "end": 1322.649,
    "text": "Let's close that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.61,
    "end": 1326.595,
    "text": "Meta analysis plugging away on the terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.075,
    "end": 1329.719,
    "text": "We'll see if it has to be D or rebugged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.441,
    "end": 1336.77,
    "text": "And then we'll do a graph is free version on this flow visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.252,
    "end": 1360.648,
    "text": " emphasize the component of active inference and the free energy principle okay looks like we passed the first phase so this loaded the configuration toml set up the parameter batch",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.092,
    "end": 1390.247,
    "text": " objects plus methods so now we'll see how the simulations go um the first part i think takes longer and then the second it hits a second rate i'm not sure which i think might maybe does the all the active inference ones then all the naive and the so we'll see how long it takes to click to n percent and then see how long it takes to finish okay meanwhile",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.775,
    "end": 1394.157,
    "text": " Here was the graphics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.025,
    "end": 1418.867,
    "text": "So the prompt was, again, I hope slash don't know, this is accurate, would be really interested to explore how we could develop these methods and get some, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1419.1,
    "end": 1425.706,
    "text": " stable versioning if these are accurate, and use them for learning RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.726,
    "end": 1438.618,
    "text": "So, trace how a probabilistic model specification transforms from at-model macro definition through node creation to final compiled graph structure, including node contraction optimizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.359,
    "end": 1441.861,
    "text": "Emphasize the component of active inference in the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1442.422,
    "end": 1445.344,
    "text": "Not sure it's going to matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.364,
    "end": 1445.985,
    "text": "So, here is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.378,
    "end": 1451.562,
    "text": " ostensibly looking through parts of this package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.484,
    "end": 1457.05,
    "text": "Not sure how much of a rocket and all these other pieces are in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.09,
    "end": 1461.296,
    "text": "But you know, here's some references in the code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.318,
    "end": 1465.001,
    "text": "Again, I'm working in the Rx infer branch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.945,
    "end": 1471.23,
    "text": "So here it does find a place in the documents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1474.855,
    "end": 1481.044,
    "text": " So the app model macro is passed to Graph PPL package.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.069,
    "end": 1486.071,
    "text": "Here's a section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1486.251,
    "end": 1501.352,
    "text": "This is kind of like using cursor slash codeviz as a RAG for code and docs facilitated because the RxInfer documentation is on their GitHub as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.428,
    "end": 1510.693,
    "text": " So then let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.776,
    "end": 1522.107,
    "text": "At model macro definition uses graph PPL and that gets customized by reactive message passing graph PPL backend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1523.629,
    "end": 1525.09,
    "text": "Okay, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1527.994,
    "end": 1529.095,
    "text": "Transformation pipeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.335,
    "end": 1541.607,
    "text": " compose simple operators, folds mathematical expressions, and adds brackets to ensure correct argument handling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.148,
    "end": 1550.263,
    "text": "So the app model parameters and syntax get kind of unpacked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1554.832,
    "end": 1558.018,
    "text": "Inject tilde right-hand side aliases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1563.466,
    "end": 1590.148,
    "text": " that creates nodes and variables based on model specification from the nodes so this is the statistical phase graph i guess interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1591.512,
    "end": 1601.747,
    "text": " Although some nodes in RxInfer.jl already come with their own meta structure, users have the flexibility to define different meta structures for those nodes and also for custom ones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.33,
    "end": 1607.495,
    "text": "A meta structure is created by using the struct statement in Julia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.259,
    "end": 1610.359,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.379,
    "end": 1615.045,
    "text": "That is converted to a factor graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.065,
    "end": 1616.187,
    "text": "That's sort of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.871,
    "end": 1643.895,
    "text": " post 2017-ish work with Bert de Vries, Friston, Parr here's the free energy optimization component okay so the factor graph construction I guess whether in the scheduled Forney classic non-reactive style or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.462,
    "end": 1651.57,
    "text": " ostensibly, but not necessarily in the RxInfer reactive message passing setting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.912,
    "end": 1657.018,
    "text": "Probably the message passing can be scheduled or reactive differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1658.46,
    "end": 1659.822,
    "text": "Here's variational free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1666.311,
    "end": 1673.14,
    "text": "Variational free energy then defines a functional objective that includes the model and a variational distribution over the latent variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.862,
    "end": 1689.525,
    "text": " not sure if this is going to always be the case for any graph or how how that um comes to be for a given factor graph but these are just questions to to learn from explore and then here's a specific",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.8,
    "end": 1693.262,
    "text": " Bet free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.403,
    "end": 1699.072,
    "text": "I know Dave told me it was one way or the other, but probably I said the wrong one, but the Bethe approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.074,
    "end": 1700.715,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.755,
    "end": 1707.767,
    "text": "Meanwhile, 21% done with this 225 times something meta-analysis sweep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.802,
    "end": 1716.188,
    "text": " The BFE can be iteratively optimized for each individual variational distribution in turn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1717.33,
    "end": 1722.395,
    "text": "Optimization of the BFE is thus more manageable than direct optimization of the VFE.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.659,
    "end": 1734.97,
    "text": "So they use also these methods that in the Oryx Infer Group this year, we kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.785,
    "end": 1741.335,
    "text": " talked about as the what are they called?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.375,
    "end": 1747.272,
    "text": "The six functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.137,
    "end": 1769.648,
    "text": " so they are a convention which provides interpretability and structuring for aurix infer action perception loops by using a canonical set of methods so that and thanks to many of the participants throughout this year in getting the documentation doing all these experiments too",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.248,
    "end": 1776.82,
    "text": " So I don't know how accurately I've implemented it, but here's what we had and there's different ways to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.101,
    "end": 1789.527,
    "text": "So in the structured, scheduled, single time step, every node, one time step, factor graph, logistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1790.857,
    "end": 1792.741,
    "text": " It's not reactive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.781,
    "end": 1797.892,
    "text": "It's like moving the whole simulation ahead one click.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.753,
    "end": 1811.059,
    "text": "What I understand of with the reactive message passing situation is that it brings some computational reactive methods to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1811.14,
    "end": 1838.818,
    "text": " the local variant of a free energy the Beth free energy that enable variational inference to be done in a in a flexible and effective way okay node contraction oh the six functions so once into the reactive setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1840.047,
    "end": 1848.255,
    "text": " Whereas in the scheduled version, it was just iterate through this list of operations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.916,
    "end": 1851.498,
    "text": "Let's do a devrise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.247,
    "end": 1866.673,
    "text": "This is Graphical Brain, Belief Propagation and Active Inference, Frist and Par, devrise 2017.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.634,
    "end": 1869.295,
    "text": "Figure 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1870.895,
    "end": 1894.067,
    "text": " showing how one time step updating of the POMDP graph up here translates to these analytical updates occurring in this scheduled order on this Forney graph which is a transformation of kind of nodes into edges and vice versa",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1894.047,
    "end": 1916.308,
    "text": " between the Bayes and the Forney graph and there's also recent other papers and live streams and such but this 2017 is just laying out the relationship between the single time step of Bayesian updating and the update rules that can be scheduled on that Forney graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1916.39,
    "end": 1941.773,
    "text": " then reactive moved that into a much more general situation where different processes can be playing out with different logics and speeds so there could be like one sensor at 100 hertz and one at one hertz and you're neither sampling too much or too little however then there's this question of okay well we're going to specify the app model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1943.153,
    "end": 1971.844,
    "text": " using the rx infer at model syntax looking like this here's transition function modeling transition due to gravity and friction so updating position and velocity given the physics the structure of affordance or policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.123,
    "end": 1974.526,
    "text": " in action space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.654,
    "end": 1981.24,
    "text": "Inverse engine force, not sure why it needs to be defined here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.163,
    "end": 1987.352,
    "text": "This is I hope just putting out some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.463,
    "end": 2004.092,
    "text": " stabs and pheromone trails in into the dark for people to clarify perform techno invective make it clearer make other documentation all these kinds of things i'm and i'm not sure if i've completely perfectly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2004.595,
    "end": 2023.009,
    "text": " mapped it into the script form but from this example this is the proper reference version the app model function for the agent type like mountain car is defined like in this generative model specification",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2022.989,
    "end": 2045.554,
    "text": " language where for time steps during the time steps of the simulation there's a direct distributional updating occurring so that just defines all of the updates to occur one could imagine that that doing the order differently",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.525,
    "end": 2068.842,
    "text": " would matter so maybe it could be as simple as just these happening but the order could matter and you might not want the order to matter in exactly the same um order as the code are lined but rather to take this um all at once representation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2069.733,
    "end": 2083.256,
    "text": " And then further, just from a package perspective, it's desired to have more of a flexibility with how you call the statistical distribution so that, again, those different logics can be hooked up to what is called.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.717,
    "end": 2093.614,
    "text": "Otherwise, if it's only this expressive and none of those further steps were taken, then this could just do something as simple as iterate through in this order.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.594,
    "end": 2119.534,
    "text": " but then to put in logics well like actually do this one twice as fast or something like that it would be needing the kind of rewrite that would result in some of these steps um so technically the agent here goes to three phases act execute observe that's one step infer and slide kind of like act and first serve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.543,
    "end": 2121.706,
    "text": " Act, execute, observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.367,
    "end": 2129.162,
    "text": "In this step, the agent performs an action onto the environment at time t and gets an observation in exchange.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.904,
    "end": 2136.198,
    "text": "These observations are basically the prediction of the agent on how the environment evolves over the next t time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.218,
    "end": 2138.704,
    "text": "So, act and get an updated observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.477,
    "end": 2169.484,
    "text": " position momentum infer after receiving observations the agent starts updating its internal probabilistic model by doing inference it finds the posterior distributions over the state and the control distributions three slide after updating its internal belief the agent moves to the next time step and uses the inferred action from the previous time step to interact with the environment and that is where you pick back up with one so this is the kind of ooda toe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2169.464,
    "end": 2188.637,
    "text": " inactive etc and these steps are kind of like mid-level functions um explored on this page here with six where there's a future",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.035,
    "end": 2217.662,
    "text": " or here it says the act and some of this might be from the earlier slightly different version it's just all sort of directionally in the ballpark that that because the graph doesn't have this intrinsic scheduling to it then and and you can have so much flexibility with a custom scheduling um custom nodes message rules all that kind of stuff that um you need to bring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.642,
    "end": 2234.757,
    "text": " how the graph is called and updated and operated more explicitly so that's a good thing it's just that it's still slightly evolving with many of the package semantics and examples and norms",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.737,
    "end": 2260.963,
    "text": " and there's probably many patterns to explore and not necessarily some sequence or repertoire of these mid-level possibly semantic or sub-agentic like steps that give a lot of nuance with describing is it O O D A or is it A D O O or is it O O D O O D O O D",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.609,
    "end": 2271.756,
    "text": " Okay, coming back to CL simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.657,
    "end": 2274.961,
    "text": "Okay, 52% done on the meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.602,
    "end": 2277.886,
    "text": "So that was, um, that was the code viz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.946,
    "end": 2279.408,
    "text": "Let's do another code viz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.974,
    "end": 2292.469,
    "text": "Help us totally understand how the standalone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.959,
    "end": 2297.581,
    "text": " Mountain car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.509,
    "end": 2303.37,
    "text": "Let's just see if this works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.455,
    "end": 2320.676,
    "text": "Help us totally understand how the standalone mountain car script calls every minute, particular, and etc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.276,
    "end": 2322.338,
    "text": "Please, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2328.865,
    "end": 2329.746,
    "text": " 55% done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.133,
    "end": 2336.734,
    "text": "Reindex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2342.981,
    "end": 2352.331,
    "text": "Then we'll look, we'll see this code biz, and then we'll look at the output of the meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.152,
    "end": 2353.493,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2354.434,
    "end": 2357.337,
    "text": "But briefly, just to look over what they get to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.7,
    "end": 2383.932,
    "text": " so they just they describe the analytical process formalization for the mountain so again it's not a proposed reward or utility function or anything trained on data it's just a distribution that's physics grounded using just simply a gravitational force on the hill landscape depending on the position",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.912,
    "end": 2398.474,
    "text": " And that's implemented also using possibly some special characters and some special Julia syntax that will take some learning and some package specific syntax.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.315,
    "end": 2411.674,
    "text": "So to be learned and better understood, but here's where they lie out the functions that create physics and create world and the sort of world generative process element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.168,
    "end": 2419.536,
    "text": " They have a static image just to confirm that they've initialized everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.578,
    "end": 2422.1,
    "text": "Here's the naive approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2424.764,
    "end": 2426.748,
    "text": "This is the naive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2427.489,
    "end": 2433.598,
    "text": "I think I have implemented it slightly differently with just having it all output a one each time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.279,
    "end": 2436.042,
    "text": "Maybe they're pre-filling it as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.405,
    "end": 2459.802,
    "text": " and then here's the visualization of just the naive policy having that initial ramp up then fixed point here's the active inference generative model okay and we'll wait",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2461.132,
    "end": 2463.879,
    "text": " Now let's help them solve the problem with an active inference approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.32,
    "end": 2471.237,
    "text": "Particularly, we create an agent that predicts the future card position as well as the best possible actions in a probabilistic manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.978,
    "end": 2474.043,
    "text": "So not from data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.048,
    "end": 2477.993,
    "text": "Not from datasets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2478.192,
    "end": 2485.358,
    "text": " We start by specifying a probabilistic model for the agent that describes the agent's internal beliefs over the external dynamics over the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.699,
    "end": 2487.881,
    "text": "The generative model is defined as follows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.242,
    "end": 2499.891,
    "text": "So here are the equations and in the GitHub for basically the variables in the Bayes graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.432,
    "end": 2506.157,
    "text": "And I would look forward to using some of these new visualization methods",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.137,
    "end": 2521.999,
    "text": " to visualize the factors and the app model from the notebook, visualize the standalone and the meta-analysis to confirm that the model's being analyzed correctly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.039,
    "end": 2523.361,
    "text": "Okay, now let's look at standalone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.182,
    "end": 2528.748,
    "text": "Well, let's just finish with what they have in the documentary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.169,
    "end": 2533.495,
    "text": "Here's the variables as defined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.774,
    "end": 2538.659,
    "text": " Here's the key RxInfer at model macro.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.481,
    "end": 2548.272,
    "text": "At model macro and meta blocks are used to define the probabilistic model and the approximation methods for the nonlinear state transition functions, respectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.233,
    "end": 2553.518,
    "text": "In addition, the beliefs over the future states up to t steps ahead of the agent is included.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.239,
    "end": 2564.072,
    "text": "So this is like the agent class equivalent, which we looked at briefly before, defined as those distributions over those variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2565.841,
    "end": 2591.933,
    "text": " after specifying the generative model let's create an active inference agent for the car technically the agent goes through three phases so here again are those mid-level semantic bundles of sort of distributional updating cognitive sub-agentic process etc that are being projected into this three cycle act execute observe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.913,
    "end": 2617.6,
    "text": " infer slide but that's again as far as I understood from Cobus and others and and learning this year that's just a convention and other orders or other kinds of um you know that could be a good place to play with this simulation um and again to confirm through the flow of the simulation with the code viz",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2619.065,
    "end": 2631.083,
    "text": " how the notebook, the standalone, and the meta analysis might be correctly or incorrectly applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.103,
    "end": 2636.792,
    "text": "So in the cell below, we create the agent through the create agent function, which includes compute, act, slide, and future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2636.872,
    "end": 2640.077,
    "text": "So here's future, but it wasn't mentioned above.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2644.428,
    "end": 2663.77,
    "text": " here is where the reactive message passing component is called not exactly sure what they mean about the message so again just a learning artifact dude try to understand",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.387,
    "end": 2682.75,
    "text": " the extremely interesting potential and directions we can go with the kind of flexibility that we have with RxInfer and how cool their direction and vision for the open source element is too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.77,
    "end": 2685.294,
    "text": "So here's the create agents method.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2686.615,
    "end": 2688.398,
    "text": "Now it's time to see, remember?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2689.699,
    "end": 2693.925,
    "text": "Now it's time to see if we can help our friends arrive at the camping site by midnight, question mark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.28,
    "end": 2703.387,
    "text": " Here is the Julia syntax.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.227,
    "end": 2720.605,
    "text": "There's a combination of initialization methods, parameterization, agent creation, further parameter specification, step through experimental protocol.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.42,
    "end": 2749.36,
    "text": " then this discrete time loop for the number of time steps as the active inference simulation is going to go and then here's a very concise animation method and so here it's a little bit different but it's the same kind of general picture that is shown here different scaling colors um but that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2754.436,
    "end": 2759.824,
    "text": " what is happening in outputs comparisons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.912,
    "end": 2765.172,
    "text": "Okay."
  },
  {
    "start": 2774.467,
    "end": 2780.215,
    "text": "And they have more information on the way message passing plays out with this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2781.137,
    "end": 2781.237,
    "text": "Okay."
  },
  {
    "start": 2792.253,
    "end": 2818.834,
    "text": " right let's look at the code viz for the whatever we prompted okay 83 done with the with the big meta analysis okay so here we go here's mountain car standalone 12 26 2024. first loads config dot tunnel",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2821.126,
    "end": 2822.508,
    "text": " Like, I don't even know if it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2825.472,
    "end": 2825.853,
    "text": "It does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.522,
    "end": 2833.063,
    "text": "That's one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.592,
    "end": 2850.508,
    "text": "It also configures a shared logging function and a visualization, probably data collection, arraying function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.513,
    "end": 2876.158,
    "text": " so then these config informed visualization and logging methods are holding the traces of these two agents as they're simulated within a shared parameter configuration like physics and friction that's each cell of this meta-analysis it's ongoing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.59,
    "end": 2899.783,
    "text": " and each of these agent folders we could say has like a naive control agent for that physics combination and active inference agent for that physics configuration the parameterized",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.788,
    "end": 2911.244,
    "text": " sort of setup for the simulation and everything loaded in place, which can often be a lot of the hardest part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.264,
    "end": 2915.39,
    "text": "Sometimes cursor plus LLMs knocks it out of the park.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.531,
    "end": 2922.622,
    "text": "Other times it's just two steps backwards, one step forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.804,
    "end": 2928.572,
    "text": "Mountain Car is called",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2932.855,
    "end": 2956.45,
    "text": " interesting mountaincar.jl even here looks like it goes to code of conduct here's the readme let's look at that on github",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.535,
    "end": 2960.676,
    "text": " Let's look at some of these methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.736,
    "end": 2961.878,
    "text": "Wow, though, interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.398,
    "end": 2967.344,
    "text": "Okay, 95% done with the meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2974.992,
    "end": 2983.922,
    "text": "Here's the mountain car model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.75,
    "end": 3014.972,
    "text": " method so here's standalone standalone's parameters are i i don't know if um terminally i'm sure it could be restructured are written at 300 lines in just wanted to start there it's a highlight tab so here's how i understand what's happening in the standalone it's defining this as the mountain car module and and i think a better package reference and function reference could go a long way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3016.657,
    "end": 3035.317,
    "text": " Here at the package and at the specific method level, RxInfer and ReactiveMessagePassingSub kind of second level consultants are called and some of the other packages that are needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3036.338,
    "end": 3040.082,
    "text": "Visualization.jl is brought in for some methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3041.243,
    "end": 3044.486,
    "text": " Also, this file exports public functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.046,
    "end": 3053.233,
    "text": "So other scripts can call include on this script and get these functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3054.734,
    "end": 3056.696,
    "text": "Here are some... All right, here we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3057.076,
    "end": 3059.698,
    "text": "Completed 900 simulations with 80 successes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.839,
    "end": 3060.259,
    "text": "Okay, good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3060.279,
    "end": 3064.763,
    "text": "So that means that some of the simulations should have worked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.223,
    "end": 3066.384,
    "text": "Some of them didn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3066.424,
    "end": 3068.426,
    "text": "So at least we picked some interesting area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3068.466,
    "end": 3071.048,
    "text": "Not sure if it's going to visualize everything properly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3071.028,
    "end": 3090.015,
    "text": " okay here's the app model function with like the same i hope um distributions and such here's the create physics here's the create world here's the create agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3092.847,
    "end": 3096.412,
    "text": " Here's calculating the kinetic potential and total energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.494,
    "end": 3104.344,
    "text": "So here's the potential energy with 9.81 gravitational constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3104.744,
    "end": 3110.373,
    "text": "Okay, no errors from the meta-analysis, but we'll see what it ends up outputting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.237,
    "end": 3113.978,
    "text": "What was output?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.666,
    "end": 3146.563,
    "text": " so here's the physics based energy calculation not to be confused only to be distinguished from the fact that the message passing updates are doing a free energy minimization but this is referring to the physics i don't know what it it's if there's a just the physics phase space for the newtonian mechanics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.079,
    "end": 3151.083,
    "text": " Here's the method to call for the animations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3155.248,
    "end": 3156.049,
    "text": "That's the module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.07,
    "end": 3160.956,
    "text": "Then here is when that standalone is called by itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.657,
    "end": 3164.3,
    "text": "It calls in all these other packages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3164.961,
    "end": 3166.463,
    "text": "Here we're at line 300.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3167.304,
    "end": 3169.187,
    "text": "Here are the parameterizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.227,
    "end": 3174.213,
    "text": "These may override or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.233,
    "end": 3176.196,
    "text": "And set the shared",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.442,
    "end": 3200.479,
    "text": " parameters for the naive and the active inference approach here's the act the naive approach here's the execution of the naive approach this is sort of a procedural way they defined um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.079,
    "end": 3215.634,
    "text": " Just again, like these are, this is like an example of something that might be totally irrelevant in a given moment, or it might make a huge difference in a simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3216.154,
    "end": 3229.048,
    "text": "So here they put a hundred ones or n naive time steps of ones, and then just accepted that vector.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3230.902,
    "end": 3252.15,
    "text": " here possibly more error prone possibly introducing disastrous logics there's a procedural generation of setting the action at that time step to one and that enables some of the single standalone logging",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3253.328,
    "end": 3254.81,
    "text": " Here's the Active Inference approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3255.471,
    "end": 3261.622,
    "text": "So it's prefigured with the AI namespace subscript.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3262.844,
    "end": 3270.216,
    "text": "Here is the compute act slide future agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.299,
    "end": 3274.162,
    "text": "Not sure if this .04 gets overridden.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.202,
    "end": 3276.045,
    "text": "We'll see maybe in the meta-analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.506,
    "end": 3297.27,
    "text": " Here's the active inference simulation in a let block, which helps with the, I don't mean impenetrability security, but in the error tolerance and logging for allowances in programs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.29,
    "end": 3302.337,
    "text": "So different sort of footholds, entry points for logging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.317,
    "end": 3329.117,
    "text": " and an understanding and for a given situation maybe more or less there's a lot I I don't even know so many different ways to write different codes so here's the observation of the position and the velocity from the current state's modalities factors here that's the initial position",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.413,
    "end": 3351.932,
    "text": " here is the time step discrete time sequence so this is kind of like there's the topos of the the topology of the action perception partition and then this is like the kairos possibly also chronos for specifying how those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.503,
    "end": 3370.647,
    "text": " different topological aspects of the action perception partition get enacted sequentially in this case but with expressivity to have other logics underneath these uh just current transient",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.774,
    "end": 3397.377,
    "text": " norm specifications so set the action to the act function push it onto the action trace and execute the action then observe push the observations store the predictions and and the future call check against the target update beliefs",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3399.348,
    "end": 3428.477,
    "text": " so maybe that's the sort of running through the finish line component like it checks whether it's actually at the goal then it updates its beliefs or but i'm not sure and logs every 20 time steps here's the calculation of the energies the visualization on the analysis of the naive and the ai",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3430.668,
    "end": 3434.672,
    "text": " comparison plots, outputs, some summaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3435.373,
    "end": 3436.093,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3436.113,
    "end": 3439.617,
    "text": "So that again goes to the outputs folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3440.237,
    "end": 3442.54,
    "text": "Now let's look at, so 17.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.58,
    "end": 3447.865,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.568,
    "end": 3457.014,
    "text": "So here's an ANOVA, but here's some earlier ones that have many more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.334,
    "end": 3459.156,
    "text": "Let's try to get these back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.893,
    "end": 3480.826,
    "text": " First, just going to explicitly bring in the meta analysis and the mountain car methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.21,
    "end": 3496.45,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3499.585,
    "end": 3518.243,
    "text": " Please ensure that all ASCII art and non-ASCII parentheses quote normal plots are fully output by the meta-analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3519.644,
    "end": 3525.009,
    "text": "Then we'll update the TOML just to do a tiny one, just to verify that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.071,
    "end": 3529.153,
    "text": "So we'll do two by two",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3533.808,
    "end": 3551.164,
    "text": " So this is kind of a common sort of micro dev loop situation with, of course, just breaking, unworking things, but visualizations sort of trickling off, needing to be fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.285,
    "end": 3557.711,
    "text": "And then the sort of trade-off between pursuing a local branch and then pursuing a deeper branch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.011,
    "end": 3561.334,
    "text": "So for example, here was using the ASCII text art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.187,
    "end": 3587.541,
    "text": " this was on 450 for each sweeping so let's see these were the plain text we'll see if we can recover these but you know hilarious if we can hilarious if we can't okay here's just a sort of summary on the overall success versus failure of naive versus active inference so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.521,
    "end": 3614.473,
    "text": " TBD if it's exactly perfectly doing what the standalone does and again if that's exactly the right or only way to do it in the example but at least in this parameter zone active inference is doing better so there's at least some cases where there's a better policy than just going to the right success rates so here's sort of an ASCII art uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.09,
    "end": 3621.516,
    "text": " visualization, not sure if the dimensionality is the right way, but it's sort of some example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.379,
    "end": 3625.36,
    "text": "Here's the difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.623,
    "end": 3628.664,
    "text": "Here's some different plots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3629.004,
    "end": 3633.429,
    "text": "This is why it was a local off mode because like it looks kind of sick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.449,
    "end": 3644.582,
    "text": "So I thought, okay, it could definitely be also improved, but it's also like, it's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3645.143,
    "end": 3645.523,
    "text": "It can stay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.705,
    "end": 3674.582,
    "text": " parameter analysis so here's success rate versus force in the naive success rate not sure why this wouldn't be a monotonic distribution different plots like plotting this by that plotting this by that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3676.334,
    "end": 3676.614,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.015,
    "end": 3681.502,
    "text": "Meanwhile, I'm going to accept blindly the edits that it made to the meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3682.404,
    "end": 3683.405,
    "text": "Double check the TOML.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.806,
    "end": 3686.851,
    "text": "We're doing a much smaller situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.976,
    "end": 3690.276,
    "text": "Clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3691.097,
    "end": 3691.618,
    "text": "Run it again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.42,
    "end": 3694.042,
    "text": "Back to the earlier outputs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.583,
    "end": 3695.404,
    "text": "Heat maps is empty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3695.424,
    "end": 3700.232,
    "text": "So that was one of the non ASCII art energy analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3702.187,
    "end": 3724.161,
    "text": " so this again suggestive that the simulation really is happening which is kind of the question of these different cases but it's limited ability with ASCII so here's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3726.638,
    "end": 3754.148,
    "text": " another visualization that's it's like the control effort distribution by agent type almost always is at 100 but then there's a few other ones so not sure if those are spurious or how those come to be in the naive control effort case but here is this um different distribution okay an analysis is empty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3755.427,
    "end": 3760.035,
    "text": " So here's an example of the sort of extended startup time of RxInfer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.217,
    "end": 3762.499,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.519,
    "end": 3768.85,
    "text": "So this will probably have to be resolved, but here is setting up the smaller simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3770.253,
    "end": 3777.365,
    "text": "So it sets up the whole batch, whether it has to do two or 200,000, and it's going to go a lot faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.385,
    "end": 3778.207,
    "text": "It's already at 12%.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3779.529,
    "end": 3779.629,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3791.27,
    "end": 3798.803,
    "text": " Okay, so I'll just sort of read some of these second closing parts while we finish up this meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3799.485,
    "end": 3802.43,
    "text": "If you're watching live though, write any comments or questions in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3803.111,
    "end": 3804.614,
    "text": "Okay, so here's some open source to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3806.537,
    "end": 3809.903,
    "text": "At the package scale, just verify and improve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3812.178,
    "end": 3821.935,
    "text": " You know, anyone who wants to try can clone the repo, get the setup.jl working on another setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.07,
    "end": 3835.345,
    "text": " On the statistical front, we can do better statistical description work, visualization, and analysis within and across simulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3836.387,
    "end": 3846.061,
    "text": "So sort of distinguishing and building some statistical power apparatus for technical replicates and biological replicates or experimental conditions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.081,
    "end": 3848.985,
    "text": "19% on the simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3850.602,
    "end": 3867.666,
    "text": " On the formal and the analytical structural side, well, one approach is from the initial RxInfer teams notebook and from the standalone and from the more meta analysis style.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3869.941,
    "end": 3882.635,
    "text": " apply generalized notation, notation, GNN style, which we can actually try this in this stream briefly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.856,
    "end": 3884.657,
    "text": "So we'll leave that one up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.078,
    "end": 3886.879,
    "text": "Category theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.363,
    "end": 3897.871,
    "text": "Here, added a couple of links before, so still analyzing the meta-analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.792,
    "end": 3899.593,
    "text": "At least that's a good sign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.391,
    "end": 3918.286,
    "text": " So I wanted to highlight two recent blog posts from August and November of this year by colleagues at the Topos Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3918.306,
    "end": 3926.796,
    "text": "So the earlier one is a blog post by Sophie Libkind and David Spivak, a polynomial account of Bayesian Update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3928.126,
    "end": 3948.328,
    "text": " so here they describe this poly tree notation this is a very math arty and useful overview for the poly category theoretic notation and some operations and probably a ton more for Bayesian update",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.84,
    "end": 3974.89,
    "text": " and and later they did work including more of the action side and then here's a post from uh November of this year by David spivak describing a paper uh dynamic task delegation for hierarchical agents okay meta-analysis finished with an error no look just fix it thoughtfully",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3988.42,
    "end": 3992.547,
    "text": " So, Neural Wiring Diagrams for Message Passing in Multiscale Organizations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.208,
    "end": 3997.836,
    "text": "Sounds to connect on a lot of act-inf topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.778,
    "end": 4013.483,
    "text": "So, they wrote, In our recent paper, Dynamic Task Delegation for Hierarchical Agents, Sophie Lipkin and I described a task delegation from an agent to a team of subordinates as morphisms in a certain operad called org.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.463,
    "end": 4020.193,
    "text": " However, such morphisms include a great deal of data, and the examples we gave there barely scratch the surface of what's possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4020.473,
    "end": 4031.55,
    "text": "In this post, I'll show how recumbent neural wiring diagrams with arbitrary feedback and quote axon splitting give rise to a message passing language for describing certain such task delegations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4032.371,
    "end": 4041.985,
    "text": "That is, I'll define a cyclic operand rnwd and a function rnwd arrow org m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.163,
    "end": 4070.149,
    "text": " right now what are you doing rnwid and there could be a lot of connections here with the message passing i want to just highlight those see if anyone is interested to explore that direction um just in terms of making okay now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4073.656,
    "end": 4079.304,
    "text": " Here, accept the changes, resync it, clear, start up the meta-analysis again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.449,
    "end": 4101.216,
    "text": "On the sort of action perception, behavioral science component, fitting data, playing with different noise patterns and levels, and then also figuring out some other strategies that can get plugged in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.985,
    "end": 4123.457,
    "text": " other than the the naive one so just for reference this is the i believe formerly known as open ai gym now called gymnasium.pharama.org so mountain car here's how they describe this the environment is part of the classic control environments which contains general information about the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.327,
    "end": 4129.656,
    "text": " So description, this is how they describe it on that gymnasium situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4130.238,
    "end": 4142.644,
    "text": "The mountain car MDP is a deterministic MDP, Markov Decision Process, that consists of a car placed stochastically at the bottom of a sinusoidal valley with the only possible actions being the accelerations that can be applied to the car in either direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.624,
    "end": 4149.012,
    "text": " The goal of the MDP is to strategically accelerate the car to reach the goal state on top of the right hill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.512,
    "end": 4154.499,
    "text": "There are two versions of a mountain car domain in gymnasium, one with discrete actions and one with continuous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.819,
    "end": 4157.102,
    "text": "This version is the one with discrete actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.043,
    "end": 4163.029,
    "text": "First appeared in Andrew Moore's PhD thesis 1990.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.009,
    "end": 4181.203,
    "text": " so here's just how they do it so that could be cool to bring the rx infer active inference agent to the gymnasium and vice versa another angle here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4182.382,
    "end": 4202.922,
    "text": " look into the links go to the multi-agent page in active blockference project document and and and probably other and and better um sources for this too but this is just from from years ago in the cyber physical case and the ant case",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.42,
    "end": 4231.238,
    "text": " some of the different ways that hopefully rx environments and or similar will help enable with the expressivity to talk about a sort of pure blockchain stigma g niche modification neighborhood where you have a kind of centralized at that scale of analysis hub and spoke to and from like for example in the blockchain case",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4231.218,
    "end": 4258.148,
    "text": " people might talk about sending from wallet A to wallet B, but from a message passing perspective, it was wallet A to the blockchain, and then the blockchain update changes the efficacy at a future state for B. Whereas in this case, maybe explicit's not the best term here, but spatial collisions and direct interactions are possible, as well as environment interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4258.469,
    "end": 4260.651,
    "text": "So, okay, we're back to the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.504,
    "end": 4263.345,
    "text": " Meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.448,
    "end": 4265.748,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.893,
    "end": 4272.136,
    "text": "Already it looks like more folders have come out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.782,
    "end": 4279.464,
    "text": "16 simulations with four successes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4279.484,
    "end": 4281.367,
    "text": "So again, some of these should, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.427,
    "end": 4290.017,
    "text": "So here we are within this most recent, we'll wait for this to finish and then we'll look into this most recent meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.18,
    "end": 4292.46,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.232,
    "end": 4301.793,
    "text": " The heat map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4302.293,
    "end": 4302.534,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4305.157,
    "end": 4305.437,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.499,
    "end": 4307.94,
    "text": "Chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.703,
    "end": 4311.945,
    "text": "Surprise, chaos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4324.92,
    "end": 4329.045,
    "text": "Mouse over or just copy and paste it into the composer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.696,
    "end": 4349.042,
    "text": " please thoughtfully address all so that the visualizations of all kinds are safely plotted and fully logged output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4352.026,
    "end": 4354.469,
    "text": "Okay, meanwhile, what is happening in these folders?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4355.27,
    "end": 4356.552,
    "text": "Okay, heat maps went empty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.983,
    "end": 4386.825,
    "text": " but here's what came out before that okay so here was the smaller parameterization with these other ASCII art so for the for the cyberpunk solarpunk rx and fur enthusiast this one oh is much bigger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.771,
    "end": 4419.428,
    "text": " the size of the ASCII art can be specified in the TOML plot width and plot height okay meanwhile the agent is chugging away over here okay then parameter analysis with these bigger ones",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.8,
    "end": 4450.022,
    "text": " so not exactly sure how accurate everything but okay heat maps empty that's kind of part of the issue okay interesting with a naive energy distribution ascii plots nothing nothing okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.63,
    "end": 4479.064,
    "text": " accepting these visualization updates clear let's just delete the ones from after 18. call the meta analysis it's gonna run it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.836,
    "end": 4515.902,
    "text": " So how can we use Rx environments and or others to model this kind of direct communication amongst agents, low road or high road, to model transient communication like propagative radio, EMF, light, schooling, flash flocking, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.355,
    "end": 4538.224,
    "text": " sort of proximate antenna-antennal interactions, as well as to model communication through space-time cones, thinking more about topics like niche modification, stigmergy, across-trial learning, and pheromone psychophysics in the active inference case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.188,
    "end": 4542.97,
    "text": "Cobus, live in the dock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.523,
    "end": 4550.547,
    "text": " Okay, so here appears to be a key part of the issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.567,
    "end": 4556.714,
    "text": "So we'll see how much this interferes with it on this new run here happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4558.876,
    "end": 4564.042,
    "text": "But there's some overlap between the ASCII art.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.568,
    "end": 4570.51,
    "text": "Let's just preempt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.818,
    "end": 4589.663,
    "text": " ensure that we are not quote, getting it twisted with the plots and ASCII art, plots, math art, plots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4596.14,
    "end": 4607.044,
    "text": " Please check over everything and fix and trench to be 100% functionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.236,
    "end": 4635.705,
    "text": " Okay, checking out the readme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.315,
    "end": 4645.997,
    "text": "Structure of the repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.74,
    "end": 4655.408,
    "text": "Standalone implementation, physics engine, octave inference agent, naive agent, visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.818,
    "end": 4661.023,
    "text": " meta-analysis framework, at least the hope of one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4662.526,
    "end": 4664.709,
    "text": "Different measures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.054,
    "end": 4670.819,
    "text": "Set up with setup script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.902,
    "end": 4677.109,
    "text": "Run standalone or the meta-analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.557,
    "end": 4701.865,
    "text": " update the config.toml hopefully project.toml the one with all the package stuff should be taken care of by setup but submit a request or or let's figure out how to make it simpler and here are some of those key packages including rx infer okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.924,
    "end": 4729.135,
    "text": " finished the 16 simulations now it's plotting so we anything with 18 see that we're already kind of we're already on another okay rerunning it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4731.14,
    "end": 4756.337,
    "text": " starting now to to fix but basically this is the whole coefficient slash question how fast how good how augmented how clear how well documented how aligned how useful how interesting how novel how valuable so let's let that simulation go",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4777.512,
    "end": 4785.624,
    "text": " Okay, while the meta analysis is happening, let's have just a more folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4793.054,
    "end": 4804.41,
    "text": "Let's just see how it does with a who's on first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.43,
    "end": 4805.612,
    "text": "In who's on first,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.482,
    "end": 4813.87,
    "text": " Write A. Please write A. Comprehensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4815.432,
    "end": 4816.974,
    "text": "Absolutely informed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4818.757,
    "end": 4819.398,
    "text": "And far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.659,
    "end": 4821.2,
    "text": "Insighted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4822.942,
    "end": 4823.984,
    "text": "Flash out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.527,
    "end": 4826.867,
    "text": "Sighted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4827.628,
    "end": 4828.169,
    "text": "Parenthesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.031,
    "end": 4830.452,
    "text": "Indoor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.193,
    "end": 4831.573,
    "text": "Outdoor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.176,
    "end": 4834.317,
    "text": "Specialist status.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4836.963,
    "end": 4866.598,
    "text": " who's on first style dialogue or more about 1920s Americana baseball USA OS specific lore and all the contents of the feed me and mountain car active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.047,
    "end": 4880.335,
    "text": " reactive message passing scheme as we've tried to implement and dot dot dot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.9,
    "end": 4899.993,
    "text": " I'll help write a humorous Abbott and Costello who's on first style dialogue that cleverly weaves together classic baseball references with the mountain car active inference implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.493,
    "end": 4903.177,
    "text": "Let me write this in the who's on first.md file.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.197,
    "end": 4907.262,
    "text": "69% done with the meta analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.375,
    "end": 4917.475,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.495,
    "end": 4917.595,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.983,
    "end": 4923.57,
    "text": " Let's see if, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.612,
    "end": 4933.677,
    "text": "We'll just do the one shot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4953.316,
    "end": 4954.758,
    "text": " Okay, push it to GitHub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.92,
    "end": 4957.882,
    "text": "Accept the changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.768,
    "end": 4963.068,
    "text": "Clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.771,
    "end": 4966.873,
    "text": "Run a meta-analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4976.344,
    "end": 4978.547,
    "text": "Reload the repo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4984.332,
    "end": 5005.345,
    "text": " more all right just one shot just so that we can close out",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.641,
    "end": 5007.262,
    "text": " Who's on first?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.342,
    "end": 5008.063,
    "text": "Mountain Car Edition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.985,
    "end": 5013.151,
    "text": "Say, Costello, I've been meaning to tell you about this fascinating new project we're working on at the ballpark.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5013.712,
    "end": 5014.093,
    "text": "Oh yeah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5014.213,
    "end": 5014.694,
    "text": "What's that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5015.335,
    "end": 5016.998,
    "text": "It's called Mountain Car Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5017.719,
    "end": 5018.28,
    "text": "A mountain car?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5018.58,
    "end": 5019.422,
    "text": "At a baseball park?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5019.882,
    "end": 5020.764,
    "text": "What are you, nuts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.385,
    "end": 5022.186,
    "text": "No, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5022.233,
    "end": 5023.134,
    "text": " It's a simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5023.654,
    "end": 5025.656,
    "text": "We've got two agents trying to get up the hill.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5026.297,
    "end": 5026.837,
    "text": "Two agents?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.518,
    "end": 5028.619,
    "text": "Like baseball agents?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5029.4,
    "end": 5029.6,
    "text": "No.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5030.401,
    "end": 5032.183,
    "text": "One's active inference and one's naive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.803,
    "end": 5034.085,
    "text": "Well, that's naive of them both.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.885,
    "end": 5035.706,
    "text": "Who's controlling them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.467,
    "end": 5036.887,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5037.248,
    "end": 5038.629,
    "text": "Who's controlling the active agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5039.25,
    "end": 5044.335,
    "text": "What's controlling the naive agent and I don't know is measuring the performance metrics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5045.896,
    "end": 5046.357,
    "text": "Wait a minute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5047.217,
    "end": 5048.939,
    "text": "Who's controlling the active agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5049.96,
    "end": 5050.941,
    "text": "Yes, precisely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.068,
    "end": 5053.23,
    "text": " I mean the fella's name.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5054.371,
    "end": 5054.571,
    "text": "Who?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5055.833,
    "end": 5057.035,
    "text": "The agent controlling the car.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.337,
    "end": 5060.259,
    "text": "Who's controlling the active inference agent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5061.201,
    "end": 5062.342,
    "text": "That's what I'm asking you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5062.402,
    "end": 5067.089,
    "text": "And I'm telling you who's controlling the active inference agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.251,
    "end": 5069.833,
    "text": "Look, let me start over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5070.153,
    "end": 5073.258,
    "text": "When you run the simulation, who plots the result?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5073.278,
    "end": 5075.3,
    "text": "Oh no, who doesn't plot anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5075.901,
    "end": 5076.903,
    "text": "What plots the results?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5078.224,
    "end": 5080.067,
    "text": "I'm not asking what plots the results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5081.245,
    "end": 5107.101,
    "text": " does plot the results creates beautiful heat maps too i don't care about heat maps i want to know who's plotting no no who's controlling not plotting then who is plotting no like i said what plots everything all right wise guy let me try another way the car needs to get up the hill right right so who calculates the force needed no",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5107.722,
    "end": 5136.936,
    "text": " who only handles active inference i don't know calculates the forces you don't know who calculates the forces no i don't know calculates the forces that's what i'm asking you and that's what i'm telling you i don't know calculates the forces then who does no who does active inference i don't know does forces what does plotting and tomorrow handles the parameter sweep parameter sweep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.49,
    "end": 5138.932,
    "text": " You bringing in a groundskeeper now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5140.214,
    "end": 5140.634,
    "text": "No, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5141.616,
    "end": 5143.859,
    "text": "Tomorrow is our batch simulation handler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5144.379,
    "end": 5145.761,
    "text": "Today's not involved at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5147.003,
    "end": 5149.306,
    "text": "How can you run simulations if today's not involved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5150.467,
    "end": 5151.97,
    "text": "Why would you want today involved?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.931,
    "end": 5153.872,
    "text": "I'm not asking why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5153.892,
    "end": 5157.938,
    "text": "Oh, why is Busy analyzing the energy consumption?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.139,
    "end": 5161.222,
    "text": "I don't even know what we're talking about anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.183,
    "end": 5162.844,
    "text": "That's the spirit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5163.365,
    "end": 5164.126,
    "text": "Now you're getting it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.687,
    "end": 5167.21,
    "text": "I don't know, it's a crucial part of our implementation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5167.831,
    "end": 5174.582,
    "text": " Ah, hey wait, I haven't told you about Because's statistical significance testing yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5176.826,
    "end": 5177.387,
    "text": "Later that day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5178.789,
    "end": 5181.894,
    "text": "Okay, let me just ask one simple thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5182.395,
    "end": 5182.635,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.937,
    "end": 5186.862,
    "text": "In the config file, who sets the initial position?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5187.704,
    "end": 5190.428,
    "text": "Oh no, Naturally sets the initial position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.43,
    "end": 5191.891,
    "text": "Naturally?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5191.931,
    "end": 5194.615,
    "text": "Yes, naturally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5195.118,
    "end": 5222.087,
    "text": " I should have stayed in the minor leagues don't forget practice tomorrow we're running a full parameter sweep distance screaming only to return to more errors let's see how far we got",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.969,
    "end": 5246.978,
    "text": " still no heat maps okay um i'll give one more minutes or so if anybody wants to write a question in the live chat otherwise look forward to seeing what people think um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5248.291,
    "end": 5271.902,
    "text": " see where it's incorrectly or inefficiently applying active inference with rx infer because this is a really promising direction there's a lot of interfaces for specifying simulations making uh versions of the textbook",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.979,
    "end": 5282.876,
    "text": " examples, all kinds of fun research and education and application that rx infer is enabling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5283.377,
    "end": 5292.473,
    "text": "So I will accept this last edit, make the last push.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5307.758,
    "end": 5311.623,
    "text": " Yeah, Composer, being able to edit across multiple files.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5315.707,
    "end": 5316.448,
    "text": "See, this is good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5316.809,
    "end": 5320.913,
    "text": "It looks good, but it's really hard to see just from a quick scan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5328.522,
    "end": 5330.745,
    "text": "So I'll just leave it at that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.171,
    "end": 5341.972,
    "text": " Close cursor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.756,
    "end": 5362.622,
    "text": "Make last git push.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5374.465,
    "end": 5376.869,
    "text": " Okay, verify that closing edits were sent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5377.571,
    "end": 5377.831,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5378.573,
    "end": 5379.274,
    "text": "Thank you, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.314,
    "end": 5380.436,
    "text": "Enjoy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5380.456,
    "end": 5386.647,
    "text": "I wish you a good closure of the year, beginning of the next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5386.788,
    "end": 5392.819,
    "text": "Good accelerations in this continuous, discrete, complex scenario we're in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.141,
    "end": 5394.883,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.923,
    "end": 5395.123,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]