[
  {
    "start": 1.493,
    "end": 22.496,
    "text": " hello welcome thanks everyone it's february 1st 2023 we're in meeting 14 cohort 2 of the par at all textbook we're on chapter 6. so today we can look over",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.931,
    "end": 49.811,
    "text": " any and all of the questions on chapter six that have been raised we can also go to the text but just to begin does anyone want to bring up any quote or topic or or anything about chapter six or any section from the text or question that someone wants to go to first or a general point about chapter six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.721,
    "end": 57.862,
    "text": " from Ali and then anyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.464,
    "end": 81.937,
    "text": "Well, I think now that the white paper from Versus Lab is published, it might be a good idea to read Designing Ecosystems white paper along with chapter six, because it can provide a much wider perspective and see how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 84.199,
    "end": 110.838,
    "text": " how the research in developing these kinds of active inference-based AI is currently developing and to see how the plan for the future developments have already been discussed, especially in the case for sympathetic and shared intelligence, which is kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 112.205,
    "end": 117.791,
    "text": " long-term plan to develop those kinds of intelligence systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 118.712,
    "end": 132.746,
    "text": "So yeah, I think this paper can immensely help to see the big picture related for designing these kinds of active-imprint space models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 134.848,
    "end": 135.189,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.425,
    "end": 158.841,
    "text": " thanks yeah the the first 20 pages of the paper have great points but just to jump to the the timeline part it's 2023 this was released at the end of 22 and in the coming years here are some doubling timelines that we might expect or prefer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.963,
    "end": 168.105,
    "text": " So that does help set the stage for chapter six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 172.107,
    "end": 174.828,
    "text": "Anyone else, just unmute or just raise your hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.755,
    "end": 198.265,
    "text": " chapter six is a recipe for building active inference models so it's not the uh fast food restaurant yet but it's a recipe for the home and potentially industrial chef it covers the essential steps to design an effective model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 199.252,
    "end": 202.434,
    "text": " And that is going to be taken in like a staged way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.335,
    "end": 211.218,
    "text": "And starts on page 105 in the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.738,
    "end": 215.46,
    "text": "So shall we look at the questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.02,
    "end": 221.603,
    "text": "Does anyone have a specific question they would like to jump to or any general points?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 228.007,
    "end": 234.851,
    "text": " Otherwise, let's look at the recipe and then see if there's things that we can add.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.871,
    "end": 249.099,
    "text": "And then in this active inference model recipe, let's see if we can flesh it out with what we're seeing and learning from doing modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.762,
    "end": 255.363,
    "text": "And also how it's similar and different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.403,
    "end": 261.107,
    "text": " from other modeling recipes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.657,
    "end": 274.621,
    "text": "How different is this than doing a linear regression model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.681,
    "end": 278.926,
    "text": "How different is it than doing some other type of modeling or analysis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 289.161,
    "end": 295.405,
    "text": " Give me six chapters to model active inference and I'll spend the first four on the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.886,
    "end": 297.567,
    "text": "Carl Lincoln.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 303.991,
    "end": 305.252,
    "text": "Which system are we modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.673,
    "end": 308.774,
    "text": "What is the appropriate form for the generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.895,
    "end": 311.376,
    "text": "How to set up the generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 311.736,
    "end": 313.157,
    "text": "How to set up the generative process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 313.297,
    "end": 315.299,
    "text": "So those have been copied out here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.5,
    "end": 317.961,
    "text": "Does anyone just want to give some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 319.397,
    "end": 333.369,
    "text": " comments on these stages or how would one just briefly summarize what each of these four stages are and what they do or just any feature about these four steps",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.416,
    "end": 357.959,
    "text": " I guess one thing is they need to be discrete, these steps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 360.361,
    "end": 363.823,
    "text": "And that's already a decision that needs to be made.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 367.125,
    "end": 369.026,
    "text": "Do you mean the steps are separate from each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 369.046,
    "end": 370.427,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 371.628,
    "end": 374.23,
    "text": "And we need to have categories that's",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 378.007,
    "end": 385.791,
    "text": " If we have these hidden states in the Markov model, these are separate states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 394.616,
    "end": 404.021,
    "text": "And I guess that's kind of a problem and a restriction also.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 407.62,
    "end": 414.306,
    "text": " Are there other modeling approaches that you think don't have such restriction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.368,
    "end": 418.33,
    "text": "Yeah, for instance, neural networks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 422.994,
    "end": 431.962,
    "text": "We use transformer models where you can type in a whole picture, for instance, or something like this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 441.385,
    "end": 444.487,
    "text": " I may be wrong, so maybe there's categories too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 449.029,
    "end": 463.577,
    "text": "Yes, well, maybe a related question is when we specify what is a hidden state and what is an observation in our generative model, are we kind of locked into that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.418,
    "end": 468.42,
    "text": "Or is it possible for",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 470.345,
    "end": 496.879,
    "text": " something like a pre-POMDP that describes structure potentially this is between steps two and three like the hidden state is going to be an image and then it gets set up with a certain dimensionality",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 514.087,
    "end": 515.048,
    "text": " Anyone can raise their hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.088,
    "end": 526.875,
    "text": "Let's just look through the questions, see what we can bring into the modeling page and which ones are remaining to be needed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.536,
    "end": 531.698,
    "text": "Why is modeling of the generative process a necessary step for building an active inference model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.999,
    "end": 533.159,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.179,
    "end": 535.761,
    "text": "We have a lot of notes on here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 535.981,
    "end": 538.182,
    "text": "What would somebody just give on a first pass?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.983,
    "end": 542.585,
    "text": "Why is the generative process a necessary step for building active inference model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.846,
    "end": 565.181,
    "text": " I guess on a very high level, because the generative model is ultimately creating a representation of the generative process, if we want to create that model, we have to allow for the generative model to be able to model the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.401,
    "end": 568.363,
    "text": "So we also need to model the generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.427,
    "end": 572.607,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.315,
    "end": 588.984,
    "text": " one aspect there is the generative model is or the generative process is providing the observations and then the sort of the second layer on that is the generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.103,
    "end": 617.026,
    "text": " is working with or is building representations or is a good regulator of or is needing to maintain the requisite diversity to deal with the generative process so it would be like asking why is modeling of the grid important in a netlogo agent-based simulation it's like well you got two kinds of things the agents moving around the grid and you have the grid",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 618.041,
    "end": 647.587,
    "text": " so in this active inference particular partition we have the generative model that's the active entity and then we have the generative process which could be another active entity or it can have any structure so like in model stream 7.2 the generative model was an active agent the generative process was just an if then logic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.553,
    "end": 656.773,
    "text": " Ali?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 660.736,
    "end": 681.488,
    "text": "I also think that these distinctive steps that have been outlined here in this chapter as a recipe to designing any active inference model are not specifically distinct or even sequential steps because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 682.961,
    "end": 687.143,
    "text": " For example, in the first step, it says, which system are we modeling?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 688.224,
    "end": 706.394,
    "text": "But on the other hand, the choice of the system that we are modeling would inevitably have an effect on the type of the generative model or the type of the generative process we're dealing with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 706.994,
    "end": 710.136,
    "text": "So in a sense, all of these steps are kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 710.926,
    "end": 737.672,
    "text": " intertwined into each other and they're not necessarily have to be seen as a kind of in a sequential order but rather in a kind of from a hierarchical point of view we just need to have which component of the modeling process are we dealing with so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 738.616,
    "end": 759.854,
    "text": " For example, we can possibly begin by identifying the generative process and then look at how we can optimally represent the generative process by a suitable generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 760.74,
    "end": 790.329,
    "text": " so what i'm saying is these four steps are not necessarily something uh that uh to be taken on the face level they are just uh laying out the the territorial map of modeling those systems and we might begin from uh each one and each one of them and then proceed to any other depending on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 791.278,
    "end": 793.78,
    "text": " the situation we're involved in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 796.723,
    "end": 797.843,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 797.863,
    "end": 812.035,
    "text": "It may be seen as an atemporal partition, not necessarily the order that a traditional recipe would have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 814.11,
    "end": 843.651,
    "text": " let's let's continue on and so we can just touch on on each of the questions okay what are the four steps some of this material we moved over to this distinct model recipe page just so that we can develop that um in its own section um okay what are the four steps that are being addressed on that page in figure 6.1 what do the uni-directional and bi-directional arrows mean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.704,
    "end": 847.965,
    "text": " What's the thought anyone has on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.593,
    "end": 860.713,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.262,
    "end": 870.524,
    "text": " In a Bayesian graph, the nodes represent random variables and the edges represent statistical influences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.764,
    "end": 876.785,
    "text": "Those can be represented in an undirected fashion if there's no arrowheads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 877.565,
    "end": 880.065,
    "text": "And that's a lot like a structural equation model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.825,
    "end": 888.367,
    "text": "Like if we were dealing with linear notions of correlation, Pearson correlation, we could make a structural equation model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.4,
    "end": 893.783,
    "text": " And then the edges would be like correlations between two variables, which are undirected, of course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.864,
    "end": 909.856,
    "text": "In a Bayesian causality framework, like Judea Pearl et al., it is possible to have a bidirectional arrow, which is a lot like an undirected arrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.257,
    "end": 925.276,
    "text": " but also you can have a unidirectional arrow such that changes in one variable cause changes in another, but not asymmetrically, especially if you consider time series information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.312,
    "end": 954.871,
    "text": " In the work of Aguilera et al., How Particular Work, I think there are several papers and a stream on it, they analyze which topologies of the action-perception loop have which properties, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.655,
    "end": 977.396,
    "text": " so one can imagine like a simple cybernetic action perception loop like which we could just call like around the clock so no line in the middle just internal states only influence action no no backwards zero action only influences internal internal on sense sense on internal and all the self loops",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 979.017,
    "end": 1001.424,
    "text": " um that's like a simple around the clock topology of the action perception Loop so then we can ask all right so from that around the clock uh causal framing what extra edges and arrowheads exist in the way that it's shown in figure 6.1",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.276,
    "end": 1028.702,
    "text": " there are three there's the connection between active and sensory states so the blanket states have an additional relationship and there's this somewhat interesting symmetry where active states have an arrow back to internal states and sensory states have an arrow back to external states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.397,
    "end": 1052.207,
    "text": " frankly I am not sure to what extent people are just showing representations of the way that previous models have shown it which could be in a graphical representation like this or you could think of this as the adjacency Matrix of the causal influence of the four states on each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.376,
    "end": 1065.669,
    "text": " Like that could be a fully connected matrix with a value in every cell, or it could be like just the identity matrix would be like four states that are independently evolving and not influencing each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1065.689,
    "end": 1075.399,
    "text": "Different topologies of this particular partition are going to have different properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.083,
    "end": 1089.37,
    "text": " And I think the most general approach would be to do structure learning and Bayesian model selection on different topologies for the action perception loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1093.031,
    "end": 1094.072,
    "text": "So what do they mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.093,
    "end": 1101.216,
    "text": "Well, they mean that you are comparing models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.961,
    "end": 1128.772,
    "text": " with the constraint or the availability for that parameter value to be non-zero if you delete the arrowhead of a certain kind then you're basically testing models within a restricted class where that parameter has been fixed at zero so if you want to fix the effect of sensory states on external states to zero maybe you think that's quote unrealistic so you want to fix that to zero",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.898,
    "end": 1152.678,
    "text": " so that you have increased statistical power to resolve other parameters that's valid although one of the most intuitive um reasons to do so which is like but sensory states don't influence external states in the real world it's like yes but that's the map territory fallacy this isn't the causal structure of reality Ali or anyone else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.895,
    "end": 1176.165,
    "text": " Actually, it might be helpful to look at figure two from the paper Path Integrals, Particular Kinds and Strange Things, and especially the different typologies of the particular kinds provided there, being inert particles, active particles, conservative and strange particles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.545,
    "end": 1184.169,
    "text": "So briefly, they define inert particles as the kind of particles or systems with no active states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1185.65,
    "end": 1197.562,
    "text": " And in the order of increasing complexity, one step further or one level up would be the active particles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1198.366,
    "end": 1201.447,
    "text": " which is a particle with a non-empty set of active states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1202.488,
    "end": 1215.314,
    "text": "But then, ultimately, and also the conservative particle is an active particle whose particular states follow paths of least action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1215.694,
    "end": 1220.156,
    "text": "But ultimately, we reach a kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1221.076,
    "end": 1233.147,
    "text": " definition, I believe for the first time, for strange particles which are defined as conservative particles whose active states do not directly influence internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1234.248,
    "end": 1244.918,
    "text": "So this paper claims that only this fourth type of particles, namely the strange particles, have the capacity to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1247.353,
    "end": 1257.159,
    "text": " be a kind of sentient agent or any kind of intelligent agent, depending on how we define intelligence or sentience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1258.38,
    "end": 1276.652,
    "text": "But in any case, all of these kind of, this strange particle somehow subsumes all the other kinds of particles, but with varying levels of complexity assigned to each of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1280.762,
    "end": 1309.572,
    "text": " thank you yes good connection here we see um so interestingly we don't see the backwards arrow here we see the around the clock and the intra blanket connections but we're we don't have the backwards edge",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.59,
    "end": 1317.28,
    "text": " Yeah, that's because these kinds of strange particles have not been",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1317.887,
    "end": 1320.95,
    "text": " developed into fully sentient agents yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1321.59,
    "end": 1334.681,
    "text": "So to be fully sentient is to be able to actively influence all the active and sensory states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1335.421,
    "end": 1342.227,
    "text": "So I believe that's why we don't have those bidirectionality in this picture for strange particles yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1343.368,
    "end": 1343.708,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1345.014,
    "end": 1374.291,
    "text": " yes it's almost like this is one circuit diagram it's like we have four cpus on our circuit board that's the particular partition and then how we wire up the topology of the particular partition is like the hardware of our circuit board and then what the dynamics are is like the software of our circuit board",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.572,
    "end": 1402.772,
    "text": " Once we start mixing in these taxonomies of particles of increasing sentience and cognitive complexity, and then we start mixing in the blanket index, it's a big space, but also it's a very semantic space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.27,
    "end": 1426.594,
    "text": " And one advantage of FEP and active modeling is we can develop special or reduced cases of particular things that are sub-cognitive, but they're still broadly considered within a cognitivist framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.171,
    "end": 1439.58,
    "text": " Whereas something like thousand brains, it may be a super effective architecture for inference or generalization or any other number of advanced cognitive tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.601,
    "end": 1451.89,
    "text": "However, it cannot be constrained or projected down to the case of like a ball rolling down a slope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.339,
    "end": 1477.939,
    "text": " Whereas Bayesian mechanics, Bayesian physics, and this taxonomy of particles helps us bridge the continuum with expressive modeling framework that spans the simplest, least active particles to open-ended complexity and intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.02,
    "end": 1479.24,
    "text": "Michael?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.505,
    "end": 1493.918,
    "text": " Yeah, I also had a little bit of problems with understanding this Markov blanket loop and what that could mean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1493.938,
    "end": 1500.465,
    "text": "So there's somehow unmediated",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1503.817,
    "end": 1515.985,
    "text": " action that does not have an impact on the environment and the sensation action loop, I have problems really to understand what that is, what that could be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1519.96,
    "end": 1527.423,
    "text": " I mean, I can see that one can have a system that produces something like this, but I have problems to understand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1527.463,
    "end": 1531.644,
    "text": "So I was thinking whether this was meant to be, for instance, a reflex.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1532.184,
    "end": 1543.088,
    "text": "You hit on the knee, and then the leg does some kind of movement, but without going to the brain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1546.627,
    "end": 1555.436,
    "text": " the nerve ends in the spine somewhere, and then this action is produced by a place in the spine, and then it doesn't go to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1556.237,
    "end": 1560.101,
    "text": "But I mean, it depends on what you call an internal state, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1560.662,
    "end": 1562.183,
    "text": "So if the spine.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1564.205,
    "end": 1570.368,
    "text": " that triggers this reaction not part of an internal state?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1571.889,
    "end": 1576.612,
    "text": "Well, I'm a little bit lost in understanding how we can understand that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1577.192,
    "end": 1579.253,
    "text": "Yeah, thank you for the comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1579.273,
    "end": 1584.175,
    "text": "So super important point, like it depends what is internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1584.716,
    "end": 1591.939,
    "text": "It's not like states even within a fixed, like these are the only variables on the table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.733,
    "end": 1604.402,
    "text": " Whether one is internal or external is, of course, whether we're choosing to model it as the generative model or generative process, like which side of the blanket, and there's a symmetry there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1607.025,
    "end": 1611.409,
    "text": "And then it's not just like this variable is an internal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1611.91,
    "end": 1617.095,
    "text": "It's always like the fourfold particular partition comes into being internally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1617.848,
    "end": 1646.225,
    "text": " in the same time like the blanket states are those that make internal and external states conditionally independent so but that blanket state with respect to x and mu it might be an internal state with respect to something else so it does definitely depend on it and i think now to the question of the connection here's from emperor's new markov blankets by bernberg um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.16,
    "end": 1660.428,
    "text": " I think the edge may have to do with just the... The fact that there is an arrowhead doesn't mean that the parameter value is non-zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.609,
    "end": 1668.874,
    "text": "It just means that we're describing families of models where there can be a non-zero influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.881,
    "end": 1693.264,
    "text": " not a priori fixing it to zero but you could conceivably remove this edge and just fit the simple around the clock or around the clock with the two backwards edges so because we're making models not um of maps not territories we um don't need to be constrained to a physical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.346,
    "end": 1698.508,
    "text": " anatomical realism with respect to what these edges are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.409,
    "end": 1708.536,
    "text": "And so it's easy to sort of contrast the plausibility of these edges with anatomical realism, but these are not anatomical edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1710.0,
    "end": 1719.144,
    "text": " So it's just opening up the family of models under consideration to a non-zero statistical influence between these states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.425,
    "end": 1735.852,
    "text": "And it also may inherit from the question of co-parents and also the developments of what people call a frist and blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.219,
    "end": 1749.429,
    "text": " Whereas the Markov blanket formalism by Pearl was initially characterized on an undirected graph and there was only one kind of blanket state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1750.79,
    "end": 1755.534,
    "text": "It was just the set of nodes that make internal and external states conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1757.486,
    "end": 1776.613,
    "text": " And you could imagine a sort of clean frist and blanket with like a clean division of labor where there's some of the nodes of that blanket set are strictly outgoing and some of the nodes are strictly incoming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.645,
    "end": 1803.423,
    "text": " so that could happen you could buy dictate design systems that have that characteristic and that may map onto a anatomical realism but also you might want to consider parameterizations of models that don't have such a clean partitioning like there's a dual functional node",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.977,
    "end": 1808.403,
    "text": " that has an incoming and an outgoing statistical dependency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.585,
    "end": 1813.371,
    "text": "And that doesn't have to map on to any actual sensor or actuator in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.313,
    "end": 1815.635,
    "text": "It's just a statistical note.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.576,
    "end": 1816.737,
    "text": "Hmm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1819.751,
    "end": 1826.297,
    "text": " But isn't, okay, I can see that one can design such a system, but does it make sense?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1827.278,
    "end": 1842.012,
    "text": "I mean, if there's an infinite loop between active states and sensory states that mutually manipulate themselves, but they have neither an impact on an external world, not on an internal world,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1843.871,
    "end": 1849.599,
    "text": " Of course, we can assume this, but what is the reasoning there?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1850.42,
    "end": 1851.641,
    "text": "I mean, does it make sense?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1851.761,
    "end": 1859.712,
    "text": "If something happens and we cannot see it, not outside, not inside, what is the point?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1862.085,
    "end": 1876.595,
    "text": " It's just like a full Turing machine that generates a derivation tree with huge number of internal nodes that just disappear, and one has not a track of what happens there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1878.556,
    "end": 1878.856,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1879.376,
    "end": 1880.918,
    "text": "Thank you for the comment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.038,
    "end": 1883.819,
    "text": "So I think one way to think about this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.591,
    "end": 1909.83,
    "text": " topology this wiring of the particular partition here's from that um uh path integrals particular kind strange things paper this is how we're modeling flows over states in the fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.325,
    "end": 1917.809,
    "text": " we have the flow over the total particular partition X is like a tuple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.009,
    "end": 1926.154,
    "text": "It's a four unit, four length vector over internal, external sense and action states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.474,
    "end": 1938.641,
    "text": "And the flows of each of these nodes are a function of if it were all by all connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1938.881,
    "end": 1940.362,
    "text": "So if there was like an edge here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1941.673,
    "end": 1964.242,
    "text": " then you could just like the fully connected model would be each of the flows would be a function of all four other variables and and you can you could write that out if you wanted but importantly in these bottom two the action and the internal or the autonomous states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.794,
    "end": 1969.155,
    "text": " don't have a direct reliance on external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.316,
    "end": 1973.117,
    "text": "Eta is not in the bottom two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.057,
    "end": 1985.981,
    "text": "And then importantly, the external and the sense states don't have a direct, they're not taking as an argument internal states directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.002,
    "end": 1993.844,
    "text": "That is like the minimal cybernetic constraint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.649,
    "end": 2020.164,
    "text": " we might be then interested in constraining further but um and it FEP may be general it may apply to the to the um all by all case as well but this is the minimal constraint that allows autonomous states active and internal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.761,
    "end": 2048.031,
    "text": " to be under um perceptual and action selection imperatives we don't want to have our finger on the scale on external states or sensory states directly except through action so in any given case the topology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.689,
    "end": 2070.4,
    "text": " itself could be a structure learning question or given a fixed topology parameterizing it is is going to be the question but does it make sense it's like saying does a given structural equation model make sense it just is a function of what data you have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.772,
    "end": 2086.674,
    "text": " Let's see if we can just touch upon subsequent questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.375,
    "end": 2092.538,
    "text": "Is there a common good representation or rubric for evaluating GMGP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.642,
    "end": 2101.003,
    "text": "Does anyone have any thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.581,
    "end": 2138.947,
    "text": " Well, one approach that's not even ACT-INF specific is using the Bayesian Information Criterion or its cousin, the AIC, the Aikiki Information Criterion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.148,
    "end": 2148.732,
    "text": "And the BIC and basically the AIC reward good fit and they penalize models with more parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.433,
    "end": 2153.875,
    "text": "So the BIC is widely used to establish",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.686,
    "end": 2161.051,
    "text": " the Pareto optimal trade-off of model complexity and model accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2162.312,
    "end": 2181.93,
    "text": "So if one is interested in like what is a good generative model, generative process fit, if you just want the sheer fitness, you're going to end up on the slippery slope towards high dimensional generative models, because adding new parameters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.959,
    "end": 2196.322,
    "text": " appropriately, strictly increases model likelihood because new parameters are always sucking up variance that was left unexplained in the noise term by whatever you had previously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2197.222,
    "end": 2203.104,
    "text": " So we don't just want to simply increase the likelihood blind to all other factors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.284,
    "end": 2208.026,
    "text": "We want some sort of balanced measure that penalizes adding more parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.186,
    "end": 2212.668,
    "text": "So that's one approach for model evaluation in the Bayesian space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2212.748,
    "end": 2224.913,
    "text": "And another that is commonly used is a Bayes factor, which is a relative measure of bit amongst multiple Bayesian models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2226.095,
    "end": 2246.451,
    "text": " so the Bayes factor is a ratio between two Bayesian models and so it can be used people have kind of heuristics just like there are heuristics for p-values not even going into the whole question about p-values here but there are also heuristics for Bayes factors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.816,
    "end": 2277.098,
    "text": " whether the evidence of one model over another is like substantial strong decisive etc and Bayes factor allow any models to be compared with each other whereas if we were in the parametric modeling space we would only be able to test using the hierarchical ratio likelihood ratio test the HLRT for parametric models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.43,
    "end": 2281.932,
    "text": " So for parametric models, you can only test nested models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.312,
    "end": 2301.864,
    "text": "Like if you're doing an ANOVA, you can test an effective A, an effective B, and then you can compare that with whether there's an interaction between A and B. But you would have a hard time testing a model with A and B versus a model with B and C, unless you put that into a nested parametric framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.945,
    "end": 2308.028,
    "text": "Bayesian statistics gives us a lot more flexibility to compare models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.877,
    "end": 2334.757,
    "text": " so model selection evaluation comparison those are big areas short answer we're using Bayesian statistics so we have the most modern tools for evaluating that in the specifics it's always going to be the specifics but in terms of the tools for model selection Bayesian statistics has the best tools",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.384,
    "end": 2359.299,
    "text": " All right, how does the particular partition, so 6.1, which we were looking at earlier, or the sort of proto-particular partition, the dyadic partition here, informal, relate to the POMDP in figure 4.3?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.559,
    "end": 2367.585,
    "text": "What would anyone say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.093,
    "end": 2381.939,
    "text": " These are two common figures that we see, but I don't see x, mu, u, and y here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.403,
    "end": 2401.01,
    "text": "Though interestingly, the x and the y in the continuous time representation, they actually do map on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2402.119,
    "end": 2429.719,
    "text": " to the particular partition and um kind of with a v whereas the discrete time pomdp does not use this exact notation what would anyone say why do we have this closed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2430.945,
    "end": 2440.258,
    "text": " cybernetic partition but then it looks like we're moving into a pomdp model with a different topology",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.801,
    "end": 2460.083,
    "text": " I guess in the POMDP model, there should be also an arrow going backwards to the beginning of the.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2460.363,
    "end": 2471.567,
    "text": "So if we are in a state on the right side, there should be somehow a loop back to the beginning, which is here implicit somehow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2475.348,
    "end": 2475.608,
    "text": "That?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.687,
    "end": 2487.335,
    "text": " is called sophisticated active inference, where in the past, present, and future, there can be an inference over the past, present, and future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.497,
    "end": 2490.018,
    "text": "Okay, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2490.558,
    "end": 2493.26,
    "text": "So it is possible, but it's not the base case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.081,
    "end": 2495.882,
    "text": "Yeah, no, yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2498.084,
    "end": 2501.126,
    "text": "So this is unrolled in time, no?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2502.327,
    "end": 2504.029,
    "text": "Exactly, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2504.369,
    "end": 2505.57,
    "text": "This has no time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.265,
    "end": 2535.82,
    "text": " the particular partitions are not defined in time they're defined as functions of other states in the partition because what a Bayes causal graph represents is not as a function of time so it has to be put into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.351,
    "end": 2562.022,
    "text": " a form that allows us to explicitly enumerate time and then in chapter four and then again we'll see in chapter seven and eight we have two ways to deal with time broadly discrete time continuous time discrete time actually models discrete slices of time sequentially",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.014,
    "end": 2592.863,
    "text": " and generates parameterizations for like hidden states and observations at different explicit time points in contrast the continuous time generative model which is being shown like with these one twos and threes instead of the d b and a they're being shown juxtaposed in figure four three to emphasize their structural similarities however",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.707,
    "end": 2614.285,
    "text": " Whereas the discrete time model is explicitly predicting states and observations at different time points, the continuous time model, its B matrix equivalent, is not the next state but rather the derivative of the state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.236,
    "end": 2625.123,
    "text": " And so the continuous time model has more in common with a Taylor expansion or a Volterra expansion or generalized coordinates of motion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.608,
    "end": 2644.657,
    "text": "So in either case, POMDPs help us focus our statistical and informational power on constrained sets of models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2646.463,
    "end": 2671.646,
    "text": " that are uh not too restrictive if we're willing to abide by certain uh standard modeling practices like that the past can't influence the future except through the present or that like a derivative can't have an influence on its second derivative without influencing the first derivative first",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.359,
    "end": 2696.585,
    "text": " so under those standard modeling assumptions that uh reduce the state space vastly like one can imagine if there was 10 time points or 10 derivatives and you did all by all you'd end up with a lot of edges but if you constrain it to time points can only influence next time points and derivatives can only influence the next derivatives then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.853,
    "end": 2724.999,
    "text": " your model scales linearly with time points or derivatives rather than supra linearly so POMTP is one implementation architecture that generates generative models which are compatible with the continuous flow Bayesian physics underlying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.837,
    "end": 2744.578,
    "text": " like you might have some flow or field equations for electromagnetics and then you have some discrete time realization in your simulation that is the relationship i i have a question huh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.64,
    "end": 2752.102,
    "text": " So if you say it's like a Taylor series, then this is somehow deterministic, isn't it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2752.682,
    "end": 2761.604,
    "text": "I mean, in the beginning, in the Taylor series, you say what functions you want to decompose, and then all the parts are a little bit deterministic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2763.224,
    "end": 2766.325,
    "text": "But is it what we are trying to model here?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2766.345,
    "end": 2770.366,
    "text": "Or am I completely wrong?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2773.792,
    "end": 2790.484,
    "text": " I mean, a series you already, I mean, it's maybe infinite, but you know from the beginning what the individual components are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2796.748,
    "end": 2800.731,
    "text": "Anyone else want to give a thought on that, or I can add something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.84,
    "end": 2811.701,
    "text": " Well, it can be deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.542,
    "end": 2826.565,
    "text": "So you could have a model where, for example, there's an identity matrix for A, so hidden states are fully observable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.145,
    "end": 2832.326,
    "text": "Or you could have one where the state transitions are fully deterministic as well in the discrete time case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.466,
    "end": 2834.867,
    "text": "Okay, now in the continuous case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.68,
    "end": 2862.657,
    "text": " um is it deterministic well from a given hidden state you could have a deterministic or non-deterministic emission of observations you can have probabilistic action selection that influences how states change through time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2863.86,
    "end": 2871.226,
    "text": " And the way that they change through time could be sampled, hence also not deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2875.569,
    "end": 2889.52,
    "text": "And I think the Taylor series and variational inference have a lot in common in that you do have to commit to like a given family of distributions that you're wanting to fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.538,
    "end": 2916.48,
    "text": " but then within a given variational family, so you have some data set and you say, and now I'm going to fit this type of distribution to it, you might fit that with the stochastic gradient descent, or there might be a deterministic algorithm to fit it, but it's a little bit too broad of a brush",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.419,
    "end": 2927.563,
    "text": " to think about the bigger picture of using these models and simply say that they're deterministic or non-deterministic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.825,
    "end": 2935.746,
    "text": "I hope that makes sense, because it is a very subtle question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.766,
    "end": 2936.346,
    "text": "Yeah, okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2936.687,
    "end": 2937.287,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2938.967,
    "end": 2945.05,
    "text": "Like, I'm wondering if you could have a non-deterministic... Can a function have a stochastic derivative?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2950.459,
    "end": 2969.454,
    "text": " Well, I don't know, but I mean, somehow if you think of the environment that produces new input and we don't know that environment, then somehow an undeterministic factor is there, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2970.595,
    "end": 2973.577,
    "text": "Yes, the generative process is not shown here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.97,
    "end": 2982.073,
    "text": " The generative process, external states, is handing observations in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.733,
    "end": 2992.057,
    "text": "So the GM, to kind of bring you back to the question, it unrolls and it shows the agent's perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.438,
    "end": 2997.119,
    "text": "This is necessary and sufficient to define the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2999.0,
    "end": 3003.762,
    "text": "But here's the great unknown that's handing the observations to the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3005.0,
    "end": 3028.17,
    "text": " so the GM can be seen as like the cognitive architecture of the agent it is not describing the total scenario that the particular partition is showing so that's one other difference this S is not the actual external states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3029.721,
    "end": 3034.625,
    "text": " This is the agent's variational estimate of external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.286,
    "end": 3035.526,
    "text": "Ali?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.029,
    "end": 3046.876,
    "text": "I think the remark on page 24 of Pat Integral's paper might help to understand this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.566,
    "end": 3061.537,
    "text": " issue a little bit better, especially the second paragraph, which says that from the perspective of an observer, behavior will appear to be fulfilling the epistemic and pragmatic imperatives afforded by expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.597,
    "end": 3077.109,
    "text": "So it's basically the control versus planning or homeostasis versus allostasis when we look at the inference from the point of view of the internal states of the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3077.908,
    "end": 3103.908,
    "text": " and because only the from that perspective can we talk about reducing the generalized free energy right so there's a fundamental difference between looking at this agent from its internal states point of view and looking at it from the external from the point of view of an external observer i don't know if it makes sense but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.677,
    "end": 3112.521,
    "text": " although they're complementary to each other, but in a sense, they're fundamentally different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3114.222,
    "end": 3114.643,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.403,
    "end": 3129.831,
    "text": "And just to look ahead to 9, though I wonder if this might be useful to see in 6, and it relates to the map territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.681,
    "end": 3157.022,
    "text": " question so here's figure 4.3 is in the middle we're parameterizing a pomdp with real computers about a rat in a tea maze or an ant in a colony or a cyber physical entity so we're parameterizing this pomdp but that pomdp is in a parameterized environment as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3162.074,
    "end": 3187.586,
    "text": " and six kind of brings us to that but it would be awesome to see more connective tissue between the particular partition which is where the physics is inheriting from flows on the particular partition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.116,
    "end": 3202.851,
    "text": " and how that relates to this view from the inside of a cognitive agent okay in the final minutes of this chapter six",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.962,
    "end": 3210.784,
    "text": " Okay, last week, I think we explored a little bit about how B and A are two different variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.804,
    "end": 3214.626,
    "text": "They're not directly connected to each other, but they kind of work as a team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3215.286,
    "end": 3220.328,
    "text": "Like B increments the hidden state along, and then the hidden state emits an observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.487,
    "end": 3223.207,
    "text": " Good regulator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3223.708,
    "end": 3227.352,
    "text": "We talked a little bit with Bronwyn at office hours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3227.552,
    "end": 3234.459,
    "text": "We explored good regulator theorem and cybernetics and requisite diversity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.479,
    "end": 3239.525,
    "text": "We talked about what happens to bad regulators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.591,
    "end": 3267.737,
    "text": " Um, we explored also in the office hours last week, a little bit of the discussion around the blanket trick and about how affordance is handled in ACT-INF and some similarities and contrasts with how it is handled in, um, other areas of like other threads of thinking in ecological psychology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3267.757,
    "end": 3267.797,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3271.997,
    "end": 3297.204,
    "text": " in the coming second discussion on chapter six we can return to these bottom three questions temporal depth cognitive systems outside the brain and similarities and differences with active inference and other modeling any final remarks on this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3305.711,
    "end": 3306.272,
    "text": " All right, awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3306.492,
    "end": 3307.334,
    "text": "I will stop recording.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.614,
    "end": 3314.086,
    "text": "Let us take a two minute break and then we will begin for cohort three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.266,
    "end": 3314.707,
    "text": "Thank you all.",
    "speaker": "SPEAKER_00"
  }
]