[
  {
    "start": 2.917,
    "end": 3.938,
    "text": " Hi, thanks everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5.901,
    "end": 13.73,
    "text": "It's 4th of July, 2023, and we're in our second discussion on Chapter 7.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.331,
    "end": 16.854,
    "text": "So we'll head back over there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.914,
    "end": 30.171,
    "text": "Does anyone want to type a question or add any reflection or thought or just question or area they want to look at today?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.191,
    "end": 30.291,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 48.074,
    "end": 73.322,
    "text": " hey well I could say something either yeah please um so I last time I joined was four weeks ago and I was saying about um well I was advocating having python code for um as examples uh I I went away and just coded up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.433,
    "end": 94.972,
    "text": " at the very beginning of chapter seven of the notes, the musical notes, which was sort of transferring, converting the text into Python with his comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 95.012,
    "end": 96.795,
    "text": "It didn't really get me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.02,
    "end": 111.719,
    "text": " It it showed the reasons why the matrices contain the numbers they did it didn't really say much more than that, but i've just discovered a pendant see in the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 113.041,
    "end": 115.545,
    "text": "And in a way that goes through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 115.585,
    "end": 118.429,
    "text": "Something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 120.451,
    "end": 142.999,
    "text": " similar although it doesn't explain the matrices the precise numbers in each matrix in quite so explicit way and then in later on in chapter seven there's the maze example and again that these are all",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 144.97,
    "end": 158.606,
    "text": " Billing in with the application, but then it's, it's throwing, it's just formatting the data to the point where it can then be given to an SPM 12 function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.006,
    "end": 159.727,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.747,
    "end": 167.316,
    "text": "So MDP there without, so I would like to see",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 169.321,
    "end": 196.408,
    "text": " what's inside there and then be able to graph, for example, various metrics like equations, things like mutual information, novelty, to help get an intuitive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.08,
    "end": 197.5,
    "text": " feel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 198.722,
    "end": 223.527,
    "text": "Appendix C says about being able to play around with the numbers to get an intuitive understanding, but I'd want to see more than just playing around with the matrices, the inputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 225.008,
    "end": 253.918,
    "text": " so yeah so it's just an update on on where I am really thank you yeah appendix C is very sparse um and it doesn't um I mean they would have done well potentially to have just simply provided the reproducibility code for each figure without interspersing it with plain text hmm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 255.097,
    "end": 257.9,
    "text": " because then it's kind of this reverse engineering process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 257.98,
    "end": 282.522,
    "text": "But what you said is absolutely right on, which is the entire POMDP, the entire figure 4.3 discrete time model, it's all the letters that we talk about, A, B, C, D, and then E, which is just given the letter V here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.767,
    "end": 305.117,
    "text": " and then the true starting condition and then then you just let it run now here's the spm mdp vbx variational base um x i'm sure exactly what the x is but i i've heard that this is sort of a like um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.667,
    "end": 327.763,
    "text": " not inscrutable but it's not simple to to translate this function just straightforwardly to python which is one reason why um like many people do can continue using the um the matlab variant",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.895,
    "end": 338.207,
    "text": " Because this contains a lot of like accelerated methods that are, and it contains like a lot of extra bells and whistles to generate the figures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 338.287,
    "end": 339.568,
    "text": "And so that makes it quite easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 340.289,
    "end": 354.325,
    "text": "But in general, it speaks to exactly what chapter six highlights, which is that active inference modeling is about representing the agent in the environment and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.305,
    "end": 382.725,
    "text": " and then the methods for for letting the agent come to its own solutions are straightforward rather than needing to do a secondary and at some computational scale yes um further techniques are needed but to a first approximation the work of understanding a system of interest is in exactly specifying the dimensionality of the matrices",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.427,
    "end": 387.993,
    "text": " same as in PI MDP in model stream seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.601,
    "end": 394.403,
    "text": "But yeah, how was it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.503,
    "end": 404.899,
    "text": "I mean, did you see the matrices any differently or think about the models any differently?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.487,
    "end": 413.44,
    "text": " What I coded up was really just to get an idea of how things might be coded up.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.46,
    "end": 419.369,
    "text": "And this wasn't to have something that was certainly not anything that was simulation efficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 419.609,
    "end": 421.172,
    "text": "It was something very clumsy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.512,
    "end": 432.81,
    "text": "So, for example, what you're showing there with the B matrix, it would be explaining why the 97s are there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 432.79,
    "end": 436.015,
    "text": " in those particular places.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 437.457,
    "end": 457.347,
    "text": "So starting off with a, well, an all zeros matrix, or maybe an all ones in this case, and I know it's normalized there, but so that you can, you're then describing the matrix B directly in terms of the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.327,
    "end": 483.283,
    "text": " the application you don't need the separate bits of text just just to explain what there is there so I think I think that was helpful um or would be helpful as part of the wider uh if that was taken to completion and possibly the teammates one could be taken further um and would have been more useful",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 485.238,
    "end": 502.69,
    "text": " yeah but but yeah it's it's for me it's it's getting inside those those functions to see what's see what's going on um because i don't have any",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.952,
    "end": 505.314,
    "text": " any real feel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 505.494,
    "end": 512.523,
    "text": "So I'd like to be able to see, well, here's free energy changing as various things happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 514.166,
    "end": 532.39,
    "text": "And it's comprised of these different factors, or it can be interpreted in this different way so that you can then play around with the numbers, say, to put it into a position where there is novelty and you can see the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 532.37,
    "end": 540.098,
    "text": " the aspect, the term of free energy that's described as novelty and see the effect on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 541.079,
    "end": 555.713,
    "text": "So I think that would give me a much better feeling rather than the SPM 12 is just a black box solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 557.695,
    "end": 557.955,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 559.083,
    "end": 572.62,
    "text": " yeah cool and if and if you want to we can post on the textbook group um repo so maybe we can then use it and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.363,
    "end": 589.427,
    "text": " You know, chapter seven eventually have every single example, potentially even in multiple languages, but sorted like according to the numbering of the textbook.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.006,
    "end": 611.449,
    "text": " so at the end of probably cohort two I there was I put some comments of you know I'd be interested in setting or be involved in a group that was basically doing what I've I've said uh well to to unpick um pi MDP",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 612.087,
    "end": 617.893,
    "text": " And someone made a comment of, well, you could just code up the equations that are in the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.613,
    "end": 621.896,
    "text": "And maybe that's the right approach.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.079,
    "end": 635.289,
    "text": "Because I've looked into SPM12 and the data structures in there are just horrendously complicated, really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.553,
    "end": 641.335,
    "text": "So trying to get into that would be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.973,
    "end": 643.475,
    "text": " would be very difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 644.315,
    "end": 651.523,
    "text": "But maybe just building up from the equations in the book would be would be manageable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.769,
    "end": 656.909,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.83,
    "end": 660.132,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.192,
    "end": 660.593,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.613,
    "end": 668.261,
    "text": "Um, anyone else want to bring up anything or ask anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.281,
    "end": 670.343,
    "text": "Or we can look at the questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.09,
    "end": 683.303,
    "text": " Okay, not I don't remember exactly which ones we may have addressed last time but.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.047,
    "end": 687.191,
    "text": "Okay okay that's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.416,
    "end": 690.238,
    "text": "what's happening here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.645,
    "end": 695.048,
    "text": "logged in under a difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 703.904,
    "end": 707.189,
    "text": " Those are the thumbs up that I knew had to be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.209,
    "end": 708.591,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.757,
    "end": 715.721,
    "text": "What do the rows, columns, and numbers mean in equation 7.2?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.465,
    "end": 724.374,
    "text": "To check your understanding, could you design another B matrix that could be used in the music example or another example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.996,
    "end": 728.68,
    "text": "So the simple answer is no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.828,
    "end": 734.778,
    "text": " Each cell represents the probability of moving from a row to a column.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 735.639,
    "end": 737.462,
    "text": "And these are the notes 1, 2, 3, 4.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.044,
    "end": 744.173,
    "text": "With this 1 over 100, so that summing across, you get 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 745.755,
    "end": 756.372,
    "text": "This musician, it has a 97% accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.622,
    "end": 785.093,
    "text": " uh correctness in in moving forward through this song and uh as we look towards what kinds of like questions and variants would help us deepen understanding like what would it look like to be more accurate well there'd be a 98 or what would it look like if the third note to the fourth note was really hard or what would it look like if there was five notes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.866,
    "end": 791.674,
    "text": " or write a 12-tone composition using 12 notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 793.276,
    "end": 795.9,
    "text": "But anyone else want to have any comments or thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 799.545,
    "end": 800.627,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.647,
    "end": 808.037,
    "text": "Pretty straightforward question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.057,
    "end": 812.303,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 812.323,
    "end": 813.865,
    "text": "In the caption of Figure 7-2,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.84,
    "end": 823.185,
    "text": " It says lower left negative free energy gradients, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.225,
    "end": 824.567,
    "text": "prediction errors through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.408,
    "end": 828.191,
    "text": "Well, first issue, it's empty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.733,
    "end": 836.861,
    "text": "That may have been fixed in some subsequent, like not a full reprinting, but that may have been fixed, but it's empty there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.703,
    "end": 843.389,
    "text": "What are similarities or differences between prediction error and free energy gradients?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 843.469,
    "end": 844.43,
    "text": "Are they the same thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 845.291,
    "end": 847.654,
    "text": "What's the difference between free energy and free energy gradients?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.814,
    "end": 848.695,
    "text": "What is a gradients?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.472,
    "end": 900.889,
    "text": " here i'm going to look to actually this question which we looked at earlier today so this question from chapter two asked um prediction error surprise and variational free energy they're related to each other but it's sometimes confusing and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.08,
    "end": 917.832,
    "text": " to kind of look at this again, the best fitting model with the most model evidence is gonna have the lowest prediction error, the lowest surprise and the lowest variational free energy, but there are subtle differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 918.048,
    "end": 925.656,
    "text": " prediction error is a simple differential between prediction and observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.477,
    "end": 933.745,
    "text": "So if the prediction is 10 and the observation is 11, the prediction error is positive one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.686,
    "end": 941.333,
    "text": "It's in the units of whatever the observations are about temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.353,
    "end": 946.418,
    "text": "Surprises in information, theoretic quantity, every single...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.068,
    "end": 965.706,
    "text": " data point observation is on a distribution is associated with some non-zero surprise value but it can be minimized and it's minimized when the prediction error is lowest and variational free energy is described in equation 2.5",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.34,
    "end": 972.497,
    "text": " So it's not exactly the same as surprise, but it's a bound on surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.119,
    "end": 974.182,
    "text": "That's kind of the whole point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.025,
    "end": 979.459,
    "text": "And it's lowest when all of these things are kind of in unison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.08,
    "end": 1005.261,
    "text": " then ali also highlighted that surprise is what is calculated in exact bayesian inference where model evidence is maximized via surprise minimization however where exact bayesian inference is intractable then we utilize approximate bayesian inference and there's two ways that you could go about doing that one approach would be a sampling based approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.848,
    "end": 1014.021,
    "text": " But that would be enormously computationally costly in certain settings, and you wouldn't really know when you've reached the right time to stop sampling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.842,
    "end": 1026.54,
    "text": "But variational inference allows you to approximate Bayesian inference by bounding the surprise with a free energy, and that's the evidence lower bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.723,
    "end": 1037.679,
    "text": " And it gets to the last piece of the question, which is what is a gradient so gradient is a rate of change, it could be on a two dimensional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.322,
    "end": 1049.457,
    "text": "surface, the rate of change, like just a ruler at the angle of the rate of change of that local point you could have a gradient in one dimension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.398,
    "end": 1057.54,
    "text": " You could have different dimensionalities of gradients, but basically there's a local rate of change around some point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1058.127,
    "end": 1067.936,
    "text": " And so it's like, if you have beliefs about the temperature and the 10, and then the observation comes in and it's 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.956,
    "end": 1072.3,
    "text": "So that's associated with some prediction error, some surprise, and some free energy gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.02,
    "end": 1080.067,
    "text": "And then the gradient should steer you towards updating your prediction from 10 upwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1081.048,
    "end": 1085.772,
    "text": "Under the full attention setting, you would go from 10 all the way to 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.275,
    "end": 1091.964,
    "text": " Under a no attention setting, you wouldn't move at all, but you'd want to move from 10 towards 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1092.004,
    "end": 1099.316,
    "text": "That's the gradient or the flow going towards 11, whereas you wouldn't want to go uphill towards like nine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.139,
    "end": 1101.881,
    "text": "Thank you, Ali.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.67,
    "end": 1107.951,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.415,
    "end": 1111.877,
    "text": "Let's replace this in the figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.983,
    "end": 1119.004,
    "text": " I'll do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1120.086,
    "end": 1121.728,
    "text": "Okay, any other thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1121.748,
    "end": 1135.725,
    "text": "A little bit unclear with the dark lines because they're all crossing and everything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.047,
    "end": 1145.037,
    "text": "But the kind of moral of the story is when something happens, there's a transient...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.569,
    "end": 1174.129,
    "text": " um adjustment of the model but also as we we've discussed um like we're in discrete time so it's it's not immediately clear why there's interpolated continuous values okay maybe this is speaking to this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.425,
    "end": 1206.462,
    "text": " yeah so figure 72 and 77 have these curves where belief updating is happening faster and the text alludes to some sort of simulation machine yeah i believe that is the um the stock machinery of the spm package but i'm not exactly sure um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.825,
    "end": 1236.651,
    "text": " yes it does include like when we just like when we looked at the um the spm vbx it has a section on um dopamine and i think that that is being um displayed in in continuous time interpolated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.2,
    "end": 1242.865,
    "text": " But i'm not exactly sure why that happens, and I think it would be more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1245.108,
    "end": 1250.695,
    "text": "Clear given our discrete time setting to just show a point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.256,
    "end": 1253.798,
    "text": "associated at each time step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.221,
    "end": 1259.685,
    "text": "Does anyone have like any other like thought on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.802,
    "end": 1304.825,
    "text": " Okay, what is factorization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1306.607,
    "end": 1310.61,
    "text": "In factor graphs, in the brain, and conceptually?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1314.074,
    "end": 1315.475,
    "text": "What is anyone's thought on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.465,
    "end": 1328.788,
    "text": "Okay, let's look at what others have for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.332,
    "end": 1342.376,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.396,
    "end": 1349.727,
    "text": "So factorization is when variables operate statistically independently from one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.747,
    "end": 1363.247,
    "text": "So you can have the joint distribution of, let's just say A and B here, but we're not talking just only about the A and the B matrix, but actually it turns out that those are factorizable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.227,
    "end": 1379.65,
    "text": " um but here's just being used generically and so it allows you to um break down the statistical joint estimation of a comma b into a times b so for example if you're rolling a die and flipping a coin",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.967,
    "end": 1395.144,
    "text": " You can talk about the joint probability of all 12 options of heads or tails and one through six, but also you can approach that by saying, well, there's a one half probability of heads and a one sixth of getting a three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.945,
    "end": 1403.633,
    "text": "So you're able to calculate the joint distribution via separating out the coin flip from the die because they don't influence each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.354,
    "end": 1409.62,
    "text": "Whereas if they did influence each other, then it wouldn't be factorizable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.118,
    "end": 1440.298,
    "text": " um neurologically one of the most common places where people discuss factorization is with the what and the where stream in the brain and the idea here is like an object's identity should be factorizable from its for example location in the visual field or size visually because um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1440.768,
    "end": 1444.474,
    "text": " You want to be able to separate out what something is and where it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.494,
    "end": 1456.553,
    "text": "And people have identified these two streams of visual information flow that reflect the what and the where.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.997,
    "end": 1460.719,
    "text": "So I'll bring this in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.001,
    "end": 1464.525,
    "text": "But the what and the where are these two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1464.545,
    "end": 1466.188,
    "text": "Oh, funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.029,
    "end": 1467.45,
    "text": "Pozoa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.244,
    "end": 1497.066,
    "text": " um these two streams of visual input so people have have kind of like it's it's one of those things where it's like the structure of the inference architecture recapitulates the structure of the problem because again we would expect vision to have um that kind of factorization between what an object is and where it is and um here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.447,
    "end": 1519.527,
    "text": " someone has added an example about um fruits and berries different properties but they're all kind of related to ripeness ollie",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.966,
    "end": 1537.853,
    "text": " also in terms of category theory factorization means that I mean every function can be written as a kind of composite function of a surjective function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.12,
    "end": 1539.983,
    "text": " and an injective function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.063,
    "end": 1553.141,
    "text": "So in other words, the factorization system for a given category consists of two sets of morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1554.203,
    "end": 1563.756,
    "text": "So one of which have the ability to contain all the isomorphisms of the given category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.073,
    "end": 1570.188,
    "text": " And also they're closed under the composite function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1570.269,
    "end": 1581.677,
    "text": "So in this sense, factorization system can give rise to the concepts, some other concepts in category theory, such as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.67,
    "end": 1592.744,
    "text": " And also an important property of factorization system is each factorization is itself a functorial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1593.425,
    "end": 1607.023,
    "text": "So two, I mean, they can be regarded as two morphisms that can be mapped onto each other by commuting arrows or morphisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1607.324,
    "end": 1621.74,
    "text": " So, yeah, it's one of the important concepts in category theory as it gives rise to some other concepts such as equivalency and orthogonality and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.76,
    "end": 1622.582,
    "text": "Cool, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.105,
    "end": 1645.46,
    "text": " One other point and the reason why factor graphs and factorizations are even being discussed is the connections in the Bayesian graph reflect which variables have influence on each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.44,
    "end": 1653.567,
    "text": "So for example, O of T minus one is only influenced by hidden state of T minus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.568,
    "end": 1659.673,
    "text": "So it's like through the A matrix and similarly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1660.193,
    "end": 1664.637,
    "text": " And so it's not the case that all variables have an edge to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.518,
    "end": 1677.55,
    "text": "First off, that would cause connections like through time, which would violate the Markovian property, which says that the only way that the past can influence the future is through the present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.57,
    "end": 1679.973,
    "text": "So that's a massively simplifying assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1680.373,
    "end": 1690.183,
    "text": "If you think about a time series with 100 time steps, if you enable every time step to be possibly connected to every other time step, you're going to end up with",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.075,
    "end": 1693.859,
    "text": " calculated out, but however many hundreds and hundreds of edges.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.8,
    "end": 1712.226,
    "text": "Whereas if you abide by the Markovian property, which is at least a defensible statistical approximation, if not even more valid than that, the Markovian property in time simplifies out how many edges you have to fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.207,
    "end": 1720.137,
    "text": "But also there are sparseness about like pi doesn't reach down to influence observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.673,
    "end": 1726.763,
    "text": " And so that first off captures something important and structural about the problem we're trying to solve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.424,
    "end": 1736.619,
    "text": "We don't wanna even open the door to an opportunity for policy to just be like changing our observations with a thumb on the scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.48,
    "end": 1740.505,
    "text": "Nor do we want policy to simply",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.738,
    "end": 1767.15,
    "text": " intervene directly in a hidden state but rather with the b matrix we have policy intervening in how hidden states change through time so the sparseness um relative to the all by all edges that could exist the sparseness helps embody the statistical and causal nature of the problem and it's massively computationally simplifying so that's why factorization comes into play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.268,
    "end": 1798.656,
    "text": " um related factorization and the recipe of chapter six why are there two a matrices so let's just clarify which example so this is probably about the maze yeah okay so this is about the maze on page 131 okay okay didn't see that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1803.884,
    "end": 1826.584,
    "text": " there are two modalities that represent exteroceptive sensory data pertaining to where so that's just the location of the um uh rat in the maze and also there's a what modality that is like am I tasting something delicious or or not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.712,
    "end": 1855.407,
    "text": " And so just like the what and the where in the brain, there are two matrices and they have different shapes because the location, the where a matrix maps locations to location cues to location hidden states, true locations, which is here a noiseless mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.31,
    "end": 1872.05,
    "text": " And the second modality maps location to whether there is no tasty queue or aversive queue at these two locations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.09,
    "end": 1879.381,
    "text": "So when the mouse is in the center junction or down in the bottom, we're in this dashed line row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.923,
    "end": 1884.027,
    "text": "And then in this example, the right side,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.458,
    "end": 1888.923,
    "text": " has the black circle and the left side has the white circle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1902.142,
    "end": 1905.306,
    "text": "Any other thoughts or comments on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1918.33,
    "end": 1918.71,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1919.771,
    "end": 1921.473,
    "text": "I think this little test question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.475,
    "end": 1930.401,
    "text": "Don't know if we left this for ourselves or someone else's dropping test questions for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1932.723,
    "end": 1934.945,
    "text": "Walk through the section from 131 to 135.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1935.205,
    "end": 1937.627,
    "text": "Explain all the rows, columns, subscripts, and values.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1942.092,
    "end": 1945.975,
    "text": "We just described the A1 and A2 matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.232,
    "end": 1956.12,
    "text": " Columns are locations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.744,
    "end": 1960.089,
    "text": "In the A1 matrix, these are queues of locations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.632,
    "end": 1966.262,
    "text": "And then in the A2 matrix, these are what is at the location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.503,
    "end": 1967.946,
    "text": "So where and what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.988,
    "end": 1979.421,
    "text": " This is the same, except now the black is on the left instead of on the right, and so we see that reflected with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1980.703,
    "end": 1982.386,
    "text": "Here we have a one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1985.432,
    "end": 1988.358,
    "text": "And a 98 on the right and a one on the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.52,
    "end": 1992.887,
    "text": "Here's the one has moved up a row and the 98 is on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.773,
    "end": 2023.127,
    "text": " b2 is not influenced by policy one stays at one and one stays at one so it's kind of like a matrix having the diagonal um the identity matrix for a is kind of like the trivial",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.495,
    "end": 2026.739,
    "text": " noiseless perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.56,
    "end": 2030.543,
    "text": "Observations just map one-to-one to hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2030.983,
    "end": 2038.092,
    "text": "And similarly, a B matrix with an identity diagonal is kind of like trivial action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.133,
    "end": 2041.435,
    "text": "Because if you're in this state, you stay there 100% of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.455,
    "end": 2043.858,
    "text": "And if you're in that state, you stay there 100% of the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.919,
    "end": 2045.6,
    "text": "But that's B2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.76,
    "end": 2046.862,
    "text": "They're just getting that out of the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.422,
    "end": 2049.064,
    "text": "They're basically saying whatever you do,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2050.428,
    "end": 2056.76,
    "text": " you're not changing the structure of the problem in terms of the location of the food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.682,
    "end": 2061.489,
    "text": "And that's saying that the rat has no control over the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.152,
    "end": 2071.288,
    "text": "However, they are going to focus in on the four slices of the B matrix",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2072.045,
    "end": 2077.593,
    "text": " So the B matrix is intermediating hidden states and how they change through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.034,
    "end": 2082.962,
    "text": "So the hidden state S is about the true location that the rat is in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.582,
    "end": 2084.924,
    "text": "So there's four locations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2086.347,
    "end": 2098.525,
    "text": "And the B matrix is going to describe the transitions in location under the four different action policies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.698,
    "end": 2111.711,
    "text": " And so there are certain states that you can't, well, this is four matrices that the rat can choose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.873,
    "end": 2119.6,
    "text": "They allow for a move from any state except for the left and right arm to any other state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.701,
    "end": 2122.904,
    "text": "However, the right and the left arms are absorbing states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2122.964,
    "end": 2123.905,
    "text": "The rat must stay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.049,
    "end": 2128.375,
    "text": " So here we have the absorbing state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.797,
    "end": 2131.039,
    "text": "Here's one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.099,
    "end": 2133.944,
    "text": "If you're on the left, you stay on the left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.745,
    "end": 2137.55,
    "text": "And if you're on the right, you stay on the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.453,
    "end": 2143.4,
    "text": "And then here, whether you're here or here, you transition to go into the right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.981,
    "end": 2145.824,
    "text": "So I guess it can jump from here to there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2149.169,
    "end": 2149.69,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.8,
    "end": 2173.618,
    "text": " c is the preference vector the um c c1 is for for again the location and this just kind of pushes it off the starting location so it does something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.016,
    "end": 2198.712,
    "text": " and then here in the c2 is the preference for over the context observations like the preferring the tasty food not the aversive and then just note that because these are in like natural log kind of or they're an e to the exponentiation um a six means that the attractive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.113,
    "end": 2205.519,
    "text": " Is E to the sixth more rewarding or more preferable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.163,
    "end": 2210.964,
    "text": "D is the prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.024,
    "end": 2215.368,
    "text": "It has a perfect true belief about its starting location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.789,
    "end": 2229.12,
    "text": "And regarding the context, it has a 50-50 uncertainty about the equal probability of which context it's in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.58,
    "end": 2261.453,
    "text": " but this is a good question so there we've we have the two matrices the one and two so going back to what we were saying earlier if you were going to feed that into spm12 would you then um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2262.698,
    "end": 2277.242,
    "text": " multiply those A1 and A2 together, a sort of a Kronecker matrix to get something that was something like maybe 16 by 15 there, a big matrix.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2277.803,
    "end": 2287.879,
    "text": "And what we're saying is in this application, you're able to, the what and the where are separable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.382,
    "end": 2318.322,
    "text": " um but to use use spm12 you would you would have to multiply these together um so a chronicle product or um yeah is that what would be done I think we'd have to look but my understanding is that the s true location",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2319.736,
    "end": 2330.915,
    "text": " And the true awareness would be multiplied by this A matrix to give the where observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.117,
    "end": 2342.976,
    "text": "And then the true context would get multiplied by this, which is uninformative about which context it's in if you're in the bottom here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.901,
    "end": 2351.832,
    "text": " And so the true context would be emitted through A2 to the context observation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.975,
    "end": 2368.395,
    "text": "However, there's many situations, speaking a little more generally, where you can hack it into a huge single matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.415,
    "end": 2373.402,
    "text": "Like you could imagine there's four locations, or like just speaking of the observations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2374.377,
    "end": 2395.138,
    "text": " Um, you could have five locations with no reward five with the black and five with the white and a 15 across or in a 15 row matrix where every combination of location and, um, context is a unique one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.4,
    "end": 2396.5,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.52,
    "end": 2398.302,
    "text": "That defeats the whole point of factorization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.185,
    "end": 2401.545,
    "text": "Mm-hmm yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.565,
    "end": 2402.646,
    "text": "The factorization makes it usually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2403.183,
    "end": 2406.208,
    "text": " Gareth J. More simple yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.228,
    "end": 2413.281,
    "text": "Gareth J. yeah except there may be some interesting settings were very, very large sparse matrices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2414.523,
    "end": 2420.614,
    "text": "Gareth J. may have some special computational representations that actually might make that efficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.838,
    "end": 2424.381,
    "text": "Gareth J. But not in this scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.364,
    "end": 2432.946,
    "text": " How can we read equations such as 7.8?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.966,
    "end": 2444.701,
    "text": "Okay, this is a little bit of a general comment that might be better fit for the math learning group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.086,
    "end": 2449.227,
    "text": "So I'll just throw it over there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.797,
    "end": 2458.519,
    "text": "And now to 7.8.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.596,
    "end": 2464.263,
    "text": " We don't have the natural language description, human written.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.283,
    "end": 2466.907,
    "text": "However, let us go to the AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2469.711,
    "end": 2470.292,
    "text": "See how it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.14,
    "end": 2482.069,
    "text": "Okay, 7.8, LaTeX, Coda AI columns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.795,
    "end": 2488.759,
    "text": "Okay, this is a pretty...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2489.33,
    "end": 2515.084,
    "text": " straightforward reading the epistemic value i of pi is being calculated um based upon the posterior predictive entropy and the expected ambiguity not very helpful explanation this one is why would a high school student be interested in it they may not be interested",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.562,
    "end": 2519.305,
    "text": " Think higher of high school students.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.39,
    "end": 2526.577,
    "text": "Here's a column asking about where it might be important, and here's defining the variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2527.339,
    "end": 2533.409,
    "text": "So not super helpful for exactly what we're looking for, but it gives a look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.631,
    "end": 2538.017,
    "text": "But to return to the question of reading it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.072,
    "end": 2548.198,
    "text": " Anyone want to just pick a line and read how they see it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2559.536,
    "end": 2571.615,
    "text": "Okay, I won't go verbatim, but the epistemic value, so we're just looking at the epistemic aspect of the equation 2.6, expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.118,
    "end": 2598.058,
    "text": " h is an entropy so it's describing how blurry or peaked a distribution is and this is about the observation distribution through time tilde conditioned on action so if our action is associated with very blurry observations then it's going to be high entropy whereas if the observation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.578,
    "end": 2619.777,
    "text": " um entropy is is very low then those observations have have um lower entropy so if um yeah if if we're getting like a a broad spectrum of observations from policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2620.803,
    "end": 2649.021,
    "text": " that would have higher epistemic value whereas like if there if you know that every time you um open this book it's like this it's going to give you the same 100 time steps the same data then it's not as informative and here is an entropy about essentially the a matrix because it's discussing the relationship between the observations conditioned upon hidden states um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.14,
    "end": 2677.438,
    "text": " also being conditioned upon the policy but this kind of goes without saying about the conditioning of over policy because basically everything is going to be conditioned upon a policy because the epistemic value is something that's computed on a per policy basis here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.802,
    "end": 2687.093,
    "text": " Matt Bolian- mutual information which Neil alluded to earlier it's a very interesting quantity, especially because, like it's it's an equivalence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2691.518,
    "end": 2700.049,
    "text": "Matt Bolian- We have Q of s given pie on both sides, so this part is like kind of not changing for a given policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.191,
    "end": 2706.818,
    "text": "Matt Bolian- And here we have P of observations given hidden states it's like the a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.097,
    "end": 2734.999,
    "text": " relationship to the variational posterior on observations given policies so again everything's conditioned on policy so it's kind of like p o s difference or divergence with q of o so if um s is um it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2736.987,
    "end": 2744.557,
    "text": " If the O's are the same and S doesn't change anything, then the divergence is low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2746.64,
    "end": 2762.742,
    "text": "If you can imagine if S tilde added nothing, conditioning on S added nothing, conditioning on the true temperature, the sequence of thermometer observations was the same, then knowing the true temperature didn't help you at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2763.177,
    "end": 2767.622,
    "text": " So the mutual information would be low.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.144,
    "end": 2788.686,
    "text": "Whereas if knowing the hidden states were to provide information, then P of O conditioned on S would differ from Q of O. I'm not 100% confident on any of these readings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.746,
    "end": 2790.248,
    "text": "I'm just kind of just saying them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.472,
    "end": 2804.466,
    "text": " And this last one is, um, again, after you kind of ignore the pies here, it's Q of S Q of S condition on observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.607,
    "end": 2811.514,
    "text": "So if the observations are meaningless, then this term is zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2813.196,
    "end": 2821.686,
    "text": "Whereas if the observations do matter, conditioning on O does matter, then there is, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.252,
    "end": 2835.203,
    "text": " a positive information gain and i'm not exactly sure what this little supplement is adding",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.567,
    "end": 2862.0,
    "text": " other than describing the factorization relationship it's saying the variational distribution of hidden states through time condition on policy and observations so kind of like our inference about true temperature depending on what we do and the observations from the thermometer is defined as equal sign with a triangle and here's essentially a factorization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.537,
    "end": 2886.773,
    "text": " probably derivable from the bayesian theorem and the sparsity of the generative model pos is like the a matrix q of s given pi is basically the b matrix and then this is um the downstairs bit which was seen up here ali",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.448,
    "end": 2899.32,
    "text": " Dmitriy Kuniskyi, Thanks yeah well, if I may give a kind of more informal reading of this equation so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2901.263,
    "end": 2910.516,
    "text": "Dmitriy Kuniskyi, Here well this equation basically means that both I mean extrinsic and epistemic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.918,
    "end": 2925.045,
    "text": " uh work together to somehow increase uh the um the likelihood of our preferred outcomes uh with by minimizing the uncertainty so for example that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.599,
    "end": 2946.19,
    "text": " The extrinsic value depends on the posterior predictive entropy, as shown in the first line, which can only be informative if the agent can be certain about a current state or its current state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2946.17,
    "end": 2962.073,
    "text": " So it means that epistemic uncertainty should first be resolved before any kind of action or any kind of utility will come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2963.075,
    "end": 2965.478,
    "text": "And also, at the same time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.943,
    "end": 2979.197,
    "text": " if the agent is confident enough in its current estate, it shouldn't somehow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.346,
    "end": 2991.823,
    "text": " undertake or perform in a kind of epistemic actions that would seek to pursue a kind of successful plan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2993.366,
    "end": 3001.577,
    "text": "And especially this is related to the exploitation exploration dilemma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.238,
    "end": 3007.345,
    "text": "So briefly, as also we talked about in the previous session,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.325,
    "end": 3019.721,
    "text": " Well, minimizing free energy corresponds directly to approximate Bayesian inference by choosing the least surprising outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3020.663,
    "end": 3035.222,
    "text": "So if the agents could somehow model their environments, they need to have posterior beliefs about the amount of the control they have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3035.202,
    "end": 3039.248,
    "text": " upon the state transitions producing those outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.25,
    "end": 3059.539,
    "text": "In other words, we need to somehow take into consideration the posterior beliefs about those controlled states, which by turn relies on prior beliefs about those controlled outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3059.519,
    "end": 3086.995,
    "text": " Yeah, I mean, by using this kind of principled way of resolving the uncertainties, or in other words, resolving the prior uncertainties based on the control states that can minimize the expected free energy, we can somehow",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.975,
    "end": 3101.141,
    "text": " achieve a theory that can provide a formal definition for that epistemic value or the value of the information we can gain from the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3101.982,
    "end": 3110.738,
    "text": "Also, it somehow focuses the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3111.68,
    "end": 3124.423,
    "text": " the importance of the purposeful behavior that also that also relies on the generative models that generate those or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.893,
    "end": 3131.722,
    "text": " Rameen Mohammadi, consider those future outcomes, so this is basically the formulation that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.523,
    "end": 3143.879,
    "text": "Rameen Mohammadi, includes or unifies some of the perspectives or pre established perspective, such as the kale control theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.54,
    "end": 3146.783,
    "text": "Rameen Mohammadi, and many other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3147.016,
    "end": 3150.6,
    "text": " previously established perspectives and approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.582,
    "end": 3175.251,
    "text": "So in case anyone wants to further explore the derivation of epistemic value and the implications of it, I highly recommend one of the earlier papers by Friston et al., namely Active Imprints and Epistemic Value from 2015.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3177.29,
    "end": 3178.012,
    "text": " Oh, awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3178.753,
    "end": 3179.094,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.039,
    "end": 3182.081,
    "text": "Sten 2015.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.334,
    "end": 3187.635,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3187.735,
    "end": 3189.038,
    "text": "I'll add it in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.96,
    "end": 3210.807,
    "text": " Yeah, a lot of, well, we know pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.83,
    "end": 3223.685,
    "text": "Unlike reward maximization, our active inference concept of pragmatic value is the alignment between preferences and observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.506,
    "end": 3233.959,
    "text": "So that does the kind of kernel work of preference satisfaction and homeostasis",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.327,
    "end": 3253.416,
    "text": " And then epistemic value, depending on the sophistication of the generative model and what other features it contains, like learning and nested structure, attention, and so on, epistemic value does a ton of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.054,
    "end": 3262.807,
    "text": " And that's exactly what we point to as what is missing in, for example, reward learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.769,
    "end": 3264.81,
    "text": "Two huge issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.131,
    "end": 3270.238,
    "text": "First off, it works well when you know what the reward function is, but discovering it is an issue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3270.298,
    "end": 3278.07,
    "text": "And even when you do, and if you do discover it, or a proxy or a heuristic or however you want to think about it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.303,
    "end": 3288.853,
    "text": " All you've really done is just coerced, shoehorned different components of epistemic value into the currency of pragmatic reward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.994,
    "end": 3299.983,
    "text": "So with equation 2.6 and expected free energy, we get to delineate epistemic and pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.784,
    "end": 3306.589,
    "text": "And then the challenge of parameterizing these models is to balance them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3307.058,
    "end": 3321.394,
    "text": " For example, if the preference vector of the maze was six one billionths, then maybe it's not as big of a deal in comparison to the epistemic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3321.575,
    "end": 3331.005,
    "text": "And in contrast, where the preference is 100 million versus negative 100 million, you see more overall pragmatically oriented behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.706,
    "end": 3336.812,
    "text": "So expectation pursuing aversion repulsing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.842,
    "end": 3367.035,
    "text": " Well, an interesting chapter, learning, more technical details, some equations that we haven't always gone through, but again, I hope for all of these equations that we end up with natural language and pseudocode and code representations, more examples that are just sort of briefly touched upon,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3367.943,
    "end": 3371.428,
    "text": " Massive topics like structure learning just being essentially alluded to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.448,
    "end": 3378.938,
    "text": "And hierarchically nested models, in this case, a discrete time and a discrete time model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3379.439,
    "end": 3382.423,
    "text": "You can tell because of the minus one t, t plus one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.124,
    "end": 3386.509,
    "text": "Little figure 4.3, fractal figure 4.3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3389.999,
    "end": 3406.783,
    "text": " And then another kind of discrete state space discrete time but here nested model it's kind of like a three four song like 123223 with this nested time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3411.069,
    "end": 3411.67,
    "text": "that's seven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3421.758,
    "end": 3422.117,
    "text": " Well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.259,
    "end": 3452.659,
    "text": " next week we um turn to eight continuous time I think that we've um hopefully surfaced a lot of opportunities for improvements of the um questions and discourse code equations explanations and so on because seven definitely is uh moving lightly through multiple examples",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3454.934,
    "end": 3479.389,
    "text": " and results and topics and and so I think there could be a lot of good work with us um sweeping our trail and adding questions that we wish would have been asked or would have been added to uh connect the dots and then chapter 8 is going to head into the continuous time setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.938,
    "end": 3493.131,
    "text": " and close on hybrid models, which have continuous and discrete time components before chapter nine goes into the model, uh, database modeling and chapter 10 concludes it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.752,
    "end": 3496.315,
    "text": "So thanks everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3496.915,
    "end": 3502.722,
    "text": "Great times looking forward to, uh, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.942,
    "end": 3510.49,
    "text": "See you at the, uh, at the alternative or whatever time next week on lucky seven 11.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.592,
    "end": 3513.914,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3514.62,
    "end": 3515.305,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.312,
    "end": 3516.695,
    "text": "Farewell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3516.856,
    "end": 3517.138,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]