[
  {
    "start": 0.675,
    "end": 3.679,
    "text": " So, hello, I'm Maggie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3.839,
    "end": 5.06,
    "text": "Wait, I'll start in a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6.522,
    "end": 6.702,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7.383,
    "end": 9.145,
    "text": "So, hello, I'm Maggie.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 10.267,
    "end": 35.618,
    "text": " hi everyone welcome to the active inference lab and to the first active inference guest stream i'm here with our special guest majid beni and we're just really honored and excited to be hearing your presentation we're going to be having a about 30 minute presentation on whatever you'd like to be speaking on and then i'm going to be collecting questions from the live chat",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.078,
    "end": 37.638,
    "text": " and then relaying them to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.018,
    "end": 40.999,
    "text": "And it was already just fun to talk to you right before we started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.159,
    "end": 43.619,
    "text": "So thanks again, Majid, and take it away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.119,
    "end": 44.54,
    "text": "Go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.82,
    "end": 46.06,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.56,
    "end": 47.32,
    "text": "Hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 47.36,
    "end": 48.26,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.3,
    "end": 50.501,
    "text": "I'm very excited, too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.661,
    "end": 55.141,
    "text": "And I thank you very much for giving me the chance to present a part of my work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.221,
    "end": 62.583,
    "text": "So I'm basically beginning to speak what I've done, a part of my work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 65.079,
    "end": 86.761,
    "text": " on a free energy principle so i will try to share my screen right now because i'm a great believer in extended mind and i barely could do anything without having my screen shared so you you must be able to see my screen yep looks perfect thank you perfect thank you so uh um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.003,
    "end": 97.57,
    "text": " I'm basically going to present a part of my work in a recent paper in Cinto, a critical analysis of Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 99.371,
    "end": 103.194,
    "text": "And the structure of this talk is quite straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.715,
    "end": 112.962,
    "text": "So I briefly, very briefly, and with a very broad branch, will speak about free energy principle and Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 113.729,
    "end": 123.851,
    "text": " So I gloss over the technical stuff, because for one thing, I'm a philosopher, and I'm not very well versed in these technical aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 123.911,
    "end": 129.112,
    "text": "And for another thing, I'm going to present the core of my work, which is about scientific models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.253,
    "end": 136.814,
    "text": "So after that, I speak briefly about scientific models and scientific modeling in philosophy of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.874,
    "end": 139.935,
    "text": "And coming from the background of philosophy of science is what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.763,
    "end": 153.035,
    "text": " It is the main part of my contribution to this literature of preliminary principle to look at it through the lens of philosophy of science and the issue of scientific representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 153.415,
    "end": 161.344,
    "text": "Then I'm going to describe Markovian models as some sort of scientific models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 162.521,
    "end": 175.73,
    "text": " scrutinize their relationship with their target model in the real world and see whether any of these descriptions of the relationship between Markovian models and their target system could support Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.751,
    "end": 188.319,
    "text": "And briefly again, I will also evaluate Friston and colleagues' attempt at developing Markovian monism along the lines of structural realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 193.391,
    "end": 199.174,
    "text": " So most probably you know more than me of free energy principle and predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 199.955,
    "end": 218.205,
    "text": "The idea has been reintroduced to science, but the roots of this idea seem to be quite old, but it has been reintroduced, restored to science by Carl Christen and colleagues, and it is all based on a simple and subtle idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.566,
    "end": 220.887,
    "text": "So generally,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 224.761,
    "end": 241.996,
    "text": " It provides a framework that explains how a biological system exposed to random and unpredictable fluctuations in its external environment can restrict itself to occupying a limited number of states and therefore survive in some recognizable form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.596,
    "end": 256.927,
    "text": " In order to be able to resist the dispersing force of the environment, the organism has to, in a nutshell, have to keep the amount of its free energy low.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.107,
    "end": 265.735,
    "text": "And predictive processing is some sort of theory of application, indicating that when applied to the brain of some kind of system, such as ourselves,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 266.591,
    "end": 275.78,
    "text": " And minimizing free energy could be specified in terms of minimization of prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.82,
    "end": 277.942,
    "text": "So there are these generative models in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.122,
    "end": 284.669,
    "text": "And through a process, a top-down process, the brain or the organism endeavors to predict",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.427,
    "end": 293.057,
    "text": " apply these models to reality, or at least to check them against the evidence that it receives from the external world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.379,
    "end": 297.343,
    "text": "And when there is discrepancy, it endures to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 301.45,
    "end": 306.653,
    "text": " somehow revise the models, update its model, or at least make changes to the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.693,
    "end": 319.76,
    "text": "So there's some sort of action either covers mental action or overt action, but active inference is the other side of minimization of prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.561,
    "end": 334.926,
    "text": " And Freeston and colleagues, mainly Freeston, developed free energy principle into a fascinating theory of consciousness in terms of temporal richness or temporal depth of generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.966,
    "end": 348.21,
    "text": "So not only some organism can minimize their free energy and optimize the representation of the environment, they could also somehow form some sort of foresight or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.971,
    "end": 352.972,
    "text": " prediction about the possible outcomes of their action in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.112,
    "end": 362.534,
    "text": "And it seems that this capacity is somehow tied with conscious progressives or consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 364.114,
    "end": 367.375,
    "text": "And of course, there is this idea of Mark of Blankens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.395,
    "end": 371.776,
    "text": "Judah up here introduced them, I think, in 1980s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 372.056,
    "end": 377.957,
    "text": "And there are some sorts of Bayesian networks, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 379.028,
    "end": 388.934,
    "text": " could help us to make a distinction between conditional independence, account for the conditional independence between internal and external spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 389.614,
    "end": 396.018,
    "text": "So the literature itself, free energy principle, has been quite flourishing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.878,
    "end": 404.382,
    "text": "Quite a number of scientists and philosophers have contributed to developing this literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 404.543,
    "end": 408.345,
    "text": "And amongst the philosophers, just to mention a few,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.76,
    "end": 425.764,
    "text": " great people who contributed, such as Jakob Hoving, Andy Clark, Sean Gallagher, and even people who are coming from a background of philosophy of science, such as Stefan Hartmann, have contributed to this rich literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 428.845,
    "end": 434.847,
    "text": "What's interesting is that the free energy principle has not been developed into some sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.987,
    "end": 441.11,
    "text": " metaphysical thesis about cognition or consciousness or brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.23,
    "end": 457.004,
    "text": "So, as far as I can see, this paper, which is the target paper of my paper, for instance, From Cartesian Duality to Markovian Monism, is the subtitle, with Friston and Wyss and Hobson.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.065,
    "end": 463.449,
    "text": "As far as I can see, it is the main work, the main paper that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 465.42,
    "end": 474.145,
    "text": " actually contributed to spreading out the metaphysical implications of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.165,
    "end": 481.61,
    "text": "This is the main paper, as far as I can see, that tried to develop free energy principle into some sort of metaphysical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.991,
    "end": 489.013,
    "text": " And I think that for this reason alone, the paper deserves attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.053,
    "end": 492.555,
    "text": "And I'm a great admirer of the sport.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.755,
    "end": 499.238,
    "text": "I usually do not engage with reviewing or criticizing single papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 499.278,
    "end": 502.399,
    "text": "But this paper attracted my attention and interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 504.52,
    "end": 518.406,
    "text": " So even before this, people such as, for example, Friston and Hobson themselves tried to develop a free energy principle into a theory of consciousness that provides a foil to Cartesian dualism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.106,
    "end": 521.147,
    "text": "Solms, too, tried to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.187,
    "end": 526.99,
    "text": "But as far as I can see here, for the first time, free energy principle has been developed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 528.27,
    "end": 534.093,
    "text": " a very well-defined metaphysical thesis, which is monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.354,
    "end": 545.539,
    "text": "So the main point here is that I'm more sympathetic to the goal of this paper, to the objective of this paper, that at times the paper may indicate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.199,
    "end": 548.82,
    "text": "And what I'm going to say is mainly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 551.365,
    "end": 567.288,
    "text": " aim to invoke, provoke the free energy principles to develop this Markovian monism into a slightly better account, a well-supported account of consciousness, metaphysical account of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.894,
    "end": 589.714,
    "text": " and I'm going to look at this issue through the lens of philosophy of science to see the relation between Markovian blankets and their environment as some sort of relation between scientific models because Markovian models are some sort of scientific models and I'm going to argue for provide some argumentations for that to draw a connection between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.605,
    "end": 605.937,
    "text": " Markovian models on the one hand and the target system on the other hand, and so whole consciousness that appears through this relationship could be put into some sort of monism, which is a metaphysical thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 605.977,
    "end": 609.08,
    "text": "I'm going to look at this issue through the lens of philosophy of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 612.516,
    "end": 616.721,
    "text": " unfold the implication, a spell of the implication for Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.981,
    "end": 622.486,
    "text": "So the thesis itself, Markovian monism, is quite straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.506,
    "end": 625.149,
    "text": "I have highlighted a part of it for you here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.229,
    "end": 633.117,
    "text": "So the thesis is that fundamentally there is only one type of thing and only one type of irreversible property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 633.829,
    "end": 644.653,
    "text": " And Markovian blanket form the calculus of belief, which is not only a nice scientific mathematical model of consciousness, but also provides a clear metaphysical statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.793,
    "end": 648.814,
    "text": "And I can shed light on current philosophical debates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 648.894,
    "end": 651.115,
    "text": "So the highlighted parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.575,
    "end": 655.136,
    "text": "So this is the statement of Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 655.956,
    "end": 657.917,
    "text": "And the red part indicates that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.601,
    "end": 666.005,
    "text": " how forcefully the theory have been spelt out in metaphysical terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 666.025,
    "end": 670.729,
    "text": "So there is only one type of thing is a strong metaphysical thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 671.39,
    "end": 676.814,
    "text": "And this is something that has been also stated in Friesen and colleagues paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.655,
    "end": 684.42,
    "text": "And here I highlighted another part of the same phrase, which indicates that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.738,
    "end": 699.703,
    "text": " This statement of consciousness on the basis of Markovian models is not just a nice scientific or mathematical model of consciousness, but also provides a metaphysical statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.563,
    "end": 716.409,
    "text": "So the main question here is that how come that we could build, how come that we could read off a metaphysical thesis on the basis of our scientific models of the phenomena, scientific mathematical models of phenomena,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 717.427,
    "end": 718.333,
    "text": " So I'm going to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.096,
    "end": 749.284,
    "text": " ask this question, as I say, through the lens of philosophy of science to see what's the relation between, I think that this basic question of philosophy of science, what's the relation between scientific models and their target system, they are significantly on the claim of Markovian monism, which tries to develop some sort of a strong metaphysical thesis on the basis of this efficient modeling tool, scientific modeling tool, which are Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.125,
    "end": 757.008,
    "text": " So, this is an insight from philosophy of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.228,
    "end": 777.02,
    "text": "And the insight has been, so I think that originally it has its roots in works of Ronald Geary and Paul Churchland, for example, and a number of, and Bas van Fraassen himself, a number of important philosopher of science who have been developing this idea",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 778.05,
    "end": 796.657,
    "text": " a model-based approach to scientific theories in the 1980s, and it has been recently resurfaced in the works of Michael Weisberg and Roman Fried and Gottfried Smith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 798.05,
    "end": 805.42,
    "text": " And the general idea is that scientific practice basically consists of model making, making scientific models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.16,
    "end": 815.072,
    "text": "And the thing is that when engaging in scientific practice, we just do not directly engage in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 818.776,
    "end": 826.461,
    "text": " reading of the ideas from the future of the world, reading of the theories, the theories do not just latch onto the world directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 826.981,
    "end": 835.287,
    "text": "There is some sort of representation and the representational relation between scientific theories, scientific models and the world is indirect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 835.347,
    "end": 840.33,
    "text": "So, scientific theories do not represent the futures of the world directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.071,
    "end": 847.855,
    "text": "The main thing here is that quite a few humane factors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.435,
    "end": 851.699,
    "text": " interfere through the process of scientific representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 851.799,
    "end": 865.972,
    "text": "So to name only a few, for example, scientists' interest and explanatory goals and intentions play a role in how scientists are constructing their scientific models and how to use them to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.368,
    "end": 890.865,
    "text": " represent the features of reality by scientific models and as free for example among other people explains this you know process of indirect representation is quite sophisticated it includes several stages such as denotation or designation example exemplification king of and imputation so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 892.278,
    "end": 904.525,
    "text": " The main point here, the take-home point here, is that the relationship between scientific models on the one hand, or reality on the other hand, or the target system on the other hand, is quite sophisticated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 904.545,
    "end": 906.566,
    "text": "It is never straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 907.789,
    "end": 923.033,
    "text": " And there are three ways of... Markov blankets, Markovian models are just efficient scientific tools in the modeler's toolbox that allow the modeler to represent the features of the world indirectly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 923.573,
    "end": 929.634,
    "text": "So I'm going to speak about three ways of understanding Markovian models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.655,
    "end": 931.295,
    "text": "I'm beginning...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.536,
    "end": 936.197,
    "text": " as the sketch that I showed earlier indicates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.357,
    "end": 946.082,
    "text": "I'm beginning with interpreting Markovian models as physical or material models first, then as fictional models, and finally as mathematical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 946.902,
    "end": 958.688,
    "text": "And this order has been chosen deliberately because I'm going from the least likely reading of Markovian models, I'm going toward the most likely interpretation of Markovian models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.215,
    "end": 964.186,
    "text": " So I'm convinced that Morphovian models could be understood as some sort of mathematical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.816,
    "end": 971.998,
    "text": " But I also consider other options because there are some sort of textual evidence to support them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 972.158,
    "end": 982.281,
    "text": "So for example, it is indeed possible to understand Markov blankets or Markovian models as some sort of physical models, material models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.321,
    "end": 993.604,
    "text": "For example, Princeton says in a 2019 paper that the Markov blanket is not some statistical device by which we could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.504,
    "end": 1003.889,
    "text": " or we use it to observe or model the world, it is a necessary attribute of the universe that can be carved into things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1004.59,
    "end": 1012.874,
    "text": "So, at least to a first approximation, we try to read this phrase or the second phrase from the same paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1012.934,
    "end": 1017.757,
    "text": "It seems that for free energy principle theories, for freestone for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.745,
    "end": 1022.487,
    "text": " Mark of blankets are actually features of the reality themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.507,
    "end": 1023.568,
    "text": "They are physical things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1023.588,
    "end": 1025.789,
    "text": "They are real things out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1025.969,
    "end": 1033.053,
    "text": "And so I think that it is not only Christen who is advocating this reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.153,
    "end": 1038.056,
    "text": "I think that also I have seen similar phrases in, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1039.213,
    "end": 1049.143,
    "text": " Wies and Metzinger's Introduction to Predictive Processing and also in Allen and Friston's papers since 2060, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.644,
    "end": 1056.45,
    "text": "There is some textual basis for understanding Markovian but Markov blankets as physical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.273,
    "end": 1069.38,
    "text": " But I think that this indication, this reference to Markov blankets as physical things has to be taken with a grain of salt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.48,
    "end": 1072.002,
    "text": "I do not think that there are actually such things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1072.102,
    "end": 1081.448,
    "text": "So if we, for example, open the brain or open an organic system, I do not think that we can find anything resembling a Markovian blanket there, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.488,
    "end": 1082.588,
    "text": "There is no blanket there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1082.628,
    "end": 1084.75,
    "text": "There is no such physical thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1085.87,
    "end": 1097.793,
    "text": " But I can understand if a terrorist could conceive of the target system as if it really includes this representational device.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1097.833,
    "end": 1112.037,
    "text": "But the point is that even if we somehow consider that Markov blankets, Markovian models are features of reality, are physical things that exist in the world, even if we consider that, it doesn't follow that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1114.537,
    "end": 1121.724,
    "text": " reality itself shares the ontological and material features of Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.764,
    "end": 1132.734,
    "text": "It doesn't follow that there is the same, self-same ontological category that includes both Markov blanket and their target system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.774,
    "end": 1134.836,
    "text": "And there is an example that could demonstrate that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.876,
    "end": 1138.759,
    "text": "So, for example, there is such thing as a hydraulic pump",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.421,
    "end": 1142.263,
    "text": " model of economics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1142.403,
    "end": 1153.674,
    "text": "So, hydraulic pump is a physical object and for hydraulic model to work some properties of economic system must be identified with hydraulic properties of the pump.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1153.954,
    "end": 1160.701,
    "text": "It could be, for example, exemplified through the process of imputation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.761,
    "end": 1161.022,
    "text": "We could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.206,
    "end": 1169.848,
    "text": " ascribe or attribute some of the properties of the hydraulic foam to the physical object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.888,
    "end": 1176.33,
    "text": "Sorry, to ascribe some of the properties of hydraulic foam to the economical system that is supposed to be represented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1176.89,
    "end": 1188.773,
    "text": "But it doesn't follow that the economical system and hydraulic foam, which is a physical object, can be put under the same ontological category or material category.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.813,
    "end": 1191.134,
    "text": "So, for example, hydraulic foam, which is a physical object,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.77,
    "end": 1196.991,
    "text": " is made of, for example, steel or plastic or some other material thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1197.071,
    "end": 1201.832,
    "text": "It doesn't follow that economic share as this material and antique future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.472,
    "end": 1219.356,
    "text": "So I simply put the materialist interpretation of Markov blankets aside and proceed to consider Markov blankets as fictional models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.093,
    "end": 1231.602,
    "text": " And the main reason for this is that I assume that if we, for example, explore the actual brain of organism, we couldn't find anything resembling a marble blanket inside the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.282,
    "end": 1237.447,
    "text": "So we could interpret them as some some sort of fictional objects and so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.355,
    "end": 1248.158,
    "text": " And again, there are textual supports for this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1248.198,
    "end": 1265.008,
    "text": "For example, Christian and colleagues say that if we look into the behavior of creatures through the lenses of Markovian models, it will look as if the creature is acting to minimize its particular surf-horizon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.67,
    "end": 1279.099,
    "text": " This as-if phrase, look-as-if phrase, I think that is very important in case that they do not really think that there is such thing as Marko Polankis in the creature, but it's look as if there is such thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1279.399,
    "end": 1291.628,
    "text": "And it has been this interpretation, this fictionalist, instrumentalist interpretation is gaining momentum as far as I can see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1291.688,
    "end": 1295.671,
    "text": "So there are a number of other people such as Maxwell Romstead and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.842,
    "end": 1304.425,
    "text": " values that are developing some sort of fictionalist and instrumentalist interpretation of pre-energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1305.065,
    "end": 1317.369,
    "text": "But the thing is that if we concept this fictionalist interpretation of Markov blanket or pre-energy principle, it follows that, so if Markov blankets are useful fictions, we couldn't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1320.977,
    "end": 1324.078,
    "text": " drive any sort of metaphysical conclusion from them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1324.138,
    "end": 1342.404,
    "text": "So from a fiction, for example, if you are studying Greek mythology and assuming that Greek mythology is some sort of fiction, you cannot derive any conclusion about the nature of deity from what you read in a story from Greek mythology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.624,
    "end": 1345.805,
    "text": "There are no metaphysical conclusions to be derived from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1347.306,
    "end": 1348.567,
    "text": " fictions and stories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.867,
    "end": 1354.611,
    "text": "And this is precisely the point in invoking a fictionalized approach to scientific models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1354.671,
    "end": 1367.381,
    "text": "So people are assuming that scientific models or fictions are useful instruments to just get rid of the metaphysical questions about the nature of fiction models or their relationship with reality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1367.421,
    "end": 1374.947,
    "text": "So to make a longer story short, this fictionalist interpretation doesn't lead to any sort of metaphysical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1376.421,
    "end": 1381.904,
    "text": " conclusion about the nature of consciousness, or the nature of mind, or anything of that sort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.606,
    "end": 1397.696,
    "text": "So, this brings us to the last interpretation of Markov's blanket, and it comes in terms of... I don't have much time, I'll try to wrap it up quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.796,
    "end": 1401.118,
    "text": "So, the final interpretation is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.654,
    "end": 1407.513,
    "text": " to interpret Markov blankets in terms of mathematical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1408.72,
    "end": 1411.782,
    "text": " And I think that there is good textual growth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1411.922,
    "end": 1424.348,
    "text": "So it is, at least to my mind, to some extent, for someone who is coming from a background of philosophy of science, it seems rather obvious that Markov blankets are just mathematical modeling tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.568,
    "end": 1433.233,
    "text": "So they are mathematical tools in the context of Bayesian networks to represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1434.913,
    "end": 1440.015,
    "text": " conditional independence between internal and external spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1441.375,
    "end": 1444.496,
    "text": "And there is textual evidence for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1444.576,
    "end": 1459.621,
    "text": "Again, I have highlighted part of that, which indicates that their enterprise aims to describe a construct from information theory and mathematical physics that helps them to define",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.706,
    "end": 1476.991,
    "text": " the properties of living system and their cognition and give them some sort of meaningful interpretation by invoking mathematical objects that could be used to consolidate this interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.191,
    "end": 1489.455,
    "text": "I think that there is some sort of enlightenment inside in modern philosophy of science",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.132,
    "end": 1497.635,
    "text": " In the wake of works of Patrick Supes and Bosman Brosnan in 1960s and 1970s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1499.376,
    "end": 1509.742,
    "text": "So people's attention has been drawn to the importance of mathematical models, set theory and model theory and that sort of stuff for modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.265,
    "end": 1512.447,
    "text": " natural phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1512.567,
    "end": 1526.503,
    "text": "So when doing science, scientists, so the rise of modern, in some sense, the rise of modern science has been a result of involving these sorts of mathematical approaches that allow us to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.696,
    "end": 1538.217,
    "text": " represent and model natural phenomena of precision and rigor.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.618,
    "end": 1558.562,
    "text": "But the thing is that if we assume that Markovian models are some sort of mathematical tools that can be used to represent the features of reality, the thing is that we couldn't develop any sort of metaphysical conclusion about the nature of reality on the basis of application of these mathematical tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.193,
    "end": 1573.383,
    "text": " Look, if we assume that Markov blankets are mathematical tools, and if we want to identify their nature with the nature of reality, the only conclusion that follows is that the reality is some sort of mathematical object, is some sort of mathematical entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1574.223,
    "end": 1584.53,
    "text": "And interestingly enough, as I will argue, this is precisely the same sort of conclusion that Princeton and colleagues",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.557,
    "end": 1589.3,
    "text": " reached in the end of their paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.36,
    "end": 1599.191,
    "text": "So, at some sense, they are saying that they intend to defend some sort of reductive materialist or reductive physicalist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.251,
    "end": 1604.677,
    "text": "But what happens is that they come to the conclusion that, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.643,
    "end": 1626.691,
    "text": " These two ways of describing the nature of reality, this division on the basis of Markovian moments, of the two external and internal spaces, because none of these interpretations, none of these geometries that they develop, none of this intrinsic and extrinsic perspective could be supported.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.191,
    "end": 1633.534,
    "text": "Under the assumption that neither perspective is privileged, one would have to conclude that reality is fundamentally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1634.35,
    "end": 1635.771,
    "text": " ontologically neutral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1637.192,
    "end": 1660.445,
    "text": "And they assume that by speaking of ontological neutral nature of reality, they are trying to build open the mathematical nature of Markovian blankets, Markovian models, to make concession on some sort of monism which identifies the nature of reality as neither physical nor mental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.19,
    "end": 1668.216,
    "text": " But I would say that it would be quite a lot to read into the use of mathematical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.416,
    "end": 1681.908,
    "text": "So, of course, mathematical tools are neither, in some sense, are neither mental nor physical, if you are not an idealist or a realist, especially if you are not a physicalist or idealist, but mathematical entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.443,
    "end": 1698.513,
    "text": " But it doesn't follow that the target systems that could be used on the basis of using these mathematical tools itself, the reality, the target system that is going to be used by invoking this sort of mathematical tools itself is neither mental nor physical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.154,
    "end": 1701.695,
    "text": "So this is the conclusion of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.855,
    "end": 1708.519,
    "text": "And for coming to that conclusion, I have also discussed some sort of a structuralist interpretation of the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1708.58,
    "end": 1709.06,
    "text": "Again, it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.713,
    "end": 1714.294,
    "text": " about the relation between mathematical tools and the physical reality that they represent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.394,
    "end": 1724.096,
    "text": "So again, Freestone and colleagues would be happy to make a concession on some sort of a structural realist interpretation of the Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1724.636,
    "end": 1736.319,
    "text": "But in the context of structural realism, too, a structural realist, as some of the leading structural realists, such as Stephen French and James Ladyman, are quite explicit about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.205,
    "end": 1744.851,
    "text": " They do not make their ontological commitments on the basis of the mathematical framework that they use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.111,
    "end": 1755.581,
    "text": "So they use mathematical framework, they use model theory, they use set theory because they believe that this semantic framework, model theoretic approach or set theoretic approach to science",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.401,
    "end": 1783.008,
    "text": " uh viewers it's uh a structuralist loyalties on its sleeves but it doesn't mean that ontology itself could be read off from the features of this mathematical tools that they use so they are very clear that the job of the mathematical tools that they use so orthodox structuralists are using mathematical tools such as set theory and model theory and category theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.983,
    "end": 1788.909,
    "text": " But they are very clear that the job of these mathematical tools is mainly representational.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.989,
    "end": 1790.31,
    "text": "It is not constitutional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1790.33,
    "end": 1791.312,
    "text": "It is not ontological.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.632,
    "end": 1799.28,
    "text": "On the other hand, it is the physical reality that is supposed to be represented that has some sort of ontological constitutional rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1799.781,
    "end": 1803.846,
    "text": "And with regard to Markovian monism, if we want to derive any sort of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.406,
    "end": 1815.473,
    "text": " The use of the mere application of Markovian models doesn't lead to any sort of metaphysical conclusion because Markovian models are themselves mainly representational tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1815.533,
    "end": 1826.279,
    "text": "They help us to represent features of the reality that is the target system, the brain or consciousness or organism or the environment or whatever it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1827.316,
    "end": 1838.199,
    "text": " it doesn't itself, we could not build upon the features of this mathematical model itself to derive any sort of ontological or metaphysical contribution of the features of the target system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1838.98,
    "end": 1850.943,
    "text": "So thank you very much for listening and I hope that what I said makes some sense at least to some of you, although I could not be completely sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.364,
    "end": 1852.364,
    "text": "So thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1854.611,
    "end": 1858.092,
    "text": " Awesome, thank you for that fascinating presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1858.692,
    "end": 1861.593,
    "text": "We already have a couple questions in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1861.734,
    "end": 1872.237,
    "text": "So if anyone else wants to ask questions, we'll have a good amount of time now just to talk a little bit and I'll just read down the questions that were asked in the chat and a few things I wrote down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.797,
    "end": 1882.121,
    "text": "So the first question in the chat was, as far as different styles of monism or different threads in the history and the philosophy of monism,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1882.961,
    "end": 1908.07,
    "text": " how does a dawkins based monism so thinking about like memes biological or non-biological memetics that's kind of a dawkins monism how does that parallel or overlap with fristonian monism so in other words how does friston's monism or the markovian monism um relate or overlap with other approaches to monist type theories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.72,
    "end": 1916.442,
    "text": " Well, thank you very much for the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.683,
    "end": 1920.964,
    "text": "I'm not very knowledgeable about the different types of monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.245,
    "end": 1925.727,
    "text": "I know about some quite classical theories of monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.867,
    "end": 1940.055,
    "text": "I know a few things about, for example, Rasselian monism, or the form of monism that has been developed by Charles Sanders Peirce, aside from, for example, the classical forms that are developed by Espinoza.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1943.418,
    "end": 1950.204,
    "text": " So I'm not very well versed, I'm not very knowledgeable about this kind of Dawkinsian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1953.607,
    "end": 1961.313,
    "text": "I barely know anything about memes, and I'm not sure that we could identify memes as real ontological entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.075,
    "end": 1965.797,
    "text": "And I have already argued that I have some sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1967.703,
    "end": 1973.829,
    "text": " misgivings about Friston and Wyss and Hobson's version of monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.889,
    "end": 1979.353,
    "text": "So I do not want to give a ready-made answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.513,
    "end": 1989.562,
    "text": "I would say that if Dawkinsian monism resembles Fristonian monism with regard to the fact that it invokes memes which are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.102,
    "end": 2007.189,
    "text": " as far as I can guess, some sort of theoretical tools as features of reality, it could be liable to the same kind of objections that I have spearheaded here against the Freestonean kind of monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.459,
    "end": 2019.523,
    "text": " Thanks for the clear answer, and I guess to follow up on that is, where do you situate this Markovian monism in relationship to these classical kinds of monism that you just mentioned?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.623,
    "end": 2022.564,
    "text": "Is that discussed in the paper, or how would you frame that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.837,
    "end": 2027.018,
    "text": " So, all right, thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2027.138,
    "end": 2031.3,
    "text": "Again, it is a fascinating question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.32,
    "end": 2041.363,
    "text": "So before this, I have developed some sort of structural realist theories of consciousness, too, that have been basically based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.423,
    "end": 2042.904,
    "text": "So my own approach...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.644,
    "end": 2049.008,
    "text": " to free energy principle is associated with some sort of structural realism too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.588,
    "end": 2066.999,
    "text": "So, again, I myself have invoked some sort of mathematical structure, embodied informational structures, to describe the structure of the mind and consciousness, and my basic argumentation there was that this structure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.665,
    "end": 2082.618,
    "text": " sort of underpinned the diversity between different accounts of consciousness, in terms of free energy principle, Georg Nordhoff's resting state activity theory, and, for example, integrated information theory of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.638,
    "end": 2094.748,
    "text": "So, I myself have developed some sort of a structuralist, but with regard to the metaphysical aspects, with regard to... So, I see monism specifically as some sort of metaphysical approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.579,
    "end": 2100.484,
    "text": " I have been very cautious with regard to stating a metaphysical stance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.524,
    "end": 2107.41,
    "text": "The version of structural realism that I have defended was some sort of epistemic structural realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2107.47,
    "end": 2118.0,
    "text": "It was still realism, but it was epistemic in the sense that I was ready to make commitment to the fact that to the extent that our scientific knowledge",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2119.661,
    "end": 2138.389,
    "text": " is informing us the future of reality as a structure, but we couldn't make assertions about the nature of reality itself, so whether it is a structure or not, or whether it is the same stuff, the self-same stuff that is there, or there are several kind of substances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.989,
    "end": 2146.112,
    "text": " So I professed agnosticism about the features of reality in itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.612,
    "end": 2161.359,
    "text": "So the version of structural realism that I defended was epistemic, and I have no stance on the nature of reality in itself, whether of monist or dualist types or any other kind of approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.332,
    "end": 2175.067,
    "text": " that's really interesting um seems pretty fair to be agnostic on the ultimate structure of reality and you had a quote on one of the slides that the structural realism is taking the pressure off of strong ontological commitments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.928,
    "end": 2183.25,
    "text": " So how would you summarize this kind of best of both worlds, structural realism approach?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.31,
    "end": 2184.89,
    "text": "Are we just, is it a buffet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2184.93,
    "end": 2190.752,
    "text": "Are we just taking what we like or what are we committing to with epistemic structural realism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2195.429,
    "end": 2199.071,
    "text": " I think that it is partly an issue of motivations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.251,
    "end": 2209.436,
    "text": "So when stating a structural realism, for example, people such as John Worrell built open arguments from history of science to argue that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.476,
    "end": 2211.998,
    "text": "So it takes the pressure off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.998,
    "end": 2219.541,
    "text": " ontological pressure, in the sense that it doesn't make commitments to the intrinsic nature of entities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2219.641,
    "end": 2222.322,
    "text": "It doesn't make commitment to objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2222.782,
    "end": 2224.963,
    "text": "It is committed mainly to the relations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.284,
    "end": 2234.087,
    "text": "And I think that I'm defending some sort of epistemic form of a structural realism because, as I say, it is completely agnostic about the features of reality itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2234.87,
    "end": 2255.046,
    "text": " For example, people such as John Vorall are defending structuralism on the basis of history of sciences with very clear examples, for example, from the history of optics, to show that there is some sort of continuity between theories of optics, although it seems that there are radical, theoretical shifts in the history of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.686,
    "end": 2265.951,
    "text": " Some of the terms, some of the theoretical entities that were supposed to be the subject of ontological commitments before are eliminated from our ontology today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.011,
    "end": 2271.073,
    "text": "But it seems that there is some sort of continuity at the level of a structure of theories, at the level of form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.753,
    "end": 2273.015,
    "text": " So they are not making comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2273.095,
    "end": 2278.681,
    "text": "And in this sense, they are indeed taking ontological pressure from their theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.761,
    "end": 2287.39,
    "text": "However, there are other forms of, for example, antique structural realism, which itself comes in various stripes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.47,
    "end": 2292.456,
    "text": "For example, James Ladyman is defending some sort of eliminativist theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.75,
    "end": 2295.392,
    "text": " approach to structuralism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2295.552,
    "end": 2300.458,
    "text": "I think that for good reasons from recent many particle physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2301.9,
    "end": 2309.448,
    "text": "But I'm slightly skeptical that that sort of structuralism is taking any sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2311.124,
    "end": 2321.389,
    "text": " In terms of ontological commitments, I'm skeptical that it is less cumbersome that the orthodox forms of scientific realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2321.589,
    "end": 2327.852,
    "text": "I'm sure that there is a perfect match between Eliminativist structural realism and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.059,
    "end": 2337.141,
    "text": " what we know about what modern physics, many particle physics, is representing about the features of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.561,
    "end": 2346.565,
    "text": "But with regard to metaphysics, for example, Antic Structuralism claims that all that there is is a structure, which is a strong metaphysical claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.605,
    "end": 2355.788,
    "text": "So it eliminates entities, objects from the ontology, which is quite ambitious and a strong ontological commitment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.798,
    "end": 2368.566,
    "text": " And the thing is that I do not think that the version of structural realism that Briston and colleagues have defended is epistemic, because they are defending some sort of metaphysical thesis here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.626,
    "end": 2370.767,
    "text": "Monism is some sort of metaphysical thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.808,
    "end": 2382.396,
    "text": "So although structural realism was supposed to be ontologically modest in the sense that at least, for example, Voral's version doesn't make commitment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.996,
    "end": 2387.178,
    "text": " to the nature of the world itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.278,
    "end": 2402.605,
    "text": "The metaphysical versions of structural realism, such as James Leibman, are including or harboring strong metaphysical tenses about the features of reality that they are claiming to be completely structural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.045,
    "end": 2407.687,
    "text": "And I think that in this sense, Markovian monism that is defined by Kristofer,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.143,
    "end": 2408.723,
    "text": " and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.823,
    "end": 2410.804,
    "text": "It's not metaphysically modest at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.324,
    "end": 2412.885,
    "text": "And I think that this is one reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2412.905,
    "end": 2426.629,
    "text": "So I didn't, and thank you very much for bringing this point to my attention, I didn't spell this point clearly in the paper because I didn't spend many time to discuss the structural realism in this specific paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2427.109,
    "end": 2429.29,
    "text": "But I think that now that I look at it from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.005,
    "end": 2446.58,
    "text": " I can see that it could be the main motive behind my mind that encouraged me to be a bit critical about this form of monism that is presented in this paper, wonderful paper by Christen and colleagues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.251,
    "end": 2449.671,
    "text": " Cool, cool response.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.011,
    "end": 2458.854,
    "text": "Here's another question from the chat, kind of keeping with this theme of physics and realism and scientific communities that are evolving their models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.094,
    "end": 2460.194,
    "text": "You mentioned optics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2460.454,
    "end": 2462.235,
    "text": "So let's think about particle physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.955,
    "end": 2477.499,
    "text": "Cambridge Breaths wrote, can the author describe in his personal belief the main difference between a mathematical Markov blanketness of an electron when it's behaving as a particle versus when it's behaving as a wave?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.574,
    "end": 2489.666,
    "text": " So how do we think about quantum mechanics and quantum phenomena when we're talking about these different realism ideas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.233,
    "end": 2494.435,
    "text": " To be quite honest, I have no idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.375,
    "end": 2501.658,
    "text": "It is mainly because of my ignorance of modern physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.678,
    "end": 2507.601,
    "text": "So I have some general conception of what happens at the level of many particle physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2508.241,
    "end": 2515.585,
    "text": "But how to state that in terms of Markovian, and I can imagine how could we state that in terms of Markovian blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.241,
    "end": 2524.74,
    "text": " but I cannot see how the distinction between a particle being in a wave state or being an entity being in a wave state or particle state",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.793,
    "end": 2530.397,
    "text": " could be related to this issue of Markovian models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.477,
    "end": 2545.248,
    "text": "I assume that Markovian models, so one thing that I know about Markovian models is that they are so powerful, they are such powerful modeling tools that they could be used almost to model everything that there is to be modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.554,
    "end": 2571.122,
    "text": " Well, and I suspect, and it is only some sort of wild guess, that we could model the behavior of an entity either in its wave state or as far as we try to provide some sort of probabilistic representation of the behavior of the entity to model the conditional independence between different states of the entity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2571.722,
    "end": 2575.383,
    "text": "We could invoke Markovian blanket, Markov blanket, to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.555,
    "end": 2585.738,
    "text": " I think that at the same time, I missed the main part of the, the core of the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.718,
    "end": 2608.929,
    "text": "I think, just maybe guessing from the context, the electron is something that we might say, we might want to say it ontologically exists, or some might think it ontologically exists, yet it can display this sort of bimodal behavior when it can, depending on the double slit and the context of the observer, it can be acting, yeah, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2609.993,
    "end": 2614.418,
    "text": " So, all right, so how does a Markovian blanket does to do with it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.458,
    "end": 2630.414,
    "text": "So, as I say, this kind of approach to the behavior of entities in many particle physics was what motivated people such as Stephen French and James Ladiman to develop forms of structural realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.935,
    "end": 2634.636,
    "text": " It is not only an issue of an electron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.697,
    "end": 2646.982,
    "text": "The thing is that when we look at the behavior of entities at the fundamental level, if I don't want to use fundamental at the level of many particle physics, they should do all behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.022,
    "end": 2658.746,
    "text": "There is some sort of package that includes individual objects, and it is the interpretation, for example, of the electron that allows us to identify that as some sort of individual objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2658.906,
    "end": 2660.127,
    "text": "And there is a package that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2660.575,
    "end": 2663.92,
    "text": " doesn't allow us to model it as an individual object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.94,
    "end": 2671.372,
    "text": "So we have to conceive of that as both individual objects and non-individual objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.407,
    "end": 2675.85,
    "text": " This seems to recall with your ontology of modern physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2675.95,
    "end": 2682.636,
    "text": "And structural realism provides an answer to that, saying that, all right, let's consider the commonality.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.716,
    "end": 2687.7,
    "text": "Let's consider the common structures that underpin Bose formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2687.82,
    "end": 2698.649,
    "text": "And the behavior of electrons, for example, are stated in terms of several sorts of statistics that are developed from Maxwell's work, for example, Bose-Einstein statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2699.6,
    "end": 2701.221,
    "text": " and other sorts of statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.301,
    "end": 2714.205,
    "text": "So I assume that we could also invoke some sort of marker blanket to model the behavior of this kind of entities at the level of subparticle physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2714.866,
    "end": 2720.988,
    "text": "But does the question mean to indicate that there would be some sort of ontological gain to do so?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.816,
    "end": 2734.096,
    "text": " The thing is that even in philosophy of physics, the discussion of structural realism, whether we could invoke some sort of representation of mathematical tools, or we have to just rely on the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.542,
    "end": 2738.686,
    "text": " geometrical or physical statement of the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.986,
    "end": 2754.405,
    "text": "So I think that these are sophisticated issues in the philosophy of physics, and I'm hardly an expert in that field, but I'm not very clear what obvious advantage would",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2755.928,
    "end": 2767.475,
    "text": " regimentation of states of subparticles in terms of Markov blankets would do to the extent that metaphysical stances are in question or attitude.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.196,
    "end": 2769.516,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2769.937,
    "end": 2772.819,
    "text": "So here are a few general questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2773.839,
    "end": 2776.561,
    "text": "What does it mean to be ontologically neutral?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.221,
    "end": 2784.106,
    "text": "So that was brought up and I was just wondering what is the alternative or how could it be charged or not neutral?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.146,
    "end": 2784.626,
    "text": "What is that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2785.615,
    "end": 2790.443,
    "text": " There are several ways of reminding ontologically neutral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2790.483,
    "end": 2800.478,
    "text": "So, for example, a way that I prefer is to, as I say, profess ontological agnosticism, to not make any commitments about the natural realities of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.987,
    "end": 2807.613,
    "text": " But I do not think that it is this sort of ontological neutrality that is at issue in Princeton and colleagues' paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.114,
    "end": 2820.225,
    "text": "I think that they want to be ontologically neutral in the sense that, so this is this traditional division in the philosophy of mind between physicalism, between dualism, for example, physicalism,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.606,
    "end": 2830.693,
    "text": " People who think that the nature of mind is physical and people who think that mind or at least mental properties are different from physical properties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.753,
    "end": 2844.122,
    "text": "So I think that Markovian monism wants to be ontologically neutral in the sense that it doesn't want to make commitment to either mentalism or physicalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.162,
    "end": 2846.464,
    "text": "It doesn't want to identify consciousness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.373,
    "end": 2850.135,
    "text": " either in physical terms or mental terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2850.255,
    "end": 2856.239,
    "text": "And in this sense, it strives to remain ontologically neutral, which I think it is quite cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.359,
    "end": 2869.067,
    "text": "So as I say, I'm a great admirer of this project because I think that it is the first significant attempt that tries to develop pre-energy principle into a remarkable metaphysical thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.327,
    "end": 2872.169,
    "text": "And I think that if pre-energy principle theories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.711,
    "end": 2893.23,
    "text": " could really show that the theory could support or could be construed along the lines of neutral monism to show that it really supports a stance that doesn't commit us either to conceiving of the nature of mind as a mental state or as a mental stuff or mental properties or as physical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2893.911,
    "end": 2896.634,
    "text": "It will be a real achievement, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2897.705,
    "end": 2910.076,
    "text": " But at the same time, I think that just depending on the mathematical framework of Markovian models doesn't provide sufficient purchase for doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2910.136,
    "end": 2916.381,
    "text": "It doesn't provide a sufficient basis for boosting a well-supported form of monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2917.944,
    "end": 2932.911,
    "text": " very cool so it sounds like there's the eternal debate of whether mind leads to matter or matter leads to mind is there one type of thing two kinds of things and it would be awesome for free energy principle to step into that gap but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2933.371,
    "end": 2959.697,
    "text": " what we've seen so far with the interpretation of the mathematical construct of the markov blanket does not adequately resolve this metaphysical question so what kind of analyses or research or measurement or calculation i mean i'm a scientist so i'm thinking about measurement and experiments but as a philosopher what would reduce our uncertainty about where the fep fits into all of this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.255,
    "end": 2968.684,
    "text": " Far, far it be from a philosopher to try to prescribe or endorse anything to the scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2968.704,
    "end": 2976.896,
    "text": "The thing is that I feel that a cool thing about cognitive sciences and neurosciences is that I think that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.723,
    "end": 2982.026,
    "text": " philosophical ideas could really be useful to scientists in this field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2982.066,
    "end": 2995.996,
    "text": "But the nature of this collaboration, the nature of what happens here is so sophisticated that one can hardly... So I'm told that prediction is pretty hard, especially about the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.416,
    "end": 3000.599,
    "text": "So I couldn't have any idea or any prescription about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3001.039,
    "end": 3006.744,
    "text": " what can we do to make this approach more fruitful?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.125,
    "end": 3015.432,
    "text": "The only thing that we could, I think, we could do is precisely the thing that we are doing, just trying our best and collaborating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3015.472,
    "end": 3022.719,
    "text": "So I think that this is why this Active Inference Lab is a cool idea, because it allows people from different backgrounds",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.148,
    "end": 3024.869,
    "text": " come and share their ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.989,
    "end": 3030.111,
    "text": "And we will see whether anything significant will emerge from all of that or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3030.131,
    "end": 3033.313,
    "text": "But I think that this is the only thing that we could do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3033.453,
    "end": 3037.795,
    "text": "It has been the only thing that we have been doing for quite a while, and it paid well thus far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3040.366,
    "end": 3045.989,
    "text": " It's almost like there's the mind-matter dualism and then there's the science and the humanities or science and philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.35,
    "end": 3049.252,
    "text": "And so is one going to envelop the other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.432,
    "end": 3052.414,
    "text": "Is there really only one and the other one is kind of a subfield?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.854,
    "end": 3058.098,
    "text": "And instead of playing into that dichotomized debate, which is polarized,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3058.598,
    "end": 3069.301,
    "text": " It's almost like we're taking an ontologically neutral stance here and highlighting the importance of coming together across different contexts and having that conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.701,
    "end": 3077.764,
    "text": "So my question on that would be, let's just say that there was somebody who were curious and wanted to jump in to learn more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.544,
    "end": 3095.653,
    "text": " what kind of research or skills or mentorship might help this person on their journey whether they're you know from a philosophical side or from a scientific side what do you think would be some key tips for somebody who's just starting on their fep journey",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.557,
    "end": 3123.308,
    "text": " Well, the best thing that I've heard about the relationship between these different disciplines come from Stephen French, who is a structuralist and also a wise philosopher of science, saying that metaphysics is best when informed with science, and science is best when, I don't want to say that informed by metaphysics, but at least taking some metaphysical insight into consideration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3124.208,
    "end": 3138.526,
    "text": " But on the other hand, I think that the nature of scientific and academic work these days is so, in other words, the scientific activity is so compartmentalized these days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3138.606,
    "end": 3143.011,
    "text": "People are doing their different works in different disciplines in their own labs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.914,
    "end": 3151.536,
    "text": " The nature of the problem is so hard that they have to spend all of their time on a specific problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.796,
    "end": 3164.439,
    "text": "So I can hardly also provide any advice of what kind of mentorship suits anyone who wants to work hard, do some excellent job in free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.459,
    "end": 3165.339,
    "text": "But I can say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3166.477,
    "end": 3171.75,
    "text": " What's very interesting about free energy principle is that it seems to provide at least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.457,
    "end": 3181.32,
    "text": " purchase for a discourse, some space for a discourse between scientists and philosophers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.36,
    "end": 3198.192,
    "text": "So it seems that some of the good scientists, such as, for example, Maxwell Ramstein or Alex Constant or Friston himself, who are scientists, are completely interested in philosophical discussions of what's happening here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.672,
    "end": 3201.474,
    "text": "And it seems that what's even more wonderful, it seems that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.674,
    "end": 3206.676,
    "text": " philosophical discussions are affecting the nature of their work in some sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.796,
    "end": 3214.338,
    "text": "I think that this is something that you can hardly observe, for example, in HWR theories of physics these days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.678,
    "end": 3223.401,
    "text": "I don't know whether the great physicists are studying philosophy for their amusement or not, but I doubt that they are in this sort of constructive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.158,
    "end": 3227.16,
    "text": " relationship with philosophers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.24,
    "end": 3236.066,
    "text": "So I think that this kind of... And the nature of Free Energy Principle itself is quite unificatory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.086,
    "end": 3241.69,
    "text": "It brings different disciplines, different ideas from different disciplines together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3241.75,
    "end": 3252.919,
    "text": "So I have no clear idea about the mentorship or any kind of schedule or program, but I can say that people who are interested in Free Energy Principle and studying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.817,
    "end": 3272.642,
    "text": " that have already a chance to get a wider scope, a wide intellectual scope, with insights from a number of different disciplines, biology, computational neuroscience, cognitive psychology, philosophy of mind, philosophy of biology, and that sort of thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3272.682,
    "end": 3275.243,
    "text": "So it seems to come with the discipline as it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.663,
    "end": 3279.464,
    "text": "I mean, the theory principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3280.489,
    "end": 3304.057,
    "text": " cool response and i liked how you grounded the paper and the presentation in the history and the philosophy of science because it is a community that enacts the conversation around the ideas and then when there is not a healthy dialogue it's kind of like the philosophers are sweeping up after the scientists or vice versa or they're just sort of spectators to each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.617,
    "end": 3328.285,
    "text": " but then we're almost moving towards a a fruitful bi-directional conversation that actually as you're pointing out with all the specific people who are taking this into their research approach it actually is something where the science and the philosophy are co-influencing each other so that's very interesting and special it's almost like it's such a big scientific idea",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.105,
    "end": 3332.227,
    "text": " and so challenging that we know that we need multiple expertises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.547,
    "end": 3335.408,
    "text": "We know that we're going to need to be working on it together for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.508,
    "end": 3343.552,
    "text": "And then that helps set the stage for something that might surprise people because it's not just coming from their camp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.192,
    "end": 3349.935,
    "text": "So we have history and philosophy, science, and then I guess another threat is math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3350.675,
    "end": 3364.461,
    "text": " mathematics um markov blankets as you pointed out came from pearl in the 1988 work and has been developed um a lot subsequently where does set or category theory come into this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3370.523,
    "end": 3372.385,
    "text": " Well, very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3374.886,
    "end": 3381.07,
    "text": "I think that, in some sense, it depends on your view, your perspective on mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.13,
    "end": 3387.054,
    "text": "So, if you are a satirical foundationalist in mathematics, if you are a mathematician who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3389.035,
    "end": 3401.185,
    "text": " who prays to the god of set theory every night in his loneliness, you naturally think that every kind of mathematical theory is based on set theory, and set theory has a general foundational rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3401.205,
    "end": 3406.489,
    "text": "There are other people who are ready to give this rule to the category theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3406.529,
    "end": 3414.435,
    "text": "But for me, because my engagement with these ideas come from a background of structural realism,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.818,
    "end": 3440.448,
    "text": " The main thing is that, and it has been owing to the wonderful works of Patrick Supes and Van Frossen, and philosophers of science came to, so rational reconstruction has been a program from the very beginning of the history of philosophy of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.03,
    "end": 3449.653,
    "text": " So philosophers, and again, it is why free energy principle is so interesting for me because of its great unificatory scope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.834,
    "end": 3461.558,
    "text": "And there have been philosophers of science, and there are still philosophers of science who think that the main job of philosophy of science is to form some ideas about unification of sciences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3461.758,
    "end": 3468.081,
    "text": "And in order to bring about this unification, philosophers taught of using",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.276,
    "end": 3474.88,
    "text": " logical, formal frameworks for state regimenting different theories from different disciplines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3474.92,
    "end": 3479.444,
    "text": "So, for example, in physics, people are using a special form of mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.644,
    "end": 3487.009,
    "text": "In biology, when they are using mathematics at all, they may use statistical theories or different forms of mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3487.55,
    "end": 3494.615,
    "text": "And they came to this idea that if we use some form of logic, some form of, for example, set theory, model theory,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3495.2,
    "end": 3505.828,
    "text": " We could have a cool mathematical framework that allows us to regiment different theories from different disciplines and clarify their relationship together and have a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3509.569,
    "end": 3523.893,
    "text": " well-stated, clear, neatly stated view of what's happening in the world, assuming that science provides a reliable picture of the world, if we could use model theory or set theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3524.294,
    "end": 3538.298,
    "text": "And the thing is that, and I stated this view in a book that has been published by Springer, Cognitive Structure and Realism, I begin to have doubts about the usefulness, or at least the realistic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.465,
    "end": 3544.608,
    "text": " impact of using set theory and model theory to represent the features of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3544.628,
    "end": 3561.861,
    "text": "So I become skeptical in the sense that I told that this set theory and model theory frameworks are too abstract and even if we could regiment the structure of sciences into this framework, we still couldn't account for scientific representation because these are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.029,
    "end": 3566.231,
    "text": " The set theory and category theory do not represent the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.311,
    "end": 3570.172,
    "text": "These are scientists who are representing the world using mathematical models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3570.733,
    "end": 3587.8,
    "text": "So I try to depart from the usual ways of scientific representation on the basis of set theory and model theory and invoke other sorts of mathematical frameworks that could provide a better match, a more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.51,
    "end": 3591.851,
    "text": " a congenial tool for accounting for scientific representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3591.891,
    "end": 3615.516,
    "text": "It was where I began to try to introduce some sort of information-theoretic framework, and not only information-theoretic framework, but embodied information-theoretic framework, meaning precisely the same sort of framework that Friston and colleagues are using in terms of approximate Bayesianism to regiment the structure of scientific theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.425,
    "end": 3620.146,
    "text": " I came to the idea that it allows us to have a more realistic account.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3620.246,
    "end": 3640.25,
    "text": "If we'd be able to regiment the structure of theories into this approximate Bayesian framework, for example, instead of set theory and model theory, we could provide a better understanding of the relationship between scientific theories, which are actually embedded in the brain of scientists, or at least in the scientific community and their target system in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.436,
    "end": 3649.12,
    "text": " where set theory and model theory are too abstract to take care of the job.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3650.061,
    "end": 3657.567,
    "text": "This kind of approximate Bayesianism is something that at least according to our best scientific theories is by default embodied in the brain of organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3658.068,
    "end": 3659.469,
    "text": "And in this sense, we could",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.529,
    "end": 3666.573,
    "text": " have scientific representation supervening the relationship between the organism and its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3667.013,
    "end": 3668.173,
    "text": "But it is another story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3668.193,
    "end": 3672.556,
    "text": "It is not directly related to this Markovian monism thing that I developed here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3672.816,
    "end": 3683.261,
    "text": "Well, it's super interesting because this embodied and enacted relational approach, we can't leave the scientist out of the picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.722,
    "end": 3685.963,
    "text": "So it's almost like we remove too much",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3686.463,
    "end": 3708.758,
    "text": " when we abstract that relationship away and then it almost hints towards that electron question from earlier which is well if your ontology or your model is just an electron not even the context you're going to be lost because you won't understand why certain things are happening to your system of interest and so how do we pull back rigorously",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.859,
    "end": 3734.617,
    "text": " and include enough context setting so that there is an ontology or a local logic that's making sense so it's just cool like how the historical thread and the philosophical thread it's not um spice or salt on the research like just adding it up it's actually something that is is um intertwined and and sets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3735.714,
    "end": 3738.096,
    "text": " the total scope of the scientific journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.176,
    "end": 3740.157,
    "text": "So it's like very cool to hear about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.177,
    "end": 3745.301,
    "text": "So if there's any other questions in live chat, we'll ask, but... Yeah, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.961,
    "end": 3750.345,
    "text": "Yeah, only with regard to a quick follow-up about the last point that you mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3750.385,
    "end": 3764.575,
    "text": "So part of it might be the contemporary philosophy of science, at least the dominant approach, which is structural realism, is that precisely as you mentioned, it leaves us, the human beings, out of the picture when it comes to scientific representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.615,
    "end": 3764.715,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3765.699,
    "end": 3783.387,
    "text": " there were a bunch of brilliant philosophers of science, such as Ronald Geary and, for example, Nancy Narcissian, who fortunately is still active, who tried to provide some sort of cognitive model of scientific practice itself, of scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.407,
    "end": 3793.232,
    "text": "But for some reasons, and I'm not sure about the reason, it has been pushed aside and it is not the dominant view of philosophy of science again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.181,
    "end": 3801.044,
    "text": " Part of my activity in philosophy of science was to bring this sort of cognitive approach back to the foreground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.605,
    "end": 3821.554,
    "text": "And I think that I was fortunate that I bumped up to this 300 principle and predictive processing, because in order to account for cognitive models of science, so sometimes we do not just want to sit in our arms and do philosophy of science, but want to support our philosophy of science by some actual scientific theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3822.194,
    "end": 3849.571,
    "text": " And in order to develop this cognitive models of science, cognitive approach to philosophy of science, it seems that free energy principle and predictive coding are fascinating tools because they allow us to provide a very cool and well-supported picture of the relationship between scientists who are basically organisms and the community of scientists, which could be specified in terms of, I don't know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3850.928,
    "end": 3861.017,
    "text": " Free energy principle, common theories of communication under free energy principle, the relationship between community of scientists on the one hand and their environment, the world on the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3861.117,
    "end": 3869.966,
    "text": "And I think that this picture is much more realistic than the ordinary, the orthodox picture of scientific representation that is fashionable these days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.751,
    "end": 3871.792,
    "text": " Yeah, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.832,
    "end": 3874.555,
    "text": "It's like a yes and with action and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.795,
    "end": 3876.977,
    "text": "So philosophy isn't just the armchair.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.197,
    "end": 3880.06,
    "text": "What does it look like to be embodied and inactive?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3880.6,
    "end": 3884.924,
    "text": "And then perhaps it looks like what is known by the career name of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.225,
    "end": 3889.549,
    "text": "But we know that learning and research happens inside of academia, outside of academia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.969,
    "end": 3892.171,
    "text": "So it is a more realistic picture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.291,
    "end": 3894.013,
    "text": "And here's a related question from the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3894.493,
    "end": 3895.334,
    "text": "Steven asks,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.275,
    "end": 3910.5,
    "text": " This ability to dissolve the internalist and externalist dualist position is a powerful part of Markovian monism, thus giving an open dynamical system the adaptive open boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.36,
    "end": 3912.701,
    "text": "Any thoughts on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.681,
    "end": 3915.122,
    "text": "Yeah, I completely agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3915.162,
    "end": 3919.103,
    "text": "So in the beginning, I told that I'm a great admirer of Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3919.203,
    "end": 3923.525,
    "text": "I think that it is a big step forward, and this is precisely because of this reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3924.2,
    "end": 3927.549,
    "text": " because it goes beyond this kind of orthodox dualism between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.624,
    "end": 3935.346,
    "text": " So here it is described as some sort of dualism between internal spaces and external spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3936.206,
    "end": 3948.81,
    "text": "And Friesen and colleagues put a lot of force and energy into developing this kind of information of geometries that, again, I think is a wonderful formal framework to model this idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.87,
    "end": 3956.592,
    "text": "So this is precisely, in my opinion, for what it is worth, this is precisely the valuable part of Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.532,
    "end": 3972.021,
    "text": " tries to use this kind of scientific model that goes beyond this dualism between internal spaces and external spaces to develop some sort of monism, metaphysical thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3972.061,
    "end": 3975.163,
    "text": "So I completely agree that this is a brilliant idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3975.203,
    "end": 3980.707,
    "text": "So the question is what sort of philosophical argumentation or scientific argumentation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.828,
    "end": 3985.91,
    "text": " could be offered to support this picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.95,
    "end": 3993.976,
    "text": "So I think that as it is, the status quo of this theory is not strong enough to carry the metaphysical weight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3994.056,
    "end": 4006.905,
    "text": "The question is, and as I said earlier, the paper aims to, comes with the hope to provoke the free energy principle theories to develop this idea, to develop Markovian monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4006.925,
    "end": 4007.025,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4007.529,
    "end": 4019.937,
    "text": " What sort of philosophical or scientific argumentation could be offered to support this insight that has been mentioned by Stephen and lies at the core of Markovian mode?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4020.037,
    "end": 4021.098,
    "text": "This is the main question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.279,
    "end": 4037.99,
    "text": " Awesome, so just in the last few minutes here, this paper came out one week ago, you probably wrote it several months before, but what are your next research questions or what are some exciting ongoing threads?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4038.03,
    "end": 4044.274,
    "text": "Like where do you go, let's say someone read this paper, where are you taking this frontier of thought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4045.701,
    "end": 4049.504,
    "text": " All right, again, cool idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.604,
    "end": 4058.39,
    "text": "So as we have already gathered, my mind is very disordered, and it is because I'm cursing several lines of research together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4058.43,
    "end": 4069.377,
    "text": "So part of my research, right, is to develop this kind of model-based understanding of Markovian monism to defense of modularity tests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4069.437,
    "end": 4072.599,
    "text": "It's not precisely the source of Fodorian modularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.985,
    "end": 4076.467,
    "text": " modularity that are defended by, for example, .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4077.227,
    "end": 4086.674,
    "text": "And I think that the model-based approach provide at least some grounds for defending this sort of modularity thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.315,
    "end": 4099.844,
    "text": "On the other hand, the other thing is that I feel that there is ample room for good metaphysical work on this free energy principle and free energy principle theory of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4101.205,
    "end": 4112.997,
    "text": " As you may know, there are already, so Markovian monism, for example, offers some sort of metaphysical realist reading of theory of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4113.478,
    "end": 4115.36,
    "text": "But there are also illusionists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.107,
    "end": 4122.656,
    "text": " of a theory of consciousness under free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4123.137,
    "end": 4132.891,
    "text": "And I think that for some reasons none of this provides a quite good metaphysical interpretation of theory of consciousness under free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4133.431,
    "end": 4135.292,
    "text": " So I'm developing another theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.352,
    "end": 4144.335,
    "text": "I'm trying to develop a theory of consciousness under a free energy principle that could be construed along the line of strong intentionalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.615,
    "end": 4152.298,
    "text": "And it is associated with historical works of Frantz Berantano and Tim Crane more recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4152.378,
    "end": 4160.581,
    "text": "So it is another line of research that I have in mind to associate this theory of consciousness with some sort of intentionalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.975,
    "end": 4177.342,
    "text": " And then again, I'm engaged with, as the paper may indicate, I'm looking for further grounds, for further reasons to develop or at least support this Markovian monism myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.422,
    "end": 4184.945,
    "text": "So as I say, this paper is just the first, the negative part of some sort of argument that has to be produced by others or myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4188.069,
    "end": 4197.414,
    "text": " I also am trying to, because I can see the appeal of this Markovian monism, so I try to find reasonable grounds for supporting this theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4198.034,
    "end": 4201.476,
    "text": "I'm not sure where does it go, but this is part of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.596,
    "end": 4202.637,
    "text": "It's an awesome approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.697,
    "end": 4205.698,
    "text": "A lot of times a critique, it's almost like consequentialism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4205.878,
    "end": 4212.181,
    "text": "Someone says, I don't like your outcome, so I'm going to look for all the details or say that it wasn't really a supported conclusion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4212.842,
    "end": 4214.502,
    "text": "And you're almost like saying, actually, I do...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4215.803,
    "end": 4232.896,
    "text": " see that goal or i see the benefits here and we just need to navigate in a slightly new way but we're going to be learning and connecting these ideas along the way because it isn't mapped how we're going to get to markovian monism and maybe that's not where we're going but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.991,
    "end": 4235.051,
    "text": " We're working towards it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.531,
    "end": 4245.694,
    "text": "I just get excited and caught you because it is related to another part of my research, which tries to relate free energy principle to theories of group knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.775,
    "end": 4251.976,
    "text": "I call it, for example, collective intentionality on the basis of free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.056,
    "end": 4261.759,
    "text": "So Freestone and Fierce have produced very fascinating theories of communication and social relation under free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4262.34,
    "end": 4274.18,
    "text": " And I think that this theory could be applied to developed parts of epistemology, social epistemology, and I think that there would be wonderful, wonderful results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4275.055,
    "end": 4292.464,
    "text": " It is natural for me to see this kind of scientific back and forth between different intellectuals as some sort of collaboration that consequential, as you phrased that masterfully, that hopefully leads to the growth of knowledge in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.331,
    "end": 4316.979,
    "text": " yes the individual in the armchair it lends ones toward it lends ones almost to neuro reductionism and individualism but when the person is walking around and at a conference and they're they're sharing their experience and they're learning and being surprised by by friends and colleagues then there really is something that's more like distributed cognition so i'll really look forward to seeing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.139,
    "end": 4320.661,
    "text": " Majid, thanks so much for this appearance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4320.681,
    "end": 4325.224,
    "text": "This was an epic and special first guest stream for our lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4326.044,
    "end": 4328.305,
    "text": "And you're always welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.385,
    "end": 4334.409,
    "text": "Just let us know if you have any other topics that you want to come on a stream with you or colleagues or students or anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4334.449,
    "end": 4338.672,
    "text": "We're always there to host and hold the space for this kind of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4338.792,
    "end": 4344.035,
    "text": "So again, thanks a lot for the research and I'm sure everyone really appreciated hearing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4345.15,
    "end": 4351.158,
    "text": " Thank you very much for having me and also cool work to do this Active Inference Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.178,
    "end": 4354.903,
    "text": "So good luck with that and very well done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4354.963,
    "end": 4356.805,
    "text": "And thank you very much for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.346,
    "end": 4357.606,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4357.726,
    "end": 4358.747,
    "text": "We'll be in touch.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4358.968,
    "end": 4359.949,
    "text": "So see you later, Majid.",
    "speaker": "SPEAKER_01"
  }
]