[
  {
    "start": 2.503,
    "end": 6.029,
    "text": " Hello and welcome to the Active Inference livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6.549,
    "end": 10.696,
    "text": "My name is Daniel Friedman and this is going to be a solo discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.656,
    "end": 14.717,
    "text": " If you're a new listener or not, welcome to Team Calm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 15.298,
    "end": 20.26,
    "text": "We are an experiment in online team communication and learning related to Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 20.72,
    "end": 30.104,
    "text": "You can find us on Twitter at inferenceactive, at activeinference at gmail.com, on Keybase via our public team, or at our YouTube channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.905,
    "end": 37.288,
    "text": "This is a recorded and archived livestream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.348,
    "end": 49.005,
    "text": " all backgrounds and perspectives are welcome here and also as far as video etiquette goes remember to mute if there's noise in the background raise your hand if you have a question and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.589,
    "end": 53.33,
    "text": " Here we are in ACT-INF Stream number 5.0.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.45,
    "end": 63.736,
    "text": "We're kind of exploring with the numbering system, so give us any feedback as far as what kinds of numbers or what kinds of shows might be helpful for your learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.376,
    "end": 70.259,
    "text": "But the goal for this discussion is to set the context for ACT-INF Stream 5.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.261,
    "end": 80.313,
    "text": " In 5.1, we're going to discuss the paper Multiscale Integration Beyond Internalism and Externalism by Ramstad et al. .",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.015,
    "end": 102.05,
    "text": " The goal of this video is really to contextualize some of the ideas, the historical threads, and the vocabulary that will help you either read or work with the Ramstad paper in terms of other fields that you might be more familiar with or just to sort of connect ideas and thus ground your understanding and your practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 102.47,
    "end": 109.776,
    "text": "So I come from a different background from the authors, so I have a slightly different perspective on perhaps even the implications of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.416,
    "end": 131.772,
    "text": " So the goal here is really just to explore that so that whether you listen to this by itself and you're looking to sort of see where active inference is trying to relate itself to other philosophical ideas, or whether you're coming from the active inference side and you want to understand some of the broader philosophical questions that are being addressed potentially by active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.192,
    "end": 134.894,
    "text": "In both those cases, I hope this is an interesting video for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.363,
    "end": 140.025,
    "text": " So here are a few of the topics that we'll be exploring here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.146,
    "end": 151.193,
    "text": "The first one is top-down and bottom-up causation, and that's gonna be an introduction to multi-level systems as well as thinking about causal modeling also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 153.112,
    "end": 165.445,
    "text": " Next, we'll talk about and raise some questions related to partitioning between internal and external cognition, which is certainly the wedge or the main issue that the Ramstad et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.505,
    "end": 167.307,
    "text": "paper is going to be focused on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.7,
    "end": 173.463,
    "text": " And then we'll talk about a few different perspectives on systems modeling and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.883,
    "end": 182.528,
    "text": "That's sort of action and inference, if you will, but there's also been a lot of philosophical thought on systems modeling as well as action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.628,
    "end": 187.952,
    "text": "So we can kind of see how those two fields might come together in the field called active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.972,
    "end": 193.915,
    "text": " And next time in number 5.1, we will all come together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 193.995,
    "end": 196.576,
    "text": "Everybody who wants to can always get in touch with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 196.736,
    "end": 209.423,
    "text": "We will all come together and discuss the paper to whatever extent we've read it, whatever we thought about it, any questions that we wanted to address, any of our background knowledge, any of our perspectives that we bring to the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.504,
    "end": 211.164,
    "text": "Those are all cool things to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.458,
    "end": 212.978,
    "text": " come about in 5.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.878,
    "end": 222.741,
    "text": "And if you're listening to this after 5.1 has happened, you can either listen to 5.1 or you could get in touch with us to be on a future discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.681,
    "end": 232.444,
    "text": "So next time in 5.1, we're going to be talking about the figures, the abstract, et cetera, in this paper by Ramsted et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.804,
    "end": 236.965,
    "text": "called Multiscale Integration Beyond Internalism and Externalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.145,
    "end": 239.006,
    "text": "And that's in the journal Synthes in 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.646,
    "end": 254.117,
    "text": " So the goal of that paper, and the only quotes from the paper that are going to be in this video are just from the introduction and the abstract, just so that we can ground the ideas more specifically in what Ramsted et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.557,
    "end": 255.438,
    "text": "framed their work as.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.298,
    "end": 259.541,
    "text": "So the goal of the paper in the author's words was,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.905,
    "end": 271.574,
    "text": " We focus on making explicit a description of the boundaries of cognitive systems that we think follows from taking seriously the inactive, embodied, and extended nature of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 272.875,
    "end": 282.384,
    "text": "This is the idea that the boundaries of cognitive systems are nested and multiple, and that with respect to its study, cognition has no fixed or essential boundaries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 283.561,
    "end": 283.821,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 284.322,
    "end": 292.107,
    "text": "I think that that is really exciting and also it doesn't necessarily bring the free energy principle or active inference on too heavily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.488,
    "end": 295.95,
    "text": "It just helps understand what is the broader goal of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 296.611,
    "end": 300.194,
    "text": "Well, the question that really excited me today was,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.894,
    "end": 304.697,
    "text": " this taking it seriously aspect on multiscale integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.117,
    "end": 309.9,
    "text": "It's the first two words of the paper's title, so maybe they're trying to signal with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 310.401,
    "end": 314.584,
    "text": "The story that we want to be working towards is multiscale integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 314.904,
    "end": 320.028,
    "text": "So linking things that are different spatial and temporal scales at once, multiscale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.828,
    "end": 323.67,
    "text": " How are we going to do that multiscale integration?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.171,
    "end": 332.538,
    "text": "Well, what they're provocatively stating in the title is that we must move beyond this debate of internalism versus externalism, which I'll contextualize soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.178,
    "end": 341.605,
    "text": "And the way that they're going to take it seriously is using a mathematical framework called free energy principle and its related process theory active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.065,
    "end": 348.251,
    "text": "So that's what taking it seriously looks like for them, especially drawing on their background as cognitive science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.031,
    "end": 352.873,
    "text": " uh, experts, they're really framing this as about multi-scale cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.673,
    "end": 359.576,
    "text": "And, uh, I came from a, not a cognitive sciences background, more of an evolutionary biology background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.117,
    "end": 369.922,
    "text": "And so multi-scale integration in the ant colony or in the insect brain or in the cell, there's a different set of philosophical baggage that comes along with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.342,
    "end": 378.426,
    "text": "Sometimes, um, if I could characterize it so, uh, clearly would be the focus on humans tends to focus on the experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.986,
    "end": 402.208,
    "text": " the internal view since we are humans so at the very least it's one of the ways that we can study emergence is by ourselves as an emergent process whereas in computers ant colonies the cell there's often a tendency following let's just say Dennett and others to imagine it as an automata or just sort of a robot and therefore devoid of experience or speculatively",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.768,
    "end": 407.17,
    "text": " sorry, speculatively having experience, but sort of on the sci-fi fringe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.39,
    "end": 410.792,
    "text": "And anyways, when you deal with the system, you have to be in that intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.332,
    "end": 420.696,
    "text": "So those types of systems tend to have perspectives that are devoid of agency, whereas human systems, the debate is just about that, is about our own agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.196,
    "end": 423.877,
    "text": "But we're all part of the same multi-scale integrated framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 424.017,
    "end": 427.259,
    "text": "And so we want to have a story that works for cells that are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.839,
    "end": 432.844,
    "text": " in our gut that are in our gut lumen, in the microbiome, why should it matter?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.884,
    "end": 440.412,
    "text": "Why should we have a different theory of biology for one side of that over the other, especially when we know that there's important transfer between them, for example?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 442.372,
    "end": 446.815,
    "text": " The authors took it seriously and they wrote this 2019 paper as well as other papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 447.276,
    "end": 454.601,
    "text": "I'm going to try to take this seriously from the work in biology that I have learned about over the years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.262,
    "end": 458.825,
    "text": "And that's what taking it seriously and contextualizing looks like to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.865,
    "end": 460.286,
    "text": "So I just thought I could start with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.803,
    "end": 471.73,
    "text": " Here's a paper from 2012 by Dennis Noble, who's a great systems biologist, called A Theory of Biological Relativity, No Privileged Level of Causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.21,
    "end": 491.603,
    "text": "So you can kind of see where he's going, which is taking the idea of relativity, whether that's gravitational relativity, something related to quantum mechanics, for example, or just intersubjective relativity, like focusing on the relations that define something or the interactions that define a person rather than an essentialist take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.323,
    "end": 505.335,
    "text": " So Noble is sort of taking a broad understanding of relativity and saying, well, if we really look at multiscale systems and spatial and temporal cause, then there's going to be this relativity principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.475,
    "end": 506.796,
    "text": "Maybe that could apply to biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 507.717,
    "end": 525.304,
    "text": " And what I like about his figure one, and I've added two rungs at the top, is that it really clearly phrases what he's arguing against, and also makes it clear how some of these logical errors become deployed in real systems, in real analyses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.486,
    "end": 532.887,
    "text": " Figure one is a model of causation for what's called upward causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.567,
    "end": 545.89,
    "text": "And the way to read this figure is it starts at the bottom with the smallest thing, which are genes, which here is just, I believe, being meant as a string of DNA, but that's a whole other discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 546.47,
    "end": 550.131,
    "text": "Let's just say that genes are able to cause",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.871,
    "end": 566.215,
    "text": " proteins and RNA, which are another scale of organization, bigger, moving up towards protein and RNA networks, up through cells, tissues, organs, organisms, social interactions, ecological, technological, governance, informational systems, and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 566.675,
    "end": 571.997,
    "text": "So this is a sort of multi-scale systems perspective, and the version of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 573.16,
    "end": 580.786,
    "text": " events that we often get is implicitly one of what Noble is characterizing accurately as upward causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 582.067,
    "end": 583.528,
    "text": "One could change the spatial metaphor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.669,
    "end": 584.809,
    "text": "It could be moving downwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.849,
    "end": 586.391,
    "text": "It could be moving inwards or outwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 587.612,
    "end": 601.423,
    "text": "But suffice to say that this is what we mean when we say upward causation is really from small things to big things, because the top-down things are often seen as big, and the things that are just on the fabric level of reality are often seen as small, rightly or wrongly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.404,
    "end": 603.505,
    "text": " And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 604.751,
    "end": 620.583,
    "text": " The story when you have this type of a upward causation model, again, that smaller things cause bigger things, is the genes are upstream of the behavior, or the cell damage is upstream of the organs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 620.984,
    "end": 629.45,
    "text": "So it makes sense, and there's also a related idea called supervenience that is that, is there a relationship between changing the smaller thing and the bigger thing changing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.75,
    "end": 634.234,
    "text": "So these are the kinds of questions that come up, and this is one direction of causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 634.954,
    "end": 648.46,
    "text": " However, what Noble ends up framing in this no privileged level of causation model is that, yes, there is influence or flow from so-called the upward direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.54,
    "end": 653.742,
    "text": "So that's the genes and going all the way up in influencing things that are at larger scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 654.263,
    "end": 658.665,
    "text": "But also in a very real and causal sense, there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 659.665,
    "end": 663.826,
    "text": " top-down causation that can be equally important for regulating the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.146,
    "end": 676.771,
    "text": "So even if in the short timescale the influence of the bottom-up is extremely strong, if there's no top-down force, sometimes any amount of bottom-up power can just cause the system to dissipate and therefore not exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.291,
    "end": 686.974,
    "text": "So in that sense, all systems that we observe continuing to dissipate energy, for example, like active inference foragers, informational foragers, humans, living creatures,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.674,
    "end": 692.797,
    "text": " we can really start to see that there has to be some sort of a top-down organizing force.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.197,
    "end": 696.559,
    "text": "Otherwise, it would be like a landslide or a lightning strike.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 696.679,
    "end": 697.9,
    "text": "It would just dissipate away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 698.5,
    "end": 712.689,
    "text": "So he says, look, because the top-down forces are so important and over evolutionary time end up shaping the parameters and the set of what is possible or functional at the lower level, it really needs to have an equal hand causally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.229,
    "end": 718.033,
    "text": " So we also need to look at this from a top-down, bottom-up perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.533,
    "end": 724.158,
    "text": "Lots of people have thought about these types of issues in systems theories and in other areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.019,
    "end": 734.266,
    "text": "But the three areas that I just want to emphasize here before bridging to active inference are that there's a continuum of larger and smaller things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 734.726,
    "end": 740.371,
    "text": "That has to basically be true because you can't have something bigger inside of something smaller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.972,
    "end": 754.879,
    "text": " And in the context of this debate that we're framing to get set up for, which is between internalism and externalism, you can think about things that are bigger as being more external and things that are smaller as being more internal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.199,
    "end": 760.042,
    "text": "So like the story about the smaller things is going into the organ, into the cells, into our cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.762,
    "end": 765.185,
    "text": "But the story going out is about the ecosystem or the constructed niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 765.365,
    "end": 766.866,
    "text": "And these are things that are external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.406,
    "end": 769.948,
    "text": " And so that's gonna come back later in the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 770.428,
    "end": 777.413,
    "text": "And then also as a consequence of that, there's this nestedness or this embeddedness to these different levels of analysis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.114,
    "end": 786.86,
    "text": "And there's again, many vocabularies for this type of recursive or embedded system, and hopefully we'll address some, but also feel free to provide feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.94,
    "end": 795.507,
    "text": "These are just some of the general aspects of multi-scale systems and some of the questions about multi-scale systems that the paper is going to address eventually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.107,
    "end": 802.672,
    "text": " and the field of research, but also there's some philosophical work from areas other than the inactive cognitive area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.653,
    "end": 803.893,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.054,
    "end": 817.124,
    "text": "So the next topic is going to be about partitioning between internal and external cognition, which is another way of saying what is the internalism versus externalism debate about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.284,
    "end": 818.765,
    "text": "How are we going to move beyond that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.166,
    "end": 821.468,
    "text": "How might the free energy principle be involved in that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.634,
    "end": 835.377,
    "text": " And in a sense, the question that this is asking is, how do we do causal modeling of situations where internal and external states interact, for example, through sense and action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.236,
    "end": 846.343,
    "text": " So let's think about how sense and action are interacting even at one level of analysis, what the ant perceives, for example, in its actions, what you perceive in its actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 846.963,
    "end": 854.208,
    "text": "And then immediately, one of the questions that many people have asked is, okay, so how do we make that story multi-level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 854.588,
    "end": 863.215,
    "text": "Because the ant, we could simulate it as just a robot with inputs and outputs and sort of black box inside, but it is also composed of the tissues and the cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.855,
    "end": 871.278,
    "text": " And it seems a little bit ridiculous if we would have to simulate from the cell up to the ecosystem level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.618,
    "end": 881.583,
    "text": "So we have to be able to separate that model somewhere, even if only for computational tractability or comprehensibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.103,
    "end": 888.726,
    "text": "So we got to make this trade-off between making causal models of systems that are at one level of analysis,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.366,
    "end": 894.508,
    "text": " But including things that are at a smaller level of analysis that can have consequences that bubble up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.948,
    "end": 899.209,
    "text": "For example, a drug binding to a receptor can bubble up to behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 899.649,
    "end": 901.65,
    "text": "That's like a story about upward causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.29,
    "end": 910.733,
    "text": "Or someone's choice or someone's context could dictate their physiology through any number of mechanisms which food or molecules are available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.273,
    "end": 922.878,
    "text": " So there is going to be times where that cross-level interaction is really important for the stories that we tell, for the narratives, how we understand the world, how we communicate about those things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.898,
    "end": 926.499,
    "text": "So how does the multi-level perspective relate to causal modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.92,
    "end": 930.681,
    "text": "If your story is about two people who are fighting, is the story only going to be at that level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.821,
    "end": 932.242,
    "text": "Or are you going to bring in society?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.402,
    "end": 934.263,
    "text": "Are you going to bring in the molecular stuff?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.043,
    "end": 941.806,
    "text": " How much upper and lower context do you provide for causal modeling at a given level of analysis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.188,
    "end": 950.751,
    "text": "How is causal modeling related to the possible actions of a system, also known as the adjacent possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.331,
    "end": 953.172,
    "text": "For example, what else could be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.732,
    "end": 962.477,
    "text": "And this just kind of reminds me of how when someone describes a near miss or a situation that could have been another way, they're not saying it could have been any, any other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.257,
    "end": 973.16,
    "text": " This thought experiment has been carried out by Gould and others in the sense that, yeah, something happened a certain way, which means it was permitted by reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.56,
    "end": 976.401,
    "text": "And then you're envisioning a slightly different scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.501,
    "end": 983.003,
    "text": "For example, the ball hits the other side of the roof and it ends up rolling down a different direction, doing some other outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.843,
    "end": 1000.465,
    "text": " and the ball still has the same physics and you're still the same person so it's not any alternate reality it's a very tightly constrained causal reality and what kinds of alternate realities do people propose or speculate about ones that are within the causal latent model of the world where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.125,
    "end": 1004.087,
    "text": " All stories where you cross the freeway are dangerous, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1004.607,
    "end": 1013.252,
    "text": "So that's the causal model that underlies what we generally are talking about when we're talking about what could happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.532,
    "end": 1014.773,
    "text": "We're not saying anything could happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.793,
    "end": 1019.716,
    "text": "We're saying a pretty tight model given about how we think about cause and effect in the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.396,
    "end": 1025.199,
    "text": "Why is causal modeling so important to active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.227,
    "end": 1051.163,
    "text": " and there's two roads into this i would say one perspective is why is causal modeling important from the point of view of the organism and another would be of the scientist or the observer so first from the point of the organism there's a lot of ways to frame exactly what it is an animal does and a really common area that people study this without the psycho",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1051.963,
    "end": 1054.644,
    "text": " baggage is in animal foraging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1054.905,
    "end": 1070.273,
    "text": "So whether it's a rodent or an ant, people or a bird, people are really interested in the bioenergetics and the decision-making that underlies how the animal goes about searching for food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.073,
    "end": 1086.563,
    "text": " and how does that depend on the dynamics of the ecosystem and so one popular framework in studying foraging is optimal foraging theory which you can just by the name of it imagine is kind of like optimal investing strategy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1086.903,
    "end": 1104.329,
    "text": " And there's a lot of variations on it, but it's just saying what the ant is trying to do or what the bird is trying to do is given the costs and the benefits or as estimated by the bird, the predicted costs and benefits of the environment and the processing time, it's going to do this reward maximization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1105.567,
    "end": 1123.596,
    "text": " and the good news about that approach is it often works a lot of times animals are near their predicted efficiency however other times it can be quite far off and it's not exactly apparent why that might be perhaps some constraint exists that was not modeled",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.076,
    "end": 1140.584,
    "text": " And so the reward maximization idea often succeeds or it captures a story or an important variable about a foraging system, as you might expect, but it doesn't really go the full way in explaining how the model is embodied or carried out by the animal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.044,
    "end": 1147.606,
    "text": " because it doesn't necessarily have the kind of computational processing that a human simulation might.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1148.066,
    "end": 1167.771,
    "text": "Not to compare the brain or the niche to a computer, but just to say that that, even as a physical computer imagined, is still something that's quite different than the models that are being used to study the error divergence by which ultimately people are going to be asking whether the strategy was optimal in terms of its reward or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.304,
    "end": 1175.471,
    "text": " What active inference does is it says, right, the overall reward model is intractable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1175.531,
    "end": 1184.101,
    "text": "It contains variables that are inaccessible or just not realistic for the nematode to be calculating, for example, in any way directly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.721,
    "end": 1186.463,
    "text": "But what the animal can be doing is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.344,
    "end": 1214.537,
    "text": " engaging in this cycle between action and perception and so it is making these sensory hypotheses about the world embodied through action so for example the eyes are circadian around very rapidly where are they moving they're moving to where your brain predicts that you need to resolve your uncertainty about your visual field most so that's why even though your actual visual resolution on your retina",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1215.197,
    "end": 1222.459,
    "text": " or the density of the cells, the ability to perceive the fine granularity of vision is quite different across the back of your eye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.879,
    "end": 1229.861,
    "text": "Yet the whole visual field, unless you have some sort of visual alteration, is uniformly clear and doesn't have a blind spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.061,
    "end": 1235.023,
    "text": "So that's evidence that at least visually we're in a generative model of what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.563,
    "end": 1241.305,
    "text": "And it shouldn't be too far away to say that that's what other animals are also having, at least visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1242.305,
    "end": 1246.328,
    "text": " with a total secondary question of whether it's experiential or not, but just visually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.089,
    "end": 1260.92,
    "text": "So active inference is a process theory that we can go into more another time that has to do with how organisms actually act in their ecological niche to resolve their uncertainty about the kinds of problems they actually need to resolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.36,
    "end": 1269.426,
    "text": "Therefore, framing things like foraging as a reward obtaining, but a precision maximization behavior sequence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.507,
    "end": 1273.009,
    "text": " And that framing turns out to have big implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1273.249,
    "end": 1275.491,
    "text": "So just wanted to frame it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1275.711,
    "end": 1290.623,
    "text": "As far as the scientist's active inference, the scientist also, from an informational perspective, has to think about which hypotheses they're experimenting or modeling with to reduce their uncertainty about what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1292.944,
    "end": 1314.293,
    "text": " just as in active inference where the generative model of the internal state the organism in this example the scientist the internal model includes a generative model of the latent causes in the world and understanding the latent causes better is what facilitates better action and also better experiments and hopefully clearer transmission as well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.612,
    "end": 1318.095,
    "text": " How does the Markov blanket idea come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1318.315,
    "end": 1319.377,
    "text": "What pierces the blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1319.777,
    "end": 1329.809,
    "text": "So here, any figure that you look at of the Markov blanket is going to have basically the active inference cycle with a Markov blanket superimposed down the middle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1330.229,
    "end": 1335.175,
    "text": "There's internal and external states, and then external states influence sensory states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1336.178,
    "end": 1338.179,
    "text": " Sensory states influence internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1338.72,
    "end": 1349.427,
    "text": "Internal states have their own autonomous or self-influencing dynamics, and through policy selection, end up implementing action states, for example, the movement of an arm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.047,
    "end": 1356.832,
    "text": "Action states influence the external states, the world states, for example, which are also, of course, involved in their own dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.372,
    "end": 1363.98,
    "text": " The Markov blanket is pierced on one side by sense coming in and by action on the other side going out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.5,
    "end": 1373.691,
    "text": "And then the whole multi-scale question is going to be about applying that Markov blanket all the way down idea, taking that seriously as far as cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.238,
    "end": 1383.122,
    "text": " One other area that I thought could be kind of interesting to relate this to would be like other partitioning problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.063,
    "end": 1391.388,
    "text": "And another partitioning problem that comes up in biological philosophy realms is this question of nature versus nurture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1392.188,
    "end": 1402.695,
    "text": "And here I would point people towards two pretty recent and excellent books on the left is beyond versus the struggle to understand the interaction of nature and nurture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.215,
    "end": 1409.821,
    "text": " by James Tabury, and then on the right, The Mirage of a Space Between Nature and Nurture by Evelyn Fox Keller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.601,
    "end": 1421.63,
    "text": "And they both have a different perspective on the same question, but in both cases, there's this idea of moving beyond the binary partitioning of nature and nurture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1421.73,
    "end": 1424.753,
    "text": "And so here in the Ramstead 2019 paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.474,
    "end": 1432.901,
    "text": " the framing of internalism and externalism, where they're sort of entering into this stack, is at the level of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.082,
    "end": 1434.443,
    "text": "It's about cognitive entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.004,
    "end": 1442.772,
    "text": "Whereas here's the partitioning problem in the area of genetics and in environmental and developmental studies, for example,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.473,
    "end": 1457.41,
    "text": " And here's an example of where similar internalism, internal is the genes, right, smaller things, or externalism, outside bigger things, the ecosystem is seen as bigger than the person with this implicit focused level of analysis on the individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1458.171,
    "end": 1462.276,
    "text": "And so just to draw on Evelyn Fox Keller's book,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1463.377,
    "end": 1481.241,
    "text": " She uses a metaphor of different kinds of tasks and how even if you just had two people, so the same type of agent, if you had two people building a brick wall together, you could at the end of the day say, well, this person added so and so many bricks and this person added the rest of the bricks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1481.661,
    "end": 1486.382,
    "text": "And so maybe you could say, well, 40% of the work on this wall was performed by that person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.142,
    "end": 1487.482,
    "text": "However,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.658,
    "end": 1494.204,
    "text": " Imagine a situation where two people are needed to hold a hose to fill up a bucket, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1494.824,
    "end": 1504.074,
    "text": "Even if one of the roles requires a specialty or more training or some other attribute, even in that case, that person can't do it alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1504.574,
    "end": 1509.019,
    "text": "So no matter how much water comes through that hose, and it's all water coming through the hose,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1510.08,
    "end": 1524.81,
    "text": " you're never going to be able to say, well, 80% of the water was due to person A and 20% was due to person B. So she uses that really clear metaphor to describe the relationship between nature and nurture, how they're obviously related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.87,
    "end": 1535.777,
    "text": "There is no such thing as a niche-free organism, especially when you think about this from an evolutionary ecology or ultimately active inference perspective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.477,
    "end": 1539.418,
    "text": " Organisms and their niche are what fitness is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.538,
    "end": 1542.719,
    "text": "That is what is being fit to what is the organism to their niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.239,
    "end": 1544.92,
    "text": "And you don't see things that aren't fit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1545.26,
    "end": 1549.582,
    "text": "So it's unsurprising that we're finally attuned to things in our niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.546,
    "end": 1564.316,
    "text": " Also, there was one interesting section in Mirage of a Space Between where she traces the linguistic origins of the framing nature versus nurture, because everyone has heard the phrase nature versus nurture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.496,
    "end": 1565.917,
    "text": "Is it nature or is it nurture?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1566.237,
    "end": 1568.319,
    "text": "Or it's in our DNA, it's in our nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1569.392,
    "end": 1573.42,
    "text": " How did things come to be in this versus sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1573.861,
    "end": 1577.328,
    "text": "That's also alluded to in the title of Taveri's book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.149,
    "end": 1581.015,
    "text": "And what Fox Keller writes is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1582.406,
    "end": 1602.856,
    "text": " Recently, a fashion has arisen for tracing the phrase nature and nurture and the debate with which that phrase is associated back to Shakespeare, or at least to Prospero in The Tempest, 1623, who writes off Caliban as uneducable, quoting Shakespeare, a born devil on whose nature slash nurture will never stick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.198,
    "end": 1605.099,
    "text": " Back to Fox Keller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1606.019,
    "end": 1613.384,
    "text": "Some have traced it further back to a monograph on children's education written by an Elizabethan pedagogue, Richard Mulcaster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1613.565,
    "end": 1618.988,
    "text": "Mulcaster's words were, nature makes boy towered, nurture sees him forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.949,
    "end": 1620.749,
    "text": "Maybe it rhymes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.801,
    "end": 1645.147,
    "text": " in another pronunciation it's from 1581 and then she concludes but in fact although both molcaster and shakespeare juxtapose the workings of nature and nurture neither invokes the term as an explicit conjunction so not an or they do not write of nature and nurture as such so they don't separate them and they don't um make them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.263,
    "end": 1647.664,
    "text": " contradistincted versus each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.305,
    "end": 1658.014,
    "text": "Indeed, when we look more closely at what they do write, we can see that their use of the two terms does not invite such a conjunction, for there is no presumption of an a priori disjunction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1659.335,
    "end": 1668.523,
    "text": " So what she's getting at there is there really is no need to do an argument against the concept of nature and nurture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.103,
    "end": 1672.966,
    "text": "It's kind of like writing a hit article on somebody who you disagree with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1673.727,
    "end": 1681.313,
    "text": "People who understand that there has to be a move beyond versus, beyond an oppositional framing of nature and nurture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.074,
    "end": 1698.492,
    "text": " those people should be and are making their positive arguments for why it should be framed a different way where the nature and the nurture are things that are pulled out or controlled for specifically and transparently in specific systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.153,
    "end": 1710.859,
    "text": " So that's an example about how the philosophy of science, for example, how we think about the partition between internal and external states of phenotype, relates to how we think about multi-scale systems overall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.2,
    "end": 1720.785,
    "text": "Because I think, okay, it reminds me so much of this internalism and externalism in cognitive sciences debate, reminds me a lot of this historical debate in genetics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1722.506,
    "end": 1722.706,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1724.986,
    "end": 1730.033,
    "text": " Next section, perspectives on systems modeling and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.533,
    "end": 1741.367,
    "text": "And here, the motivating question is about how do we carve nature at the joints, which is a quote attributed to Plato and the Phaedrus, allegedly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.288,
    "end": 1757.228,
    "text": " And the quote alludes to this idea that nature, whether one thinks that systems can be defined tightly and they're just on their own billiard ball trajectory, or whether one has a relational perspective where there's just these",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.169,
    "end": 1776.998,
    "text": " multi-level networks of relations and being and becoming whatever it is at some point we want to carve it at the joints because otherwise we're going to get swept up in the storm and people will often hold that that's not their position or that they don't want to carve systems at the joints but i think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.438,
    "end": 1786.141,
    "text": " If you're listening to this, I hope you can see that at some point, at least in action, you have to be dealing with nature at the joints, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1786.521,
    "end": 1787.601,
    "text": "Are they the right ones or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1787.761,
    "end": 1789.222,
    "text": "Isn't that the whole question?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1789.942,
    "end": 1794.344,
    "text": "So one thing that is a connection is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1795.885,
    "end": 1804.514,
    "text": " We can ask, how is the FEP, the free energy principle, or active inference going to help us frame this problem of carving nature at the joints?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.955,
    "end": 1809.6,
    "text": "This is kind of one of the big ideas from a philosophical perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1809.64,
    "end": 1816.186,
    "text": "It's about classification and about distinguishing things, whether it's objects or types of processes or ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1818.669,
    "end": 1823.67,
    "text": " distinguishing things, and those are part of nature, is part of philosophy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.11,
    "end": 1838.553,
    "text": "And so coming back to this essential question of carving nature at the joint and then asking, well, how can we use things like FEP, active inference, to frame the problem structurally to give us an ontology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.893,
    "end": 1845.234,
    "text": "And in fact, in the paper, they'll talk about an ontology and subsequent work also worked on ontologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.604,
    "end": 1848.485,
    "text": " So that's sort of the big motivation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.585,
    "end": 1856.747,
    "text": "It's why this quote is being brought up in the context of this paper we're about to discuss, because the whole point is about us carving nature at the joints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.247,
    "end": 1861.948,
    "text": "So let's go a little bit deeper into systems modeling and carving nature at the joints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.889,
    "end": 1871.831,
    "text": "And the question is, how are descriptive, we'll just call that type one, and action-oriented, type two, models related or different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1872.011,
    "end": 1875.132,
    "text": "And so just to explain what those one and two are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.752,
    "end": 1880.717,
    "text": " By descriptive model, I mean a system description only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.917,
    "end": 1885.743,
    "text": "And so two examples, just to sort of pin down the qualitative to quantitative spectrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1886.444,
    "end": 1894.834,
    "text": "The first mentioned here is to Bruno Latour's Actor Network Theory, or ANT, and it's an awesome piece of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.757,
    "end": 1912.971,
    "text": " maybe meta sociology, not sure exactly what Latour would call it, that just says the way to approach the system is by showing up, finding out what are the traces, and being open with respect to which actors are involved in which processes through which networks of influence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1913.672,
    "end": 1920.097,
    "text": "So it's a very unbiased description or moving towards unbiased, not to step into that sort of trap, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.638,
    "end": 1923.86,
    "text": " And then it's very qualitative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.96,
    "end": 1924.68,
    "text": "It's relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1924.841,
    "end": 1932.867,
    "text": "It's also about the observer's knowing and relationship with the system, not just the way that aspects of the system are associated with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1933.127,
    "end": 1939.372,
    "text": "So often those things are left out in quantitative or in some scientific worldviews.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1940.453,
    "end": 1951.804,
    "text": " And on the other end of the systems description only spectrum, I've pointed to a package of complex systems design tools called CADCAD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.944,
    "end": 1954.586,
    "text": "Now, CADCAD goes beyond systems description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1954.666,
    "end": 1961.292,
    "text": "It turns out to also be able to do things like simulation and other more dynamical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1962.213,
    "end": 1963.534,
    "text": " approaches like signal processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1964.014,
    "end": 1973.518,
    "text": "But what I mean by putting CAD-CAD here is that it can be used purely depictively to specify a complex system, especially one that's computational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.998,
    "end": 1990.165,
    "text": "So there might be a question when you're actually trying to model a organic ecosystem of how do you measure every single piece of the ecosystem and how many variables is enough to describe the fineness of the temperature gradient or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.825,
    "end": 1998.676,
    "text": " But when the simulation is about a digital system, it can be more deterministically and controllably simulated, if one can imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.137,
    "end": 2006.046,
    "text": "So there's one type of world modeling related to system description, but that obviously enables simulation and inference as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.233,
    "end": 2010.355,
    "text": " The second kind of models are action-oriented models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.675,
    "end": 2019.041,
    "text": "So action-oriented models are those where ultimately we're assigning meaning to states, voting with your feet, voting with your dollars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.862,
    "end": 2028.788,
    "text": "It's when we want to have effective action, or at least the system acts like it wants to, something like maybe what Dennett would call the intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.548,
    "end": 2039.77,
    "text": " So the descriptive modeling might be a question that you're asking the computer, like, given this scatter of points, which axes capture the most statistical variance?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.691,
    "end": 2045.292,
    "text": "And that would be just it running some sort of algorithm to find the maximum variance explained.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.772,
    "end": 2057.335,
    "text": "Whereas another type of algorithm, like more of a type two action oriented algorithm, might be learn the relationship between this input and the optimal performing behavior in the output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2057.735,
    "end": 2059.035,
    "text": "So that's what action oriented",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.455,
    "end": 2060.015,
    "text": " models are about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2062.837,
    "end": 2063.257,
    "text": "Next question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.417,
    "end": 2066.778,
    "text": "How does the multi-level perspective influence our answers above?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2067.458,
    "end": 2078.063,
    "text": "So if we're going to have a story where there's nature's being carved at its joints, maybe around the Markov blankets, maybe with sense coming in and action coming out, even if we have that at one level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.443,
    "end": 2081.544,
    "text": "So we have an agent-based model of the ants that are bumping into each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.644,
    "end": 2084.366,
    "text": "And at one level, the sense of one is the action of another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.646,
    "end": 2086.667,
    "text": "And so we have a sort of bumper car model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.827,
    "end": 2091.149,
    "text": " Where does the multilevel perspective come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.809,
    "end": 2094.23,
    "text": "And that's kind of thinking about the bumper car one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.39,
    "end": 2104.895,
    "text": "It's where you would model first the cars bumping into each other and then you could go into the engine or you could go out to the power grid and to the people who are riding on the bumper cars or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.515,
    "end": 2113.399,
    "text": "So how are we going to deal with the complexity of causal stories, relationships, some of which might be really important?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2114.459,
    "end": 2120.264,
    "text": " like the example of a molecule that binds to a receptor, others which might be spurious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.804,
    "end": 2127.19,
    "text": "And the reality is that because of the combinatorics, most of the options across levels will be spurious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.91,
    "end": 2135.556,
    "text": "So most of the ecological relationships can't be, for example, one-to-one because there's so many that are just bumping into each other all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.317,
    "end": 2137.739,
    "text": " Just to give one example from ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2138.199,
    "end": 2140.122,
    "text": "So how are we going to carve nature at its joints?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2140.542,
    "end": 2141.203,
    "text": "Do it cleanly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.343,
    "end": 2143.266,
    "text": "Are we trying to represent stuff like one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.386,
    "end": 2144.948,
    "text": "Are we trying to act like two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.508,
    "end": 2147.811,
    "text": "Do one and two fall out as a function of doing one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.452,
    "end": 2152.277,
    "text": "Do we get one and two as a function of falling out just two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.295,
    "end": 2158.078,
    "text": " How does emergence and emergent properties fit into all of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.598,
    "end": 2173.349,
    "text": "So by emergence or emergent properties, people often mean a sort of system outcome where there's some property or a characteristic or attribute that is arising at a higher level, again, bigger,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2174.23,
    "end": 2180.757,
    "text": " broader spatial and temporal scales based upon interactions or some sort of interfacing of the smaller level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2181.358,
    "end": 2190.528,
    "text": "So sometimes these emergent properties, using the classification here of Bedal, are in the weak category and in the strong category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2190.608,
    "end": 2195.573,
    "text": "It's not the only way to break down emergence, not the only take here, but I find this one pretty helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.314,
    "end": 2199.578,
    "text": " First, strong emergence, Badao equates with basically magic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2199.838,
    "end": 2214.194,
    "text": "You can read the papers more if you want to explore more nuance, but the strong emergence is from something that's totally disjoint to something that has a total integrity like language or awareness, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2214.855,
    "end": 2217.156,
    "text": " And then weak emergence is contrasted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.276,
    "end": 2227.883,
    "text": "And that's most of the physical systems where even if the relationships between subunits are really nuanced or the computational capacity required to simulate, the system would be extreme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2229.068,
    "end": 2233.089,
    "text": " those systems are still weakly emergent in that it still just is ants bumping into each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.369,
    "end": 2245.052,
    "text": "Now they're developing and that's sort of crazy and evolution shapes that and everything, but still we're talking about a physical system, not in the genre, for example, of awareness arising spontaneously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.213,
    "end": 2253.015,
    "text": "So how is that going to play into the discussion with active inference showing up on the scene?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.235,
    "end": 2255.175,
    "text": "Where will this relate to emergence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2255.435,
    "end": 2258.116,
    "text": "These are things anyone's welcome to chime in on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.103,
    "end": 2271.207,
    "text": " Also, we can tie the idea of emergence and the multi-scale systems approach to this debate that we often hear about reductionism versus holism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.488,
    "end": 2281.792,
    "text": "So reductionism is simply a method of explanation where bigger things are made sensitive by appeals to the properties of their smaller things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.952,
    "end": 2288.734,
    "text": " The bigger wall is orange because each of the smaller pixels is orange or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.874,
    "end": 2293.316,
    "text": "There's a variety of reductionist explanations, and it's just one of our hands.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.356,
    "end": 2295.056,
    "text": "It's one of our approaches or our wings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2295.577,
    "end": 2298.538,
    "text": "Holism is kind of flipping that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.738,
    "end": 2305.442,
    "text": " schema of reductionism saying actually smaller things are made sense of in terms of the bigger thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.323,
    "end": 2310.565,
    "text": "And that is kind of the opposite edge viewpoint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.625,
    "end": 2320.372,
    "text": "And so we have some sliding toward a holistic understanding, some sliding towards a reductionist understanding, a lot of philosophical work in this area and the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2321.274,
    "end": 2332.988,
    "text": " thing that we would just want to note here would just be first ask continually, how is the free energy principle or active inference relating to reductionism versus holism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2333.388,
    "end": 2340.016,
    "text": "Because sometimes it may feel like there is a sort of a philosophy of science shift",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.386,
    "end": 2343.907,
    "text": " associated with taking on the active inference framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2344.287,
    "end": 2347.147,
    "text": "And so what are the implications of taking that seriously?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.227,
    "end": 2349.548,
    "text": "Where does that put this reductionism versus holism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2349.988,
    "end": 2358.89,
    "text": "Is it going to be put into a similar bin as nature versus nurture, as kind of a turn of phrase or a false dichotomy that was just eventually seen through?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2359.631,
    "end": 2364.612,
    "text": "Or will there be people who still think that that sort of binary phrasing, whichever side they find themselves on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.612,
    "end": 2367.312,
    "text": " is going to be appropriate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.432,
    "end": 2371.633,
    "text": "And again, this is where Dennis Noble's work on the bottom up and top down is related.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2372.793,
    "end": 2379.435,
    "text": "The other work here is Gödel Escher Bach, which is the 1979 book by Douglas Hofstetter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.155,
    "end": 2390.637,
    "text": "And here's one of the figures from the book where it says Mu, Mu, I don't know how you'd say it, which is a, allegorically at least, a sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.897,
    "end": 2416.888,
    "text": " innovative response or a canonical response depending on who you ask of a Zen koan and Zen is a topic that's brought up in the book and the M is written of letters that are containing smaller letters that say reductionism and then the U is made up of letters that spell out the other words so it's kind of this multi-scale thought loop really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.129,
    "end": 2429.779,
    "text": " captures the spirit of the book well, and also captures, at least informally, through art, as often is the case, what it looks like to go beyond the reductionism versus holism debate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.839,
    "end": 2435.103,
    "text": "So first, if only in a text illustration, but then eventually, how does that relate to a computer screen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2435.464,
    "end": 2437.605,
    "text": "How about a person interacting with a computer screen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.946,
    "end": 2440.388,
    "text": "How about two people interacting with their computer screens?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.886,
    "end": 2444.767,
    "text": " All right, a few more perspectives on systems modeling and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2445.447,
    "end": 2448.628,
    "text": "How is world modeling related to pragmatics and action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.388,
    "end": 2453.689,
    "text": "So the questions to ask here is really, is there a best map of the territory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.13,
    "end": 2456.03,
    "text": "Short answer, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.97,
    "end": 2467.793,
    "text": "And this is true for geospatial maps, as well as fields of affordances, which we talked about in the previous ACT-M streams, which also often demand to be mapped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.113,
    "end": 2470.834,
    "text": "For example, skill set mappings or concept mappings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.474,
    "end": 2486.688,
    "text": " So there's a lot to say about map and territory, of course, but for here, it suffices to say that the best map is defined by the mission, by the context, by the degree of certainty, by all these other features and factors related to the user and the situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.128,
    "end": 2491.712,
    "text": "So we're talking about making maps of meaning, maps for the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.113,
    "end": 2497.257,
    "text": "We're talking about doing world modeling for effective inference and action, as we were talking about previously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2498.118,
    "end": 2518.612,
    "text": " so here's just one quote from the paper to motivate you towards the things that you might be able to hear them expand more on they write the multi-scale free energy principle model allows us to cast the boundaries of cognition as assembled and maintained in an informational dynamics across multiple spatial and temporal scales",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.855,
    "end": 2529.022,
    "text": " Crucially, we shall show that this multi-scale application of the FEP implies both ontological and methodological pluralism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.103,
    "end": 2543.133,
    "text": "So if you thought questions whether this is before or after reading the paper, you could ask, is the free energy principle pluralistic with respect to non-free energy principle theories or frameworks or principles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.578,
    "end": 2549.862,
    "text": " which levels or types of theory is the FEP consistent or discordant with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.243,
    "end": 2557.889,
    "text": "And one starting point there would be searching for Carl Fristen's interview in the 2018 Alias Bulletin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.95,
    "end": 2563.853,
    "text": "And it's an interesting question to ask about any theory is, okay, well, who is this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2564.614,
    "end": 2587.694,
    "text": " changing the mind of or what is the opposite of this theory and is it true or does anyone hold the true opposite of this theory does anyone hold a 50 opposite is it 50 by outcome or is it 50 by axiom in that they diverge so you can always ask that and i found that that was a very um interesting route to go down as far as the fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2589.611,
    "end": 2593.856,
    "text": " Another quote from the paper is just because it's such a direct claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.477,
    "end": 2595.918,
    "text": "Our claim is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.17,
    "end": 2607.9,
    "text": " which among these, which are the situated barriers of cognitive systems, which among these are the most relevant will depend on the phenomena being studied and the explanatory interests of researchers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2608.521,
    "end": 2618.911,
    "text": "And so there's a few notions like Markov blanket, which we talked about earlier, is that sense and action piercing that's related to ecological psychological concepts as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.013,
    "end": 2621.153,
    "text": "The",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2622.839,
    "end": 2626.542,
    "text": " Markov blankets are defined in a few different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.722,
    "end": 2633.788,
    "text": "They're defined by statistical co-variations, but one type of those is going to be causal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2634.549,
    "end": 2637.992,
    "text": "And also another type of those could be like a measurement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2638.572,
    "end": 2651.082,
    "text": "And so the kinds of measurements that we make, the types of causal relationships that are important, and then which models we apply to them is going to depend on what is enacted by the researchers, because they're also part of embodied and encultured cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2652.663,
    "end": 2656.745,
    "text": " Briefly, what are methodological and ontological pluralism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2656.865,
    "end": 2663.287,
    "text": "Methodological pluralism means using a variety of methods or ways of doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.968,
    "end": 2669.95,
    "text": "Ontological pluralism means having a variety of ontologies or ways of knowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.934,
    "end": 2674.177,
    "text": " And pluralism is referring to there being multiple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2674.758,
    "end": 2682.945,
    "text": "Now, there are other schools of thought that are sort of higher order than pluralism as to how do you cut through that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.085,
    "end": 2694.316,
    "text": "Is it just theory anarchy like Farabend suggested where the pluralism can just be taken to this extreme equivalent to almost a novelty search in theory space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.854,
    "end": 2705.145,
    "text": " Or is there going to be some way to cut through that and determine which of the pluralistic options or possibilities or actualities is preferable?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.465,
    "end": 2707.027,
    "text": "Because ultimately we do have to act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.107,
    "end": 2708.429,
    "text": "That's that type two type of model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.273,
    "end": 2719.163,
    "text": " So ask yourself for direct action or for more philosophical topics, what is utilitarianism or pragmatism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.663,
    "end": 2721.946,
    "text": "How do such ideas relate to pluralism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2722.546,
    "end": 2732.076,
    "text": "So it's one thing to say we're scientists and whichever level of analysis is most relevant, well, that's going to depend on what we're studying and what we're interested in explaining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.757,
    "end": 2733.798,
    "text": " But should it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.238,
    "end": 2737.04,
    "text": "Is that really the best way to approach these systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.761,
    "end": 2760.259,
    "text": "Should we really, knowing that we can never remove, for example, individual bias, but still wanting to model systems so that we can act effectively, how are we going to balance just this sort of ruthless utilitarianism, pragmatism, whatever ends justify the means, whatever preconceived worldview, whatever your Bayesian prior is, just stick with that no matter what happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.859,
    "end": 2765.601,
    "text": " How is that related to cutting through the noise of pluralism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.963,
    "end": 2770.964,
    "text": "These are again just questions to raise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.184,
    "end": 2777.307,
    "text": "In active inference, how are ideas related to action and what kind of ideas or mental states are there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.187,
    "end": 2782.85,
    "text": "There's a few kind of interesting categories that we perceive at least experientially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2783.832,
    "end": 2790.215,
    "text": " various schools of thought on that, but where are we going to fit these into the active inference framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2790.295,
    "end": 2796.558,
    "text": "Are those just different loops in our generative model, things like emotion or desires or dreams or secrets?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2797.099,
    "end": 2800.6,
    "text": "Where are those going to fit into this active inference framework?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2800.68,
    "end": 2804.462,
    "text": "How integrated is that going to be across types of ideas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2806.983,
    "end": 2809.625,
    "text": "And how are our conserved or novel ideas",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.368,
    "end": 2818.67,
    "text": " respectively meaning orthodoxy or heterodoxy, associated with the expression of conserved or novel actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2818.95,
    "end": 2821.431,
    "text": "So that is orthopractice or heteropractice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.451,
    "end": 2831.493,
    "text": "And linking that to active inference, which is kind of just framing this two-stroke engine or this continual OODA loop, a lot of ways to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.993,
    "end": 2835.474,
    "text": "It's just framing this continual flow between action and inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.714,
    "end": 2836.975,
    "text": "So how are those two linked?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2837.015,
    "end": 2837.995,
    "text": "Here's another way of asking it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.035,
    "end": 2846.438,
    "text": " And just to conclude with two books to study how this has been studied from a philosophy of science perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.238,
    "end": 2851.68,
    "text": "On the right is Scientific Pluralism, edited by Keller, Longino and Waters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.82,
    "end": 2859.243,
    "text": "And then on the left is a book called Studying Human Behavior, How Scientists Investigate Aggression and Sexuality by Helen Longino.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2860.183,
    "end": 2873.109,
    "text": " And these books talk about the question of pluralism in science and different ways that people have sort of cut through the massive theories or not or contributed to it, I guess, in some cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.909,
    "end": 2876.09,
    "text": "And there's just a really interesting body of thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.21,
    "end": 2885.414,
    "text": "And so it's useful to think for people who are in the free energy space as well as from the outside, what are the bridges that link",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.874,
    "end": 2891.88,
    "text": " what's happening with the free energy principle and active inference to more classical philosophy of science questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2892.4,
    "end": 2904.252,
    "text": "And so hopefully in the Fierstein-Alias paper from 2018 and also some other excellent work from the last few years, we'll come to a better understanding of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2906.547,
    "end": 2909.929,
    "text": " Thanks for participating, which I guess was me and you as the listener.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.73,
    "end": 2919.837,
    "text": "We will provide a follow-up form to live participants, and we would welcome any feedback, suggestions, questions you have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.777,
    "end": 2924.32,
    "text": "And yeah, stay in communication with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.62,
    "end": 2932.866,
    "text": "So thanks again for listening, and we hope to either see you at 5.1 or at a future discussion.",
    "speaker": "SPEAKER_00"
  }
]